#Область ВходящиеHTTPЗапросы

Функция getDuty(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);  
	
	ПараметрыВходногоЗапроса = ИнтеграцияREST.ПолучитьПараметрыHTTPЗапроса(Запрос);
	
	Попытка                               
	
		ДатаДежурства = Запрос.ПараметрыЗапроса.Получить("date");
		
		ДатаДежурства = ?(ЗначениеЗаполнено(ДатаДежурства), 
			Дата(Сред(ДатаДежурства, 7, 4), Сред(ДатаДежурства, 4, 2), Лев(ДатаДежурства, 2)), 
			ТекущаяДатаСеанса());
		
		ГрафикДежурства = ПолучитьГрафикНаДату(ДатаДежурства);
		
		Возврат
			?(ЗначениеЗаполнено(ГрафикДежурства), 
				ЗаписатьНТТPОтвет(ПараметрыВходногоЗапроса, ГрафикДежурства),
				ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, СтрШаблон("График дежурств на %1 не определен", Формат(ДатаДежурства, "ДФ=dd.MM.yyyy;"))));  
	
	Исключение
		Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецФункции

Функция getDeliveryVariants(Запрос) 
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Попытка
		ПараметрыВходногоЗапроса = ИнтеграцияREST.ПолучитьПараметрыHTTPЗапроса(Запрос);   
		
		ВходныеДанные = ИнтеграцияREST.ПолучитьТелоHTTPЗапроса(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
		Если Не ВходныеДанные.Результат Тогда
			Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, ВходныеДанные.Тело);
		КонецЕсли;
		
		ВходныеДанныеСтруктура = ДанныеЗапросаgetDeliveryVariants(ВходныеДанные.Тело);     
		Если Не ВходныеДанныеСтруктура.Результат Тогда
			Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, ВходныеДанныеСтруктура.ДанныеЗапроса);
		КонецЕсли;              
		
		ПолучениеТарифовИнтервалов = ПолучитьТарифыИнтервалыДоставки(ВходныеДанныеСтруктура.ДанныеЗапроса);
			
		Если ПолучениеТарифовИнтервалов.Результат Тогда                                         
			Возврат ЗаписатьНТТPОтвет(ПараметрыВходногоЗапроса, ПолучениеТарифовИнтервалов);    
		Иначе                           
			Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, ПолучениеТарифовИнтервалов.Сообщение);			
		КонецЕсли;
	
	Исключение
		Возврат ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));			
	КонецПопытки;	 
	
КонецФункции

#КонецОбласти

#Область ДействияHTTPЗапросы

Функция ЗаписатьНТТPОтвет(ПараметрыВходногоЗапроса, РезультатЗапроса)   
	
	Ответ = Новый HTTPСервисОтвет(200);   
	Ответ.Заголовки = УстановитьHTTPЗаголовки();
	
	ЗаписьJSON = Новый ЗаписьJSON;   
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);

	ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("error");
		ЗаписьJSON.ЗаписатьЗначение(Ложь);
		
		ЗаписатьHTTPГрафикДежурств(ПараметрыВходногоЗапроса, ЗаписьJSON, РезультатЗапроса);
		ЗаписатьHTTPТарифыИнтервалыДоставки(ПараметрыВходногоЗапроса, ЗаписьJSON, РезультатЗапроса);

	ЗаписьJSON.ЗаписатьКонецОбъекта();			
		 
	СтрокаJSON = ЗаписьJSON.Закрыть();   
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	Возврат Ответ; 
	
КонецФункции	

Процедура ЗаписатьHTTPГрафикДежурств(ПараметрыВходногоЗапроса, ЗаписьJSON, РезультатЗапроса)  
	
	Если ПараметрыВходногоЗапроса.ТипЗапроса <> "getDuty" Тогда 
		Возврат;
	КонецЕсли;   
	
	ЗаписьJSON.ЗаписатьИмяСвойства("data");
	ЗаписьJSON.ЗаписатьНачалоМассива();

		Для Каждого СтрГрафик Из РезультатЗапроса Цикл
			
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
				ЗаписьJSON.ЗаписатьИмяСвойства("name");
				ЗаписьJSON.ЗаписатьЗначение(Строка(СтрГрафик.name));
				
				ЗаписьJSON.ЗаписатьИмяСвойства("phone");
				ЗаписьJSON.ЗаписатьЗначение(Строка(СтрГрафик.phone));
				
				ЗаписьJSON.ЗаписатьИмяСвойства("branch");
				ЗаписьJSON.ЗаписатьЗначение(Строка(СтрГрафик.filial));
				
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЦикла;

	ЗаписьJSON.ЗаписатьКонецМассива();
	
КонецПроцедуры        

Процедура ЗаписатьHTTPТарифыИнтервалыДоставки(ПараметрыВходногоЗапроса, ЗаписьJSON, РезультатЗапроса)  
	
	Если ПараметрыВходногоЗапроса.ТипЗапроса <> "getDeliveryVariants" Тогда 
		Возврат;
	КонецЕсли;   
	
	ЗаписьJSON.ЗаписатьИмяСвойства("data");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();       

		ЗаписьJSON.ЗаписатьИмяСвойства("max_delivery_date");
		ЗаписьJSON.ЗаписатьЗначение(Формат(РезультатЗапроса.МаксимальнаяДатаДоставки, "ДФ=dd.MM.yyyy"));
	
		ЗаписьJSON.ЗаписатьИмяСвойства("tarrifs");
		ЗаписьJSON.ЗаписатьНачалоМассива();

			Для Каждого Тариф Из РезультатЗапроса.Тарифы Цикл
				
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
					ЗаписьJSON.ЗаписатьИмяСвойства("id");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Тариф.Тариф));
				
					ЗаписьJSON.ЗаписатьИмяСвойства("name");
					ЗаписьJSON.ЗаписатьЗначение(Строка(Тариф.Тариф));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("delivery_name");
					ЗаписьJSON.ЗаписатьЗначение(Строка(Тариф.ТипДоставки));

					ЗаписьJSON.ЗаписатьИмяСвойства("price");
					ЗаписьJSON.ЗаписатьЗначение(Тариф.СтоимостьДоставки); 

					ЗаписьJSON.ЗаписатьИмяСвойства("intervals");
					ЗаписьJSON.ЗаписатьНачалоМассива();
						
						ИнтервалыТарифа = РезультатЗапроса.Интервалы.НайтиСтроки(Новый Структура("Тариф", Тариф.Тариф));
						Для Каждого Интервал Из ИнтервалыТарифа Цикл    
							
							ЗаписьJSON.ЗаписатьНачалоОбъекта();
							
								ЗаписьJSON.ЗаписатьИмяСвойства("id");
								ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Интервал.Интервал));
								
								ЗаписьJSON.ЗаписатьИмяСвойства("name");
								ЗаписьJSON.ЗаписатьЗначение(Строка(Интервал.Интервал)); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("label");
								ЗаписьJSON.ЗаписатьЗначение(Интервал.ИнтервалНаименованиеНаСайте); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("active");
								ЗаписьJSON.ЗаписатьЗначение(Интервал.Доступно); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("from");
								ЗаписьJSON.ЗаписатьЗначение(Час(Интервал.ВремяС)); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("to");
								ЗаписьJSON.ЗаписатьЗначение(Час(Интервал.ВремяПо)); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("range");
								ЗаписьJSON.ЗаписатьЗначение((Интервал.ВремяПо - Интервал.ВремяС) / 3600); 
								
								//ЗаписьJSON.ЗаписатьИмяСвойства("week_day");
								//ЗаписьJSON.ЗаписатьЗначение(Интервал.ДеньНедели); 
								
								ЗаписьJSON.ЗаписатьИмяСвойства("unloading");
								ЗаписьJSON.ЗаписатьЗначение(Интервал.ДоступноРазгрузка); 
								
							ЗаписьJSON.ЗаписатьКонецОбъекта();
							
						КонецЦикла;  
						
						ЗаписьJSON.ЗаписатьКонецМассива();
					
				ЗаписьJSON.ЗаписатьКонецОбъекта();
			КонецЦикла;

		ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
КонецПроцедуры

Функция ЗаписатьHTTPОшибку(ПараметрыВходногоЗапроса, ТекстОшибки = "", Статус = 400)
	
	Ответ = Новый HTTPСервисОтвет(Статус);
	Ответ.Заголовки = УстановитьHTTPЗаголовки();		
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	ЗаписьJSON.ЗаписатьЗначение(Истина);	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("response");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("status");
		ЗаписьJSON.ЗаписатьЗначение(Статус);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("description");
		ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки); 
		
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();  
	
	СтрокаJSON = ЗаписьJSON.Закрыть();    

	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);	
	Возврат Ответ; 
	
КонецФункции  

Функция УстановитьHTTPЗаголовки()   
	
	 Заголовки = Новый Соответствие;
	 Заголовки.Вставить("Content-Type", "application/json");
	 Заголовки.Вставить("charset", "utf-8");
	 Возврат Заголовки 
	 
 КонецФункции 
 
 #КонецОбласти
 
 #Область ОбработкаВходныхЗапросов  
  
Функция ПолучитьГрафикНаДату(НаДату = Неопределено)
	
	НаДату = ?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДата());
	
	График = Новый ТаблицаЗначений();
	График.Колонки.Добавить("duty_date");
	График.Колонки.Добавить("filial");
	График.Колонки.Добавить("name");
	График.Колонки.Добавить("phone");
	
	ОбозначенияФилиалов = Новый ТаблицаЗначений();
	ОбозначенияФилиалов.Колонки.Добавить("Обозначение");
	ОбозначенияФилиалов.Колонки.Добавить("Филиал");
	Стр1 = ОбозначенияФилиалов.Добавить();
	Стр1.Обозначение = "а";
	Стр1.Филиал = "Центральная база";
	Стр2 = ОбозначенияФилиалов.Добавить();
	Стр2.Обозначение = "б";
	Стр2.Филиал = "Выбор";
	Стр3 = ОбозначенияФилиалов.Добавить();
	Стр3.Обозначение = "с";
	Стр3.Филиал = "Барнаул";
	Стр4 = ОбозначенияФилиалов.Добавить();
	Стр4.Обозначение = "д";
	Стр4.Филиал = "Бийск";
	Стр5 = ОбозначенияФилиалов.Добавить();
	Стр5.Обозначение = "з";
	Стр5.Филиал = "Документооборот";     
	Стр6 = ОбозначенияФилиалов.Добавить();
	Стр6.Обозначение = "м";
	Стр6.Филиал = "Майма";
	
	СтруктураГрафикаНаДату = ПолучитьСтруктуруГрафикаНаДату(НаДату);
	
	Если Не ЗначениеЗаполнено(СтруктураГрафикаНаДату) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаДатуДень = День(НаДату);
		
	Для Каждого ДежурстваСотрудника Из СтруктураГрафикаНаДату Цикл
		
		ОбозначенияДежурств = ДежурстваСотрудника["Примечание" + НаДатуДень];
		СписокФилиалов = "";
		
		Для НомерСимвола = 1 По СтрДлина(ОбозначенияДежурств) Цикл
			
			ТекущийСимвол = Сред(НРег(ОбозначенияДежурств), НомерСимвола, 1);
			ОбозначениеФилиала = ОбозначенияФилиалов.Найти(ТекущийСимвол, "Обозначение");
			
			Если ЗначениеЗаполнено(ОбозначениеФилиала) Тогда
				СписокФилиалов = СписокФилиалов + ?(ЗначениеЗаполнено(СписокФилиалов), ", ", "") + ОбозначениеФилиала.Филиал;	
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СписокФилиалов) Тогда
		
			СтрГрафик = График.Добавить();
			СтрГрафик.duty_date = Формат(НаДату, "ДФ=dd.MM.yyyy");
			СтрГрафик.filial = СписокФилиалов;
			СтрГрафик.name = ДежурстваСотрудника.Сотрудник;
			
			Телефон = "Нет телефона";
			Телефон = ?(ЗначениеЗаполнено(ДежурстваСотрудника.КорпоративныйТелефон), ДежурстваСотрудника.КорпоративныйТелефон, Телефон);
			Телефон = ?(ЗначениеЗаполнено(ДежурстваСотрудника.ВнутреннийТелефон), ДежурстваСотрудника.ВнутреннийТелефон, Телефон);
			СтрГрафик.phone = Телефон;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат График;
	
КонецФункции

Функция ПолучитьСтруктуруГрафикаНаДату(НаДату)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикДежурствДанныеОВремени.Сотрудник КАК Сотрудник,
		|	ГрафикДежурствДанныеОВремени.Сотрудник.ВнутреннийТелефон КАК ВнутреннийТелефон,
		|	ГрафикДежурствДанныеОВремени.Сотрудник.КорпоративныйТелефон КАК КорпоративныйТелефон,
		|	ГрафикДежурствДанныеОВремени.Примечание1 КАК Примечание1,
		|	ГрафикДежурствДанныеОВремени.Примечание2 КАК Примечание2,
		|	ГрафикДежурствДанныеОВремени.Примечание3 КАК Примечание3,
		|	ГрафикДежурствДанныеОВремени.Примечание4 КАК Примечание4,
		|	ГрафикДежурствДанныеОВремени.Примечание5 КАК Примечание5,
		|	ГрафикДежурствДанныеОВремени.Примечание6 КАК Примечание6,
		|	ГрафикДежурствДанныеОВремени.Примечание7 КАК Примечание7,
		|	ГрафикДежурствДанныеОВремени.Примечание8 КАК Примечание8,
		|	ГрафикДежурствДанныеОВремени.Примечание9 КАК Примечание9,
		|	ГрафикДежурствДанныеОВремени.Примечание10 КАК Примечание10,
		|	ГрафикДежурствДанныеОВремени.Примечание11 КАК Примечание11,
		|	ГрафикДежурствДанныеОВремени.Примечание12 КАК Примечание12,
		|	ГрафикДежурствДанныеОВремени.Примечание13 КАК Примечание13,
		|	ГрафикДежурствДанныеОВремени.Примечание14 КАК Примечание14,
		|	ГрафикДежурствДанныеОВремени.Примечание15 КАК Примечание15,
		|	ГрафикДежурствДанныеОВремени.Примечание16 КАК Примечание16,
		|	ГрафикДежурствДанныеОВремени.Примечание17 КАК Примечание17,
		|	ГрафикДежурствДанныеОВремени.Примечание18 КАК Примечание18,
		|	ГрафикДежурствДанныеОВремени.Примечание19 КАК Примечание19,
		|	ГрафикДежурствДанныеОВремени.Примечание20 КАК Примечание20,
		|	ГрафикДежурствДанныеОВремени.Примечание21 КАК Примечание21,
		|	ГрафикДежурствДанныеОВремени.Примечание22 КАК Примечание22,
		|	ГрафикДежурствДанныеОВремени.Примечание23 КАК Примечание23,
		|	ГрафикДежурствДанныеОВремени.Примечание24 КАК Примечание24,
		|	ГрафикДежурствДанныеОВремени.Примечание25 КАК Примечание25,
		|	ГрафикДежурствДанныеОВремени.Примечание26 КАК Примечание26,
		|	ГрафикДежурствДанныеОВремени.Примечание27 КАК Примечание27,
		|	ГрафикДежурствДанныеОВремени.Примечание28 КАК Примечание28,
		|	ГрафикДежурствДанныеОВремени.Примечание29 КАК Примечание29,
		|	ГрафикДежурствДанныеОВремени.Примечание30 КАК Примечание30,
		|	ГрафикДежурствДанныеОВремени.Примечание31 КАК Примечание31
		|ИЗ
		|	Документ.ГрафикДежурств.ДанныеОВремени КАК ГрафикДежурствДанныеОВремени
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ГрафикДежурствДанныеОВремени.Ссылка.Месяц, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Дата", НаДату);
	
	ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТЗРезультатЗапроса.Количество() > 0 Тогда
		Возврат ТЗРезультатЗапроса;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

 Функция ПолучитьТарифыИнтервалыДоставки(ДанныеЗапроса)
	 
	РезультатВыполнения = Новый Структура("Результат, Сообщение, Тарифы, Интервалы, МаксимальнаяДатаДоставки", Ложь, "");
	
	Попытка 
		// Расчет объема
		ДанныеЗапроса.Объем = УправлениеЛогистикойСервер.ПолучитьОбъем(ДанныеЗапроса.Товары); 
		ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната = УправлениеЛогистикойСервер.ПолучитьОбъемСУчетомСкрутокПоликарбоната(ДанныеЗапроса.Товары);   	
		ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната = ?(ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната = 0, ДанныеЗапроса.Объем, ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната);	
		Если ДанныеЗапроса.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная Тогда 
			 ДанныеЗапроса.Объем = ДанныеЗапроса.ОбъемСУчетомСкрутокПоликарбоната;		
		КонецЕсли;
		
		// Получение типов ТС по весу, длине, объему
		ТипыТС = УправлениеЛогистикойСервер.ПолучитьТипыТС(ДанныеЗапроса); 
		Если ТипыТС.Количество() = 0 Тогда
			РезультатВыполнения.Сообщение = "В розничной доставке нет подходящего типа транспорта";
			Возврат РезультатВыполнения;
		КонецЕсли;   
		
		// Получение интервалов доставки по филиалу и виду доставки на дату
        Интервалы = ПолучитьИнтервалы(ДанныеЗапроса);
		Если ТипыТС.Количество() = 0 Тогда
			РезультатВыполнения.Сообщение = "В розничной доставке нет подходящих интервалов доставки";
			Возврат РезультатВыполнения;
		КонецЕсли;   
		
		// Получение тарифов и интервалов тарифов соответсвующих интервалам доставки
		ПолучениеТарифов = ПолучитьТарифы(ТипыТС, Интервалы, ДанныеЗапроса);
		Если ПолучениеТарифов.Тарифы.Количество() = 0 Тогда
			РезультатВыполнения.Сообщение = "В розничной доставке нет подходящего тарифа";
			Возврат РезультатВыполнения;
		КонецЕсли;           
		Если ПолучениеТарифов.Интервалы.Количество() = 0 Тогда
			РезультатВыполнения.Сообщение = "В розничной доставке подходящих интервалов доставки";
			Возврат РезультатВыполнения;
		КонецЕсли;           
		
		ЗаполнитьЗначенияСвойств(РезультатВыполнения, ПолучениеТарифов);
		РезультатВыполнения.МаксимальнаяДатаДоставки = ДанныеЗапроса.МаксимальнаяДатаДоставки;
		РезультатВыполнения.Результат = Истина;
		
	Исключение   
		РезультатВыполнения.Сообщение = СтрШаблон("Ошибка получения тарифов и интервалов: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));		
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	 
КонецФункции	 

#КонецОбласти         

 #Область ВходныеДанные   
 
 Функция ДанныеЗапросаgetDeliveryVariants(ВходныеДанные)   
	 
	РезультатВыполнения = Новый Структура("Результат, ДанныеЗапроса", Ложь, ""); 
	
	Попытка
		ДанныеЗапроса = Новый Структура;  
		
		date = ВходныеДанные.Получить("date");
		Попытка
			ДанныеЗапроса.Вставить("ДатаДоставки", Дата(Число(Прав(date, 4)), Число(Сред(date, 4, 2)), Число(Лев(date, 2))));	
		Исключение                                                              
			РезультатВыполнения.ДанныеЗапроса = "Не определена дата доставки";
			Возврат РезультатВыполнения;
		КонецПопытки;   

		Если ДанныеЗапроса.ДатаДоставки < НачалоДня(ТекущаяДата()) Тогда
			РезультатВыполнения.ДанныеЗапроса = "Дата доставки меньше текущей";
			Возврат РезультатВыполнения;
		КонецЕсли;
		
		ДанныеЗапроса.Вставить("МаксимальнаяДатаДоставки", НачалоДня(ТекущаяДата()) + Константы.ОграничениеПериодаДоставки.Получить() * 24*60*60);
		Если ДанныеЗапроса.ДатаДоставки >= ДанныеЗапроса.МаксимальнаяДатаДоставки Тогда
			РезультатВыполнения.ДанныеЗапроса = СтрШаблон("Максимальная дата доставки %1", Формат(ДанныеЗапроса.МаксимальнаяДатаДоставки, "ДФ=dd.MM.yyyy"));
			Возврат РезультатВыполнения;
		КонецЕсли;
		
		ДанныеЗапроса.Вставить("Адрес", ВходныеДанные.Получить("address"));
		
		coords = ВходныеДанные.Получить("coords");
		ДанныеЗапроса.Вставить("Коодинаты", Новый Структура("Широта, Долгота", coords[0], coords[1]));
		
		zone_id = ВходныеДанные.Получить("zone_id");         
		Попытка
			ДанныеЗапроса.Вставить("ЗонаДоставки", Справочники.ЗоныДоставкиДоКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(zone_id)));
		Исключение   
			РезультатВыполнения.ДанныеЗапроса = "Не определена зона доставки";    
			Возврат РезультатВыполнения;
		КонецПопытки;
		
		store = ВходныеДанные.Получить("store");
		Попытка
			ДанныеЗапроса.Вставить("Склад", Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(store)));
			ДанныеЗапроса.Вставить("Подразделение", ДанныеЗапроса.Склад.Подразделение);
		Исключение
			РезультатВыполнения.ДанныеЗапроса = "Не определен склад"; 
			Возврат РезультатВыполнения;
		КонецПопытки;                              
		
		delivery_type = ВходныеДанные.Получить("delivery_type");  
		ДанныеЗапроса.Вставить("ВидДоставки");
		Если delivery_type = "retail" Тогда   
			ДанныеЗапроса.ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная");
		Иначе
			ДанныеЗапроса.ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.СборнаяОРК");
		КонецЕсли;
		
		Товары = Новый ТаблицаЗначений;
		Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));     
		КвалификаторЧисла = Новый КвалификаторыЧисла(15,3, ДопустимыйЗнак.Неотрицательный);
		Товары.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число", КвалификаторЧисла));      
		
		Для Каждого product Из ВходныеДанные.Получить("products") Цикл   
			Товар = Товары.Добавить();    
			
			Товар.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(product.Получить("id")));
			Товар.КоличествоУпаковок = product.Получить("count");
		КонецЦикла;  
		
		ДанныеЗапроса.Вставить("Товары", Товары);
		
		ДанныеЗапроса.Вставить("МаксимальнаяДлина", Число(ВходныеДанные.Получить("max_length")) / 1000 ); // мм в мм
		ДанныеЗапроса.Вставить("Вес",Число(ВходныеДанные.Получить("total_weight")) / 1000); // г в кг        
		
		ДанныеЗапроса.Вставить("Объем");
		ДанныеЗапроса.Вставить("ОбъемСУчетомСкрутокПоликарбоната");
		
		РезультатВыполнения.Результат = Истина;
		РезультатВыполнения.ДанныеЗапроса = ДанныеЗапроса;
	
	Исключение
		РезультатВыполнения.ДанныеЗапроса = СтрШаблон("Ошибка преобразования входного JSON: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));		
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции	 
 
 #КонецОбласти   
 
 #Область ПолучениеДанныхДоставки              
 
 Функция ПолучитьИнтервалы(Данные)    
	 
	Запрос = Новый Запрос(Справочники.ИнтервалыДоставки.ПолучитьТекстЗапросаДляВыбораИнтервала());
	Запрос.УстановитьПараметр("ДатаОтгрузки",        Данные.ДатаДоставки);
	Запрос.УстановитьПараметр("Подразделение",       Данные.Подразделение);
	Запрос.УстановитьПараметр("ВидДоставки",         Данные.ВидДоставки);
	Запрос.УстановитьПараметр("ДоставкаСРазгрузкой", Истина);
	Запрос.УстановитьПараметр("КорИнтервала",        0);
	Запрос.УстановитьПараметр("ТекДата",             ТекущаяДата());
	
	Если ДеньНедели(Данные.ДатаДоставки) < 6  И Данные.ВидДоставки <> Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
		Запрос.УстановитьПараметр("ДеньНедели", 0);
	Иначе
		Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели(Данные.ДатаДоставки));
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции	 
 
 Функция ПолучитьТарифы(ТипыТС, Интервалы, Данные)
	 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТипыТС.ТипТС КАК ТипТС
		|ПОМЕСТИТЬ втТипыТС
		|ИЗ
		|	&ТипыТС КАК ТипыТС
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиТарифов.ТипТС КАК ТипТС,
		|	НастройкиТарифов.Тариф КАК Тариф
		|ПОМЕСТИТЬ втТарифы
		|ИЗ
		|	&НастройкиТарифов КАК НастройкиТарифов 
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГлобальнаяЗона           
		|ПОМЕСТИТЬ втГлобальныеЗоны	
		|ИЗ
		|	РегистрСведений.ГлобальныеЗоныПоЗонамДоставкиДоКлиента
		|ГДЕ
		|	Подразделение = &Подразделение
		|	И Зона = &ЗонаДоставки
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТарифыПеревозчиков.Ссылка КАК Тариф,
		|	ТипыДоставок.Ссылка КАК ТипДоставки
		|ПОМЕСТИТЬ втНастройкиТарифов
		|ИЗ
		|	втТипыТС 
		|	СОЕДИНЕНИЕ втТарифы
		|		ПО втТипыТС.ТипТС = втТарифы.ТипТС
		|	СОЕДИНЕНИЕ Справочник.ТипыТранспортныхСредств КАК ТипыТС
		|		ПО втТарифы.ТипТС = ТипыТС.Ссылка 
		|	СОЕДИНЕНИЕ Справочник.ТарифыПеревозчиков КАК ТарифыПеревозчиков
		|		ПО втТарифы.Тариф = ТарифыПеревозчиков.Ссылка 
		|	СОЕДИНЕНИЕ Справочник.ТипыДоставок КАК ТипыДоставок
		|		ПО ТарифыПеревозчиков.ТипДоставки = ТипыДоставок.Ссылка 
		|	СОЕДИНЕНИЕ втГлобальныеЗоны
		|		ПО ИСТИНА
		|ГДЕ
		|	ВЫБОР
		|		КОГДА втГлобальныеЗоны.ГлобальнаяЗона = ЗНАЧЕНИЕ(Перечисление.ЗоныДоставкиКлиента.Зона2)
		|		ТОГДА ТарифыПеревозчиков.ЗонаДействияТарифа = втГлобальныеЗоны.ГлобальнаяЗона 
		|			ИЛИ ТарифыПеревозчиков.ЗонаДействияТарифа = ЗНАЧЕНИЕ(Перечисление.ЗоныДоставкиКлиента.ПустаяСсылка)
		|       ИНАЧЕ ИСТИНА    
		|	КОНЕЦ
		|	И ТарифыПеревозчиков.Подразделение В
		|		(&Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втНастройкиТарифов.Тариф,
		|	втНастройкиТарифов.ТипДоставки,
		|	СтоимостьДоставкиПоЗонам.СтоимостьДляКлиента КАК СтоимостьДоставки 
		|ПОМЕСТИТЬ втТарифыСтоимость	
		|ИЗ
		|	втНастройкиТарифов
		|	СОЕДИНЕНИЕ РегистрСведений.СтоимостьДоставкиПоЗонам.СрезПоследних(
		|			&ДатаДоставки,
		|			ЗонаДоставки = &ЗонаДоставки
		|			И Филиал = &Подразделение) КАК СтоимостьДоставкиПоЗонам
		|		ПО втНастройкиТарифов.Тариф = СтоимостьДоставкиПоЗонам.Тариф    
		|;       
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Интервалы.Ссылка КАК Интервал,
		|	Интервалы.Наименование КАК ИнтервалНаименование,
		|	Интервалы.НаименованиеНаСайте КАК ИнтервалНаименованиеНаСайте,
		|	Интервалы.ДеньНедели,
		|	Интервалы.ВремяС,
		|	Интервалы.ВремяПо,
		|	Интервалы.МожноВыбрать,
		|	Интервалы.ДоступноНаСегодня,   
		|	Интервалы.МожноВыбратьРазгрузка,
		|	Интервалы.ДоступноНаСегодняСРазгрузкой
		|ПОМЕСТИТЬ втИнтервалы
		|ИЗ
		|	&Интервалы КАК Интервалы 
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ                         
		|	втТарифыСтоимость.Тариф,                     
		|	втТарифыСтоимость.ТипДоставки,   
		|	втТарифыСтоимость.СтоимостьДоставки,
		|	втИнтервалы.Интервал,
		|	втИнтервалы.ИнтервалНаименованиеНаСайте,
		|	втИнтервалы.ДеньНедели,
		|	втИнтервалы.ВремяС,
		|	втИнтервалы.ВремяПо,
		|	втИнтервалы.МожноВыбрать И втИнтервалы.ДоступноНаСегодня > 0 КАК Доступно,   
		|	втИнтервалы.МожноВыбратьРазгрузка И втИнтервалы.ДоступноНаСегодняСРазгрузкой > 0 КАК ДоступноРазгрузка
		|ПОМЕСТИТЬ втИнтервалыТарифов	
		|ИЗ
		|	втТарифыСтоимость 
		|	СОЕДИНЕНИЕ Справочник.ТарифыПеревозчиков.Интервалы КАК ИнтервалыПеревозчиков
		|		ПО втТарифыСтоимость.Тариф = ИнтервалыПеревозчиков.Ссылка                
		|	СОЕДИНЕНИЕ Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|		ПО ИнтервалыПеревозчиков.Интервал = ИнтервалыДоставки.Ссылка
		|		И ИнтервалыДоставки.Подразделение = &Подразделение
		|		И ИнтервалыДоставки.ВидДоставки = &ВидДоставки   
		|	СОЕДИНЕНИЕ втИнтервалы
		|		ПО ИнтервалыПеревозчиков.Интервал = втИнтервалы.Интервал
		|;	                                                                
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТипДоставки,
		|	МИНИМУМ(СтоимостьДоставки) КАК СтоимостьДоставки
		|ПОМЕСТИТЬ
		|	втМинимальнаяСтоимостьПоТипуДоставки
		|ИЗ     
		|	втИнтервалыТарифов  
		|СГРУППИРОВАТЬ ПО
		|	ТипДоставки		
		|;	
		|////////////////////////////////////////////////////////////////////////////////	
		|ВЫБРАТЬ
		|	втМинимальнаяСтоимостьПоТипуДоставки.ТипДоставки,
		|	втМинимальнаяСтоимостьПоТипуДоставки.СтоимостьДоставки,   
		|	МИНИМУМ(Тариф) КАК Тариф
		|ПОМЕСТИТЬ
		|	втМинимальныеТарифы
		|ИЗ     
		|	втМинимальнаяСтоимостьПоТипуДоставки 
		|	СОЕДИНЕНИЕ втИнтервалыТарифов
		|		ПО втМинимальнаяСтоимостьПоТипуДоставки.ТипДоставки = втИнтервалыТарифов.ТипДоставки
		|		И втМинимальнаяСтоимостьПоТипуДоставки.СтоимостьДоставки = втИнтервалыТарифов.СтоимостьДоставки
		|СГРУППИРОВАТЬ ПО
		|	втМинимальнаяСтоимостьПоТипуДоставки.ТипДоставки,
		|	втМинимальнаяСтоимостьПоТипуДоставки.СтоимостьДоставки
		|;	   
		|////////////////////////////////////////////////////////////////////////////////	
		|ВЫБРАТЬ * 
		|ИЗ
		|	втМинимальныеТарифы      
		|УПОРЯДОЧИТЬ ПО
		|	СтоимостьДоставки	
		|;
		|////////////////////////////////////////////////////////////////////////////////	       
		|ВЫБРАТЬ РАЗЛИЧНЫЕ                         
		|	втИнтервалыТарифов.Тариф,                     
		|	втИнтервалыТарифов.Интервал,
		|	втИнтервалыТарифов.ИнтервалНаименованиеНаСайте,
		|	втИнтервалыТарифов.ДеньНедели,
		|	втИнтервалыТарифов.ВремяС,
		|	втИнтервалыТарифов.ВремяПо,
		|	втИнтервалыТарифов.Доступно,   
		|	втИнтервалыТарифов.ДоступноРазгрузка
		|ИЗ 
		|	втИнтервалыТарифов
		|	СОЕДИНЕНИЕ втМинимальныеТарифы
		|		ПО втИнтервалыТарифов.Тариф = втМинимальныеТарифы.Тариф
		|УПОРЯДОЧИТЬ ПО
		|	втИнтервалыТарифов.Тариф,
		|	втИнтервалыТарифов.ВремяС,
		|	втИнтервалыТарифов.ВремяПо,
		|	втИнтервалыТарифов.ДеньНедели";
	
	Запрос.УстановитьПараметр("НастройкиТарифов",	УправлениеЛогистикойСервер.ПолучитьНастройкиАвтоопределения().НастройкиТарифов); 
	Запрос.УстановитьПараметр("ТипыТС", 			ТипыТС); 
	Запрос.УстановитьПараметр("Интервалы", 			Интервалы); 
	Запрос.УстановитьПараметр("Подразделение",		Данные.Подразделение); 
	Запрос.УстановитьПараметр("ДатаДоставки",		Данные.ДатаДоставки);	
	Запрос.УстановитьПараметр("ЗонаДоставки",		Данные.ЗонаДоставки); 
	Запрос.УстановитьПараметр("ВидДоставки",		Данные.ВидДоставки); 
	Запрос.УстановитьПараметр("ПустаяСтрока",		""); 
	
	МассивЗапросов = Запрос.ВыполнитьПакет();       
	
	Возврат Новый Структура("Тарифы, Интервалы", МассивЗапросов[9].Выгрузить(), МассивЗапросов[10].Выгрузить());
	
КонецФункции	
	
 #КонецОбласти
 