#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьПоЦеновойГруппе(Команда)
	
	ОткрытьФорму("РегистрСведений.ПроцентНаценкиРозница.ФормаЗаписи",Новый Структура("ТипЗаписи",1));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_ЦеноваяГруппа(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_ЦеноваяГруппа", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_ЦеноваяГруппа());
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("ДополнительныйАлгоритм","ПроверкаРозничнойНаценкиЦеноваяГруппа"); 
	
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_Номенклатура(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_Номенклатура", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_Номенклатура());
	ПараметрыФормы.Вставить("ДополнительныйАлгоритм","ПроверкаРозничнойНаценкиНоменклатура"); 
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПоНоменклатуре(Команда)
	ОткрытьФорму("РегистрСведений.ПроцентНаценкиРозница.ФормаЗаписи",Новый Структура("ТипЗаписи",0));
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыиФункции
&НаКлиенте
Функция СтруктураТаблицы_ЦеноваяГруппа()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
		"СправочникСсылка.ЦеновыеГруппы#Ценовая группа#30#1#Справочники.ЦеновыеГруппы.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("ПроцентНаценки", "число#% наценки#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Функция СтруктураТаблицы_Номенклатура()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
		"СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("Начало", "Дата#Начало#10");
	СтруктураТаблицы.Вставить("Окончание", "Дата#Окончание#10");
	СтруктураТаблицы.Вставить("ПроцентНаценки", "число#% наценки#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_Номенклатура(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры);

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_ЦеноваяГруппа(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_ЦеноваяГруппа(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_ЦеноваяГруппа(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПроцентНаценкиРозница.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.ТипЗаписи=1;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокЦеноваяГруппа.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПроцентНаценкиРозница.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокНоменклатура.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ТекущаяДата",ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти