#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьДоступность();
	
	РасчитатьИтоги();
	
	ОтобразитьВремяДоставки();
	
	УстановитьПривилегированныйРежим(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаКарты Тогда
			ИнициализироватьКарту();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РасчитатьИтоги();
	//Если ТекущийОбъект.Транзит Тогда
	//	Документы.РейсОтПоставщика.РасчитатьЗаложеноВСтоимость(Объект);
	//	Если ТекущийОбъект.Статус = Перечисления.СтатусыРейсовНаПоставку.Доставлен И ТекущийОбъект.Статус <> Объект.Ссылка.Статус Тогда
	//		Документы.РейсОтПоставщика.ЗаменитьУслугуДоставки(ТекущийОбъект, Отказ);
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьДоступность();
	
	ОтобразитьВремяДоставки();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область КомандыФормы
&НаКлиенте
Процедура Движения(Команда)
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", Новый Структура("Документ", Объект.Ссылка));
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	ДокументОснование= Элементы.РасчетДоставки.ТекущиеДанные.ДокументОснование;
	АльтерраОбщегоНазначенияКлиент.ОткрытьДокументПоступления(ДокументОснование, ЭтаФорма);
	
	//ПараметрыОткрытия= Новый Структура;
	//ДокументОснование= Элементы.РасчетДоставки.ТекущиеДанные.ДокументОснование;
	//ПараметрыОткрытия.Вставить("Ключ", ДокументОснование);
	//Если ТипЗнч(ДокументОснование)  =  Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
	//	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	//ИначеЕсли ТипЗнч(ДокументОснование)  =  Тип("ДокументСсылка.ЗаказПоставщику") Тогда
	//	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	//ИначеЕсли ТипЗнч(ДокументОснование)  =  Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
	//	ОткрытьФорму("Документ.ЗаказНаПеремещение.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	//ИначеЕсли ТипЗнч(ДокументОснование)  =  Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
	//	ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	//КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьЗаказ(Команда)
	ПараметрыОткрытия= Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Элементы.РасчетДоставки.ТекущиеДанные.ЗаказНаДоставку);
	ОткрытьФорму("Документ.ЗаказНаДоставкуОтПоставщика.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаменуУслуг(Команда)
	ВыполнитьЗаменуУслугНаСервере();
КонецПроцедуры
&НаСервере
Процедура ВыполнитьЗаменуУслугНаСервере()
	Отказ= Ложь;
	Если Объект.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК тогда
		Документы.РейсОтПоставщика.ПроверитьЧтоПоЗаказамСозданыРеализации(Объект, Отказ, Истина, Ложь);
		Если Не Отказ Тогда
			Документы.РейсОтПоставщика.ВыполнитьЗаменуКоличествоУслуг(Объект, Отказ);
		КонецЕсли;
	Иначе
		ПроверитьЗаполнениеПеревозчика(Отказ);
		Документы.РейсОтПоставщика.ПроверитьЧтоПоЗаказамСозданыРеализации(Объект, Отказ);
		Если Не Отказ Тогда
			Документы.РейсОтПоставщика.ВыполнитьЗаменуУслугБезНДС(Объект, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомпенсацияВручнуюПриИзменении(Элемент)
		Элементы.КорректировкаКомпенсации.ТолькоПросмотр= Не Объект.КомпенсацияВручную;
		Элементы.КорректировкаКомпенсацииСНДС.ТолькоПросмотр= Не Объект.КомпенсацияВручную;
		
		Если Не Объект.КомпенсацияВручную Тогда
			Объект.КорректировкаКомпенсации= 0;
			Объект.КорректировкаКомпенсацииСНДС= 0;
		КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура КорректировкаКомпенсацииПриИзменении(Элемент)
	Объект.Компенсация= Объект.Компенсация+Объект.КорректировкаКомпенсации;
	Объект.ОплатаВодителю= Объект.ОплатаВодителю+Объект.КорректировкаКомпенсации;
КонецПроцедуры
&НаКлиенте
Процедура КорректировкаКомпенсацииСНДСПриИзменении(Элемент)
	Объект.КомпенсацияСНДС= Объект.КомпенсацияСНДС+Объект.КорректировкаКомпенсацииСНДС;
	Объект.ОплатаВодителюСНДС= Объект.ОплатаВодителюСНДС+Объект.КорректировкаКомпенсацииСНДС;
КонецПроцедуры

&НаКлиенте
Процедура РасчетДоставкиКорректировкаРасчетнойСтоимостиПриИзменении(Элемент)
	ТекущаяСтрока= Элементы.РасчетДоставки.ТекущиеДанные;
	Если ТекущаяСтрока.КорректировкаРасчетнойСтоимости <> 0 Тогда
		ТекущаяСтрока.ИтоговаяСтоимостьДляКлиента= ТекущаяСтрока.КорректировкаРасчетнойСтоимости;
	Иначе
		ТекущаяСтрока.ИтоговаяСтоимостьДляКлиента= ТекущаяСтрока.РасчетнаяРекомендованнаяСтоимость;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоверенности(Команда)
	СоздатьДоверенностиНаСервере();
КонецПроцедуры
&НаСервере
Процедура СоздатьДоверенностиНаСервере()
	Для Каждого стрРасчетДоставки Из Объект.РасчетДоставки Цикл
		ЗаказНаДоставку= стрРасчетДоставки.ЗаказНаДоставку;
		
		Доверенность= Документы.ЗаказНаДоставкуОтПоставщика.ПолучитьДоверенность(ЗаказНаДоставку, Объект.Водитель);
		
		Если Не ЗначениеЗаполнено(Доверенность) Тогда
			Доверенность= Документы.ЗаказНаДоставкуОтПоставщика.СоздатьДоверенность(ЗаказНаДоставку, Объект);
			АльтерраОбщегоНазначения.СообщитьПользователю(Доверенность, "Создан: "+Доверенность);
		Иначе
			АльтерраОбщегоНазначения.СообщитьПользователю(Доверенность, "Существует: "+Доверенность);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИтоговуюСтоимость(Команда)
	ЭтаФорма.Модифицированность= Истина;
	ЗаполнитьИтоговуюСтоимостьНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьИтоговуюСтоимостьНаСервере()
	Документы.РейсОтПоставщика.РасчитатьЗаложеноВСтоимость(Объект);
	
	РасчитатьИтоги();
КонецПроцедуры

#КонецОбласти

#Область СобытияРасчетДоставки
&НаКлиенте
Процедура ДобавитьЗаказНаДоставку(Команда)
	ПараметрыФормы= Новый Структура;
	Оповещение= Новый ОписаниеОповещения("ДобавитьЗаказВРасчетДоставки", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаказНаДоставкуОтПоставщика.ФормаВыбора", ПараметрыФормы, ЭтаФорма, Истина,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
&НаКлиенте
Процедура  ДобавитьЗаказВРасчетДоставки(ЗаказНаДоставку, ДопПараметры) Экспорт
	ДобавитьЗаказВРасчетДоставкиСервер(ЗаказНаДоставку);
КонецПроцедуры

&НаСервере
Процедура  ДобавитьЗаказВРасчетДоставкиСервер(ЗаказНаДоставку)
	ТаблицаЗаказовИзменена = Истина;
	Документы.РейсОтПоставщика.ЗаполнитьДанныеПоОснованию(ЗаказНаДоставку, Объект);
	РасчитатьИтоги(); 
	РасчитатьСтоимостьТранспортнойРаботы();
	
	ОтобразитьВремяДоставки();
КонецПроцедуры


&НаКлиенте
Процедура РасчетДоставкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаказНаДоставку= Элементы.РасчетДоставки.ТекущиеДанные.ЗаказНаДоставку;
	Если Не ЗначениеЗаполнено(ЗаказНаДоставку) Тогда
		Строки= Объект.РасчетДоставки.НайтиСтроки(Новый Структура("ЗаказНаДоставку", ЗаказНаДоставку));
		Попытка
			Для Каждого Строка Из Строки Цикл
				Строки.Удалить(Строка);
			КонецЦикла;
			НоваяСтрока= Ложь;
		Исключение
			Сообщить("Необходимо сразу выбрать заказ не выходя из строки!");
		КонецПопытки;
	КонецЕсли;
	Если НоваяСтрока Тогда
		ЗаполнитьДанныеПоОснованию();  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасчетДоставкиПередУдалением(Элемент, Отказ)
	УдаляемыйЗаказ= Элемент.ТекущиеДанные.ЗаказнаДоставку;
	
	СтрокиКУдалению= Объект.РасчетДоставки.НайтиСтроки(Новый Структура("ЗаказнаДоставку", УдаляемыйЗаказ));
	Для Каждого УдСтрока Из СтрокиКУдалению Цикл
		Объект.РасчетДоставки.Удалить(УдСтрока);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область СобытияКонтролов
&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры
&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	ПараметрыЗаполнения= Документы.ЗаданиеНаПеревозкуРейс.ПолучитьПараметрыЗаполненияПоВодителю(Объект.Водитель);
	Если ПараметрыЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыЗаполнения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасчетДоставкиПриИзменении(Элемент)
	ТаблицаЗаказовИзменена = Истина;
	РасчитатьИтоги();
	ОтобразитьВремяДоставки();   
	РасчитатьСтоимостьТранспортнойРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ФактическаяСтоимостьДоставкиПриИзменении(Элемент)
	ФактическаяСтоимостьДоставкиПриИзмененииНаСервере();
КонецПроцедуры
&НаСервере
Процедура ФактическаяСтоимостьДоставкиПриИзмененииНаСервере()
	 Документы.РейсОтПоставщика.РаспределитьФактическуюСтоимость(Объект);
КонецПроцедуры

#КонецОбласти

#Область Основной
&НаСервере
Процедура ЗаполнитьДанныеПоОснованию()
	Документы.РейсОтПоставщика.ЗаполнитьДанныеПоОснованию(Неопределено, Объект);  
	РасчитатьСтоимостьТранспортнойРаботы();
КонецПроцедуры
&НаСервере
Процедура РассчитатьСтроку(НомерСтроки)
	Документы.РейсОтПоставщика.РассчитатьСтроку(НомерСтроки, Объект);
	РасчитатьИтоги();
КонецПроцедуры
&НаСервере
Процедура РасчитатьИтоги()
	Элементы.РасчетДоставкиВес.ТекстПодвала= Объект.РасчетДоставки.Итог("Вес");
	Элементы.РасчетДоставкиОбъем.ТекстПодвала= Объект.РасчетДоставки.Итог("Объем");
	Элементы.РасчетДоставкиСтоимостьТовара.ТекстПодвала= Объект.РасчетДоставки.Итог("СтоимостьТовара");
	Элементы.РасчетДоставкиРаспределенныеДеньгиНаДоставку.ТекстПодвала= Объект.РасчетДоставки.Итог("РаспределенныеДеньгиНаДоставку");
	Элементы.РасчетДоставкиРасчетнаяРекомендованнаяСтоимость.ТекстПодвала= Объект.РасчетДоставки.Итог("РасчетнаяРекомендованнаяСтоимость");
	
	Объект.ЗаложеноВСтоимость= Объект.РасчетДоставки.Итог("ЗаложеноВСтоимость");
	Объект.ЗаложеноВСтоимостьБезНДС= Объект.РасчетДоставки.Итог("ЗаложеноВСтоимостьБезНДС");
	
	Элементы.РасчетДоставкиИтоговаяСтоимость.ТекстПодвала= Объект.ЗаложеноВСтоимость;
	Элементы.РасчетДоставкиЗаложеноВСтоимостьБезНДС.ТекстПодвала= Объект.ЗаложеноВСтоимостьБезНДС;
	
	Итоги= Документы.РейсОтПоставщика.ПолучитьИтоги(Объект);
	ЗаполнитьЗначенияСвойств(Объект, Итоги);
	Элементы.РасчетДоставкиЗаказНаДоставкуСтоимостьДоставки.ТекстПодвала= Итоги.СтоимостьДоставки;
	
	ЗаложеноВСтоимостьИтого= Объект.ЗаложеноВСтоимость+Объект.ЗаложеноВСтоимостьБезНДС;
КонецПроцедуры

&НаСервере
Функция ИмеетПолныеПрава() 
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	//Права на статус
	Если РольДоступна("ПолныеПрава") Тогда 
		Элементы.ФормаНапечататьКомплектДокументов.Доступность= Истина;
		Элементы.Статус.ТолькоПросмотр= Ложь;
		Элементы.Статус.Доступность= Истина;
	КонецЕсли;
	
	//Доступность по провам
	Если РольДоступна("ОтделЛогистики") Тогда 
		//Права на статус
		Элементы.Статус.ТолькоПросмотр= Ложь;
		Элементы.Статус.Доступность= Истина;
	Иначе
	КонецЕсли;
	
	Если НЕ (РольДоступна ("ПравоЗапускаАвтораспределенияТранспортных") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		Элементы.РаспределитьТранспортные.Доступность = Ложь;
		Элементы.ПроверитьСостояниеОплаты.Доступность = Ложь;
	КонецЕсли
	
КонецПроцедуры
#КонецОбласти

#Область РаботаСоСтатусами
&НаКлиенте
Процедура СледующийЭтап(Команда)
	//Элементы.СледующийЭтап.Доступность= Ложь;
	ПерейтиНаСледующийЭтап();
	ОтобразитьВремяДоставки();
КонецПроцедуры
&НаКлиенте
Процедура ПредыдущийЭтап(Команда)
	//Элементы.ПредыдущийЭтап.Доступность= Ложь;
	ПерейтиНаПредыдущийЭтап();
	ОтобразитьВремяДоставки();
	ЭтаФорма.Закрыть();
КонецПроцедуры

//Этапы
&НаСервере
Процедура ПерейтиНаСледующийЭтап()
	Отказ= Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.СтавкаНДС) Тогда
		Отказ= Истина;
		Сообщить("Не заполнена ставка НДС!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.Создан;
		
	ИначеЕсли Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.Создан Тогда
		Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.Выполняется;
		
	ИначеЕсли Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.Выполняется Тогда
		Если Не Отказ Тогда
			Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.ВПути;
		КонецЕсли;
		
	ИначеЕсли Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.ВПути Тогда
		Если Объект.ТранзитФизЛицо Тогда 
			Документы.РейсОтПоставщика.ОтгрузитьТранзитныйЗаказНаСервере(Объект, (Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС), Отказ);
			РасчитатьИтоги();
			Если Отказ Тогда
				Сообщить("Распределение не произошло!", СтатусСообщения.ОченьВажное);
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда
			Разница= Объект.ФактическаяСтоимостьДоставки - (Объект.ЗаложеноВСтоимость+Объект.ЗаложеноВСтоимостьБезНДС); 
			Если Разница > 5 Тогда
				Отказ= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая стоимость рейса не совпадает со стоимостью заложенной в транспортные расходы!", Объект.Ссылка, "Объект.ЗаложеноВСтоимость");
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда
			Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.Прибыл;//Перечисления.СтатусыРейсовНаПоставку.Доставлен;
		КонецЕсли;
		
	ИначеЕсли Объект.Статус = Перечисления.СтатусыРейсовНаПоставку.Прибыл Тогда
		Объект.Статус = Перечисления.СтатусыРейсовНаПоставку.Доставлен;
		
	ИначеЕсли Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.Доставлен Тогда
		Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.ДокументыСданы;
		
	ИначеЕсли Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.ДокументыСданы Тогда
		Объект.ДатаПодачиНаОплату= ТекущаяДата();
		Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.Оплачен;
	КонецЕсли;
	
	Если Не Отказ Тогда
		//ЭтаФорма.Модифицированность= Истина;
		Записать();
	КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ПерейтиНаПредыдущийЭтап()
	Отказ= Ложь;
	Если ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус= Перечисления.СтатусыРейсовНаПоставку.Создан;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеПеревозчика(Отказ) 
	Если Не ЗначениеЗаполнено(Объект.Перевозчик) ИЛИ  Не ЗначениеЗаполнено(Объект.Водитель) ИЛИ  Не ЗначениеЗаполнено(Объект.Автомобиль) Тогда
		Отказ= Истина;
		Сообщить("Не заполнены поля: Перевозчик, Водитель, Автомобиль");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПечатьКомплектаДокументов
&НаКлиенте
Процедура НапечататьКомплектДокументов(Команда)
	НапечататьКомплектДокументовКлиент();
КонецПроцедуры
&НаКлиенте
Процедура НапечататьКомплектДокументовКлиент() Экспорт
КонецПроцедуры
#КонецОбласти

#Область ИнициализацияКарты

&НаКлиенте
Процедура ИнициализироватьКарту()
	КартаЯндекс= "";
	КартаЯндекс= ПолучитьТекстМакета();
	ГеокодированиеКлиент.УстановитьНачальныеКоординаты(Неопределено, КартаЯндекс);
КонецПроцедуры
&НаСервере
Функция ПолучитьТекстМакета()
	Макет= ПолучитьОбщийМакет("МакетЯндексКарты");
	стрМакет = Макет.ПолучитьТекст();
	
	Документы.ЗаказНаДоставкуОтПоставщика.УбратьПодстановкиИзКода(стрМакет);
	
	Возврат стрМакет;
КонецФункции

&НаКлиенте
Процедура ПоказатьДоставкиНаКарте(Команда)
	ЯндексКарта= Элементы.КартаЯндекс;
	Для Каждого стрРасчетДоставки Из Объект.РасчетДоставки Цикл
		ЗаказНаДоставку= стрРасчетДоставки.ЗаказНаДоставку;
		Адрес= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказНаДоставку, "АдресДоставки");
		
		Координаты= ГеокодированиеКлиент.ПолучитьКоординатыПоАдресу(Адрес);
		стрКоординаты= ГеокодированиеКлиент.ПолучитьМассивКоординат(Координаты.Широта, Координаты.Долгота);
		ГеокодированиеКлиент.ПоставитьМаркерПоКоординатам(ЯндексКарта, стрКоординаты, Координаты.Адрес);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОтправитьЭлПисьмо
&НаКлиенте
Процедура ОтправитьТТНПоПочте(Команда)
	ТабличныйДокумент = ПолучитьТабДокТТН();
	Если ТабличныйДокумент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Печатная форма не была сформирована!");
		Возврат;
	КонецЕсли;
	
	ИмяПечатнойФормы= "ТТН";
		
	ПараметрыОтправки = Новый Структура;//Кому, Тема, Тело, Вложения, АдресОтвета, ТипТекста, Копии, СлепыеКопии;
	Партнер= Объект.ПеревозчикПартнер;
	ПочтаПартнера= АльтерраОбщегоНазначения.ПолучитьСведеньяОПартнере(Партнер).ПочтаПартнера;
	ПараметрыОтправки.Вставить("Кому", ПочтаПартнера);
	Получатель= Новый СписокЗначений;
	Получатель.Добавить(ПочтаПартнера, Партнер);
	ПараметрыОтправки.Вставить("Получатель", Получатель);


	ПараметрыОтправки.Вставить("Тема", ИмяПечатнойФормы);
	ПараметрыОтправки.Вставить("Тело", "Отправляем вам "+ИмяПечатнойФормы);
	ПараметрыОтправки.Вставить("Текст", "Отправляем вам "+ИмяПечатнойФормы);
	
	Отправитель= Новый СписокЗначений; 
	
    ИмяОтправителя = ПолучитьИмяОтправителя();
	
	Отправитель.Добавить(ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты"), ИмяОтправителя);
	ПараметрыОтправки.Вставить("Отправитель", Отправитель);
	
	ИмяФайла= ИмяПечатнойФормы+"." + "pdf";
	АдресВоВременномХранилище = ПоместитьТабличныеДокументыВоВременноеХранилище(ТабличныйДокумент,  ИмяФайла);
	Вложения= Новый Массив;
	Вложение= Новый Структура("Представление,АдресВоВременномХранилище", ИмяФайла, АдресВоВременномХранилище);
	Вложения.Добавить(Вложение);
	ПараметрыОтправки.Вставить("Вложения", Вложения);
	
	//ПараметрыОтправки.Вставить("АдресОтвета", АдресОтвета);
	
	//ОтправитьПочтовоеСообщение(ПараметрыОтправки);  //Отправка фоном
	
	ТабличныеДокументы= Новый СписокЗначений;
	ТабличныеДокументы.Добавить(ТабличныйДокумент, ИмяПечатнойФормы);
	МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
	МодульРаботаСПочтовымиСообщениямиКлиент.ОтправитьТабличныеДокументы(ТабличныеДокументы, ИмяПечатнойФормы, ПараметрыОтправки);
КонецПроцедуры

&НаСервере
Процедура  ОтправитьПочтовоеСообщение(ПараметрыОтправки)
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПараметрыОтправки.Отправитель, ПараметрыОтправки);
КонецПроцедуры

&НаСервере
Функция ПолучитьТабДокТТН()
	Если Не Объект.Ссылка.Пустая() Тогда 
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Объект.Ссылка);
		
		СсылкаНаОбработку = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Рейс от поставщика (Печатные формы)", Истина);
		Если ЗначениеЗаполнено(СсылкаНаОбработку) Тогда
			Возврат ПроверитьТабДок(ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(СсылкаНаОбработку).СформироватьПечатнуюФормуТТН(МассивДокументов));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПоместитьТабличныеДокументыВоВременноеХранилище(ТабличныйДокумент, ИмяФайла)
	Результат = Новый СписокЗначений;
	
	// Каталог временных файлов
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	ПолныйПутьКФайлу = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки);
	
	ПолноеИмяФайла = ПолныйПутьКФайлу + ИмяФайла;
	
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	
	Адрес= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайла), УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременнойПапки);
	
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьАктПеревозчикаПоПочте(Команда)
	ТабличныйДокумент = СформироватьАктПеревозчика();
	Если ТабличныйДокумент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Печатная форма не была сформирована!");
		Возврат;
	КонецЕсли;
	
	ИмяПечатнойФормы= "Акт перевозчика";
	
	ПараметрыОтправки = Новый Структура;//Кому, Тема, Тело, Вложения, АдресОтвета, ТипТекста, Копии, СлепыеКопии;
	Партнер= Объект.ПеревозчикПартнер;
	ПочтаПартнера= АльтерраОбщегоНазначения.ПолучитьСведеньяОПартнере(Партнер).ПочтаПартнера;
	ПараметрыОтправки.Вставить("Кому", ПочтаПартнера);
	Получатель= Новый СписокЗначений;
	Получатель.Добавить(ПочтаПартнера, Партнер);
	ПараметрыОтправки.Вставить("Получатель", Получатель);
	
	
	ПараметрыОтправки.Вставить("Тема", ИмяПечатнойФормы);
	ПараметрыОтправки.Вставить("Тело", "Отправляем вам "+ИмяПечатнойФормы);
	ПараметрыОтправки.Вставить("Текст", "Отправляем вам "+ИмяПечатнойФормы);
	
	Отправитель= Новый СписокЗначений;
	
     ИмяОтправителя = ПолучитьИмяОтправителя();
	
	Отправитель.Добавить(ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты"),ИмяОтправителя);
	ПараметрыОтправки.Вставить("Отправитель", Отправитель);
	
	
	ИмяФайла= "Акт_перевозчика"+"." + "pdf";
	АдресВоВременномХранилище = ПоместитьТабличныеДокументыВоВременноеХранилище(ТабличныйДокумент,  ИмяФайла);
	Вложения= Новый Массив;
	Вложение= Новый Структура("Представление,АдресВоВременномХранилище", ИмяФайла, АдресВоВременномХранилище);
	Вложения.Добавить(Вложение);
	ПараметрыОтправки.Вставить("Вложения", Вложения);
	
	//ПараметрыОтправки.Вставить("АдресОтвета", АдресОтвета);
	
	//ОтправитьПочтовоеСообщение(ПараметрыОтправки);  //Отправка фоном
	
	ТабличныеДокументы= Новый СписокЗначений;
	ТабличныеДокументы.Добавить(ТабличныйДокумент, ИмяПечатнойФормы);
	МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
	МодульРаботаСПочтовымиСообщениямиКлиент.ОтправитьТабличныеДокументы(ТабличныеДокументы, ИмяПечатнойФормы, ПараметрыОтправки);
КонецПроцедуры

&НаСервере
функция ПолучитьИмяОтправителя()
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	ИмяОтправителя = НастройкиОтправкиSMS.ИмяОтправителя;
	Если НЕ ЗначениеЗаполнено(ИмяОтправителя)Тогда
		ИмяОтправителя = "Alterra"; 
	КонецЕсли;
    Возврат ИмяОтправителя;
КонецФункции

&НаСервере
Функция СформироватьАктПеревозчика()
	Если Не Объект.Ссылка.Пустая() Тогда
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Объект.Ссылка);

		СсылкаНаОбработку = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Акт перевозчика (Печатная форма)", Истина);
		Если ЗначениеЗаполнено(СсылкаНаОбработку) Тогда
			Возврат ПроверитьТабДок(ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(СсылкаНаОбработку).СформироватьАктПеревозчика(МассивДокументов));
		КонецЕсли;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПроверитьТабДок(ТабличныйДокумент)
	Если ТабличныйДокумент <> Неопределено И ТабличныйДокумент.ВысотаТаблицы <> 0 И ТабличныйДокумент.ШиринаТаблицы <> 0 Тогда
		Возврат ТабличныйДокумент;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОтгрузитьТранзитныйЗаказ(Команда)
	ОтгрузитьТранзитныйЗаказНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОтгрузитьТранзитныйЗаказНаСервере()
	Если Объект.ТранзитФизЛицо Тогда 
		Отказ= Ложь;
		Документы.РейсОтПоставщика.ОтгрузитьТранзитныйЗаказНаСервере(Объект, (Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС), Отказ);
		Если Отказ Тогда
			Сообщить("Распределение не произошло!", СтатусСообщения.ОченьВажное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СеткаПоставок

&НаКлиенте
Процедура ОткрытьСетку(Команда)
	ОчиститьСообщения();
	Если Не ТаблицаЗаказовИзменена ИЛИ Не Модифицированность И Объект.Проведен Тогда  
		ТекущаяСтрока = Элементы.РасчетДоставки.ТекущиеДанные;
		ДанныеЗаказа = ПолучитьДанныеЗаказа(ТекущаяСтрока.ДокументОснование);
		ПараметрыОткрытияФормыПланировщика = Новый Структура;
		ПериодОткрытия = ?(ТекущаяСтрока.ДатаВремяРазгрузки='00010101' ИЛИ ТекущаяСтрока.ДатаВремяРазгрузки=НачалоДня(ТекущаяСтрока.ДатаВремяРазгрузки), Объект.ДатаПрибытияНаСклад, ТекущаяСтрока.ДатаВремяРазгрузки);
		ПараметрыОткрытияФормыПланировщика.Вставить("Период", ПериодОткрытия);
		ПараметрыОткрытияФормыПланировщика.Вставить("ИзФормыЗаказа", Истина);
		ПараметрыОткрытияФормыПланировщика.Вставить("Секция", ДанныеЗаказа.Секция);
		ПараметрыОткрытияФормыПланировщика.Вставить("ПродолжительностьРазгрузки", ТекущаяСтрока.ПродолжительностьРазгрузки);
		ПараметрыОткрытияФормыПланировщика.Вставить("ЗаказПоставщику", ТекущаяСтрока.ДокументОснование);
		
		Если ТекущаяСтрока.АдресОборудованияЗаказа <> "" Тогда
			СписокДопРесурсов = ПолучитьИзВременногоХранилища(ТекущаяСтрока.АдресОборудованияЗаказа);
		КонецЕсли;
		ПараметрыОткрытияФормыПланировщика.Вставить("ДополнительныеРесурсы", СписокДопРесурсов); 
		
		ОткрытьФорму("Обработка.ПланировщикПоставокНаСклад.Форма", ПараметрыОткрытияФормыПланировщика, ЭтаФорма,,,, Новый ОписаниеОповещения("ОтобразитьВремяДоставки", ЭтотОбъект));
	Иначе
		ТекстСообщения = "";
		Если ТаблицаЗаказовИзменена Тогда
			ТекстСообщения = "В таблицу с заказами был добавлен новый документ. ";	
		ИначеЕсли Модифицированность Тогда
			ТекстСообщения = "Документ был изменен. ";
		КонецЕсли;
		
		ТекстСообщения =ТекстСообщения + "Необходимо провести рейс!";
		Сообщить(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаказа(Заказ)
	ДанныеЗаказа = Новый Структура;
	ДанныеЗаказа.Вставить("Секция", Заказ.Секция);
	ДанныеЗаказа.Вставить("Дата", Заказ.ДатаПоступления);
	
	Возврат ДанныеЗаказа;
КонецФункции // ПолучитьСекциюЗаказа()

&НаСервере
Процедура ОтобразитьВремяДоставки(РезультатЗакрытия=Неопределено, ДополнительныеПараметры=Неопределено) Экспорт
	Если Не Объект.ПометкаУдаления Тогда
		//собрать данные по дате поступления поставок
		//добавить даты в таблицу
		ДокументыОснования = Объект.РасчетДоставки.Выгрузить(,"ДокументОснование");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК НачалоРазгрузки,
		|	ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки) КАК КонецРазгрузки,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяПриездаФакт КАК ДатаВремяПриездаФакт,
		|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки КАК ПродолжительностьРазгрузки,
		|	ГрафикПоставокНаСкладСрезПоследних.Оборудование КАК Оборудование,
		|	ГрафикПоставокНаСкладСрезПоследних.КоличествоИспользуется КАК КоличествоИспользуется,
		|	ГрафикПоставокНаСкладСрезПоследних.СогласованоСоСкладом КАК СогласованоСоСкладом
		|ИЗ
		|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних(, ЗаказПоставщику В (&СписокЗаказов)) КАК ГрафикПоставокНаСкладСрезПоследних
		|ИТОГИ
		|	МАКСИМУМ(СогласованоСоСкладом),
		|	МАКСИМУМ(НачалоРазгрузки),
		|	МАКСИМУМ(КонецРазгрузки),
		|	МАКСИМУМ(ДатаВремяПриездаФакт),
		|	МАКСИМУМ(ПродолжительностьРазгрузки)
		|ПО
		|	ЗаказПоставщику";
		Запрос.УстановитьПараметр("СписокЗаказов", ДокументыОснования);
		Результат = Запрос.Выполнить();
		ВыборкаЗаказ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗаказПоставщику");
		Пока ВыборкаЗаказ.Следующий() Цикл
			ОтборСтрокВТЧ = Новый Структура;
			ОтборСтрокВТЧ.Вставить("ДокументОснование", ВыборкаЗаказ.ЗаказПоставщику);
			СтрПоставки = Объект.РасчетДоставки.НайтиСтроки(ОтборСтрокВТЧ);
			СписокОборудования = Новый СписокЗначений;
			Выборка = ВыборкаЗаказ.Выбрать();
			Пока Выборка.Следующий() Цикл 
				Стр = Новый Структура;
				Стр.Вставить("Ресурс", Выборка.Оборудование);
				Стр.Вставить("ТребуемоеКоличество", Выборка.КоличествоИспользуется);
				СписокОборудования.Добавить(Стр);
			КонецЦикла;
			
			Для Каждого Стр Из СтрПоставки Цикл
				Если ВыборкаЗаказ.НачалоРазгрузки = НачалоДня(ВыборкаЗаказ.НачалоРазгрузки) Тогда
					Стр.ВремяРазгрузки = "";
				Иначе
					Стр.ВремяРазгрузки = Строка(Формат(ВыборкаЗаказ.НачалоРазгрузки,"ДФ=HH:mm")) + "-" + Строка(Формат(ВыборкаЗаказ.КонецРазгрузки,"ДФ=HH:mm"));
				КонецЕсли;	
				Стр.ПродолжительностьРазгрузки = ВыборкаЗаказ.ПродолжительностьРазгрузки;
				Стр.ДатаВремяРазгрузки = ВыборкаЗаказ.НачалоРазгрузки;
				Стр.АдресОборудованияЗаказа = ПоместитьВоВременноеХранилище(СписокОборудования, Новый УникальныйИдентификатор);
				Стр.СогласованоСоСкладом = ВыборкаЗаказ.СогласованоСоСкладом; 
				Стр.СкладРазгрузки = Стр.ДокументОснование.Склад;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ОтобразитьВремяДоставки()

&НаКлиенте
Процедура РасчетДоставкиВремяРазгрузкиНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьСетку(Команды.ОткрытьСетку);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПрибытияНаСкладПриИзменении(Элемент)
	ПроверкаДатыПрибытияНаСкладСервер();
КонецПроцедуры

&НаСервере
Процедура ПроверкаДатыПрибытияНаСкладСервер()
	Если Объект.ДатаПрибытияНаСклад <> Объект.Ссылка.ДатаПрибытияНаСклад И Объект.РасчетДоставки.Количество() > 0 Тогда
		Сообщить("После записи документа или попытке открыть сетку поставок, необходимо выбрать новое время для заказов поставщика в сетке", СтатусСообщения.ОченьВажное);
	КонецЕсли;
КонецПроцедуры // ПроверкаДатыПрибытияНаСкладСервер()

#КонецОбласти

&НаСервере
Процедура РасчитатьСтоимостьТранспортнойРаботы()  
	Если Объект.Вес > 0  И Объект.ПротяженностьРейса > 0 Тогда
		Объект.СтоимостьТранспортнойРаботыПоВесу = Объект.СтоимостьТовара/((Объект.Вес/1000)*Объект.ПротяженностьРейса); 
	Иначе
		Объект.СтоимостьТранспортнойРаботыПоВесу = 0;	
	КонецЕсли;
	Если Объект.Объем > 0  И Объект.ПротяженностьРейса > 0 Тогда
		Объект.СтоимостьТранспортнойРаботыПоОбъему = Объект.СтоимостьТовара/(Объект.Объем*Объект.ПротяженностьРейса);
	Иначе
		Объект.СтоимостьТранспортнойРаботыПоОбъему = 0;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПротяженностьРейсаПриИзменении(Элемент)
	РасчитатьСтоимостьТранспортнойРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СФП_МаркерыКлиент.МаркерНачало("Рейс от поставщика: Проведение из формы", Объект.Номер);
	КонецЕсли;
КонецПроцедуры

#Область ЭТрН

&НаКлиенте
Процедура СоздатьЭТрННажатие(Элемент)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Объект.ПометкаУдаления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ помечен на удаление!");
		Иначе
			//МассивДляВозврата = СоздатьЭТрННажатие_Сервер();
			//Если ЗначениеЗаполнено(МассивДляВозврата) Тогда
			//	Для Каждого СтруктураПараметров Из МассивДляВозврата Цикл
			//		ОткрытьФорму(
			//			"Документ.Saby_ТранспортнаяНакладная.Форма.ФормаДокумента", 
			//			СтруктураПараметров,
			//			ЭтаФорма, 
			//			Новый УникальныйИдентификатор);
			//	КонецЦикла;
			//Иначе
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По данному рейсу созданы все необходимые накладные!");
			//КонецЕсли;
		КонецЕсли;
	Иначе     
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо сначала записать документ!");
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Функция СоздатьЭТрННажатие_Сервер()
//	
//	МассивДляВозврата = Новый Массив;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =	
//		"ВЫБРАТЬ
//		|	Рейс.ЗаказНаДоставку КАК Ссылка,
//		|	Рейс.ЗаказНаДоставку.Организация КАК Организация,
//		|	Рейс.ЗаказНаДоставку.Контрагент КАК Контрагент
//		|ИЗ
//		|	Документ.РейсОтПоставщика.РасчетДоставки КАК Рейс
//		|ГДЕ
//		|	Рейс.Ссылка = &Рейс
//		|	И НЕ (УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Рейс.Ссылка), Рейс.ЗаказНаДоставку) В
//		|				(ВЫБРАТЬ
//		|					Накладная.Ссылка.ДокументОснование_Идентификатор КАК ИдентификаторРейса,
//		|					Накладная.Заказ КАК ЗаказНаДоставку
//		|				ИЗ
//		|					Документ.Saby_ТранспортнаяНакладная.ЗаказыНаДоставкуОтПоставщика КАК Накладная
//		|				ГДЕ
//		|					НЕ Накладная.Ссылка.ПометкаУдаления)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	Рейс.ЗаказНаДоставку,
//		|	Рейс.ЗаказНаДоставку.Организация,
//		|	Рейс.ЗаказНаДоставку.Контрагент
//		|ИТОГИ ПО
//		|	Организация,
//		|	Контрагент";

//	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
//		
//	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	Пока ВыборкаОрганизация.Следующий() Цикл
//		Если ЗначениеЗаполнено(ВыборкаОрганизация.Организация) Тогда
//			ВыборкаКонтрагент = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//			Пока ВыборкаКонтрагент.Следующий() Цикл
//				Если ЗначениеЗаполнено(ВыборкаКонтрагент.Контрагент) Тогда
//					МассивЗаказов = Новый Массив;
//					
//					ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
//					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//						Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
//							МассивЗаказов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
//						КонецЕсли;
//					КонецЦикла;
//						
//					Если ЗначениеЗаполнено(МассивЗаказов) Тогда
//						МассивДляВозврата.Добавить(Новый Структура("Рейс, МассивЗаказов", Объект.Ссылка, МассивЗаказов));
//					КонецЕсли;
//				КонецЕсли;
//			КонецЦикла;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат МассивДляВозврата;
//	
//КонецФункции

&НаКлиенте
Процедура ОбновитьЭТрННажатие(Элемент)  
	ОбновитьКомандыЭТрН();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьКомандыЭТрН();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыЭТрН()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		УдалитьДинамическиеДекорацииЭТрН();
	
		//Запрос = Новый Запрос;
		//Запрос.Текст =	
		//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Накладная.Ссылка) КАК Идентификатор,
		//	|	ПРЕДСТАВЛЕНИЕ(Накладная.Ссылка) КАК НакладнаяПредставление
		//	|ИЗ
		//	|	Документ.Saby_ТранспортнаяНакладная КАК Накладная
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РейсОтПоставщика.РасчетДоставки КАК Рейс
		//	|		ПО Накладная.ДокументОснование_Идентификатор = УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Рейс.Ссылка)
		//	|ГДЕ
		//	|	Рейс.Ссылка = &Рейс
		//	|	И НЕ Накладная.ПометкаУдаления";

		//Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);

		//Выборка = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	Элемент = Элементы.Добавить("Накладная" + СтрЗаменить(Строка(Выборка.Идентификатор), "-", "_"), Тип("ДекорацияФормы"), Элементы.ДинамическиеДекорацииЭТрН); 
		//	Элемент.Вид = ВидДекорацииФормы.Надпись;
		//	Элемент.Заголовок = Выборка.НакладнаяПредставление;
		//	Элемент.Гиперссылка = Истина;
		//	Элемент.Ширина = 45;
		//	Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		//	Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		//	Элемент.УстановитьДействие("Нажатие", "ОткрытьСсылкуЭТрН"); 
		//КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДинамическиеДекорацииЭТрН()    
	Массив = Элементы.ДинамическиеДекорацииЭТрН.ПодчиненныеЭлементы;
	Если ЗначениеЗаполнено(Массив) Тогда
		Элементы.Удалить(Массив[0]);
		УдалитьДинамическиеДекорацииЭТрН();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылкуЭТрН(Элемент)  
	//ПоказатьЗначение(, СсылкаЭТрН(СтрЗаменить(СтрЗаменить(Элемент.Имя, "_", "-"), "Накладная", "")));
КонецПроцедуры

//&НаСервере
//Функция СсылкаЭТрН(УИД)  
//	Возврат Документы.Saby_ТранспортнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
//КонецФункции

#КонецОбласти


#Область ГруппаПоставки

&НаКлиенте
Процедура ПредупредитьПользователя(ТекстОповещения)
	ПоказатьОповещениеПользователя("Сетка поставок | заказ "+ Объект.Номер, ПолучитьНавигационнуюСсылку(Объект.Ссылка), ТекстОповещения, БиблиотекаКартинок.ИсторияДанных, СтатусОповещенияПользователя.Важное); 
КонецПроцедуры

&НаКлиенте
Процедура ПресчитатьСекциюНаКлиенте(Команда)
	СекцияИзменилась = Ложь;
	МассивСкладов = Новый массив;
	ИдентификаторыВыделенныхСтрок = Элементы.ГруппаПоставки.ВыделенныеСтроки;
	
	Для каждого Идентификатор из ИдентификаторыВыделенныхСтрок Цикл
		ТекущаяСтрока = Объект.ГруппаПоставки.НайтиПоИдентификатору(Идентификатор);
		МассивСкладов.Добавить(ТекущаяСтрока.Склад);
	КонецЦикла;
	
	ПресчитатьСекцию(СекцияИзменилась, МассивСкладов);
	Если СекцияИзменилась Тогда 
		ПредупредитьПользователя("Секция изменилась. Запланируйте новое время в сетке");
		ДанныеПоставкиИзменились = Истина;
	КонецЕсли;
	
	ПересчитатьПоНормативу(ИдентификаторыВыделенныхСтрок);
КонецПроцедуры

&НаСервере
Процедура ПресчитатьСекцию(СекцияИзменилась, Склады = Неопределено)
	
	РезультатЗапроса = Документы.РейсОтПоставщика.ПолучитьДанныеПоСкладамИСекциям(Объект, Склады);
	ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтог.Следующий() Тогда
		СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаИтог.Склад));
		Выборка = ВыборкаИтог.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ВыборкаИтог.ОбъемПоСекции = Выборка.ОбъемПоСекции Тогда
				СекцияБыла = СтрокиТекущегоСклада[0].Секция;
				СтрокиТекущегоСклада[0].Секция = Выборка.Секция;
				 
				Если СекцияБыла <> СтрокиТекущегоСклада[0].Секция Тогда		
					ВремяПоступления = '00010101000000';//
					СекцияИзменилась = Истина;
				КонецЕсли;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборВремениВручнуюНаКлиенте(Команда)
	ИдентификаторыВыделенныхСтрок = Элементы.ГруппаПоставки.ВыделенныеСтроки;
	Если ИдентификаторыВыделенныхСтрок.Количество()>1 Тогда
		Сообщить("Необходимо выделить одну строку для выбора времени вручную");
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ГруппаПоставки.ТекущиеДанные;
	Если ТекущаяСтрока.ПродолжительностьРазгрузки = 0 Тогда
		Сообщить("Укажите ненулевую длительность погрузки!");
		Возврат;
	КонецЕсли;
	
	//записать изменения
	Если Модифицированность Тогда
		//Предупреждение("Документ будет записан!",2,"Изменения в поставке");
		Если Объект.Проведен Тогда
			ЭтотОбъект.Записать();
		Иначе
			Сообщить("Документ требуется провести!");
			Возврат;
		КонецЕсли;
		ЗаписатьИнтервалДоставкиСервер(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЕсли;
	Если ТекущаяСтрока.Секция <> ПредопределенноеЗначение("Справочник.РабочиеУчастки.ПустаяСсылка") Тогда
		ПараметрыОткрытияФормыПодбора = Новый Структура;
		ПараметрыОткрытияФормыПодбора.Вставить("Период", ?(ТекущаяСтрока.ДатаРазгрузки=Дата(1,1,1), ТекущаяДата(), ТекущаяСтрока.ДатаРазгрузки));
		ПараметрыОткрытияФормыПодбора.Вставить("Секция", ТекущаяСтрока.Секция);
		ПараметрыОткрытияФормыПодбора.Вставить("ИзФормыЗаказа", Истина);
		ПараметрыОткрытияФормыПодбора.Вставить("ПродолжительностьРазгрузки", ТекущаяСтрока.ПродолжительностьРазгрузки);
		ПараметрыОткрытияФормыПодбора.Вставить("ЗаказПоставщику", Объект.Ссылка);
		ПараметрыОткрытияФормыПодбора.Вставить("КомментарийКПоставке", ТекущаяСтрока.ПримечаниеКПоставке);
		
		СписокДопРесурсов = Новый СписокЗначений;
		Если ТекущаяСтрока.Эстакада Тогда
			СписокДопРесурсов.Добавить(ПолучитьЭстакаду(Истина));
		Иначе
			СписокДопРесурсов.Добавить(ПолучитьЭстакаду(Ложь));
		КонецЕсли;
		ПараметрыОткрытияФормыПодбора.Вставить("ДополнительныеРесурсы", СписокДопРесурсов);
		
		//ПараметрыОткрытияФормыПодбора.Вставить("Оборудование", ?(ТекущаяСтрока.Эстакада, ПолучитьЭстакаду(Истина), ПолучитьЭстакаду(Ложь))); 
		//ПараметрыОткрытияФормыПодбора.Вставить("НельзяВыбиратьДату", ЕстьРейсПоПоставке());
		
		ОткрытьФорму("Обработка.ПланировщикПоставокНаСклад.Форма", ПараметрыОткрытияФормыПодбора, ЭтаФорма,,,,Новый ОписаниеОповещения("ОбновитьДанныеПоставкиПослеЗакрытияПланировщика", ЭтотОбъект));
		ОчиститьСообщения();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоставкиПослеЗакрытияПланировщика(Результат=Неопределено, ДополнительныеПараметры=Неопределено) Экспорт
	 ОбновитьВремяИИнтервалПоставки();
КонецПроцедуры

&НаСервере
Функция ПолучитьЭстакаду(НеПустая = Истина)
	Если НеПустая Тогда
		Возврат Справочники.ТехническиеРесурсыСклада.НайтиПоКоду("000000001");
	Иначе 
		Возврат Справочники.ТехническиеРесурсыСклада.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаписатьИнтервалДоставкиСервер(ИдентицикаторТекущейСтроки)
	
	ТекущаяСтрока = Объект.ГруппаПоставки.НайтиПоИдентификатору(ИдентицикаторТекущейСтроки);
	
	Если //ДанныеПоставкиИзменились И 
		Альтерра_СеткаПоставок.ЕстьСекцииУСклада(ТекущаяСтрока.Склад) Тогда
		ПараметрыЗаписи = Новый Соответствие;
		ОсновнойПоток = ПолучитьПотокПоСекции(ТекущаяСтрока.Секция);
		ЗначениеПараметров = Новый Структура;
		ЗначениеПараметров.Вставить("Поток", ОсновнойПоток);
		ЗначениеПараметров.Вставить("ЗаказПоставщику", Объект.Ссылка);
		ЗначениеПараметров.Вставить("ДатаВремяРазгрузкиПлан", ТекущаяСтрока.ДатаРазгрузки + Минута(ТекущаяСтрока.ВремяПоступления)*60 + Час(ТекущаяСтрока.ВремяПоступления)*3600);
		ЗначениеПараметров.Вставить("ПродолжительностьРазгрузки", ТекущаяСтрока.ПродолжительностьРазгрузки);
		ЗначениеПараметров.Вставить("СогласованоСоСкладом", ТекущаяСтрока.СогласованоСоСкладом);
		ЗначениеПараметров.Вставить("ТекстПоставки", ТекущаяСтрока.ПримечаниеКПоставке);
		ЗначениеПараметров.Вставить("Склад", ТекущаяСтрока.Склад);
		ЗначениеПараметров.Вставить("Оборудование", ?(ТекущаяСтрока.Эстакада, ПолучитьЭстакаду(Истина), ПолучитьЭстакаду(Ложь)));
		ПараметрыЗаписи.Вставить(Объект.Ссылка, ЗначениеПараметров);
		Альтерра_СеткаПоставок.ИзменитьДанныеСеткиПоставок(Объект.Ссылка, "Новое",  ПараметрыЗаписи, Истина, ТекущаяСтрока.Склад, Альтерра_СеткаПоставок.ПолучитьДопПотокиПоСкладу(ТекущаяСтрока.Склад, Объект.Ссылка, ОсновнойПоток));
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПересчитатьПоНормативуНаКлиенте(Команда)
	ИдентификаторыВыделенныхСтрок = Элементы.ГруппаПоставки.ВыделенныеСтроки;
	ПересчитатьПоНормативу(ИдентификаторыВыделенныхСтрок);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПоНормативу(ИдентификаторыВыделенныхСтрок = Неопределено)
	МассивСкладовИНормативов = Новый ТаблицаЗначений;
	МассивСкладовИНормативов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	МассивСкладовИНормативов.Колонки.Добавить("Норматив", Новый ОписаниеТипов("СправочникСсылка.НормативыПриемкиПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("Поток", Новый ОписаниеТипов("СправочникСсылка.ПотокиТранспортныхСредствПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаНачалаИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаОкончанияИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ПродолжительностьРазгрузки", Новый ОписаниеТипов("Число"));
	МассивСкладовИНормативов.Колонки.Добавить("Эстакада", Новый ОписаниеТипов("Булево"));
	
	Для каждого Идентификатор из ИдентификаторыВыделенныхСтрок Цикл
		ТекущаяСтрока = Объект.ГруппаПоставки.НайтиПоИдентификатору(Идентификатор);
		НоваяСтрока = МассивСкладовИНормативов.Добавить();//поправить ТЗ
		НоваяСтрока.Склад = ТекущаяСтрока.Склад;
		НоваяСтрока.Норматив = ТекущаяСтрока.Норматив;
		НоваяСтрока.Поток = ТекущаяСтрока.Поток;
		НоваяСтрока.ДатаНачалаИнтервала = ТекущаяСтрока.ДатаРазгрузки;
		НоваяСтрока.ДатаОкончанияИнтервала = ТекущаяСтрока.ДатаРазгрузки+ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.ПродолжительностьРазгрузки = ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.Эстакада = ТекущаяСтрока.Эстакада;
	КонецЦикла;
	ЗаполнитьПоНормативу(, МассивСкладовИНормативов);
	ДанныеПоставкиИзменились = Истина;
	ПроверитьИнтервалыСкладовНаДоступность(МассивСкладовИНормативов);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоНормативу(РучнойПересчет=Ложь, ТЗСкладИНорматив = Неопределено)

	Запрос = Новый Запрос; // Переписать запрос на рейс от поставщика
	Запрос.Текст = "ВЫБРАТЬ
		|	ТЗНормативы.Склад КАК Склад,
		|	ТЗНормативы.Норматив КАК Норматив
		|ПОМЕСТИТЬ ВТНормативыПоСкладу
		|ИЗ
		|	&ТЗНормативы КАК ТЗНормативы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Документ КАК ДокументОснование
		|ПОМЕСТИТЬ ВТОснованияРейса
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровТовары.Ссылка КАК Перемещение,
		|	ПеремещениеТоваровТовары.Упаковка КАК Упаковка,
		|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТНормативыПоСкладу.Норматив КАК Норматив
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОснованияРейса КАК ВТОснованияРейса
		|		ПО (ВТОснованияРейса.ДокументОснование = ЗаказНаДоставкуКлиентуОснования.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНормативыПоСкладу КАК ВТНормативыПоСкладу
		|			ПО ВТНормативыПоСкладу.Склад = ПеремещениеТоваровТовары.Ссылка.СкладПолучатель
		|		ПО (ЗаказНаДоставкуКлиентуОснования.Документ = ПеремещениеТоваровТовары.Ссылка) 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Перемещение КАК Перемещение,
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Перемещение.СкладПолучатель КАК Склад,
		|	втТовары.Норматив КАК Норматив,
		|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА втТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА спрНоменклатура.ЕдиницаИзмерения
		|		ИНАЧЕ втТовары.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	спрНоменклатура.ВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
		|	спрНоменклатура.ОбъемЕдиницаИзмерения КАК НоменклатураОбъемЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА спрНоменклатура.ВесЗнаменатель <> 0
		|			ТОГДА спрНоменклатура.ВесЧислитель / спрНоменклатура.ВесЗнаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВесКоэффициентНоменклатура,
		|	ВЫБОР
		|		КОГДА спрНоменклатура.ОбъемЗнаменатель <> 0
		|			ТОГДА спрНоменклатура.ОбъемЧислитель / спрНоменклатура.ОбъемЗнаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОбъемКоэффициентНоменклатура
		|ПОМЕСТИТЬ втНоменклатураДокумента
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО втТовары.Номенклатура = спрНоменклатура.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втНоменклатураДокумента.Номенклатура КАК Номенклатура,
		|	втНоменклатураДокумента.Упаковка КАК Упаковка,
		|	втНоменклатураДокумента.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втНоменклатураДокумента.Перемещение КАК Ссылка,
		|	втНоменклатураДокумента.Склад КАК Склад,      
		|	ВЫБОР
		|		КОГДА НормативыПриемкиПоставкиНаСклад.ЕдИзмеренияЗнаменателя.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
		|			ТОГДА втНоменклатураДокумента.НоменклатураВесЕдиницаИзмерения
		|		ИНАЧЕ втНоменклатураДокумента.НоменклатураОбъемЕдиницаИзмерения
		|	КОНЕЦ КАК НоменклатураЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА НормативыПриемкиПоставкиНаСклад.ЕдИзмеренияЗнаменателя.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
		|			ТОГДА втНоменклатураДокумента.ВесКоэффициентНоменклатура
		|		ИНАЧЕ втНоменклатураДокумента.ОбъемКоэффициентНоменклатура
		|	КОНЕЦ КАК НоменклатураКоэффициент,
		|	НормативыПриемкиПоставкиНаСклад.Норматив КАК Норматив,
		|	НормативыПриемкиПоставкиНаСклад.ЕдИзмеренияЗнаменателя КАК ЕдИзмеренияЗнаменателя,
		|	НормативыПриемкиПоставкиНаСклад.МинимальноеВремя КАК МинимальноеВремя,
		|	НормативыПриемкиПоставкиНаСклад.МаксимальноеВремя КАК МаксимальноеВремя
		|ПОМЕСТИТЬ втИтогДляВремени
		|ИЗ
		|	Справочник.НормативыПриемкиПоставкиНаСклад КАК НормативыПриемкиПоставкиНаСклад
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНоменклатураДокумента КАК втНоменклатураДокумента   
		|		ПО втНоменклатураДокумента.Норматив = НормативыПриемкиПоставкиНаСклад.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Упаковка КАК Упаковка,
		|	Итог.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Итог.НоменклатураКоэффициент КАК НоменклатураКоэффициент,
		|	Итог.НоменклатураЕдиницаИзмерения.Числитель КАК НоменклатураЕдиницаИзмеренияЧислитель,
		|	Итог.НоменклатураЕдиницаИзмерения.Знаменатель КАК НоменклатураЕдиницаИзмеренияЗнаменатель,
		|	Итог.ЕдИзмеренияЗнаменателя.Числитель КАК ЕдИзмеренияЗнаменателяЧислитель,
		|	Итог.Норматив КАК Норматив,
		|	ЕСТЬNULL(Итог.КоличествоУпаковок * Итог.НоменклатураКоэффициент * Итог.НоменклатураЕдиницаИзмерения.Числитель / Итог.НоменклатураЕдиницаИзмерения.Знаменатель * Итог.ЕдИзмеренияЗнаменателя.Знаменатель / Итог.ЕдИзмеренияЗнаменателя.Числитель * Итог.Норматив, 0) КАК ВремяРассчитанное,
		|	Итог.Ссылка КАК Ссылка,
		|	Итог.Склад КАК Склад,
		|	Итог.МинимальноеВремя КАК МинимальноеВремя,
		|	Итог.МаксимальноеВремя КАК МаксимальноеВремя
		|ИЗ
		|	втИтогДляВремени КАК Итог
		|ИТОГИ
		|	МАКСИМУМ(МинимальноеВремя),
		|	МАКСИМУМ(МаксимальноеВремя)
		|ПО
		|	Склад";
	Запрос.УстановитьПараметр("ТЗ", Объект.Основания.Выгрузить());
	Запрос.УстановитьПараметр("ТЗНормативы", ?(ТЗСкладИНорматив = Неопределено, Объект.ГруппаПоставки.Выгрузить(), ТЗСкладИНорматив));
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВремяРазгрузки = 0;
	Пока ВыборкаИтог.Следующий() Цикл 
		СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаИтог.Склад));
		ВыборкаДетальные = ВыборкаИтог.Выбрать();
		Пока ВыборкаДетальные.Следующий() Цикл
			ВремяРазгрузки = ВремяРазгрузки + ВыборкаДетальные.ВремяРассчитанное;
		КонецЦикла;
		СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = Мин(Макс(ВремяРазгрузки, ВыборкаИтог.МинимальноеВремя), ВыборкаИтог.МаксимальноеВремя);
		ОкрПродолжительностьРазгрузки = Окр(СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки, -1, РежимОкругления.Окр15как20);
		Если ОкрПродолжительностьРазгрузки < СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки Тогда
			СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = ОкрПродолжительностьРазгрузки+5;
		КонецЕсли;
	
		Если СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = 0 Тогда
			СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = СтрокиТекущегоСклада[0].Норматив.МинимальноеВремя;
		КонецЕсли;
	КонецЦикла;	
	
	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьПоНормативу()

&НаСервере
Процедура ПроверитьИнтервалыСкладовНаДоступность(МассивСкладовИНормативов)
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ИнтервалДоступен", Истина);
	РезультатПроверки.Вставить("СброситьВремя", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Рейс КАК Рейс,
	|	ТЧ.Склад КАК Склад,
	|	ТЧ.ДатаНачалаИнтервала КАК ДатаНачалаИнтервала,
	|	ТЧ.ДатаОкончанияИнтервала КАК ДатаОкончанияИнтервала,
	|	ТЧ.Поток КАК Поток,
	|	ТЧ.Эстакада КАК Эстакада
	|ПОМЕСТИТЬ втРесурсыДокумента
	|ИЗ
	|	&СписокОборудования КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ГрафикПоставокНаСкладСрезПоследних.Поток КАК Поток,
	|	втРесурсыДокумента.Склад КАК Склад,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК НачалоИнтервала,
	|	ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки) КАК КонецИнтервала,
	|	""Занятый интервал"" КАК Причина
	|ПОМЕСТИТЬ ВТЗанятыеИнтервалы
	|ИЗ
	|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРесурсыДокумента КАК втРесурсыДокумента
	|		ПО ГрафикПоставокНаСкладСрезПоследних.Поток = втРесурсыДокумента.Поток
	|			И (НЕ ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику = втРесурсыДокумента.Рейс)
	|
	|ГДЕ
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан <> &ПустаяДата
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику,
	|	ГрафикПоставокНаСкладСрезПоследних.Поток,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан,
	|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки,
	|	втРесурсыДокумента.ДатаНачалаИнтервала,
	|	втРесурсыДокумента.ДатаОкончанияИнтервала,
	|	втРесурсыДокумента.Склад
	|
	|ИМЕЮЩИЕ
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан МЕЖДУ втРесурсыДокумента.ДатаНачалаИнтервала И ДОБАВИТЬКДАТЕ(втРесурсыДокумента.ДатаОкончанияИнтервала, СЕКУНДА, -1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
	|	втРесурсыДокумента.Склад КАК Склад,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
	|	ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки) КАК ДатаВремяОкончанияРазгрузки,
	|	ГрафикПоставокНаСкладСрезПоследних.Оборудование КАК Оборудование,
	|	ВЫБОР
	|		КОГДА НЕ ГрафикПоставокНаСкладСрезПоследних.Оборудование = ЗНАЧЕНИЕ(Справочник.ТехническиеРесурсыСклада.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЭстакадаРегистр,
	|	ВЫБОР
	|		КОГДА втРесурсыДокумента.Эстакада
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЭстакадаДокумент,
	|	""Эстакада"" КАК Причина
	|ПОМЕСТИТЬ ВТЭстакада
	|ИЗ
	|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеУчастки КАК РабочиеУчастки
	|				ЛЕВОЕ СОЕДИНЕНИЕ втРесурсыДокумента КАК втРесурсыДокумента
	|				ПО РабочиеУчастки.Владелец = втРесурсыДокумента.Склад
	|			ПО ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция = РабочиеУчастки.Ссылка
	|		ПО ГрафикПоставокНаСкладСрезПоследних.Поток = ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка
	|
	|ГДЕ
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан <> &ПустаяДата
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику,
	|	втРесурсыДокумента.Склад,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан,
	|	ГрафикПоставокНаСкладСрезПоследних.Оборудование,
	|	втРесурсыДокумента.Эстакада,
	|	втРесурсыДокумента.ДатаНачалаИнтервала,
	|	втРесурсыДокумента.ДатаОкончанияИнтервала,
	|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки
	|
	|ИМЕЮЩИЕ
	|	(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан МЕЖДУ втРесурсыДокумента.ДатаНачалаИнтервала И ДОБАВИТЬКДАТЕ(втРесурсыДокумента.ДатаОкончанияИнтервала, СЕКУНДА, -1)
	|		ИЛИ ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки) МЕЖДУ втРесурсыДокумента.ДатаНачалаИнтервала И ДОБАВИТЬКДАТЕ(втРесурсыДокумента.ДатаОкончанияИнтервала, СЕКУНДА, -1)
	|		ИЛИ втРесурсыДокумента.ДатаНачалаИнтервала МЕЖДУ ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан И ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки)
	|		ИЛИ втРесурсыДокумента.ДатаОкончанияИнтервала МЕЖДУ ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан И ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки)) И
	|	ВЫБОР
	|		КОГДА НЕ ГрафикПоставокНаСкладСрезПоследних.Оборудование = ЗНАЧЕНИЕ(Справочник.ТехническиеРесурсыСклада.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ = ВЫБОР
	|		КОГДА втРесурсыДокумента.Эстакада
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ И
	|	ВЫБОР
	|		КОГДА втРесурсыДокумента.Эстакада
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗанятыеИнтервалы.Склад КАК Склад,
	|	ВТЗанятыеИнтервалы.Причина КАК Причина
	|ИЗ
	|	ВТЗанятыеИнтервалы КАК ВТЗанятыеИнтервалы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТЭстакада.Склад,
	|	ВТЭстакада.Причина
	|ИЗ
	|	ВТЭстакада КАК ВТЭстакада";
		
	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокОборудования", МассивСкладовИНормативов);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущиеСтроки = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаДетальныеЗаписи.Склад));
		Если ТекущиеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока = ТекущиеСтроки[0];
			Сообщить("Изменились параметры, влияющие на график поставки на склад '"+Строка(ВыборкаДетальныеЗаписи.Склад)+"' по причине: "+Строка(ВыборкаДетальныеЗаписи.Причина));
			Если ВыборкаДетальныеЗаписи.Причина = "Эстакада" Тогда
				ТекущаяСтрока.ВремяПоступления = '00010101000000';
				ТекущаяСтрока.Поток = ПредопределенноеЗначение("Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
//	НачалоИнтервала = ДатаРазгрузки + (Час(ВремяПоступления)*3600+ Минута(ВремяПоступления)*60);
//	КонецИнтервала = ДатаРазгрузки + (Час(ВремяПоступления)*3600+ Минута(ВремяПоступления)*60+ПродолжительностьРазгрузки*60); 
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоИнтервала, КонецИнтервала, ВыборкаДетальныеЗаписи.НачалоИнтервала, ВыборкаДетальныеЗаписи.КонецИнтервала) ИЛИ ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(ВыборкаДетальныеЗаписи.НачалоИнтервала, ВыборкаДетальныеЗаписи.КонецИнтервала, НачалоИнтервала, КонецИнтервала) Тогда
//			РезультатПроверки.ИнтервалДоступен = Ложь;
//			РезультатПроверки.СброситьВремя = Истина;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	 ДобавитьКДате(ДобавитьКДате(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, час, Час(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)), минута, минута(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)) КАК НачалоИнтервала,
//	|	ДобавитьКДате(ДобавитьКДате(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, час, Час(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)), минута, минута(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)+ РасписаниеСкладскихПотоковСрезПоследних.ПродолжительностьИнтервала) как КонецИнтервала 
//	|ИЗ
//	|	РегистрСведений.РасписаниеСкладскихПотоков.СрезПоследних(
//	|			,
//	|			ДатаДоставки = &Период
//	|				И Поток = &Поток) КАК РасписаниеСкладскихПотоковСрезПоследних";
//	Запрос.УстановитьПараметр("Поток", Поток);
//	УстановитьПривилегированныйРежим(Истина);
//	Результат = Запрос.Выполнить();
//	УстановитьПривилегированныйРежим(Ложь);
//	ВыборкаИнтервалов = Результат.Выбрать();
//	
//	Для каждого Строка из МассивСкладовИНормативов Цикл
//	 	СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", Строка.Склад));
//		НачалоЗакрытогоИнтервала = НачалоДня(СтрокиТекущегоСклада[0].ДатаРазгрузки);
//		КонецЗакрытогоИнтервала = НачалоЗакрытогоИнтервала;
//		Пока ВыборкаИнтервалов.Следующий() Цикл 
//			Если НачалоЗакрытогоИнтервала = КонецЗакрытогоИнтервала Тогда
//				КонецЗакрытогоИнтервала = ВыборкаИнтервалов.НачалоИнтервала;
//			КонецЕсли;
//			Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоИнтервала, КонецИнтервала, НачалоЗакрытогоИнтервала, КонецЗакрытогоИнтервала) ИЛИ ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоЗакрытогоИнтервала, КонецЗакрытогоИнтервала, НачалоИнтервала, КонецИнтервала) Тогда
//				РезультатПроверки.ИнтервалДоступен = Ложь;
//			КонецЕсли;
//			НачалоЗакрытогоИнтервала = ВыборкаИнтервалов.КонецИнтервала;
//			КонецЗакрытогоИнтервала = НачалоЗакрытогоИнтервала;
//		КонецЦикла;
//		
//		КонецЗакрытогоИнтервала = КонецДня(НачалоЗакрытогоИнтервала);
//		Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоИнтервала, КонецИнтервала, НачалоЗакрытогоИнтервала, КонецЗакрытогоИнтервала) ИЛИ ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоЗакрытогоИнтервала, КонецЗакрытогоИнтервала, НачалоИнтервала, КонецИнтервала) Тогда
//			РезультатПроверки.ИнтервалДоступен = Ложь;
//		КонецЕсли;
//	
//		Если Строка.ПродолжительностьРазгрузки < СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки 
//			И СтрокиТекущегоСклада[0].ВремяПоступления <> '00010101000000' 
//			И СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки<>0 Тогда
//			//Проверить интервал может ли располагаться в текущих границах
//			Если НЕ РезультатПроверки.ИнтервалДоступен Тогда
//				Сообщить("Из-за изменения таблицы товаров, интервал был увеличен. Необходимо выбрать время начала разгрузки вручную");
//				Если РезультатПроверки.СброситьВремя Тогда
//					СтрокиТекущегоСклада[0].ВремяПоступления = '00010101000000';
//					Поток = ПредопределенноеЗначение("Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.ПустаяСсылка");
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьВремяИИнтервалПоставки() 
	
	МассивСкладов = Новый Массив;
	Для каждого Строка из Объект.ГруппаПоставки Цикл
		МассивСкладов.Добавить(Строка.Склад);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ГрафикПоставокНаСкладСрезПоследних.Оборудование КАК Оборудование,
		|	ГрафикПоставокНаСкладСрезПоследних.Поток КАК Поток,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
		|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки КАК ПродолжительностьРазгрузки,
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция.Владелец КАК Склад,
		|	ГрафикПоставокНаСкладСрезПоследних.ТекстПоставки КАК ТекстПоставки, 
		|	ГрафикПоставокНаСкладСрезПоследних.СогласованоСоСкладом КАК СогласованоСоСкладом
		|ИЗ
		|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
		|		ПО ГрафикПоставокНаСкладСрезПоследних.Поток = ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка
		|ГДЕ
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция.Владелец В(&Склад)
		|	И ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику = &Рейс 
		|ИТОГИ ПО
		|	Склад";
	
	Запрос.УстановитьПараметр("Склад", МассивСкладов);//
	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаСклад = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
		ТекущиеСтроки = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаСклад.Склад));
		ВыборкаДетальныеЗаписи = ВыборкаСклад.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТекущиеСтроки.Количество() > 0 Тогда
				ТекущаяСтрока = ТекущиеСтроки[0];
				ТекущаяСтрока.ДатаРазгрузки = ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан;
				ТекущаяСтрока.ПродолжительностьРазгрузки = ВыборкаДетальныеЗаписи.ПродолжительностьРазгрузки;
				ТекущаяСтрока.ВремяПоступления = ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан;
				ТекущаяСтрока.Поток = ВыборкаДетальныеЗаписи.Поток;
				ТекущаяСтрока.Эстакада = ?(ТекущаяСтрока.Эстакада, Истина, ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Оборудование));
				ТекущаяСтрока.СогласованоСоСкладом = ВыборкаДетальныеЗаписи.СогласованоСоСкладом;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПоставкиСекцияПриИзменении(Элемент)
	ГруппаПоставкиСекцияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаПоставкиСекцияПриИзмененииНаСервере()
	МассивСкладовИНормативов = Новый ТаблицаЗначений;
	МассивСкладовИНормативов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	МассивСкладовИНормативов.Колонки.Добавить("Норматив", Новый ОписаниеТипов("СправочникСсылка.НормативыПриемкиПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("Поток", Новый ОписаниеТипов("СправочникСсылка.ПотокиТранспортныхСредствПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаНачалаИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаОкончанияИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ПродолжительностьРазгрузки", Новый ОписаниеТипов("Число"));
	МассивСкладовИНормативов.Колонки.Добавить("Эстакада", Новый ОписаниеТипов("Булево"));
	
	Для каждого ТекущаяСтрока из Объект.ГруппаПоставки Цикл
		НоваяСтрока = МассивСкладовИНормативов.Добавить();//поправить ТЗ
		НоваяСтрока.Склад = ТекущаяСтрока.Склад;
		НоваяСтрока.Норматив = ТекущаяСтрока.Норматив;
		НоваяСтрока.Поток = ТекущаяСтрока.Поток;
		НоваяСтрока.ДатаНачалаИнтервала = ТекущаяСтрока.ДатаРазгрузки;
		НоваяСтрока.ДатаОкончанияИнтервала = ТекущаяСтрока.ДатаРазгрузки+ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.ПродолжительностьРазгрузки = ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.Эстакада = ТекущаяСтрока.Эстакада;
	КонецЦикла;

	ПроверитьИнтервалыСкладовНаДоступность(МассивСкладовИНормативов);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПоставкиДатаРазгрузкиПриИзменении(Элемент)
	ГруппаПоставкиДатаРазгрузкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаПоставкиДатаРазгрузкиПриИзмененииНаСервере()
	МассивСкладовИНормативов = Новый ТаблицаЗначений;
	МассивСкладовИНормативов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	МассивСкладовИНормативов.Колонки.Добавить("Норматив", Новый ОписаниеТипов("СправочникСсылка.НормативыПриемкиПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("Поток", Новый ОписаниеТипов("СправочникСсылка.ПотокиТранспортныхСредствПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаНачалаИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаОкончанияИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ПродолжительностьРазгрузки", Новый ОписаниеТипов("Число"));
	МассивСкладовИНормативов.Колонки.Добавить("Эстакада", Новый ОписаниеТипов("Булево"));
	
	Для каждого ТекущаяСтрока из Объект.ГруппаПоставки Цикл
		НоваяСтрока = МассивСкладовИНормативов.Добавить();//поправить ТЗ
		НоваяСтрока.Склад = ТекущаяСтрока.Склад;
		НоваяСтрока.Норматив = ТекущаяСтрока.Норматив;
		НоваяСтрока.Поток = ТекущаяСтрока.Поток;
		НоваяСтрока.ДатаНачалаИнтервала = ТекущаяСтрока.ДатаРазгрузки;
		НоваяСтрока.ДатаОкончанияИнтервала = ТекущаяСтрока.ДатаРазгрузки+ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.ПродолжительностьРазгрузки = ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.Эстакада = ТекущаяСтрока.Эстакада;
	КонецЦикла;

	ПроверитьИнтервалыСкладовНаДоступность(МассивСкладовИНормативов);
КонецПроцедуры

&НаСервере
Процедура ПроверитьИзменениеСеткиПоставок()
	ГруппаПоставкиДоИзменения = Объект.Ссылка.ГруппаПоставки.Выгрузить();
	Документы.РейсОтПоставщика.ЗаполнитьГруппуПоставки(Объект);
	
	Для каждого Строка из Объект.ГруппаПоставки Цикл
		МассивСтрок = ГруппаПоставкиДоИзменения.НайтиСтроки(Новый Структура("Склад", Строка.Склад));
		Если МассивСтрок.Количество()>0 Тогда
			СтрокаДоИзменений = МассивСтрок[0];
			Если СтрокаДоИзменений.Секция <> Строка.Секция
				ИЛИ СтрокаДоИзменений.ПродолжительностьРазгрузки <> Строка.ПродолжительностьРазгрузки Тогда
					
				Строка.ВремяПоступления = '00010101000000';
				Строка.Поток = ПредопределенноеЗначение("Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.ПустаяСсылка");
				
				Если Строка.ДатаРазгрузки <> '00010101' Тогда
					Модифицированность = Истина;		
					ПараметрыЗаписи = Новый Соответствие;
					ОсновнойПоток = ПолучитьПотокПоСекции(СтрокаДоИзменений.Секция);
					ЗначениеПараметров = Новый Структура;
					ЗначениеПараметров.Вставить("Поток", ОсновнойПоток);
					ЗначениеПараметров.Вставить("ЗаказПоставщику", Объект.Ссылка);
					ЗначениеПараметров.Вставить("ДатаВремяРазгрузкиПлан", СтрокаДоИзменений.ДатаРазгрузки + Минута(СтрокаДоИзменений.ВремяПоступления)*60 + Час(СтрокаДоИзменений.ВремяПоступления)*3600);
					ЗначениеПараметров.Вставить("ПродолжительностьРазгрузки", СтрокаДоИзменений.ПродолжительностьРазгрузки);
					ЗначениеПараметров.Вставить("СогласованоСоСкладом", СтрокаДоИзменений.СогласованоСоСкладом);
					ЗначениеПараметров.Вставить("ТекстПоставки", СтрокаДоИзменений.ПримечаниеКПоставке);
					ЗначениеПараметров.Вставить("Склад", СтрокаДоИзменений.Склад);
					ЗначениеПараметров.Вставить("Оборудование", ?(СтрокаДоИзменений.Эстакада, ПолучитьЭстакаду(Истина), ПолучитьЭстакаду(Ложь)));
					ПараметрыЗаписи.Вставить(Объект.Ссылка, ЗначениеПараметров);
					Альтерра_СеткаПоставок.ИзменитьДанныеСеткиПоставок(Объект.Ссылка, "Удаление",  ПараметрыЗаписи, Истина, СтрокаДоИзменений.Склад, Альтерра_СеткаПоставок.ПолучитьДопПотокиПоСкладу(СтрокаДоИзменений.Склад, Объект.Ссылка, ОсновнойПоток));
					Сообщить("Для склада '"+Строка(Строка.Склад)+"' изменились данные поставки. Необходимо заново запланировать поставку.")
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьПотокПоСекции(Секция)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка КАК Поток
		|ИЗ
		|	Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
		|ГДЕ
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция = &Секция";
	
	Запрос.УстановитьПараметр("Секция", Секция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Поток;
	КонецЕсли;
	Возврат Справочники.ПотокиТранспортныхСредствПоставкиНаСклад.ПустаяСсылка();
КонецФункции

#КонецОбласти

#Область РаспределениеТранспортных

&НаКлиенте
Процедура ПроверитьСостояниеОплаты(Команда)
	БылиИзменения = ПроверитьСостояниеОплатыНаСервере();
	Если БылиИзменения Тогда
		Прочитать();    
	КонецЕсли;  
	РасчитатьИтоги();
КонецПроцедуры
&НаСервере

Функция ПроверитьСостояниеОплатыНаСервере()
	МассивРейсов = Новый Массив;
	МассивРейсов.Добавить(Объект.Ссылка);
	БылиИзменения = Документы.РейсОтПоставщика.ПроверитьСостояниеОплатыРейса(МассивРейсов);
	Возврат БылиИзменения;
КонецФункции  

&НаКлиенте
Процедура РаспределитьТранспортные(Команда)

Если ЕщеНеРаспределено() Тогда
	ДополнительнаяОбработкаСсылка = ПолучитьСсылку(); 
	ДоступноВыполнениеВФоне = НЕ ДополнительнаяОбработкаСсылка.Пустая(); 
	Если ДоступноВыполнениеВФоне Тогда
		ДлительнаяОперация = РаспределитьТранспортныеНаСервере(ДополнительнаяОбработкаСсылка);
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;   
КонецЕсли;   

КонецПроцедуры                     

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
     Возврат; 
 	ИначеЕсли Результат.Статус = "Выполнено" Тогда
       ТекстСообщения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	 	Если ТекстСообщения > 0 Тогда
			Прочитать(); 
			РасчитатьИтоги();
			ОбщегоНазначенияКлиент.СообщитьПользователю("Данные оплат обновлены.");
		КонецЕсли;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда                                     
    	ТекстСообщения = Результат.ПодробноеПредставлениеОшибки;   
		ОбщегоНазначенияКлиент.СообщитьПользователю("При создании документа возникла ошибка: "+ ТекстСообщения);
	КонецЕсли;   
	
КонецПроцедуры	

&НаСервере                                 
Функция РаспределитьТранспортныеНаСервере(ВнешняяОбработка)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор); 
	ПараметрыРасчета = Новый Структура("ТолькоПроверка, ПереданныйРейс", Ложь, Объект.Ссылка);
	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", ВнешняяОбработка);
	ПараметрыЗадания.Вставить("ИмяМетода", "РаспределениеТранспортных");
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Истина);
	ПараметрыЗадания.Вставить("ПараметрыВыполнения",ПараметрыРасчета);
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
	Возврат РезультатВыполнения;
	
КонецФункции    

&НаСервере
Функция ПолучитьСсылку()
 Возврат Документы.РейсОтПоставщика.НайтиВнешнююОбработкуРаспределения();	
КонецФункции

&НаСервере
Функция ЕщеНеРаспределено()
	Возврат Объект.СостояниеОплатыШапка = Перечисления.СостояниеОплатыВРейсахОтПоставщика.НеГотовКОплате ИЛИ Объект.СостояниеОплатыШапка = Перечисления.СостояниеОплатыВРейсахОтПоставщика.ЧастичноГотовКОплате;
КонецФункции
#КонецОбласти

