#Область Мониторинг

#Область ОтправкаПолучение

Функция ОтправитьВМониторинг(Рейсы, НастройкиОбслуживанияЗаказов, НастройкиАвторизации = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатВыполнения = ПараметрыВыполнения("Отправка в мониторинг", Истина);
	ЗапросыДляЛогов = ЗапросыДляЛогов();
	Идентификатор = "";
	Филиал = Строка(НастройкиОбслуживанияЗаказов.Филиал);
	
	Если Рейсы.Количество() > 0 Тогда
		
		Попытка
			
			Если Не ЗначениеЗаполнено(НастройкиАвторизации) Тогда
				НастройкиАвторизации = ПолучитьАвторизацию();
			КонецЕсли;
			
			Если ТипЗнч(НастройкиАвторизации) = Тип("Структура")  
				И НастройкиАвторизации.Свойство("IdКомпании") И ЗначениеЗаполнено(НастройкиАвторизации.IdКомпании) 
				И НастройкиАвторизации.Свойство("Токен") И ЗначениеЗаполнено(НастройкиАвторизации.Токен) Тогда
			
				МаршрутыОтправки = ПолучитьМаршрутыОтправки(Рейсы, НастройкиОбслуживанияЗаказов);
				Идентификатор = ПолучитьРейсы(МаршрутыОтправки.МассивРейсов, Истина);
				Филиал = ?(Не ЗначениеЗаполнено(Филиал), ПолучитьФилиал(МаршрутыОтправки.МассивСкладов), Филиал);
				РезультатВыполнения.Лог = РезультатВыполнения.Лог + ПолучитьРейсы(МаршрутыОтправки.МассивРейсов) + Символы.ПС; 
			
				Если МаршрутыОтправки.МассивРейсов.Количество() > 0 Или МаршрутыОтправки.МассивЗаказов.Количество() > 0 Тогда
					
					// Обновление складов
					ОбновлениеСкладыМониторинг = ОбновитьСкладыМониторинг(МаршрутыОтправки.МассивСкладов, НастройкиАвторизации, ЗапросыДляЛогов);
					РезультатВыполнения.Сообщение = ОбновлениеСкладыМониторинг.Сообщение;
					РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение;
					
					Если ОбновлениеСкладыМониторинг.Результат Тогда
					
						// Обновление пользователей  
						ОбновлениеПользователиМобильноеПриложение = ОбновитьПользователиМобильноеПриложение(МаршрутыОтправки.МассивКурьеров, НастройкиАвторизации, ЗапросыДляЛогов);   
						РезультатВыполнения.Сообщение = ОбновлениеПользователиМобильноеПриложение.Сообщение;
						РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение;
						
						Если ОбновлениеПользователиМобильноеПриложение.Результат Тогда 
	
							// Обновление курьеров
							ОбновлениеКурьерыМониторинг = ОбновитьКурьерыМониторинг(МаршрутыОтправки.МассивКурьеров, НастройкиАвторизации, ЗапросыДляЛогов);   
							РезультатВыполнения.Сообщение = ОбновлениеКурьерыМониторинг.Сообщение;
							РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение;
							 		
							 // Обновление маршрутов
							 Если ОбновлениеКурьерыМониторинг.Результат Тогда
								
								ОбновлениеМаршрутыМониторинг = ОбновитьМаршрутыМониторинг(МаршрутыОтправки.МассивРейсов, МаршрутыОтправки.ИдентификаторыРейсов, НастройкиАвторизации, ЗапросыДляЛогов); 
								РезультатВыполнения.Сообщение = ОбновлениеМаршрутыМониторинг.Сообщение;
								РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение;
								
								// Наполнение маршрутов заказами (если созданы маршруты)
								Если ОбновлениеМаршрутыМониторинг.Результат Тогда
									
									ОбновлениеЗаказыМониторинг = ОбновитьЗаказыМониторинг(МаршрутыОтправки.МассивЗаказов, 
										МаршрутыОтправки.ИдентификаторыРейсов, МаршрутыОтправки.ИдентификаторыЗаказов, НастройкиАвторизации, ЗапросыДляЛогов);
									РезультатВыполнения.Сообщение = ОбновлениеЗаказыМониторинг.Сообщение;
									РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение;
									
									// Задать последовательность точек - склад, заказы
									Если ОбновлениеЗаказыМониторинг.Результат Тогда
										ОбновлениеТочекМониторинг = ОбновитьТочкиМониторинг(МаршрутыОтправки.ИдентификаторыРейсов, МаршрутыОтправки.МассивТочек, 
											НастройкиАвторизации, ЗапросыДляЛогов);
										РезультатВыполнения.Сообщение = ОбновлениеТочекМониторинг.Сообщение;
										РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение;
									КонецЕсли;
									
									// Добавить товарные составы к заказам
									Если ОбновлениеЗаказыМониторинг.Результат И ОбновлениеТочекМониторинг.Результат Тогда
										
										ОбновлениеТоварыМониторинг = ОбновитьТоварыМониторинг(МаршрутыОтправки.МассивТоваров, МаршрутыОтправки.ИдентификаторыЗаказов, НастройкиАвторизации, ЗапросыДляЛогов);
										РезультатВыполнения.Сообщение = ОбновлениеТоварыМониторинг.Сообщение;
										РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение;
										
										РезультатВыполнения.Результат = ОбновлениеТоварыМониторинг.Результат;
									КонецЕсли;
								КонецЕсли;
							 КонецЕсли;
						 
						 КонецЕсли;
					КонецЕсли;		
					
				Иначе
					РезультатВыполнения.Сообщение = "Отсутствуют данные для отправки в мониторинг";
					РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение + Символы.ПС;
				КонецЕсли;		
		
			Иначе
				РезультатВыполнения.Сообщение = "Не заданы параметры авторизации";
				РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение + Символы.ПС;
			КонецЕсли;
		
		Исключение
			РезультатВыполнения.Сообщение = "Ошибка отправки в мониторинг: "+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение + Символы.ПС;
		КонецПопытки;
		
	Иначе
		РезультатВыполнения.Сообщение = "Не выбраны рейсы для отправки в мониторинг";
		РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение + Символы.ПС;		
	КонецЕсли;
	
	РезультатВыполнения.Сообщение = "Рейсы в мониторинг " + ?(РезультатВыполнения.Результат, "отправлены", "не отправлены" + Символы.ПС + РезультатВыполнения.Сообщение);
	РезультатВыполнения.Лог = РезультатВыполнения.Лог + РезультатВыполнения.Сообщение + Символы.ПС;
	ЗакрытьПараметрыВыполнения(РезультатВыполнения);
	
	ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ВыполнениеОтправкаМониторинг", РезультатВыполнения.Лог, 
		Филиал, Идентификатор, Не РезультатВыполнения.Результат);
	ЗаписатьЛогЗапросов(НастройкиОбслуживанияЗаказов.ПапкаЛогов, ЗапросыДляЛогов);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьМаршрутыОтправки(Рейсы, НастройкиОбслуживанияЗаказов)

	Данные = ПараметрыМаршрутов();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	Рейс.Ссылка КАК Рейс,
		|	Рейс.Номер КАК НомерРейса,
		|	Рейс.ВремяВыезда КАК ДатаМаршрута,
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	СтруктураПредприятия.Код КАК ПодразделениеКод,
		|	СтруктураПредприятия.Наименование КАК ПодразделениеНаименование,
		|	СтруктураПредприятия.Адрес КАК ПодразделениеАдрес,
		|	СтруктураПредприятия.Широта КАК ПодразделениеШирота,
		|	СтруктураПредприятия.Долгота КАК ПодразделениеДолгота,
		|	Рейс.Водитель КАК Водитель,
		|	Рейс.Автомобиль КАК Автомобиль,
		|	Рейс.Автомобиль.Наименование КАК АвтомобильНаименование,
		|	Рейс.Автомобиль.ГрузоподъемностьВТоннах КАК АвтомобильГрузоподъемностьВТоннах,
		|	КонтактнаяИнформацияФЛ.НомерТелефона КАК НомерТелефонаВодителя	
		|ПОМЕСТИТЬ втРейсы	
		|ИЗ      
		|	Документ.ЗаданиеНаПеревозкуРейс КАК Рейс   
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО Рейс.Подразделение = СтруктураПредприятия.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязьВодителейТСПартнеров КАК СвязьВодителейТСПартнеров
		|		ПО Рейс.Водитель = СвязьВодителейТСПартнеров.Водитель
		|		И Рейс.Автомобиль = СвязьВодителейТСПартнеров.Автомобиль
		|		И Рейс.ПеревозчикПартнер = СвязьВодителейТСПартнеров.ПеревозчикПартнер
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияФЛ
		|		ПО Рейс.Водитель = КонтактнаяИнформацияФЛ.Ссылка
		|		И КонтактнаяИнформацияФЛ.НомерТелефона <> &ПустаяСтрока
		|		И КонтактнаяИнформацияФЛ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица)
		|ГДЕ
		|	Рейс.Ссылка В (&Рейсы)		
		|;             
		|////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Подразделение КАК Подразделение,
		|	ПодразделениеКод КАК Номер,
		|	ПодразделениеНаименование КАК Наименование,
		|	ПодразделениеАдрес КАК Адрес,
		|	ПодразделениеШирота КАК Широта,
		|	ПодразделениеДолгота КАК Долгота
		|ИЗ
		|	втРейсы
		|;
		|////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Водитель,
		|	Автомобиль,
		|	АвтомобильНаименование,
		|	АвтомобильГрузоподъемностьВТоннах,
		|	НомерТелефонаВодителя	
		|ИЗ 
		|	втРейсы
		|;     
		|////////////////////////////////////////////////////////////  
		|ВЫБРАТЬ 
		|	Рейс,
		|	НомерРейса,
		|	ДатаМаршрута,        
		|	ПодразделениеКод КАК НомерСклада,
		|	АвтомобильГрузоподъемностьВТоннах,
		|	НомерТелефонаВодителя	
		|ИЗ 
		|	втРейсы
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРейсы.Рейс,
		|	втРейсы.НомерРейса,
		|	ЗаказНаДоставку.Ссылка КАК ЗаказНаДоставку, 
		|	ЗаказНаДоставку.Номер КАК НомерЗаказа,
		|	ЗаказНаДоставку.ВремяДоставкиС КАК ВремяДоставкиС,
		|	ЗаказНаДоставку.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	ЗаказНаДоставку.ТелефонКлиентаНаВыгрузке КАК ТелефонКлиента,
		|	ЗаказНаДоставку.Широта,
		|	ЗаказНаДоставку.Долгота,
		|	ЗаказНаДоставку.АдресДоставки КАК АдресПолучателя,
		|	ЗаказНаДоставку.Партнер.Наименование КАК НаименованиеПолучателя,
		|	ЗаказНаДоставку.Объем,
		|	ЗаказНаДоставку.Вес,      
		|	ЗаказНаДоставку.ВидДоставки,
		|	РейсОснования.НомерСтроки,
		|	ЗаказНаДоставку.Комментарий,
		|	ЗаказНаДоставку.НужнаИнкассация,
		|	ЗаказНаДоставку.Инкассация КАК СуммаИнкассации,
		|	ЗаказНаДоставку.Сдача,
		|	ЗаказНаДоставку.ОплатаБанковскойКартой 
		|ПОМЕСТИТЬ втЗаказыНаДоставку	
		|ИЗ	
		|	втРейсы
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс.Основания КАК РейсОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставку
		|			ПО РейсОснования.Документ = ЗаказНаДоставку.Ссылка
		|    	ПО втРейсы.Рейс = РейсОснования.Ссылка
		|;     
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ *
		|ИЗ втЗаказыНаДоставку   
		|УПОРЯДОЧИТЬ ПО
		|	НомерРейса, НомерСтроки
		|;                   
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказыНаДоставку.Рейс, 
		|	втЗаказыНаДоставку.НомерРейса, 
		|	втЗаказыНаДоставку.ЗаказНаДоставку,
		|	втЗаказыНаДоставку.НомерЗаказа,
		|	ДокументПродажи.Ссылка КАК ДокументПродажи, 
		|	ДокументПродажи.РаспределитьТранспортные,     
		|	ДокументПродажиТовары.НомерСтроки,
		|	ДокументПродажиТовары.Номенклатура,
		|	ДокументПродажиТовары.Цена,
		|	ДокументПродажиТовары.КоличествоУпаковок КАК Количество,
		|	ДокументПродажиТовары.Сумма,
		|	ДокументПродажиТовары.СуммаРТ
		|ПОМЕСТИТЬ втТовары
		|ИЗ             
		|	втЗаказыНаДоставку  
		|		СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуОснования
		|			СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументПродажи
		|				ПО ЗаказНаДоставкуОснования.Документ = ДокументПродажи.Ссылка	
		|			СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ДокументПродажиТовары
		|				ПО ДокументПродажи.Ссылка = ДокументПродажиТовары.Ссылка
		|				И НЕ ДокументПродажиТовары.Отменено	
		|			ПО втЗаказыНаДоставку.ЗаказНаДоставку = ЗаказНаДоставкуОснования.Ссылка
		|		
		|ОБЪЕДИНИТЬ ВСЕ
		|     
		|ВЫБРАТЬ
		|	втЗаказыНаДоставку.Рейс, 
		|	втЗаказыНаДоставку.НомерРейса, 
		|	втЗаказыНаДоставку.ЗаказНаДоставку,
		|	втЗаказыНаДоставку.НомерЗаказа,
		|	ДокументПродажи.Ссылка КАК ДокументПродажи, 
		|	ДокументПродажи.РаспределитьТранспортные,     
		|	ДокументПродажиТовары.НомерСтроки,
		|	ДокументПродажиТовары.Номенклатура,
		|	ДокументПродажиТовары.Цена,
		|	ДокументПродажиТовары.КоличествоУпаковок КАК Количество,
		|	ДокументПродажиТовары.Сумма,
		|	ДокументПродажиТовары.СуммаРТ
		|ИЗ             
		|	втЗаказыНаДоставку  
		|		СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуОснования
		|			СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДокументПродажи
		|				ПО ЗаказНаДоставкуОснования.Документ = ДокументПродажи.Ссылка	
		|			СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокументПродажиТовары
		|				ПО ДокументПродажи.Ссылка = ДокументПродажиТовары.Ссылка	
		|			ПО втЗаказыНаДоставку.ЗаказНаДоставку = ЗаказНаДоставкуОснования.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ   
		|
		| ВЫБРАТЬ
		|	втЗаказыНаДоставку.Рейс, 
		|	втЗаказыНаДоставку.НомерРейса, 
		|	втЗаказыНаДоставку.ЗаказНаДоставку,
		|	втЗаказыНаДоставку.НомерЗаказа,
		|	ДокументПродажи.Ссылка КАК ДокументПродажи, 
		|	ЛОЖЬ КАК РаспределитьТранспортные,     
		|	ДокументПродажиТовары.НомерСтроки,
		|	ДокументПродажиТовары.Номенклатура,
		|	ДокументПродажиТовары.Цена,
		|	ДокументПродажиТовары.КоличествоУпаковок КАК Количество,
		|	ДокументПродажиТовары.Сумма,
		|	0 КАК СуммаРТ
		|ИЗ             
		|	втЗаказыНаДоставку  
		|		СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуОснования
		|			СОЕДИНЕНИЕ Документ.ЧекККМ КАК ДокументПродажи
		|				ПО ЗаказНаДоставкуОснования.Документ = ДокументПродажи.Ссылка	
		|			СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ДокументПродажиТовары
		|				ПО ДокументПродажи.Ссылка = ДокументПродажиТовары.Ссылка	
		|			ПО втЗаказыНаДоставку.ЗаказНаДоставку = ЗаказНаДоставкуОснования.Ссылка
		|			
		|ОБЪЕДИНИТЬ ВСЕ   
		|
		| ВЫБРАТЬ
		|	втЗаказыНаДоставку.Рейс, 
		|	втЗаказыНаДоставку.НомерРейса, 
		|	втЗаказыНаДоставку.ЗаказНаДоставку,
		|	втЗаказыНаДоставку.НомерЗаказа,
		|	ДокументПродажи.Ссылка КАК ДокументПродажи, 
		|	ЛОЖЬ КАК РаспределитьТранспортные,     
		|	ДокументПродажиТовары.НомерСтроки,
		|	ДокументПродажиТовары.Номенклатура,
		|	0 КАК Цена,
		|	ДокументПродажиТовары.КоличествоУпаковок КАК Количество,
		|	0 КАК Сумма,
		|	0 КАК СуммаРТ
		|ИЗ             
		|	втЗаказыНаДоставку  
		|		СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуОснования
		|			СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ДокументПродажи
		|				ПО ЗаказНаДоставкуОснования.Документ = ДокументПродажи.Ссылка	
		|			СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ДокументПродажиТовары
		|				ПО ДокументПродажи.Ссылка = ДокументПродажиТовары.Ссылка	
		|			ПО втЗаказыНаДоставку.ЗаказНаДоставку = ЗаказНаДоставкуОснования.Ссылка
		|; 
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ	
		|	ПЕРВЫЕ 1000000
		|	АВТОНОМЕРЗАПИСИ() КАК НомерПоПорядку,
		|	втТовары.Рейс, 
		|	втТовары.НомерРейса, 
		|	втТовары.ЗаказНаДоставку,
		|	втТовары.НомерЗаказа,
		|	втТовары.ДокументПродажи,   
		|	втТовары.Номенклатура,                                     
		|	СпрНоменклатура.НаименованиеПолное КАК Наименование, 
		|	ВЫБОР     
		|		КОГДА втТовары.РаспределитьТранспортные 
		|		ТОГДА   
		|			ВЫБОР       
		|				КОГДА Сумма = 0 
		|				ТОГДА 0
		|				КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|				ТОГДА 0
		|				ИНАЧЕ ВЫРАЗИТЬ((втТовары.Сумма + втТовары.СуммаРТ) / втТовары.Количество КАК ЧИСЛО(15, 2))
		|			КОНЕЦ
		|		ИНАЧЕ ВЫРАЗИТЬ(втТовары.Сумма / втТовары.Количество КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР     
		|		КОГДА втТовары.РаспределитьТранспортные 
		|		ТОГДА   
		|			ВЫБОР 
		|				КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|				ТОГДА 1
		|				ИНАЧЕ втТовары.Количество
		|			КОНЕЦ
		|		ИНАЧЕ втТовары.Количество
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА 
		|			СпрНоменклатура.ВесЗнаменатель <> 0
		|		ТОГДА
		|			втТовары.Количество*СпрНоменклатура.ВесЧислитель/СпрНоменклатура.ВесЗнаменатель
		|		ИНАЧЕ           
		|			втТовары.Количество*СпрНоменклатура.ВесЧислитель
		|	КОНЕЦ КАК Вес, 
		|	СпрНоменклатура.ВесЕдиницаИзмерения, 
		|	ВЫБОР
		|		КОГДА 
		|			втТовары.Количество*СпрНоменклатура.ОбъемЗнаменатель <> 0
		|		ТОГДА
		|			втТовары.Количество*СпрНоменклатура.ОбъемЧислитель/СпрНоменклатура.ОбъемЗнаменатель
		|		ИНАЧЕ           
		|			ОбъемЧислитель
		|	КОНЕЦ КАК Объем, 
		|	СпрНоменклатура.ОбъемЕдиницаИзмерения 	
		|ПОМЕСТИТЬ
		|	втТоварныйСостав	
		|ИЗ
		|	втТовары
		|	СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО втТовары.Номенклатура = СпрНоменклатура.Ссылка 
		|ГДЕ 
		|	СпрНоменклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|УПОРЯДОЧИТЬ ПО
		|	втТовары.ЗаказНаДоставку,
		|	втТовары.ДокументПродажи,   
		|	втТовары.НомерСтроки
		|;       
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ	
		|	втТоварныйСостав.ЗаказНаДоставку, 
		|	КОЛИЧЕСТВО(втТоварыПорядок.НомерПоПорядку) КАК НомерСтроки,  
		|	втТоварныйСостав.Рейс, 
		|	втТоварныйСостав.НомерРейса, 
		|	втТоварныйСостав.НомерЗаказа,
		|	втТоварныйСостав.ДокументПродажи,   
		|	втТоварныйСостав.Номенклатура,                                     
		|	втТоварныйСостав.Наименование, 
		|	втТоварныйСостав.Цена,
		|	втТоварныйСостав.Количество,
		|	втТоварныйСостав.Вес,    
		|	втТоварныйСостав.ВесЕдиницаИзмерения,
		|	втТоварныйСостав.Объем,    
		|	втТоварныйСостав.ОбъемЕдиницаИзмерения
		|ИЗ
		|	втТоварныйСостав 
		|	СОЕДИНЕНИЕ втТоварныйСостав КАК втТоварыПорядок
		|		ПО втТоварныйСостав.ЗаказНаДоставку = втТоварыПорядок.ЗаказНаДоставку
		|		И  втТоварныйСостав.НомерПоПорядку >= втТоварыПорядок.НомерПоПорядку  
		|СГРУППИРОВАТЬ ПО
		|	втТоварныйСостав.Рейс, 
		|	втТоварныйСостав.НомерРейса, 
		|	втТоварныйСостав.ЗаказНаДоставку,
		|	втТоварныйСостав.НомерЗаказа,
		|	втТоварныйСостав.ДокументПродажи,   
		|	втТоварныйСостав.НомерПоПорядку, 
		|	втТоварныйСостав.Номенклатура,                                     
		|	втТоварныйСостав.Наименование, 
		|	втТоварныйСостав.Цена,
		|	втТоварныйСостав.Количество,
		|	втТоварныйСостав.Вес,    
		|	втТоварныйСостав.ВесЕдиницаИзмерения,
		|	втТоварныйСостав.Объем,    
		|	втТоварныйСостав.ОбъемЕдиницаИзмерения
		|УПОРЯДОЧИТЬ ПО 1, 2"; 
	
	Запрос.УстановитьПараметр("Рейсы", Рейсы);	
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	ПакетЗапросов = Запрос.ВыполнитьПакет();	
	
	ВыборкаПодразделение = ПакетЗапросов[1].Выбрать();
	Пока ВыборкаПодразделение.Следующий() Цикл  

		ДанныеСклада = ПараметрыСклада();
		ДанныеСклада.number 	= ВыборкаПодразделение.Номер;  
		ДанныеСклада.name 		= ВыборкаПодразделение.Наименование;
	   	ДанныеСклада.address 	= ВыборкаПодразделение.Адрес; 
		ДанныеСклада.lat 		= ВыборкаПодразделение.Широта;
		ДанныеСклада.lon 		= ВыборкаПодразделение.Долгота; 
		Данные.МассивСкладов.Добавить(ДанныеСклада);
	КонецЦикла;
	
	ВыборкаКурьеры = ПакетЗапросов[2].Выбрать();
	Пока ВыборкаКурьеры.Следующий() Цикл  
		
		ИдентификаторКурьера = "+" + ПривестиКФорматуНомерТелефона(ВыборкаКурьеры.НомерТелефонаВодителя);
		Имя = Строка(ВыборкаКурьеры.Водитель) + ", " + ВыборкаКурьеры.АвтомобильНаименование + ", " + ВыборкаКурьеры.АвтомобильГрузоподъемностьВТоннах + "т.";

		ДанныеКурьера = ПараметрыКурьера();
		ДанныеКурьера.number 	= ИдентификаторКурьера;
	   	ДанныеКурьера.phone 	= ИдентификаторКурьера; 
		ДанныеКурьера.name		= Имя;
		Данные.МассивКурьеров.Добавить(ДанныеКурьера); 
    КонецЦикла;	
	
	ВыборкаРейсы = ПакетЗапросов[3].Выбрать();
	Пока ВыборкаРейсы.Следующий() Цикл
		
		ИдентификаторКурьера = "+" + ПривестиКФорматуНомерТелефона(ВыборкаРейсы.НомерТелефонаВодителя);
		
		ДанныеРейса = ПараметрыМаршрута();  
		ДанныеРейса.number			= ВыборкаРейсы.НомерРейса;
		ДанныеРейса.courier_number	= ИдентификаторКурьера; 
		ДанныеРейса.depot_number 	= ВыборкаРейсы.НомерСклада;
		ДанныеРейса.date			= Строка(Формат(ВыборкаРейсы.ДатаМаршрута, "ДФ=yyyy-MM-dd"));
		ДанныеРейса.routing_mode 	= ?(ВыборкаРейсы.АвтомобильГрузоподъемностьВТоннах >= 2.5, "truck", "driving");
		Данные.МассивРейсов.Добавить(ДанныеРейса);

		ДанныеТочкиСклад = ПараметрыТочкиСклад();
		ДанныеТочкиСклад.value.number = ВыборкаРейсы.НомерСклада;
		ТочкиМаршрута = Новый Массив;
		ТочкиМаршрута.Добавить(ДанныеТочкиСклад);
		Данные.МассивТочек.Добавить(ТочкиМаршрута);
		
		ИдентификаторРейса = ИдентификаторыРейсов();   
		
		ИдентификаторРейса.НомерРейса = ВыборкаРейсы.НомерРейса; 
		ИдентификаторРейса.Ссылка = ВыборкаРейсы.Рейс;                   
		
		// Пропуска
		ИдентификаторРейса.ПропускНаСклад = ПолучитьПропускНаСклад(ВыборкаРейсы.Рейс);      
		
		ОтгрузкаМаркетплейс = ПолучитьОтгрузкуМаркетплейса(ВыборкаРейсы.Рейс);
		ИдентификаторРейса.ЗаказОтгрузка	= ОтгрузкаМаркетПлейс.ЗаказНаДоставку; 
		ИдентификаторРейса.СсылкаОтгрузка	= ОтгрузкаМаркетПлейс.СсылкаОтгрузки;  
		ИдентификаторРейса.ОписаниеОтгрузка	= ОтгрузкаМаркетПлейс.ОписаниеОтгрузки; 
		
		ВозвратМаркетплейс = ПолучитьОтгрузкуМаркетплейса(ВыборкаРейсы.Рейс, Истина);
		ИдентификаторРейса.ЗаказВозврат 	= ВозвратМаркетплейс.ЗаказНаДоставку; 
		ИдентификаторРейса.СсылкаВозврат	= ВозвратМаркетплейс.СсылкаОтгрузки; 
		ИдентификаторРейса.ОписаниеВозврат	= ВозвратМаркетплейс.ОписаниеОтгрузки; 
		
		Данные.ИдентификаторыРейсов.Добавить(ИдентификаторРейса);
	КонецЦикла;		
			
	ВыборкаЗаказы = ПакетЗапросов[5].Выбрать();
	ВыгрузкаТовары = ПакетЗапросов[8].Выгрузить();
	
	Пока ВыборкаЗаказы.Следующий() Цикл 
		
		ТелефонКлиента = "+" + ПривестиКФорматуНомерТелефона(ВыборкаЗаказы.ТелефонКлиента);
		
		ДанныеЗаказа = ПараметрыЗаказа(); 
	   	ДанныеЗаказа.route_number 		= ВыборкаЗаказы.НомерРейса;      
		ДанныеЗаказа.time_interval		= ПолучитьВременноеОкно(ВыборкаЗаказы.ВремяДоставкиС, ВыборкаЗаказы.ВремяДоставкиПо, Ложь, 0);
		ДанныеЗаказа.number 			= ВыборкаЗаказы.НомерЗаказа;
		ДанныеЗаказа.phone				= ТелефонКлиента; 
		ДанныеЗаказа.lat				= ВыборкаЗаказы.Широта;
		ДанныеЗаказа.lon				= ВыборкаЗаказы.Долгота;
		ДанныеЗаказа.address			= ВыборкаЗаказы.АдресПолучателя;     
		ДанныеЗаказа.customer_name		= ВыборкаЗаказы.НаименованиеПолучателя;
		ДанныеЗаказа.volume				= ВыборкаЗаказы.Объем;
		ДанныеЗаказа.weight				= ВыборкаЗаказы.Вес; 
		ДанныеЗаказа.status				= НастройкиОбслуживанияЗаказов.СтатусЗаказов; 
		
		Если ВыборкаЗаказы.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
			ДанныеЗаказа.shared_service_duration_s	= НастройкиОбслуживанияЗаказов.ВремяОбслуживанияАдресОРК;   
			ДанныеЗаказа.service_duration_s			= НастройкиОбслуживанияЗаказов.ВремяОбслуживанияЗаказОРК;	
		Иначе	
			ДанныеЗаказа.shared_service_duration_s	= НастройкиОбслуживанияЗаказов.ВремяОбслуживанияАдрес;   
			ДанныеЗаказа.service_duration_s			= НастройкиОбслуживанияЗаказов.ВремяОбслуживанияЗаказ;
		КонецЕсли;    
		
		// Ссылки на пропуска на склад и маркетплейс
		ПропускНаСклад 	= "";  
		СсылкаОтгрузка	= "";
		ОписаниеОтгрузка= "";
		СсылкаВозврат 	= "";
		ОписаниеВозврат = "";  
		
		Для Каждого ИдентификаторРейса Из Данные.ИдентификаторыРейсов Цикл
			
			Если ВыборкаЗаказы.Рейс = ИдентификаторРейса.Ссылка Тогда  
				ПропускНаСклад = ИдентификаторРейса.ПропускНаСклад;                                   
				
				Если ВыборкаЗаказы.ЗаказНадоставку = ИдентификаторРейса.ЗаказОтгрузка Тогда  
					СсылкаОтгрузка 	= ИдентификаторРейса.СсылкаОтгрузка;
					ОписаниеОтгрузка= ИдентификаторРейса.ОписаниеОтгрузка;
				КонецЕсли; 
				
				Если ВыборкаЗаказы.ЗаказНадоставку = ИдентификаторРейса.ЗаказВозврат Тогда  
					СсылкаВозврат 	= ИдентификаторРейса.СсылкаВозврат;
					ОписаниеВозврат = ИдентификаторРейса.ОписаниеВозврат;
				КонецЕсли;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Комментарий = 
			?(ВыборкаЗаказы.Комментарий <> "", ВыборкаЗаказы.Комментарий + Символы.ПС, "") +
			?(ВыборкаЗаказы.НужнаИнкассация, "Инкассация: " + Формат(ВыборкаЗаказы.СуммаИнкассации, "ЧДЦ=2") + " ₽" + Символы.ПС, "") +
			?(ВыборкаЗаказы.Сдача > 0, "Нужна сдача: " + Формат(ВыборкаЗаказы.Сдача, "ЧДЦ=2") + " ₽" + Символы.ПС, "") +
			?(ВыборкаЗаказы.ОплатаБанковскойКартой, "Оплата банковской картой" + Символы.ПС, "") +
			?(ЗначениеЗаполнено(ПропускНаСклад), Символы.ПС + "Пропуск на склад: " + ПропускНаСклад + Символы.ПС, "") +
			?(ЗначениеЗаполнено(СсылкаОтгрузка), Символы.ПС + ОписаниеОтгрузка + ": " + СсылкаОтгрузка + Символы.ПС, "") +
			?(ЗначениеЗаполнено(СсылкаВозврат), Символы.ПС + ОписаниеВозврат + ": " + СсылкаВозврат + Символы.ПС, "");
			
		ДанныеЗаказа.comments = Комментарий; 
		Данные.МассивЗаказов.Добавить(ДанныеЗаказа);
		
		// Последовательность точек маршрута
		Для Сч = 0 По Данные.МассивРейсов.Количество() - 1 Цикл
			Если ДанныеЗаказа.route_number = Данные.МассивРейсов[Сч].number Тогда
				
				ДанныеТочкиЗаказ = ПараметрыТочкиЗаказ();
				ДанныеТочкиЗаказ.value.number 			= ДанныеЗаказа.number;
				ДанныеТочкиЗаказ.value.address 			= ДанныеЗаказа.address;
				ДанныеТочкиЗаказ.value.lat 				= ДанныеЗаказа.lat;
				ДанныеТочкиЗаказ.value.lon 				= ДанныеЗаказа.lon;
				ДанныеТочкиЗаказ.value.time_interval 	= ДанныеЗаказа.time_interval;
				Данные.МассивТочек[Сч].Добавить(ДанныеТочкиЗаказ);
			
				Прервать;	
			КонецЕсли;	
		КонецЦикла;
		
		ИдентификаторЗаказа = ИдентификаторыЗаказов();
		ИдентификаторЗаказа.НомерРейса = ВыборкаЗаказы.НомерРейса; 
		ИдентификаторЗаказа.НомерЗаказа = ВыборкаЗаказы.НомерЗаказа;
		Данные.ИдентификаторыЗаказов.Добавить(ИдентификаторЗаказа);
		
		// Товарный состав заказа
		ТоварыЗаказа = ВыгрузкаТовары.НайтиСтроки(Новый Структура("НомерЗаказа", ВыборкаЗаказы.НомерЗаказа));
		//Ограничение товарного состава 'maxItems': 100
		Если ТоварыЗаказа.Количество() <= 100 Тогда
			Для Каждого СтрокаТовар Из ТоварыЗаказа Цикл
				
			ДанныеТовара = ПараметрыТоваров();  
			ДанныеТовара.Вставить("НомерЗаказа", СтрокаТовар.НомерЗаказа);
			ДанныеТовара.number			= Формат(СтрокаТовар.НомерСтроки, "ЧГ=0");
			ДанныеТовара.description	= СтрокаТовар.Наименование; 
			ДанныеТовара.price 			= Формат(СтрокаТовар.Цена, "ЧГ=0; ЧДЦ=2; ЧРД=.; ЧН=0");
			ДанныеТовара.total_count	= СтрокаТовар.Количество;
			
			Вес = Формат(СтрокаТовар.Вес, "ЧГ=0; ЧДЦ=3; ЧРД=.; ЧН=0.000");
			ВесОбъем = ?(Вес <> "0.000", Вес + " " + СтрокаТовар.ВесЕдиницаИзмерения, "");
			
			Объем = Формат(СтрокаТовар.Объем, "ЧГ=0; ЧДЦ=3; ЧРД=.; ЧН=0.000");
			ВесОбъем = ВесОбъем + ?(Объем <> "0.000", ?(ВесОбъем <> "", ", ", "") + Объем + " " + СтрокаТовар.ОбъемЕдиницаИзмерения, "");
			ДанныеТовара.code			= ВесОбъем;
			
			Данные.МассивТоваров.Добавить(ДанныеТовара);				
				
			КонецЦикла; 
		КонецЕсли;
		
	КонецЦикла;        
		
	Возврат Данные;
 
КонецФункции

#КонецОбласти

#Область Склады

Функция ОбновитьСкладыМониторинг(СкладыКОтправке, НастройкиАвторизации, ЗапросыДляЛогов)     
	
	РезультатВыполнения = ПараметрыВыполнения("Обновление складов в мониторинге");
	
	Попытка     
		// Получение списка складов
		СкладыМониторинг = ВыполнитьЗапросПолучениеСклады(НастройкиАвторизации);
		РезультатВыполнения.Результат = СкладыМониторинг.Результат; 
		РезультатВыполнения.Сообщение = СкладыМониторинг.Сообщение + Символы.ПС;
		
		ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "СписокСкладовЗапрос", СкладыМониторинг.Метод);		
		ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "СписокСкладовОтвет", СкладыМониторинг.JsonОтвет, ,, Не СкладыМониторинг.Результат);
	
		Если СкладыМониторинг.Результат Тогда  
		
			Сч = СкладыКОтправке.Количество() - 1;
			Пока Сч >= 0 Цикл          
				Для Каждого СкладМониторинг Из СкладыМониторинг.ОтветСтруктура Цикл
					Если СкладыКОтправке[Сч].number = СкладМониторинг.number Тогда
						СкладыКОтправке.Удалить(Сч);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			  Сч = Сч - 1;
			КонецЦикла;		
			
			// Обновить склады, которых нет в мониторинге
			Если СкладыКОтправке.Количество() > 0 Тогда		
				ОбновлениеСклады = ВыполнитьЗапросОбновлениеСклады(СкладыКОтправке, НастройкиАвторизации);    
				
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеСкладовЗапрос", ОбновлениеСклады.Метод + Символы.ПС + "Тело:" + ОбновлениеСклады.Тело);		
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеСкладовОтвет", ОбновлениеСклады.JsonОтвет,,, Не ОбновлениеСклады.Результат);
				
				РезультатВыполнения.Результат = ОбновлениеСклады.Результат;
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ОбновлениеСклады.Сообщение + Символы.ПС;
			КонецЕсли;       
		
		Иначе
			РезультатВыполнения.Сообщение = СкладыМониторинг.Сообщение;
		КонецЕсли;
		
	Исключение
		РезультатВыполнения.Сообщение = "Ошибка при обновлении складов мониторинга: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;      
	
	ЗакрытьПараметрыВыполнения(РезультатВыполнения);
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыполнитьЗапросПолучениеСклады(НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/depots";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		// В ответе должен быть массив складов
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Массив") Тогда
			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = "Получен список складов";				
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;

	КонецЕсли;
	
	Возврат RestЗапрос;		
	
КонецФункции

Функция ВыполнитьЗапросОбновлениеСклады(СкладыКотправке, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/depots-batch";
	ПараметрыRest.ТипМетода = "POST";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	ПараметрыRest.Тело		= СкладыКОтправке;
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Структура") 
			И RestЗапрос.ОтветСтруктура.Свойство("inserted") И RestЗапрос.ОтветСтруктура.Свойство("updated") Тогда   

			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Склады обновлены: добавлено %1, редактировано %2", 
			RestЗапрос.ОтветСтруктура.inserted, RestЗапрос.ОтветСтруктура.updated); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции

#КонецОбласти	

#Область ПользователиМобильноеПриложение

Функция ОбновитьПользователиМобильноеПриложение(КурьерыКОтправке, НастройкиАвторизации, ЗапросыДляЛогов)
	
	РезультатВыполнения = ПараметрыВыполнения("Обновление курьеров в мобильном приложении");
	
	Попытка     
		// Получение списка складов
		ПользователиМониторинг = ВыполнитьЗапросПолучениеПользователи(НастройкиАвторизации);
		РезультатВыполнения.Результат = ПользователиМониторинг.Результат;
		РезультатВыполнения.Сообщение = ПользователиМониторинг.Сообщение + Символы.ПС;
		
		ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "СписокПользователейЗапрос", ПользователиМониторинг.Метод);		
		ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "СписокПользователейОтвет", ПользователиМониторинг.JsonОтвет, ,, Не ПользователиМониторинг.Результат);
	
		Если ПользователиМониторинг.Результат Тогда  
		
			Для Каждого Курьер Из КурьерыКОтправке Цикл      

				ПользовательЕсть = Ложь;
				Для Каждого ПользовательМониторинг Из ПользователиМониторинг.ОтветСтруктура Цикл
					Если ПользовательМониторинг.role = "app" И Курьер.phone = ПользовательМониторинг.login Тогда                                 
						ПользовательЕсть = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;  
	
				Если Не ПользовательЕсть Тогда         
					Логин = Новый Структура("login", Курьер.phone);
					ОбновлениеПользователь = ВыполнитьЗапросОбновлениеПользователи(Логин, НастройкиАвторизации);    
					
					ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеПользователя" + Сред(Курьер.phone, 2) + "_Запрос", ОбновлениеПользователь.Метод + Символы.ПС + "Тело:" + ОбновлениеПользователь.Тело);		
					ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеПользователя" + Сред(Курьер.phone, 2) + "_Ответ", ОбновлениеПользователь.JsonОтвет,,, Не ОбновлениеПользователь.Результат);
					
					Если Не ОбновлениеПользователь.Результат Тогда
						РезультатВыполнения.Результат = ОбновлениеПользователь.Результат;
					КонецЕсли;
						
					РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + СтрШаблон("Пользователь %1 %2добавлен в мобильное приложение", Курьер.phone, ?(ОбновлениеПользователь.Результат, "", "не ")) + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
		
		Иначе
			РезультатВыполнения.Сообщение = ПользователиМониторинг.Сообщение;
		КонецЕсли;
		
	Исключение
		РезультатВыполнения.Сообщение = "Ошибка при обновлении пользователей в мобильном приложении: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;      
	
	ЗакрытьПараметрыВыполнения(РезультатВыполнения);
	Возврат РезультатВыполнения;	
	
КонецФункции	

Функция ВыполнитьЗапросПолучениеПользователи(НастройкиАвторизации);
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/users";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		// В ответе должен быть массив пользователей
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Массив") Тогда
			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = "Получен список пользователей";				
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;

	КонецЕсли;
	
	Возврат RestЗапрос;		
	
КонецФункции

Функция ВыполнитьЗапросОбновлениеПользователи(Логин, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/app-user";
	ПараметрыRest.ТипМетода = "POST";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	ПараметрыRest.Тело		= Логин;
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Структура") И RestЗапрос.ОтветСтруктура.Количество() = 0 Тогда   
			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Добавлен пользователь %1 мобильного приложения", Логин.login); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции

#КонецОбласти

#Область Курьеры

Функция ОбновитьКурьерыМониторинг(КурьерыКОтправке, НастройкиАвторизации, ЗапросыДляЛогов)     
	
	РезультатВыполнения = ПараметрыВыполнения("Обновление курьеров в мониторинге");
	
	Попытка     
		// Получение списка курьеров
		КурьерыМониторинг = ВыполнитьЗапросПолучениеКурьеры(НастройкиАвторизации); 
		РезультатВыполнения.Результат = КурьерыМониторинг.Результат;
		РезультатВыполнения.Сообщение = КурьерыМониторинг.Сообщение + Символы.ПС;
		
		ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "СписокКурьеровЗапрос", КурьерыМониторинг.Метод);		
		ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "СписокКурьеровОтвет", КурьерыМониторинг.JsonОтвет, ,, Не КурьерыМониторинг.Результат);
	
		Если КурьерыМониторинг.Результат Тогда  
		
			Сч = КурьерыКОтправке.Количество() - 1;
			Пока Сч >= 0 Цикл          
				Для Каждого КурьерМониторинг Из КурьерыМониторинг.ОтветСтруктура Цикл
					Если КурьерыКОтправке[Сч].number = КурьерМониторинг.number Тогда
						КурьерыКОтправке.Удалить(Сч);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			  Сч = Сч - 1;
			КонецЦикла;		
			
			// Обновить курьеров, которых нет в мониторинге
			Если КурьерыКОтправке.Количество() > 0 Тогда		
				ОбновлениеКурьеры = ВыполнитьЗапросОбновлениеКурьеры(КурьерыКОтправке, НастройкиАвторизации);    
				
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеКурьеровЗапрос", ОбновлениеКурьеры.Метод + Символы.ПС + "Тело:" + ОбновлениеКурьеры.Тело);		
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеКурьеровОтвет", ОбновлениеКурьеры.JsonОтвет,,, Не ОбновлениеКурьеры.Результат);
				
				РезультатВыполнения.Результат = ОбновлениеКурьеры.Результат;
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ОбновлениеКурьеры.Сообщение + Символы.ПС;
			КонецЕсли;       
		
		Иначе
			РезультатВыполнения.Сообщение = КурьерыМониторинг.Сообщение;
		КонецЕсли;
		
	Исключение
		РезультатВыполнения.Сообщение = "Ошибка при обновлении курьеров мониторинга: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;      
	
	ЗакрытьПараметрыВыполнения(РезультатВыполнения);
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыполнитьЗапросПолучениеКурьеры(НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/couriers";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		// В ответе должен быть массив курьеров
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Массив") Тогда
			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = "Получен список курьеров";				
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;

	КонецЕсли;
	
	Возврат RestЗапрос;		
	
КонецФункции

Функция ВыполнитьЗапросОбновлениеКурьеры(КурьерыКотправке, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/couriers-batch";
	ПараметрыRest.ТипМетода = "POST";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	ПараметрыRest.Тело		= КурьерыКотправке;
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Структура") 
			И RestЗапрос.ОтветСтруктура.Свойство("inserted") И RestЗапрос.ОтветСтруктура.Свойство("updated") Тогда   

			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Курьеры обновлены: добавлено %1, редактировано %2", 
			RestЗапрос.ОтветСтруктура.inserted, RestЗапрос.ОтветСтруктура.updated); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции

#КонецОбласти	

#Область Маршруты

Функция ОбновитьМаршрутыМониторинг(МаршрутыКОтправке, ИдентификаторыРейсов, НастройкиАвторизации, ЗапросыДляЛогов)     
	
	РезультатВыполнения = ПараметрыВыполнения("Обновление маршрутов в мониторинге");
	
	Попытка     
		// Обновить маршруты
		Если МаршрутыКОтправке.Количество() > 0 Тогда		
			ОбновлениеМаршруты = ВыполнитьЗапросОбновлениеМаршруты(МаршрутыКОтправке, НастройкиАвторизации);    
			
			ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеМаршрутовЗапрос", ОбновлениеМаршруты.Метод + Символы.ПС + "Тело:" + ОбновлениеМаршруты.Тело);		
			ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеМаршрутовОтвет", ОбновлениеМаршруты.JsonОтвет,,, Не ОбновлениеМаршруты.Результат);
			
			РезультатВыполнения.Результат = ОбновлениеМаршруты.Результат;
			РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ОбновлениеМаршруты.Сообщение + Символы.ПС;
		КонецЕсли;  
		     
		// Получить идентификаторы маршрутов
		Если РезультатВыполнения.Результат Тогда
			Для Каждого Рейс Из ИдентификаторыРейсов Цикл
				ПолучениеИдентификатораМаршрута = ВыполнитьЗапросПолучитьМаршрут(Рейс.НомерРейса, НастройкиАвторизации);
				
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ПолучениеИдентификатораМаршрута" + Рейс.НомерРейса + "Запрос", ПолучениеИдентификатораМаршрута.Метод);		
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ПолучениеИдентификатораМаршрута" + Рейс.НомерРейса + "Ответ", ПолучениеИдентификатораМаршрута.JsonОтвет,,, Не ПолучениеИдентификатораМаршрута.Результат);
				
				РезультатВыполнения.Результат = ПолучениеИдентификатораМаршрута.Результат;
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ПолучениеИдентификатораМаршрута.Сообщение + Символы.ПС;
				
				Если ПолучениеИдентификатораМаршрута.Результат Тогда
					Рейс.ИдРейса = ПолучениеИдентификатораМаршрута.ОтветСтруктура[0].id;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 

	Исключение
		РезультатВыполнения.Сообщение = "Ошибка при обновлении маршрутов мониторинга: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;      
	
	ЗакрытьПараметрыВыполнения(РезультатВыполнения);
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыполнитьЗапросОбновлениеМаршруты(МаршрутыКОтправке, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/routes-batch";
	ПараметрыRest.ТипМетода = "POST";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	ПараметрыRest.Тело		= МаршрутыКОтправке;
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Структура") 
			И RestЗапрос.ОтветСтруктура.Свойство("inserted") И RestЗапрос.ОтветСтруктура.Свойство("updated") Тогда   

			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Маршруты обновлены: добавлено %1, редактировано %2", 
				RestЗапрос.ОтветСтруктура.inserted, RestЗапрос.ОтветСтруктура.updated); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции

Функция ВыполнитьЗапросПолучитьМаршрут(НомерРейса, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/routes?number=" + НомерРейса;
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Массив")
			И RestЗапрос.ОтветСтруктура.Количество() > 0
			И RestЗапрос.ОтветСтруктура[0].Свойство("id") 
			И RestЗапрос.ОтветСтруктура[0].Свойство("number")Тогда   

			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Получен идентификатор маршрута %1 по номеру %2", 
				RestЗапрос.ОтветСтруктура[0].id, RestЗапрос.ОтветСтруктура[0].number); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции	

#КонецОбласти

#Область Заказы

Функция ОбновитьЗаказыМониторинг(ЗаказыКОтправке, ИдентификаторыРейсов, ИдентификаторыЗаказов, НастройкиАвторизации, ЗапросыДляЛогов)     
	
	РезультатВыполнения = ПараметрыВыполнения("Обновление заказов в мониторинге");
	
	Попытка     
		// Обновить маршруты
		Если ЗаказыКОтправке.Количество() > 0 Тогда		
			ОбновлениеЗаказы = ВыполнитьЗапросОбновлениеЗаказы(ЗаказыКОтправке, НастройкиАвторизации);    
			
			ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеЗаказыЗапрос", ОбновлениеЗаказы.Метод + Символы.ПС + "Тело:" + ОбновлениеЗаказы.Тело);		
			ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеЗаказыОтвет", ОбновлениеЗаказы.JsonОтвет,,, Не ОбновлениеЗаказы.Результат);
			
			РезультатВыполнения.Результат = ОбновлениеЗаказы.Результат;
			РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ОбновлениеЗаказы.Сообщение + Символы.ПС;
		КонецЕсли;   
		    
		// Получить идентификаторы заказов
		Если РезультатВыполнения.Результат Тогда
			
			Для Каждого Рейс Из ИдентификаторыРейсов Цикл
				
				ПолучениеЗаказов = ВыполнитьЗапросПолученияЗаказов(Рейс.ИдРейса, НастройкиАвторизации);
				
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ПолучениеЗаказовМаршрута" + Рейс.НомерРейса + "Запрос", ПолучениеЗаказов.Метод);		
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ПолучениеЗаказовМаршрута" + Рейс.НомерРейса + "Ответ", ПолучениеЗаказов.JsonОтвет,,, Не ПолучениеЗаказов.Результат);
				
				РезультатВыполнения.Результат = ПолучениеЗаказов.Результат;
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ПолучениеЗаказов.Сообщение + Символы.ПС;
				
				Если Не ПолучениеЗаказов.Результат Тогда
					Прервать;
				КонецЕсли;	
				
				Для Каждого Заказ Из ИдентификаторыЗаказов Цикл
					
					Если Рейс.НомерРейса <> Заказ.НомерРейса Тогда
						Продолжить;
					КонецЕсли;
				
					Для Каждого ЗаказМаршрута Из ПолучениеЗаказов.ОтветСтруктура Цикл
						
						Если Заказ.НомерЗаказа <> ЗаказМаршрута.number Тогда
							Продолжить;
						КонецЕсли; 
						
						Заказ.ИдЗаказа = ЗаказМаршрута.id;
						Прервать;

					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли; 		    

	Исключение
		РезультатВыполнения.Сообщение = "Ошибка при получении заказов маршрута: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;      
	
	ЗакрытьПараметрыВыполнения(РезультатВыполнения);
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыполнитьЗапросОбновлениеЗаказы(ЗаказыКОтправке, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/orders-batch";
	ПараметрыRest.ТипМетода = "POST";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	ПараметрыRest.Тело		= ЗаказыКОтправке;
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Структура") 
			И RestЗапрос.ОтветСтруктура.Свойство("inserted") И RestЗапрос.ОтветСтруктура.Свойство("updated") Тогда   

			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Заказы обновлены: добавлено %1, редактировано %2", 
			RestЗапрос.ОтветСтруктура.inserted, RestЗапрос.ОтветСтруктура.updated); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции

Функция ВыполнитьЗапросПолученияЗаказов(ИдРейса, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/orders?route_id=" + Формат(ИдРейса, "ЧГ=");
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Массив")
			И RestЗапрос.ОтветСтруктура.Количество() > 0
			И RestЗапрос.ОтветСтруктура[0].Свойство("id") 
			И RestЗапрос.ОтветСтруктура[0].Свойство("number")Тогда   

			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Получены заказы по идентификатору маршрута %1", Формат(ИдРейса, "ЧГ=")); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции	

#КонецОбласти

#Область Точки

Функция ОбновитьТочкиМониторинг(РейсыКОтправке, ТочкиКОтправке, НастройкиАвторизации, ЗапросыДляЛогов)     
	
	РезультатВыполнения = ПараметрыВыполнения("Обновление заказов в мониторинге");
	
	Попытка     
		// Задать узлы маршрута
		Для Сч = 0 По РейсыКОтправке.Количество() - 1 Цикл
			
			ОбновлениеТочки = ВыполнитьЗапросОбновлениеТочки(РейсыКОтправке[Сч].ИдРейса, ТочкиКОтправке[Сч], НастройкиАвторизации);    
			
			ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеТочкиЗапрос", ОбновлениеТочки.Метод + Символы.ПС + "Тело:" + ОбновлениеТочки.Тело);		
			ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеТочкиОтвет", ОбновлениеТочки.JsonОтвет,,, Не ОбновлениеТочки.Результат);
			
			РезультатВыполнения.Результат = ОбновлениеТочки.Результат;
			РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ОбновлениеТочки.Сообщение + Символы.ПС;
			
		КонецЦикла;

	Исключение
		РезультатВыполнения.Сообщение = "Ошибка при обновлении точек маршрута: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;      
	
	ЗакрытьПараметрыВыполнения(РезультатВыполнения);
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыполнитьЗапросОбновлениеТочки(ИдРейса, ТочкиКОтправке, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/routes/" + Формат(ИдРейса, "ЧГ=") + "/nodes";
	ПараметрыRest.ТипМетода = "POST";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	ПараметрыRest.Тело		= ТочкиКОтправке;
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Структура") 
			И RestЗапрос.ОтветСтруктура.Количество() = 0 Тогда 
			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = "Заданы узлы маршрута"; 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции   

#КонецОбласти

#Область Товары

Функция ОбновитьТоварыМониторинг(ТоварыКОтправке, ИдентификаторыЗаказов, НастройкиАвторизации, ЗапросыДляЛогов)     
	
	РезультатВыполнения = ПараметрыВыполнения("Обновление товаров в мониторинге");
	
	Попытка     
		Для Каждого Заказ Из ИдентификаторыЗаказов Цикл
	
			// Получить товарный состав заказа
			ПолучениеТоварногоСостава = ВыполнитьЗапросПолученияТоварногоСостава(Заказ.ИдЗаказа, НастройкиАвторизации);
			
			ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ПолучениеТоварногоСоставаЗаказа" + Заказ.НомерЗаказа + "Запрос", ПолучениеТоварногоСостава.Метод);		
			ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ПолучениеТоварногоСоставаЗаказа" + Заказ.НомерЗаказа + "Ответ", ПолучениеТоварногоСостава.JsonОтвет,,, Не ПолучениеТоварногоСостава.Результат);
			
			РезультатВыполнения.Результат = ПолучениеТоварногоСостава.Результат;
			РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ПолучениеТоварногоСостава.Сообщение + Символы.ПС;
			
			Если Не РезультатВыполнения.Результат Тогда
				Прервать;
			КонецЕсли;
			
			// Удалить товарный состав заказа
			Если ПолучениеТоварногоСостава.ОтветСтруктура.results.Количество() > 0 Тогда
				
				УдалениеТоварногоСостава = ВыполнитьЗапросУдаленияТоварногоСостава(Заказ.ИдЗаказа, НастройкиАвторизации);
				
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "УдалениеТоварногоСоставаЗаказа" + Заказ.НомерЗаказа + "Запрос", УдалениеТоварногоСостава.Метод);		
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "УдалениеТоварногоСоставаЗаказа" + Заказ.НомерЗаказа + "Ответ", УдалениеТоварногоСостава.JsonОтвет,,, Не УдалениеТоварногоСостава.Результат);
				
				РезультатВыполнения.Результат = УдалениеТоварногоСостава.Результат;
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + УдалениеТоварногоСостава.Сообщение + Символы.ПС;
				
				Если Не РезультатВыполнения.Результат Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		
			// Добавить товарный состав заказа
			ТоварныйСостав = Новый Массив();
			Для Каждого Товар Из ТоварыКотправке Цикл
				
				Если Товар.НомерЗаказа <> Заказ.НомерЗаказа Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеТовара = ПараметрыТоваров();
				ЗаполнитьЗначенияСвойств(ДанныеТовара, Товар);
				ТоварныйСостав.Добавить(ДанныеТовара);
			КонецЦикла;
			
			Если ТоварныйСостав.Количество() > 0 Тогда
				
				ОбновлениеТоварногоСостава = ВыполнитьЗапросОбновлениеТоварногоСостава(ТоварныйСостав, Заказ.ИдЗаказа, НастройкиАвторизации);
				
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеТоварногоСоставаЗаказа" + Заказ.НомерЗаказа + "Запрос", ОбновлениеТоварногоСостава.Метод + Символы.ПС + "Тело:" + ОбновлениеТоварногоСостава.Тело);		
				ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, "ОбновлениеТоварногоСоставаЗаказа" + Заказ.НомерЗаказа + "Ответ", ОбновлениеТоварногоСостава.JsonОтвет,,, Не ОбновлениеТоварногоСостава.Результат);
				
				РезультатВыполнения.Результат = ОбновлениеТоварногоСостава.Результат;
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ОбновлениеТоварногоСостава.Сообщение + Символы.ПС;
				
				Если Не РезультатВыполнения.Результат Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;		

	Исключение
		РезультатВыполнения.Сообщение = "Ошибка при обновлении заказов мониторинга: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;      
	
	ЗакрытьПараметрыВыполнения(РезультатВыполнения);
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыполнитьЗапросПолученияТоварногоСостава(ИдЗаказа, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/orders/" + Формат(ИдЗаказа, "ЧГ=") + "/items";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Структура")
			И RestЗапрос.ОтветСтруктура.Свойство("results") 
			И ТипЗнч(RestЗапрос.ОтветСтруктура.results) = Тип("Массив") Тогда
  
			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Получен товарный состав по идентификатору заказа %1", Формат(ИдЗаказа, "ЧГ=")); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции	

Функция ВыполнитьЗапросУдаленияТоварногоСостава(ИдЗаказа, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/orders/" + Формат(ИдЗаказа, "ЧГ=") + "/items";
	ПараметрыRest.ТипМетода = "DELETE";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если Не RestЗапрос.Результат 
		И ТипЗнч(RestЗапрос.JsonОтвет) = Тип("Строка")
		И Лев(RestЗапрос.JsonОтвет, 4) = "null" Тогда
  
			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Удален товарный состав по идентификатору заказа %1", Формат(ИдЗаказа, "ЧГ=")); 
	Иначе
		RestЗапрос.Результат = Ложь;
		RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции

Функция ВыполнитьЗапросОбновлениеТоварногоСостава(ТоварКОтправке, ИдЗаказа, НастройкиАвторизации) Экспорт
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= НастройкиАвторизации.АдресСервера;
	ПараметрыRest.Метод		= "/api/v1/companies/"  + НастройкиАвторизации.IdКомпании + "/orders/" + Формат(ИдЗаказа, "ЧГ=") + "/items";
	ПараметрыRest.ТипМетода = "POST";
	ПараметрыRest.Заголовки	= ПолучитьЗаголовкиТокен(НастройкиАвторизации);
	ПараметрыRest.Тело		= ТоварКОтправке;
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Массив")
			И RestЗапрос.ОтветСтруктура.Количество() > 0 Тогда   

			RestЗапрос.Результат = Истина;
			RestЗапрос.Сообщение = СтрШаблон("Товары по идентификтору %1 добавлены в количестве %2", 
			Формат(ИдЗаказа, "ЧГ="), RestЗапрос.ОтветСтруктура.Количество()); 
		Иначе
			RestЗапрос.Результат = Ложь;
			RestЗапрос.Сообщение = ПолучитьТекстОшибки(RestЗапрос.ОтветСтруктура);
		КонецЕсли;
	КонецЕсли;
	
	Возврат RestЗапрос;	
	
КонецФункции

#КонецОбласти   

#Область Пропуска                   

Функция ПолучитьПропускНаСклад(Рейс)
	
	QrТип 			= "QRCODE";
	QrКод 			= ГенерацияШтрихкода.СформироватьQRкод(Рейс);  
	QrОписание 		= "Пропуск на склад";
	
	Возврат ПолучитьСсылкуQrШтрихкод(QrТип, QrКод, QrОписание);
	
КонецФункции

Функция ПолучитьОтгрузкуМаркетплейса(Рейс, ВозвратТовара = Ложь)
	
	ОтгрузкаМаркетПлейс = ИнтеграцияМаркетплейсы.ПодтвердитьОтгрузку(Рейс, ВозвратТовара);		   
	
	ШкТип 			= "CODE128";
	ШкКод 			= ОтгрузкаМаркетПлейс.Штрихкод;  
	ШкОписание 		= ?(Не ВозвратТовара, "Отгрузка ", "Возврат ") + ВРег(ОтгрузкаМаркетПлейс.Маркетплейс);

	Если ЗначениеЗаполнено(ШкКод) Тогда
		СсылкаОтгрузки = ПолучитьСсылкуQrШтрихкод(ШкТип, ШкКод, ШкОписание);
	Иначе
		СсылкаОтгрузки = "";	
	КонецЕсли;
	
	Возврат Новый Структура ("ЗаказНаДоставку, СсылкаОтгрузки, ОписаниеОтгрузки", ОтгрузкаМаркетПлейс.ЗаказНаДоставку, СсылкаОтгрузки, ШкОписание);
	
КонецФункции

Функция ПолучитьСсылкуQrШтрихкод(QrШкТип, QrКод, QrОписание)
	
	СсылкаНаПропуск = "";
	
	ПараметрыRest = ИнтеграцияREST.ПараметрыВыполненияRest();
	
	ПараметрыRest.url		= "tg-alterra.ru";
	ПараметрыRest.Метод		= "/api/v1/barcode.create";
	ПараметрыRest.ТипМетода = "POST";

	ПараметрыRest.Тело = Новый Структура;
	ПараметрыRest.Тело.Вставить("codeType", 	QrШкТип);
	ПараметрыRest.Тело.Вставить("content", 		QrКод);   
	ПараметрыRest.Тело.Вставить("description", 	QrОписание);   
	
	RestЗапрос = ИнтеграцияREST.ВыполнитьRestЗапрос(ПараметрыRest);
	
	Если RestЗапрос.Результат Тогда
		Если ТипЗнч(RestЗапрос.ОтветСтруктура) = Тип("Структура")
			И RestЗапрос.ОтветСтруктура.Свойство("error")  
			И ТипЗнч(RestЗапрос.ОтветСтруктура.error) = Тип("Булево")
			И Не RestЗапрос.ОтветСтруктура.error 
			И RestЗапрос.ОтветСтруктура.Свойство("data")
			И ТипЗнч(RestЗапрос.ОтветСтруктура.data) = Тип("Структура") 
			И RestЗапрос.ОтветСтруктура.data.Свойство("link") Тогда  
			
			СсылкаНаПропуск = RestЗапрос.ОтветСтруктура.data.link;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылкаНаПропуск;	   
	
КонецФункции	

#КонецОбласти

#Область Авторизация

Функция ПолучитьАвторизацию()
	
	НастройкиАвторизации = НастройкиАвторизации();
	
	ДополнительнаяОбработка = ПолучитьОбработку();
	Если Не ДополнительнаяОбработка.Пустая() Тогда

		НастройкиХранилища = ДополнительнаяОбработка.ХранилищеНастроек.Получить();					
		Если НастройкиХранилища	<> Неопределено Тогда  
			
			Если НастройкиХранилища.Свойство("IdКомпании") Тогда
				НастройкиАвторизации.IdКомпании = НастройкиХранилища.IdКомпании;
			КонецЕсли;
				 
			Если НастройкиХранилища.Свойство("НастройкиКлючAPIЯндексМаршрутизация") Тогда
				НастройкиАвторизации.ApiКлюч = НастройкиХранилища.НастройкиКлючAPIЯндексМаршрутизация;
			КонецЕсли;

			Если НастройкиХранилища.Свойство("НастройкиТокенЯндексМониторинг") Тогда
				НастройкиАвторизации.Токен = НастройкиХранилища.НастройкиТокенЯндексМониторинг;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	 
	Возврат НастройкиАвторизации;	
	
КонецФункции	

Функция ПолучитьОбработку()
	
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", "ПланированиеРейсовЯндексМаршрутизация.epf");			
	Возврат ДополнительнаяОбработка;
	
КонецФункции 

Функция ПолучитьЗаголовкиТокен(НастройкиАвторизации)

	Заголовки = Новый Массив;
	Заголовки.Добавить(Новый Структура("Ключ, Значение", "Authorization", "Auth " + НастройкиАвторизации.Токен));
	Возврат Заголовки;
	
КонецФункции

#КонецОбласти	

#Область Параметры

Функция ПараметрыМаршрутов() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("МассивКурьеров",		Новый Массив());
	Параметры.Вставить("МассивСкладов", 		Новый Массив());
	Параметры.Вставить("МассивРейсов", 			Новый Массив());
	Параметры.Вставить("МассивЗаказов",			Новый Массив());
	Параметры.Вставить("МассивТочек", 			Новый Массив()); 
	Параметры.Вставить("МассивТоваров", 		Новый Массив());
	
	Параметры.Вставить("ИдентификаторыРейсов",	Новый Массив());
	Параметры.Вставить("ИдентификаторыЗаказов",	Новый Массив());
		
	Возврат Параметры;
	
КонецФункции 

Функция ПараметрыСклада() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("number");
	Параметры.Вставить("name");
	Параметры.Вставить("address"); 
	Параметры.Вставить("lat"); 
	Параметры.Вставить("lon");
		
	Возврат Параметры;
	
КонецФункции 

Функция ПараметрыКурьера() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("number");
	Параметры.Вставить("phone");
	Параметры.Вставить("name");
		
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыМаршрута() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("number");
	Параметры.Вставить("courier_number");
	Параметры.Вставить("depot_number"); 
	Параметры.Вставить("date"); 
	Параметры.Вставить("routing_mode");
		
	Возврат Параметры;
	
КонецФункции 

Функция ПараметрыЗаказа() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("route_number");
	Параметры.Вставить("time_interval");
	Параметры.Вставить("number"); 
	Параметры.Вставить("phone"); 
	Параметры.Вставить("lat");
	Параметры.Вставить("lon"); 
	Параметры.Вставить("address");
	Параметры.Вставить("customer_name"); 
	Параметры.Вставить("volume");
	Параметры.Вставить("weight"); 
	Параметры.Вставить("status");
	Параметры.Вставить("shared_service_duration_s"); 
	Параметры.Вставить("service_duration_s");
	Параметры.Вставить("comments"); 
		
	Возврат Параметры;
	
КонецФункции 

Функция ПараметрыТочкиСклад() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("type", "depot");
	Параметры.Вставить("value", Новый Структура);
	Параметры.value.Вставить("number");
	Параметры.value.Вставить("status", "unvisited");
		
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыТочкиЗаказ() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("type", "order");
	Параметры.Вставить("value", Новый Структура);
	Параметры.value.Вставить("number");
	Параметры.value.Вставить("address");
	Параметры.value.Вставить("lat");
	Параметры.value.Вставить("lon");
	Параметры.value.Вставить("time_interval");
		
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыТоваров() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("number",) ;
	Параметры.Вставить("description");
	Параметры.Вставить("price"); 
	Параметры.Вставить("total_count"); 
	Параметры.Вставить("code");
		
	Возврат Параметры;
	
КонецФункции 

Функция ИдентификаторыРейсов() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("НомерРейса");
	Параметры.Вставить("ИдРейса");
	Параметры.Вставить("Ссылка");      
	
	Параметры.Вставить("ПропускНаСклад");  
	
	Параметры.Вставить("ЗаказОтгрузка");
	Параметры.Вставить("СсылкаОтгрузка");
	Параметры.Вставить("ОписаниеОтгрузка");
	
	Параметры.Вставить("ЗаказВозврат");
	Параметры.Вставить("СсылкаВозврат");
	Параметры.Вставить("ОписаниеВозврат");
		
	Возврат Параметры;
	
КонецФункции 

Функция ИдентификаторыЗаказов() 
	
	Параметры = Новый Структура;

	Параметры.Вставить("НомерРейса");
	Параметры.Вставить("НомерЗаказа");
	Параметры.Вставить("ИдЗаказа");
		
	Возврат Параметры;
	
КонецФункции 

Функция НастройкиОбслуживанияЗаказов() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Филиал");
	Параметры.Вставить("СтатусЗаказов");
	Параметры.Вставить("ВремяОбслуживанияАдрес");
	Параметры.Вставить("ВремяОбслуживанияАдресОРК");
	Параметры.Вставить("ВремяОбслуживанияЗаказ");
	Параметры.Вставить("ВремяОбслуживанияЗаказОРК");
	Параметры.Вставить("ПапкаЛогов");
	
	Возврат Параметры;
					
КонецФункции					

Функция НастройкиАвторизации() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("АдресСервера", "courier.yandex.ru");
	Параметры.Вставить("IdКомпании");
	Параметры.Вставить("ApiКлюч");
	Параметры.Вставить("Токен");  
	Возврат Параметры;	
	
КонецФункции

Функция ПараметрыВыполнения(Заголовок = "", Выделить = Ложь) 
	
	Дата = ТекущаяДатаСеанса();
		
	Параметры = Новый Структура;
	Параметры.Вставить("Результат", 		Ложь);
	Параметры.Вставить("ДатаНачала", 		Дата);
	Параметры.Вставить("ДатаОкончания"		);
	Параметры.Вставить("Ответ", 			"");
	Параметры.Вставить("JsonОтвет", 		"");
	Параметры.Вставить("Заголовок", 		Заголовок);
	Параметры.Вставить("Сообщение", 		"");
	Параметры.Вставить("Лог", 
		?(ЗначениеЗаполнено(Заголовок), 
			?(Выделить, ВРег(Заголовок), Заголовок) + Символы.ПС, "") + 
		Строка(Дата) + Символы.ПС + 
		?(Выделить, "-------------------------------------" + Символы.ПС + Символы.ПС, ""));
	Возврат Параметры;
	
КонецФункции

Процедура ЗакрытьПараметрыВыполнения(ПараметрыВыполнения) 
	
	ПараметрыВыполнения.ДатаОкончания = Строка(ТекущаяДатаСеанса());
	ПараметрыВыполнения.Лог = ПараметрыВыполнения.Лог + Символы.ПС + 
//		?(ЗначениеЗаполнено(ПараметрыВыполнения.Сообщение), ПараметрыВыполнения.Сообщение + Символы.ПС, "") +
		?(ПараметрыВыполнения.Результат, "Успешное выполнение", "Неуспешное выполнение") + Символы.ПС +
		Строка(ПараметрыВыполнения.ДатаОкончания) + Символы.ПС; 
	
КонецПроцедуры

#КонецОбласти 	

#Область Логи

Функция ЗапросыДляЛогов() Экспорт
	
	ЗапросыДляЛогов = Новый ТаблицаЗначений();
	
	ЗапросыДляЛогов.Колонки.Добавить("Дата", 			Новый ОписаниеТипов("Дата", , , 	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ЗапросыДляЛогов.Колонки.Добавить("Заголовок",		Новый ОписаниеТипов("Строка", , , 	Новый КвалификаторыСтроки(200))); 
	ЗапросыДляЛогов.Колонки.Добавить("ТекстЛогов",		Новый ОписаниеТипов("Строка")); 	
	ЗапросыДляЛогов.Колонки.Добавить("Филиал",			Новый ОписаниеТипов("Строка", , , 	Новый КвалификаторыСтроки(100)));
	ЗапросыДляЛогов.Колонки.Добавить("Идентификатор",	Новый ОписаниеТипов("Строка", , , 	Новый КвалификаторыСтроки(36)));
	ЗапросыДляЛогов.Колонки.Добавить("Ошибка",			Новый ОписаниеТипов("Булево"));
	
	Возврат ЗапросыДляЛогов;
	
КонецФункции

Функция ДобавитьЗапросыДляЛогов(ЗапросыДляЛогов, Заголовок, ТекстЛогов, Филиал = "", Идентификатор = "", Ошибка = Ложь) Экспорт
	
	СтрокаЗапроса = ЗапросыДляЛогов.Добавить(); 
	
	СтрокаЗапроса.Дата 			= ТекущаяДатаСеанса();
	СтрокаЗапроса.Заголовок 	= Заголовок;
	СтрокаЗапроса.ТекстЛогов 	= ТекстЛогов;
	СтрокаЗапроса.Филиал 		= Филиал;
	СтрокаЗапроса.Идентификатор = Идентификатор;
	СтрокаЗапроса.Ошибка 		= Ошибка;
	
КонецФункции	

Процедура ЗаписатьЛогЗапросов(ПапкаЛогов, ЗапросыДляЛогов) Экспорт
	
	Если ЗапросыДляЛогов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Филиал = "";
	Идентификатор = ""; 
	Для Каждого Запрос Из ЗапросыДляЛогов  Цикл
		Филиал = ?(Запрос.Филиал <> "" И Филиал = "", Запрос.Филиал, Филиал);
		Идентификатор = ?(Запрос.Идентификатор <> "" И Идентификатор = "", Запрос.Идентификатор, Идентификатор);
	КонецЦикла;   
	Филиал = ?(Филиал <> "", Филиал, "Филиал не определен");
	Филиал = СтрЗаменить(Филиал, "/", "");
	Идентификатор = ?(Идентификатор <> "", Идентификатор, "Идентификатор не определен"); 
	
	ИмяПользователя = СтрЗаменить(Строка(Пользователи.ТекущийПользователь()), " ", "");
	ПерваяДатаЗапроса = ЗапросыДляЛогов[0].Дата;
	
	ИмяПапкиЗаписиПоДате = ПапкаЛогов + ?(Прав(ПапкаЛогов, 1) <> "\", "\", "")  + "yandex\" + Филиал + "\" + Формат(ТекущаяДата(), "ДФ=ггггММдд"); 
	
	Попытка   
		КаталогЛоговПоДате = Новый Файл(ИмяПапкиЗаписиПоДате);
		Если Не КаталогЛоговПоДате.Существует() Тогда    
			Попытка
				СоздатьКаталог(ИмяПапкиЗаписиПоДате);
			Исключение
			КонецПопытки;
		КонецЕсли; 	
		
	    НайденныйКаталогПоИдентификатору = НайтиФайлы(ИмяПапкиЗаписиПоДате + "\", "*" + Идентификатор + "*", Ложь);  		
		Если НайденныйКаталогПоИдентификатору.Количество() > 0 Тогда
        	ИмяПапкиЗаписи = НайденныйКаталогПоИдентификатору[0].Имя;
			
		Иначе                                       
			ИмяПапкиЗаписи = Формат(ПерваяДатаЗапроса, "ДФ=ггггММдд") + "_" + Формат(ПерваяДатаЗапроса, "ДФ=ЧЧммсс") + "_" + Идентификатор + "_" + ИмяПользователя; 
			КаталогЛогов = Новый Файл(ИмяПапкиЗаписи);
			Если Не КаталогЛогов.Существует() Тогда
				СоздатьКаталог(ИмяПапкиЗаписиПоДате + "\" + ИмяПапкиЗаписи);
			КонецЕсли;     
		КонецЕсли;
		
		Для Каждого Запрос Из ЗапросыДляЛогов  Цикл
		
			ИмяЛога = "log_" + Формат(Запрос.Дата, "ДФ=ггггММдд") + "_" + Формат(Запрос.Дата, "ДФ=ЧЧммсс") + "_" + СтрЗаменить(Запрос.Заголовок, " ", "") + 
					   Строка(?(Запрос.Ошибка, "_Ошибка", "")) + "_" + ИмяПользователя + ".txt";      
			
			ФайлЛогов = Новый ЗаписьТекста(ИмяПапкиЗаписиПоДате + "\" + ИмяПапкиЗаписи + "\" + ИмяЛога, КодировкаТекста.UTF8, , Истина);
			ФайлЛогов.ЗаписатьСтроку(Запрос.ТекстЛогов);
			ФайлЛогов.Закрыть();  
		
		КонецЦикла;

	Исключение        
		Сообщить("Ошибка при записи логов: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;    
	
	ЗапросыДляЛогов.Очистить();
	
КонецПроцедуры		

#КонецОбласти

#КонецОбласти

#Область ОтслеживаниеДоставки

#Область СобытияДоставки

Функция ПолучитьСобытияДоставки(ДатаНачала, ДатаОкончания, Логирование = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатВыполнения = Новый Структура("Результат, ДатаНачала, ДатаОкончания, Сообщение", Истина, ТекущаяДатаСеанса(), Дата(1, 1, 1), "");
	РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + Строка(РезультатВыполнения.ДатаНачала) + Символы.ПС;
	
	ДатаНачала = НачалоДня(ДатаНачала);
	ДатаОкончания = НачалоДня(ДатаОкончания); 
	КоличествоДней = (ДатаОкончания - ДатаНачала) / (60 * 60 * 24);
		
	Попытка
		НастройкиАвторизации = ПолучитьНастройкиАвторизации();
		
		// Получить маршруты и заказы из мониторинга за период
		МаршрутыМониторинга = МаршрутыМониторинга();
		Для Счетчик = 0 По КоличествоДней Цикл
			
			ПолучениеМаршрутов = ВыполнитьЗапросПолучениеМаршруты(НастройкиАвторизации, ДатаНачала + Счетчик * 60 * 60 * 24);
			Если Не ПолучениеМаршрутов.Результат Или ПолучениеМаршрутов.ОтветСтруктура.Количество() = 0 Тогда
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ПолучениеМаршрутов.Сообщение + Символы.ПС;
				Продолжить;
			КонецЕсли;
			
			ДобавитьМаршрутыМониторинга(МаршрутыМониторинга, ПолучениеМаршрутов.ОтветСтруктура)
		КонецЦикла;

		РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + 
			СтрШаблон("Заказы мониторинга Яндекса за период с %1 по %2 в количестве %3 получены", 
			Формат(ДатаНачала, "ДФ=дд.ММ.гггг"), Формат(ДатаОкончания, "ДФ=дд.ММ.гггг"), МаршрутыМониторинга.Количество()) + Символы.ПС;
		
		// Определить заказы на доставку по номеру заказа
		МаршрутыЗаказыДляОтслеживания = ПолучитьМаршрутыЗаказыДляОтслеживания(МаршрутыМониторинга);

		Если ЗначениеЗаполнено(МаршрутыЗаказыДляОтслеживания.НенайденныеЗаказы) Тогда
			РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + МаршрутыЗаказыДляОтслеживания.НенайденныеЗаказы + Символы.ПС;
		КонецЕсли; 
		РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + 
			СтрШаблон("Определены текущие заказы для отслеживания в количестве %1", МаршрутыМониторинга.Количество()) + Символы.ПС;
		
		// Получить события заказов
		СобытияЗаказов = СобытияЗаказов();
		Для Каждого Маршрут Из МаршрутыЗаказыДляОтслеживания.Маршруты Цикл
			
			ПолучениеЗаказыМаршрута = ВыполнитьЗапросПолучениеЗаказыМаршрута(НастройкиАвторизации, Маршрут.ИдентификаторМаршрута);
			Если Не ПолучениеЗаказыМаршрута.Результат Тогда
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ПолучениеЗаказыМаршрута.Сообщение;
				Продолжить;
			КонецЕсли;
			
			ДобавитьСобытияЗаказов(СобытияЗаказов, ПолучениеЗаказыМаршрута.ОтветСтруктура, МаршрутыЗаказыДляОтслеживания.Заказы);
		КонецЦикла;
		
		ЗаписьСобытийДоставки = ЗаписатьСобытияДоставки(СобытияЗаказов);
		РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + 
			СтрШаблон("Добавлено %1 событий, не добавлено %2 событий", ЗаписьСобытийДоставки.КоличествоДобавлено, ЗаписьСобытийДоставки.КоличествоНедобавлено) + Символы.ПС;
		Если Не ЗаписьСобытийДоставки.Результат Тогда
			РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ЗаписьСобытийДоставки.Сообщение;
		КонецЕсли;
		
		// Получить трекинг заказов
		Для Каждого Заказ Из МаршрутыЗаказыДляОтслеживания.Трекинги Цикл 
			ПолучениеТрекинг = ВыполнитьЗапросПолучениеТрекинг(НастройкиАвторизации, Заказ.ИдентификаторЗаказа);	
			Если Не ПолучениеТрекинг.Результат Тогда
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ПолучениеТрекинг.Сообщение;
				Продолжить;
			КонецЕсли;	
			ДобавитьТрекинги(Заказ, ПолучениеТрекинг.ОтветСтруктура);
		КонецЦикла;
		
		ЗаписьТрекингов = ЗаписатьТрекинги(МаршрутыЗаказыДляОтслеживания.Трекинги);
		РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + 
			СтрШаблон("Добавлено %1 трекингов, не добавлено %2 трекингов", ЗаписьТрекингов.КоличествоДобавлено, ЗаписьТрекингов.КоличествоНедобавлено) + Символы.ПС;
		Если Не ЗаписьТрекингов.Результат Тогда
			РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + ЗаписьТрекингов.Сообщение;
		КонецЕсли;		
		
	Исключение
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + "Не удалось получить события доставки: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС;
	КонецПопытки;	
	
	РезультатВыполнения.ДатаОкончания = ТекущаяДатаСеанса();
	РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + Строка(РезультатВыполнения.ДатаОкончания) + Символы.ПС;
	
	Если Логирование Тогда
		ЗаписатьЛог(НастройкиАвторизации.НастройкиПапкаЛогов, РезультатВыполнения);
	КонецЕсли;	
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти	
	
#Область Rest		

Функция ВыполнитьЗапросПолучениеМаршруты(НастройкиАвторизации, Дата, НаСтранице = 200) Экспорт
	
	Метод = СтрШаблон("/api/v1/companies/%1/route-info?date=%2&per_page=%3", 
		НастройкиАвторизации.НастройкиIdКомпании, Формат(Дата, "ДФ=гггг-ММ-дд"), Формат(НаСтранице, "ЧГ=")); 
	
	РезультатВыполнения = ВыполнитьRestЗапрос(НастройкиАвторизации, Метод); 
	
	Попытка
		Если РезультатВыполнения.Результат Тогда 
			Если ТипЗнч(РезультатВыполнения.ОтветСтруктура) = Тип("Массив") Тогда 
				РезультатВыполнения.Сообщение = СтрШаблон("Маршруты в количестве %1 на %2 получены", 
					РезультатВыполнения.ОтветСтруктура.Количество(), Формат(Дата, "ДФ=дд.ММ.гггг")); 
			Иначе
				РезультатВыполнения.Результат = Ложь;  
				РезультатВыполнения.Сообщение = "Ошибка при получении маршрутов " + 
					?(РезультатВыполнения.ОтветСтруктура.Свойство("message"), РезультатВыполнения.ОтветСтруктура.message, "");
			КонецЕсли;
		КонецЕсли
	Исключение
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции      

Функция ВыполнитьЗапросПолучениеЗаказ(НастройкиАвторизации, ИдентификаторЗаказа) Экспорт
	
	Метод = СтрШаблон("/api/v1/companies/%1/orders/%2", 
		НастройкиАвторизации.НастройкиIdКомпании, ИдентификаторЗаказа); 
	
	РезультатВыполнения = ВыполнитьRestЗапрос(НастройкиАвторизации, Метод); 
	
	Попытка
		Если РезультатВыполнения.Результат Тогда 
			Если ТипЗнч(РезультатВыполнения.ОтветСтруктура) = Тип("Структура") Тогда 
				РезультатВыполнения.Сообщение = СтрШаблон("Заказ id %1 получен", ИдентификаторЗаказа);  
			Иначе
				РезультатВыполнения.Результат = Ложь;  
				РезультатВыполнения.Сообщение = СтрШаблон("Ошибка при получении заказа id %1 ", ИдентификаторЗаказа) +    
					?(РезультатВыполнения.ОтветСтруктура.Свойство("message"), РезультатВыполнения.ОтветСтруктура.message, "");
			КонецЕсли;
		КонецЕсли
	Исключение
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции 

Функция ВыполнитьЗапросПолучениеЗаказыМаршрута(НастройкиАвторизации, ИдентификаторМаршрута) Экспорт
	
	Метод = СтрШаблон("/api/v1/companies/%1/orders?route_id=%2", 
		НастройкиАвторизации.НастройкиIdКомпании, ИдентификаторМаршрута); 
	
	РезультатВыполнения = ВыполнитьRestЗапрос(НастройкиАвторизации, Метод); 
	
	Попытка
		Если РезультатВыполнения.Результат Тогда 
			Если ТипЗнч(РезультатВыполнения.ОтветСтруктура) = Тип("Массив") Тогда 
				РезультатВыполнения.Сообщение = СтрШаблон("Маршрут id %1 получен", ИдентификаторМаршрута);  
			Иначе
				РезультатВыполнения.Результат = Ложь;  
				РезультатВыполнения.Сообщение = СтрШаблон("Ошибка при получении маршрута id %1 ", ИдентификаторМаршрута) +    
					?(РезультатВыполнения.ОтветСтруктура.Свойство("message"), РезультатВыполнения.ОтветСтруктура.message, "");
			КонецЕсли;
		КонецЕсли
	Исключение
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыполнитьЗапросПолучениеТрекинг(НастройкиАвторизации, ИдентификаторЗаказа) Экспорт
	
	Метод = СтрШаблон("/api/v1/companies/%1/orders/%2/order-info", 
		НастройкиАвторизации.НастройкиIdКомпании, ИдентификаторЗаказа); 
	
	РезультатВыполнения = ВыполнитьRestЗапрос(НастройкиАвторизации, Метод); 
	
	Попытка
		Если РезультатВыполнения.Результат Тогда 
			Если ТипЗнч(РезультатВыполнения.ОтветСтруктура) = Тип("Структура") Тогда 
				РезультатВыполнения.Сообщение = СтрШаблон("Трекинг заказа id %1 получен", ИдентификаторЗаказа);  
			Иначе
				РезультатВыполнения.Результат = Ложь;  
				РезультатВыполнения.Сообщение = СтрШаблон("Ошибка при получении трекинга заказа id %1 ", ИдентификаторЗаказа) +    
					?(РезультатВыполнения.ОтветСтруктура.Свойство("message"), РезультатВыполнения.ОтветСтруктура.message, "");
			КонецЕсли;
		КонецЕсли
	Исключение
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции 

Функция ВыполнитьRestЗапрос(НастройкиАвторизации, Метод, ТипЗапроса = "GET", Тело = Неопределено)
	
	РезультатВыполнения = РезультатВыполненияRest();
	РезультатВыполнения.Метод = Метод; 

	Попытка 
		Соединение = Новый HTTPСоединение("courier.yandex.ru", , , , Новый ИнтернетПрокси(Истина), , Новый ЗащищенноеСоединениеOpenSSL);	   
				
		Запрос = Новый HTTPЗапрос(Метод);
		Запрос.Заголовки.Вставить("Content-Type", "application/json");
		Запрос.Заголовки.Вставить("Accept", "application/json");       
		Если ЗначениеЗаполнено(НастройкиАвторизации.НастройкиТокенЯндексМониторинг) Тогда 
			Запрос.Заголовки.Вставить("Authorization",	"Auth " + НастройкиАвторизации.НастройкиТокенЯндексМониторинг)
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Тело) Тогда
			Запрос.УстановитьТелоИзСтроки(Тело);
		КонецЕсли;
		
		Если ТипЗапроса = "GET" Тогда
			Ответ = Соединение.Получить(Запрос);	
		ИначеЕсли ТипЗапроса = "POST" Тогда
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);	
		КонецЕсли;     
		
		РезультатВыполнения.КодСостояния = Ответ.КодСостояния;

		Если Не ТипЗнч(Ответ) = Тип("HTTPОтвет") Тогда         
			РезультатВыполнения.Сообщение = "Ошибка формирования запроса. Код ошибки: " + Строка(Ответ.КодСостояния);
		Иначе		
			ОтветСтрока = Ответ.ПолучитьТелоКакСтроку();
			РезультатВыполнения.JsonОтвет = ФорматироватьJsonТекст(ОтветСтрока);
			РезультатВыполнения.Сообщение = РезультатВыполнения.JsonОтвет;       
			Попытка
				РезультатВыполнения.ОтветСтруктура = АльтерраОбщегоНазначения.ДесериализоватьИзJSON(ОтветСтрока);
			Исключение
			КонецПопытки;         
			
			Если ТипЗнч(РезультатВыполнения.ОтветСтруктура) = Тип("Структура") 
				Или ТипЗнч(РезультатВыполнения.ОтветСтруктура) = Тип("Массив") Тогда
					РезультатВыполнения.Результат = Истина;
					РезультатВыполнения.Сообщение = "Запрос успешно получен"; 
			Иначе                                
				РезультатВыполнения.Сообщение = "Ошибка при получении ответа";	
			КонецЕсли; 
		КонецЕсли;     

	Исключение         
		РезультатВыполнения.Сообщение = "Не удалось получить результаты запроса: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;                                                                                                                            

	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьНастройкиАвторизации() 

	ПараметрыАвторизации = ПараметрыАвторизации();
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", "ПланированиеРейсовЯндексМаршрутизация.epf");	
	
	Если Не ДополнительнаяОбработка.Пустая() Тогда
		НастройкиХранилища = ДополнительнаяОбработка.ХранилищеНастроек.Получить();					
		Если НастройкиХранилища	<> Неопределено Тогда  
			ЗаполнитьЗначенияСвойств(ПараметрыАвторизации, НастройкиХранилища);
			Возврат ПараметрыАвторизации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыАвторизации;
	
КонецФункции	

Функция ПараметрыАвторизации()
	
	ПараметрыАвторизации = Новый Структура;
	ПараметрыАвторизации.Вставить("НастройкиIdКомпании", 					"");
	ПараметрыАвторизации.Вставить("НастройкиКлючAPIЯндексМаршрутизация", 	"");
	ПараметрыАвторизации.Вставить("НастройкиТокенЯндексМониторинг", 		""); 
	ПараметрыАвторизации.Вставить("НастройкиПапкаЛогов", 					"");
	Возврат ПараметрыАвторизации;
	
КонецФункции	

Функция РезультатВыполненияRest()
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Метод", 			"");
	РезультатВыполнения.Вставить("Результат", 		Ложь); 
	РезультатВыполнения.Вставить("КодСостояния", 	500); 
	РезультатВыполнения.Вставить("JsonОтвет", 		""); 
	РезультатВыполнения.Вставить("ОтветСтруктура", 	Неопределено); 
	РезультатВыполнения.Вставить("Сообщение", 		"");
	Возврат РезультатВыполнения;
	
КонецФункции	

Функция ФорматироватьJsonТекст(JsonТекст)            
	
	JsonТекстСер = ?(ТипЗнч(JsonТекст) <> Тип("Структура") И ТипЗнч(JsonТекст) <> Тип("Массив"), 
		АльтерраОбщегоНазначения.ДесериализоватьИзJSON(JsonТекст), JsonТекст);  
		
	ЗаписьJSON = Новый ЗаписьJSON;  
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, JsonТекстСер);
	ТекстЗапроса = СтрЗаменить(ЗаписьJSON.Закрыть(),"\\","\");
	
	Возврат ТекстЗапроса;
	
КонецФункции 

#КонецОбласти

#Область ДанныеДляМониторинга

#Область МаршрутыМониторинга

Функция МаршрутыМониторинга()
	
	ЗаказыТЗ = Новый ТаблицаЗначений;
	КвалификаторСтроки = Новый КвалификаторыСтроки(50);	
	ЗаказыТЗ.Колонки.Добавить("ИдентификаторМаршрута", Новый ОписаниеТипов("Строка", КвалификаторСтроки));
	ЗаказыТЗ.Колонки.Добавить("ИдентификаторЗаказа", Новый ОписаниеТипов("Строка", КвалификаторСтроки));
	ЗаказыТЗ.Колонки.Добавить("НомерЗаказа", Новый ОписаниеТипов("Строка", КвалификаторСтроки));
	Возврат ЗаказыТЗ;
	
КонецФункции

Процедура ДобавитьМаршрутыМониторинга(МаршрутыМониторинга, ЗаказыЯндекс)
	
	Для Каждого Маршрут Из ЗаказыЯндекс Цикл
		Для Каждого Заказ Из Маршрут.nodes Цикл
			
			Если Заказ.type = "order" Тогда
				СтрокаЗаказа = МаршрутыМониторинга.Добавить();
				СтрокаЗаказа.ИдентификаторМаршрута = Маршрут.meta.id;
				СтрокаЗаказа.ИдентификаторЗаказа = Заказ.value.id;	
				
				ИндексПробел = СтрНайти(Заказ.value.number, " ");
				Если ИндексПробел = 0 Тогда
					СтрокаЗаказа.НомерЗаказа = Заказ.value.number;
				Иначе
					СтрокаЗаказа.НомерЗаказа = Лев(Заказ.value.number, ИндексПробел - 1);
				КонецЕсли;
			КонецЕсли;  
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаказыМониторинга

Функция ПолучитьМаршрутыЗаказыДляОтслеживания(МаршрутыМониторинга);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	ЗаказыЯндекс.ИдентификаторМаршрута,
		|	ЗаказыЯндекс.ИдентификаторЗаказа,
		|	ЗаказыЯндекс.НомерЗаказа   
		|ПОМЕСТИТЬ
		|	втЗаказыЯндекс	
		|ИЗ
		|	&ЗаказыЯндекс КАК ЗаказыЯндекс
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ                       
		|	ЗаказыНаДоставку.Ссылка КАК ЗаказНаДоставку,
		|	втЗаказыЯндекс.НомерЗаказа,
		|	втЗаказыЯндекс.ИдентификаторЗаказа,
		|	втЗаказыЯндекс.ИдентификаторМаршрута,
		|	ДоставкаЯндекс.ЗаказНаДоставку КАК ВыполненныйЗаказ     
		|ПОМЕСТИТЬ 
		|	втМаршрутыЗаказы	
		|ИЗ
		|	втЗаказыЯндекс
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказыНаДоставку
		|		ПО втЗаказыЯндекс.НомерЗаказа = ЗаказыНаДоставку.Номер
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоставкаЯндекс КАК ДоставкаЯндекс
		|		ПО ЗаказыНаДоставку.Ссылка = ДоставкаЯндекс.ЗаказНаДоставку
		|		И СтатусДоставки В (
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыДоставкиЯндекс.ЗаказДоставлен),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыДоставкиЯндекс.ЗаказОтменен))
		|;
		|// Несопоставленные заказы с номерами заказов Яндекс
		|ВЫБРАТЬ	
		|	НомерЗаказа
		|ИЗ 
		|	втМаршрутыЗаказы	                            
		|ГДЕ
		|	ЗаказНаДоставку ЕСТь NULL
		|;                                                   
		|// Маршруты для получения данных Яндекс
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИдентификаторМаршрута
		|ИЗ
		|	втМаршрутыЗаказы 	 
		|ГДЕ
		|	ЗаказНаДоставку ЕСТь НЕ NULL
//		|	И ВыполненныйЗаказ ЕСТЬ NULL   
		|;
		|// Заказы для получения данных Яндекс	(найденные в 1с и недоставленные в Яндексе)
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИдентификаторМаршрута,     
		|	ИдентификаторЗаказа,
		|	ЗаказНаДоставку,
		|	ВЫРАЗИТЬ(&ПустаяСтрока КАК Строка(200)) КАК Трекинг,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПлановоеВремяДоставки
		|ИЗ
		|	втМаршрутыЗаказы 	 
		|ГДЕ
		|	ЗаказНаДоставку ЕСТь НЕ NULL
		|	И ВыполненныйЗаказ ЕСТЬ NULL
		|;  
		|// Заказы для получения трекингов (все найденные в 1с, трекинги могут меняться вручную )
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИдентификаторМаршрута,     
		|	ИдентификаторЗаказа,
		|	ЗаказНаДоставку,
		|	ВЫРАЗИТЬ(&ПустаяСтрока КАК Строка(200)) КАК Трекинг,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПлановоеВремяДоставки
		|ИЗ
		|	втМаршрутыЗаказы
		|ГДЕ
		|	ЗаказНаДоставку ЕСТь НЕ NULL";  
	
	Запрос.УстановитьПараметр("ЗаказыЯндекс", МаршрутыМониторинга);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	НенайденныеЗаказы = ПакетЗапросов[2].Выгрузить();
	СписокНенайденныхЗаказов = "";
	Если НенайденныеЗаказы.Количество() > 0 Тогда
		Для Каждого Заказ Из НенайденныеЗаказы Цикл
			СписокНенайденныхЗаказов = СписокНенайденныхЗаказов + ?(СписокНенайденныхЗаказов <> "", ", ", "") + Заказ.НомерЗаказа; 	
		КонецЦикла;
		СписокНенайденныхЗаказов = СтрШаблон("Не определены по номерам заказы в количестве %1: ", НенайденныеЗаказы.Количество()) + СписокНенайденныхЗаказов;
	КонецЕсли; 	
	
	Возврат Новый Структура("Маршруты, Заказы, НенайденныеЗаказы, Трекинги", ПакетЗапросов[3].Выгрузить(), ПакетЗапросов[4].Выгрузить(), СписокНенайденныхЗаказов, ПакетЗапросов[5].Выгрузить());		

КонецФункции

#КонецОбласти

#Область СобытияЗаказовМониторинга

Функция СобытияЗаказов()
	
	СобытияТЗ = Новый ТаблицаЗначений;
	СобытияТЗ.Колонки.Добавить("ЗаказНаДоставку", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаДоставкуКлиенту"));
	СобытияТЗ.Колонки.Добавить("ВремяСобытия", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	СобытияТЗ.Колонки.Добавить("СтатусДоставки", Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыДоставкиЯндекс"));
	Возврат СобытияТЗ;
	
КонецФункции	

Процедура ДобавитьСобытияЗаказов(СобытияЗаказов, ЗаказыМаршрутаЯндекс, ЗаказыДляОтслеживания)
	
	Для Каждого ЗаказМаршрута Из ЗаказыМаршрутаЯндекс Цикл
		
		ОтслеживаемыйЗаказ = ЗаказыДляОтслеживания.НайтиСтроки(Новый Структура("ИдентификаторЗаказа", Формат(ЗаказМаршрута.id, "ЧГ=")));
		Если ОтслеживаемыйЗаказ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СобытиеИстории Из ЗаказМаршрута.history Цикл
		
			СтатусДоставки = ПолучитьСтатусДоставки(СобытиеИстории.event, ?(СобытиеИстории.Свойство("status"), СобытиеИстории.status, ""));
			
			Если ЗначениеЗаполнено(СтатусДоставки) Тогда
				
				ВремяЯндекса = СобытиеИстории.time; 
				ВремяСобытия = Дата(Лев(ВремяЯндекса, 4), Сред(ВремяЯндекса, 6, 2), Сред(ВремяЯндекса, 9, 2),
					Сред(ВремяЯндекса, 12, 2), Сред(ВремяЯндекса, 15, 2), Сред(ВремяЯндекса, 18, 2));
				
				СтрокаСобытия = СобытияЗаказов.Добавить();
				СтрокаСобытия.ЗаказНаДоставку = ОтслеживаемыйЗаказ[0].ЗаказНаДоставку;	
				СтрокаСобытия.ВремяСобытия = ВремяСобытия;
				СтрокаСобытия.СтатусДоставки = СтатусДоставки;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла
			
КонецПроцедуры	

Функция ПолучитьСтатусДоставки(СобытиеИстории, Статус)
	
	Если СобытиеИстории = "ORDER_CREATED" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ПереданоВДоставку;
	ИначеЕсли СобытиеИстории = "START" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ЗаказОтправленСоСклада;
	ИначеЕсли СобытиеИстории = "ORDER_BECAME_NEXT" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ПредыдущийЗаказДоставлен;
	ИначеЕсли СобытиеИстории = "ARRIVAL" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ЗаказПодъезжает;
	ИначеЕсли СобытиеИстории = "ORDER_VISIT" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ЗаказПриехал;
	ИначеЕсли СобытиеИстории = "STATUS_UPDATE" И Статус = "finished" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ЗаказДоставлен;
	ИначеЕсли СобытиеИстории = "STATUS_UPDATE" И Статус = "partially_finished" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ЗаказДоставленЧастично;
	ИначеЕсли СобытиеИстории = "STATUS_UPDATE" И Статус = "cancelled" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ЗаказОтменен;
	ИначеЕсли СобытиеИстории = "STATUS_UPDATE" И Статус = "postponed" Тогда 
		СтатусДоставки = Перечисления.СтатусыДоставкиЯндекс.ЗаказОтложен;
	Иначе		
		СтатусДоставки = Неопределено;
	КонецЕсли;
	
	Возврат СтатусДоставки;
	
КонецФункции	

Функция ЗаписатьСобытияДоставки(СобытияЗаказов)
	
	РезультатВыполнения = Новый Структура("Результат, Сообщение, КоличествоДобавлено, КоличествоНедобавлено", Истина, "", 0, 0);
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СобытияЗаказов.ЗаказНаДоставку,
			|	СобытияЗаказов.ВремяСобытия,
			|	СобытияЗаказов.СтатусДоставки
			|ПОМЕСТИТЬ
			|	втСобытияЗаказов	
			|ИЗ
			|	&СобытияЗаказов КАК СобытияЗаказов
			|;
			|ВЫБРАТЬ
			|	втСобытияЗаказов.ЗаказНаДоставку,
			|	втСобытияЗаказов.ВремяСобытия,
			|	втСобытияЗаказов.СтатусДоставки
			|ИЗ
			|	втСобытияЗаказов
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоставкаЯндекс КАК ДоставкаЯндекс
			|		ПО втСобытияЗаказов.ЗаказНаДоставку = ДоставкаЯндекс.ЗаказНаДоставку 
			|		И втСобытияЗаказов.ВремяСобытия = ДоставкаЯндекс.ВремяСобытия 
			|		И втСобытияЗаказов.СтатусДоставки = ДоставкаЯндекс.СтатусДоставки
			|ГДЕ
			|	ДоставкаЯндекс.ЗаказНаДоставку ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("СобытияЗаказов", СобытияЗаказов);
					
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Попытка
				НаборЗаписей = РегистрыСведений.ДоставкаЯндекс.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ЗаказНаДоставку.Установить(Выборка.ЗаказНаДоставку);	
				НаборЗаписей.Отбор.ВремяСобытия.Установить(Выборка.ВремяСобытия);
				НаборЗаписей.Отбор.СтатусДоставки.Установить(Выборка.СтатусДоставки);
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ЗаказНаДоставку = Выборка.ЗаказНаДоставку;				
				НоваяЗапись.ВремяСобытия = Выборка.ВремяСобытия;
				НоваяЗапись.СтатусДоставки = Выборка.СтатусДоставки;
				НаборЗаписей.Записать();
				РезультатВыполнения.КоличествоДобавлено = РезультатВыполнения.КоличествоДобавлено + 1;
			Исключение
				РезультатВыполнения.КоличествоНедобавлено = РезультатВыполнения.КоличествоНедобавлено + 1;
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + СтрШаблон("Не удалось записать %1 %2 %3: %4",
					Выборка.ЗаказНаДоставку, Выборка.ВремяСобытия, Выборка.СтатусДоставки, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;			
		КонецЦикла; 		

	Исключение
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + "Не удалось записать события доставки: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти	

#Область Трекинги

Процедура ДобавитьТрекинги(Заказ, ТрекингЯндекс)
	
	Попытка
		Заказ.Трекинг = ТрекингЯндекс.tracking_url;								
		
		Если ТрекингЯндекс.Свойство("estimated_delivery_time") И ТрекингЯндекс.estimated_delivery_time.Свойство("text") Тогда
			ПлановоеВремяДоставки = ТрекингЯндекс.estimated_delivery_time.text;
			ПлановоеВремяДоставки = Дата(Лев(ПлановоеВремяДоставки, 4), Сред(ПлановоеВремяДоставки, 6, 2), Сред(ПлановоеВремяДоставки, 9, 2),
				Сред(ПлановоеВремяДоставки, 12, 2), Сред(ПлановоеВремяДоставки, 15, 2), Сред(ПлановоеВремяДоставки, 18, 2));
			Заказ.ПлановоеВремяДоставки = ПлановоеВремяДоставки;
		КонецЕсли;
	Исключение
	КонецПопытки;		
			
КонецПроцедуры	

Функция ЗаписатьТрекинги(Заказы)
	
	РезультатВыполнения = Новый Структура("Результат, Сообщение, КоличествоДобавлено, КоличествоНедобавлено", Истина, "", 0, 0);
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ 
			|	Заказы.ЗаказНаДоставку,
			|	Заказы.Трекинг,
			|	Заказы.ПлановоеВремяДоставки
			|ПОМЕСТИТЬ
			|	втЗаказы	
			|ИЗ
			|	&Заказы КАК Заказы
			|;
			|ВЫБРАТЬ  
			|	втЗаказы.ЗаказНаДоставку,
			|	ПереданоВДоставку.ВремяСобытия,
			|	ЗНАЧЕНИЕ(Перечисление.СтатусыДоставкиЯндекс.ПолученТрекинг) КАК СтатусДоставки,
			|	втЗаказы.Трекинг,
			|	втЗаказы.ПлановоеВремяДоставки
			|ИЗ
			|	втЗаказы
			|	СОЕДИНЕНИЕ РегистрСведений.ДоставкаЯндекс КАК ПереданоВДоставку
			|		ПО втЗаказы.ЗаказНаДоставку = ПереданоВДоставку.ЗаказНаДоставку
			|		И ПереданоВДоставку.СтатусДоставки = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставкиЯндекс.ПереданоВДоставку)
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоставкаЯндекс КАК ПолученТрекинг
			|		ПО втЗаказы.ЗаказНаДоставку = ПолученТрекинг.ЗаказНаДоставку                                      
			|		И ПолученТрекинг.СтатусДоставки = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставкиЯндекс.ПолученТрекинг)
			|    	И втЗаказы.Трекинг = ПолученТрекинг.Трекинг
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоставкаЯндекс КАК ПолученоПлановоеВремя
			|		ПО втЗаказы.ЗаказНаДоставку = ПолученоПлановоеВремя.ЗаказНаДоставку                                      
			|		И ПолученоПлановоеВремя.СтатусДоставки = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставкиЯндекс.ПолученТрекинг)
			|   	И (втЗаказы.ПлановоеВремяДоставки = ПолученоПлановоеВремя.ПлановоеВремяДоставки
			|    		ИЛИ втЗаказы.ПлановоеВремяДоставки = ДатаВремя(1, 1, 1)
			|    			И ПолученоПлановоеВремя.ПлановоеВремяДоставки <> ДатаВремя(1, 1, 1))
			|ГДЕ 
			|	ПолученТрекинг.ЗаказНаДоставку ЕСТЬ NULL
			|	ИЛИ ПолученоПлановоеВремя.ЗаказНаДоставку ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("Заказы", Заказы);
					
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Попытка
				НаборЗаписей = РегистрыСведений.ДоставкаЯндекс.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ЗаказНаДоставку.Установить(Выборка.ЗаказНаДоставку);	
				НаборЗаписей.Отбор.ВремяСобытия.Установить(Выборка.ВремяСобытия);
				НаборЗаписей.Отбор.СтатусДоставки.Установить(Выборка.СтатусДоставки);
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ЗаказНаДоставку = Выборка.ЗаказНаДоставку;				
				НоваяЗапись.ВремяСобытия = Выборка.ВремяСобытия;
				НоваяЗапись.СтатусДоставки = Выборка.СтатусДоставки;
				НоваяЗапись.Трекинг = Выборка.Трекинг;
				Если (Не ЗначениеЗаполнено(НоваяЗапись.ПлановоеВремяДоставки) И ЗначениеЗаполнено(Выборка.ПлановоеВремяДоставки))  
					Или (ЗначениеЗаполнено(НоваяЗапись.ПлановоеВремяДоставки) И ЗначениеЗаполнено(Выборка.ПлановоеВремяДоставки)
						И НоваяЗапись.ПлановоеВремяДоставки <> Выборка.ПлановоеВремяДоставки) Тогда
					НоваяЗапись.ПлановоеВремяДоставки = Выборка.ПлановоеВремяДоставки;
				КонецЕсли;
				НаборЗаписей.Записать();
				РезультатВыполнения.КоличествоДобавлено = РезультатВыполнения.КоличествоДобавлено + 1;
			Исключение
				РезультатВыполнения.КоличествоНедобавлено = РезультатВыполнения.КоличествоНедобавлено + 1;
				РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + СтрШаблон("Не удалось записать %1 %2 %3: %4",
					Выборка.ЗаказНаДоставку, Выборка.ВремяСобытия, Выборка.СтатусДоставки, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;			
		КонецЦикла; 		

	Исключение
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.Сообщение = РезультатВыполнения.Сообщение + "Не удалось записать трекинги: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти		

#КонецОбласти

#Область Логи

Процедура ЗаписатьЛог(НастройкиПапкаЛогов, РезультатВыполнения)
	
	Попытка             
		ИмяПапкиЛогов = ПутьПапки(НастройкиПапкаЛогов) + "yandex\МониторингДоставки\" + Формат(РезультатВыполнения.ДатаНачала, "ДФ=ггггММдд") + "\" ; 
		ПапкаЛогов = Новый Файл(ИмяПапкиЛогов);       
		
		Если Не ПапкаЛогов.Существует() Тогда
			СоздатьКаталог(ИмяПапкиЛогов);
		КонецЕсли;                          
		
		ИмяЛога = "log_" + ПреобразоватьДатуВСтроку(РезультатВыполнения.ДатаНачала) + ".txt";
		ТекстЛогов = ПолучитьТекстЛогов(РезультатВыполнения);
		
		ФайлЛогов = Новый ЗаписьТекста(ИмяПапкиЛогов + "\" + ИмяЛога, КодировкаТекста.UTF8, , Истина);  
		ФайлЛогов.ЗаписатьСтроку(ТекстЛогов);
		ФайлЛогов.Закрыть();
	Исключение
	КонецПопытки;  
	
КонецПроцедуры          

Функция ПолучитьТекстЛогов(РезультатВыполнения)     
	
	Возврат		?(РезультатВыполнения.Результат, "УСПЕШНОЕ ВЫПОЛНЕНИЕ", "НЕ УСПЕШНОЕ ВЫПОЛНЕНИЕ") + Символы.ПС + 
//				Формат(РезультатВыполнения.ДатаНачала, "ДЛФ=ДВ") + Символы.ПС + Символы.ПС +
				РезультатВыполнения.Сообщение + Символы.ПС;
//				Формат(РезультатВыполнения.ДатаОкончания, "ДЛФ=ДВ");
	
КонецФункции 

Функция ПреобразоватьДатуВСтроку(Дата)           
	
	Возврат Формат(Дата, "ДФ=ггггММдд") + "_" + Формат(Дата, "ДФ=ЧЧммсс");
	  
КонецФункции

Функция ПутьПапки(Папки)

	Возврат Папки + ?(Прав(Папки, 1) <> "\", "\", ""); 
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#Область Служебные

Функция ПривестиКФорматуНомерТелефона(Телефон)
	
	НовыйТелефон = Телефон;
	                     
	Если НовыйТелефон <> "" Тогда
		АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НовыйТелефон);
				
		Если СтрДлина(НовыйТелефон) = 10 Тогда
			НовыйТелефон = "7" + НовыйТелефон;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовыйТелефон;
	
КонецФункции

Функция ПолучитьВременноеОкно(ВремяНачало, ВремяОкончание, ИнтервалНесколькоДней, День) Экспорт        
	
	Если Не (ИнтервалНесколькоДней И День > 0)
		И ВремяНачало > ВремяОкончание Тогда
			ВремяОкончание = КонецДня(ВремяОкончание);
	КонецЕсли;
	
	ОкноНачало = СтрЗаменить(Прав(ВремяНачало, 8), " ", 0);
	ОкноОкончание = СтрЗаменить(Прав(ВремяОкончание, 8), " ", 0);
	
	Если ИнтервалНесколькоДней И День > 0 Тогда
		Возврат "0." + ОкноНачало + "-" + День + "." + ОкноОкончание;
	Иначе      
		Возврат "" + День + "."+ ОкноНачало + "-" + День + "." + ОкноОкончание;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРейсы(МассивРейсов, ТолькоНомера = Ложь)
	
	СпикокРейсоов = "";
	
	Для Каждого Рейс Из МассивРейсов Цикл
		СпикокРейсоов = СпикокРейсоов + ?(ЗначениеЗаполнено(СпикокРейсоов), ?(ТолькоНомера, "_", Символы.ПС), "") + 
			?(ТолькоНомера, Рейс.number, Рейс.number + " " + Рейс.date);
	КонецЦикла;
	
	Возврат СпикокРейсоов;
	
КонецФункции	

Функция ПолучитьФилиал(МассивСкладов)
	
	Филиал = "";
	
	Если МассивСкладов.Количество() > 0 Тогда
		Филиал = МассивСкладов[0].name;	
	КонецЕсли;
	
	Возврат Филиал; 
	
КонецФункции	

Функция ПолучитьТекстОшибки(Ответ)
	
	Сообщение = "";
	Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("message") Тогда
		Сообщение = Ответ.message;		
	КонецЕсли;	
	
	Возврат Сообщение;
	
КонецФункции	

#КонецОбласти

