////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если Объект.Ссылка = ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя") Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры


Функция ПредопределенныйЭлемент(ПолноеИмяПредопределенного) Экспорт
	Если ВРег(Прав(ПолноеИмяПредопределенного, 13)) = ".ПУСТАЯССЫЛКА" Тогда
		// Для получения пустых ссылок используется стандартная функция платформы.
		Возврат ПредопределенноеЗначение(ПолноеИмяПредопределенного);
	КонецЕсли;
	
КонецФункции

