 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Получить как связаться
//
// Параметры:
//  Контакт				 - СправочникСсылка.Контрагенты, СправочникСсылка.КонтактныеЛица	 - ссылка на контакт
// Возвращаемое значение:
//  Строка - значение для связи с контактом.
Функция ПолучитьКакСвязаться(Контакт, ТипКИ = Неопределено) Экспорт
	
	Контакты = Новый Массив;
	Контакты.Добавить(Контакт);
	
	Если ТипКИ = Неопределено Тогда
		ТипыКИ = Новый Массив;
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ИначеЕсли ТипЗнч(ТипКИ) = Тип("Массив") Тогда
		ТипыКИ = ТипКИ;
	Иначе
		ТипыКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипКИ);
	КонецЕсли;
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Контакты, ТипыКИ,,Дата(1,1,1));
	ТаблицаКИ.Сортировать("Тип УБЫВ");
	
	Представления = ТаблицаКИ.ВыгрузитьКолонку("Представление");
	
	Возврат СтрСоединить(Представления, "; ");
	
КонецФункции

 #КонецЕсли
