#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет проверку заполнения константы "ОсновнаяСтрана"
//
Процедура ПроверитьЗаполнение() Экспорт
	
	ОсновнаяСтрана = ЗначениеНастроекКлиентСерверПовтИсп.ОсновнаяСтрана();
	Если Не ЗначениеЗаполнено(ОсновнаяСтрана) Тогда
		ВызватьИсключение НСтр("ru = 'Для продожения записи необходимо в информационной базе заполнить основную страну
		|Для настройки необходимо перейти в раздел ""НСИ и администрирование""-""Предприятие""-""Организации"".'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли