#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	ПодключитьОбработчикОжидания("ЗакрытиеФормыПоВремени", 60, Ложь);
КонецПроцедуры     

&НаКлиенте
Процедура ЗакрытиеФормыПоВремени()  
	Закрыть();
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
КонецПроцедуры

//ОПОВЕЩЕНИЕ
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОчиститьСообщения();
	ВремяПоказа= 5;
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ДанныеШтрихкодов = ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			
			СтруктураДанных= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			Штрихкод= СокрЛП(СтруктураДанных.Штрихкод);
			
			// СКАНИРОВАНИЕ ВОДИТЕЛЯ
			Если Лев(Штрихкод, 4) = "8888" Тогда//1. Водитель
				Сотрудник = РСС_УправлениеОчередьюИСборкойЗаказов.ПоискСотрудникаПоШтрихкоду(Штрихкод);
				Если ЗначениеЗаполнено(Сотрудник) Тогда
					НадписьСотрудник= Сотрудник;
					Если Не АльтерраОбщегоНазначения.ЭтоВодитель(Сотрудник) Тогда
						// ВХОД ВЫХОД СОТРУДНИКА
						РезРегистрации= ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Сотрудник);
						ПоказатьПредупреждение(, РезРегистрации, 2, "Сканирование сотрудников");
						ПодключитьОбработчикОжидания("ЗакрытиеФормыПослеСканирования", 10, Ложь);
						Возврат;
					КонецЕсли
				КонецЕсли
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область РегистрацияСотрудников

&НаСервере
Функция ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Сотрудник)
	УстановитьПривилегированныйРежим(Истина);
	Ошибка= Ложь;
	Событие= Перечисления.СостоянияСотрудников.Вышел;
	
	Результат= АльтерраОбщегоНазначения.СотрудникВОфисе(Сотрудник);
	
	ПредыдущееСостояние= Результат.Состояние;
	ПериодПредудущегоСобытия= Результат.Период;
	
	//Проверяем двойное сканирование
	Если (ПериодПредудущегоСобытия+5*1) >= ТекущаяДата() Тогда
		Ошибка= Истина;
		Событие= ПредыдущееСостояние;
		Возврат "Между последним сконированием прошло меньше 5 секунд!";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		НадписьСотрудник= Сотрудник.Наименование+", "+Сотрудник.Должность;
		
		Если Сотрудник.Уволен Или Сотрудник.ПометкаУдаления Тогда
			Возврат "Сотрудник уволен!";
		Иначе
			НаборЗаписей= РегистрыСведений.УчетРабочегоВремениСотрудников.СоздатьНаборЗаписей();
			НоваяЗапись= НаборЗаписей.Добавить();
			НоваяЗапись.Период= ТекущаяДата();
			НоваяЗапись.Сотрудник= Сотрудник;
			НоваяЗапись.Пользователь= Сотрудник.Пользователь;
			НоваяЗапись.Подразделение= ?(ЗначениеЗаполнено(Сотрудник.Подразделение), Сотрудник.Подразделение, Сотрудник.Пользователь.ТекущееПодразделение);
			
			//Если последнее событие было вчера или позднее тогда всегда зашел
			Если НачалоДня(ПериодПредудущегоСобытия) < НачалоДня(ТекущаяДата()) Тогда
				НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
			Иначе
				// Общая проверка
				Если  ПредыдущееСостояние = Перечисления.СостоянияСотрудников.Вышел Тогда//Вышел или ещё не было
					НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
				Иначе
					НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Вышел;
				КонецЕсли;
			КонецЕсли;
			Событие= НоваяЗапись.Событие;
			
			НаборЗаписей.Записать(Ложь);
			Возврат "Сотрудник "+НоваяЗапись.Событие;
		КонецЕсли;
	Иначе 
		Ошибка= Истина;
		Возврат "Сотрудник не найден!";
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

&НаКлиенте
Процедура ЗакрытиеФормыПослеСканирования() Экспорт
 Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура Меню(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

