#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перенести(Команда)
	ЗагрузитьНаСервере();
	Закрыть(ТЗ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	НомерКолонки = 0;
	Пока Истина Цикл				
		НомерКолонки = НомерКолонки + 1;				
		ИмяКолонки = ТабличныйДокумент.Область(1, НомерКолонки).Текст;				
		Если ПустаяСтрока(ИмяКолонки) Тогда				
			Прервать;				
		КонецЕсли;        			
		ТаблицаДанных.Колонки.Добавить(ИмяКолонки);				
	КонецЦикла;
	    
    СчетчикКолонок = НомерКолонки + 1;
    
    НомерСтроки = 1; ФлагПрерывания = Ложь;
    Пока Истина Цикл
        НомерСтроки = НомерСтроки + 1;
        Стр = ТаблицаДанных.Добавить();
		
		Индекс = 0;
		Для А = 1 ПО СчетчикКолонок Цикл
            ТекстКолонки = ТабличныйДокумент.Область(НомерСтроки, А).Текст;
            Если ПустаяСтрока(ТекстКолонки) Тогда
				Если А = 1 ИЛИ А = 2 ИЛИ А = 3 Тогда
					Индекс = Индекс + 1;
                КонецЕсли;
            Иначе
                Стр[А - 1] = ТекстКолонки
            КонецЕсли;
			
			Если Индекс = 3 Тогда
				Флагпрерывания = Истина;
                ТаблицаДанных.Удалить(Стр);
			КонецЕсли;
			
            Если Флагпрерывания Тогда
                Прервать
            КонецЕсли;
        КонецЦикла;
        
        Если Флагпрерывания Тогда
            Прервать
        КонецЕсли;
	КонецЦикла;
	
	Если ИмяТаблицы = "Товары" Тогда
		
		Для каждого Строка из ТаблицаДанных Цикл
			
			СтруктураСтроки = Новый Структура();
			СтруктураСтроки.Вставить("Номенклатура",);
			СтруктураСтроки.Вставить("Подразделение",);
			
			Если ЗначениеЗаполнено(Строка.Код) Тогда
				СтруктураСтроки.Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Строка.Код);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтруктураСтроки.Номенклатура) И ЗначениеЗаполнено(Строка.Наименование) Тогда 
				СтруктураСтроки.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Строка.Наименование);
			КонецЕсли;
				
			Если ЗначениеЗаполнено(Строка.Подразделение) Тогда
				СтруктураСтроки.Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию(Строка.Подразделение);
			КонецЕсли;
						
			НоваяСтрока = ТЗ.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки);
			
		КонецЦикла;
		
	ИначеЕсли ИмяТаблицы = "ТоварыАкции" Тогда
		
		Для каждого Строка из ТаблицаДанных Цикл
			
			СтруктураСтроки = Новый Структура();
			СтруктураСтроки.Вставить("ВидНоменклатуры",);
			СтруктураСтроки.Вставить("ГруппаНоменклатуры",);
			СтруктураСтроки.Вставить("Номенклатура",);
			СтруктураСтроки.Вставить("Процент",);
			СтруктураСтроки.Вставить("ВидЦены",);
			
			Если ЗначениеЗаполнено(Строка.ВидНоменклатуры) Тогда
				СтруктураСтроки.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(Строка.ВидНоменклатуры);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.ГруппаНоменклатуры) Тогда
				СтруктураСтроки.ГруппаНоменклатуры = Справочники.Номенклатура.НайтиПоНаименованию(Строка.ГруппаНоменклатуры);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				СтруктураСтроки.Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Строка.Номенклатура);
				Если Не ЗначениеЗаполнено(СтруктураСтроки.Номенклатура) Тогда 
					СтруктураСтроки.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Строка.Номенклатура);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.Процент) Тогда
				СтруктураСтроки.Процент = Число(Строка.Процент);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.ВидЦены) Тогда
				СтруктураСтроки.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(Строка.ВидЦены);
			КонецЕсли;
			
			НоваяСтрока = ТЗ.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки);
			
		КонецЦикла;
		
	ИначеЕсли ИмяТаблицы = "ПартнерыАкции" Тогда
		
		Для каждого Строка из ТаблицаДанных Цикл
			
			СтруктураСтроки = Новый Структура();
			СтруктураСтроки.Вставить("СегментПартнеров",);
			СтруктураСтроки.Вставить("Партнер",);
			СтруктураСтроки.Вставить("Свойство",);
			СтруктураСтроки.Вставить("Значение",);
			
			Если ЗначениеЗаполнено(Строка.СегментПартнеров) Тогда
				СтруктураСтроки.СегментПартнеров = Справочники.СегментыПартнеров.НайтиПоНаименованию(Строка.СегментПартнеров);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.Партнер) Тогда
				СтруктураСтроки.Партнер = Справочники.Партнеры.НайтиПоНаименованию(Строка.Партнер);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.Свойство) И ЗначениеЗаполнено(Строка.Значение) Тогда
				СтруктураСтроки.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(Строка.Свойство);
				Если ЗначениеЗаполнено(СтруктураСтроки.Свойство) Тогда 
					СтруктураСтроки.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Строка.Значение);
				КонецЕсли;
			КонецЕсли;
						
			НоваяСтрока = ТЗ.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки);
			
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Колонки") Тогда
		 МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметры.Колонки, ",");
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяТаблицы") Тогда
		 ИмяТаблицы = Параметры.ИмяТаблицы;
	КонецЕсли;
	
	НомерКолонки = 0;
	Для каждого ЗначениеМассива из МассивКолонок Цикл
		НомерКолонки = НомерКолонки + 1;
		ТабличныйДокумент.Область(1, НомерКолонки).Текст = ЗначениеМассива;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
