&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЗаказовНаВнутреннееПотребление.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
//АСИНХ Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПредыдущиеДанные = ПолучитьПоказательПредыдущегоПробега();
	
	Если ЗначениеЗаполнено(ПредыдущиеДанные.ПоказанияПробега)
		И ПредыдущиеДанные.ПоказанияПробега > Объект.ПоказанияПробега
		И ПредыдущиеДанные.ДатаЗаписи < Объект.ДатаВыходаИзСтроя
	Тогда
		Отказ = Истина;
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить("Отмена");
		Кнопки.Добавить("Пробег сброшен");
		
		Заголовок1 = "Текущие показания пробега меньше введенных ранее";
		ТекстСообщения1 = "Нажмите ""Отмена"" чтобы установить корректную Дату выхода из строя или ввести новые показания пробега."
						+ Символы.ПС + Символы.ПС + "Если пробег был сброшен, то нажмите ""Пробег сброшен""";
		
		//РезультатВопроса1 = Ждать ВопросАсинх(ТекстСообщения1, Кнопки,,,Заголовок1);
		РезультатВопроса1 = Вопрос(ТекстСообщения1, Кнопки,,,Заголовок1);
		ОчиститьСообщения();
		
		Если РезультатВопроса1 = "Пробег сброшен" Тогда
			
			ИтоговыйПробег = ПредыдущиеДанные.Пробег + Объект.ПоказанияПробега;
			ТекстСообщения2 = "Последний зафиксированный пробег составляет " + ПредыдущиеДанные.Пробег 
							+ ". После сброса общий пробег будет равен " + ИтоговыйПробег
							+ "." + Символы.ПС + Символы.ПС + "Подтверждаете сброс пробега?";
			
			//РезультатВопроса2 = Ждать ВопросАсинх(ТекстСообщения2, РежимДиалогаВопрос.ДаНет);
			РезультатВопроса2 = Вопрос(ТекстСообщения2, РежимДиалогаВопрос.ДаНет);
			ОчиститьСообщения();
			
			Если РезультатВопроса2 = КодВозвратаДиалога.Да Тогда
				Отказ = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьПоказательПредыдущегоПробега()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПараметрыТехникиСрезПоследних.Период КАК ДатаЗаписи,
		|	ПараметрыТехникиСрезПоследних.ПоказанияПробега КАК ПоказанияПробега,
		|	ПараметрыТехникиСрезПоследних.Пробег КАК Пробег
		|ИЗ
		|	РегистрСведений.ПараметрыТехники.СрезПоследних(&КонецПериода, Техника = &Техника) КАК ПараметрыТехникиСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоказанияПробега УБЫВ";
	
	КонецПериода = Объект.ДатаВыходаИзСтроя + (Объект.Дата - НачалоДня(Объект.Дата) - 1);
	Запрос.УстановитьПараметр("Техника", Объект.Техника);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура("ДатаЗаписи, ПоказанияПробега, Пробег");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗавершенПриИзменении(Элемент)
	Если Объект.Завершен Тогда
		Объект.ДатаВведенияВРаботу = ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаВнутреннееПотребление(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = "Данные еще не записаны.
		|Выполнение действия ""Создать заявку"" возможно только после записи данных.";
		
		ПоказатьПредупреждение( , ТекстВопроса);
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОснование", Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаказНаВнутреннееПотребление.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ВидыТехники(Техника)
	
	возврат Техника.ВидНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ВидРаботИТехническогоОбслуживанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=ложь;
	СтруктураПараметров=Новый Структура();
	СтруктураПараметров.Вставить("ВидТехники",ВидыТехники(Объект.Техника));
	Оповещение=Новый ОписаниеОповещения("ВыборВидРаботИТехническогоОбслуживанияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыРаботИТехническогоОбслуживания.Форма.Док_ФормаВыбора",СтруктураПараметров,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидРаботИТехническогоОбслуживанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	если Результат<>НЕОПРЕДЕЛЕНО тогда
		Объект.ВидРаботИТехническогоОбслуживания=Результат;
	конецесли;	
КонецПроцедуры