
&НаСервере
Процедура СоздатьНовыйДокумент(ИмяДокумента, НовыйОбъект)
	Документы[ИмяДокумента].ЗаполнитьДанныеПоОснованию(Объект.Ссылка, НовыйОбъект);
КонецПроцедуры

&НаКлиенте
Процедура В_ВводНаОснованииУстановкаЦенНоменклатуры(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Заявка на доставку");
		
		ПоказатьПредупреждение(,ТекстВопроса);
		возврат;	
	КонецЕсли;
	
	Док= СоздатьУстановкуЦенСервер();
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта", Новый Структура("Ключ",Док)); 
КонецПроцедуры

&НаСервере
Функция СоздатьУстановкуЦенСервер()
	
	НовыйДокумент= Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	НовыйДокумент.Дата= ТекущаяДата();
	НовыйДокумент.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
	НовыйДокумент.Согласован= Истина;
	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	
	ВидЦены= Объект.СкладПолучатель.Подразделение.ЦенаЗакупа;
	
	НовыйДокумент.ДокументОснование= Объект.Ссылка;
	
	НоваяСтрка= НовыйДокумент.ВидыЦен.Добавить();
	НоваяСтрка.ВидЦены= ВидЦены;
	
	Запрос= Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	              |	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	              |	ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
	              |	&ВидЦены КАК ВидЦены,
	              |	СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.ДопРасходыОстаток КАК Цена
	              |ИЗ
	              |	РегистрНакопления.СебестоимостьТоваров.Остатки КАК СебестоимостьТоваровОстатки
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиНоменклатуры
	              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	              |			ПО (ПеремещениеТоваровТовары.Номенклатура = КлючиНоменклатуры.Номенклатура)
	              |				И (ПеремещениеТоваровТовары.Характеристика = КлючиНоменклатуры.Характеристика)
	              |				И (ПеремещениеТоваровТовары.Ссылка.СкладПолучатель = КлючиНоменклатуры.Склад)
	              |		ПО СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры = КлючиНоменклатуры.Ссылка
	              |ГДЕ
	              |	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	РезультатЗапроса= Запрос.Выполнить();
	
	НовыйДокумент.Товары.Загрузить(РезультатЗапроса.Выгрузить());
	
	НовыйДокумент.Записать();
	
	Возврат НовыйДокумент.Ссылка;
КонецФункции


Процедура ЗаполнитьПоПередачеПеремещениюТоваров(ДанныеФормы)
	ДанныеФормы.ДокументОснование= Объект.Ссылка;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура КАК Номенклатура,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Характеристика КАК Характеристика,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Упаковка КАК Упаковка,
	|	0 КАК Цена,
	|	ВидыЦен.Ссылка КАК ВидЦены
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО ПередачаТоваровМеждуОрганизациямиТовары.ВидЦены = ВидыЦен.Ссылка
	|			И (ИСТИНА = ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании)
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ПеремещениеТоваровТовары.Упаковка,
	|	0,
	|	ВидыЦен.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО (ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании = ИСТИНА)
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка", ДанныеФормы.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не требуется вводить установку цен номенклатуры на основании документа %1'"),
			ДанныеФормы.ДокументОснование
		);
		ВызватьИсключение Текст;
	Иначе
		
		ДанныеФормы.Товары.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииЗаказНаДоставкуОтПоставщика(Команда)
			ИмяДокумента= "ЗаказНаДоставкуОтПоставщика";
	ФормаДок = ПолучитьФорму("Документ."+ИмяДокумента+".ФормаОбъекта");
	
	//Далее мы получаем объект только, что созданной формы и помещаем её в переменную
	//В объекте содержатся все реквизиты (элементы) формы
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Заявка на доставку");
		
		ПоказатьПредупреждение(,ТекстВопроса);
		возврат;	
	КонецЕсли;
	
	//Мы помещаем объект формы в переменную,
	//так как должны передать её в процедуру на сервере,
	//где нельзя изменять объект формы, зато можно править переменную содержащую его
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	
	//После выполнения процедуры на сервере мы получаем изменную переменную ДанныеФормы,
	//которую необходимо передать в уже созданную нами форму
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	
	//Открываем результат выполнения обработки
	ФормаДок.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииПропуск(Команда)
	
	ИмяДокумента = "Пропуск";
	ФормаДок = ПолучитьФорму("Документ." +  ИмяДокумента + ".ФормаОбъекта");
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Реализация товаров и услуг");
		
		ПоказатьПредупреждение( , ТекстВопроса);
		Возврат;	
	КонецЕсли;
	
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	ФормаДок.Открыть();	
	
КонецПроцедуры


&НаКлиенте
Процедура Док_ПодтвердитьПриемПодточета(Команда)
	
	ПодотчЛ = ИщемПодотчетноеЛицо(Объект.СкладПолучатель);
	Если ПодотчЛ <> "СсылкаПустая" и ПодотчЛ = ТекПользователь() Тогда
		Объект.ПодтвержденПодотчетником = Истина;
		Объект.Статус=ПредопределенноеЗначение("Перечисление.СтатусыПеремещенийТоваров.Принято");
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подтвердить прием подотчета может только подотчетное лицо");
	КонецЕсли;			 
	ВидимостьПодтверждения();
КонецПроцедуры

&НаСервере
Функция ТекПользователь()
	Возврат АльтерраОбщегоНазначения.ТекущийПользователь();
КонецФункции 

&НаКлиенте
Процедура Док_СкладПолучательПриИзмененииПосле(Элемент)
	
	Объект.ПодтвержденПодотчетником = Ложь;
	ВидимостьПодтверждения();
	ПроверкаСтатусаПринято();
	
	УстановкаСтатусаПоСкладуПолучателю(Объект.СкладПолучатель);
	
	УведомленияПодрядчику_ИнициализацияЗначений();
	
КонецПроцедуры

&НаСервере
Функция ИщемПодотчетноеЛицо(Склад_Получатель)
	СсылкаПодотчет = Склад_Получатель.ПолучитьОбъект().Подотчетник;
	Если  СсылкаПодотчет <> Справочники.Пользователи.ПустаяСсылка() Тогда
		Возврат  СсылкаПодотчет;
	иначе
		Возврат "СсылкаПустая";
	конецесли	
КонецФункции 

&НаКлиенте
Процедура ВидимостьПодтверждения()
	Если ЗначениеЗаполнено(Объект.СкладПолучатель) и Объект.ПодтвержденПодотчетником = Ложь Тогда
		ПодотчЛ = ИщемПодотчетноеЛицо(Объект.СкладПолучатель);
		Если ПодотчЛ <> "СсылкаПустая" и ПодотчЛ = ТекПользователь() Тогда
			ЭтаФорма.Элементы.ПодтвердитьПриемПодточета.Видимость = Истина;
		Иначе
			ЭтаФорма.Элементы.ПодтвердитьПриемПодточета.Видимость = Ложь;
		конецесли;	
	иначе ЭтаФорма.Элементы.ПодтвердитьПриемПодточета.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура Док_ПриОткрытииПеред(Отказ)
	ВидимостьПодтверждения();
	ДоступностьОтправкиМ15();
КонецПроцедуры

&После("ПередЗаписью")
&НаКлиенте
Процедура Док_ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СписокЗаказов.Количество() > 1 Тогда
		ЗаполнитьОтсутствующиеЗаказыНаПеремещениеВТоварах();
	КонецЕсли;
	
	Если элементы.УведомленияПодрядчику.Видимость = Истина тогда  
		БлокировкаТаблицыТовары = Истина;
    	Элементы.Товары.Доступность = Ложь;
		Элементы.БлокировкаТаблицыТовары.Доступность = Истина; 	
	КонецЕсли; 
	ДоступностьОтправкиМ15();	

КонецПроцедуры

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура Док_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Отказ И
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И
		ТекущийОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято Тогда         
		
		ДопМодуль.ИнформированиеВБитриксОПоступленииНаСкладМОЛТМЦ(ТекущийОбъект.Ссылка, ТекущийОбъект.Товары, ТекущийОбъект.СкладПолучатель, ТекущийОбъект.Ответственный);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
	
&НаСервере                 
Процедура ЗаполнитьОтсутствующиеЗаказыНаПеремещениеВТоварах()	
	
	ПустаяСсылка = Документы.ЗаказНаПеремещение.ПустаяСсылка();
	
	Товары = Объект.Товары.Выгрузить();
	Отбор = Новый Структура("ЗаказНаПеремещение", ПустаяСсылка);
	СтрокиСПустымиЗаказами = Товары.НайтиСтроки(Отбор);
	Если СтрокиСПустымиЗаказами.Количество() > 0 Тогда          
		Для Каждого Строка Из СтрокиСПустымиЗаказами Цикл
			Отбор = Новый Структура("Номенклатура", Строка.Номенклатура);
			НайденныеСтроки = Товары.НайтиСтроки(Отбор);
			Для Каждого СтрокаТовары Из НайденныеСтроки Цикл
				Если Строка.ЗаказНаПеремещение = ПустаяСсылка И СтрокаТовары.ЗаказНаПеремещение <> ПустаяСсылка Тогда
					Строка.ЗаказНаПеремещение = СтрокаТовары.ЗаказНаПеремещение;	 
				КонецЕсли;	                     
			КонецЦикла;
			Если Строка.ЗаказНаПеремещение = ПустаяСсылка Тогда
				Строка.ЗаказНаПеремещение = СписокЗаказов.Получить(0).Значение;
			КонецЕсли;		
		КонецЦикла;
		Объект.Товары.Загрузить(Товары);
	КонецЕсли;	

КонецПроцедуры	
	
&НаКлиенте
Процедура Док_СтатусПриИзмененииПосле(Элемент)
	ПроверкаСтатусаПринято();
КонецПроцедуры

&НаСервере

Функция СтатусПринят()

	Возврат Перечисления.СтатусыПеремещенийТоваров.Принято;

КонецФункции 

Функция СтатусОтгружен()

	Возврат Перечисления.СтатусыПеремещенийТоваров.Отгружено;

КонецФункции 

Процедура ПроверкаСтатусаПринято()
Если Объект.Статус = СтатусПринят() Тогда
	  Если ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда
	    ПодотчЛ = ИщемПодотчетноеЛицо(Объект.СкладПолучатель);
		Если ПодотчЛ <> "СсылкаПустая" и Объект.ПодтвержденПодотчетником = Ложь тогда 
			  ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для установки статуса ""Принято"" нужно подтвердить согласие подотчетного лица на вкладке Дополнительно.");
			  Объект.Статус = СтатусОтгружен();
		КонецЕсли;
	  КонецЕсли; 
КонецЕсли; 
КонецПроцедуры
 
&НаКлиенте
Процедура Док_ПодобратьТоварыПеред(Команда)
	СФП_МаркерыКлиент.МаркерНачало("Перемещение открытие подбора товаров (из формы)", Объект.Номер);
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПоместитьТабличнуюЧастьТоварыВоВременноеХранилищеДляПроверкиКоличества")
Функция Док_ПоместитьТабличнуюЧастьТоварыВоВременноеХранилищеДляПроверкиКоличества1()
	
	#Удаление
	ТабличнаяЧастьТовары = Объект.Товары.Выгрузить(,"НоменклатураНабора, ХарактеристикаНабора,Номенклатура, Характеристика, ХарактеристикиИспользуются, Упаковка, КоличествоУпаковок, Серия, СтатусУказанияСерий, ТипНоменклатуры");
	#КонецУдаления
	#Вставка
	ТабличнаяЧастьТовары = Объект.Товары.Выгрузить(,"НоменклатураНабора, ХарактеристикаНабора,Номенклатура, Характеристика, ХарактеристикиИспользуются, Назначение, Упаковка, КоличествоУпаковок, Серия, СтатусУказанияСерий, ТипНоменклатуры, ЗаказНаПеремещение");
	#КонецВставки
	
	#Удаление
	ТабличнаяЧастьТовары.Свернуть("НоменклатураНабора, ХарактеристикаНабора,Номенклатура, Характеристика, ХарактеристикиИспользуются, Упаковка, Серия, СтатусУказанияСерий, ТипНоменклатуры", "КоличествоУпаковок");
	#КонецУдаления
	#Вставка
	ТабличнаяЧастьТовары.Сортировать("Номенклатура Возр",);
	#КонецВставки
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТабличнаяЧастьТовары, УникальныйИдентификатор);
	Возврат АдресВоВременномХранилище;

КонецФункции

&НаКлиенте
Процедура Док__ОформлениеПоступленийРасхождений(Команда)
	Оповещение = Новый ОписаниеОповещения("ОформлениеПоступленийРасхожденийЗавершение",ЭтотОбъект); 
	ПараметрыП = Новый Структура("Документ",Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.Док_ОформлениеРасхождений",ПараметрыП,ЭтаФорма,,,,Оповещение,);
КонецПроцедуры

&НаСервере
Процедура ОформлениеПоступленийРасхожденийЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("ДанныеФормыКоллекция") Тогда 
		Объект.Товары.Очистить();
		Объект.Товары.Загрузить(Результат.Выгрузить());
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
  Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
      Объект.ПодтвержденПодотчетником = Ложь
  КонецЕсли;
  ВидимостьКнопкиЗаполненияОстатками(Объект.СкладОтправитель);
  
  Если Параметры.Ключ.Пустая() Тогда
	  УстановкаСтатусаПоСкладуПолучателю(Объект.СкладПолучатель);
  КонецЕсли;

  УстановитьДоступностьПоОтметкеКассы();
  
  ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
  
  ДобавитьКолонкиНаСервере();
  
  ПолеКомментарийДляСклада = Элементы.Вставить("КомментарийДляСклада", Тип("ПолеФормы"), Элементы.СтраницаОсновное, Элементы.Комментарий);
  ПолеКомментарийДляСклада.Вид = ВидПоляФормы.ПолеВвода;
  ПолеКомментарийДляСклада.ПутьКДанным = "Объект.КомментарийДляСклада";
  ПолеКомментарийДляСклада.Заголовок = "Комментарий для склада";
  
  Элементы.ИсключитьИзКонтроля.Доступность= РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");
  
  Если Параметры.Ключ.Пустая() Тогда
	  ТекущийЭтап = Неопределено;
	  ДатаНачалаТекущегоЭтапа = '00010101';
	  ДатаОкончанияТекущегоЭтапа = '00010101';
  КонецЕсли;
  
  ОбновитьВидимостьПанелиЭтапов();
  
  Если Элементы.ТоварПоступил.Видимость Тогда
	  Элементы.ТоварПоступил.Доступность = Не ЭтаФорма.ТолькоПросмотр;
  КонецЕсли;
  Если Элементы.ТоварРазложен.Видимость Тогда
	  Элементы.ТоварПринят.Доступность = Не ЭтаФорма.ТолькоПросмотр;
  КонецЕсли;
  Если Элементы.ТоварРазложен.Видимость Тогда
	  Элементы.ТоварРазложен.Доступность = Не ЭтаФорма.ТолькоПросмотр;
  КонецЕсли;
  
  Элементы.ГруппаПеремещениеОснование.Видимость = ЗначениеЗаполнено(Объект.Основание);
    
  УведомленияПодрядчику_ИнициализацияЗначений();
  Элементы.ДатаПринятия.Доступность = РольДоступна("ПолныеПрава");
  
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиНаСервере()
   нРеквизиты = Новый Массив;
   нРеквизиты.Добавить(Новый РеквизитФормы("Кладовщик_", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), "Объект.Товары", "Кладовщик_", Истина));
   нРеквизиты.Добавить(Новый РеквизитФормы("КладовщикПриемки_", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), "Объект.Товары", "КладовщикПриемки_", Истина));
   ИзменитьРеквизиты(нРеквизиты);
 
   нЭлемент = Элементы.Добавить("Кладовщик_", Тип("ПолеФормы"), Элементы.Товары); 
   нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
   нЭлемент.ПутьКДанным = "Объект.Товары.Кладовщик"; 
   
   нЭлемент = Элементы.Добавить("КладовщикПриемки_", Тип("ПолеФормы"), Элементы.Товары); 
   нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
   нЭлемент.ПутьКДанным = "Объект.Товары.КладовщикПриемки";
КонецПроцедуры

#Область ЗаполнениеОстаткамиНаСкладе
&НаКлиенте
Процедура Док_ЗаполнитьОстаткамиНаСкладеПосле(Команда)
	Если не ЭтоТорговыйСклад(Объект.СкладОтправитель) Тогда
		ЗаполнитьОстаткамиПоСкладу(Объект.СкладОтправитель);
	Конецесли 
КонецПроцедуры

Функция ЭтоТорговыйСклад(ТекСклад)
 Возврат ТекСклад.СкладПродажи
КонецФункции 

&НаКлиенте
Процедура Док_СкладОтправительПриИзмененииПосле(Элемент)
	ВидимостьКнопкиЗаполненияОстатками(Объект.СкладОтправитель);
КонецПроцедуры

&НаСервере
Процедура ВидимостьКнопкиЗаполненияОстатками(Склад) 
  Если не Склад.Пустая() Тогда
    Элементы.ЗаполнитьОстатками.Доступность =  не ЭтоТорговыйСклад(Склад)
  Иначе
    Элементы.ЗаполнитьОстатками.Доступность = Ложь
  Конецесли	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиПоСкладу(Склад) Экспорт  
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|	ЗапасыИПотребностиОстатки.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК Количество,
	|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки(
	|			,
	|			Склад = &Склад
	|				И Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ЗапасыИПотребностиОстатки
	|ГДЕ
	|	ЗапасыИПотребностиОстатки.ВНаличииОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыИПотребностиОстатки.Номенклатура,
	|	ЗапасыИПотребностиОстатки.Характеристика,
	|	ЗапасыИПотребностиОстатки.Номенклатура.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗапасыИПотребностиОстатки.Номенклатура.Наименование"
	);  
		
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю ("На данном складе нет доступных остатков");
	Иначе
		Объект.Товары.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

&НаСервере
Функция ПолучитьПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
конецфункции	

&НаКлиенте                              
Процедура ОтметкаКассы(Команда)
	
	Пользователь = ПолучитьПользователя();
	ДопМодульКлиент.УстановитьОтметкуКассы(ЭтаФорма, Пользователь);
	УстановитьДоступностьПоОтметкеКассы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоОтметкеКассы()
	ДопМодуль.УстановитьДоступностьПоОтметкеКассыОбщий(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыПеремещенийТоваров.Принято") И Объект.Кассир.Пустая() И Объект.ПеремещениеНаФилиал Тогда
		СтандартнаяОбработка = Ложь;
		Сообщить("Не установлена отметка кассы!");
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура СброситьПоСекции(Команда)
	МассивВыдСтрок=Элементы.Товары.ВыделенныеСтроки;
	если МассивВыдСтрок.Количество()<>0 тогда
		Для Каждого ТекСтрока Из МассивВыдСтрок Цикл
			СтрокаКоллекции=Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
			СтрокаКоллекции.Кладовщик="";
		конеццикла;
	конецесли;	
КонецПроцедуры

&НаСервере
Процедура СКПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьПоОтметкеКассы();
КонецПроцедуры

&НаКлиенте
Процедура СКТоварыПередУдалением(Элемент, Отказ)
		если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;	

КонецПроцедуры
&НаКлиенте
Процедура СКТоварыПередНачаломИзменения(Элемент, Отказ)
		если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;	

КонецПроцедуры

&После("УстановитьУсловноеОформление")
Процедура Спр_УстановитьУсловноеОформление()
	АльтерраОбщегоНазначения.УстановитьОформлениеЗеленениеСтрокТабличныхЧастей(ЭтаФорма,"Товары");
КонецПроцедуры

&НаКлиенте
Процедура Док__ПодобратьТоварыПоОрдерамПосле(Команда)
	
	РеквизитыШапки = Новый Структура("Организация, ОрганизацияПолучатель, СкладОтправитель, СкладПолучатель, Подразделение, ХозяйственнаяОперация, Ссылка");
	ЗаполнитьЗначенияСвойств(РеквизитыШапки, Объект);
	ДополнительныеПоля = Новый Структура("ДатаОтгрузки, Сделка");
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РеквизитыШапки",                           РеквизитыШапки);
	ПараметрыФормы.Вставить("Заказ",                                    Объект.ЗаказНаПеремещение);
	ПараметрыФормы.Вставить("ОрдернаяСхемаПриОтгрузке",                 ОрдернаяСхемаПриОтгрузке);
	ПараметрыФормы.Вставить("НакладнаяПоЗаказам",                       Объект.ПеремещениеПоЗаказам
																		И ЗначениеЗаполнено(Объект.ЗаказНаПеремещение));
	ПараметрыФормы.Вставить("АдресТовары",                              АдресТоварыНакладной());
	ПараметрыФормы.Вставить("Накладная",                                Объект.Ссылка);
	ПараметрыФормы.Вставить("ИспользоватьНакладныеПоНесколькимЗаказам", ИспользоватьПеремещениеПоНесколькимЗаказам);
	ПараметрыФормы.Вставить("ИспользуютсяЗаказы",                       ИспользоватьЗаказыНаПеремещение);
	ПараметрыФормы.Вставить("ДополнительныеПоля",                       ДополнительныеПоля);
	
	ОткрытьФорму("ОбщаяФорма.ПодборТоваровПоОрдерам",
		ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_Альтерра(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура();
	ПараметрыФормы.Вставить("НастройкиТаблицы",СтруктураТаблицы());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция СтруктураТаблицы()
	
	СтруктураТаблицы=Новый Структура();
	
	СтруктураТаблицы.Вставить("Код","строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура","СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Характеристика","строка#Характеристика#20");
	СтруктураТаблицы.Вставить("КоличествоУпаковок","число#Количество#15");

	возврат  СтруктураТаблицы;
КонецФункции 

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)
	
	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		
		Если ТаблицаДанных<>Неопределено Тогда
			Объект.Товары.Загрузить(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, Неопределено);

КонецПроцедуры

&НаСервере
Процедура УстановкаСтатусаПоСкладуПолучателю(Склад) 
	
	ОрдернаяСхемаПриПриемке = СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(Объект.СкладПолучатель, Объект.Дата);
	
	Если ОрдернаяСхемаПриПриемке И Не (Объект.Статус=Перечисления.СтатусыПеремещенийТоваров.Принято) Тогда
		 Объект.Статус=Перечисления.СтатусыПеремещенийТоваров.Принято;
	КонецЕсли;
	
КонецПроцедуры

#Область ЭтапыПеремещения

&НаСервере
Процедура ОбновитьВидимостьПанелиЭтапов()
	Если Не Параметры.Ключ.Пустая() Тогда
		ДанныеПоТекущемуЭтапу = ПолучитьТекущийЭтапПеремещения();
		ЭтапыЗаполнялись = ДанныеПоТекущемуЭтапу<>Неопределено;
		ТоварМожноРазложить = Истина;
		Если ЭтапыЗаполнялись Тогда
			ТекущийЭтап = ДанныеПоТекущемуЭтапу.Этап;
			ДатаНачалаТекущегоЭтапа  = ДанныеПоТекущемуЭтапу.НачалоЭтапа;
			ДатаОкончанияТекущегоЭтапа = ДанныеПоТекущемуЭтапу.ОкончаниеЭтапа;
			ТоварМожноРазложить = ТекущийЭтап<>Перечисления.ЭтапыПеремещения.Раскладка И ДанныеПоТекущемуЭтапу.ОкончаниеЭтапа<>'00010101'; 
		КонецЕсли;
	КонецЕсли;
	Элементы.ТоварПринят.Видимость = ТекущийЭтап = Перечисления.ЭтапыПеремещения.Приемка И ДатаОкончанияТекущегоЭтапа='00010101';
	Элементы.ТоварРазложен.Видимость = ТекущийЭтап = Перечисления.ЭтапыПеремещения.Раскладка И ДатаОкончанияТекущегоЭтапа='00010101';
	Если Элементы.ТоварПринят.Видимость ИЛИ Элементы.ТоварРазложен.Видимость Тогда
		Элементы.ТоварПоступил.Видимость = Ложь;
	Иначе
		Элементы.ТоварПоступил.Видимость = Параметры.Ключ.Пустая() ИЛИ ТекущийЭтап = Перечисления.ЭтапыПеремещения.Поступление И ДатаОкончанияТекущегоЭтапа='00010101';
	КонецЕсли;
КонецПроцедуры 

//Обращается к регистру этапов перемещения
// Возвращаемое значение:
//  Структура, неопределено   - либо возвращает последний этап вместе со временем изменения (Этап, Время), 
//	либо неопределено, если никаких записей в регистре по документу не найдено.
&НаСервере
Функция ПолучитьТекущийЭтапПеремещения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПеремещениеТоваровПоЭтапам.НачалоЭтапа) КАК Время,
	|	ПеремещениеТоваровПоЭтапам.ЭтапПеремещения КАК ЭтапПеремещения,
	|	ПеремещениеТоваровПоЭтапам.ОкончаниеЭтапа КАК ОкончаниеЭтапа,
	|	ПеремещениеТоваровПоЭтапам.НачалоЭтапа КАК НачалоЭтапа
	|ПОМЕСТИТЬ втЭтапыДокумента
	|ИЗ
	|	РегистрСведений.ПеремещениеТоваровПоЭтапам КАК ПеремещениеТоваровПоЭтапам
	|ГДЕ
	|	ПеремещениеТоваровПоЭтапам.Документ = &Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровПоЭтапам.ЭтапПеремещения,
	|	ПеремещениеТоваровПоЭтапам.ОкончаниеЭтапа,
	|	ПеремещениеТоваровПоЭтапам.НачалоЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЭтапыДокумента.ЭтапПеремещения КАК Этап,
	|	втЭтапыДокумента.НачалоЭтапа КАК НачалоЭтапа,
	|	втЭтапыДокумента.ОкончаниеЭтапа КАК ОкончаниеЭтапа
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(втЭтапыДокумента.Время) КАК Время
	|	ИЗ
	|		втЭтапыДокумента КАК втЭтапыДокумента) КАК МаксВремяЭтапа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЭтапыДокумента КАК втЭтапыДокумента
	|		ПО МаксВремяЭтапа.Время = втЭтапыДокумента.Время";

	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = Результат.Выбрать();
	Рез = Новый Структура;
	Если Выборка.Следующий() Тогда
		Рез.Вставить("Этап", Выборка.Этап);
		Рез.Вставить("НачалоЭтапа", ?(Выборка.НачалоЭтапа='00010101', Объект.Дата, Выборка.НачалоЭтапа));
		Рез.Вставить("ОкончаниеЭтапа", Выборка.ОкончаниеЭтапа);
	Иначе
		Рез.Вставить("Этап", Перечисления.ЭтапыПеремещения.Поступление);
		Рез.Вставить("НачалоЭтапа", Объект.Дата);
		Рез.Вставить("ОкончаниеЭтапа", '00010101');
	КонецЕсли;
	Возврат Рез;
КонецФункции 

&НаКлиенте
Процедура Док_ТоварПоступилВместо(Команда)
	ЗавершениеЭтапаПеремещения(ПредопределенноеЗначение("Перечисление.ЭтапыПеремещения.Поступление"));
КонецПроцедуры
&НаКлиенте
Процедура Док_ТоварПринятВместо(Команда)
	ЗавершениеЭтапаПеремещения(ПредопределенноеЗначение("Перечисление.ЭтапыПеремещения.Приемка"));
КонецПроцедуры
&НаКлиенте
Процедура Док_ТоварРазложенВместо(Команда)
	ЗавершениеЭтапаПеремещения(ПредопределенноеЗначение("Перечисление.ЭтапыПеремещения.Раскладка"));
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЭтапаПеремещения(ЭтапПеремещения)
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Прежде чем подтвердить завершение этапа, необходимо провести документ!", СтатусСообщения.Важное);
	Иначе
		ТекущийЭтап = ЭтапПеремещения;
		Если ТекущийЭтап = ПредопределенноеЗначение("Перечисление.ЭтапыПеремещения.Поступление") Тогда
			ДатаНачалаТекущегоЭтапа = ?(ДатаНачалаТекущегоЭтапа='00010101', Объект.Дата, ДатаНачалаТекущегоЭтапа);
			Элементы.ТоварПоступил.Видимость = Ложь;
		ИначеЕсли ТекущийЭтап  = ПредопределенноеЗначение("Перечисление.ЭтапыПеремещения.Приемка") Тогда
			Элементы.ТоварПринят.Видимость = Ложь;
		ИначеЕсли ТекущийЭтап  = ПредопределенноеЗначение("Перечисление.ЭтапыПеремещения.Раскладка") Тогда
			Элементы.ТоварРазложен.Видимость = Ложь;
		КонецЕсли;
		ДатаОкончанияТекущегоЭтапа = ТекущаяДата();
		ЗаписатьЭтапВРегистр();
		ОбновитьВидимостьПанелиЭтапов();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура НачалоЭтапаПриемки()
	Если ТекущийЭтап = ПредопределенноеЗначение("Перечисление.ЭтапыПеремещения.Поступление") 
		И  (ДатаОкончанияТекущегоЭтапа <> '00010101') Тогда
			ЗавершениеЭтапаПеремещения("Перечисление.ЭтапыПеремещения.Поступление");
			ТекущийЭтап = ПредопределенноеЗначение("Перечисление.ЭтапыПеремещения.Приемка");
			ДатаНачалаТекущегоЭтапа = ТекущаяДата();
			ДатаОкончанияТекущегоЭтапа = Неопределено;
			ЗаписатьЭтапВРегистр();
			ОбновитьВидимостьПанелиЭтапов();
	КонецЕсли;
КонецПроцедуры

&После("ОбработатьШтрихкоды")
&НаКлиенте
Процедура Док_ОбработатьШтрихкоды(ДанныеШтрихкодов)
	НачалоЭтапаПриемки();
КонецПроцедуры	

&НаКлиенте
Процедура Док_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	НачалоЭтапаПриемки();
 КонецПроцедуры

&НаКлиенте
&Вместо("ПроверитьКоличествоВДокументе")
Процедура Док_ПроверитьКоличествоВДокументеВместо(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Табличная часть будет перезаполнена по ордерам. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда   
		
		ПерезаполнитьТоварыПоОрдерам();
		
		Если Объект.Товары.Количество()> 0 Тогда 
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
				"Документ.ПеремещениеТоваров.ФормаДокумента.Команда.ПроверитьКоличествоВДокументе");
			
			ПараметрыУказанияСерийВрем = Новый Структура(ПараметрыУказанияСерий);
			ПараметрыУказанияСерийВрем.ИмяПоляСклад = "Склад";
			ПараметрыУказанияСерийПроверкаКоличества = Новый ФиксированнаяСтруктура(ПараметрыУказанияСерийВрем);

			Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПеремещенийТоваров.Принято") Тогда
				Склад = Объект.СкладПолучатель;
			Иначе	
				Склад = Объект.СкладОтправитель;
			КонецЕсли;
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("АдресВоВременномХранилище",            ПоместитьТабличнуюЧастьТоварыВоВременноеХранилищеДляПроверкиКоличества());
			ПараметрыОткрытия.Вставить("ИмяТабличнойЧасти",                    "Товары");
			ПараметрыОткрытия.Вставить("Ссылка",                               Объект.Ссылка);
			ПараметрыОткрытия.Вставить("ПревышениеКоличестваТоваровРазрешено", Истина); 
			ПараметрыОткрытия.Вставить("ПараметрыУказанияСерий",               ПараметрыУказанияСерийПроверкаКоличества);
			ПараметрыОткрытия.Вставить("Склад",                                Склад);
			ПараметрыОткрытия.Вставить("ПеремещениеПоЗаказам",                 Объект.ПеремещениеПоЗаказам);
			ПараметрыОткрытия.Вставить("Статус",                               Объект.Статус);
			
			ВозвращаемыеПараметры = Неопределено;

			ОткрытьФорму("ОбщаяФорма.ПроверкаЗаполненияДокументов", ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("Док_ПроверитьКоличествоВДокументеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			НачалоЭтапаПриемки();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТоварыПоОрдерам()

	//Объект.Товары.Очистить();
	//ТоварыПоОрдерам = ПолучитьТоварыПоОрдерам();	
	//Если ТоварыПоОрдерам.Количество() > 0 Тогда 
	//	ЗаполнитьТоварыПодобраннымиИзОрдеров(ТоварыПоОрдерам);
	//КонецЕсли;  
	
	ПересчитатьКоличествоПоНазначениям(); 
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКоличествоПоНазначениям()
	
	Если Не СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(Объект.СкладПолучатель, Объект.Дата) 
		И Не СкладыСервер.ИспользоватьОрдернуюСхемуПриОтгрузке(Объект.СкладОтправитель, Объект.Дата) Тогда
		
		Возврат;
	КонецЕсли;
	
	//Пеоезаполняем количество по ордеру, сделано так, потому что в ордере по перемещению нет назначений
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
	|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество) КАК Количество,
	|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество) КАК КоличествоУпаковок
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Накладная = &Ссылка
	|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен
	|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ТаблицаРасходник = Запрос.Выполнить().Выгрузить();   

	УдаляемыеСтроки = Новый Массив;
	ТекущаяСтрока = Неопределено;  
		
	для каждого Стр из Объект.Товары цикл
		//Выгружаем строку из расходника в стек 
		Если (ТекущаяСтрока = Неопределено)
			или (ТекущаяСтрока.Номенклатура <> Стр.Номенклатура)
			или (ТекущаяСтрока.Характеристика <> Стр.Характеристика)
			или ЗначениеЗаполнено(ТекущаяСтрока.Назначение)
		Тогда 		
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",Стр.Номенклатура);  
			Отбор.Вставить("Характеристика",Стр.Характеристика);
			НайденныеСтроки = ТаблицаРасходник.НайтиСтроки(Отбор);
			
			//Если Строки.Количество() > 0 Тогда
			//    ТекущаяСтрока = Строки[0];   
			//Иначе
			//	УдаляемыеСтроки.Добавить(Стр);
			//	Продолжить; 
			//КонецЕсли;
				
			Если НайденныеСтроки.Количество() = 0 Тогда
				УдаляемыеСтроки.Добавить(Стр);
				Продолжить;
			ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
				ТекущаяСтрока = НайденныеСтроки[0];
			Иначе
				Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
					Если НайденнаяСтрока.Назначение = Стр.Назначение Тогда
						ТекущаяСтрока = НайденнаяСтрока;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли; 
		
		//Пересчитываем количество 
		Если ТекущаяСтрока.Количество > Стр.Количество Тогда 
			ТекущаяСтрока.Количество = ТекущаяСтрока.Количество - Стр.Количество; 
			ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок - Стр.КоличествоУпаковок; 
		Иначе
			Стр.Количество = ТекущаяСтрока.Количество;  
			Стр.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок; 
	        ТекущаяСтрока.Количество = 0;
			ТекущаяСтрока.КоличествоУпаковок = 0; 
		КонецЕсли;  
		
		Если Стр.Количество = 0 или Стр.КоличествоУпаковок = 0 ТОгда 
			УдаляемыеСтроки.Добавить(Стр);
		КонецЕсли;
		
	конеццикла;

	Для Каждого Стр Из УдаляемыеСтроки Цикл
		Объект.Товары.Удалить(Стр);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОрдерам()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество) КАК Количество,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия КАК Серия,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.СтатусУказанияСерий КАК СтатусУказанияСерий,
|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество) КАК КоличествоУпаковок
|ПОМЕСТИТЬ ВТ_ТоварыПоРаспоряжениям
|ИЗ
|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
|ГДЕ
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Накладная = &Ссылка
|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен
|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
|
|СГРУППИРОВАТЬ ПО
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия,
|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.СтатусУказанияСерий
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЗаказНаПеремещениеТовары.Ссылка КАК Ссылка,
|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
|	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
|	ЗаказНаПеремещениеТовары.Назначение КАК Назначение,
|	МИНИМУМ(ЗаказНаПеремещениеТовары.КодСтроки) КАК КодСтроки,
|	ЗаказНаПеремещениеТовары.Отменено КАК Отменено,
|	ЗаказНаПеремещениеТовары.Упаковка КАК Упаковка,
|	ЗаказНаПеремещениеТовары.Количество КАК Количество,
|	ЗаказНаПеремещениеТовары.КоличествоУпаковок КАК КоличествоУпаковок
|ПОМЕСТИТЬ ВТ_ЗаказНаПеремещение
|ИЗ
|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
|		ПО ЗаказНаПеремещениеТовары.Ссылка = ПеремещениеТоваровТовары.ЗаказНаПеремещение
|			И ЗаказНаПеремещениеТовары.Номенклатура = ПеремещениеТоваровТовары.Номенклатура
|			И ЗаказНаПеремещениеТовары.Характеристика = ПеремещениеТоваровТовары.Характеристика
|			И ЗаказНаПеремещениеТовары.Назначение = ПеремещениеТоваровТовары.Назначение
|ГДЕ
|	ЗаказНаПеремещениеТовары.Ссылка В
|			(ВЫБРАТЬ
|				ВТ_ТоварыПоРаспоряжениям.Распоряжение
|			ИЗ
|				ВТ_ТоварыПоРаспоряжениям КАК ВТ_ТоварыПоРаспоряжениям)
|	И НЕ ЗаказНаПеремещениеТовары.Отменено
|	И ПеремещениеТоваровТовары.Ссылка = &Ссылка
|
|СГРУППИРОВАТЬ ПО
|	ЗаказНаПеремещениеТовары.Номенклатура,
|	ЗаказНаПеремещениеТовары.Характеристика,
|	ЗаказНаПеремещениеТовары.Отменено,
|	ЗаказНаПеремещениеТовары.Ссылка,
|	ЗаказНаПеремещениеТовары.Упаковка,
|	ЗаказНаПеремещениеТовары.Назначение,
|	ЗаказНаПеремещениеТовары.Количество,
|	ЗаказНаПеремещениеТовары.КоличествоУпаковок
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_ТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
|	ВТ_ТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
|	ВЫБОР
|		КОГДА ВТ_ТоварыПоРаспоряжениям.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
|			ТОГДА ВТ_ЗаказНаПеремещение.Назначение
|		ИНАЧЕ ВТ_ТоварыПоРаспоряжениям.Назначение
|	КОНЕЦ КАК Назначение,
|	ВТ_ТоварыПоРаспоряжениям.Серия КАК Серия,
|	ВТ_ТоварыПоРаспоряжениям.СтатусУказанияСерий КАК СтатусУказанияСерий,
|	СУММА(ВТ_ЗаказНаПеремещение.Количество) КАК Количество,
|	СУММА(ВТ_ЗаказНаПеремещение.КоличествоУпаковок) КАК КоличествоУпаковок,
|	ВТ_ТоварыПоРаспоряжениям.Распоряжение КАК ЗаказНаПеремещение,
|	МИНИМУМ(ВТ_ЗаказНаПеремещение.КодСтроки) КАК КодСтроки,
|	ВТ_ЗаказНаПеремещение.Упаковка КАК Упаковка
|ИЗ
|	ВТ_ТоварыПоРаспоряжениям КАК ВТ_ТоварыПоРаспоряжениям
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказНаПеремещение КАК ВТ_ЗаказНаПеремещение
|		ПО (ВТ_ЗаказНаПеремещение.Ссылка = ВТ_ТоварыПоРаспоряжениям.Распоряжение)
|			И (ВТ_ЗаказНаПеремещение.Номенклатура = ВТ_ТоварыПоРаспоряжениям.Номенклатура)
|			И (ВТ_ЗаказНаПеремещение.Характеристика = ВТ_ТоварыПоРаспоряжениям.Характеристика)
|
|СГРУППИРОВАТЬ ПО
|	ВТ_ТоварыПоРаспоряжениям.Номенклатура,
|	ВТ_ТоварыПоРаспоряжениям.Характеристика,
|	ВЫБОР
|		КОГДА ВТ_ТоварыПоРаспоряжениям.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
|			ТОГДА ВТ_ЗаказНаПеремещение.Назначение
|		ИНАЧЕ ВТ_ТоварыПоРаспоряжениям.Назначение
|	КОНЕЦ,
|	ВТ_ТоварыПоРаспоряжениям.Серия,
|	ВТ_ТоварыПоРаспоряжениям.СтатусУказанияСерий,
|	ВТ_ТоварыПоРаспоряжениям.Распоряжение,
|	ВТ_ЗаказНаПеремещение.Упаковка
|
|УПОРЯДОЧИТЬ ПО
|	Номенклатура,
|	Назначение УБЫВ";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТоварыПодобраннымиИзОрдеров(Таблица)
	
	СтруктураТаблиц = ТаблицыСерииОтправителяИСерииПолучателя(Таблица);
	ЗаполнитьТоварыПодобраннымиИзОрдеровСУчетомСерий(СтруктураТаблиц.ТаблицаСерииОтправителя, Истина);
	ЗаполнитьТоварыПодобраннымиИзОрдеровСУчетомСерий(СтруктураТаблиц.ТаблицаСерииПолучателя,  Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПодобраннымиИзОрдеровСУчетомСерий(Таблица, УчитыватьСерию);
				
	Для Каждого СтрокаТаблицы Из Таблица Цикл	
		СтрокаТовара = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовара, СтрокаТаблицы, , ?(УчитыватьСерию, "", "Серия"));
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
	//+Альтерра
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	//-
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, Неопределено); 
	
	ОбновитьНазначениеОтправителяВТаблицеТовары();
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
		
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ИзменитьТабличнуюЧастьПоРезультатамПроверки")
Процедура Док_ИзменитьТабличнуюЧастьПоРезультатамПроверки(ВозвращаемыеПараметры, КэшированныеЗначения)
	
	ТаблицаТовары = ПолучитьИзВременногоХранилища(ВозвращаемыеПараметры.Товары);
	ДобавленныеИИзмененныеСтроки = Новый Массив();
	УдаляемыеСтроки = Новый Массив;
	
	#Вставка
	ТоварыВЗаказеНаПеремещение = ПолучитьТоварыИзЗаказовНаПеремещение();
	#КонецВставки
	
	Для Каждого СтрокаИсточник Из ТаблицаТовары Цикл

	#Удаление 
		Отбор = Новый Структура("НоменклатураНабора, ХарактеристикаНабора, Номенклатура, Характеристика, Серия, СтатусУказанияСерий, Упаковка");
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаИсточник);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			
			Если СтрокаИсточник.КоличествоУпаковок = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрокаИсточник.КоличествоУпаковок >= 0 Тогда
				
				СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок + СтрокаИсточник.КоличествоУпаковок;
				СтрокаИсточник.КоличествоУпаковок = 0;
				ДобавленныеИИзмененныеСтроки.Добавить(СтрокаТЧ);
				
			Иначе
				
				КоличествоКСписанию = -СтрокаИсточник.КоличествоУпаковок;
				КоличествоВСтроке   = СтрокаТЧ.КоличествоУпаковок;
				
				Если КоличествоКСписанию >= КоличествоВСтроке Тогда
					СтрокаИсточник.КоличествоУпаковок = КоличествоВСтроке - КоличествоКСписанию;
					СтрокаТЧ.КоличествоУпаковок       = 0;
				Иначе
					СтрокаИсточник.КоличествоУпаковок = 0;
					СтрокаТЧ.КоличествоУпаковок       = КоличествоВСтроке - КоличествоКСписанию;
					ДобавленныеИИзмененныеСтроки.Добавить(СтрокаТЧ);
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТЧ.КоличествоУпаковок = 0 Тогда
				УдаляемыеСтроки.Добавить(СтрокаТЧ);
			Иначе
				
				
			КонецЕсли;
			
		КонецЦикла;
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			СтрокаТЧ = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаИсточник);
			ДобавленныеИИзмененныеСтроки.Добавить(СтрокаТЧ);
			
			
		КонецЕсли;
	#КонецУдаления
		
	#Вставка
		Отбор = Новый Структура("Номенклатура, Характеристика, Серия, СтатусУказанияСерий, Упаковка, ЗаказНаПеремещение, Назначение");
	
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаИсточник);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл 
				
			Если СтрокаИсточник.БезРасхождений Тогда
				СтрокаТЧ.СпособВводаКоличества = СтрокаИсточник.СпособВводаКоличества; 
				СтрокаТЧ.Отсканирован = СтрокаИсточник.Отсканирован;
				Продолжить;
			КонецЕсли;  
			
			Если СтрокаИсточник.КоличествоУпаковок = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрокаИсточник.КоличествоУпаковок > 0 Тогда
				
				НайденныеСтрокиЗаказа = ТоварыВЗаказеНаПеремещение.НайтиСтроки(Отбор);
				Если НайденныеСтрокиЗаказа.Количество() > 0 Тогда
					Для Каждого СтрокаЗаказа Из НайденныеСтрокиЗаказа Цикл
						КоличествоУпаковок = СтрокаЗаказа.КоличествоУпаковок - СтрокаТЧ.КоличествоУпаковок;
					КонецЦикла;
				Иначе 
					КоличествоУпаковок = 0;
				КонецЕсли;
				
				СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок + КоличествоУпаковок;
			 	СтрокаТЧ.СпособВводаКоличества = СтрокаИсточник.СпособВводаКоличества; 
				СтрокаТЧ.Отсканирован = СтрокаИсточник.Отсканирован;
				
				ОсталосьДобавитьУпаковок = СтрокаИсточник.КоличествоУпаковок - КоличествоУпаковок;
				Если ОсталосьДобавитьУпаковок > 0 Тогда
					НоваяСтрокаТЧ = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаИсточник);
					НоваяСтрокаТЧ.КоличествоУпаковок = ОсталосьДобавитьУпаковок;
					
					ОбновитьОтклоненияОтЗаказаВСтроке(НоваяСтрокаТЧ, Объект.ПеремещениеПоЗаказам); 
					ОбновитьЗависимыеРеквизитыФормыПоЗаказу(Объект.Товары, НадписьРасхождениеЗаказ, Элементы);
					ОбработатьСтрокуТЧПослеПерезаполнения(НоваяСтрокаТЧ, КэшированныеЗначения);
				КонецЕсли;	
				СтрокаИсточник.КоличествоУпаковок = 0;	
				
			Иначе
				
				КоличествоКСписанию = -СтрокаИсточник.КоличествоУпаковок;
				КоличествоВСтроке = СтрокаТЧ.КоличествоУпаковок;
				
				Если КоличествоКСписанию > КоличествоВСтроке Тогда
					СтрокаИсточник.КоличествоУпаковок = КоличествоВСтроке - КоличествоКСписанию;
					СтрокаТЧ.КоличествоУпаковок = 0;
				Иначе
					СтрокаИсточник.КоличествоУпаковок = 0;
					СтрокаТЧ.КоличествоУпаковок = КоличествоВСтроке - КоличествоКСписанию;
				КонецЕсли;
				СтрокаТЧ.СпособВводаКоличества = СтрокаИсточник.СпособВводаКоличества; 
				СтрокаТЧ.Отсканирован = СтрокаИсточник.Отсканирован;
			КонецЕсли;
			
			Если СтрокаТЧ.КоличествоУпаковок = 0 Тогда
				УдаляемыеСтроки.Добавить(СтрокаТЧ);
			Иначе	
				ОбработатьСтрокуТЧПослеПерезаполнения(СтрокаТЧ, КэшированныеЗначения);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НайденныеСтроки.Количество() = 0 Тогда	
			СтрокаТЧ = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаИсточник);

			НайденныеСтрокиЗаказа = ТоварыВЗаказеНаПеремещение.НайтиСтроки(Отбор);
			Если НайденныеСтрокиЗаказа.Количество() > 0 Тогда
				Для Каждого СтрокаЗаказа Из НайденныеСтрокиЗаказа Цикл
					СтрокаТЧ.КодСтроки = СтрокаЗаказа.КодСтроки;
					Если СтрокаИсточник.КоличествоУпаковок > СтрокаЗаказа.КоличествоУпаковок Тогда 
						ОсталосьДобавитьУпаковок = СтрокаИсточник.КоличествоУпаковок - СтрокаЗаказа.КоличествоУпаковок ;
						СтрокаТЧ.КоличествоУпаковок = СтрокаЗаказа.КоличествоУпаковок;
						Если ОсталосьДобавитьУпаковок > 0 Тогда
							НоваяСтрокаТЧ = Объект.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаИсточник);
							НоваяСтрокаТЧ.КоличествоУпаковок = ОсталосьДобавитьУпаковок;
						
							ОбновитьОтклоненияОтЗаказаВСтроке(НоваяСтрокаТЧ, Объект.ПеремещениеПоЗаказам); 
							ОбновитьЗависимыеРеквизитыФормыПоЗаказу(Объект.Товары, НадписьРасхождениеЗаказ, Элементы);
							ОбработатьСтрокуТЧПослеПерезаполнения(НоваяСтрокаТЧ, КэшированныеЗначения);
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
			
			ОбновитьОтклоненияОтЗаказаВСтроке(СтрокаТЧ, Объект.ПеремещениеПоЗаказам);
			ОбработатьСтрокуТЧПослеПерезаполнения(СтрокаТЧ, КэшированныеЗначения);
		КонецЕсли;
	#КонецВставки
		
	КонецЦикла;
    
    СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ПакетнаяОбработкаТабличнойЧастиКлиентСерверЛокализация.ДополнитьСтруктуруДействийПриИзмененииЭлемента(
			ЭтотОбъект, "Номенклатура", СтруктураДействий);
			
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ДобавленныеИИзмененныеСтроки,
		СтруктураДействий,
		Объект.Товары,
		КэшированныеЗначения);
	
	Для Каждого СтрокаТЧ Из УдаляемыеСтроки Цикл
		Объект.Товары.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
	СобытияФорм.ПриИзмененииЭлемента(ЭтотОбъект, "Товары");

КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыИзЗаказовНаПеремещение()
	
	ТаблицаЗаказов = Новый ТаблицаЗначений();
	ТаблицаЗаказов.Колонки.Добавить("Значение", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПеремещение"));
	Для Каждого Элемент из СписокЗаказов Цикл
        ЗаполнитьЗначенияСвойств(ТаблицаЗаказов.Добавить(), Элемент)
    КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заказы.Значение КАК ЗаказНаПеремещение
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	&Заказы КАК Заказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Ссылка КАК ЗаказНаПеремещение,
	|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказНаПеремещениеТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ЗаказНаПеремещениеТовары.Серия КАК Серия,
	|	ЗаказНаПеремещениеТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ЗаказНаПеремещениеТовары.Упаковка КАК Упаковка,
	|	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
	|	ЗаказНаПеремещениеТовары.Назначение КАК Назначение,
	|	Максимум(ЗаказНаПеремещениеТовары.КодСтроки) КАК КодСтроки
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_ЗаказыНаПеремещение
	|		ПО (ВТ_ЗаказыНаПеремещение.ЗаказНаПеремещение = ЗаказНаПеремещениеТовары.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура,
	|	ЗаказНаПеремещениеТовары.Серия,
	|	ЗаказНаПеремещениеТовары.СтатусУказанияСерий,
	|	ЗаказНаПеремещениеТовары.Упаковка,
	|	ЗаказНаПеремещениеТовары.Характеристика,
	|	ЗаказНаПеремещениеТовары.Назначение";	
	Запрос.УстановитьПараметр("Заказы", ТаблицаЗаказов);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьСтрокуТЧПослеПерезаполнения(СтрокаТЧ, КэшированныеЗначения)

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПроверитьКоличествоВДокументеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВозвращаемыеПараметры = Результат; 
	Если ВозвращаемыеПараметры <> Неопределено Тогда
        ИзменитьТабличнуюЧастьПоРезультатамПроверки(ВозвращаемыеПараметры, ?(КэшированныеЗначения = Неопределено, ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения(), КэшированныеЗначения));
        Модифицированность = Истина;   
    КонецЕсли;

	ОбновитьВидимостьПанелиЭтапов();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЭтапВРегистр()
	Если Не ЗначениеЗаполнено(ТекущийЭтап) Тогда
		ТекущийЭтап = Перечисления.ЭтапыПеремещения.Поступление;
		ДатаНачалаТекущегоЭтапа = ТекущаяДата();
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.ПеремещениеТоваровПоЭтапам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
	НаборЗаписей.Отбор.ЭтапПеремещения.Установить(ТекущийЭтап);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество()=0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Объект.Ссылка;
		Запись.ЭтапПеремещения = ТекущийЭтап;
		Запись.НачалоЭтапа = ДатаНачалаТекущегоЭтапа;
		Запись.ОкончаниеЭтапа = ДатаОкончанияТекущегоЭтапа;
	Иначе
		Запись = НаборЗаписей[0];
		Запись.ОкончаниеЭтапа = ДатаОкончанияТекущегоЭтапа;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
	//если окончание приёмки, значит, начало раскладки
	Если ТекущийЭтап = Перечисления.ЭтапыПеремещения.Приемка И ДатаОкончанияТекущегоЭтапа <> '00010101' Тогда
		 ЗаписьНачалоРаскладки = РегистрыСведений.ПеремещениеТоваровПоЭтапам.СоздатьМенеджерЗаписи();
		 ЗаписьНачалоРаскладки.Документ = Объект.Ссылка;
		 ЗаписьНачалоРаскладки.ЭтапПеремещения = Перечисления.ЭтапыПеремещения.Раскладка;
		 ЗаписьНачалоРаскладки.НачалоЭтапа = ДатаОкончанияТекущегоЭтапа;
		 УстановитьПривилегированныйРежим(Истина);
		 ЗаписьНачалоРаскладки.Записать();
		 УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры 
&НаКлиенте

Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
	ЗаписатьЭтапВРегистр();
	ОбновитьВидимостьПанелиЭтапов();
КонецПроцедуры

#КонецОбласти

#Область УведомленияПодрядчику
&НаСервере
Процедура УведомленияПодрядчику_ИнициализацияЗначений()
	
	СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	СкладПолучатель = Объект.СкладПолучатель; 
	СкладОтправитель = Объект.СкладОтправитель;
	
	Если ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) Тогда
		СкладПолучатель_Условие = 
			ЗначениеЗаполнено(СкладПолучатель) И
	        СкладПолучатель.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
	        СкладПолучатель.ОтправкаУведомлений = Истина И
	        СкладПолучатель.ТипСкладаПодрядчика = Ложь;
			
		Если СкладПолучатель_Условие ИЛИ
	        (ЗначениеЗаполнено(СкладОтправитель) И
	        СкладОтправитель.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
	        СкладОтправитель.ОтправкаУведомлений = Истина И
	        СкладОтправитель.ТипСкладаПодрядчика = Истина) Тогда 
		
        	Элементы.УведомленияПодрядчику.Видимость = ИСТИНА;
            Если Не СобытияДокументовАльтерра_НайтиЗапись(Перечисления.СобытияДокументов.УведомлениеПодрядчику) Тогда
                БлокировкаТаблицыТовары = Истина;
                Элементы.Товары.Доступность = Ложь;
            КонецЕсли;
			
			ДобавитьКолонкуНаСервере();
			
			Если СкладПолучатель_Условие Тогда  
				УведомленияПодрядчикуТелефон = СкладПолучатель.ТелефонПодрядчика;
                УведомленияПодрядчикуПочта = СкладПолучатель.EMAILподрядчика;
            Иначе
            	УведомленияПодрядчикуТелефон = СкладОтправитель.ТелефонПодрядчика;
                УведомленияПодрядчикуПочта = СкладОтправитель.EMAILподрядчика;
			КонецЕсли;
			
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Элементы.УведомленияПодрядчику.Видимость = ЛОЖЬ;
    БлокировкаТаблицыТовары = Ложь;
    Элементы.Товары.Доступность = Истина;
   
КонецПроцедуры      


&НаКлиенте
Процедура Док_БлокировкаТаблицыТоварыПриИзмененииПосле(Элемент)
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
    ЭтотОбъект);    

  ПоказатьВопрос(Оповещение,
      "При снятии блокировки таблицы товары, подрядчик будет уведомлен об этом. Снять блокировку?",
      РежимДиалогаВопрос.ДаНетОтмена,
      0);    

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт

  Если Результат = КодВозвратаДиалога.Да Тогда
       БлокировкаТаблицыТовары = Ложь;
       Элементы.БлокировкаТаблицыТовары.Доступность = Ложь;
       Элементы.Товары.Доступность = Истина;
       СоздатьЗаписьВРегистре();
   КонецЕсли;    
   
   Если Результат = КодВозвратаДиалога.Нет или Результат = КодВозвратаДиалога.Отмена Тогда
       БлокировкаТаблицыТовары = Истина;
   КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВРегистре()
       События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
       События.Отбор.Документ.Установить(Объект.Ссылка);
       События.Отбор.Событие.Установить(Перечисления.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику);
       События.Отбор.Период.Установить(Объект.Дата);
       
       НовоеСобытие = События.Добавить();
       НовоеСобытие.Документ = Объект.Ссылка;
       НовоеСобытие.Событие = Перечисления.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику;
       НовоеСобытие.Период = Объект.Дата;
       События.Записать();
   КонецПроцедуры
   
&НаСервере
Процедура ДобавитьКолонкуНаСервере()
Если Элементы.Найти("КомментарийОтИнженера") = Неопределено Тогда
 нЭлемент = Элементы.Добавить("КомментарийОтИнженера", Тип("ПолеФормы"), Элементы.Товары); 
 нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
 нЭлемент.ПутьКДанным = "Объект.Товары.КомментарийОтИнженера";
 КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ДоступностьОтправкиМ15()        
	
	СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	СкладПолучатель = Объект.СкладПолучатель; 
	СкладОтправитель = Объект.СкладОтправитель;
	
	Если ЗначениеЗаполнено(СкладПолучатель) И
		ЗначениеЗаполнено(СкладОтправитель) И
        ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И
       	СкладПолучатель.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
		СкладОтправитель.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
       	СкладПолучатель.ТипСкладаПодрядчика = Истина И
		СкладОтправитель.ТипСкладаПодрядчика = Ложь И
        СкладОтправитель.ОтправкаУведомлений = Истина Тогда
	   
   		Элементы.ОтправкаМ15.Видимость = Истина; 
		Элементы.ОтправитьМ15.Доступность = СобытияДокументовАльтерра_НайтиЗапись(Перечисления.СобытияДокументов.М15ОтправленаПодрядчику);
		АктуализироватьДанныеПоБП();
	Иначе
		Элементы.ОтправкаМ15.Видимость = Ложь;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура Док_ОтправитьМ15После(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаМ15",
    ЭтотОбъект);    

  ПоказатьВопрос(Оповещение,
      "Отправить подрядчику М15 на почту?",
      РежимДиалогаВопрос.ДаНетОтмена,
      0);    

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаМ15(Результат, Параметры)  Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОТправитьСмс();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОтправитьСМС()
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбщегоНазначения.СообщитьПользователю("Документ должен быть записан!");
			Возврат;
		КонецЕсли;
	
		Если Не ЗначениеЗаполнено(Объект.Номер) Тогда
			ОбщегоНазначения.СообщитьПользователю("Номер документа должен быть указан!");
			Возврат;
		КонецЕсли;
	
		ФайлОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатная форма м 15 перемещение", Истина);

		УведомленияПодрядчикуПочта = объект.СкладПолучатель.EMAILподрядчика;
		УведомленияПодрядчикуТелефон = объект.СкладПолучатель.ТелефонПодрядчика;
		ДопПочта = объект.СкладПолучатель.ДопEMAILподрядчика; 
	
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ВыводитьСумму", Истина);
		
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(объект.Ссылка);
		
		ОбъектыПечати = Новый СписокЗначений;
		ОбъектыПечати.Добавить(объект.Ссылка);
		
		ДвоичныеДанные = ФайлОбработка.ХранилищеОбработки.Получить();
		ФайлОбработка = ПолучитьИмяВременногоФайла();
		ДвоичныеДанные.Записать(ФайлОбработка);
		
	   СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ПеремещениеТОваров", Объект.Ссылка);

	
		СуммаИтог = 0;

		ТабличныйДокумент = ВнешниеОбработки.Создать(ФайлОбработка).СформироватьПечатнуюФормуМ15Подрядчику(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, неопределено, ОснованиеПодрядчику, представлениеПодразделения);
		ФайлТабДок = ПолучитьИмяВременногоФайла();
		ТабличныйДокумент.Записать(ФайлТабДок, ТипФайлаТабличногоДокумента.XLSX);
		АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТабДок));

	

	
		МассивФайлов = Новый Массив;
		МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище","Накладная М15" + ".xlsx", АдресВХ));

	
		ПараметрыОтправки = Новый Структура;
		ПараметрыОтправки.Вставить("Кому", УведомленияПодрядчикуПочта);
		ПараметрыОтправки.Вставить("Тема", "Альтерра накладная М15 " + объект.СкладПолучатель);
		ПараметрыОтправки.Вставить("Тело", "Вам поступила накладная М15, требуется подписать и передать ответственному инженеру");
	

		ПараметрыОтправки.Вставить("Кодировка", КодировкаТекста.UTF8);
		ПараметрыОтправки.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
		ПараметрыОтправки.Вставить("Вложения", МассивФайлов);
	
		РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
		Если ЗначениеЗАполнено(ДопПочта) Тогда 
			ПараметрыОтправки.Кому = ДопПочта; 
			РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
		КонецЕслИ; 
	
	
		Если ЗначениеЗаполнено(РезультатОтправкиEmail) И ТипЗнч(РезультатОтправкиEmail) = Тип("Строка") Тогда	
			НомерТелефонаПартнера = АльтерраОбщегоНазначения.ПолчитьТелефонБезКода(УведомленияПодрядчикуТелефон);
			Если СтрДлина(НомерТелефонаПартнера) = 10 Тогда
				СтрокаНомерТелефона = "+7" + Строка(НомерТелефонаПартнера);
				СтатусОшибки = Ложь;
				АльтерраОбщегоНазначения.ОтправитьСМС(СтрокаНомерТелефона, "На вашу почту направлена накладная м15 ", СтатусОшибки);
		
	
				Если Не СтатусОшибки Тогда
					ОбщегоНазначения.СообщитьПользователю("Сообщения на E-mail адрес и телефон успешно отправлены!");
				
				Иначе 
					ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на телефон. На E-mail адрес сообщение успешно отправлено!");
				КонецЕсли;
			Иначе 
					ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на телефон. На E-mail адрес сообщение успешно отправлено!");
			КонецЕсли;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на E-mail адрес..");
		КонецЕсли;
		УдалитьФайлы(ФайлОбработка);
		УдалитьФайлы(ФайлТабДок);
		УдалитьИзВременногоХранилища(АдресВХ);  
		
		ДобавитьЗаписьВРегистр_СобытияДокументовАльтерра(Перечисления.СобытияДокументов.М15ОтправленаПодрядчику);

КонецПроцедуры   

&НаСервере
Процедура ДобавитьЗаписьВРегистр_СобытияДокументовАльтерра(Событие)
	События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
	События.Отбор.Документ.Установить(Объект.Ссылка); 
	События.Отбор.Событие.Установить(Событие); 
		
	НовоеСобытие = События.Добавить();
	НовоеСобытие.Документ = Объект.Ссылка;
	НовоеСобытие.Событие = Событие;
	НовоеСобытие.Период = ТекущаяДата(); 
	События.Записать();
КонецПроцедуры

&НаСервере
Функция СобытияДокументовАльтерра_НайтиЗапись(Событие)  
	Запрос = Новый Запрос;
   	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1   
		|	СобытияДокументовАльтерраСрезПоследних.Документ КАК Документ,
		|	СобытияДокументовАльтерраСрезПоследних.Событие КАК Событие
		|ИЗ
		|	РегистрСведений.СобытияДокументовАльтерра.СрезПоследних КАК СобытияДокументовАльтерраСрезПоследних
		|ГДЕ
		|	СобытияДокументовАльтерраСрезПоследних.Документ = &Документ
		|	И СобытияДокументовАльтерраСрезПоследних.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
   	Запрос.УстановитьПараметр("Событие", Событие);
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции
	
&НаСервере
 Процедура Док_БПНаВозвратМ15ПослеНаСервере()
	//Формируем М15 
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ должен быть записан!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(объект.Номер) Тогда
		ОбщегоНазначения.СообщитьПользователю("Номер документа должен быть указан!");
		Возврат;
	КонецЕсли;
	
	ФайлОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатная форма м 15 перемещение", Истина);

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВыводитьСумму", Истина);
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(объект.Ссылка);
		
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(объект.Ссылка);
	
	ДвоичныеДанные = ФайлОбработка.ХранилищеОбработки.Получить();
	ФайлОбработка = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ФайлОбработка);
		
   	СтруктураТипов = Новый Соответствие;
	СтруктураТипов.Вставить("Документ.ПеремещениеТОваров", Объект.Ссылка);

	СуммаИтог = 0;

	ТабличныйДокумент = ВнешниеОбработки.Создать(ФайлОбработка).СформироватьПечатнуюФормуМ15Подрядчику(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, неопределено, ОснованиеПодрядчику, представлениеПодразделения);
	ФайлТабДок = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ФайлТабДок, ТипФайлаТабличногоДокумента.XLSX);
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТабДок));

	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище", "Накладная М15.xlsx", АдресВХ));
		
	//Преобразовываем файл 	
	Бэйз64Строка = Base64Строка(Новый ДвоичныеДанные(ФайлТабДок));
    Бэйз64Строка = СтрЗаменить(Бэйз64Строка, Символы.ВК, "");
    Бэйз64Строка = СтрЗаменить(Бэйз64Строка, Символы.ПС, ""); 
	
	//Получаем id пользователей для БП 
	ИДПостановщикаБП = АльтерраВзаимодействиеСБитрикс24.ПолучитьПользователя(Пользователи.ТекущийПользователь()).result[0].ID; 
	ИДОтветственногоБП = АльтерраВзаимодействиеСБитрикс24.ПолучитьПользователя(ОтвестсвенныйЗаБП).result[0].ID;

	ПараметрыФайлы = Новый Структура; 
    ПараметрыФайлы.Вставить("id","1111145"); //ИД папки по жалобам 
   	ПараметрыФайлы.Вставить("data",
		Новый Структура("NAME,CREATED_BY,UPDATED_BY",
			"М-15 по док: " + Объект.Номер + " (от " + ТекущаяДата() + ").xlsx", 
			ИДПостановщикаБП, 
			ИДПостановщикаБП));
    ПараметрыФайлы.Вставить("fileContent",Бэйз64Строка);
	                                                                
	//Загружаем файл на диск в папку накладных
	ИдФайла = АльтерраВзаимодействиеСБитрикс24.ЗагрузитьФайл(ПараметрыФайлы);
	КодЭлемента = "appeal_"+Формат(ТекущаяДата(), "ДФ=ddmmyyHHMMss");	       
	
	Поля = Новый Структура;   	
   // МассивИдФайлов = Новый Массив; 
	Поля.Вставить("Name", "Тест");
	Поля.Вставить("CREATED_BY", ИДПостановщикаБП);  //Автор
	Поля.Вставить("PROPERTY_3395", ИДОтветственногоБП); //Ответственный    
	Поля.Вставить("PROPERTY_4123", Объект.Номер); //Номер перемещения
	
	Поля.Вставить("PROPERTY_4124", "" + Объект.СкладОтправитель);
	Поля.Вставить("PROPERTY_4125", "" + Объект.СкладПолучатель);
	Поля.Вставить("PROPERTY_4128", "" + Объект.Ссылка);
	
	Если ЗначениеЗаполнено(ИдФайла) Тогда
		Ид = СтрЗаменить(Строка(ИдФайла.result.ID),Символы.НПП,""); 
		МассивИДФайлов = Новый Структура();
		МассивИдФайлов.Вставить("n"+Строка(1),"n" + Ид);
		//МассивИдФайлов.Вставить(Ид);
		//Поля.Вставить("PROPERTY_3394", Ид);//Накладная
		Поля.Вставить("PROPERTY_3394", МассивИДФайлов);//Накладная
	КонецЕсли;
	ПараметрыЗапроса = Новый Структура;  
	ПараметрыЗапроса.Вставить("FIELDS", Поля); 
	ПараметрыЗапроса.Вставить("IBLOCK_TYPE_ID", "lists_socnet");
	ПараметрыЗапроса.Вставить("IBLOCK_ID", "140"); //Ид списка
	
	ПараметрыЗапроса.Вставить("ELEMENT_CODE", КодЭлемента); 
                                                                            
	Ответ = АльтерраВзаимодействиеСБитрикс24.ЗапуститьБП(ПараметрыЗапроса); 
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда 
		Если Ответ.Свойство("КодСостояния") И Ответ.КодСостояния = 400 Тогда    
			ОбщегоНазначения.СообщитьПользователю("Не удалось создать БП! " + ?(Ответ.Свойство("ОписаниеОшибки") И ЗначениеЗаполнено(Ответ.ОписаниеОшибки), Ответ.ОписаниеОшибки, ""));
		ИначеЕсли Ответ.Свойство("result") Тогда
			ОбщегоНазначения.СообщитьПользователю("БП запущен!");
			АктуализироватьДанныеПоБП();
		КонецЕсли;
	КонецЕсли;
		
	УдалитьФайлы(ФайлОбработка);
	УдалитьФайлы(ФайлТабДок);
	УдалитьИзВременногоХранилища(АдресВХ);

КонецПроцедуры

Функция АктуализироватьДанныеПоБП(СообщитьОбАктуализацииДанных = Ложь)
	
	ПараметрыЗапроса = Новый Структура; 
    ПараметрыЗапроса.Вставить("IBLOCK_TYPE_ID", "lists_socnet");
	ПараметрыЗапроса.Вставить("IBLOCK_ID", 		"140");
	ПараметрыЗапроса.Вставить("FILTER", 		Новый Структура("PROPERTY_4128", "" + Объект.Ссылка));

	ТелоОтвета =  АльтерраВзаимодействиеСБитрикс24.ВыполнитьПроизвольныйЗапрос("lists.element.get", ПараметрыЗапроса, , , Истина);
	
	Если ТипЗнч(ТелоОтвета) = Тип("Строка") И ЗначениеЗаполнено(ТелоОтвета) Тогда 
		ЕстьЗапущенныеБП = СтрЧислоВхождений(ТелоОтвета, "PROPERTY_4128") > 0; // 'Ссылка на перемещение (представление)'
		ЕстьЗавершенныеБП = СтрЧислоВхождений(ТелоОтвета, "PROPERTY_4129") > 0; // 'БП завершен'
		
		Если СообщитьОбАктуализацииДанных Тогда
			ОбщегоНазначения.СообщитьПользователю("Данные по существующим БП обновлены!");
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось получить данные по существующим БП!");
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура Док_ОбновитьДанныеПоБППосле(Команда)
	АктуализироватьДанныеПоБП(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Док_БПНаВозвратМ15После(Команда)
	Если ОснованиеПодрядчику = "" Тогда 
		 Сообщить("Не заполнено основание подрядчику"); 
	 ИначеЕсли ПредставлениеПодразделения = "" Тогда 
		 Сообщить("Не заполнено представление подразделения"); 
	 ИначеЕсли ОтвестсвенныйЗаБП = Неопределено Тогда 
		 Сообщить("Не заполнен ответственный за БП"); 
	 Иначе 
		 Док_БПНаВозвратМ15ПослеНаСервере();
	 КонецЕсли; 
	 
 КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	 Если Не РезультатОтправкиВБитрикс = "" Тогда
		 Отказ = Истина;
		 РезультатОтправкиВБитрикс = "";
	 КонецЕсли;
 КонецПроцедуры

#КонецОбласти




	

