#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После ("ДобавитьКомандыСозданияНаОсновании")
Процедура Док_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПорчаТоваров) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = "ПриобретениеТоваровУслуг_ПорчаТоваров";
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ПорчаТоваров.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ПорчаТоваров);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииДополнительноКлиент.ВводНаОснованииКлиент";
	КонецЕсли;

	//Если ПравоДоступа("Добавление", Метаданные.Документы.ЛистСогласования) Тогда
	//	КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
	//	КомандаСоздатьНаОсновании.Идентификатор = "ПриобретениеТоваровУслуг_ЛистСогласования";
	//	КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЛистСогласования.ПолноеИмя();
	//	КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЛистСогласования);
	//	КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
	//	КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииДополнительноКлиент.ВводНаОснованииКлиент";
	//КонецЕсли;
	
		Документы.ЛистСогласования.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	 Если ПравоДоступа("Добавление", Метаданные.Документы.ПередачаТоваровМеждуОрганизациями) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = "ПриобретениеТоваровУслуг_ПередачаТоваровМеждуОрганизациями";
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ПередачаТоваровМеждуОрганизациями.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииДополнительноКлиент.ВводНаОснованииКлиент";
	КонецЕсли;
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаказНаДоставкуОтПоставщика) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = "ПриобретениеТоваровУслуг_ЗаказНаДоставкуОтПоставщика";
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказНаДоставкуОтПоставщика.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаказНаДоставкуОтПоставщика);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииДополнительноКлиент.ВводНаОснованииКлиент";
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаРасходыПоОбъекты(Запрос, ТекстыЗапроса, Регистры) экспорт
	
	ИмяРегистра = "РасходыПоОбъектам";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		Документы.ПриобретениеТоваровУслуг.ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&Организация КАК Организация,
	               |	&Подразделение КАК Подразделение,
	               |	ТаблицаТовары.АналитикаРасходов КАК АналитикаРасходов,
	               |	ТаблицаТовары.СтатьяРасходов КАК СтатьяРасходов,
	               |	ТаблицаТовары.ОбъектРасходов КАК ОбъектРасходов,
	               |	ТаблицаТовары.АналитикаОбъекта КАК АналитикаОбъекта,
	               |	МИНИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки,
	               |	СУММА(ТаблицаТовары.СуммаСНДС) КАК Сумма
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТовары
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ ТаблицаТовары.ОбъектРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |	И НЕ ТаблицаТовары.АналитикаОбъекта = ЗНАЧЕНИЕ(Справочник.АналитикаОбъекта.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаТовары.АналитикаРасходов,
	               |	ТаблицаТовары.СтатьяРасходов,
	               |	ТаблицаТовары.ОбъектРасходов,
	               |	ТаблицаТовары.АналитикаОбъекта";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект) экспорт
	ИмяРегистра = "ДвижениеМаркированногоТовара";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Штрихкоды.Ссылка.Склад КАК Склад,
	|	Штрихкоды.Ссылка.Организация КАК Организация,
	|	Штрихкоды.ШтрихкодУпаковки КАК Штрихкод,
	|	ШтрихкодыУпаковка.Ссылка КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.ШтрихкодыУпаковок КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.ШтрихкодУпаковки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА Штрихкоды.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|				ТОГДА ложь
	|			ИНАЧЕ истина
	|		КОНЕЦ";	
	
  	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

#Область КорректировкаДатыДокумента

Процедура РедактированиеДатыПоАналитикеРасходов(Отказ, Объект, НачалоЗаписиДокумента, РежимПроведения) Экспорт            
	
	Если Не Отказ И Не Объект.ПометкаУдаления И Не Объект.ДополнительныеСвойства.Свойство("КорректировкаДатыДокумента") Тогда           
		
		КоличествоДокументов = 1;
		
		УсловиеВыполнения = НачалоЗаписиДокумента
							Или (Объект.ДополнительныеСвойства.Свойство("НовыйДокумент")
							И Объект.ДополнительныеСвойства.НовыйДокумент); 
		
		Если УсловиеВыполнения Тогда  
			
			РезультатЗапроса = РедактированиеДатыПоАналитикеРасходов_ПолучитьВыборку(
				Истина,
				Объект.Товары.Выгрузить( , "АналитикаРасходов"), 
				Объект.ДатаСозданияДокумента);

			Пока РезультатЗапроса.Следующий() Цикл 
				Если ЗначениеЗаполнено(РезультатЗапроса.НоваяДата) Тогда
					Если РезультатЗапроса.Ссылка = Объект.Ссылка Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяДата = РезультатЗапроса.НоваяДата + КоличествоДокументов;
					
					Если ЗначениеЗаполнено(РезультатЗапроса.Ссылка) Тогда
						РедактированиеДатыПоАналитикеРасходов_СкорректироватьДатуДокумента(РезультатЗапроса.Ссылка, РезультатЗапроса.ДатаДокумента, НоваяДата);
					ИначеЕсли Объект.Дата <> НоваяДата Тогда
						Объект.Дата = НоваяДата;
						Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда 
							РежимПроведения = РежимПроведенияДокумента.Неоперативный;        
						КонецЕсли;
					КонецЕсли;
						
					КоличествоДокументов = КоличествоДокументов + 1;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Не Объект.ДополнительныеСвойства.НовыйДокумент Тогда       
			
			РезультатЗапроса = РедактированиеДатыПоАналитикеРасходов_ПолучитьВыборку(
				НачалоЗаписиДокумента,
				Объект.Ссылка, 
				Дата(1, 1, 1));
				
			Пока РезультатЗапроса.Следующий() Цикл 
				Если ЗначениеЗаполнено(РезультатЗапроса.Ссылка) И ЗначениеЗаполнено(РезультатЗапроса.НоваяДата) Тогда
					РедактированиеДатыПоАналитикеРасходов_СкорректироватьДатуДокумента(РезультатЗапроса.Ссылка, РезультатЗапроса.ДатаДокумента, РезультатЗапроса.НоваяДата + КоличествоДокументов);
					КоличествоДокументов = КоличествоДокументов + 1;
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция РедактированиеДатыПоАналитикеРасходов_ПолучитьВыборку(НачалоЗаписиДокумента, Данные, ДатаСозданияДокумента)            
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСозданияДокумента", ДатаСозданияДокумента);

	Если НачалоЗаписиДокумента Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Товары.АналитикаРасходов КАК АналитикаРасходов
			|ПОМЕСТИТЬ ВТТовары
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Товары.АналитикаРасходов КАК Ссылка
			|ПОМЕСТИТЬ ВТОтборПоАналитике
			|ИЗ
			|	ВТТовары КАК Товары
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(Товары.АналитикаРасходов) = ТИП(Документ.ПриобретениеТоваровУслуг)
			|	И Товары.АналитикаРасходов <> ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
			|	И НЕ Товары.АналитикаРасходов.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	Товары.АналитикаРасходов.Дата Убыв";
		
		Запрос.УстановитьПараметр("Товары", Данные);
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ
			|	&Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТОтборПоАналитике";
		
		Запрос.УстановитьПараметр("Ссылка", Данные);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " ; " +
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	Товары.АналитикаРасходов.Дата КАК АналитикаРасходовДата
		|ПОМЕСТИТЬ ВТПриобретения
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПоАналитике КАК ОтборПоАналитике
		|		ПО Товары.АналитикаРасходов = ОтборПоАналитике.Ссылка
		|ГДЕ
		|	НЕ Товары.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Ссылка,
		|	Товары.АналитикаРасходов.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	Товары.Ссылка.Дата КАК Дата,
		|	Товары.Ссылка.ДатаСозданияДокумента КАК ДатаСозданияДокумента,
		|	МИНИМУМ(Товары.АналитикаРасходов.Дата) КАК НоваяДата
		|ПОМЕСТИТЬ ВТИтог
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриобретения КАК Приобретения
		|		ПО Товары.Ссылка = Приобретения.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Товары.АналитикаРасходов) = ТИП(Документ.ПриобретениеТоваровУслуг)
		|	И Товары.АналитикаРасходов <> ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Ссылка,
		|	Товары.Ссылка.Дата,
		|	Товары.Ссылка.ДатаСозданияДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	&ДатаСозданияДокумента,
		|	ОтборПоАналитике.Ссылка.Дата
		|ИЗ
		|	ВТОтборПоАналитике КАК ОтборПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Результат.Ссылка КАК Ссылка,
		|	Результат.Дата КАК ДатаДокумента,
		|	Результат.НоваяДата КАК НоваяДата
		|ИЗ
		|	ВТИтог КАК Результат
		|ГДЕ
		|	(Результат.НоваяДата В
		|			(ВЫБРАТЬ
		|				ВТПриобретения.АналитикаРасходовДата
		|			ИЗ
		|				ВТПриобретения)
		|		ИЛИ Результат.Ссылка ЕСТЬ NULL)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Результат.ДатаСозданияДокумента";
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Процедура РедактированиеДатыПоАналитикеРасходов_СкорректироватьДатуДокумента(Ссылка, ДатаДокумента, НоваяДата)            
	
	Если ДатаДокумента <> НоваяДата Тогда
		 
		Объект_ = Ссылка.ПолучитьОбъект();
		Объект_.Дата = НоваяДата;
		Для каждого Строка Из Объект_.ЭтапыГрафикаОплаты Цикл
			Строка.ДатаПлатежа = НоваяДата+24*60*60; 
		КонецЦикла;
			
		Попытка
			Объект_.ДополнительныеСвойства.Вставить("КорректировкаДатыДокумента", Истина);
			Объект_.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначения.СообщитьПользователю("Дата и время по документу '" + Ссылка + "' скорректированы на " + НоваяДата, Ссылка);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось записать документ: " + Ссылка, Ссылка);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
