#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	Для Каждого ТекСтрока Из Товары Цикл
		ТекСтрока.Кладовщик = "";
	КонецЦикла;
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	                 
	Если ЭтоНовый() Тогда
		ДатаСозданияДокумента = ТекущаяДата();
		ДополнительныеСвойства.Вставить("НовыйДокумент", Истина);
	Иначе
		ДополнительныеСвойства.Вставить("НовыйДокумент", Ложь);
	КонецЕсли;
	
	Документы.ПриобретениеТоваровУслуг.РедактированиеДатыПоАналитикеРасходов(Отказ, ЭтотОбъект, Истина, РежимПроведения);
	
	Если Не РольДоступна("ПолныеПрава") И ЭтотОбъект.ПометкаУдаления И НЕ Ссылка.ПометкаУдаления Тогда
  		ПроверитьЧтоНетПриходныхОрдеровНаТовары(Отказ);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказПоставщику) Тогда
	    Если ЭтотОбъект.ВариантПриемкиТоваров <> ЭтотОбъект.ЗаказПоставщику.ВариантПриемкиТоваров Тогда
	        ЭтотОбъект.ВариантПриемкиТоваров = ЭтотОбъект.ЗаказПоставщику.ВариантПриемкиТоваров;
	    КонецЕсли;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Склад) И
		Склад.ОтправкаУведомлений = Истина Тогда
		
		СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
		
		Если ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И 
			Склад.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) Тогда
			
				Если Склад.ТипСкладаПодрядчика Тогда 
			    	Сообщить("Нельзя приобретать ТМЦ на основной склад подрядчика, обратитесь в бухгалтерию"); 
					Отказ = Истина;
				Иначе
					ДополнительныеСвойства.Вставить("УсловиеПоПодрядчику", Истина);
				КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	КорректировкаИнформацииПоТН(Отказ);
	
КонецПроцедуры

Процедура КорректировкаИнформацииПоТН(Отказ) 
	
	Если Не Отказ Тогда
		Если СтрНайти(НРег(СтрЗаменить(Партнер.Наименование, " ", "")), "транспортныерасходы") <> 0 ИЛИ
			СтрНайти(НРег(СтрЗаменить(Контрагент.Наименование, " ", "")), "транспортныерасходы") <> 0  Тогда
			
			Если Не АльтерраОбщегоНазначения._ЕстьРоль("ПриобретениеТоваровУслуг_КорректировкаТН") И
				(ТНВСоставеДокументовНаТовар <> Ссылка.ТНВСоставеДокументовНаТовар ИЛИ 
				ТННекорректноеОформление <> Ссылка.ТННекорректноеОформление ИЛИ
				СокрЛП(ТНКомментарий) <> СокрЛП(Ссылка.ТНКомментарий)) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет прав для редактирования информации по ТН!",,,,Отказ);
			КонецЕсли;
		Иначе
			ТНВСоставеДокументовНаТовар = Ложь;
			ТННекорректноеОформление = Ложь;
			ТНКомментарий = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	Документы.РейсОтПоставщика.ПроверитьЧтоНетРейсовИлиЗаказовНаДоставку(ЭтотОбъект, Отказ);
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТЧ из Товары Цикл  
		
		Если НЕ СтрокаТЧ.ОбъектРасходов.Пустая() И СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Нельзя по строке реквизит ""Объект расходов"" заполнить, а ""Аналитика объекта"" нет. Исправьте или очистите значения этих реквизитов в строке",
				, 
				"Объект.Товары[" + (СтрокаТЧ.НомерСтроки - 1) + "].АналитикаОбъекта");
				
			Отказ = Истина;
		ИначеЕсли СтрокаТЧ.ОбъектРасходов.Пустая() И НЕ СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Нельзя по строке реквизит ""Аналитика объекта"" заполнить, а ""Объект расходов"" нет. Исправьте или очистите значения этих реквизитов в строке",
				, 
				"Объект.Товары[" + (СтрокаТЧ.НомерСтроки - 1) + "].ОбъектРасходов");
				
			Отказ = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не Отказ Тогда
		Если ДополнительныеСвойства.Свойство("УсловиеПоПодрядчику") Тогда
			ОтправкаУведомленийПодрядчику();                                 
		КонецЕсли;
		
		Документы.ПриобретениеТоваровУслуг.РедактированиеДатыПоАналитикеРасходов(Отказ, ЭтотОбъект, Ложь, РежимПроведения); 
	КонецЕсли;
КонецПроцедуры

Процедура ОтправкаУведомленийПодрядчику()
	
	ПовторнаяОтправка = Ложь; 
	УведомлениеОтправлено = Ложь; 
	
	Запрос = Новый Запрос; 
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РС.Документ КАК Документ,
		|	ВЫБОР
		|		КОГДА РС.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПовторнаяОтправка,
		|	ВЫБОР
		|		КОГДА РС.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияДокументов.УведомлениеПодрядчику)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК УведомлениеОтправлено
		|ИЗ
		|	РегистрСведений.СобытияДокументовАльтерра.СрезПоследних(, ) КАК РС
		|ГДЕ
		|	РС.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ПовторнаяОтправка Тогда
			ПовторнаяОтправка = Истина;
		КонецЕсли;
		Если Выборка.УведомлениеОтправлено Тогда
			УведомлениеОтправлено = Истина; 
		КонецЕсли;
	КонецЦикла;    
	
	Если Не УведомлениеОтправлено Тогда 
		ОтправитьСМСиEmail(Ложь);
	ИначеЕсли ПовторнаяОтправка Тогда 
		ОтправитьСМСиEmail(Истина);			
	КонецЕсли;
		
КонецПроцедуры

Процедура ОтправитьСМСиEmail(ПовторноеПеремещениеНаТранзитПоставщика)

	Если ДополнительныеСвойства.НовыйДокумент Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ должен быть записан!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		ОбщегоНазначения.СообщитьПользователю("Номер документа должен быть указан!");
		Возврат;
	КонецЕсли;
	
	ФайлОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатные формы перемещения", Истина);
	Если Не ЗначениеЗаполнено(ФайлОбработка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка! Не найдена доп. обработка 'Печатные формы перемещения'..");
		Возврат;
	Иначе
		ФайлОбработка2 = ФайлОбработка;
	КонецЕсли;
	
	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(Склад); 
	МассивСкладов.Добавить(Склад.ДопСкладПодрядчика);	
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВыводитьСумму", Истина);
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Ссылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(Ссылка);
	
	ДвоичныеДанные = ФайлОбработка.ХранилищеОбработки.Получить();
	ФайлОбработка = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ФайлОбработка);
	
	ДвоичныеДанные2 = ФайлОбработка2.ХранилищеОбработки.Получить();
	ФайлОбработка2 = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные2.Записать(ФайлОбработка2);
	
	СуммаИтог = 0;
	ТабличныйДокумент = ВнешниеОбработки.Создать(ФайлОбработка).СформироватьПечатнуюФормуНакладнаяНаПриобретениеПодрядчику(МассивДокументов, ОбъектыПечати, ПараметрыПечати, СуммаИтог);
	ФайлТабДок = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ФайлТабДок, ТипФайлаТабличногоДокумента.XLSX);
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТабДок));
	
	ТабличныйДокумент2 = ВнешниеОбработки.Создать(ФайлОбработка2).СформироватьПечатнуюФормуВедомостьОстатковНаСкладахСПриобретением(Ссылка, МассивСкладов, "1");	
	ФайлТабДок2 = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент2.Записать(ФайлТабДок2, ТипФайлаТабличногоДокумента.XLSX);
	АдресВХ2 = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТабДок2));

	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище","Ведомость по остаткам на складе" + ".xlsx", АдресВХ2));
	
	УведомленияПодрядчикуПочта = Склад.EMAILподрядчика;
	
	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("Кому", УведомленияПодрядчикуПочта);

	Если ПовторноеПеремещениеНаТранзитПоставщика Тогда 
		МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище", "Изменение приобретения ТМЦ на " + Склад + " "+ номер +  ".xlsx", АдресВХ));
		ПараметрыОтправки.Вставить("Тема", "Альтерра изменение приобретения ТМЦ на " + Склад);
		ПараметрыОтправки.Вставить("Тело", "На вашем складе '" + Склад + "' " + ТекущаяДата() + " изменился состав перемещения ТМЦ №" + Номер + " новая сумма по документу: " + СуммаИтог +  "руб. Документы прилагаются.");
	Иначе
		МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище", "Поступление ТМЦ на " + Склад + " "+ номер +  ".xlsx", АдресВХ));
		ПараметрыОтправки.Вставить("Тема", "Альтерра приобретение ТМЦ на " + Склад);
		ПараметрыОтправки.Вставить("Тело", "На ваш склад '" + Склад + " от "+ ТекущаяДата() + "' сделано приобретение на сумму " + СуммаИтог + "₽. ТМЦ №" + Номер + ". Документы прилагаются.");
	КонецЕсли;

	ПараметрыОтправки.Вставить("Кодировка", КодировкаТекста.UTF8);
	ПараметрыОтправки.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыОтправки.Вставить("Вложения", МассивФайлов);
	
	РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
	
	ДопПочта = Склад.ДопEMAILподрядчика;	
	Если ЗначениеЗАполнено(ДопПочта) Тогда 
		ПараметрыОтправки.Кому = ДопПочта; 
		РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
	КонецЕслИ; 
	
	Если ЗначениеЗаполнено(РезультатОтправкиEmail) И ТипЗнч(РезультатОтправкиEmail) = Тип("Строка") Тогда	
		НомерТелефонаПартнера = АльтерраОбщегоНазначения.ПолчитьТелефонБезКода(Склад.ТелефонПодрядчика);
		Если СтрДлина(НомерТелефонаПартнера) = 10 Тогда
			
			СтрокаНомерТелефона = "+7" + Строка(НомерТелефонаПартнера);
			СтатусОшибки = Ложь;

			Если ПовторноеПеремещениеНаТранзитПоставщика Тогда 
				АльтерраОбщегоНазначения.ОтправитьСМС(СтрокаНомерТелефона, "Изм. по док " + Номер + " на скл '" + Склад + "' нов. сумма " + СуммаИтог +  "р. Отпр. '" + УведомленияПодрядчикуПочта + "'", СтатусОшибки);
			Иначе
				АльтерраОбщегоНазначения.ОтправитьСМС(СтрокаНомерТелефона, "На скл '" + Склад + " поступили ТМЦ по док " + Номер + " на " +СуммаИтог + "₽. Отпр.'" + УведомленияПодрядчикуПочта + "'", СтатусОшибки);
			КонецЕсли;
				
			Если Не СтатусОшибки Тогда
				ОбщегоНазначения.СообщитьПользователю("Сообщения на E-mail адрес и телефон успешно отправлены!");
			Иначе 
				ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на телефон. На E-mail адрес сообщение успешно отправлено!");
			КонецЕсли;
		Иначе 
			ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на телефон. На E-mail адрес сообщение успешно отправлено!");
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на E-mail адрес..");
	КонецЕсли;
	
	УдалитьФайлы(ФайлОбработка2);
	УдалитьФайлы(ФайлТабДок2);
	УдалитьИзВременногоХранилища(АдресВХ2);

	УдалитьФайлы(ФайлОбработка);
	УдалитьФайлы(ФайлТабДок);
	УдалитьИзВременногоХранилища(АдресВХ);
	
	Если ПовторноеПеремещениеНаТранзитПоставщика Тогда 
		НаборЗаписей = РегистрыСведений.СобытияДокументовАльтерра.СоздатьМенеджерЗаписи();
		НаборЗаписей.Период = дата;
		НаборЗаписей.Документ = Ссылка;
		НаборЗаписей.Событие = Перечисления.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику;
		НаборЗаписей.Прочитать();
		НаборЗаписей.Удалить();

		События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
		События.Отбор.Документ.Установить(Ссылка); 
		События.Отбор.Событие.Установить(Перечисления.СобытияДокументов.УведомлениеПодрядчикуВысланоПовторно); 

		НовоеСобытие = События.Добавить();
		НовоеСобытие.Документ = Ссылка;
		НовоеСобытие.Событие = Перечисления.СобытияДокументов.УведомлениеПодрядчикуВысланоПовторно;
		НовоеСобытие.Период = ТекущаяДата(); 
		События.Записать();
	Иначе
    	События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
		События.Отбор.Документ.Установить(Ссылка); 
		События.Отбор.Событие.Установить(Перечисления.СобытияДокументов.УведомлениеПодрядчику); 
			
		НовоеСобытие = События.Добавить();
		НовоеСобытие.Документ = Ссылка;
		НовоеСобытие.Событие = Перечисления.СобытияДокументов.УведомлениеПодрядчику;
		НовоеСобытие.Период = ТекущаяДата(); 
		События.Записать();
	КонецЕсли;
КонецПроцедуры	

#Область Проверки

Процедура ПроверитьЧтоНетПриходныхОрдеровНаТовары(Отказ)

	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение
		|   И ПриходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
		|   И ПриходныйОрдерНаТовары.Проведен = Истина";
	
	Запрос.УстановитьПараметр("Распоряжение", ЗаказПоставщику);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщить("Существуют принятые складские ордера. Удалять документ запрещено!");
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			АльтерраОбщегоНазначения.СообщитьПользователю(Выборка.Ссылка, Строка(Выборка.Ссылка));
		КонецЦикла;

		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	Если Не Отказ И ПометкаУдаления И Не ОбменДанными.Загрузка Тогда 
		Документы.КорректировкаПриобретения.ОтправитьИнформациюВЧат_ИзменениеПриходныхДокументовВЗакрытомПериоде(
			Организация, 
			Дата, 
			"Удален документ " + Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
