#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("ЗаполнитьРеквизитыПодвалаУПД")
Процедура Док_ЗаполнитьРеквизитыПодвалаУПД(ОбластьПодвала, ДанныеПечати, СведенияОбОрганизации, ДанныеКонтрагентов)

	ОбластьПодвала.Параметры.Заполнить(ДанныеПечати);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ФИОРуководителя", ДанныеПечати.Руководитель);
	Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураПараметров.Вставить("ФИОРуководителяОрганизации", ДанныеПечати.Руководитель);
		СтруктураПараметров.Вставить("ФИОГлавногоБухгалтера", ДанныеПечати.ГлавныйБухгалтер);
	Иначе
		СтруктураПараметров.Вставить("ФИОПБОЮЛ", ДанныеПечати.Руководитель);
		СтруктураПараметров.Вставить("Свидетельство", СведенияОбОрганизации.Свидетельство);
	КонецЕсли;

	СтруктураПараметров.Вставить("ФИОКладовщика", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Кладовщик, ДанныеПечати.Дата));
	СтруктураПараметров.Вставить("ДолжностьКладовщика", ДанныеПечати.ДолжностьКладовщика);

	ПолнаяДатаДокумента = СтрЗаменить(Формат(ДанныеПечати.Дата, "ДЛФ=DD"),НСтр("ru = 'г.'", Метаданные.Языки.Русский.КодЯзыка),"");
	ДлинаСтроки = СтрДлина(ПолнаяДатаДокумента);
	ПозицияРазделителя = СтрНайти(ПолнаяДатаДокумента, " ");
	ПредставлениеДаты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='""%1"" %2года'", Метаданные.Языки.Русский.КодЯзыка),
	Лев(ПолнаяДатаДокумента, ПозицияРазделителя -1),
	Прав(ПолнаяДатаДокумента, ДлинаСтроки - ПозицияРазделителя));

	СтруктураПараметров.Вставить("ДатаДокумента", ПредставлениеДаты);

	ИННПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ИНН,", Ложь); 
	#Удаление
	Если ЗначениеЗаполнено(СведенияОбОрганизации.КПП) Тогда
	#КонецУдаления
	#Вставка
	Если ЗначениеЗаполнено(ДанныеПечати.КПППоставщика) Тогда
	#КонецВставки
		#Удаление
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'", Метаданные.Языки.Русский.КодЯзыка),
			СведенияОбОрганизации.ПолноеНаименование,
			ИННПоставщика,
			СведенияОбОрганизации.КПП);
		#КонецУдаления
		#Вставка
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'", Метаданные.Языки.Русский.КодЯзыка),
		СведенияОбОрганизации.ОфициальноеНаименование,
		ИННПоставщика,
		ДанныеПечати.КПППоставщика);
		#КонецВставки
	ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
		#Удаление
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'", Метаданные.Языки.Русский.КодЯзыка),
		СведенияОбОрганизации.ПолноеНаименование,
		ИННПоставщика);
		#КонецУдаления
		#Вставка
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'", Метаданные.Языки.Русский.КодЯзыка),
		СведенияОбОрганизации.ОфициальноеНаименование,
		ИННПоставщика);
		#КонецВставки
	Иначе
		#Удаление
		ПредставлениеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		#КонецУдаления
		#Вставка
		ПредставлениеОрганизации = СведенияОбОрганизации.ОфициальноеНаименование;
		#КонецВставки
	КонецЕсли;
	СтруктураПараметров.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);

	ТаблицаКонтрагентов = ТаблицаКонтрагентовСчетаФактуры(ДанныеПечати, ДанныеКонтрагентов);
	ПредставлениеКонтрагента    = "";

	Для Каждого СтрокаТаблицы Из ТаблицаКонтрагентов Цикл
		СведенияОПокупателе = СтрокаТаблицы.СведенияОПокупателе;
		ПолноеНаименование = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование", Ложь);
		ИННПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ИНН", Ложь);
		Если Не ПустаяСтрока(СтрокаТаблицы.КПП) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1; %2, ИНН/КПП %3/%4'", Метаданные.Языки.Русский.КодЯзыка),
			ПредставлениеКонтрагента,
			ПолноеНаименование,
			ИННПокупателя,
			СтрокаТаблицы.КПП);
		ИначеЕсли ЗначениеЗаполнено(ИННПокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1; %2, ИНН %3'", Метаданные.Языки.Русский.КодЯзыка),
			ПредставлениеКонтрагента,
			ПолноеНаименование,
			ИННПокупателя);
		Иначе
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1; %2'"),
			ПредставлениеКонтрагента,
			ПолноеНаименование);
		КонецЕсли;

	КонецЦикла;
	СтруктураПараметров.Вставить("ПредставлениеКонтрагента", Сред(ПредставлениеКонтрагента, 3));
	
	#Удаление
	Если ЗначениеЗаполнено(ДанныеПечати.ДоверенностьНомер) И ЗначениеЗаполнено(ДанныеПечати.ДоверенностьДата)
		И (ЗначениеЗаполнено(ДанныеПечати.ДоверенностьВыдана) Или ЗначениеЗаполнено(ДанныеПечати.ДоверенностьЛицо)) Тогда

		ТекстОснования = СокрЛП(ДанныеПечати.Основание) + "; "
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'по доверенности №%1 от %2, выданной %3 %4'", Метаданные.Языки.Русский.КодЯзыка),
		ДанныеПечати.ДоверенностьНомер,
		Формат(ДанныеПечати.ДоверенностьДата, "ДЛФ=DD"),
		ДанныеПечати.ДоверенностьВыдана,
		ДанныеПечати.ДоверенностьЛицо);
		СтруктураПараметров.Вставить("Основание", ТекстОснования);

	КонецЕсли;

	ОбластьПодвала.Параметры.Заполнить(СтруктураПараметров);
	#КонецУдаления
	#Вставка
	//Альтерра+
	//Измененная область
	ТекстОснования = "";
	Если ЗначениеЗаполнено(ДанныеПечати.ДоверенностьНомер) И ЗначениеЗаполнено(ДанныеПечати.ДоверенностьДата)
		И (ЗначениеЗаполнено(ДанныеПечати.ДоверенностьВыдана) Или ЗначениеЗаполнено(ДанныеПечати.ДоверенностьЛицо)) Тогда
		ТекстОснования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'по доверенности №%1 от %2, выданной %3 %4'",  Метаданные.Языки.Русский.КодЯзыка),
				ДанныеПечати.ДоверенностьНомер,
				Формат(ДанныеПечати.ДоверенностьДата, "ДЛФ=DD"),
				ДанныеПечати.ДоверенностьВыдана,
				ДанныеПечати.ДоверенностьЛицо);	
	КонецЕсли;
	СтруктураПараметров.Вставить("Основание", ТекстОснования);
	//КонецИзменений	
	ОбластьПодвала.Параметры.Заполнить(СтруктураПараметров);
	#КонецВставки

КонецПроцедуры

&Перед("ЗаполнитьРеквизитыСтрокиТовара")
Процедура Док_ЗаполнитьРеквизитыСтрокиТовара1(СтрокаТовары, ОбластьМакета, НомерСтроки, ВыводитьКодНоменклатуры, ВыводитьКодТНВД, ВыводитьСерии, СчетФактураНаАванс)
	Если СтрокаТовары.Ссылка.Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		_ВыводитьКодНоменклатуры = Истина;
	Иначе
		_ВыводитьКодНоменклатуры = Ложь;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьРеквизитыШапкиУКД")
Процедура Док_ЗаполнитьРеквизитыШапкиУКД1(ДанныеПечати, ДанныеОснований, СведенияОПоставщике, СведенияОПокупателе, ДанныеПоставщиков, Макет, ТабличныйДокумент, ОпцииПечати)

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокДокумента");

	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета,
	ДанныеПечати.Ссылка);

	НомераДаты = Новый Структура("Номер, Дата, НомерИсправления, ДатаИсправления, НомерСчетаФактуры, ДатаСчетаФактуры, НомерИсправленияСчетаФактуры, ДатаИсправленияСчетаФактуры, НомерИсправленияКорректировочного, ДатаИсправленияКорректировочного");

	#Удаление
	Если ОпцииПечати.НомерСформированВСчетеФактуре Тогда
		НомераДаты.Номер = ДанныеПечати.Номер;
	Иначе
		НомераДаты.Номер = НомерСчетаФактурыНаПечать(ДанныеПечати.Номер, ДанныеПечати.ИндексПодразделения);
	КонецЕсли;
	#КонецУдаления
	#Вставка
	НомераДаты.Номер = НомерСчетаФактурыНаПечать(ДанныеПечати.Номер, ДанныеПечати.ИндексПодразделения); 
	#КонецВставки
	НомераДаты.Дата  = Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");

	Если ДанныеПечати.Исправление Тогда
		Если ОпцииПечати.ИспользоватьПечатныеФормыСФ2_5 Тогда
			НомераДаты.НомерИсправленияКорректировочного = ДанныеПечати.НомерИсправления;
			НомераДаты.ДатаИсправленияКорректировочного  = Формат(ДанныеПечати.ДатаИсправления, "ДЛФ=ДД; ДП=--");
		Иначе
			НомераДаты.НомерИсправления = ДанныеПечати.НомерИсправления;
			НомераДаты.ДатаИсправления  = Формат(ДанныеПечати.ДатаИсправления, "ДЛФ=ДД; ДП=--");
		КонецЕсли;
	Иначе
		Если ОпцииПечати.ИспользоватьПечатныеФормыСФ2_5 Тогда
			НомераДаты.НомерИсправленияКорректировочного = "--";
			НомераДаты.ДатаИсправленияКорректировочного  = "--";
		Иначе
			НомераДаты.НомерИсправления = "--";
			НомераДаты.ДатаИсправления  = "--";
		КонецЕсли;
	КонецЕсли;

	Если ОпцииПечати.ДействующиеПостановления.Постановление2026 Тогда 
		НомераДаты.Вставить("НомерПостановления", УчетНДСПереопределяемый.НомерПостановления2026());
		НомераДаты.Вставить("ДатаПостановления", УчетНДСПереопределяемый.ДатаПостановления2026());
	КонецЕсли;

	ОбластьМакета.Параметры.Заполнить(НомераДаты);
	ТабличныйДокумент.Вывести(ОбластьМакета);

	СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
	ДанныеОснований.НайтиСледующий(СтруктураПоиска);
	СтрокиОснований = ДанныеОснований.Выбрать();

	Если СтрокиОснований.Количество() > 1 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОснований");
		РеквизитыОснований = "";
		Пока СтрокиОснований.Следующий() Цикл
			СтрокаИсправлениеСФ = "";
			Если ЗначениеЗаполнено(СтрокиОснований.НомерИсправленияСчетаФактуры) Тогда
				СтрокаИсправлениеСФ = ", с учетом исправления № "
				+ СтрокиОснований.НомерИсправленияСчетаФактуры 
				+ " от " 
				+ Формат(СтрокиОснований.ДатаИсправленияСчетаФактуры, "ДЛФ=ДД; ДП=--"); 
			КонецЕсли;
			
			#Удаление
			Если ОпцииПечати.НомерСформированВСчетеФактуре Тогда
				НомерСчетаФактурыБезПрефикса = СтрокиОснований.НомерСчетаФактуры;
			Иначе
				НомерСчетаФактурыБезПрефикса = НомерСчетаФактурыНаПечать(СтрокиОснований.НомерСчетаФактуры, ДанныеПечати.ИндексПодразделения);
			КонецЕсли;
			#КонецУдаления
			#Вставка
			НомерСчетаФактурыБезПрефикса = НомерСчетаФактурыНаПечать(СтрокиОснований.НомерСчетаФактуры, ДанныеПечати.ИндексПодразделения, Истина);
			#КонецВставки

			РеквизитыОснований = ?(РеквизитыОснований = "", РеквизитыОснований,РеквизитыОснований + ", ") 
			+ "№ " 
			+ НомерСчетаФактурыБезПрефикса 
			+ " от " 
			+ Формат(СтрокиОснований.ДатаСчетаФактуры, "ДЛФ=ДД; ДП=--") 
			+ СтрокаИсправлениеСФ;

		КонецЦикла;
		ОбластьМакета.Параметры.РеквизитыОснований = РеквизитыОснований;
	ИначеЕсли СтрокиОснований.Следующий() И ЗначениеЗаполнено(СтрокиОснований.НомерСчетаФактуры) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОснования");
		#Удаление
		Если ОпцииПечати.НомерСформированВСчетеФактуре Тогда
			НомерСчетаФактурыБезПрефикса = СтрокиОснований.НомерСчетаФактуры;
		Иначе
			НомерСчетаФактурыБезПрефикса = НомерСчетаФактурыНаПечать(СтрокиОснований.НомерСчетаФактуры, ДанныеПечати.ИндексПодразделения);
		КонецЕсли;
		#КонецУдаления
		#Вставка
		НомерСчетаФактурыБезПрефикса = НомерСчетаФактурыНаПечать(СтрокиОснований.НомерСчетаФактуры, ДанныеПечати.ИндексПодразделения, Истина);
		#КонецВставки
		Если ОпцииПечати.ИспользоватьПечатныеФормыСФ2_5 Тогда
			ОбластьМакета.Параметры.НомерОснования = НомерСчетаФактурыБезПрефикса;
			ОбластьМакета.Параметры.ДатаОсновнания = Формат(СтрокиОснований.ДатаСчетаФактуры,"ДЛФ=ДД; ДП=--");
			ОбластьМакета.Параметры.НомерИсправленияОснования = ?(ЗначениеЗаполнено(СтрокиОснований.НомерИсправленияСчетаФактуры),
			СтрокиОснований.НомерИсправленияСчетаФактуры, "--");
			ОбластьМакета.Параметры.ДатаИсправленияОснования = Формат(СтрокиОснований.ДатаИсправленияСчетаФактуры, "ДЛФ=ДД; ДП=--");
		Иначе
			ОбластьМакета.Параметры.НомерСчетаФактуры = НомерСчетаФактурыБезПрефикса;
			ОбластьМакета.Параметры.ДатаСчетаФактуры = Формат(СтрокиОснований.ДатаСчетаФактуры,"ДЛФ=ДД; ДП=--");
			ОбластьМакета.Параметры.НомерИсправленияСчетаФактуры = ?(ЗначениеЗаполнено(СтрокиОснований.НомерИсправленияСчетаФактуры),
			СтрокиОснований.НомерИсправленияСчетаФактуры, "--");
			ОбластьМакета.Параметры.ДатаИсправленияСчетаФактуры = Формат(СтрокиОснований.ДатаИсправленияСчетаФактуры, "ДЛФ=ДД; ДП=--");
		КонецЕсли;
	Иначе
		Если ОпцииПечати.ИспользоватьПечатныеФормыСФ2_5 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОснования");
			ОбластьМакета.Параметры.НомерОснования            = "--";
			ОбластьМакета.Параметры.ДатаОсновнания             = "--";
			ОбластьМакета.Параметры.НомерИсправленияОснования = "--";
			ОбластьМакета.Параметры.ДатаИсправленияОснования  = "--";
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОснования");
			ОбластьМакета.Параметры.НомерСчетаФактуры            = "--";
			ОбластьМакета.Параметры.ДатаСчетаФактуры             = "--";
			ОбластьМакета.Параметры.НомерИсправленияСчетаФактуры = "--";
			ОбластьМакета.Параметры.ДатаИсправленияСчетаФактуры  = "--";
		КонецЕсли;
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");

	ПараметрыШапки = Новый Структура;
	ПараметрыШапки.Вставить("СтатусУКД", ДанныеПечати.СтатусУПД);

	// Выводим данные о поставщике.
	#Удаление
	Если ДанныеПоставщиков = Неопределено Тогда
		ПараметрыШапки.Вставить("ПредставлениеПоставщика", СведенияОПоставщике.ПолноеНаименование);
	#КонецУдаления
		#Вставка
		ПараметрыШапки.Вставить("ПредставлениеПоставщика", СведенияОПоставщике.ОфициальноеНаименование);
		#КонецВставки
		ПараметрыШапки.Вставить("АдресПоставщика",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес"));

		ПараметрыШапки.Вставить("ИННПоставщика",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН", Ложь)
		+ ?(Не ПустаяСтрока(ДанныеПечати.КПППоставщика), "/" + ДанныеПечати.КПППоставщика, ""));
	#Удаление
	Иначе
	
		ПредставлениеПоставщика       = "";
		ПредставлениеАдресПоставщика = "";
		ПредставлениеИННПоставщика = "";
		
		Если ДанныеПечати.Исправление Тогда
			ДатаСведений = ДанныеПечати.ДатаИсправления;
		Иначе
			ДатаСведений = ДанныеПечати.Дата;
		КонецЕсли;
		
		ТаблицаПоставщиков = ТаблицаПоставщиковСчетаФактуры(ДанныеПечати, ДанныеПоставщиков, ДатаСведений);
		Для Каждого СтрокаТаблицы Из ТаблицаПоставщиков Цикл
			
			СведенияОПоставщикеВрем = СтрокаТаблицы.СведенияОПоставщике;
			
			ПредставлениеПоставщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1; %2'"),
				ПредставлениеПоставщика,
				ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщикеВрем, "ПолноеНаименование", Ложь));
			
			ПредставлениеАдресПоставщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1; %2'"),
				ПредставлениеАдресПоставщика,
				ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщикеВрем, "ЮридическийАдрес", Ложь));
				
			ПредставлениеИННПоставщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1; %2%3'"),
				ПредставлениеИННПоставщика,
				СтрокаТаблицы.ИНН,
				?(Не ПустаяСтрока(СтрокаТаблицы.КПП), "/" + СтрокаТаблицы.КПП, ""));
			
		КонецЦикла;
		
		ПредставлениеПоставщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1'"),  Сред(ПредставлениеПоставщика, 3));
		
		ПредставлениеАдресПоставщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1'"), Сред(ПредставлениеАдресПоставщика, 3));
		
		ПредставлениеИННПоставщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1'"), Сред(ПредставлениеИННПоставщика, 3));

		ПараметрыШапки.Вставить("ПредставлениеПоставщика", ПредставлениеПоставщика);
		ПараметрыШапки.Вставить("АдресПоставщика", ПредставлениеАдресПоставщика);
		ПараметрыШапки.Вставить("ИННПоставщика", ПредставлениеИННПоставщика);
	
	КонецЕсли;
	#КонецУдаления
	
	ПараметрыШапки.Вставить("ПредставлениеПокупателя",
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование", Ложь));
	ПараметрыШапки.Вставить("АдресПокупателя",
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес", Ложь));

	КПППокупателя = ?(ПустаяСтрока(ДанныеПечати.КПППокупателя),СведенияОПокупателе.КПП, ДанныеПечати.КПППокупателя);
	ПараметрыШапки.Вставить("ИННПокупателя",
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь)
	+ ?(Не ПустаяСтрока(КПППокупателя), "/" + КПППокупателя, ""));

	ПараметрыШапки.Вставить("Валюта", НСтр("ru='Российский рубль, 643'", Метаданные.Языки.Русский.КодЯзыка));

	СтруктураПараметровИдентификаторГосКонтракта = Новый Структура("ИдентификаторГосКонтракта");
	ЗаполнитьЗначенияСвойств(СтруктураПараметровИдентификаторГосКонтракта, ДанныеПечати);
	ПараметрыШапки.Вставить("ИдентификаторГосКонтракта", СтруктураПараметровИдентификаторГосКонтракта.ИдентификаторГосКонтракта);

	ОбластьМакета.Параметры.Заполнить(ПараметрыШапки);
	
	#Вставка
	Если ДанныеПечати.Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ОбластьМакета.Параметры.СтатусУКД= 1;
	Иначе
		ОбластьМакета.Параметры.СтатусУКД= 2;
	КонецЕсли;
	#КонецВставки
	ТабличныйДокумент.Вывести(ОбластьМакета);

	Если ОпцииПечати.ИспользоватьПечатныеФормыСФ2_5 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
		ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтруктураПараметровИдентификаторГосКонтракта.ИдентификаторГосКонтракта;
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;

КонецПроцедуры

#КонецЕсли



