#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Отказ И Статус = Перечисления.СтатусыАктаОРасхождениях.Отработано И Не ЗначениеЗаполнено(ДатаОтработки) Тогда
		ДатаОтработки = ТекущаяДата();
	КонецЕсли; 
КонецПроцедуры

&После("ПередУдалением")
Процедура Док_ПередУдалением(Отказ)
	ДопМодульСервер.ПроверитьНаличиеРасходногоОрдераНаТовары(Ссылка, Отказ);
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Товары.Количество() > 0 Тогда
		
		РегистрыСведений.СостоянияОтгрузкиНакладных.ОбновитьСостояниеОтгрузкиНакладной(Товары[0].ДокументОснование, СкладОтправитель); 
		
	КонецЕсли; 	
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	Если Не Проведен И Товары.Количество() > 0 Тогда
		
		РегистрыСведений.СостоянияОтгрузкиНакладных.ОбновитьСостояниеОтгрузкиНакладной(Товары[0].ДокументОснование, СкладОтправитель); 
		
	КонецЕсли; 	
КонецПроцедуры


#КонецЕсли

