#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
&Вместо("ПередЗаписью")	
Процедура ПередЗаписью(Отказ)
	ПересчетыТоваровСервер.ПоказательОбъектПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

&Вместо("ПередУдалением")	
Процедура ПередУдалением(Отказ)
	ПересчетыТоваровСервер.ПоказательПередУдалением(ЭтотОбъект, Отказ);
КонецПроцедуры

&Вместо("ПриЗаписи")	
Процедура ПриЗаписи(Отказ)
	ПересчетыТоваровСервер.ПоказательПриЗаписи(ЭтотОбъект, Отказ);
КонецПроцедуры

&Вместо("ПриКопировании")	
Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.РегламентноеЗадание = "";
КонецПроцедуры
            	
	
	
#КонецЕсли
