
&НаКлиенте
Процедура ГруппаСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ТекущиеДанные Тогда
		ПриСозданииНаСервере(Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСоздания", ЭтотОбъект);
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
		ОткрытьФорму("РегистрСведений.СрокиПоставкиТовараОтПоставщика.ФормаЗаписи", Новый Структура("Номенклатура", Список.Отбор.Элементы[0].ПравоеЗначение), ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("РегистрСведений.СрокиПоставкиТовараОтПоставщика.ФормаЗаписи",, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте 
Процедура ПослеСоздания(Результат, ДополнительныеПараметры) Экспорт

	Элементы.Список.Обновить();

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") тогда	
		
		Номенклатура = Параметры.Номенклатура;
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.История;
		Иначе	 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура", Номенклатура, ВидСравненияКомпоновкиДанных.Равно);
			ТаблицаТекущихДанных.Очистить();
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
							|	СрокиПоставкиТовараОтПоставщикаСрезПоследних.Подразделение КАК Подразделение,
							|	СрокиПоставкиТовараОтПоставщикаСрезПоследних.МинимальныйСрокПоставки КАК МинимальныйСрокПоставки,
							|	СрокиПоставкиТовараОтПоставщикаСрезПоследних.МаксимальныйСрокПоставки КАК МаксимальныйСрокПоставки,
							|	СрокиПоставкиТовараОтПоставщикаСрезПоследних.Подразделение.Код КАК ПодразделениеКод
							|ИЗ
							|	РегистрСведений.СрокиПоставкиТовараОтПоставщика.СрезПоследних(, Номенклатура = &Номенклатура) КАК СрокиПоставкиТовараОтПоставщикаСрезПоследних
							|
							|УПОРЯДОЧИТЬ ПО
							|	ПодразделениеКод";
			Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") тогда
				Номенклатура = Параметры.Отбор.Номенклатура;
			ИначеЕсли   Список.Отбор.Элементы.Количество() > 0 тогда
				Номенклатура = Список.Отбор.Элементы[0].ПравоеЗначение;
			Иначе 
				Возврат;
			КонецЕсли;
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
			ТаблицаТекущихДанных.Загрузить(ТаблицаЗначений);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры