#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ПричинаОтмены");
	Для ТекИндекс = 0 По Товары.Количество()-1 Цикл
			АдресОшибки = НСтр("ru=' в строке %НомерСтроки% списка ""Товары""'");
			АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Товары[ТекИндекс].НомерСтроки);
			Если Товары[ТекИндекс].Отменено
				И Не ЗначениеЗаполнено(Товары[ТекИндекс].ПричинаОтмены) Тогда
				
				ТекстОшибки = НСтр("ru='Необходимо указать причину отмены'");
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки + АдресОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "ПричинаОтмены"),
					,
					Отказ);
				
			КонецЕсли;
	КонецЦикла;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ВариантПриемкиТоваров) Тогда
		ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	КонецЕсли; 
	
КонецПроцедуры


&После("ПередЗаписью")
Процедура Док_ПередЗаписьюПосле(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ИзменениеДатыПриУстановкеРезерваИлиДобавленииНовыхПозиций(ЭтотОбъект) Тогда 
		ИзменениеДатыПлатежаДатыОтгрузкиДаты(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	Документы.РейсОтПоставщика.ПроверитьЧтоНетРейсовИлиЗаказовНаДоставку(ЭтотОбъект, Отказ);
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказКлиента") Или ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				ЭтотОбъект.КроссДокинг = ДанныеЗаполнения.Основание.КроссДокинг;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ВидПодтоварки") Тогда
			ЭтотОбъект.ВидПодтоварки = ДанныеЗаполнения.ВидПодтоварки;
		КонецЕсли;
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда
    	Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	КонецЕсли;
	
КонецПроцедуры

Функция ИзменениеДатыПриУстановкеРезерваИлиДобавленииНовыхПозиций(Объект)
	
	РезультатПроверки = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.КодСтроки КАК КодСтроки,
	|	ЗаказНаПеремещениеТовары.ВариантОбеспечения КАК ВариантОбеспечения
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ПредВерсияТовары = РезультатЗапроса.Выгрузить();
	
	НастВерсияТовары = Объект.Товары.Выгрузить();
	
	Для Каждого Строка Из НастВерсияТовары Цикл
		Если Не Строка.Отменено Тогда
			НайденнаяСтрока = ПредВерсияТовары.Найти(Строка.КодСтроки,"КодСтроки");
			Если НайденнаяСтрока <> Неопределено Тогда
				Если (НайденнаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению
					ИЛИ НайденнаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления
					ИЛИ НайденнаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется) И 
					(Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада 
					ИЛИ Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить)  Тогда
				     РезультатПроверки = Истина;
					 Прервать;
				КонецЕсли;
			ИначеЕсли Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада ИЛИ 
				Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
				РезультатПроверки = Истина;
				Прервать;
			 КонецЕсли;
		 КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

Процедура ИзменениеДатыПлатежаДатыОтгрузкиДаты(Объект)

	ТекущаяДатаДокумента = ТекущаяДата();
	Объект.Дата = ТекущаяДатаДокумента;
	Если ТипЗнч(Объект) <> Тип("ДокументОбъект.ЗаказНаПеремещение") Тогда		
		Для Каждого Строка Из Объект.Товары Цикл
			Если Строка.ДатаОтгрузки < ТекущаяДатаДокумента Тогда
				Строка.ДатаОтгрузки = ТекущаяДатаДокумента;
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка Из Объект.ЭтапыГрафикаОплаты Цикл
			Если Строка.ДатаПлатежа < ТекущаяДатаДокумента Тогда
				Строка.ДатаПлатежа = ТекущаяДатаДокумента;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из Объект.Товары Цикл
			Если Строка.НачалоОтгрузки < ТекущаяДатаДокумента Тогда
				Строка.НачалоОтгрузки = ТекущаяДатаДокумента;
			КонецЕсли;
		КонецЦикла;
	Конецесли;
	
КонецПроцедуры

#КонецЕсли
