#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТерминалССайтаПоУмолчанию() Экспорт
	Возврат Справочники.ЭквайринговыеТерминалы.НайтиПоНаименованию("Сайт, СБП Открытие (Альтерра)");
КонецФункции

Функция ПолучитьЭквайринговыйТерминал() Экспорт
	
	РабочееМестоКассира = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	Если ЗначениеЗаполнено(РабочееМестоКассира) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиРМКЭквайринговыеТерминалы.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
		|ИЗ
		|	Справочник.НастройкиРМК.ЭквайринговыеТерминалы КАК НастройкиРМКЭквайринговыеТерминалы
		|ГДЕ
		|	НастройкиРМКЭквайринговыеТерминалы.Ссылка.РабочееМесто = &РабочееМесто
		|	И НастройкиРМКЭквайринговыеТерминалы.НомерСтроки = 1";
		
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМестоКассира);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЭквайринговыйТерминал) Тогда
			Возврат Выборка.ЭквайринговыйТерминал;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.ЭквайринговыеТерминалы.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьЭквайринговуюОперацию(Заказ, ЭквайринговыйТерминал = Неопределено) Экспорт
	ПроверкаНеПроведенного = Истина; //обработка строк - ЗаказКлиента.ФормаДокумента.Док_ПослеЗаписиПослеНаСервере
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
		|ГДЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа = &Заказ
		|	И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ПометкаУдаления
		|	И (НЕ &ПроверкаНеПроведенного
		|			ИЛИ НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен)
		|{ГДЕ
		|	(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал = &ЭквайринговыйТерминал
		|			И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен)}";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Если Не ЭквайринговыйТерминал = Неопределено Тогда
		Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
		ПроверкаНеПроведенного = Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ПроверкаНеПроведенного", ПроверкаНеПроведенного);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПроверкаНеПроведенного Тогда
		Возврат Выборка; //Возвращаем всю выборку для обхода и корректировки строк
	Иначе
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

//Функция ПолучитьТерминалСБППоУмолчанию() Экспорт
//	Возврат Справочники.ЭквайринговыеТерминалы.НайтиПоНаименованию("СБП Газпромбанк");
//КонецФункции

#КонецЕсли
