#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Перед("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения1(ДанныеЗаполнения, СтандартнаяОбработка)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОтключитьЗаполнениеОбъектаПоСтатистике",истина);
КонецПроцедуры
	
&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДокументОснование = ДанныеЗаполнения;
	
	// Возврат по динамической ссылке
	ВозвратПоДинамическойСсылке = Неопределено;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ХозяйственнаяОперация") 	
		И ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту 
		И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			ВозвратПоДинамическойСсылке = ИнтеграцияБанки.ПолучитьОплатуДинамическойСсылки(ДанныеЗаполнения.ДокументОснование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВозвратПоДинамическойСсылке) И ВозвратПоДинамическойСсылке.ТребуетсяВозврат Тогда
		
		ЭквайринговыйТерминал 			= ВозвратПоДинамическойСсылке.ЭквайринговыйТерминал;
		СтатьяДвиженияДенежныхСредств 	= Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("ВОЗВРАТ ФИЗИЧЕСКОМУ ЛИЦУ", Истина);
		СуммаДокумента 					= ВозвратПоДинамическойСсылке.СуммаДокументаВозврата;
		Подразделение 					= ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");

		ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(ЭтотОбъект, СуммаДокумента, Ложь);
		ПараметрыПересчетаНДС = Новый Структура("ЦенаВключаетНДС", Истина);
		СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", ПараметрыПересчетаНДС);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(РасшифровкаПлатежа, СтруктураДействий, Неопределено);
		
		Для Каждого стрРасшифоровки Из РасшифровкаПлатежа Цикл
			стрРасшифоровки.ОснованиеПлатежа = ВозвратПоДинамическойСсылке.ДокументВозврата;
		КонецЦикла;  
	Иначе
		СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Выручка физ лица пл карта");
		
		Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
			СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("ВОЗВРАТ ФИЗИЧЕСКОМУ ЛИЦУ(терминал)");
			Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		ЭквайринговыйТерминал = Документы.ОперацияПоПлатежнойКарте.ПолучитьЭквайринговыйТерминал();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда 
		ДоговорЭквайринга = ЭквайринговыйТерминал.Владелец; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорЭквайринга) тогда
		Организация = ДоговорЭквайринга.Организация;     
	КонецЕсли;
	СтавкаНДС=УчетНДСУП.СтавкаНДСПоУмолчанию(Организация,ТекущаяДатаСеанса());
	Для Каждого стрРасшифровки Из РасшифровкаПлатежа Цикл
		стрРасшифровки.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		Если Не значениезаполнено(стрРасшифровки.СтавкаНДС) И значениезаполнено(СтавкаНДС) Тогда
			стрРасшифровки.СтавкаНДС=СтавкаНДС;
			стрРасшифровки.СуммаНДС=стрРасшифровки.Сумма-стрРасшифровки.Сумма / (1+СтавкаНДС.ставка / 100);
		КонецЕсли;
	КонецЦикла;  
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если РасшифровкаПлатежа.Количество()>0 тогда
		стрРасшифровки= РасшифровкаПлатежа[0];    
		если ЗначениеЗаполнено(стрРасшифровки.ОснованиеПлатежа) тогда
			если стрРасшифровки.ОснованиеПлатежа.Метаданные().Реквизиты.Найти("Организация")<>Неопределено тогда
				если Организация<>стрРасшифровки.ОснованиеПлатежа.Организация тогда
					сообщить("Реквизит Организация в этом документе отличается от этого реквизита в документе-основании");
					Отказ=Истина;
				КонецЕсли;
			КонецЕсли;                  
		КонецЕсли;
	КонецЕсли;

	Если РасшифровкаПлатежа.Количество() > 0 Тогда
		стрРасшифровки= РасшифровкаПлатежа[0];
		Если ЗначениеЗаполнено(стрРасшифровки.ОснованиеПлатежа) И ТипЗнч(стрРасшифровки.ОснованиеПлатежа) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Если стрРасшифровки.ОснованиеПлатежа.ССайта Тогда           //ссылка
				Контрагент= стрРасшифровки.ОснованиеПлатежа.Контрагент;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДеньгиВнесеныCотрудником = Истина И Не ЗначениеЗаполнено(СотрудникВнесшийДеньги) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите сотрудника, внесшего деньги");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ И Не ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		Если ЗначениеЗаполнено(ДоговорЭквайринга) и ДоговорЭквайринга.СпособПроведенияПлатежа = Перечисления.СпособыПроведенияПлатежей.СистемаБыстрыхПлатежей Тогда
			ЭквайринговыйТерминал = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
			
		Иначе
			ЭквайринговыйТерминал = Документы.ОперацияПоПлатежнойКарте.ПолучитьЭквайринговыйТерминал();
			ДоговорЭквайринга = ЭквайринговыйТерминал.Владелец; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&После("ЗаполнитьПоРеализацииТоваров")
Процедура Док_ЗаполнитьПоРеализацииТоваров(Знач ДокументОснование, ДанныеЗаполнения)
		ОбъектРасчетовТекущий = Неопределено;
		Для Каждого ТекущаяСтрока Из РасшифровкаПлатежа Цикл    
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.ОбъектРасчетов) Тогда
				Если ЗначениеЗаполнено(ДанныеЗаполнения.Договор) Тогда
					ПараметрОбъект = ДанныеЗаполнения.Договор; 
					ТекущееОснование = ДанныеЗаполнения.ДокументОснование;
				Иначе	
					ПараметрОбъект = ДанныеЗаполнения.ДокументОснование.ЗаказКлиента;
					ТекущееОснование = ДанныеЗаполнения.ДокументОснование;
				КонецЕсли;	
				Если ОбъектРасчетовТекущий = Неопределено Тогда    
					ЗапросОбъектРасчетов = Новый Запрос;
					ЗапросОбъектРасчетов.Текст = 
					"ВЫБРАТЬ
					|	ОбъектыРасчетов.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|ГДЕ
					|	НЕ ОбъектыРасчетов.ПометкаУдаления
					|	И ОбъектыРасчетов.Объект = &ПараметрОбъект";
					
					ЗапросОбъектРасчетов.УстановитьПараметр("ПараметрОбъект", ПараметрОбъект);
					
					РезультатЗапроса = ЗапросОбъектРасчетов.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Если Выборка.Следующий() Тогда 
						ОбъектРасчетовТекущий = Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;	   
				ТекущаяСтрока.ОбъектРасчетов = ОбъектРасчетовТекущий; 
				ТекущаяСтрока.ОснованиеПлатежа = ТекущееОснование;
				ТекущаяСтрока.Партнер = ДанныеЗаполнения.Партнер; 
				
			КонецЕсли;	
		КонецЦикла;	
	КонецПроцедуры  

#КонецЕсли

