
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
		Объект.ПериодНачисления= НачалоМесяца(Объект.ПериодНачисления);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
		Если Объект.Проведен Тогда
		Предупреждение("перед перезаполнением необходимо распровести документ!", 5);
		Возврат;
	КонецЕсли;
	
	Если Объект.Начисления.Количество() > 0 Тогда
		ОтветНаВопрос = Вопрос(НСтр("ru='Таблица ""Начисления"" будет перезаполнена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	ЭтаФорма.Модифицированность= Истина;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьНаСервере()
	ПериодНачисления= КонецМесяца(Объект.ПериодНачисления);
	Объект.Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистСогласования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ АннулированныеЛисты
		|ИЗ
		|	Документ.ЛистСогласования КАК ЛистСогласования
		|ГДЕ
		|	ЛистСогласования.Проведен
		|	И ЛистСогласования.Аннулирован
		|	И ЛистСогласования.ДатаРегистрацииАннулирования МЕЖДУ &Дата1 И &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(НачисленияШтрафовОбороты.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
		|	НачисленияШтрафовОбороты.Сотрудник КАК Сотрудник,
		|	СУММА(НачисленияШтрафовОбороты.СуммаЗадержкиОборот) КАК СуммаЗадержки,
		|	СУММА(НачисленияШтрафовОбороты.СуммаУдержанияОборот) КАК СуммаУдержания,
		|	СУММА(НачисленияШтрафовОбороты.СуммаВозвратаОборот) КАК СуммаВозврата,
		|	СУММА(НачисленияШтрафовОбороты.СуммаСторноОборот) КАК СуммаСторно,
		|	НачисленияШтрафовОбороты.Удержание КАК Удержание,
		|	НачисленияШтрафовОбороты.РегистраторУдержания КАК РегистраторУдержания
		|ИЗ
		|	РегистрНакопления.НачисленияУдержаний.Обороты(, , Регистратор, ) КАК НачисленияШтрафовОбороты
		|ГДЕ
		|	НачисленияШтрафовОбороты.РегистраторУдержания В
		|			(ВЫБРАТЬ
		|				АннулированныеЛисты.Ссылка КАК Ссылка
		|			ИЗ
		|				АннулированныеЛисты КАК АннулированныеЛисты)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияШтрафовОбороты.Сотрудник,
		|	НАЧАЛОПЕРИОДА(НачисленияШтрафовОбороты.ПериодНачисления, МЕСЯЦ),
		|	НачисленияШтрафовОбороты.Удержание,
		|	НачисленияШтрафовОбороты.РегистраторУдержания";
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.ПериодНачисления));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока= Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник= Выборка.Сотрудник;
		НоваяСтрока.Удержание= Выборка.Удержание;
		НоваяСтрока.РегистраторУдержания= Выборка.РегистраторУдержания;
		НоваяСтрока.Сторно= Выборка.СуммаЗадержки;
	КонецЦикла;
КонецПроцедуры
