
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Склад") Тогда
		 Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Выбрать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда) 
	
	Номенклатура = Элементы.Список.ТекущиеДанные.Номенклатура;
	Характеристика = Элементы.Список.ТекущиеДанные.Характеристика;
	Рез = Новый Структура("Номенклатура,Характеристика", Номенклатура,Характеристика);
	Закрыть(Рез); 
	
КонецПроцедуры

