
&НаСервере
&После("ПриСозданииНаСервере")
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтатусыДоставки = Новый Массив;
	СтатусыДоставки.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Заехал);
	СтатусыДоставки.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Выехал);
	
	Список.Параметры.УстановитьЗначениеПараметра("СтатусыДоставки", СтатусыДоставки);

	Список.Параметры.УстановитьЗначениеПараметра("Партнер", Справочники.Партнеры.НайтиПоНаименованию("Транспортные расходы", 1)); 
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Справочники.Контрагенты.НайтиПоНаименованию("Транспортные расходы", 1));
	
КонецПроцедуры

&НаСервереБезКонтекста
&После("ЗаполнитьСписокВыбораОтбораПоСостояниюСервер")
Процедура Док_ЗаполнитьСписокВыбораОтбораПоСостояниюСервер(СписокВыбора, ИспользоватьСтатусы, ИспользоватьУпрощеннуюСхемуОплаты)
	
	СписокВыбора.Добавить("ВсеЗакрытыеДокументыНеПолучены", НСтр("ru='Все закрытые с неполученными документами'"));
	
КонецПроцедуры

&НаСервере
&После("УстановитьОтборПоСостояниюСервер")
Процедура Док_УстановитьОтборПоСостояниюСервер()
	
	Если Состояние = "ВсеЗакрытыеДокументыНеПолучены" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", Перечисления.СостоянияЗаказовПоставщикам.Закрыт, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", Ложь,,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДокументыОтСкладаПолучены", Ложь, ВидСравненияКомпоновкиДанных.Равно,, Истина);

	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДокументыОтСкладаПолучены",,,, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Док_СписокВыборПеред(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗРДССсылка" Тогда
		СтандартнаяОбработка = Ложь;	
		ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаДокумента", 
			             Новый Структура("Ключ", Элемент.ТекущиеДанные.ЗРДССсылка), ЭтаФорма, Ложь);
	КонецЕсли
КонецПроцедуры

