//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки
//   ВыводитьВариантыОтчетов - Булево -
//
Процедура НастроитьВариантыОтчета(Настройки, ВыводитьВариантыОтчетов) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализПричинОтменыЗаказовКлиентов);
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'По каким причинам чаще всего заказы выполняются частично или не выполняются полностью?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПричиныОтменыЗаказовКлиентовБезЦеновыхГрупп");
	ОписаниеВарианта.Описание = НСтр("ru= 'По каким причинам чаще всего заказы выполняются частично или не выполняются полностью?
		|У каких менеджеров более всего выполненных не полностью заказов?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьЦеновыеГруппы");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПричиныОтменыЗаказовКлиентовСЦеновымиГруппами");
	ОписаниеВарианта.Описание = НСтр("ru= 'По каким причинам чаще всего заказы выполняются частично или не выполняются полностью?
		|У каких менеджеров более всего выполненных не полностью заказов?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьЦеновыеГруппы");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
