// Заполнение групп
&НаКлиенте
Процедура Расш1__ЗаполнитьГруппуВместо(Команда)
	ЗаполнитьГруппуНаКлиенте();	
КонецПроцедуры
&НаКлиенте
Процедура ИерархияНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ЗаполнитьГруппуНаКлиенте();	
	СтандартнаяОбработка=ложь;	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьГруппуНаКлиенте()
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РезультатВопроса", ложь);
	если ЕстьЦеновыеГруппы(Элементы.ИерархияНоменклатуры.текущиеданные.Ссылка) тогда
		ТекстВопроса = НСтр("ru = 'В списке пристутсвуют заполняемые ценовые группы. Заменить существующие? '");
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ЗаполнитьЦеновуюГруппуФрагментВопросЗавершение", ЭтотОбъект,ДополнительныеПараметры),
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет);
	иначе
		ЗаполнитьГруппуНаСервере(Элементы.ИерархияНоменклатуры.текущиеданные.Ссылка,истина);
	конецесли;
КонецПроцедуры	
&НаКлиенте
Процедура  ЗаполнитьЦеновуюГруппуФрагментВопросЗавершение(ОтветнаВопрос,ДополнительныеПараметры) экспорт
	результатВопроса=ложь;
	если  ОтветНаВопрос=КодВозвратаДиалога.Да тогда
		результатВопроса=истина;
	конецесли;	
	ЗаполнитьГруппуНаСервере(Элементы.ИерархияНоменклатуры.текущиеданные.Ссылка,результатВопроса);
КонецПроцедуры	
&НаСервере
Функция ЕстьЦеновыеГруппы(родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Родитель)
	|	И НЕ Номенклатура.ЦеноваяГруппа.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		найдена_строка=Объект.ЦеновыеГруппы.НайтиСтроки(Новый Структура("ЦеноваяГруппа",ВыборкаДетальныеЗаписи.ЦеноваяГруппа));
		если найдена_строка.количество()>0 тогда
			возврат истина;
		конецесли;	
	КонецЦикла;
	возврат ложь;
КонецФункции

&НаСервере
Процедура ЗаполнитьГруппуНаСервере(Родитель,результатВопроса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Родитель)
	|	И НЕ Номенклатура.ЦеноваяГруппа.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		найдена_строка=Объект.ЦеновыеГруппы.НайтиСтроки(Новый Структура("ЦеноваяГруппа",ВыборкаДетальныеЗаписи.ЦеноваяГруппа));
		если найдена_строка.количество()=0 тогда
			стр=Объект.ЦеновыеГруппы.Добавить();
			заполнитьзначениясвойств(стр,ВыборкаДетальныеЗаписи);
		иначе
			если результатВопроса тогда
				найдена_строка[0].Видцен="";
			конецесли;	
		конецесли;
	КонецЦикла;
КонецПроцедуры

// Заполнение номенклатуры
&НаКлиенте
Процедура Расш1__ЗаполнитьЭлементВместо(Команда)
	ЗаполнитьЭлементНаКлиенте();	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьЭлементНаКлиенте()
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РезультатВопроса", ложь);
	если ЕстьЭлементыВТоварах(Элементы.СписокНоменклатуры.текущиеданные.Ссылка) тогда
		ТекстВопроса = НСтр("ru = 'В списке пристутсвуют заполняемые номенклатурные позиции. Заменить существующие? '");
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ЗаполнитьЭлементыФрагментВопросЗавершение", ЭтотОбъект,ДополнительныеПараметры),
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет);
	иначе
		ЗаполнитьЭлементНаСервере(Элементы.СписокНоменклатуры.текущиеданные.Ссылка,истина);
	конецесли;
КонецПроцедуры
&НаКлиенте
Процедура  ЗаполнитьЭлементыФрагментВопросЗавершение(ОтветнаВопрос,ДополнительныеПараметры) экспорт
	результатВопроса=ложь;
	если  ОтветНаВопрос=КодВозвратаДиалога.Да тогда
		результатВопроса=истина;
	конецесли;	
	ЗаполнитьЭлементНаСервере(Элементы.СписокНоменклатуры.текущиеданные.Ссылка,результатВопроса);
КонецПроцедуры	

&НаСервере
Функция ЕстьЭлементыВТоварах(Элемент)
		найдена_строка=Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Элемент));
		если найдена_строка.количество()>0 тогда
			возврат истина;
		конецесли;	
	возврат ложь;
КонецФункции

&НаСервере
Процедура ЗаполнитьЭлементНаСервере(Элемент,результатВопроса)
	найдена_строка=Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Элемент));
	если найдена_строка.количество()>0 и результатвопроса тогда
		найдена_строка[0].ВидЦены="";
	иначе
	стр=Объект.Товары.Добавить();
	стр.Номенклатура=Элемент;
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗаполнитьЭлементНаКлиенте();
	СтандартнаяОбработка=ложь;	
КонецПроцедуры

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Бригадиры.
	//Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументВозвратТоваровОтКлиентаСоздатьНаОсновании.Доступность=не ДоступностьВозвратаККМ;	
	//Элементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы.ПодменюСоздатьНаОснованииКомандаСоздатьНаОсновании1_Справочник_СоглашенияСКлиентами.Видимость=Объект.Типовое;
	ДобавитьВЗапрос();
	СегментНоменклатурыПриИзмененииНаСервере();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатуры, "ВидЦены", _ВидЦены) ;
	
	УправлениеВидимостьюДоступностью();

КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()    
	
		//Бригадиры     
	ДоступенПросмотр=не (рольДоступна("ПолныеПрава") или рольДоступна("НазначениеСтатусовКлиентовВБонуснойПрограмме"));	
	Элементы.НачислятьБаллыЗаСтатус.ТолькоПросмотр = ДоступенПросмотр;
	Элементы.НачислятьБаллыЗаКрупнуюПокупку.ТолькоПросмотр = ДоступенПросмотр;
	Элементы.ВозможностьСписатьБаллы.ТолькоПросмотр = ДоступенПросмотр;
	Элементы.ПодтверждениеЦен.ТолькоПросмотр = ДоступенПросмотр;
	
	НоваяСхемаЦенообразования=ДопМодуль.НовоеЦенообразование();	
	Элементы.ВидЦен.Видимость=не НоваяСхемаЦенообразования;
	Элементы.ИспользоватьОбщийВидЦены.Видимость=не НоваяСхемаЦенообразования;
	Элементы.ГруппаВидовЦен.Видимость=НоваяСхемаЦенообразования;  
	Элементы.ЦеновыеГруппыСрокПоставки.Видимость=не НоваяСхемаЦенообразования;   
	
	Элементы.УточнениеНоменклатураВидЦены.Видимость=не НоваяСхемаЦенообразования;
	Элементы.УточнениеНоменклатураГруппаВидовЦен.Видимость=НоваяСхемаЦенообразования;
	Элементы.УточнениеЦеновыеГруппыВидЦен.Видимость=не НоваяСхемаЦенообразования;
	Элементы.УточнениеЦеновыеГруппыГруппаВидовЦен.Видимость=НоваяСхемаЦенообразования;
	
	Элементы.ТоварыВидЦены.Видимость=не НоваяСхемаЦенообразования;
	Элементы.ТоварыГруппаВидовЦен.Видимость=НоваяСхемаЦенообразования;
	Элементы.ЦеновыеГруппыГруппаВидовЦен.Видимость=НоваяСхемаЦенообразования;
	Элементы.ЦеновыеГруппыВидЦен.Видимость=не НоваяСхемаЦенообразования;
	
	Элементы.ВидЦены.Видимость=не НоваяСхемаЦенообразования;
	Элементы.ГруппаЦен.Видимость= НоваяСхемаЦенообразования;
	Элементы.Подразделение.Видимость= НоваяСхемаЦенообразования;

//	Элементы.ЦеновыеГруппыЗаполнитьВидЦенВыделенныхСтрокЦеновыеГруппы.видимость=не НоваяСхемаЦенообразования;
	Элементы.ЦеновыеГруппыЗаполнитьГруппыЦенВыделенныхСтрокЦеновыеГруппы.видимость=НоваяСхемаЦенообразования;
//	Элементы.ТоварыЗаполнитьВидЦенВыделенныхСтрокТовары.видимость=не НоваяСхемаЦенообразования;
	Элементы.ТоварыЗаполнитьГруппыЦенВыделенныхСтрокТовары.видимость=НоваяСхемаЦенообразования;
//	Элементы.УточнениеЦеновыеГруппы_ЗаполнитьВидЦенВыделенныхСтрокЦеновыеГруппы.видимость=не НоваяСхемаЦенообразования;
 	Элементы.УточнениеЦеновыеГруппыЗаполнитьГруппыЦенВыделенныхСтрокЦеновыеГруппы.видимость=НоваяСхемаЦенообразования;
//	Элементы.УточнениеНоменклатураЗаполнитьВидЦенВыделенныхСтрокТовары.видимость=не НоваяСхемаЦенообразования;
 	Элементы.УточнениеНоменклатураЗаполнитьГруппыЦенВыделенныхСтрокТовары.видимость=НоваяСхемаЦенообразования;
	
	Если Не Объект.Типовое Тогда
		Элементы.Приоритет.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ИерархияНоменклатурыПриАктивизацииСтрокиПосле(Элемент)
	если Элементы.ИерархияНоменклатуры.текущиеданные<>неопределено тогда
	ОтборПоИерархииНоменклатуры=Элементы.ИерархияНоменклатуры.текущиеданные.Ссылка;	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокНоменклатуры,
	"Родитель",
	ОтборПоИерархииНоменклатуры,
	ВидСравненияКомпоновкиДанных.Равно,
	"Родитель",
	Истина);
конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ВидЦеныПриИзмененииПосле(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатуры, "ВидЦены", _ВидЦены) ;
КонецПроцедуры

&После("ЗаполнитьВидЦенВыделенныхСтрокЦеновыеГруппыСервер")
Процедура Расш1_ЗаполнитьВидЦенВыделенныхСтрокЦеновыеГруппыСервер(ВидЦен)
	Для Каждого ТекущаяСтрока Из Элементы.УточнениеЦеновыеГруппы.ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.ЦеновыеГруппы.НайтиПоИдентификатору(ТекущаяСтрока);
		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы.ВидЦен = ВидЦен;
	КонецЦикла;
КонецПроцедуры  

&После("ЗаполнитьВидЦенВыделенныхСтрокТоварыСервер")
Процедура Расш1_ЗаполнитьВидЦенВыделенныхСтрокТоварыСервер(ВидЦен)
	Для Каждого ТекущаяСтрока Из Элементы.УточнениеНоменклатура.ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы.ВидЦены = ВидЦен;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура Расш1_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	если Модифицированность тогда
		если не рольдоступна("Полныеправа") и не рольдоступна("ОтклонениеОтУсловийПродаж") тогда
			ТекущийОбъект.Статус=Перечисления.СтатусыСоглашенийСКлиентами.НеСогласовано;
		конецесли;	
	конецесли;	
	
	
	ХранилищеСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Настройки хранилища");
	Хранилище = ХранилищеСсылка.ХранилищеНастроек.Получить(); 
	
	ПолучателиБитрикс = Хранилище.УведомлениеСоглашениеПользователиБитрикс.СписокПолучателей;
	ТелоСообщения = ("Индивидуальное соглашение об условиях продаж " + Объект.Наименование + " изменен");
	
	Если Модифицированность Тогда
		Для Каждого Элемент Из ПолучателиБитрикс Цикл
			
        	АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТелоСообщения, Элемент.Значение);
        	
    	КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Спр__СегментНоменклатурыПриИзмененииПосле(Элемент)
СегментНоменклатурыПриИзмененииНаСервере();	
КонецПроцедуры  

&НаСервере
Процедура ДобавитьВЗапрос();
СписокНоменклатуры.ТекстЗапроса=СписокНоменклатуры.ТекстЗапроса+ "	
	|И 1 В
    |		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			РегистрСведений.НоменклатураСегмента КАК Сегменты
	|		ГДЕ
	|			Сегменты.Номенклатура = СправочникНоменклатура.ДополнительныеРеквизиты.Ссылка
	|			И Сегменты.Сегмент В ИЕРАРХИИ (&СегментНоменклатуры))
	|";
КонецПроцедуры 

&НаСервере
Процедура СегментНоменклатурыПриИзмененииНаСервере()

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ЭтаФорма.СписокНоменклатуры, 
		"СегментНоменклатуры", 
		ЭтаФорма._СегментНоменклатуры,
		  истина);
		//ЗначениеЗаполнено(ЭтаФорма._СегментНоменклатуры));


КонецПроцедуры

#Область НовоеЦО

&НаКлиенте
Процедура Док_ПодразделениеПриИзмененииПосле(Элемент)
	ОтобразитьСписокНоменклатуры();
КонецПроцедуры        

&НаСервере
Процедура ОтобразитьСписокНоменклатуры()
	_ВидЦены=ПодборТоваровВызовСервера.ВернутьВидЦенПоПараметрам(ГруппаЦен,Подразделение);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатуры, "ВидЦены", _ВидЦены) ;
КонецПроцедуры

&НаКлиенте
Процедура Док_ГруппаЦенПриИзмененииПосле(Элемент)
	ОтобразитьСписокНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗаполнитьГруппыЦенВыделенныхСтрокЦеновыеГруппыПосле(Команда)
	Если Объект.ЦеновыеГруппы.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='В документе не заполнен список ""Ценовые группы"". Вид цен не может быть заполнен'"));
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения=Новый ОписаниеОповещения("ЗаполнитьГруппыЦенВыделенныхСтрокЦеновыеГруппыЗавершение", ЭтотОбъект);
	
	ОткрытьФорму(
	"Справочник.ГруппировкиВидовЦен.ФормаВыбора",,,,,,
	ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГруппыЦенВыделенныхСтрокЦеновыеГруппыЗавершение(ГруппаЦен, ДополнительныеПараметры) экспорт
	Если ЗначениеЗаполнено(ГруппаЦен) Тогда
		
		ЗаполнитьГруппаЦенВыделенныхСтрокЦеновыеГруппыСервер(ГруппаЦен);
		
		ПоказатьОповещениеПользователя(
		НСтр("ru = 'Группа цен заполнена'"),
		,
		СтрЗаменить(НСтр("ru='Группа цен ""%ГруппаЦен%"" в таблице Ценовые группы заполнена.'"),"%ГруппаЦен%",ГруппаЦен),
		БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппаЦенВыделенныхСтрокЦеновыеГруппыСервер(ГруппаЦен)
	если ЭтаФорма.ТекущийЭлемент=НЕОПРЕДЕЛЕНО тогда 
		возврат;
	конецесли;	
	если ЭтаФорма.ТекущийЭлемент.Имя="УточнениеЦеновыеГруппы" или  ЭтаФорма.ТекущийЭлемент.Имя="ЦеновыеГруппы" тогда
		
		Для Каждого ТекущаяСтрока Из Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ВыделенныеСтроки Цикл
			
			СтрокаТаблицы = Объект.ЦеновыеГруппы.НайтиПоИдентификатору(ТекущаяСтрока);
			
			Если СтрокаТаблицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы.ГруппаВидовЦен = ГруппаЦен;
			
		КонецЦикла;   
		
	конецесли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗаполнитьГруппыЦенВыделенныхСтрокТоварыПосле(Команда)
	Если Объект.Товары.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='В документе не заполнен список ""Товары"". Вид цен не может быть заполнен'"));
		Возврат;
		
	КонецЕсли;
	ОписаниеОповещения=Новый ОписаниеОповещения("ЗаполнитьГруппыЦенВыделенныхСтрокТоварыЗавершение", ЭтотОбъект);
	
	ОткрытьФорму(
	"Справочник.ГруппировкиВидовЦен.ФормаВыбора",,,,,,
	ОписаниеОповещения);
	
	
КонецПроцедуры                                         

&НаКлиенте
Процедура ЗаполнитьГруппыЦенВыделенныхСтрокТоварыЗавершение(ГруппаЦен, ДополнительныеПараметры) экспорт
	Если ЗначениеЗаполнено(ГруппаЦен) Тогда
		
		ЗаполнитьГруппаЦенВыделенныхСтрокТоварыСервер(ГруппаЦен);
		
		ПоказатьОповещениеПользователя(
		НСтр("ru = 'Группа цен заполнена'"),
		,
		СтрЗаменить(НСтр("ru='Группа цен ""%ГруппаЦен%"" в таблице Товары заполнена.'"),"%ГруппаЦен%",ГруппаЦен),
		БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппаЦенВыделенныхСтрокТоварыСервер(ГруппаЦен)
	если ЭтаФорма.ТекущийЭлемент=НЕОПРЕДЕЛЕНО тогда 
		возврат;
	конецесли;	
	если ЭтаФорма.ТекущийЭлемент.Имя="УточнениеНоменклатура" или  ЭтаФорма.ТекущийЭлемент.Имя="Товары" тогда
		
		Для Каждого ТекущаяСтрока Из Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ВыделенныеСтроки Цикл
			
			СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
			
			Если СтрокаТаблицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы.ГруппаВидовЦен = ГруппаЦен;
			Если СтрокаТаблицы.Цена <> 0 Тогда
				СтрокаТаблицы.Цена = 0;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЦенаВключаетНДСПриИзмененииВместо(Элемент)
	Если Не ИспользоватьНесколькоВидовЦен и не ДопМодуль.НовоеЦенообразование() Тогда
		УстановитьДоступностьИспользованияПрайсЛиста();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_НачислятьБаллыЗаКрупнуюПокупкуПриИзмененииПосле(Элемент)
	Элементы.КоэффициентНачисленияББРозничнаяЦена.Видимость = Объект.НачислятьБаллыЗаКрупнуюПокупку;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	Элементы.КоэффициентНачисленияББРозничнаяЦена.Видимость = Объект.НачислятьБаллыЗаКрупнуюПокупку;
КонецПроцедуры

#КонецОбласти

