
&НаКлиенте
Процедура ПатерностерПриИзменении(Элемент)
	Объект.Наименование = СтрШаблон("%3-П%1-%2",Объект.Патерностер,Объект.Вал,Объект.Префикс);
КонецПроцедуры

&НаСервере
Процедура ЗаменитьПрефиксПоСкладуНаСервере()    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Патерностеры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Патерностеры КАК Патерностеры
		|ГДЕ
		|	Патерностеры.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Если Выборка.Ссылка <> Объект.Ссылка Тогда
			ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
			ТекущийОбъект.Префикс = Объект.Префикс;  
			ТекущийОбъект.Наименование = СтрШаблон("%3-П%1-%2",ТекущийОбъект.Патерностер,ТекущийОбъект.Вал,ТекущийОбъект.Префикс);
			ТекущийОбъект.Записать();  
		КонецЕсли;
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьПрефиксПоСкладу(Команда) 
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		ЗаменитьПрефиксПоСкладуНаСервере();
	Иначе    
		Сообщить("Выберите склад!!!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьДубли(Патерностер,Вал,Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Патерностеры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Патерностеры КАК Патерностеры
		|ГДЕ
		|	Патерностеры.Патерностер = &Патерностер
		|	И Патерностеры.Вал = &Вал
		|	И Патерностеры.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Вал", Вал);
	Запрос.УстановитьПараметр("Патерностер", Патерностер);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда  
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЕстьДубли(Объект.Патерностер,Объект.Вал,Объект.Склад)Тогда
		Отказ = Истина;
		Сообщить("По данному складу уже есть такой патерностер!!! Измените номер патерностера или вала!!!");
	КонецЕсли;	
КонецПроцедуры
