
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДавальческоеСырьеВидимостьСвязанныхЭлементов(Объект.ДавальческоеСырье);
    Элементы.СтатусСогласования.Доступность = РольДоступна("СогласованиеИспользованияМатериалов") или РольДоступна("ПолныеПрава");
	ВидимостьКнопкиЗаполненияОстатками(Объект.Склад);
	Если Параметры.Свойство("ДокументОснование") Тогда
		Объект.ДокументОснование = Параметры.ДокументОснование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ДавальческоеСырьеПриИзмененииПосле(Элемент)
	ДавальческоеСырьеВидимостьСвязанныхЭлементов(Объект.ДавальческоеСырье);
КонецПроцедуры

&НаСервере
Процедура ДавальческоеСырьеВидимостьСвязанныхЭлементов(Видимость)
	Элементы.ТоварыВидРабот.Видимость = Видимость;
	Элементы.СтатусСогласования.Видимость = Видимость;
	Элементы.ТоварыГруппаРасходРесурсов.Видимость = Видимость;
КонецПроцедуры

#Область ЗаполнениеОстаткамиНаСкладе

&НаКлиенте
Процедура Док_ЗаполнитьОстаткамиНаСкладеПосле(Команда)
	
	Если НЕ ЭтоТорговыйСклад(Объект.Склад) Тогда
		ЗаполнитьОстаткамиПоСкладу(Объект.Склад);
	Конецесли 
	
КонецПроцедуры

&НаСервере
Функция ЭтоТорговыйСклад(ТекСклад)
	Возврат ТекСклад.СкладПродажи;
КонецФункции 

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	ВидимостьКнопкиЗаполненияОстатками(Объект.Склад);
КонецПроцедуры

&НаСервере
Процедура ВидимостьКнопкиЗаполненияОстатками(Склад)
	
	Если Не Склад.Пустая() Тогда
    	Элементы.ТоварыЗаполнитьОстаткамиНаСкладе.Доступность = НЕ ЭтоТорговыйСклад(Склад)
	Иначе
		Элементы.ТоварыЗаполнитьОстаткамиНаСкладе.Доступность = Ложь
	Конецесли	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиПоСкладу(Склад)
	
	Результат = АльтерраОбщегоНазначения.ПолучитьОстаткиПоСкладу(Склад);
		
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("На данном складе нет доступных остатков");
	Иначе
		Объект.Товары.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	СтрокаТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТовары.СтатьяРасходов = НайтиСтатьюРасходов();  
КонецПроцедуры

&НаСервере
Функция НайтиСтатьюРасходов() 
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РемонтИТехническоеОбслуживание") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
			|ИЗ
			|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
			|ГДЕ
			|	НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Статья списания""
			|	И НоменклатураДополнительныеРеквизиты.Ссылка.Ссылка = &Ссылка";
		
		Техника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Техника");	
		Запрос.УстановитьПараметр("Ссылка", Техника);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДополнительноеЗначение = Выборка.Значение;	
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДополнительноеЗначение) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СтатьиРасходов.Ссылка КАК Ссылка
				|ИЗ
				|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
				|ГДЕ
				|	СтатьиРасходов.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", ДополнительноеЗначение.Наименование);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Возврат Выборка.Ссылка;	
			КонецЦикла; 
			
		КонецЕсли;	
	КонецЕсли;	

КонецФункции 

&НаКлиенте
Процедура Док_ИзменениеЭкономииОстатка(Элемент)
	СтрокаТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТовары.Остаток = СтрокаТовары.Количество - СтрокаТовары.РасходРесурсовПоФакту;
	СтрокаТовары.ЭкономияПерерасход = СтрокаТовары.РасходРесурсовВНорме - СтрокаТовары.РасходРесурсовПоФакту;		
КонецПроцедуры

#КонецОбласти
