
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Элементы.ВоспроизвестиЗапись.Видимость = АльтерраОбщегоНазначения._ЕстьРоль("ПрослушиваниеЗаписейЗвонковAsterisk");
КонецПроцедуры

&НаКлиенте
Процедура ВоспроизвестиЗапись(Команда)
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;	
	Если ТекущиеДанные <> Неопределено Тогда   
		СсылкаНаЗаписьРазговора = ПолучитьСсылкуНаЗапись(ТекущиеДанные);
		Если ЗначениеЗаполнено(СсылкаНаЗаписьРазговора) Тогда
			ОткрытьФорму(
				"РегистрСведений.ДанныеЗвонков.Форма.ВоспроизвестиЗапись", 
				Новый Структура("СсылкаНаЗаписьРазговора", СсылкаНаЗаписьРазговора), 
				ЭтаФорма,
				,
				,
				,
				,
				РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Ссылка отсутствует!");
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаЗапись(ТекущиеДанные)     
	Возврат РегистрыСведений.ДанныеЗвонков.ПолучитьСсылкуНаЗапись(ТекущиеДанные);
КонецФункции
