//изменение формата:
// Документ.ОприходованиеТоваров.Товары.Строка добавить "НоменклатураСписание"

#Область СлужебныйПрограммныйИнтерфейс  

&После ("ВыполнитьПроцедуруМодуляМенеджера")
Процедура Док_ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
	Если ИмяПроцедуры = "ПКО_ПередачаТоваровМеждуОрганизациями_Излишки_ПриОтправкеДанных" Тогда 
		ПКО_ПередачаТоваровМеждуОрганизациями_Излишки_ПриОтправкеДанных(
		Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_РеализацияУслугПрочихАктивов_Отправка_ПриОбработке" Тогда 
		ПОД_Документ_РеализацияУслугПрочихАктивов_Отправка_ПриОбработке(
		Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ДоговорыОрганизаций_ИзСтруктуры_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ДоговорыОрганизаций_ИзСтруктуры_ПриОтправкеДанных(
		Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "Документ_ОтчетБанкаПоОперациямЭквайринга_Отправка_ПриОбработке" Тогда 
		Документ_ОтчетБанкаПоОперациямЭквайринга_Отправка_ПриОбработке(
		Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПКОРозничнаяВыручка_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПКОРозничнаяВыручка_Отправка_ПриОтправкеДанных(
		Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
    // добавление
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ПорчаТоваров_Отправка_ПриОбработке" Тогда 
		ПОД_Документ_ПорчаТоваров_Отправка_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена); 
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПорчаТоваров_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПорчаТоваров_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПорчаВОприходование_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПорчаВОприходование_Отправка_ПриОтправкеДанных(
		Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПорчаВСписание_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПорчаВСписаниеЗапасов_Отправка_ПриОтправкеДанных(
		Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	КонецЕсли;
КонецПроцедуры

Процедура Документ_ОтчетБанкаПоОперациямЭквайринга_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	если ДанныеИБ.СуммаПокупок-ДанныеИБ.СуммаВозвратов=0 тогда
		ИспользованиеПКО.Документ_ОтчетБанкаПоОперациямЭквайринга_Отправка=ложь;
	конецесли;	
	
КонецПроцедуры

Процедура ПКО_Справочник_ДоговорыОрганизаций_ИзСтруктуры_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если ТипЗнч(ДанныеИБ) = Тип("Структура") И ДанныеИБ.Свойство("ДополнительныеРеквизиты")
		И ТипЗнч(ДанныеИБ.ДополнительныеРеквизиты) = Тип("ТаблицаЗначений") Тогда
		
		Если ДанныеИБ.ДополнительныеРеквизиты.КОличество() > 0 Тогда
			ДанныеXDTO.Вставить("ДополнительныеРеквизиты", ДанныеИБ.ДополнительныеРеквизиты);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПКО_ПередачаТоваровМеждуОрганизациями_Излишки_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	// Устинов новое правило
	Если КомпонентыОбмена.ПараметрыКонвертации.ИспользоватьОтборПоОрганизациям Тогда
		
		УзелСписокОрганизаций = КомпонентыОбмена.ПараметрыКонвертации.Организации;
		
		ВыгружатьПродажу = УзелСписокОрганизаций.НайтиПоЗначению(ДанныеИБ.Организация) <> Неопределено;
		
		ВыгружатьПокупку = УзелСписокОрганизаций.НайтиПоЗначению(ДанныеИБ.ОрганизацияПолучатель) <> Неопределено;
		
		ДанныеИБ.Организация=?(ВыгружатьПокупку,ДанныеИБ.ОрганизацияПолучатель,ДанныеИБ.Организация);
		
		ОпределениеДвижения=?(ВыгружатьПродажу,"Излишки","");
		ОпределениеДвижения=?(ВыгружатьПокупку,"Недостачи",ОпределениеДвижения);
		
		
		ДанныеXDTO.Вставить("AdditionalInfo", ОпределениеДвижения);
		
	конецесли;	
	
	НомерДок = Лев(ДанныеИБ.Номер, 5) + "И" + Сред(ДанныеИБ.Номер, 7);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", НомерДок);
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДатаДок = НачалоДня(?(ЗначениеЗаполнено(ДанныеИБ.НачалоПериода), ДанныеИБ.НачалоПериода, ДанныеИБ.Дата));
	ДанныеXDTO.КлючевыеСвойства.Вставить("Дата", ДатаДок);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Организация", ДанныеИБ.Организация);
	ДанныеXDTO.Вставить("СкладПолучатель", СкладДляВыгрузки);
	ДанныеXDTO.Вставить("СкладОтправитель", СкладДляВыгрузки);
	
	
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	// Подразделения.
	ДанныеXDTO.Вставить("ПодразделениеОтправитель", Неопределено);
	ДанныеXDTO.Вставить("ПодразделениеПолучатель", Неопределено);
	Если ЗначениеЗаполнено(ДанныеИБ.Организация) Тогда
		СкладОтправитель = СкладДляВыгрузки;
		СкладПолучатель = СкладДляВыгрузки;
		
		СоответствиеДляПолученияПодразделений = Неопределено;
		ТекПодразделениеОтправитель = Неопределено;
		ТекПодразделениеПолучатель = Неопределено;
		ДополнитьСоответствие = Ложь;
		КомпонентыОбмена.ПараметрыКонвертации.Свойство("СоответствиеДляПолученияПодразделений", СоответствиеДляПолученияПодразделений);
		Если СоответствиеДляПолученияПодразделений = Неопределено Тогда
			СоответствиеДляПолученияПодразделений = Новый Соответствие;
			ДополнитьСоответствие = Истина;
		Иначе 
			ТекПодразделениеОтправитель = СоответствиеДляПолученияПодразделений.Получить(СкладОтправитель);
			ТекПодразделениеПолучатель = СоответствиеДляПолученияПодразделений.Получить(СкладПолучатель);
		КонецЕсли;
		Если ТекПодразделениеОтправитель = Неопределено Тогда
			ТекПодразделениеОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладОтправитель, "Подразделение");
			ДополнитьСоответствие = Истина;
		КонецЕсли;
		Если ТекПодразделениеПолучатель = Неопределено Тогда
			ТекПодразделениеПолучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладПолучатель, "Подразделение");
			ДополнитьСоответствие = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекПодразделениеОтправитель) Тогда
			РегистрацияПодразделенияВНалоговомОргане = ОпределитьРегистрациюВНалоговомОргане(ТекПодразделениеОтправитель, ДанныеИБ.Организация);
			
			СтруктураДанныеПодразделения = Новый Структура(
			"Наименование, РегистрацияПодразделенияВНалоговомОргане", 
			Строка(ТекПодразделениеОтправитель),
			РегистрацияПодразделенияВНалоговомОргане);
			
			Инструкция = Новый Структура(
			"Значение, ИмяПКО",
			СтруктураДанныеПодразделения,
			"Справочник_Подразделения_ИзСтруктуры");
			
			ДанныеXDTO.Вставить("ПодразделениеОтправитель", Инструкция);
			
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекПодразделениеПолучатель) Тогда
			РегистрацияПодразделенияВНалоговомОргане = ОпределитьРегистрациюВНалоговомОргане(ТекПодразделениеПолучатель, ДанныеИБ.Организация);
			
			СтруктураДанныеПодразделения = Новый Структура(
			"Наименование, РегистрацияПодразделенияВНалоговомОргане", 
			Строка(ТекПодразделениеПолучатель),
			РегистрацияПодразделенияВНалоговомОргане);
			
			Инструкция = Новый Структура(
			"Значение, ИмяПКО",
			СтруктураДанныеПодразделения,
			"Справочник_Подразделения_ИзСтруктуры");
			
			ДанныеXDTO.Вставить("ПодразделениеПолучатель", Инструкция);
			
		КонецЕсли;
		
		Если ДополнитьСоответствие Тогда
			СоответствиеДляПолученияПодразделений.Вставить(СкладОтправитель, ТекПодразделениеОтправитель);
			СоответствиеДляПолученияПодразделений.Вставить(СкладПолучатель, ТекПодразделениеПолучатель);
			КомпонентыОбмена.ПараметрыКонвертации.Вставить("СоответствиеДляПолученияПодразделений", СоответствиеДляПолученияПодразделений);
		КонецЕсли;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура 					КАК Номенклатура,
	|ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения 	КАК ЕдиницаИзмерения,
	|ВидыЗапасов.Количество 					КАК Количество,
	|	ВЫБОР
	|		КОГДА ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ""ВозвратнаяТара""
	|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК Строка(18))
	|		ИНАЧЕ ВЫРАЗИТЬ(""СобственныеТовары"" КАК Строка(18))
	|	КОНЕЦ 									КАК ТипЗапасов
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК ВидыЗапасов
	|ГДЕ
	|	ВидыЗапасов.Ссылка = &Ссылка
	|";
	ДанныеXDTO.Вставить("Товары", Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&После ("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура Док_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		// изменение 
		ДобавитьПКО_ПередачаТоваровМеждуОрганизациями_Излишки(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ДоговорыОрганизаций_ИзСтруктуры(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПКОРозничнаяВыручка_Отправка(ПравилаКонвертации);
		
		//добавление      
		ДобавитьПКО_Документ_ПорчаТоваров_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПорчаВОприходование_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПорчаВСписаниеЗапасов_Отправка(ПравилаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КомментарийВСписаниеТоваров_НоменклатураСписанияВОприходовании
&После ("ДобавитьПКО_Документ_ВнутреннееПотребление_ВПроизводство_Отпр")
Процедура Док_ДобавитьПКО_Документ_ВнутреннееПотребление_ВПроизводство_Отпр(ПравилаКонвертации)
	ДобавитьИзменитьПКС(ПравилаКонвертации,"Документ_ВнутреннееПотребление_ВПроизводство_Отпр","Товары",Новый Структура("СвойствоКонфигурации,СвойствоФормата,ИспользуетсяАлгоритмКонвертации","","Комментарий",истина));
КонецПроцедуры
&Вместо ("ПКО_Документ_ВнутреннееПотребление_ВЭксплуатацию_Отпра_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_ВнутреннееПотребление_ВЭксплуатацию_Отпра_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтрокиДокумента,
	|	Товары.Номенклатура КАК Номенклатура,
	|	&ТекстЗапросаХарактеристика,
	|	&ТекстЗапросаСерия,
	|	&ТекстЗапросаУпаковка,
	|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	&ТипЗапасов КАК ТипЗапасов,
	|	Товары.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Товары.Ссылка.Подразделение КАК Подразделение,
	|	Товары.СтатьяРасходов.КорреспондирующийСчет КАК СтатьяРасходовКорСчет,
	|	Товары.СтатьяРасходов.Наименование КАК СтатьяРасходовНаименование,
	//++ Локализация
	|	Товары.КатегорияЭксплуатации.СрокЭксплуатации КАК СрокЭксплуатации,
	|	Товары.КатегорияЭксплуатации.Наименование КАК КатегорияЭксплуатацииНаименование,
	
	//-- Локализация
	// изменение
	//|	Товары.СтатьяРасходов КАК СтатьяЗатрат,
	|	Товары.СтатьяРасходовБУ КАК СтатьяЗатрат,
	
	|	Товары.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	Документ.ВнутреннееПотребление.Товары КАК Товары
	//++ Локализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииЭксплуатации КАК КатегорииЭксплуатации
	|		ПО Товары.КатегорияЭксплуатации = КатегорииЭксплуатации.Ссылка
	
	//-- Локализация
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристика",
	ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "Товары"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаУпаковка",
	ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "Товары"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаСерия",
	ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "Товары"));
	
	ТипЗапасовВЗапросе = "&СобственныеТовары";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТипЗапасов", ТипЗапасовВЗапросе);
	
	ЗаполнитьСобственныеТоварыВТексте(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	ТаблицаТовары = Запрос.Выполнить().Выгрузить();
	ТаблицаТовары.Колонки.Добавить("НаименованиеНазначенияИспользования");
	ТаблицаТовары.Колонки.Добавить("НаименованиеСпособаОтраженияРасходов");
	ТаблицаТовары.Колонки.Добавить("ПодразделениеЗатрат");
	
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, ТаблицаТовары);
	
	Для Каждого Строка Из ТаблицаТовары Цикл
		
		//++ Локализация
		Строка.НаименованиеНазначенияИспользования  = Строка.КатегорияЭксплуатацииНаименование;
		//-- Локализация
		Строка.НаименованиеСпособаОтраженияРасходов = Строка.СтатьяРасходовНаименование;
		
		Если ЗначениеЗаполнено(Строка.СтатьяРасходовКорСчет) Тогда
			НаименованиеСпособаОтраженияРасходов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 счет( %2)'"),
			СокрЛП(Строка.НаименованиеСпособаОтраженияРасходов),
			Строка.СтатьяРасходовКорСчет);
			Строка.НаименованиеСпособаОтраженияРасходов = НаименованиеСпособаОтраженияРасходов;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Подразделение) Тогда
			СтруктураПодразделение = Новый Структура;
			ВыгрузитьПодразделение(ДанныеИБ, СтруктураПодразделение, Строка.Подразделение);
			Строка.ПодразделениеЗатрат = СтруктураПодразделение.Подразделение;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеXDTO.Вставить("Товары", ТаблицаТовары);
КонецПроцедуры   

&После ("ПКО_Документ_ПересортицаВОприходование_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_ПересортицаВОприходование_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	МассивКолонки=ДанныеXDTO.Товары.ВыгрузитьКолонку("Номенклатура");  
	МассивСтр="";
	для каждого стр из МассивКолонки цикл          
		МассивСтр=МассивСтр+стр.УникальныйИдентификатор()+";";
	конеццикла;	
	ДанныеXDTO.Вставить("AdditionalInfo",МассивСтр);
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);

КонецПроцедуры

&После ("ДобавитьПКО_Документ_ПересортицаВОприходование_Отправка")
Процедура Док_ДобавитьПКО_Документ_ПересортицаВОприходование_Отправка(ПравилаКонвертации)
	ДобавитьИзменитьПКС(ПравилаКонвертации,"Документ_ПересортицаВОприходование_Отправка","Товары",Новый Структура("СвойствоКонфигурации,СвойствоФормата,ИспользуетсяАлгоритмКонвертации,ПравилоКонвертацииСвойства","","НоменклатураСписание",истина,"Справочник_Номенклатура_Отправка"));
	ДобавитьИзменитьПКС(ПравилаКонвертации,"Документ_ПересортицаВОприходование_Отправка","AdditionalInfo",Новый Массив);
КонецПроцедуры

#КонецОбласти

#Область УбратьСчетаНаОплату_ДокументыСЧФ_Реализация_ТранспортныеРасходы
&После ("ПОД_Документ_ЗаявкаНаРасходДС_Отправка_ПриОбработке")
Процедура Док_ПОД_Документ_ЗаявкаНаРасходДС_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	УстановитьИспользованиеПКО(ИспользованиеПКО, Ложь);
	возврат;
КонецПроцедуры      
&После ("ПОД_Документ_РеализацияУслугПрочихАктивов_Отправка_ПриОбработке")
Процедура Док_ПОД_Документ_РеализацияУслугПрочихАктивов_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	если Найти(Строка(ДанныеИБ.Контрагент),"СЧФ Реализация")>0 тогда
		ИспользованиеПКО.Документ_РеализацияУслугПрочихАктивов_Отправка=ложь;
	иначе
		ИспользованиеПКО.Документ_РеализацияУслугПрочихАктивов_Отправка=истина;
	конецесли;
КонецПроцедуры
&После ("ПОД_Документ_СчетФактураВыданный_Отправка_ПриОбработке")
Процедура Док_ПОД_Документ_СчетФактураВыданный_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	// изменение
	если Найти(Строка(ДанныеИБ.Контрагент),"СЧФ Реализация")>0 тогда
		ИспользованиеПКО.Документ_СчетФактураВыданный_Отправка = Ложь;
	конецесли;
	
КонецПроцедуры
&После ("ПОД_Документ_ПоступлениеТоваровУслуг_Отправка_ПриОбработке")
Процедура Док_ПОД_Документ_ПоступлениеТоваровУслуг_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	// изменение
	если ДанныеИБ.Контрагент.Наименование="Транспортные расходы" тогда
		ИспользованиеПКО.Документ_ПоступлениеТоваровУслуг_Отправка = ложь;
		ИспользованиеПКО.Документ_ПТУЧерезПодотчетноеЛицо_Отправка = ложь;
	конецесли;
	
КонецПроцедуры
#КонецОбласти

#Область Подстановка_Склады_СтатьиДДС_Расходов_Доходов
&ИзменениеИКонтроль ("ПКО_Справочник_Склады_Отправка_ПриОтправкеДанных")
Процедура ДОК_ПКО_Справочник_Склады_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	#Вставка
	если значениеЗаполнено(ДанныеИБ.Ссылка.СкладДляБухгалтерии) тогда
		ДанныеИБ=ДанныеИБ.СкладДляБухгалтерии;
	конецесли;
	#КонецВставки	
	
	Адрес = Неопределено;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеИБ.Ссылка,
		Справочники.ВидыКонтактнойИнформации.АдресСклада,,Ложь);
		
		Адрес = ?(Адрес.Количество() > 0, Адрес[0], Неопределено);
		
		ДанныеXDTO.КлючевыеСвойства.Вставить("СкладГруппа", ДанныеИБ.Родитель);
		
		//++ Локализация
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.8")
			И Адрес <> Неопределено И Не ПустаяСтрока(Адрес.Значение) Тогда
			
			КодАдресаФИАС = АдресныйКлассификатор.КодыАдреса(Адрес.Значение).Идентификатор;
			Если ЗначениеЗаполнено(КодАдресаФИАС) Тогда
				ДанныеXDTO.КлючевыеСвойства.Вставить("КодАдресаФИАС", XMLСтрока(КодАдресаФИАС));
			КонецЕсли;
		КонецЕсли;
		//-- Локализация
	КонецЕсли;
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.7") Тогда
		ДанныеXDTO.Вставить("Группа", ДанныеИБ.Родитель);
	КонецЕсли;        
	//Подразделение
	Если ЗначениеЗаполнено(ДанныеИБ.Подразделение) Тогда
		СтруктураДанныеПодразделения = Новый Структура("Наименование, РегистрацияПодразделенияВНалоговомОргане", 
		ДанныеИБ.Подразделение.Наименование, Неопределено);
		ДанныеXDTO.Вставить("Подразделение", Новый Структура("Значение, ИмяПКО", СтруктураДанныеПодразделения, "Справочник_Подразделения_ИзСтруктуры"));
	Иначе
		ДанныеXDTO.Вставить("Подразделение", Неопределено);	
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		Если Адрес <> Неопределено И ЗначениеЗаполнено(Адрес.Представление) Тогда
			ДанныеXDTO.Вставить("АдресСтрокой", Адрес.Представление);
		КонецЕсли;
		
		ПодготовитьДанныеКонтактнаяИнформация(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена);
	КонецЕсли;
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
КонецПроцедуры
&Перед ("ПКО_Справочник_СтатьиДоходов_ПриОтправкеДанных")
Процедура ДОК_ПКО_Справочник_СтатьиДоходов_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Значение=ДанныеИБ;
	если ЗначениеЗаполнено(ДанныеИБ.Родитель.Родитель.Родитель) тогда
		Значение=ДанныеИБ.Родитель.Родитель.Родитель;
	иначеесли ЗначениеЗаполнено(ДанныеИБ.Родитель.Родитель) тогда
		Значение=ДанныеИБ.Родитель.Родитель;
	иначеесли ЗначениеЗаполнено(ДанныеИБ.Родитель) тогда
		Значение=ДанныеИБ.Родитель;
	Конецесли;
	если ДанныеИБ<>значение тогда 	
		ДанныеXDTO.Вставить("Ссылка",значение);
		ДанныеXDTO.Вставить("Наименование",значение.Наименование);
		ДанныеXDTO.Вставить("КодВПрограмме",Значение.код);
		ДанныеИБ=Значение;
	конецесли;	
КонецПроцедуры
&Перед ("ПКО_Справочник_СтатьиРасходов_ПриОтправкеДанных")
Процедура ДОК_ПКО_Справочник_СтатьиРасходов_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Значение=ДанныеИБ;
	если ЗначениеЗаполнено(ДанныеИБ.Родитель.Родитель.Родитель) тогда
		Значение=ДанныеИБ.Родитель.Родитель.Родитель;
	иначеесли ЗначениеЗаполнено(ДанныеИБ.Родитель.Родитель) тогда
		Значение=ДанныеИБ.Родитель.Родитель;
	иначеесли ЗначениеЗаполнено(ДанныеИБ.Родитель) тогда
		Значение=ДанныеИБ.Родитель;
	Конецесли;
	если ДанныеИБ<>значение тогда 	
		ДанныеXDTO.Вставить("Ссылка",значение);
		ДанныеXDTO.Вставить("Наименование",значение.Наименование);
		ДанныеXDTO.Вставить("КодВПрограмме",Значение.код);
		ДанныеИБ=Значение;
	конецесли;	
	
КонецПроцедуры
&ИзменениеИКонтроль ("ПОД_Справочник_СтатьиДДС_Отправка_ПриОбработке")
Процедура ДОК_ПОД_Справочник_СтатьиДДС_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	#Удаление 
	Если ДанныеИБ.ЭтоГруппа Тогда
		ИспользованиеПКО.Удалить("Справочник_СтатьиДДС");
	Иначе
		ИспользованиеПКО.Удалить("Справочник_СтатьиДДС_Группа");
	КонецЕсли;
	#КонецУдаления
	#Вставка
	ИспользованиеПКО.Справочник_СтатьиДДС = истина;
	#КонецВставки
КонецПроцедуры
&Вместо ("ПКО_Справочник_СтатьиДДС_ПриОтправкеДанных")
Процедура ДОК_ПКО_Справочник_СтатьиДДС_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Значение=ДанныеИБ;
	если ЗначениеЗаполнено(ДанныеИБ.Родитель.Родитель) тогда
		Значение=ДанныеИБ.Родитель.Родитель;
	иначеесли ЗначениеЗаполнено(ДанныеИБ.Родитель) тогда
		Значение=ДанныеИБ.Родитель;
	Конецесли;
	если ДанныеИБ<>значение тогда 	
		ДанныеXDTO.Вставить("Ссылка",значение);
		ДанныеXDTO.Вставить("Наименование",значение.Наименование);
		ДанныеXDTO.Вставить("КодВПрограмме",Значение.код);
		ДанныеИБ=Значение;
	конецесли;	
КонецПроцедуры
&ИзменениеИКонтроль ("СкладДляВыгрузки")
Функция ДОК_СкладДляВыгрузки(СкладИсходный, ПараметрыКонвертации, ПроверятьНаГруппу = Ложь)
	Если ПараметрыКонвертации.ВыгружатьАналитикуПоСкладам = ЛОЖЬ Тогда
		// отправляем пустой склад
		Возврат Справочники.Склады.ПустаяСсылка();
	Иначе
		Если ПроверятьНаГруппу И СкладИсходный.ЭтоГруппа Тогда
			Возврат Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
		#Вставка
		если значениеЗаполнено(СкладИсходный.СкладДляБухгалтерии) тогда
			возврат СкладИсходный.СкладДляБухгалтерии;
		конецесли;
		#КонецВставки 
		Возврат СкладИсходный;
	КонецЕсли;
КонецФункции
#КонецОбласти

#Область ВыемкаИзКассыККМ
&После ("ПОД_Документ_ПриходныйКассовыйОрдер_ПриОбработке")
Процедура ДОК_ПОД_Документ_ПриходныйКассовыйОрдер_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ Тогда
		ИспользованиеПКО.Удалить("Документ_ПКОПоступлениеИзКассыККМ_Отправка");
		//	ИспользованиеПКО.Документ_ПКОПоступлениеИзКассыККМ_Отправка = Истина;
		ИспользованиеПКО.Документ_ПКОРозничнаяВыручка_Отправка = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПКО_Документ_ПКОРозничнаяВыручка_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ПКОРозничнаяВыручка_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ПриходныйКассовыйОрдер;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ПКОРозничнаяВыручка";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПКОРозничнаяВыручка_Отправка_ПриОтправкеДанных";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Валюта",         "Валюта", , "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "ВТомЧислеНДС",   "ВТомЧислеНДС");
	ДобавитьПКС(СвойстваШапки, "Дата",           "Дата");
	ДобавитьПКС(СвойстваШапки, "Кассир",         "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "Комментарий",    "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Номер",          "Номер");
	// изменение
	//ДобавитьПКС(СвойстваШапки, "НомерЧекаККМ",   "НомерЧекаККМ");
	ДобавитьПКС(СвойстваШапки, "Организация",    "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "Основание",      "Основание");
	ДобавитьПКС(СвойстваШапки, "Приложение",     "Приложение");
	ДобавитьПКС(СвойстваШапки, "ПринятоОт",      "ПринятоОт");
	ДобавитьПКС(СвойстваШапки, "СуммаДокумента", "Сумма");
	ДобавитьПКС(СвойстваШапки, "",               "ВыручкаНТТ", 1);
	ДобавитьПКС(СвойстваШапки, "",               "Подразделение", 1);
	ДобавитьПКС(СвойстваШапки, "",               "Склад", 1, "Справочник_Склады_Отправка");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1, "Справочник_ДополнительныеРеквизиты");
	
КонецПроцедуры

Процедура ПКО_Документ_ПКОРозничнаяВыручка_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	СкладДляВыгрузки = СкладДляВыгрузки(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.КассаККМ, "Склад"), КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	ДанныеXDTO.Вставить("ВыручкаНТТ", Ложь);
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Касса");
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
КонецПроцедуры

#КонецОбласти

&После ("ПОД_Документ_ПеремещениеТоваров_ПриОбработке")
Процедура ДОК_ПОД_Документ_ПеремещениеТоваров_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	если ДанныеИБ.ПеремещениеНаФилиал тогда
		ИспользованиеПКО.Документ_ПеремещениеТоваров_Отправка = Ложь;
	конецесли;	
	СкладОтправитель=СкладДляВыгрузки(ДанныеИБ.СкладОтправитель, КомпонентыОбмена.ПараметрыКонвертации);
	СкладПолучатель=СкладДляВыгрузки(ДанныеИБ.СкладПолучатель, КомпонентыОбмена.ПараметрыКонвертации);
	если СкладОтправитель=СкладПолучатель тогда
		ИспользованиеПКО.Документ_ПеремещениеТоваров_Отправка = Ложь;
	конецесли;
КонецПроцедуры
&Перед ("ПКО_Документ_ПеремещениеТоваров_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_ПеремещениеТоваров_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ДанныеИБ.СкладОтправитель = СкладДляВыгрузки(ДанныеИБ.СкладОтправитель, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеИБ.СкладПолучатель = СкладДляВыгрузки(ДанныеИБ.СкладПолучатель, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("СкладОтправитель", ДанныеИБ.СкладОтправитель);
	ДанныеXDTO.Вставить("СкладПолучатель", ДанныеИБ.СкладПолучатель);
	
КонецПроцедуры
&После ("ДобавитьПКО_Документ_ПеремещениеТоваров_Отправка")
Процедура Док_ДобавитьПКО_Документ_ПеремещениеТоваров_Отправка(ПравилаКонвертации)
	ДобавитьИзменитьПКС(ПравилаКонвертации,"Документ_ПеремещениеТоваров_Отправка",,Новый Структура("СвойствоКонфигурации,ИспользуетсяАлгоритмКонвертации","СкладОтправитель",истина));
	ДобавитьИзменитьПКС(ПравилаКонвертации,"Документ_ПеремещениеТоваров_Отправка",,Новый Структура("СвойствоКонфигурации,ИспользуетсяАлгоритмКонвертации","СкладПолучатель",истина));
КонецПроцедуры

&После ("ПКО_ПередачаМеждуОрганизациями_ПТУ_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_ПередачаМеждуОрганизациями_ПТУ_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	если значениезаполнено(ДанныеИБ.СкладПолучатель) тогда
		СкладДляВыгрузки=СкладДляВыгрузки(ДанныеИБ.СкладПолучатель, КомпонентыОбмена.ПараметрыКонвертации);
		ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
		ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "СкладПолучатель");
	конецесли;
КонецПроцедуры

Процедура Док_ДоговорСКомитентом_ИспользуетсяАльтерраИ1СК(ДанныеИБ, НазваниеПоУмолчанию)
	Если ДанныеИБ.Свойство("Организация") И ДанныеИБ.Организация = Справочники.Организации.НайтиПоНаименованию("Альтерра") И
		ДанныеИБ.Свойство("Контрагент") И ДанныеИБ.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("1СК") И
		ДанныеИБ.Свойство("ВидДоговора") И ДанныеИБ.ВидДоговора = "СКомитентом" И
		ДанныеИБ.Свойство("Наименование") И ЗначениеЗаполнено(ДанныеИБ.Наименование) И
		ЗначениеЗаполнено(Справочники.ДоговорыМеждуОрганизациями.НайтиПоНаименованию(ДанныеИБ.Наименование)) Тогда
		
		НазваниеПоУмолчанию = ДанныеИБ.Наименование;
	КонецЕсли;
КонецПроцедуры
&ИзменениеИКонтроль ("ПКО_Справочник_ДоговорыКонтрагентов_ИзСтруктуры_ПриОтправкеДанных")
Процедура Док_ПКО_Справочник_ДоговорыКонтрагентов_ИзСтруктуры_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	#Вставка
	ВидДоговора = ДанныеИБ.ВидДоговора;
	Если ВидДоговора = "СПоставщиком" Тогда
		ВидДоговора = НСтр("ru = 'С поставщиком'");
	ИначеЕсли ВидДоговора = "СПокупателем" Тогда
		ВидДоговора = НСтр("ru = 'С покупателем'");
	ИначеЕсли ВидДоговора = "СКомитентом" Тогда
		ВидДоговора = НСтр("ru = 'С комитентом'");
	ИначеЕсли ВидДоговора = "СКомиссионером" Тогда
		ВидДоговора = НСтр("ru = 'С комиссионером'");
	КонецЕсли;
	НазваниеПоУмолчанию = ""+ВидДоговора + НСтр("ru = ', '") + НРег(ДанныеИБ.ВалютаВзаиморасчетов)+ ?(ДанныеИБ.РасчетыВУсловныхЕдиницах, НСтр("ru = ' (у.е.)'"),"");
	Если ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ 
		 ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") ИЛИ
		 ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") ИЛИ
		 ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") ИЛИ
		 ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") ИЛИ
		 ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ
		 ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") ИЛИ 
		 ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") ИЛИ 
		 ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.КорректировкаЗадолженности") Тогда
		Если ДанныеXDTO.Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо ИЛИ
			ДанныеИБ.Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			Если  ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.КорректировкаЗадолженности") Тогда
				НазваниеПоУмолчанию = Строка(СтекВыгрузки[0].Задолженность[0].Партнер.Наименование) + " " + Строка(СтекВыгрузки[0].Задолженность[0].Партнер.код);
			иначеесли ТипЗнч(СтекВыгрузки[0]) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				НазваниеПоУмолчанию = Строка(СтекВыгрузки[0].КонтрагентДебитор.Партнер.Наименование) + " " + Строка(СтекВыгрузки[0].КонтрагентДебитор.Партнер.код);
			Иначе	
				НазваниеПоУмолчанию = Строка(СтекВыгрузки[0].Партнер.Наименование) + " " + Строка(СтекВыгрузки[0].Партнер.код);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Док_ДоговорСКомитентом_ИспользуетсяАльтерраИ1СК(ДанныеИБ, НазваниеПоУмолчанию);
	ДанныеXDTO.Вставить("Наименование", НазваниеПоУмолчанию);
	если ДанныеXDTO.Свойство("КлючевыеСвойства") и ДанныеXDTO.КлючевыеСвойства.Свойство("Наименование") тогда
		ДанныеXDTO.КлючевыеСвойства.Вставить("Наименование", НазваниеПоУмолчанию);
	конецесли;
	#КонецВставки
	Если ТипЗнч(ДанныеИБ) = Тип("Структура") И ДанныеИБ.Свойство("ДополнительныеРеквизиты")
		И ТипЗнч(ДанныеИБ.ДополнительныеРеквизиты) = Тип("ТаблицаЗначений") Тогда
		
		Если ДанныеИБ.ДополнительныеРеквизиты.КОличество() > 0 Тогда
			ДанныеXDTO.Вставить("ДополнительныеРеквизиты", ДанныеИБ.ДополнительныеРеквизиты);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&ИзменениеИКонтроль ("КонтрагентИзОрганизации")
Функция Док_КонтрагентИзОрганизации(Знач ОрганизацияДляСозданияКонтрагента, КомпонентыОбмена)
	// Проверим, есть ли в базе контрагент, созданный по организации, если нет, то создадим его и выгрузим.
	СсылкаНаКонтрагента = Справочники.Контрагенты.ПолучитьСсылку(ОрганизацияДляСозданияКонтрагента.УникальныйИдентификатор());
	#Вставка
	СсылкаНаКонтрагента = справочники.Контрагенты.ПустаяСсылка();
	#КонецВставки
	Если НЕ ОбщегоНазначения.СсылкаСуществует(СсылкаНаКонтрагента) ИЛИ СсылкаНаКонтрагента.ПолучитьОбъект() = Неопределено Тогда
		
		ЗапросКонтр = Новый Запрос;
		ЗапросКонтр.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ Справочник.Контрагенты
		|ГДЕ Наименование = &Наименование 
		|	И ИНН = &ИНН
		|	И КПП = &КПП
		|	И ЮридическоеФизическоеЛицо = &ЮридическоеФизическоеЛицо";
		ЗапросКонтр.УстановитьПараметр("Наименование", ОрганизацияДляСозданияКонтрагента.Наименование);
		ЗапросКонтр.УстановитьПараметр("ИНН", ОрганизацияДляСозданияКонтрагента.ИНН);
		ЗапросКонтр.УстановитьПараметр("КПП", ОрганизацияДляСозданияКонтрагента.КПП);
		ЗапросКонтр.УстановитьПараметр("ЮридическоеФизическоеЛицо", ОрганизацияДляСозданияКонтрагента.ЮридическоеФизическоеЛицо);
		Выборка = ЗапросКонтр.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СсылкаНаКонтрагента = Выборка.Ссылка;
			Возврат СсылкаНаКонтрагента;
		КонецЕсли;
		
		СоздаваемыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СоздаваемыйКонтрагент, ОрганизацияДляСозданияКонтрагента,
		"ПометкаУдаления,ИНН,КодПоОКПО,КПП,НаименованиеПолное,ЮрФизЛицо,Наименование,ОбособленноеПодразделение");
		
		Если СоздаваемыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель
			Или СоздаваемыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			
			СоздаваемыйКонтрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			
		ИначеЕсли СоздаваемыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо
			Или СоздаваемыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
			
			СоздаваемыйКонтрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			
		КонецЕсли;
		
		Если СоздаваемыйКонтрагент.ОбособленноеПодразделение Тогда
			ОрганизацияДляСозданияКонтрагента = ОрганизацияДляСозданияКонтрагента.ГоловнаяОрганизация;
			ГоловнойКонтрагент = КонтрагентИзОрганизации(ОрганизацияДляСозданияКонтрагента, КомпонентыОбмена);
			СоздаваемыйКонтрагент.ГоловнойКонтрагент = ГоловнойКонтрагент;
		Иначе
			СоздаваемыйКонтрагент.ГоловнойКонтрагент = СсылкаНаКонтрагента;
		КонецЕсли;
		
		ПартнерОбъект = Справочники.Партнеры.СоздатьЭлемент();
		СинхронизироватьДанныеПартнераСДаннымиКонтрагента(ПартнерОбъект, СоздаваемыйКонтрагент, КомпонентыОбмена);
		СоздаваемыйКонтрагент.Партнер = ПартнерОбъект.Ссылка;
		
		СоздаваемыйКонтрагент.УстановитьСсылкуНового(СсылкаНаКонтрагента);
		СоздаваемыйКонтрагент.ОбменДанными.Загрузка = Истина;
		СоздаваемыйКонтрагент.Записать();
		
		СозданныеПриВыгрузкеОбъекты = КомпонентыОбмена.ПараметрыКонвертации.СозданныеПриВыгрузкеОбъекты; // Массив
		СозданныеПриВыгрузкеОбъекты.Добавить(СоздаваемыйКонтрагент.Ссылка);
		
		СсылкаНаКонтрагента = СоздаваемыйКонтрагент.Ссылка;
	КонецЕсли;
	Возврат СсылкаНаКонтрагента;
КонецФункции

Процедура ТаблицаУслугЗаполнитьПринципалаДоговор(КомпонентыОбмена, ТабУслуги,ДанныеИБ=НЕОПРЕДЕЛЕНО)
	ТабУслуги.Колонки.Добавить("Принципал");
	// изменено добавить договор
	ТабУслуги.Колонки.Добавить("ДоговорСПринципалом");
	
	Для Каждого СтрокаУслуги Из ТабУслуги Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаУслуги.ПринципалСсылка) Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(СтрокаУслуги.ПринципалСсылка) = Тип("СправочникСсылка.Организации") Тогда
			СтрокаУслуги.Принципал = КонтрагентИзОрганизации(СтрокаУслуги.ПринципалСсылка, КомпонентыОбмена);
		ИначеЕсли ТипЗнч(СтрокаУслуги.ПринципалСсылка) = Тип("СправочникСсылка.Партнеры") Тогда
			СтрокаУслуги.Принципал = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(СтрокаУслуги.ПринципалСсылка);
		КонецЕсли;
		// изменение агентский договор
		//если ДанныеИБ<>НЕОПРЕДЕЛЕНО тогда
		СтрокаУслуги.ДоговорСПринципалом=ПолучитьАгентскийДоговорПоУмолчанию(ДанныеИБ.Организация,ДанныеИБ.Дата,СтрокаУслуги.Принципал) ;	
		//конецесли;
	КонецЦикла;
КонецПроцедуры

&ИзменениеИКонтроль ("ПКО_Документ_РеализацияТоваровУслуг_Отправка_ПриОтправкеДанных")
Процедура ДОК_ПКО_Документ_РеализацияТоваровУслуг_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_РеализацияТоваровУслуг_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_РеализацияТоваровУслуг_Отправка", 
										"Товары", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_РеализацияТоваровУслуг_Отправка", 
										"Услуги", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	ВидОперацииСтрокой = "";
	
	Если Не ЗначениеЗаполнено(ДанныеИБ.ХозяйственнаяОперация) Тогда
		ВидОперацииСтрокой = "РеализацияКлиенту";
	ИначеЕсли ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда
		
		Если ДанныеИБ.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.ВПути Тогда
			ВидОперацииСтрокой = "ОтгрузкаБезПереходаПравСобственности_ВПути";
		Иначе
			ВидОперацииСтрокой = "ОтгрузкаБезПереходаПравСобственности_Реализовано"; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВидОперацииСтрокой <> "" Тогда
		ДанныеXDTO.Вставить("ВидОперации", ВидОперацииСтрокой); 
	Иначе
		ДанныеXDTO.Вставить("ВидОперации", "РеализацияКлиенту");
	КонецЕсли; 
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.15") Тогда
		ДанныеXDTO.Вставить("ЭтапГосконтрактаЕИС", ДанныеИБ.ЭтапГосконтрактаЕИС);    
	КонецЕсли; 
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации, Истина);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	ДанныеXDTO.Вставить("ГлавныйБухгалтер", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.ГлавныйБухгалтер, "ФизическоеЛицо"));
	ДанныеXDTO.Вставить("Руководитель",     ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.Руководитель, "ФизическоеЛицо"));
	
	#Удаление
	Если ДанныеИБ.РеализацияПоЗаказам И ЗначениеЗаполнено(ДанныеИБ.ЗаказКлиента) 
		И ТипЗнч(ДанныеИБ.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ДанныеXDTO.Вставить("Заказ", ДанныеИБ.ЗаказКлиента);
	Иначе
		ДанныеXDTO.Вставить("Заказ", Неопределено);
	КонецЕсли;
	#КонецУдаления
	#Вставка
	ДанныеXDTO.Вставить("Заказ", Неопределено); 
	СведенияКонтрагента=ВозвратитьДанныеКонтрагента(ДанныеИБ.Ссылка);
	ДанныеИБ.Контрагент=СведенияКонтрагента.Контрагент;
	ДанныеXDTO.Вставить("Контрагент",СведенияКонтрагента.Контрагент);
	ДанныеИБ.Договор=?(СведенияКонтрагента.Подмена,Неопределено,ДанныеИБ.Договор);
	#КонецВставки
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь);
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	ВыгрузитьПризнакКомплектПечатныхДокументовПодписан(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация);
	
	// Дополнительные свойства для договора
	Если ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
		ДанныеXDTO.Вставить("Договор", ДанныеИБ.Договор);
	Иначе
		
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ЗаполнитьЗначенияСвойств(ПараметрыПоУмолчанию, ДанныеИБ);
		
		ПараметрыПоУмолчанию.ВидДоговора =
			?(ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию, "СКомиссионером", "СПокупателем");
			
		Если ЗначениеЗаполнено(ДанныеИБ.Соглашение) Тогда
			ДанныеРасчетаУЕ          = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.Соглашение, "ВалютаВзаиморасчетов, ОплатаВВалюте, Организация");
			РасчетыВУсловныхЕдиницах = ВедетсяРасчетВУЕ(ДанныеРасчетаУЕ.ВалютаВзаиморасчетов, ДанныеРасчетаУЕ.ОплатаВВалюте, ДанныеРасчетаУЕ.Организация, КомпонентыОбмена);
		Иначе
			РасчетыВУсловныхЕдиницах = (ДанныеИБ.Валюта = ВалютаРеглУчета И ДанныеИБ.Валюта <> ДанныеИБ.ВалютаВзаиморасчетов);
		КонецЕсли;
		
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = РасчетыВУсловныхЕдиницах;
		
		Заказ = Новый Структура("Заказ, Соглашение, Сделка", ДанныеИБ.ЗаказКлиента, ДанныеИБ.Соглашение, ДанныеИБ.Сделка);
		Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, Заказ, ДанныеИБ);
		
		ДанныеXDTO.Вставить("Договор", Договор);
		
	КонецЕсли;
	
	// Данные шапки документа необходимы для вычисления
	// курса и кратности взаиморасчетов.
	ШапкаДокумента =
		"ВЫБРАТЬ
		|	ДанныеШапкиДокумента.Валюта КАК Валюта,
		|	ДанныеШапкиДокумента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ДанныеШапкиДокумента.КурсЧислитель КАК КурсВзаиморасчетов,
		|	ДанныеШапкиДокумента.КурсЗнаменатель КАК КратностьВзаиморасчетов
		|ПОМЕСТИТЬ ДанныеШапкиДокумента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК ДанныеШапкиДокумента
		|ГДЕ
		|	ДанныеШапкиДокумента.Ссылка = &Ссылка
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта";
		
	Если ДанныеИБ.Валюта = ВалютаРеглУчета
		Или ДанныеИБ.ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
		
		ДанныеОперации =
			"ВЫБРАТЬ
			|	ДанныеШапкиДокумента.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
			|	ДанныеШапкиДокумента.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов
			|ИЗ
			|	ДанныеШапкиДокумента КАК ДанныеШапкиДокумента";
		
	Иначе
		
		ДанныеОперации =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(КурсВалютыДокумента.КурсЧислитель, 1) КАК КурсВзаиморасчетов,
			|	ЕСТЬNULL(КурсВалютыДокумента.КурсЗнаменатель, 1) КАК КратностьВзаиморасчетов
			|ИЗ
			|	ДанныеШапкиДокумента КАК ДанныеШапкиДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
			|				&Дата,
			|				Валюта В
			|					(ВЫБРАТЬ
			|						Док.Валюта
			|					ИЗ
			|						ДанныеШапкиДокумента КАК Док)
			|				И БазоваяВалюта = &БазоваяВалюта) КАК КурсВалютыДокумента
			|		ПО ДанныеШапкиДокумента.Валюта = КурсВалютыДокумента.Валюта";
		
	КонецЕсли;
	
	ТоварыИУслугиДокумента =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА Товары.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ХарактеристикаСпр.НаименованиеПолное = """"
		|						ТОГДА ХарактеристикаСпр.Наименование
		|					ИНАЧЕ ХарактеристикаСпр.НаименованиеПолное
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ХарактеристикаНаименование,
		|	ВЫБОР
		|		КОГДА НоменклатураСпр.НаименованиеПолное = """"
		|			ТОГДА НоменклатураСпр.Наименование
		|		ИНАЧЕ НоменклатураСпр.НаименованиеПолное
		|	КОНЕЦ КАК НоменклатураНаименование,
		|	Товары.Количество КАК Количество,
		|	Товары.Цена КАК Цена,
		|	Товары.Сумма КАК Сумма,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.СуммаНДС КАК СуммаНДС,
		|	Товары.Номенклатура.ТипНоменклатуры КАК НоменклатураТипНоменклатуры,
		#Вставка
		|	Товары.Ссылка.РаспределитьТранспортные КАК РаспределитьТранспортные, 
		#КонецВставки
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.ПроцентРучнойСкидки КАК ПроцентСкидки,
		|	Товары.СуммаРучнойСкидки КАК СуммаСкидки,
		|	Товары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБаллов,
		|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Товары.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА &РеализацияПоЗаказам
		|				И &РеализацияПоНесколькимЗаказам
		|				И Товары.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
		|			ТОГДА Товары.ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Заказ
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО (НоменклатураСпр.Ссылка = Товары.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикаСпр
		|		ПО (ХарактеристикаСпр.Ссылка = Товары.Характеристика)
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		|	ВидыЗапасов.Упаковка КАК Упаковка,
		|	ВидыЗапасов.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВидыЗапасов.Количество КАК Количество,
		|	ВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
		#Удаление
		|	ВидыЗапасов.СуммаНДС КАК СуммаНДС,
		#КонецУдаления
		#Вставка     
		|	ВидыЗапасов.СуммаНДС+ВидыЗапасов.СуммаНДСРТ КАК СуммаНДС,
		#КонецВставки
		|	ВидыЗапасов.НомерГТД КАК НомерГТД,
		|	ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
		|	ВидыЗапасов.Ссылка.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
		#Удаление
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ВидыЗапасов.Ссылка.ЦенаВключаетНДС
		|				ТОГДА ВидыЗапасов.СуммаСНДС / ВидыЗапасов.Количество
		|			ИНАЧЕ (ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС) / ВидыЗапасов.Количество
		|		КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.Ссылка.ЦенаВключаетНДС
		|			ТОГДА ВидыЗапасов.СуммаСНДС
		|		ИНАЧЕ ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС
		|	КОНЕЦ КАК Сумма,
		#КонецУдаления
		#Вставка      
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ВидыЗапасов.Ссылка.ЦенаВключаетНДС
		|				ТОГДА (ВидыЗапасов.СуммаСНДС + ВидыЗапасов.СуммаСНДСРТ) / ВидыЗапасов.Количество
		|			ИНАЧЕ (ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС + ВидыЗапасов.СуммаСНДСРТ - ВидыЗапасов.СуммаНДСРТ) / ВидыЗапасов.Количество
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.Ссылка.ЦенаВключаетНДС
		|			ТОГДА ВидыЗапасов.СуммаСНДС+ВидыЗапасов.СуммаСНДСРТ
		|		ИНАЧЕ ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС + ВидыЗапасов.СуммаСНДСРТ - ВидыЗапасов.СуммаНДСРТ
		|	КОНЕЦ КАК Сумма,
		
		#КонецВставки
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
		|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
		|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
		|	КОНЕЦ КАК ТипЗапасов,
		|	ВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.СуммаРучнойСкидки > 0
		|			ТОГДА ВидыЗапасов.СуммаРучнойСкидки
		|		КОГДА ВидыЗапасов.СуммаАвтоматическойСкидки > 0
		|			ТОГДА ВидыЗапасов.СуммаАвтоматическойСкидки
		|	КОНЕЦ КАК СуммаСкидки,
		|	ВЫБОР
		|		КОГДА &РеализацияПоЗаказам
		|				И &РеализацияПоНесколькимЗаказам 
		|				И ВидыЗапасов.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
		|			ТОГДА ВидыЗапасов.ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Заказ
		|ПОМЕСТИТЬ ВидыЗапасов
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ВидыЗапасов
		|ГДЕ
		|	ВидыЗапасов.Ссылка = &Ссылка
		|	И ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТаблицаТовары.Номенклатура КАК Номенклатура,
		|		ТаблицаТовары.Характеристика КАК Характеристика,
		|		МАКСИМУМ(ТаблицаТовары.ПроцентСкидки) КАК ПроцентСкидки,
		|		МАКСИМУМ(ТаблицаТовары.СуммаСкидки) КАК СуммаСкидки,
		|		МАКСИМУМ(ТаблицаТовары.СуммаБонусныхБаллов) КАК СуммаБонусныхБаллов,
		|		ТаблицаТовары.Серия КАК Серия
		|	ПОМЕСТИТЬ ВТ_БонусыИСкидки
		|	ИЗ
		|		ТаблицаТовары КАК ТаблицаТовары
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТаблицаТовары.Номенклатура,
		|		ТаблицаТовары.Характеристика,
		|		ТаблицаТовары.Серия
		|	;
	  	|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.ХарактеристикаНаименование = """"
		|			ТОГДА ТаблицаТовары.НоменклатураНаименование
		|		ИНАЧЕ ТаблицаТовары.НоменклатураНаименование + "" ("" + ТаблицаТовары.ХарактеристикаНаименование + "")""
		|	КОНЕЦ КАК Содержание,
		|	ТаблицаТовары.Номенклатура.Принципал КАК ПринципалСсылка,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме)
		|				ИЛИ ТаблицаТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером)
		|			ТОГДА ""Агентские""
		|		ИНАЧЕ ""Собственные""
		|	КОНЕЦ КАК ТипУслуги,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.Заказ КАК Заказ,
		|	ТаблицаТовары.Цена КАК Цена,
		|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТовары.Сумма КАК Сумма,
		|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	ТаблицаТовары.ПроцентСкидки КАК ПроцентСкидки,
		|	ТаблицаТовары.СуммаСкидки КАК СуммаСкидки,
		|	ТаблицаТовары.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов,
		|	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаТовары.НомерСтроки КАК НомерСтрокиДокумента
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|ГДЕ
		|	(ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|			ИЛИ ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		#Вставка      
		|	И НЕ ТаблицаТовары.РаспределитьТранспортные
		#КонецВставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ТаблицыТоварыПоМаксСтроке
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	&ТекстЗапросаХарактеристика,
		|	&ТекстЗапросаСерия,
		|	&ТекстЗапросаУпаковка,
		|	&ТекстЗапросаРНПТ,
		|	&ТекстЗапросаГТД,
		|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
		|	ВложенныйЗапрос.ТипЗапасов КАК ТипЗапасов,
		|	ВложенныйЗапрос.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	ВложенныйЗапрос.Цена КАК Цена,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
		|	ВложенныйЗапрос.СуммаСкидки КАК СуммаСкидки,
		|	ВТ_БонусыИСкидки.ПроцентСкидки КАК ПроцентСкидки,
		|	ВТ_БонусыИСкидки.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов,
		|	ВложенныйЗапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВложенныйЗапрос.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВидыЗапасов.Номенклатура КАК Номенклатура,
		|		ВидыЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ВидыЗапасов.Характеристика КАК Характеристика,
		|		ВидыЗапасов.Серия КАК Серия,
		|		ВидыЗапасов.Упаковка КАК Упаковка,
		|		ВидыЗапасов.КоличествоУпаковок КАК КоличествоУпаковок,
		|		ВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
		|		ВидыЗапасов.НомерГТД КАК НомерГТД,
		|		ВЫБОР
		|			КОГДА ВидыЗапасов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
		|					И ВидыЗапасов.ВернутьМногооборотнуюТару
		|				ТОГДА ""ВозвратнаяТара""
		|			ИНАЧЕ ВидыЗапасов.ТипЗапасов
		|		КОНЕЦ КАК ТипЗапасов,
		|		ЕСТЬNULL(ПорядокСтрокТаблицыТовары.НомерСтроки, 0) КАК НомерСтрокиДокумента,
		|		ВЫРАЗИТЬ(ВидыЗапасов.Цена КАК ЧИСЛО(31, 2)) КАК Цена,
		|		СУММА(ВидыЗапасов.Количество) КАК Количество,
		|		СУММА(ВидыЗапасов.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
		|		СУММА(ВЫРАЗИТЬ(ВидыЗапасов.Сумма КАК ЧИСЛО(31, 2))) КАК Сумма,
		|		СУММА(ВидыЗапасов.СуммаНДС) КАК СуммаНДС,
		|		ВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|		СУММА(ВидыЗапасов.СуммаСкидки) КАК СуммаСкидки,
		|		ВидыЗапасов.Заказ КАК Заказ
		|	ИЗ
		|		ВидыЗапасов КАК ВидыЗапасов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицыТоварыПоМаксСтроке КАК ПорядокСтрокТаблицыТовары
		|			ПО ВидыЗапасов.Номенклатура = ПорядокСтрокТаблицыТовары.Номенклатура
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВидыЗапасов.Номенклатура,
		|		ВидыЗапасов.Характеристика,
		|		ВидыЗапасов.ЕдиницаИзмерения,
		|		ВидыЗапасов.СтавкаНДС,
		|		ВидыЗапасов.Цена,
		|		ВидыЗапасов.НомерГТД,
		|		ВЫБОР
		|			КОГДА ВидыЗапасов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
		|					И ВидыЗапасов.ВернутьМногооборотнуюТару
		|				ТОГДА ""ВозвратнаяТара""
		|			ИНАЧЕ ВидыЗапасов.ТипЗапасов
		|		КОНЕЦ,
		|		ЕСТЬNULL(ПорядокСтрокТаблицыТовары.НомерСтроки, 0),
		|		ВидыЗапасов.Серия,
		|		ВидыЗапасов.Упаковка,
		|		ВидыЗапасов.КоличествоУпаковок,
		|		ВидыЗапасов.Заказ,
		|		ВидыЗапасов.ИдентификаторСтроки) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БонусыИСкидки КАК ВТ_БонусыИСкидки
		|		ПО (ВложенныйЗапрос.Номенклатура = ВТ_БонусыИСкидки.Номенклатура
		|				И ВложенныйЗапрос.Характеристика = ВТ_БонусыИСкидки.Характеристика
		|				И ВложенныйЗапрос.Серия = ВТ_БонусыИСкидки.Серия
		|				И ВТ_БонусыИСкидки.СуммаСкидки = ВложенныйЗапрос.СуммаСкидки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиДокумента";
	
	ЗаполнитьСобственныеТоварыВТексте(ТоварыИУслугиДокумента);
	
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ВложенныйЗапрос"));
		
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаУпаковка",
		ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "ВложенныйЗапрос"));
		
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаСерия",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ВложенныйЗапрос"));
	
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаРНПТ",
		ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "ВложенныйЗапрос"));
	
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаГТД",
		ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ВложенныйЗапрос"));
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.РеализацияТоваровУслуг.ВидыЗапасов";
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов);
	КонецЕсли;
	//-- Локализация	
	#Область МаркировкиУпаковки
	
	ТекстЗапросаМаркировкиУпаковки =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.НомерСтроки КАК НомерСтрокиДокумента,
		//++ Локализация
		|	ШтрихкодыУпаковокТоваров.ТипУпаковки КАК ТипУпаковки,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		//-- Локализация
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ втШтрихкодыУпаковок
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		//++ Локализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
		//-- Локализация
		|ГДЕ
		|	&ВыгружатьШтрихкодыУпаковок
		|	И РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//++ Локализация
		|	втШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
		|	&ТекстЗапросаХарактеристикаАкцизныеМарки,
		|	&ТекстЗапросаСерияАкцизныеМарки,
		|	&ТекстЗапросаУпаковкаАкцизныеМарки,
		|	&ТипАкцизнойМарки,
		|	втШтрихкодыУпаковок.ЗначениеШтрихкода КАК НомерАкцизнойМарки,
		//-- Локализация
		|	втШтрихкодыУпаковок.НомерСтрокиДокумента КАК НомерСтрокиДокумента
		|ИЗ
		|	втШтрихкодыУпаковок КАК втШтрихкодыУпаковок
		//++ Локализация
		|ГДЕ
		|	втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		//-- Локализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШтрихкодыУпаковок.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	втШтрихкодыУпаковок.ШтрихкодУпаковки КАК МаркировкаУпаковки
		|ИЗ
		|	втШтрихкодыУпаковок КАК втШтрихкодыУпаковок
		//++ Локализация
		|ГДЕ
		|	НЕ втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		|	И НЕ втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
		//-- Локализация
		|";
	
	//++ Локализация
		ТекстЗапросаМаркировкиУпаковки = СтрЗаменить(ТекстЗапросаМаркировкиУпаковки, "&ТекстЗапросаХарактеристикаАкцизныеМарки",
			ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "втШтрихкодыУпаковок"));
			
		ТекстЗапросаМаркировкиУпаковки = СтрЗаменить(ТекстЗапросаМаркировкиУпаковки, "&ТекстЗапросаСерияАкцизныеМарки",
			ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "втШтрихкодыУпаковок"));
			
		ТекстЗапросаМаркировкиУпаковки = СтрЗаменить(ТекстЗапросаМаркировкиУпаковки, "&ТекстЗапросаУпаковкаАкцизныеМарки",
			ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "втШтрихкодыУпаковок", Ложь));
		
		ТекстЗапросаМаркировкиУпаковки = СтрЗаменить(ТекстЗапросаМаркировкиУпаковки, "&ТипАкцизнойМарки",
				ПолучитьТекстЗапросаТипАкцизнойМарки(КомпонентыОбмена, "втШтрихкодыУпаковок"));	
	//-- Локализация
	#КонецОбласти
	
	Запрос = Новый Запрос;
	Запрос.Текст = ШапкаДокумента + ОбщегоНазначения.РазделительПакетаЗапросов() 
		+ ДанныеОперации + ОбщегоНазначения.РазделительПакетаЗапросов() 
		+ ТоварыИУслугиДокумента + ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаМаркировкиУпаковки;
		
	Запрос.УстановитьПараметр("Ссылка",                     ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("Дата",                       ДанныеИБ.Дата);
	Запрос.УстановитьПараметр("БазоваяВалюта",              ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ВыгружатьШтрихкодыУпаковок", ВыгружатьШтрихкодыУпаковок(КомпонентыОбмена)); 
	Запрос.УстановитьПараметр("РеализацияПоЗаказам", ДанныеИБ.РеализацияПоЗаказам);
	Запрос.УстановитьПараметр("РеализацияПоНесколькимЗаказам", ДанныеИБ.РеализацияПоЗаказам
		И Не ЗначениеЗаполнено(ДанныеИБ.ЗаказКлиента));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеОперации = РезультатыЗапроса[1].Выбрать();
	
	Если ДанныеОперации.Следующий() Тогда
		ДанныеXDTO.Вставить("КурсВзаиморасчетов",      ДанныеОперации.КурсВзаиморасчетов);
		ДанныеXDTO.Вставить("КратностьВзаиморасчетов", ДанныеОперации.КратностьВзаиморасчетов);
	КонецЕсли;
	
	ТабУслуги = РезультатыЗапроса[5].Выгрузить();
	ТабТовары = РезультатыЗапроса[7].Выгрузить();
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, ТабТовары);
	#Удаление
	ТаблицаУслугЗаполнитьПринципала(КомпонентыОбмена, ТабУслуги);
	#КонецУдаления
	#Вставка      
	ТаблицаУслугЗаполнитьПринципалаДоговор(КомпонентыОбмена, ТабУслуги,ДанныеИБ);
	#КонецВставки
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(ТабТовары, Ложь);
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(ТабУслуги, Ложь);
	КонецЕсли;
	
	ДанныеXDTO.Вставить("Товары", ТабТовары);
	ДанныеXDTO.Вставить("Услуги", ТабУслуги);
	
	//++ Локализация
	ПроверитьНеобходимостьВыгрузкиПатента(ДанныеXDTO, ДанныеИБ.Организация, ДанныеИБ.Подразделение, ДанныеИБ.НалогообложениеНДС, КомпонентыОбмена, ДанныеИБ.Ссылка);
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		АкцизныеМарки = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2].Выгрузить();
		ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, АкцизныеМарки);
		ДанныеXDTO.Вставить("АкцизныеМарки", АкцизныеМарки);
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		МаркировкиУпаковок = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1].Выгрузить();
		ДанныеXDTO.Вставить("МаркировкиУпаковок", МаркировкиУпаковок);
	КонецЕсли;
	//-- Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		ЗаполнитьСерииПоДокументу(ДанныеИБ.Ссылка, "Документ.РеализацияТоваровУслуг.Серии", ДанныеXDTO);
	КонецЕсли;
КонецПроцедуры
&ИзменениеИКонтроль ("ДобавитьПКО_Документ_РеализацияТоваровУслуг_Отправка")
Процедура ДОК_ДобавитьПКО_Документ_РеализацияТоваровУслуг_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_РеализацияТоваровУслуг_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.РеализацияТоваровУслуг;
	ПравилоКонвертации.ОбъектФормата     = "Документ.РеализацияТоваровУслуг"; //@NON-NLS-1
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_РеализацияТоваровУслуг_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Автор",                          "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "АдресДоставки",                  "АдресДоставки");
	ДобавитьПКС(СвойстваШапки, "БанковскийСчетОрганизации",      "БанковскийСчетОрганизации", , "Справочник_БанковскиеСчетаОрганизаций_Отправка");
	ДобавитьПКС(СвойстваШапки, "Валюта",                         "Валюта", , "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "ВалютаВзаиморасчетов",           "ВалютаВзаиморасчетов", , "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "ВариантОформленияПродажи",       "ВидЭД", , "ВидыЭД_Реализация_Отправка");
	ДобавитьПКС(СвойстваШапки, "",                               "ГлавныйБухгалтер", 1, "Справочник_ФизическиеЛица_Отправка");
	ДобавитьПКС(СвойстваШапки, "Грузоотправитель",               "Грузоотправитель", , "Справочник_Контрагенты");
	ДобавитьПКС(СвойстваШапки, "Грузополучатель",                "Грузополучатель", , "Справочник_Контрагенты");
	ДобавитьПКС(СвойстваШапки, "ГруппаФинансовогоУчета",         "ГруппаНастроекФинансовогоУчетаРасчетов", , "Справочник_ГрФинансовогоУчетаРасчетов_Отправка");
	ДобавитьПКС(СвойстваШапки, "Дата",                           "Дата");
	ДобавитьПКС(СвойстваШапки, "ДатаПереходаПраваСобственности", "ДатаПереходаПраваСобственности");
	ДобавитьПКС(СвойстваШапки, "",                               "ДисконтнаяКарта", 1);
	ДобавитьПКС(СвойстваШапки, "ДоверенностьВыдана",             "ДоверенностьКемВыдана");
	ДобавитьПКС(СвойстваШапки, "ДоверенностьДата",               "ДоверенностьДата");
	ДобавитьПКС(СвойстваШапки, "ДоверенностьЛицо",               "ДоверенностьКомуВыдана");
	ДобавитьПКС(СвойстваШапки, "ДоверенностьНомер",              "ДоверенностьНомер");
	ДобавитьПКС(СвойстваШапки, "",                               "Договор", 1, "Справочник_ДоговорыКонтрагентов");
	ДобавитьПКС(СвойстваШапки, "",                               "Заказ", 1, "Документ_ЗаказКлиента_Отправка");
	ДобавитьПКС(СвойстваШапки, "Комментарий",                    "Комментарий");
	ДобавитьПКС(СвойстваШапки, "",                               "КомплектПечатныхДокументовПодписанПолучен", 1);
#Удаление
	ДобавитьПКС(СвойстваШапки, "Контрагент",                     "Контрагент", , "Справочник_Контрагенты");
	#КонецУдаления
	#Вставка
	ДобавитьПКС(СвойстваШапки, "Контрагент",                     "Контрагент",1 , "Справочник_Контрагенты");
	#КонецВставки
	ДобавитьПКС(СвойстваШапки, "",                               "КратностьВзаиморасчетов", 1);
	ДобавитьПКС(СвойстваШапки, "",                               "КурсВзаиморасчетов", 1);
	ДобавитьПКС(СвойстваШапки, "Менеджер",                       "Продавец", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "",                               "Налогообложение", 1);
	ДобавитьПКС(СвойстваШапки, "Номер",                          "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",                    "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "Отпустил",                       "ОтпускПроизвел", , "Справочник_ФизическиеЛица_Отправка");
	ДобавитьПКС(СвойстваШапки, "",                               "Патент", 1, "СправочникСсылка_Патенты_Отправка");
	ДобавитьПКС(СвойстваШапки, "",                               "Подразделение", 1, "Справочник_Подразделения_Отправка");
	ДобавитьПКС(СвойстваШапки, "",                               "ПрограммаЛояльности", 1);
	ДобавитьПКС(СвойстваШапки, "",                               "Руководитель", 1, "Справочник_ФизическиеЛица_Отправка");
	ДобавитьПКС(СвойстваШапки, "СведенияОТранспортировкеИГрузе", "СведенияОТранспортировке");
	ДобавитьПКС(СвойстваШапки, "",                               "Склад", 1, "Справочник_Склады_Отправка");
	ДобавитьПКС(СвойстваШапки, "СопроводительныеДокументы",      "ИныеСведенияОбОтгрузке");
	ДобавитьПКС(СвойстваШапки, "СуммаДокумента",                 "Сумма");
	ДобавитьПКС(СвойстваШапки, "ХозяйственнаяОперация",          "ВидОперации", , "ВидыОперацийРеализацияТоваров_Отправка");
	ДобавитьПКС(СвойстваШапки, "ЦенаВключаетНДС",                "СуммаВключаетНДС");
	ДобавитьПКС(СвойстваШапки, "ЭтапГосконтрактаЕИС",            "ЭтапГосконтрактаЕИС");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "АкцизныеМарки");
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерАкцизнойМарки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Серия", 1, "Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "ТипАкцизнойМарки", 1, "ВидыПродукцииИС");
	ДобавитьПКС(СвойстваТЧ, "", "Упаковка", 1, "Справочник_Упаковки");
	ДобавитьПКС(СвойстваТЧ, "", "Характеристика", 1, "Справочник_ХарактеристикиНоменклатуры");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1, "Справочник_ДополнительныеРеквизиты");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "МаркировкиУпаковок");
	ДобавитьПКС(СвойстваТЧ, "", "МаркировкаУпаковки", 1, "Справочник_ШтрихкодыУпаковокТоваров_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ПогашениеЗадолженности");
	ДобавитьПКС(СвойстваТЧ, "", "ДокументРасчетов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ОбъектРасчетов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "СведенияРНПТ");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмеренияРНПТ", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НаименованиеТовара", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "РНПТ", 1, "Справочник_НомераГТД_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "СуммаРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Упаковка", 1, "Справочник_Упаковки");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Серия", 1, "Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "Характеристика", 1, "Справочник_ХарактеристикиНоменклатуры");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ВидСкидки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмеренияПрослеживаемости", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "Заказ", 1, "Документ_ЗаказКлиента_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоУпаковок", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерГТД", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПрослеживаемыйТовар", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПроцентСкидки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Серия", 1, "Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "СтавкаНДС", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СтранаПроисхождения", 1, "Справочник_СтраныМира");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаБонусныхБаллов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаНДС", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаСкидки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаСУчетомСкидки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СчетДоходов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СчетРасходов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ТипЗапасов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Упаковка", 1, "Справочник_Упаковки");
	ДобавитьПКС(СвойстваТЧ, "", "Характеристика", 1, "Справочник_ХарактеристикиНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Услуги");
	ДобавитьПКС(СвойстваТЧ, "", "Заказ", 1, "Документ_ЗаказКлиента_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Принципал", 1, "Справочник_Контрагенты");
	ДобавитьПКС(СвойстваТЧ, "", "Содержание", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СтавкаНДС", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаНДС", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ТипУслуги", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);
	#Вставка
	ДобавитьПКС(СвойстваТЧ, "", "ДоговорСПринципалом", 1,"Справочник_ДоговорыКонтрагентов");
	#КонецВставки

КонецПроцедуры
&Вместо ("ПТиУ_РасширенныеДанныеИБ")
Функция ДОК_ПТиУ_РасширенныеДанныеИБ(КомпонентыОбмена, ДанныеИБ)
	Результат=ПродолжитьВызов(КомпонентыОбмена, ДанныеИБ);
	если Результат.Свойство("Услуги") тогда
		для каждого стр из Результат.Услуги цикл
			стр.ЭтоДопРасходы=ложь;
		конеццикла;	
	конецесли;	
	
	Возврат Результат;
КонецФункции

&ИзменениеИКонтроль("ПКО_Документ_ВозвратТоваровОтКлиента_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_ВозвратТоваровОтКлиента_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ВозвратТоваровОтКлиента_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ВозвратТоваровОтКлиента_Отправка", 
										"Товары", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	// Определим контрагента документа. Для возврата от розничного покупателя, контрагент в документе не заполняется.
	// Заполняется только партнер - Розничный покупатель.
	#Вставка       
	СведенияКонтрагента = ВозвратитьДанныеКонтрагента(ДанныеИБ.Ссылка);
	КонтрагентДокумента = ?(СведенияКонтрагента.Подмена, СведенияКонтрагента.Контрагент, ДанныеИБ.Контрагент);
	#КонецВставки 
	#Удаление
	КонтрагентДокумента = ДанныеИБ.Контрагент;
	#КонецУдаления
	Если Не ЗначениеЗаполнено(КонтрагентДокумента)
		И ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя Тогда
		КонтрагентДокумента = Справочники.Контрагенты.РозничныйПокупатель;
	КонецЕсли;
	
	ДанныеXDTO.Вставить("Контрагент", КонтрагентДокумента);
	
	// ВалютаВзаиморасчетов нужна для расчета курса и кратности.
	// РасчетыВУсловныхЕдиницах вычисляются параллельно, т.к. могут пригодиться если договор пустой.
	РасчетыВУсловныхЕдиницах = Ложь;
	ВалютаВзаиморасчетов     = ДанныеИБ.Валюта;
	
	Если Не (ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера
		Или ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя) Тогда
		
		Если ЗначениеЗаполнено(ДанныеИБ.Соглашение) Тогда
			ДанныеРасчетаУЕ          = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.Соглашение, "ВалютаВзаиморасчетов, ОплатаВВалюте, Организация");
			РасчетыВУсловныхЕдиницах = ВедетсяРасчетВУЕ(ДанныеРасчетаУЕ.ВалютаВзаиморасчетов, ДанныеРасчетаУЕ.ОплатаВВалюте, ДанныеРасчетаУЕ.Организация, КомпонентыОбмена);
			ВалютаВзаиморасчетов	 = ДанныеРасчетаУЕ.ВалютаВзаиморасчетов;		 
		Иначе
			Если ДанныеИБ.РасшифровкаПлатежа.Количество() > 0 Тогда
				ВалютаВзаиморасчетов = ДанныеИБ.РасшифровкаПлатежа[0].ВалютаВзаиморасчетов;
				РасчетыВУсловныхЕдиницах = (ДанныеИБ.Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация) И ДанныеИБ.Валюта <> ВалютаВзаиморасчетов);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
	
	Если Не ЗначениеЗаполнено(ДанныеИБ.ХозяйственнаяОперация)
		Или ВозвратТоваровЧерезКомиссионера(ДанныеИБ.ХозяйственнаяОперация) Тогда
		ДанныеXDTO.Вставить("ВидОперации", "ВозвратОтКлиента");
	КонецЕсли;	
	ВыгрузитьКурсИКратностьВзаиморасчетов(ДанныеXDTO, ВалютаВзаиморасчетов, ДанныеИБ.Дата, ДанныеИБ.Организация);
	
	// Документ реализации
	ДокументРеализации = Неопределено;
	Если ЗначениеЗаполнено(ДанныеИБ.ДокументРеализации) Тогда
		
		ДокументРеализации = ДанныеИБ.ДокументРеализации;
		
	ИначеЕсли Не ДанныеИБ.ВозвратПорчи Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|Товары.ДокументРеализации.Ссылка КАК Ссылка
			|ИЗ Документ.ВозвратТоваровОтКлиента.Товары КАК Товары
			|ГДЕ 
			|	Товары.Ссылка = &Ссылка";
	
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			ДокументРеализации = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеXDTO.Вставить("ДокументРеализации");
	
	ПоддерживаетсяВозвратЧерезКомиссионера = ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17"); 
	
	Если ДокументРеализации <> Неопределено Тогда
		
		ИмяПКО = "Документ_РеализацияТоваровУслуг_Отправка";
		
		Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
			ИмяПКО = "Документ_ОтчетОРозничныхПродажах_Отправка";
	   	КонецЕсли;
		
		ДанныеXDTO.Вставить("ДокументРеализации", Новый Структура("Значение, ИмяПКО", ДокументРеализации, ИмяПКО));
		
	КонецЕсли;
	Если ВозвратТоваровЧерезКомиссионера(ДанныеИБ.ХозяйственнаяОперация) И ПоддерживаетсяВозвратЧерезКомиссионера Тогда
	    
		Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)= Тип("Структура") Тогда
			ДополнительныеДанные = ДанныеXDTO.AdditionalInfo;
		Иначе
			ДополнительныеДанные = Новый Структура;
		КонецЕсли;
	
		УИДКонтрагентаXDTO = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныйИдентификаторПоСсылкеОбъекта(
			КомпонентыОбмена.УзелКорреспондента, ДанныеИБ.КлиентКонтрагент);
			
		УИДДоговораXDTO = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныйИдентификаторПоСсылкеОбъекта(
			КомпонентыОбмена.УзелКорреспондента, ДанныеИБ.КлиентДоговор);
			
		ДополнительныеДанные.Вставить("КлиентКонтрагент", УИДКонтрагентаXDTO);
		ДополнительныеДанные.Вставить("КлиентДоговор", УИДДоговораXDTO);
		ДополнительныеДанные.Вставить("ВозвратЧерезКомиссионера", Истина);
		
		ДанныеXDTO.Вставить("AdditionalInfo", ДополнительныеДанные);
		
	КонецЕсли;
		
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя Тогда
		ДанныеXDTO.Вставить("ПокупателемВыставляетсяСчетФактураНаВозврат", Ложь);
	//++ Локализация
	Иначе
		РеквизитыСчетФактуры = Новый Структура;
		Документы.СчетФактураПолученный.СчетаФактурыПоОснованию(ДанныеИБ.Ссылка, ДанныеИБ.Организация, РеквизитыСчетФактуры);
		ДанныеXDTO.Вставить("ПокупателемВыставляетсяСчетФактураНаВозврат", ЗначениеЗаполнено(РеквизитыСчетФактуры.Ссылка));
	//-- Локализация
	КонецЕсли;
	
	// Товары
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера Тогда
		
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	""Товары"" КАК ИмяТабличнойЧасти,
			|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
			|	СУММА(1) КАК КоличествоСтрок
			|ПОМЕСТИТЬ ВТНоменклатураДокумента
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.Товары КАК Т
			|ГДЕ
			|	Т.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
			|	Т.АналитикаУчетаНоменклатуры.Характеристика
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""ВидыЗапасов"",
			|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
			|	Т.АналитикаУчетаНоменклатуры.Характеристика,
			|	СУММА(1)
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК Т
			|ГДЕ
			|	Т.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
			|	Т.АналитикаУчетаНоменклатуры.Характеристика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	""ВидыЗапасов"" КАК тчВидыЗапасов,
			|	Т.НомерСтроки КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА Итоги.КоличествоСтрок > 1
			|			ТОГДА Т.НомерСтроки
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КодСтроки
			|ПОМЕСТИТЬ ВТКодыСтрок
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК Т
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатураДокумента КАК Итоги
			|		ПО Т.АналитикаУчетаНоменклатуры.Номенклатура = Итоги.Номенклатура
			|			И Т.АналитикаУчетаНоменклатуры.Характеристика = Итоги.Характеристика
			|			И (Итоги.ИмяТабличнойЧасти = ""ВидыЗапасов"")
			|ГДЕ
			|	Т.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтроки,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Цена КАК Цена,
			|	ВТНоменклатураДокумента.КоличествоСтрок КАК КоличествоСтрок,
			|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
			|ПОМЕСТИТЬ ВременнаяТаблицаТоварыСЦенамиПредварительная
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНоменклатураДокумента КАК ВТНоменклатураДокумента
			|		ПО (ВТНоменклатураДокумента.ИмяТабличнойЧасти = ""Товары"")
			|			И (ВТНоменклатураДокумента.Номенклатура = Товары.Номенклатура)
			|			И (ВТНоменклатураДокумента.Характеристика = Товары.Характеристика)
			|ГДЕ
			|	Товары.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.НомерСтроки КАК НомерСтроки,
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.Номенклатура КАК Номенклатура,
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.Цена КАК Цена,
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.КоличествоСтрок КАК КоличествоСтрок,
			|	ВТКодыСтрок.КодСтроки КАК КодСтроки,  
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
			|ПОМЕСТИТЬ ВременнаяТаблицаТоварыИтог
			|ИЗ
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная КАК ВременнаяТаблицаТоварыСЦенамиПредварительная
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКодыСтрок КАК ВТКодыСтрок
			|		ПО ВременнаяТаблицаТоварыСЦенамиПредварительная.НомерСтроки = ВТКодыСтрок.НомерСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.НоменклатураОприходование = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура
			|		ИНАЧЕ ВидыЗапасов.НоменклатураОприходование
			|	КОНЕЦ КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.ХарактеристикаОприходование = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|			ТОГДА ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика
			|		ИНАЧЕ ВидыЗапасов.ХарактеристикаОприходование
			|	КОНЕЦ КАК Характеристика,
			|	ВидыЗапасов.Количество КАК Количество,
			|	ВидыЗапасов.СуммаСНДС КАК СуммаСНДС,
			|	ВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
			|	ВидыЗапасов.СуммаНДС КАК СуммаНДС,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзТекущегоДокумента)
			|			ТОГДА 0
			|		КОГДА ВидыЗапасов.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.Вручную)
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(&Курс, 0) > 0
			|							И ЕСТЬNULL(&Кратность, 0) > 0
			|						ТОГДА ВЫРАЗИТЬ(ВидыЗапасов.СебестоимостьРегл / &Курс / &Кратность КАК ЧИСЛО(31, 2))
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Себестоимость,
			|	ВидыЗапасов.Ссылка.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
			|	ВидыЗапасов.НомерГТД КАК НомерГТД,
			|	ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
			|	ВидыЗапасов.Ссылка.ВозвратПереданнойМногооборотнойТары КАК ВозвратПереданнойМногооборотнойТары,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
			|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
			|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
			|	КОНЕЦ КАК ТипЗапасов,    
			|	ВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Серия КАК Серия
			|ПОМЕСТИТЬ ВидыЗапасов
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ВидыЗапасов
			|ГДЕ
			|	ВидыЗапасов.Ссылка = &Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВидыЗапасов.Номенклатура КАК Номенклатура,
			|	ВидыЗапасов.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	&ТекстЗапросаХарактеристика,
			|	&ТекстЗапросаСерия,
			|	&ТекстЗапросаРНПТ,
			|	&ТекстЗапросаГТД,
			|	ВидыЗапасов.Количество КАК Количество,
			|	ВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
			|	ВидыЗапасов.СуммаНДС КАК СуммаНДС,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ВидыЗапасов.ЦенаВключаетНДС
			|				ТОГДА ВидыЗапасов.СуммаСНДС / ВидыЗапасов.Количество
			|			ИНАЧЕ (ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС) / ВидыЗапасов.Количество
			|		КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.ЦенаВключаетНДС
			|			ТОГДА ВидыЗапасов.СуммаСНДС
			|		ИНАЧЕ ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС
			|	КОНЕЦ КАК Сумма,
			|	ВидыЗапасов.Себестоимость КАК Себестоимость, 
			|	ВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
			|				И ВидыЗапасов.ВозвратПереданнойМногооборотнойТары
			|			ТОГДА ""ВозвратнаяТара""
			|		КОГДА ВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
			|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
			|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
			|	КОНЕЦ КАК ТипЗапасов
			|ИЗ
			|	ВидыЗапасов КАК ВидыЗапасов";
			
	Иначе
			
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	""Товары"" КАК ИмяТабличнойЧасти,
			|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
			|	СУММА(1) КАК КоличествоСтрок
			|ПОМЕСТИТЬ ВТНоменклатураДокумента
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.Товары КАК Т
			|ГДЕ
			|	Т.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
			|	Т.АналитикаУчетаНоменклатуры.Характеристика
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""ВидыЗапасов"",
			|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
			|	Т.АналитикаУчетаНоменклатуры.Характеристика,
			|	СУММА(1)
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК Т
			|ГДЕ
			|	Т.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
			|	Т.АналитикаУчетаНоменклатуры.Характеристика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	""ВидыЗапасов"" КАК тчВидыЗапасов,
			|	Т.НомерСтроки КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА Итоги.КоличествоСтрок > 1
			|			ТОГДА Т.НомерСтроки
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КодСтроки
			|ПОМЕСТИТЬ ВТКодыСтрок
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК Т
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатураДокумента КАК Итоги
			|		ПО Т.АналитикаУчетаНоменклатуры.Номенклатура = Итоги.Номенклатура
			|			И Т.АналитикаУчетаНоменклатуры.Характеристика = Итоги.Характеристика
			|			И (Итоги.ИмяТабличнойЧасти = ""ВидыЗапасов"")
			|ГДЕ
			|	Т.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтроки,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Цена КАК Цена,
			|	ВТНоменклатураДокумента.КоличествоСтрок КАК КоличествоСтрок,
			|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
			|ПОМЕСТИТЬ ВременнаяТаблицаТоварыСЦенамиПредварительная
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНоменклатураДокумента КАК ВТНоменклатураДокумента
			|		ПО (ВТНоменклатураДокумента.ИмяТабличнойЧасти = ""Товары"")
			|			И (ВТНоменклатураДокумента.Номенклатура = Товары.Номенклатура)
			|			И (ВТНоменклатураДокумента.Характеристика = Товары.Характеристика)
			|ГДЕ
			|	Товары.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.НомерСтроки КАК НомерСтроки,
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.Номенклатура КАК Номенклатура,
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.Цена КАК Цена,
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.КоличествоСтрок КАК КоличествоСтрок,
			|	ВТКодыСтрок.КодСтроки КАК КодСтроки,
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
			|ПОМЕСТИТЬ ВременнаяТаблицаТоварыИтог
			|ИЗ
			|	ВременнаяТаблицаТоварыСЦенамиПредварительная КАК ВременнаяТаблицаТоварыСЦенамиПредварительная
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКодыСтрок КАК ВТКодыСтрок
			|		ПО ВременнаяТаблицаТоварыСЦенамиПредварительная.НомерСтроки = ВТКодыСтрок.НомерСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.НоменклатураОприходование = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура
			|		ИНАЧЕ ВидыЗапасов.НоменклатураОприходование
			|	КОНЕЦ КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.ХарактеристикаОприходование = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|			ТОГДА ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика
			|		ИНАЧЕ ВидыЗапасов.ХарактеристикаОприходование
			|	КОНЕЦ КАК Характеристика,
			|	ВидыЗапасов.Количество КАК Количество,
			|	ВидыЗапасов.Ссылка.ДокументРеализации КАК ДокументРеализации,
			|	ВидыЗапасов.Ссылка.ВозвратПорчи КАК ВозвратПорчи,
			|	ВидыЗапасов.Ссылка.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
			|	ВидыЗапасов.СуммаСНДС КАК СуммаСНДС,
			|	ВидыЗапасов.СуммаНДС КАК СуммаНДС,
			|	ВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзТекущегоДокумента)
			|			ТОГДА ВЫБОР
			|					КОГДА ВидыЗапасов.Ссылка.ЦенаВключаетНДС
			|						ТОГДА ВидыЗапасов.СуммаСНДС
			|					ИНАЧЕ ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС
			|				КОНЕЦ
			|		КОГДА ВидыЗапасов.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.Вручную)
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(&Курс, 0) > 0
			|							И ЕСТЬNULL(&Кратность, 0) > 0
			|						ТОГДА ВЫРАЗИТЬ(ВидыЗапасов.СебестоимостьРегл / &Курс / &Кратность КАК ЧИСЛО(31, 2))
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Себестоимость,
			|	ВидыЗапасов.НомерГТД КАК НомерГТД,
			|	ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
			|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
			|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
			|	КОНЕЦ КАК ТипЗапасов,
			|	ВидыЗапасов.ВидЗапасовОтгрузки КАК ВидЗапасовОтгрузки,
			|	ВидыЗапасов.Ссылка.ВозвратПереданнойМногооборотнойТары КАК ВозвратПереданнойМногооборотнойТары,
			|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Серия КАК Серия
			|ПОМЕСТИТЬ ВидыЗапасов
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ВидыЗапасов
			|ГДЕ
			|	ВидыЗапасов.Ссылка = &Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВидыЗапасовРеализация.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВидыЗапасовРеализация.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
			|	ВидыЗапасовРеализация.ВидЗапасов КАК ВидЗапасов,
			|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
			|		КОГДА ВидыЗапасовРеализация.СуммаСНДС = 0 Или ВидыЗапасовРеализация.Количество = 0
			|			ТОГДА NULL
			|		КОГДА ВидыЗапасовРеализация.Ссылка.ЦенаВключаетНДС
			|			ТОГДА ВидыЗапасовРеализация.СуммаСНДС / ВидыЗапасовРеализация.Количество
			|		ИНАЧЕ (ВидыЗапасовРеализация.СуммаСНДС - ВидыЗапасовРеализация.СуммаНДС) / ВидыЗапасовРеализация.Количество
			|	КОНЕЦ КАК ЧИСЛО(31, 2))) КАК Цена,
			|	СУММА(1) КАК КоличествоСтрок
			|ПОМЕСТИТЬ ВидыЗапасовРеализация
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ВидыЗапасовРеализация
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыЗапасов КАК ВидыЗапасов
			|		ПО ВидыЗапасовРеализация.Ссылка = ВидыЗапасов.ДокументРеализации
			|
			|СГРУППИРОВАТЬ ПО
			|	ВидыЗапасовРеализация.АналитикаУчетаНоменклатуры.Характеристика,
			|	ВидыЗапасовРеализация.ВидЗапасов,
			|	ВидыЗапасовРеализация.АналитикаУчетаНоменклатуры.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВидыЗапасов.Номенклатура КАК Номенклатура,
			|	ВидыЗапасов.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	&ТекстЗапросаХарактеристика,
			|	&ТекстЗапросаСерия,
			|	&ТекстЗапросаРНПТ,
			|	&ТекстЗапросаГТД,
			|	ВидыЗапасов.Количество КАК Количество,
			|	ВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
			|	ВидыЗапасов.СуммаНДС КАК СуммаНДС,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ВидыЗапасов.ЦенаВключаетНДС
			|				ТОГДА ВидыЗапасов.СуммаСНДС / ВидыЗапасов.Количество
			|			ИНАЧЕ (ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС) / ВидыЗапасов.Количество
			|		КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.ЦенаВключаетНДС
			|			ТОГДА ВидыЗапасов.СуммаСНДС
			|		ИНАЧЕ ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС
			|	КОНЕЦ КАК Сумма,
			|	ВидыЗапасов.Себестоимость КАК Себестоимость,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
			|				И ВидыЗапасов.ВозвратПереданнойМногооборотнойТары
			|			ТОГДА ""ВозвратнаяТара""
			|		ИНАЧЕ ВидыЗапасов.ТипЗапасов
			|	КОНЕЦ КАК ТипЗапасов
			|ИЗ
			|	ВидыЗапасов КАК ВидыЗапасов
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВидыЗапасовРеализация КАК ВидыЗапасовРеализация
			|ПО ВидыЗапасов.Номенклатура = ВидыЗапасовРеализация.Номенклатура
			|	И ВидыЗапасов.Характеристика = ВидыЗапасовРеализация.Характеристика
			|	И ВидыЗапасов.ВидЗапасовОтгрузки = ВидыЗапасовРеализация.ВидЗапасов
			|	И (ВидыЗапасовРеализация.КоличествоСтрок = 1)";
	
	КонецЕсли;
	
	ЗаполнитьСобственныеТоварыВТексте(ТекстЗапроса);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ВидыЗапасов"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаСерия",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ВидыЗапасов"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРНПТ",
		ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "ВидыЗапасов"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаГТД",
		ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ВидыЗапасов"));
		
	// Заказ клиента берем из табличной части "Расшифровка платежа"
	// Если там указано несколько заказов или в качестве заказа указан документ, не являющийся заказом, то ничего не делаем
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() + 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ВозвратТоваровОтКлиента.ДокументРеализации ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ТОГДА ВЫРАЗИТЬ(ВозвратТоваровОтКлиента.ДокументРеализации КАК Документ.РеализацияТоваровУслуг).ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Заказ
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
		|ГДЕ
		|	ВозвратТоваровОтКлиента.Ссылка = &Ссылка";
	
	#Область МаркировкиУпаковки
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ВозвратТоваровОтКлиентаШтрихкодыУпаковок.НомерСтроки КАК НомерСтрокиДокумента,
		//++ Локализация
		|	ШтрихкодыУпаковокТоваров.ТипУпаковки КАК ТипУпаковки,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		//-- Локализация
		|	ВозвратТоваровОтКлиентаШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ втШтрихкодыУпаковок
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента.ШтрихкодыУпаковок КАК ВозвратТоваровОтКлиентаШтрихкодыУпаковок
		//++ Локализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО ВозвратТоваровОтКлиентаШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
		//-- Локализация
		|ГДЕ
		|	&ВыгружатьШтрихкодыУпаковок
		|	И ВозвратТоваровОтКлиентаШтрихкодыУпаковок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//++ Локализация
		|	втШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
		|	&ТипАкцизнойМарки,
		|	&ТекстЗапросаХарактеристикаАкцизныеМарки,
		|	&ТекстЗапросаСерияАкцизныеМарки,
		|	&ТекстЗапросаУпаковкаАкцизныеМарки,
		|	втШтрихкодыУпаковок.ЗначениеШтрихкода КАК НомерАкцизнойМарки,
		//-- Локализация
		|	втШтрихкодыУпаковок.НомерСтрокиДокумента КАК НомерСтрокиДокумента
		|ИЗ
		|	втШтрихкодыУпаковок КАК втШтрихкодыУпаковок
		//++ Локализация
		|ГДЕ
		|	втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		//-- Локализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШтрихкодыУпаковок.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	втШтрихкодыУпаковок.ШтрихкодУпаковки КАК МаркировкаУпаковки
		|ИЗ
		|	втШтрихкодыУпаковок КАК втШтрихкодыУпаковок
		//++ Локализация
		|ГДЕ
		|	НЕ втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		|	И НЕ втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
		//-- Локализация
		|";
	
	//++ Локализация
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристикаАкцизныеМарки",
			ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "втШтрихкодыУпаковок"));
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаСерияАкцизныеМарки",
			ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "втШтрихкодыУпаковок"));
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаУпаковкаАкцизныеМарки",
			ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "втШтрихкодыУпаковок", Ложь));
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТипАкцизнойМарки",
				ПолучитьТекстЗапросаТипАкцизнойМарки(КомпонентыОбмена, "втШтрихкодыУпаковок"));
	//-- Локализация
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("ВыгружатьШтрихкодыУпаковок", ВыгружатьШтрихкодыУпаковок(КомпонентыОбмена));
	
	Если ДанныеИБ.Валюта = ВалютаРегламентированногоУчета(ДанныеИБ.Организация) Тогда
		Запрос.УстановитьПараметр("Курс", 1);
		Запрос.УстановитьПараметр("Кратность", 1);
	Иначе
		КурсВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ДанныеИБ.Валюта, ДанныеИБ.Дата,
						ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация));
		Запрос.УстановитьПараметр("Курс", КурсВалюты.КурсЧислитель);
		Запрос.УстановитьПараметр("Кратность", КурсВалюты.КурсЗнаменатель);
	КонецЕсли;
	Результат = Запрос.ВыполнитьПакет();
	
	Товары = Результат[Результат.Количество() - 5].Выгрузить();
	
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, Товары, Истина, Ложь);
	ЗаполнитьВидДеятельностиНДСВТЧ(КомпонентыОбмена, ДанныеИБ, Товары, "ВозвратПодДеятельность");
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(Товары, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить("Товары", Товары);
	
	// Дополнительные свойства для договора
	Если ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
		#Вставка
		ДанныеXDTO.Вставить("Договор", ?(СведенияКонтрагента.Подмена, Неопределено, ДанныеИБ.Договор));
		#КонецВставки   
		#Удаление
		ДанныеXDTO.Вставить("Договор", ДанныеИБ.Договор);
		#КонецУдаления
	Иначе
		
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.Контрагент               = КонтрагентДокумента;
		ПараметрыПоУмолчанию.Организация              = ДанныеИБ.Организация;
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = ВалютаВзаиморасчетов;
		ПараметрыПоУмолчанию.Дата                     = ДанныеИБ.Дата;
		ПараметрыПоУмолчанию.Номер                    = ДанныеИБ.Номер;
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = РасчетыВУсловныхЕдиницах;
	
		ПараметрыПоУмолчанию.ВидДоговора = ?(ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера,
			"СКомиссионером", "СПокупателем");
		
		ЗаказКлиента = Неопределено;
		
		Выборка = Результат[Результат.Количество() - 4].Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаказКлиента = Выборка.Заказ;
		КонецЕсли;
		
		Заказ = Новый Структура("Заказ, Соглашение, Сделка", ЗаказКлиента, ДанныеИБ.Соглашение, ДанныеИБ.Сделка);
		
		Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, Заказ, ДанныеИБ);
		#Вставка    
		Если СведенияКонтрагента.Подмена Тогда 
			если Договор.Свойство("Значение") и Договор.Значение.Свойство("Наименование") тогда
				Договор.Значение.Наименование="С покупателем, руб";
			конецесли;	
		КонецЕсли;
		#КонецВставки 
		ДанныеXDTO.Вставить("Договор", Договор);
		
	КонецЕсли;
	
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		АкцизныеМарки = Результат[Результат.Количество() - 2].Выгрузить();
		ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, АкцизныеМарки);
		ДанныеXDTO.Вставить("АкцизныеМарки", АкцизныеМарки);
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		МаркировкиУпаковок = Результат[Результат.Количество() - 1].Выгрузить();
		ДанныеXDTO.Вставить("МаркировкиУпаковок", МаркировкиУпаковок);
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.ВозвратТоваровОтКлиента.ВидыЗапасов"; 
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов); 
	КонецЕсли; 
	//-- Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		ЗаполнитьСерииПоДокументу(ДанныеИБ.Ссылка, "Документ.ВозвратТоваровОтКлиента.Серии", ДанныеXDTO);
	КонецЕсли;
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
КонецПроцедуры

&После ("ПКО_Документ_ОперацияПоПлатежнойКарте_Отправка_ПриОтправкеДанных")
Процедура ДОК_ПКО_Документ_ОперацияПоПлатежнойКарте_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	СведенияКонтрагента=ВозвратитьДанныеКонтрагента(ДанныеИБ.Ссылка);  
	если СведенияКонтрагента.подмена тогда
		ДанныеXDTO.Вставить("Контрагент",СведенияКонтрагента.Контрагент);
		если ДанныеXDTO.свойство("РасшифровкаПлатежа") тогда
			для каждого строка из ДанныеXDTO.РасшифровкаПлатежа цикл 
				ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());  
				ПараметрыПоУмолчанию.Организация = ДанныеИБ.Организация;
				ПараметрыПоУмолчанию.Контрагент = СведенияКонтрагента.Контрагент;
				ПараметрыПоУмолчанию.ВалютаВзаиморасчетов = ДанныеИБ.Валюта;
				ПараметрыПоУмолчанию.ВидДоговора = "СПокупателем";
				ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = ложь;
				Строка.Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, Строка.ЗаказСсылка, ДанныеИБ);
			конеццикла;	
		конецесли;
	конецесли;
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_ПКОРасчетыСКонтрагентами_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_ПКОРасчетыСКонтрагентами_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ПКОРасчетыСКонтрагентами_Отправка", 
										"РасшифровкаПлатежа", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	КонтрагентСсылка = ДанныеИБ.Контрагент;
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации
		ИЛИ ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации Тогда
		КонтрагентСсылка = неопределено;
		ОрганизацияКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.КассаОтправитель, "Владелец");
		КонтрагентСсылка = КонтрагентИзОрганизации(ОрганизацияКонтрагента, КомпонентыОбмена);
		ДанныеXDTO.Вставить("Контрагент", КонтрагентСсылка);
	Иначе
		#Удаление
		ДанныеXDTO.Вставить("Контрагент", ДанныеИБ.Контрагент);
		#КонецУдаления
		#Вставка
		СведенияКонтрагента = ВозвратитьДанныеКонтрагента(ДанныеИБ.Ссылка);
		Если СведенияКонтрагента.Подмена Тогда
			ДанныеXDTO.Вставить("Контрагент", СведенияКонтрагента.Контрагент);
		Иначе
			ДанныеXDTO.Вставить("Контрагент", ДанныеИБ.Контрагент);	
		КонецЕсли;
		#КонецВставки   
	КонецЕсли;
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Касса");
	ВыгрузитьОтветственноеЛицо(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "ГлавныйБухгалтер");
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	ВерсияФормата = ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена);
	АлгоритмКонвертации = АлгоритмВыгрузкиРасчетыСКонтрагентамиОтправка(ДанныеИБ, ВерсияФормата);
	ДанныеXDTO.Вставить("ВидРасчетов", ВидРасчетовСКонтрагентомПоступление(КомпонентыОбмена, АлгоритмКонвертации));
	ВыгрузитьРасшифровкуКонтрагенты_ПоступлениеДС(ДанныеИБ, ДанныеXDTO, АлгоритмКонвертации, КомпонентыОбмена);
КонецПроцедуры
&После ("ПКО_Документ_РКОРасчетыСКонтрагентами_Отправка_ПриОтправкеДанных")
Процедура ДОК_ПКО_Документ_РКОРасчетыСКонтрагентами_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	СведенияКонтрагента=ВозвратитьДанныеКонтрагента(ДанныеИБ.Ссылка);
	если СведенияКонтрагента.подмена тогда
		ДанныеXDTO.Вставить("Контрагент",СведенияКонтрагента.Контрагент);
		если ДанныеXDTO.свойство("РасшифровкаПлатежа") тогда
			для каждого стр из  ДанныеXDTO.РасшифровкаПлатежа цикл
				ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
				ПараметрыПоУмолчанию.Контрагент               = СведенияКонтрагента.Контрагент;
				ПараметрыПоУмолчанию.Организация              = ДанныеИБ.Организация;
				ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = ДанныеИБ.Валюта;
				ПараметрыПоУмолчанию.ВидДоговора              = "СПокупателем";
				ПараметрыПоУмолчанию.Дата                     = ДанныеИБ.Дата;
				ПараметрыПоУмолчанию.Номер                    = ДанныеИБ.Номер;
				ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = ложь;  
				стр.Договор = 
				ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, стр.Заказ, ДанныеИБ);
			конеццикла; 
		конецесли;
	конецесли;
КонецПроцедуры
&После ("ДобавитьПКО_Документ_ОперацияПоПлатежнойКарте_Отправка")
Процедура ДОК_ДобавитьПКО_Документ_ОперацияПоПлатежнойКарте_Отправка(ПравилаКонвертации)
	ИзменитьПКС_ИспользуетсяАлгоритм(ПравилаКонвертации,"Документ_ОперацияПоПлатежнойКарте_Отправка","Контрагент");
КонецПроцедуры

#Область ПередачаТоваровМеждуОрганизациями_Излишки
Процедура ДобавитьПКО_ПередачаТоваровМеждуОрганизациями_Излишки(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "ПередачаТоваровМеждуОрганизациями_Излишки";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ПередачаТоваровМеждуОрганизациями;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ПеремещениеТоваров";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ПередачаТоваровМеждуОрганизациями_Излишки_ПриОтправкеДанных";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",        "Дата");
	ДобавитьПКС(СвойстваШапки, "Комментарий", "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Менеджер",    "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "Организация", "Организация",1 , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "AdditionalInfo",            "", 1);
	ДобавитьПКС(СвойстваШапки, "",            "ПодразделениеОтправитель", 1, "Справочник_Подразделения_Отправка");
	ДобавитьПКС(СвойстваШапки, "",            "ПодразделениеПолучатель", 1, "Справочник_Подразделения_Отправка");
	ДобавитьПКС(СвойстваШапки, "Номер",       "Номер", 1);
	ДобавитьПКС(СвойстваШапки, "Склад",       "СкладОтправитель", 1, "Справочник_Склады_Отправка");
	ДобавитьПКС(СвойстваШапки, "Склад",       "СкладПолучатель", 1, "Справочник_Склады_Отправка");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1,"Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1,"Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ТипЗапасов", 1);
	
КонецПроцедуры
&ИзменениеИКонтроль ("ДобавитьПОД_Документ_ПередачаТоваровМеждуОрганизациями_Отправка")
Процедура ДОК_ДобавитьПОД_Документ_ПередачаТоваровМеждуОрганизациями_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ПередачаТоваровМеждуОрганизациями_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ПередачаТоваровМеждуОрганизациями;
	ПравилоОбработки.ПриОбработке            = "ПОД_Документ_ПередачаТоваровМеждуОрганизациями_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных           = Истина;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("ПередачаМеждуОрганизациями_ПТУ_Отправка");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("ПередачаМеждуОрганизациями_РТУ_Отправка");
	#Вставка
	ПравилоОбработки.ИспользуемыеПКО.Добавить("ПередачаТоваровМеждуОрганизациями_Излишки");
	#КонецВставки
КонецПроцедуры
&После ("ПОД_Документ_ПередачаТоваровМеждуОрганизациями_Отправка_ПриОбработке")
Процедура ДОК_ПОД_Документ_ПередачаТоваровМеждуОрганизациями_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	
	ИспользованиеПКО.ПередачаТоваровМеждуОрганизациями_Излишки=ложь;
	
	если  ДанныеИБ.Организация.Наименование="АСК-Р" или ДанныеИБ.ОрганизацияПолучатель.Наименование="АСК-Р" тогда
		ИспользованиеПКО.ПередачаТоваровМеждуОрганизациями_Излишки=истина;
		ИспользованиеПКО.ПередачаМеждуОрганизациями_РТУ_Отправка=ложь;
		ИспользованиеПКО.ПередачаМеждуОрганизациями_ПТУ_Отправка=ложь;
	конецесли;
	
КонецПроцедуры

#КонецОбласти

&После ("ДобавитьПКО_Документ_ОтчетОРозничныхПродажах_Отправка")
Процедура ДОК_ДобавитьПКО_Документ_ОтчетОРозничныхПродажах_Отправка(ПравилаКонвертации)
	ДобавитьИзменитьПКС(ПравилаКонвертации,"Документ_ОтчетОРозничныхПродажах_Отправка","Услуги",Новый Структура("СвойствоКонфигурации,СвойствоФормата,ИспользуетсяАлгоритмКонвертации,ПравилоКонвертацииСвойства","","ДоговорСПринципалом",истина,"Справочник_ДоговорыКонтрагентов"));
КонецПроцедуры
&ИзменениеИКонтроль ("ПКО_Документ_ОтчетОРозничныхПродажах_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_ОтчетОРозничныхПродажах_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		ДанныеXDTO.Вставить("КассоваяСмена", ДанныеИБ.КассоваяСмена);
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ОтчетОРозничныхПродажах_Отправка", 
										"ТоварыПродажа", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ОтчетОРозничныхПродажах_Отправка", 
										"ТоварыВозвратПродажи", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;   
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ОтчетОРозничныхПродажах_Отправка", 
										"Товары", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка"); 
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ОтчетОРозничныхПродажах_Отправка", 
										"ТоварыПродажа", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");	
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ОтчетОРозничныхПродажах_Отправка", 
										"ТоварыВозвратПродажи", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");	
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ОтчетОРозничныхПродажах_Отправка", 
										"Услуги", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");								
	КонецЕсли;
	ДанныеXDTO.КлючевыеСвойства.Вставить("КассоваяСмена", ДанныеИБ.КассоваяСмена);
	ДанныеXDTO.Вставить("КассаККМ", ДанныеИБ.КассаККМ);
	
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь);
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	ДанныеXDTO.Вставить("УчетВыручкиВОперационнойКассе", Истина);
	
	РезультатыЗапроса = ДанныеИБ.ДополнительныеСвойства.РезультатыЗапроса;
	КоличествоЗапросов = РезультатыЗапроса.Количество();
	
	НомераТаблиц = Новый Соответствие;
	НомераТаблиц.Вставить("Товары",                   КоличествоЗапросов-12);
	НомераТаблиц.Вставить("ТоварыПродажа",            КоличествоЗапросов-11);
	НомераТаблиц.Вставить("ТоварыВозвратПродажи",     КоличествоЗапросов-10);
	НомераТаблиц.Вставить("Услуги",                   КоличествоЗапросов-9);
	НомераТаблиц.Вставить("ОплатаКартами",            КоличествоЗапросов-8);
	НомераТаблиц.Вставить("ОплатаСертификатами",      КоличествоЗапросов-7);
	НомераТаблиц.Вставить("ПодарочныеСертификаты",    КоличествоЗапросов-6);
	НомераТаблиц.Вставить("ОплатаПСКартами",          КоличествоЗапросов-5);
	НомераТаблиц.Вставить("НачислениеБонусныхБаллов", КоличествоЗапросов-4);
	НомераТаблиц.Вставить("ОплатаБонуснымиБаллами",   КоличествоЗапросов-3);
	НомераТаблиц.Вставить("АкцизныеМарки",            КоличествоЗапросов-2);
	НомераТаблиц.Вставить("МаркировкиУпаковок",       КоличествоЗапросов-1);
	
	//++ Локализация
	ПроверитьНеобходимостьВыгрузкиПатента(ДанныеXDTO, ДанныеИБ.Организация, ДанныеИБ.Подразделение, ДанныеИБ.НалогообложениеНДС, КомпонентыОбмена, ДанныеИБ.Ссылка);
	//-- Локализация
	
	#Область Товары
	
	СуммаВозвратов = 0;
	
	ИмяТаблицыТовары = "ТоварыПродажа";
	
	ТоварыВозвратПродажи = РезультатыЗапроса[НомераТаблиц.Получить("ТоварыВозвратПродажи")].Выгрузить();	
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, ТоварыВозвратПродажи, Истина, Ложь);
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(ТоварыВозвратПродажи, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить("ТоварыВозвратПродажи", ТоварыВозвратПродажи);
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ОтчетОРозничныхВозвратах.СуммаДокумента), 0) КАК СуммаДокумента
		|ИЗ
		|	Документ.ОтчетОРозничныхВозвратах КАК ОтчетОРозничныхВозвратах
		|ГДЕ
		|	ОтчетОРозничныхВозвратах.Проведен
		|	И ОтчетОРозничныхВозвратах.КассоваяСмена = &КассоваяСмена
		|	И ОтчетОРозничныхВозвратах.КассоваяСмена <> ЗНАЧЕНИЕ(Документ.КассоваяСмена.ПустаяСсылка)
		|	И ОтчетОРозничныхВозвратах.НалогообложениеНДС = &НалогообложениеНДС
		|");
	Запрос.УстановитьПараметр("КассоваяСмена",      ДанныеИБ.КассоваяСмена);
	Запрос.УстановитьПараметр("НалогообложениеНДС", ДанныеИБ.НалогообложениеНДС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаВозвратов = Выборка.СуммаДокумента;
	КонецЕсли;
		
	ТоварыПродажа = РезультатыЗапроса[НомераТаблиц.Получить(ИмяТаблицыТовары)].Выгрузить();
	Для Каждого СтрокаТовары Из ТоварыПродажа Цикл
		Если ЗначениеЗаполнено(СтрокаТовары.Поставщик)
			И ТипЗнч(СтрокаТовары.Поставщик) = Тип("СправочникСсылка.Организации") Тогда
			СтрокаТовары.Поставщик = КонтрагентИзОрганизации(СтрокаТовары.Поставщик, КомпонентыОбмена);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, ТоварыПродажа, Истина, Ложь); 
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(ТоварыПродажа, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить(ИмяТаблицыТовары, ТоварыПродажа);
	
	#КонецОбласти
	
	ДанныеXDTO.Вставить("Сумма", ДанныеИБ.СуммаДокумента - СуммаВозвратов);
	
	#Область Услуги
	
	Услуги = РезультатыЗапроса[НомераТаблиц.Получить("Услуги")].Выгрузить();
	#Удаление 
	ТаблицаУслугЗаполнитьПринципала(КомпонентыОбмена, Услуги);
	#КонецУдаления
	#Вставка      
	ТаблицаУслугЗаполнитьПринципалаДоговор(КомпонентыОбмена, Услуги,ДанныеИБ);
	#КонецВставки
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(Услуги, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить("Услуги", Услуги);
	
	#КонецОбласти
	
	//Сведения РНПТ   
		
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.ОтчетОРозничныхПродажах.ВидыЗапасов";
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов);  
	КонецЕсли;
	//-- Локализация
	
	#Область ОплатаПлатежнымиКартами
	
	ОплатаКартами = РезультатыЗапроса[НомераТаблиц.Получить("ОплатаКартами")].Выгрузить(); // ТаблицаЗначений
	
	Если ОплатаКартами.Количество() <> 0 Тогда 
		ОплатаКартами.Колонки.Добавить("ДоговорЭквайринга");
		ОплатаКартами.Колонки.Добавить("ЭквайринговыйТерминал");
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.Организация              = ДанныеИБ.Организация; 
		ПараметрыПоУмолчанию.Контрагент = ОплатаКартами[0].Эквайрер;
		ПараметрыПоУмолчанию.ВидДоговора              = "Прочее";
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация);
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = Ложь;
		ДоговорЭквайринга = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена);
	КонецЕсли;
	Для Каждого Строка Из ОплатаКартами Цикл
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17")
			И Строка.ТипыПлатежнойСистемыККТ = Перечисления.ТипыПлатежнойСистемыККТ.ПлатежнаяКарта Тогда
			Строка.ТипыПлатежнойСистемыККТ = Перечисления.ТипыПлатежнойСистемыККТ.ПустаяСсылка();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строка.Эквайрер) Тогда
			Продолжить
		КонецЕсли;
		Строка.ЭквайринговыйТерминал = Новый Структура("Номер, Ссылка", СокрЛП(Строка.Номер), Строка.Ссылка); 
		Если НЕ ЗначениеЗаполнено(Строка.ЭквайринговыйТерминал) Тогда
			ЭквайринговыйТерминалПоУмолчанию = Справочники.ЭквайринговыеТерминалы.ЭквайринговыйТерминалПоУмолчанию(ДанныеИБ.Организация);
			Если ЗначениеЗаполнено(ЭквайринговыйТерминалПоУмолчанию) Тогда
				Строка.ЭквайринговыйТерминал = Новый Структура("Номер, Ссылка", СокрЛП(ЭквайринговыйТерминалПоУмолчанию.Номер), ЭквайринговыйТерминалПоУмолчанию.Ссылка); 
			КонецЕсли;
		КонецЕсли;
		Если НЕ ДоговорЭквайринга = Неопределено Тогда
			Строка.ДоговорЭквайринга = ДоговорЭквайринга; 
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строка.ДоговорЭквайринга) Тогда
			Строка.ДоговорЭквайринга = Строка.Договор;
		КонецЕсли;	
		
	КонецЦикла;
	ДанныеXDTO.Вставить("ОплатаПлатежнымиКартами", ОплатаКартами);
	
	#КонецОбласти
	
	#Область ОплатаСертификатами
	
	Если СвойствоФорматаОбмена(КомпонентыОбмена, "Документ.ОтчетОРозничныхПродажах.ОплатаСертификатами") Тогда //@NON-NLS-1
		ОплатаСертификатами = РезультатыЗапроса[НомераТаблиц.Получить("ОплатаСертификатами")].Выгрузить();	
		ОплатаСертификатами.Колонки.Добавить("ВидПодарочногоСертификата");
		Для Каждого ОС Из ОплатаСертификатами Цикл
			ОС.ВидПодарочногоСертификата = Новый Структура("Значение, ИмяПКО",
				ОС.ВидПодарочногоСертификатаСсылка, "Справочник_ВидыПодарочныхСертификатов");
		КонецЦикла;
		ДанныеXDTO.Вставить("ОплатаСертификатами", ОплатаСертификатами);
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПодарочныеСертификаты
	
	Если СвойствоФорматаОбмена(КомпонентыОбмена, "Документ.ОтчетОРозничныхПродажах.ПодарочныеСертификаты") Тогда //@NON-NLS-1
		ПодарочныеСертификаты = РезультатыЗапроса[НомераТаблиц.Получить("ПодарочныеСертификаты")].Выгрузить(); // ТаблицаЗначений	
		ДанныеXDTO.Вставить("ПодарочныеСертификаты", ПодарочныеСертификаты);
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОплатаПлатежнымиКартамиПодарочныхСертификатов
	
	Если СвойствоФорматаОбмена(КомпонентыОбмена, "Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартамиПодарочныхСертификатов") Тогда //@NON-NLS-1
		
		ОплатаПСКартами = РезультатыЗапроса[НомераТаблиц.Получить("ОплатаПСКартами")].Выгрузить(); // ТаблицаЗначений
		ОплатаПСКартами.Колонки.Добавить("ДоговорЭквайринга");
		ОплатаПСКартами.Колонки.Добавить("ЭквайринговыйТерминал");
		
		ИндексЭквайрера = ОплатаПСКартами.Индексы.Добавить("Эквайрер");
		Если ОплатаПСКартами.Количество() <> 0 Тогда
			ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
			ПараметрыПоУмолчанию.Организация              = ДанныеИБ.Организация;
			ПараметрыПоУмолчанию.Контрагент               = ОплатаПСКартами[0].Эквайрер;
			ПараметрыПоУмолчанию.ВидДоговора              = "Прочее";
			ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация);
			ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = Ложь;
			ДоговорЭквайринга = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена);
		КонецЕсли;
		Для Каждого Строка Из ОплатаПСКартами Цикл
			Строка.ЭквайринговыйТерминал = Новый Структура("Номер, Ссылка", СокрЛП(Строка.Номер), Строка.Ссылка); 
			Если НЕ ЗначениеЗаполнено(Строка.ЭквайринговыйТерминал) Тогда
				ЭквайринговыйТерминалПоУмолчанию = Справочники.ЭквайринговыеТерминалы.ЭквайринговыйТерминалПоУмолчанию(ДанныеИБ.Организация);
				Если ЗначениеЗаполнено(ЭквайринговыйТерминалПоУмолчанию) Тогда
					Строка.ЭквайринговыйТерминал = Новый Структура("Номер, Ссылка", СокрЛП(ЭквайринговыйТерминалПоУмолчанию.Номер), ЭквайринговыйТерминалПоУмолчанию.Ссылка); 
				КонецЕсли;
			КонецЕсли;   
			Если Не ДоговорЭквайринга = Неопределено Тогда
				Строка.ДоговорЭквайринга = ДоговорЭквайринга;
			КонецЕсли;
		КонецЦикла;
		ДанныеXDTO.Вставить("ОплатаПлатежнымиКартамиПодарочныхСертификатов", ОплатаПСКартами);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область НачислениеБонусныхБаллов
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.6") Тогда
		НачислениеБонусныхБаллов = РезультатыЗапроса[НомераТаблиц.Получить("НачислениеБонусныхБаллов")].Выгрузить(); // ТаблицаЗначений
		НачислениеБонусныхБаллов.Колонки.Добавить("Контрагент");
		Для Каждого Строка Из НачислениеБонусныхБаллов Цикл
			Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(Строка.Партнер);
			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
				Контрагент = КонтрагентИзПартнера(Строка.Партнер, КомпонентыОбмена);
			КонецЕсли;
			Строка.Контрагент = Контрагент;
		КонецЦикла;
		
		ДанныеXDTO.Вставить("НачислениеБонусныхБаллов", НачислениеБонусныхБаллов);
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОплатаБонуснымиБаллами
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.6") Тогда
		ОплатаБонуснымиБаллами = РезультатыЗапроса[НомераТаблиц.Получить("ОплатаБонуснымиБаллами")].Выгрузить(); // ТаблицаЗначений
		ОплатаБонуснымиБаллами.Колонки.Добавить("Контрагент");
		Для Каждого Строка Из ОплатаБонуснымиБаллами Цикл
			Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(Строка.Партнер);
			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
				Контрагент = КонтрагентИзПартнера(Строка.Партнер, КомпонентыОбмена);
			КонецЕсли;
			Строка.Контрагент = Контрагент;
		КонецЦикла;
		
		ДанныеXDTO.Вставить("ОплатаБонуснымиБаллами", ОплатаБонуснымиБаллами);
	КонецЕсли;
	
	#КонецОбласти
	
	//++ Локализация
	#Область АкцизныеМарки
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		АкцизныеМарки = РезультатыЗапроса[НомераТаблиц.Получить("АкцизныеМарки")].Выгрузить();	
		ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, АкцизныеМарки);
		ДанныеXDTO.Вставить("АкцизныеМарки", АкцизныеМарки);
	КонецЕсли;
	
	#КонецОбласти
	
	#Область МаркировкиУпаковок
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		МаркировкиУпаковок = РезультатыЗапроса[НомераТаблиц.Получить("МаркировкиУпаковок")].Выгрузить(); // ТаблицаЗначений	
		ДанныеXDTO.Вставить("МаркировкиУпаковок", МаркировкиУпаковок);
	КонецЕсли;
	
	#КонецОбласти
	
	Если Не ДанныеXDTO.Свойство("Контрагент") Тогда
		 ДанныеXDTO.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли;
	//-- Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		ЗаполнитьСерииПоДокументу(ДанныеИБ.Ссылка, "Документ.ОтчетОРозничныхПродажах.Серии", ДанныеXDTO);
	КонецЕсли;
КонецПроцедуры

#Область ДоговораОрганизаций

Функция ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетовОрганизаций(ПараметрыПоУмолчанию, КомпонентыОбмена, Заказ = Неопределено, ДанныеИБ = Неопределено)
	// Функция формирует и возвращает инструкция для выгрузки договора
	// по полученным параметрам и настройкам узла плана обмена.
	//
	// Функция, по сформированной инструкции, выполняет принудительную выгрузку договора в файл обмена.
	//
	// Перед вызовом этой функции выполняется проверка наличия договора в выгружаемом документе
	// или в объекте взаиморасчетов, если договор не найден, то выполняется вызов этой функции.
	
	СтруктураДанныеДоговора = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
	ДоговорЗаполнен = Ложь;
	СтруктураДанныеДоговора.ВидДоговора = ПараметрыПоУмолчанию.ВидДоговора;
	
	Если ЗначениеЗаполнено(Заказ)
		И ДанныеИБ <> Неопределено
		И Не ДопАналитикаПоДоговорам(КомпонентыОбмена).ДоговорВДоговор Тогда
		Если ТипЗнч(Заказ) = Тип("Структура") Тогда
			// Если в документе соглашение и заказ - 2 разных реквизита, то значения этих реквизитов передаются в структуре:
			// "Заказ" - Ссылка на Заказ клиента (поставщику).
			// "Соглашение" - Ссылка на Соглашение с клиентом (поставщиком).
			// "Сделки" - Ссылка на Сделку с клиентом.
			ЗаказСсылка      = Неопределено;
			СоглашениеСсылка = Неопределено;
			СделкаСсылка     = Неопределено;
			
			ЭтоЗаказ      = Заказ.Свойство("Заказ", ЗаказСсылка) И ЗначениеЗаполнено(ЗаказСсылка);
			ЭтоСоглашение = Заказ.Свойство("Соглашение", СоглашениеСсылка) И ЗначениеЗаполнено(СоглашениеСсылка);
			ЭтоСделка     = Заказ.Свойство("Сделка", СделкаСсылка) И ЗначениеЗаполнено(СделкаСсылка);
		Иначе
			// Подразумевается, что реквизит выгружаемого документа "Заказ" - имеет составной тип
			// и может быть Заказом, Соглашением, Сделкой или другим видом документа/справочника,
			// помимо этого у объекта, указанного в этом реквизите могут быть реквизиты "Соглашение" и/или "Сделка".
			ЗаказСсылка      = Заказ;
			СоглашениеСсылка = Заказ;
			СделкаСсылка     = Заказ;
			
			ЭтоЗаказ = ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказКлиента")
			Или ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПоставщику");
			
			РеквизитыЗаказа = Новый Массив;
			Если Заказ.Метаданные().Реквизиты.Найти("Соглашение") <> Неопределено Тогда
				РеквизитыЗаказа.Добавить("Соглашение");
			КонецЕсли;
			Если Заказ.Метаданные().Реквизиты.Найти("Сделка") <> Неопределено Тогда
				РеквизитыЗаказа.Добавить("Сделка");
			КонецЕсли;
			
			Если РеквизитыЗаказа.Количество() > 0 Тогда
				СтруктураЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заказ, РеквизитыЗаказа);
			Иначе
				СтруктураЗаказа = Новый Структура;
			КонецЕсли;
			
			ЭтоСоглашение = ТипЗнч(Заказ) = Тип("СправочникСсылка.СоглашенияСКлиентами")
			Или ТипЗнч(Заказ) = Тип("СправочникСсылка.СоглашенияСПоставщиками")
			Или (СтруктураЗаказа.Свойство("Соглашение", СоглашениеСсылка) И ЗначениеЗаполнено(СоглашениеСсылка));
			
			ЭтоСделка = ТипЗнч(Заказ) = Тип("СправочникСсылка.СделкиСКлиентами")
			Или (СтруктураЗаказа.Свойство("Сделка", СделкаСсылка) И ЗначениеЗаполнено(СделкаСсылка));
		КонецЕсли;
		
		Если ЭтоЗаказ Или ЭтоСоглашение Или ЭтоСделка Тогда
			Если ЭтоЗаказ И КомпонентыОбмена.ПараметрыКонвертации.НастройкиДопАналитикиПоДоговорам.ЗаказВДоговор Тогда
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				Запрос.УстановитьПараметр("Ссылка", ЗаказСсылка);
				
				Если ТипЗнч(ЗаказСсылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗаказКлиента.Ссылка КАК Ссылка,
					|	ЗаказКлиента.Контрагент КАК Контрагент,
					|	ЗаказКлиента.Организация КАК Организация,
					|	ЗаказКлиента.Дата КАК Дата,
					|	ЗаказКлиента.Номер КАК Номер,
					|	ЗаказКлиента.Валюта КАК Валюта,
					|	ЗаказКлиента.Представление КАК Представление
					|ПОМЕСТИТЬ ВТ_Документ
					|ИЗ
					|	Документ.ЗаказКлиента КАК ЗаказКлиента
					|ГДЕ
					|	ЗаказКлиента.Ссылка = &Ссылка";
					Запрос.Выполнить();
				ИначеЕсли ТипЗнч(ЗаказСсылка) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка КАК Ссылка,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Контрагент КАК Контрагент,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Организация КАК Организация,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Дата КАК Дата,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Номер КАК Номер,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Валюта КАК Валюта,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Представление КАК Представление
					|ПОМЕСТИТЬ ВТ_Документ
					|ИЗ
					|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
					|ГДЕ
					|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка = &Ссылка";
					Запрос.Выполнить();
				ИначеЕсли ТипЗнч(ЗаказСсылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗаказПоставщику.Ссылка КАК Ссылка,
					|	ЗаказПоставщику.Контрагент КАК Контрагент,
					|	ЗаказПоставщику.Организация КАК Организация,
					|	ЗаказПоставщику.Дата КАК Дата,
					|	ЗаказПоставщику.Номер КАК Номер,
					|	ЗаказПоставщику.Валюта КАК Валюта,
					|	ЗаказПоставщику.Представление КАК Представление
					|ПОМЕСТИТЬ ВТ_Документ
					|ИЗ
					|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
					|ГДЕ
					|	ЗаказПоставщику.Ссылка = &Ссылка";
					Запрос.Выполнить();
				КонецЕсли;
				
				Если Запрос.МенеджерВременныхТаблиц.Таблицы.Количество() > 0 Тогда
					
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВТ_Документ.Ссылка КАК Ссылка,
					|	ВТ_Документ.Контрагент КАК Контрагент,
					|	ВТ_Документ.Организация КАК Организация,
					|	ВТ_Документ.Дата КАК Дата,
					|	ВТ_Документ.Номер КАК Номер,
					|	ВТ_Документ.Валюта КАК ВалютаВзаиморасчетов,
					|	ВТ_Документ.Представление КАК Наименование,
					|	КурсыВалютСрезПоследних.Курс КАК КурсВзаиморасчетов,
					|	КурсыВалютСрезПоследних.Кратность КАК КратностьВзаиморасчетов,
					|	КурсыВалютСрезПоследних.Валюта <> &ВалютаРегл КАК РасчетыВУсловныхЕдиницах
					|ИЗ
					|	ВТ_Документ КАК ВТ_Документ
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДок, ) КАК КурсыВалютСрезПоследних
					|		ПО ВТ_Документ.Валюта = КурсыВалютСрезПоследних.Валюта";
					Запрос.УстановитьПараметр("ДатаДок",    ДанныеИБ.Дата);
					Запрос.УстановитьПараметр("ВалютаРегл", ВалютаРегламентированногоУчета(КомпонентыОбмена));
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, Выборка);
						СтруктураДанныеДоговора.Наименование = ОбщегоНазначенияУТ.ПолучитьПредставлениеДокумента(ЗаказСсылка, Выборка.Номер, Выборка.Дата);
						ДоговорЗаполнен = Истина;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтоСоглашение И ДопАналитикаПоДоговорам(КомпонентыОбмена).СоглашениеВДоговор Тогда
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				Запрос.УстановитьПараметр("Ссылка", СоглашениеСсылка);
				
				Если ТипЗнч(СоглашениеСсылка) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	СоглашенияСКлиентами.Ссылка,
					|	СоглашенияСКлиентами.Контрагент,
					|	СоглашенияСКлиентами.Организация,
					|	СоглашенияСКлиентами.Дата,
					|	СоглашенияСКлиентами.Номер,
					|	СоглашенияСКлиентами.Валюта КАК ВалютаВзаиморасчетов,
					|	СоглашенияСКлиентами.Наименование КАК Наименование,
					|	СоглашенияСКлиентами.Типовое КАК Типовое
					|ПОМЕСТИТЬ ВТ_Соглашение
					|ИЗ
					|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
					|ГДЕ
					|	СоглашенияСКлиентами.Ссылка = &Ссылка";
					Запрос.Выполнить();
				ИначеЕсли ТипЗнч(СоглашениеСсылка) = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	СоглашенияСПоставщиками.Ссылка,
					|	СоглашенияСПоставщиками.Контрагент,
					|	СоглашенияСПоставщиками.Организация,
					|	СоглашенияСПоставщиками.Дата,
					|	СоглашенияСПоставщиками.Номер,
					|	СоглашенияСПоставщиками.Валюта,
					|	СоглашенияСПоставщиками.Наименование,
					|	Ложь
					|ИЗ
					|	Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
					|ГДЕ
					|	СоглашенияСПоставщиками.Ссылка = &Ссылка";
					Запрос.Выполнить();
				КонецЕсли;
				
				Если Запрос.МенеджерВременныхТаблиц.Таблицы.Количество() > 0 Тогда
					
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	СоглашенияСКлиентами.Ссылка КАК Ссылка,
					|	СоглашенияСКлиентами.Контрагент КАК Контрагент,
					|	СоглашенияСКлиентами.Организация КАК Организация,
					|	СоглашенияСКлиентами.Дата КАК Дата,
					|	СоглашенияСКлиентами.Номер КАК Номер,
					|	СоглашенияСКлиентами.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
					|	СоглашенияСКлиентами.Наименование КАК Наименование,
					|	КурсыВалютСрезПоследних.Курс КАК КурсВзаиморасчетов,
					|	КурсыВалютСрезПоследних.Кратность КАК КратностьВзаиморасчетов,
					|	КурсыВалютСрезПоследних.Валюта <> &ВалютаРегл КАК РасчетыВУсловныхЕдиницах,
					|	СоглашенияСКлиентами.Типовое КАК Типовое
					|ИЗ
					|	ВТ_Соглашение КАК СоглашенияСКлиентами
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДок, ) КАК КурсыВалютСрезПоследних
					|		ПО СоглашенияСКлиентами.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта";
					Запрос.УстановитьПараметр("ДатаДок", ДанныеИБ.Дата);
					Запрос.УстановитьПараметр("ВалютаРегл", ВалютаРегламентированногоУчета(КомпонентыОбмена));
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, Выборка);
						
						Если Не ЗначениеЗаполнено(СтруктураДанныеДоговора.Контрагент) Тогда
							Если ЕстьРеквизитДанныхИБ(ДанныеИБ, "Контрагент") Тогда
								СтруктураДанныеДоговора.Контрагент = ДанныеИБ.Контрагент;
							Иначе
								СтруктураДанныеДоговора.Контрагент = ПараметрыПоУмолчанию.Контрагент;
							КонецЕсли;
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(СтруктураДанныеДоговора.Организация) Тогда
							Если ЗначениеЗаполнено(ДанныеИБ.Организация) Тогда
								СтруктураДанныеДоговора.Организация = ДанныеИБ.Организация;
							Иначе
								СтруктураДанныеДоговора.Организация = ПараметрыПоУмолчанию.Организация;
							КонецЕсли;
						КонецЕсли;
						
						Если ТипЗнч(СоглашениеСсылка) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
							Наименование = ?(Выборка.Типовое, НСтр("ru = 'Типовое'"), НСтр("ru = 'Индивидуальное'")) + "; ";
						Иначе
							Наименование = "";
						КонецЕсли;
						
						Наименование = Наименование + Выборка.Наименование
						+ " " + ?(ЗначениеЗаполнено(Выборка.Номер), "№" + Выборка.Номер, "")
						+ " " + ?(ЗначениеЗаполнено(Выборка.Дата), НСтр("ru = 'от'") + " " + Формат(Выборка.Дата, "ДЛФ=D"), "");
						
						СтруктураДанныеДоговора.Наименование = СокрЛП(Наименование);
						ДоговорЗаполнен = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЭтоСделка И ДопАналитикаПоДоговорам(КомпонентыОбмена).СделкаВДоговор Тогда
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	СделкиСКлиентами.Ссылка,
				|	СделкиСКлиентами.Код КАК Номер,
				|	"""" КАК Контрагент,
				|	"""" КАК Организация,
				|	СделкиСКлиентами.ДатаНачала КАК Дата,
				|	КурсыВалютСрезПоследних.Валюта КАК ВалютаВзаиморасчетов,
				|	СделкиСКлиентами.Наименование КАК Наименование,
				|	КурсыВалютСрезПоследних.Курс КАК КурсВзаиморасчетов,
				|	КурсыВалютСрезПоследних.Кратность КАК КратностьВзаиморасчетов,
				|	ВалютаРегламентированногоУчета.Значение <> &Валюта КАК РасчетыВУсловныхЕдиницах
				|ИЗ
				|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
				|	Справочник.СделкиСКлиентами КАК СделкиСКлиентами,
				|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДок, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
				|ГДЕ
				|	СделкиСКлиентами.Ссылка = &Ссылка");
				Запрос.УстановитьПараметр("Ссылка",  СделкаСсылка);
				Запрос.УстановитьПараметр("ДатаДок", ДанныеИБ.Дата);
				Запрос.УстановитьПараметр("Валюта",  ПараметрыПоУмолчанию.ВалютаВзаиморасчетов);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, Выборка);
					СтруктураДанныеДоговора.Организация = ДанныеИБ.Организация;
					Если ЕстьРеквизитДанныхИБ(ДанныеИБ, "Контрагент") Тогда
						СтруктураДанныеДоговора.Контрагент = ДанныеИБ.Контрагент;
					Иначе
						СтруктураДанныеДоговора.Контрагент = ПараметрыПоУмолчанию.Контрагент;
					КонецЕсли;
					СтруктураДанныеДоговора.Наименование = ?(ЗначениеЗаполнено(СделкаСсылка.Метаданные().ПредставлениеОбъекта),
					СделкаСсылка.Метаданные().ПредставлениеОбъекта, СделкаСсылка.Метаданные().Синоним)
					+ ?(ЗначениеЗаполнено(Выборка.Номер), " " + Выборка.Номер, "");
					ДоговорЗаполнен = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ДоговорЗаполнен Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, ПараметрыПоУмолчанию, , "Дата, Номер");
		// изменение договор организаций
		//СтруктураДанныеДоговора.Наименование = НСтр("ru = 'Основной договор'");
		СтруктураДанныеДоговора.Наименование = ПараметрыПоУмолчанию.ДоговорОрганизаций;
		
	ИначеЕсли ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) > ВерсияФорматаЧислом("1.3") Тогда
		СтруктураДанныеДоговора.ВнешнийИдентификатор = СтруктураДанныеДоговора.Наименование;
	КонецЕсли;
	
	ДопРеквизиты = Новый ТаблицаЗначений;
	ДопРеквизиты.Колонки.Добавить("Свойство");
	ДопРеквизиты.Колонки.Добавить("ЗначениеСвойства");
	
	СтрокаДопРеквизитов = ДопРеквизиты.Добавить();
	СтрокаДопРеквизитов.Свойство = Новый Структура("Наименование", "ВиртуальныйДоговор");
	СтрокаДопРеквизитов.ЗначениеСвойства = "ВиртуальныйДоговор";
	
	СтруктураДанныеДоговора.Вставить("ДополнительныеРеквизиты", ДопРеквизиты);
	// изменение
	//Договор = Новый Структура("Значение, ИмяПКО", СтруктураДанныеДоговора, "Справочник_ДоговорыКонтрагентов_ИзСтруктуры");
	Договор = Новый Структура("Значение, ИмяПКО", СтруктураДанныеДоговора, "Справочник_ДоговорыОрганизаций_ИзСтруктуры");
	
	// изменение
	//ПравилоОбработки = КомпонентыОбмена.ПравилаОбработкиДанных.Найти("Справочник_ДоговорыКонтрагентов_Отправка", "Имя");
	ПравилоОбработки = КомпонентыОбмена.ПравилаОбработкиДанных.Найти("Справочник_ДоговорыОрганизаций_Отправка", "Имя");
	
	Если Не ПравилоОбработки = Неопределено Тогда
		ОбменДаннымиXDTOСервер.ВыгрузкаОбъектаВыборки(КомпонентыОбмена, СтруктураДанныеДоговора, ПравилоОбработки);
	КонецЕсли;
	
	Возврат Договор;
КонецФункции

Процедура ДобавитьПКО_Справочник_ДоговорыОрганизаций_ИзСтруктуры(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_ДоговорыОрганизаций_ИзСтруктуры";
	ПравилоКонвертации.ОбъектДанных      = Неопределено;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Договоры";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ДоговорыОрганизаций_ИзСтруктуры_ПриОтправкеДанных";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "ВалютаВзаиморасчетов", 1, "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "", "ВидДоговора", 1);
	ДобавитьПКС(СвойстваШапки, "", "Дата", 1);
	ДобавитьПКС(СвойстваШапки, "", "Контрагент", 1, "Справочник_Контрагенты");
	ДобавитьПКС(СвойстваШапки, "", "Наименование", 1);
	ДобавитьПКС(СвойстваШапки, "", "Номер", 1);
	ДобавитьПКС(СвойстваШапки, "", "Организация", 1, "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "", "РасчетыВУсловныхЕдиницах", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1);
	
КонецПроцедуры

&ИзменениеИКонтроль ("ПКО_ОтчетКомиссияМеждуОрганизациями_Комиссионер_Отправ_ПриОтправкеДанных")     
Процедура ДОК_ПКО_ОтчетКомиссияМеждуОрганизациями_Комиссионер_Отправ_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Префикс = "I";
		//++ Локализация
		Префикс = "И";
		//-- Локализация
		НомерДок = Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 7);
		ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", НомерДок);
		
		Если ДанныеИБ.РасчетыЧерезОтдельногоКонтрагента Тогда
			КонтрагентСсылка = ДанныеИБ.Контрагент;
		Иначе
			КонтрагентСсылка = КонтрагентИзОрганизации(ДанныеИБ.Комиссионер, КомпонентыОбмена);
		КонецЕсли;
		ДанныеXDTO.КлючевыеСвойства.Вставить("Контрагент", КонтрагентСсылка);
		
		Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
			УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
											"ОтчетКомиссияМеждуОрганизациями_Комиссионер_Отправ", 
											"Товары", 
											"НомерГТД",
											Истина,
											"Справочник_НомераГТД_Отправка");
		КонецЕсли;
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
			УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"ОтчетКомиссияМеждуОрганизациями_Комиссионер_Отправ", 
										"Товары", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
		КонецЕсли;
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.15") Тогда
			ДанныеXDTO.КлючевыеСвойства.Вставить("ВидОперацииОтчетаКоммисионера", "ПродажаТоваровНаКомиссии");  
		КонецЕсли;
		
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда 
			СтавкаНДСВознаграждения = СтавкаНДСПоСправочнику(ДанныеИБ.СтавкаНДСВознаграждения);  
		Иначе   
			СтавкаНДСВознаграждения = Новый Структура;
			СтавкаНДСВознаграждения.Вставить("Значение", ДанныеИБ.СтавкаНДСВознаграждения);
			СтавкаНДСВознаграждения.Вставить("ИмяПКО", "СправочникСсылка_СтавкиНДС_Отправка");
		КонецЕсли;
		
		ДанныеXDTO.Вставить("СтавкаНДСВознаграждения", СтавкаНДСВознаграждения);
		
		ДанныеXDTO.Вставить("НомерВходящегоДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерДок, Ложь, Истина));
		
		ВыгрузитьПодразделение(ДанныеИБ, ДанныеXDTO);
		
		#Область Договор
		
		ИнструкцияДоговор = Неопределено;
		Если ДанныеИБ.РасчетыЧерезОтдельногоКонтрагента
			И ЗначениеЗаполнено(ДанныеИБ.ДоговорПокупки)
			И ОбщегоНазначения.СсылкаСуществует(ДанныеИБ.ДоговорПокупки) Тогда
			
			ИнструкцияДоговор = Новый Структура;
			ИнструкцияДоговор.Вставить("ИмяПКО",   "Справочник_ДоговорыКонтрагентов");
			ИнструкцияДоговор.Вставить("Значение", ДанныеИБ.ДоговорПокупки);
			
		ИначеЕсли ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
			
			ИнструкцияДоговор = Новый Структура;
			ИнструкцияДоговор.Вставить("ИмяПКО",   "Справочник_ДоговорыМеждуОрганизациями");
			ИнструкцияДоговор.Вставить("Значение", ДанныеИБ.Договор);
			
		Иначе
			ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
			ПараметрыПоУмолчанию.ВидДоговора              = "СКомиссионером";
			ПараметрыПоУмолчанию.Организация              = ДанныеИБ.Организация;
			ПараметрыПоУмолчанию.Контрагент               = КонтрагентСсылка;
			ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = ДанныеИБ.Валюта;
			ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = Ложь;
			
		#Удаление
			ИнструкцияДоговор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию,
			КомпонентыОбмена,
			ДанныеИБ.Договор);
		#КонецУдаления
		#Вставка      
		если значениезаполнено(ДанныеИБ.Договор) тогда
			ПараметрыПоУмолчанию.Вставить("ДоговорОрганизаций",СОКРЛП(ДанныеИБ.Договор.Наименование));
		конецесли;
		ИнструкцияДоговор=ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетовОрганизаций(ПараметрыПоУмолчанию, КомпонентыОбмена);
		#КонецВставки
		КонецЕсли;
		ДанныеXDTO.Вставить("Договор", ИнструкцияДоговор);
		
		#КонецОбласти
		
		ВыгрузитьКурсИКратностьВзаиморасчетов(ДанныеXDTO, ДанныеИБ.Валюта, ДанныеИБ.Дата, ДанныеИБ.Организация);
		
		ДанныеXDTO.Вставить("СуммаВключаетНДС", Истина);
		
		// Табличные части.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтрокиДокумента,
		|	Товары.Ссылка КАК Ссылка,
		|	Товары.Ссылка.Организация КАК Организация,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Товары.Количество КАК Количество,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	ВЫБОР
		|		КОГДА Товары.СуммаСНДС / Товары.Количество < 0.01
		|			ТОГДА 0.01
		|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаСНДС / Товары.Количество КАК ЧИСЛО(31, 2))
		|	КОНЕЦ КАК ЦенаПередачи,
		|	Товары.СуммаСНДС КАК СуммаПередачи,
		|	ВЫБОР
		|		КОГДА Товары.СуммаПродажи / Товары.Количество < 0.01
		|			ТОГДА 0.01
		|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаПродажи / Товары.Количество КАК ЧИСЛО(31, 2))
		|	КОНЕЦ КАК Цена,
		|	Товары.СуммаПродажи КАК Сумма,
		|	Товары.СуммаПродажиНДС КАК СуммаНДС,
		|	Товары.СуммаВознаграждения КАК СуммаВознаграждения,
		|	Товары.Покупатель КАК Покупатель,
		|	Товары.ДатаСчетаФактурыКомиссионера КАК ДатаСФ,
		|	НоменклатураСпр.ОсобенностьУчета КАК ОсобенностьУчета,
		|	НоменклатураСпр.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ВЫБОР
		|		КОГДА Товары.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ХарактеристикаСпр.НаименованиеПолное = """"
		|						ТОГДА ХарактеристикаСпр.Наименование
		|					ИНАЧЕ ХарактеристикаСпр.НаименованиеПолное
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ХарактеристикаНаименование,
		|	ВЫБОР
		|		КОГДА НоменклатураСпр.НаименованиеПолное = """"
		|			ТОГДА НоменклатураСпр.Наименование
		|		ИНАЧЕ НоменклатураСпр.НаименованиеПолное
		|	КОНЕЦ КАК НоменклатураНаименование,
		//++ Локализация
		|	Товары.СчетФактураВыставленныйКомиссионера.Номер КАК НомерСФ,
		//-- Локализация
		|	Товары.НомерГТД КАК НомерГТД
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	Документ.ОтчетПоКомиссииМеждуОрганизациями.Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО (НоменклатураСпр.Ссылка = Товары.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикаСпр
		|		ПО (ХарактеристикаСпр.Ссылка = Товары.Характеристика)
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И Товары.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.НомерСтроки,
		|	Товары.Ссылка,
		|	Товары.Ссылка.Организация,
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Номенклатура.ЕдиницаИзмерения,
		|	Товары.Количество,
		|	Товары.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА Товары.СуммаСНДС / Товары.Количество < 0.01
		|			ТОГДА 0.01
		|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаСНДС / Товары.Количество КАК ЧИСЛО(31, 2))
		|	КОНЕЦ,
		|	Товары.СуммаСНДС,
		|	ВЫБОР
		|		КОГДА Товары.СуммаПродажи / Товары.Количество < 0.01
		|			ТОГДА 0.01
		|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаПродажи / Товары.Количество КАК ЧИСЛО(31, 2))
		|	КОНЕЦ,
		|	Товары.СуммаПродажи,
		|	Товары.СуммаПродажиНДС,
		|	Товары.СуммаВознаграждения,
		|	ВЫБОР
		|		КОГДА Товары.Количество < 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	Товары.Покупатель,
		|	Товары.ДатаСчетаФактурыКомиссионера,
		|	НоменклатураСпр.ОсобенностьУчета,
		|	НоменклатураСпр.ТипНоменклатуры,
		|	ВЫБОР
		|		КОГДА Товары.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ХарактеристикаСпр.НаименованиеПолное = """"
		|						ТОГДА ХарактеристикаСпр.Наименование
		|					ИНАЧЕ ХарактеристикаСпр.НаименованиеПолное
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НоменклатураСпр.НаименованиеПолное = """"
		|			ТОГДА НоменклатураСпр.Наименование
		|		ИНАЧЕ НоменклатураСпр.НаименованиеПолное
		|	КОНЕЦ,
		//++ Локализация
		|	Товары.СчетФактураВыставленныйКомиссионера.Номер,
		//-- Локализация
		|	Товары.НомерГТД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товары.Ссылка,
		|	Организация,
		|	Покупатель,
		|	ДатаСФ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРаспределения.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	ТаблицаРаспределения.Номенклатура КАК Номенклатура,
		|	ТаблицаРаспределения.Характеристика КАК Характеристика,
		|	ТаблицаРаспределения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаРаспределения.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаРаспределения.СуммаВознаграждения КАК СуммаВознаграждения,
		|	ТаблицаРаспределения.Покупатель КАК Покупатель,
		|	ТаблицаРаспределения.ДатаСФ КАК ДатаСФ,
		|	ТаблицаРаспределения.ТипНоменклатуры КАК ТипНоменклатуры,
		|	0 КАК СуммаНДСВознаграждения
		|ИЗ
		|	втТовары КАК ТаблицаРаспределения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Товары.Количество КАК Количество,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.ЦенаПередачи КАК ЦенаПередачи,
		|	Товары.СуммаПередачи КАК СуммаПередачи,
		|	Товары.Цена КАК Цена,
		|	Товары.Сумма КАК Сумма,
		|	Товары.СуммаНДС КАК СуммаНДС,
		|	Товары.СуммаВознаграждения КАК СуммаВознаграждения,
		|	Товары.Покупатель КАК Покупатель,
		|	Товары.ДатаСФ КАК ДатаСФ,
		|	ЛОЖЬ КАК ВидыЗапасовЗаполнены,
		|	1 КАК Коэффициент,
		|	1 КАК КлючСтроки,
		|	ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(50)) КАК ТипЗапасов,
		|	&ТоварыНомерГТД КАК НомерГТД,
		|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
		|	0 КАК СуммаНДСВознаграждения
		|ИЗ
		|	втТовары КАК Товары
		|ГДЕ
		|	Товары.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Услуги.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	Услуги.Номенклатура КАК Номенклатура,
		|	Услуги.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА Услуги.ХарактеристикаНаименование = """"
		|			ТОГДА Услуги.НоменклатураНаименование
		|		ИНАЧЕ Услуги.НоменклатураНаименование + "" ("" + Услуги.ХарактеристикаНаименование + "")""
		|	КОНЕЦ КАК Содержание,
		|	Услуги.Количество КАК Количество,
		|	Услуги.СтавкаНДС КАК СтавкаНДС,
		|	Услуги.Цена КАК Цена,
		|	Услуги.Сумма КАК Сумма,
		|	Услуги.СуммаНДС КАК СуммаНДС,
		|	Услуги.СуммаВознаграждения КАК СуммаВознаграждения,
		|	Услуги.Покупатель КАК Покупатель,
		|	Услуги.ДатаСФ КАК ДатаСФ,
		|	1 КАК КлючСтроки,
		|	0 КАК СуммаНДСВознаграждения
		|ИЗ
		|	втТовары КАК Услуги
		|ГДЕ
		|	Услуги.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И Услуги.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПродавцом)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЗапасов.Количество КАК Количество,
		|	&ТекстЗапросаРНПТ,
		|	&ТекстЗапросаГТД,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.ВидЗапасов.РеализацияЗапасовДругойОрганизации
		|			ТОГДА ВЫБОР
		|					КОГДА ВидыЗапасов.ВидЗапасов.ВидЗапасовВладельца.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
		|						ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
		|					ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
		|				КОНЕЦ
		|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
		|	КОНЕЦ КАК ТипЗапасов,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.Количество < 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Сторно,
		|	ВидыЗапасов.ДатаСчетаФактурыКомиссионера КАК ДатаСФ,
		|	ВидыЗапасов.Покупатель КАК Покупатель,
		|	Аналитика.Номенклатура КАК Номенклатура,
		|	Аналитика.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.ОтчетПоКомиссииМеждуОрганизациями.ВидыЗапасов КАК ВидыЗапасов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
		|		ПО ВидыЗапасов.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
		|ГДЕ
		|	ВидыЗапасов.Ссылка = &Ссылка
		|	И ВидыЗапасов.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК КлючСтроки,
		|	ВЫБОР
		|		КОГДА втТовары.Покупатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА втТовары.Ссылка.Контрагент
		|		ИНАЧЕ втТовары.Покупатель
		|	КОНЕЦ КАК Покупатель,
		//++ Локализация
		|	ВЫБОР
		|		КОГДА втТовары.ДатаСФ = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА СчетФактураВыданный.Дата
		|		ИНАЧЕ втТовары.ДатаСФ
		|	КОНЕЦ КАК ДатаСФ,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА СчетФактураВыданный.Ссылка ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК ВыставленСФ,
		|	МАКСИМУМ(ЕСТЬNULL(СчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка))) КАК СчетФактура,
		|	втТовары.НомерСФ КАК НомерСФ,
		//-- Локализация
		|	МИНИМУМ(втТовары.НомерСтрокиДокумента) КАК ЗначениеУпорядочивания
		|ИЗ
		|	втТовары КАК втТовары
		//++ Локализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО втТовары.Ссылка = СчетФактураВыданный.ДокументОснование
		|			И втТовары.Организация = СчетФактураВыданный.Организация
		|			И (втТовары.ДатаСФ = НАЧАЛОПЕРИОДА(СчетФактураВыданный.Дата, ДЕНЬ)
		|				ИЛИ втТовары.ДатаСФ = ДАТАВРЕМЯ(1, 1, 1))
		|			И втТовары.Покупатель = СчетФактураВыданный.Контрагент
		|			И (НЕ СчетФактураВыданный.ПометкаУдаления)
		//-- Локализация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА втТовары.Покупатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА втТовары.Ссылка.Контрагент
		|		ИНАЧЕ втТовары.Покупатель
		|	КОНЕЦ
		//++ Локализация
		|	,
		|	ВЫБОР
		|		КОГДА втТовары.ДатаСФ = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА СчетФактураВыданный.Дата
		|		ИНАЧЕ втТовары.ДатаСФ
		|	КОНЕЦ,
		|	втТовары.НомерСФ
		//-- Локализация
		|");
		
		ЗаполнитьСобственныеТоварыВТексте(Запрос.Текст);
		
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
			ТоварыНомерГТД = "Товары.НомерГТД";
		Иначе
			ТоварыНомерГТД = "ЕСТЬNULL(Товары.НомерГТД.Код, """")";
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТоварыНомерГТД" , ТоварыНомерГТД); 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаРНПТ",
		ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "ВидыЗапасов", "Аналитика"));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаГТД",
		ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ВидыЗапасов"));
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		// Выгружаем таблицы из запроса
		
		ТабРаспределения = РезультатыЗапроса[1].Выгрузить();
		ТабТовары        = РезультатыЗапроса[2].Выгрузить();
		ТабУслуги        = РезультатыЗапроса[3].Выгрузить();
		ВидыЗапасов      = РезультатыЗапроса[4].Выбрать();
		ТабПокупатели    = РезультатыЗапроса[5].Выгрузить();
		
		РеквизитыПоиска = "Номенклатура,Характеристика,ДатаСФ,Покупатель";
		
		// Распределение НДС вознаграждения
		
		БазаРаспределенияПоСуммеВознаграждения = ТабРаспределения.ВыгрузитьКолонку("СуммаВознаграждения");
		РаспределениеНДСВознаграждения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеИБ.СуммаНДСВознаграждения, 
		БазаРаспределенияПоСуммеВознаграждения);
		
		Если ЗначениеЗаполнено(РаспределениеНДСВознаграждения) Тогда
			ТабРаспределения.ЗагрузитьКолонку(РаспределениеНДСВознаграждения, "СуммаНДСВознаграждения");
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура(РеквизитыПоиска + ",СтавкаНДС");
		ЗаполняемыеРеквизиты = "СуммаНДСВознаграждения";
		
		ТабТовары.Индексы.Добавить(РеквизитыПоиска + ",СтавкаНДС");
		
		Для Каждого СтрокаТаблицыРаспределения Из ТабРаспределения Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицыРаспределения);
			
			Если СтрокаТаблицыРаспределения.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
				НайденныеСтроки = ТабТовары.НайтиСтроки(СтруктураПоиска);
			ИначеЕсли СтрокаТаблицыРаспределения.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				НайденныеСтроки = ТабУслуги.НайтиСтроки(СтруктураПоиска);
			КонецЕсли;
			
			Для Каждого СтрокаДокумента Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаТаблицыРаспределения, ЗаполняемыеРеквизиты);
			КонецЦикла;
			
		КонецЦикла;
		
		// Распределение товаров по видам запасов
		
		СтруктураПоиска = Новый Структура(РеквизитыПоиска + ",ВидыЗапасовЗаполнены");
		ЗаполняемыеРеквизиты = "ТипЗапасов";
		
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
			ЗаполняемыеРеквизиты = ЗаполняемыеРеквизиты + ", ЕдиницаИзмеренияПрослеживаемости, ПрослеживаемыйТовар, КоличествоРНПТ, СтранаПроисхождения";
			ТабТовары.Колонки.Добавить("ЕдиницаИзмеренияПрослеживаемости");
			ТабТовары.Колонки.Добавить("ПрослеживаемыйТовар");
			ТабТовары.Колонки.Добавить("КоличествоРНПТ"); 
		Иначе
			ЗаполняемыеРеквизиты = ЗаполняемыеРеквизиты + ", СтранаПроисхождения";
		КонецЕсли;
		
		ТабТовары.Индексы.Добавить(РеквизитыПоиска + ",ВидыЗапасовЗаполнены");
		
		Пока ВидыЗапасов.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВидыЗапасов, РеквизитыПоиска);
			СтруктураПоиска.ВидыЗапасовЗаполнены = Ложь;
			
			НайденныеСтроки = ТабТовары.НайтиСтроки(СтруктураПоиска);
			
			ОсталосьВидаЗапасов = ВидыЗапасов.Количество;
			Для Каждого СтрокаДокумента Из НайденныеСтроки Цикл
				
				Если ОсталосьВидаЗапасов = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если СтрокаДокумента.Количество <= ОсталосьВидаЗапасов Тогда
					
					ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВидыЗапасов, ЗаполняемыеРеквизиты);
					СтрокаДокумента.ВидыЗапасовЗаполнены = Истина;
					Если Не ЗначениеЗаполнено(СтрокаДокумента.НомерГТД) Тогда
						СтрокаДокумента.НомерГТД = ВидыЗапасов.НомерГТД;
					КонецЕсли;
					ОсталосьВидаЗапасов = ОсталосьВидаЗапасов - СтрокаДокумента.Количество;
					
				Иначе
					
					// Выделение новой строки с заполненным видом запасов.
					НоваяСтрока = ТабТовары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
					
					ДоляВидаЗапасовВСтрокеДокумента = ОсталосьВидаЗапасов / СтрокаДокумента.Количество;
					
					НоваяСтрока.Количество             = ОсталосьВидаЗапасов;
					НоваяСтрока.СуммаПередачи          = Окр(СтрокаДокумента.СуммаПередачи * ДоляВидаЗапасовВСтрокеДокумента, 2);
					НоваяСтрока.Сумма                  = Окр(СтрокаДокумента.Сумма * ДоляВидаЗапасовВСтрокеДокумента, 2);
					НоваяСтрока.СуммаНДС               = Окр(СтрокаДокумента.СуммаНДС * ДоляВидаЗапасовВСтрокеДокумента, 2);
					НоваяСтрока.СуммаВознаграждения    = Окр(СтрокаДокумента.СуммаВознаграждения * ДоляВидаЗапасовВСтрокеДокумента, 2);
					НоваяСтрока.СуммаНДСВознаграждения = Окр(СтрокаДокумента.СуммаНДСВознаграждения * ДоляВидаЗапасовВСтрокеДокумента, 2);
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВидыЗапасов, ЗаполняемыеРеквизиты);
					
					СтрокаДокумента.Количество             = СтрокаДокумента.Количество - НоваяСтрока.Количество;
					СтрокаДокумента.СуммаПередачи          = СтрокаДокумента.СуммаПередачи - НоваяСтрока.СуммаПередачи;
					СтрокаДокумента.Сумма                  = СтрокаДокумента.Сумма - НоваяСтрока.Сумма;
					СтрокаДокумента.СуммаНДС               = СтрокаДокумента.СуммаНДС - НоваяСтрока.СуммаНДС;
					СтрокаДокумента.СуммаВознаграждения    = СтрокаДокумента.СуммаВознаграждения - НоваяСтрока.СуммаВознаграждения;
					СтрокаДокумента.СуммаНДСВознаграждения = СтрокаДокумента.СуммаНДСВознаграждения - НоваяСтрока.СуммаНДСВознаграждения;
					
					ОсталосьВидаЗапасов = 0;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ТабТовары.Сортировать("НомерСтрокиДокумента Возр");
		ТабУслуги.Сортировать("НомерСтрокиДокумента Возр");
		
		// Установление связей между таблицей покупателей и таблицами товаров и услуг.
		
		СтруктураПоиска = Новый Структура("Покупатель");
		//++ Локализация
		СтруктураПоиска = Новый Структура("Покупатель,ДатаСФ");
		//-- Локализация
		
		ЗаполняемыеРеквизиты = "КлючСтроки";
		
		Для Каждого Строка Из ТабПокупатели Цикл
			
			Строка.КлючСтроки = ТабПокупатели.Индекс(Строка) + 1;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
			
			НайденныеСтрокиТоваров = ТабТовары.НайтиСтроки(СтруктураПоиска);
			НайденныеСтрокиУслуг   = ТабУслуги.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого СтрокаТоваров Из НайденныеСтрокиТоваров Цикл
				ЗаполнитьЗначенияСвойств(СтрокаТоваров, Строка, ЗаполняемыеРеквизиты);
			КонецЦикла;
			
			Для Каждого СтрокаУслуг Из НайденныеСтрокиУслуг Цикл
				ЗаполнитьЗначенияСвойств(СтрокаУслуг, Строка, ЗаполняемыеРеквизиты);
			КонецЦикла;
			
		КонецЦикла;
		
		ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, ТабТовары, Истина, Ложь);
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
			ПереопределитьСтавкуНДСДляСтарыхФорматов(ТабТовары, Ложь);
		КонецЕсли;
		ДанныеXDTO.Вставить("Товары", ТабТовары);
		ДанныеXDTO.Вставить("Покупатели", ТабПокупатели);
		
		ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
		//++ Локализация
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
			ИмяТаблицы = "Документ.ОтчетПоКомиссииМеждуОрганизациями.ВидыЗапасов"; 
			ИдентификаторыИзВидовЗапасов = Истина;
			ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов); 
		КонецЕсли;
	    //-- Локализация
КонецПроцедуры

&ИзменениеИКонтроль ("ПКО_ОтчетКомиссияМеждуОрганизациями_Комитент_Отправка_ПриОтправкеДанных")
Процедура ДОК_ПКО_ОтчетКомиссияМеждуОрганизациями_Комитент_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Префикс = "I";
	//++ Локализация
	Префикс = "И";
	//-- Локализация
	НомерДок = Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 7);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", НомерДок);
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"ОтчетКомиссияМеждуОрганизациями_Комитент_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"ОтчетКомиссияМеждуОрганизациями_Комитент_Отправка", 
										"Товары", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда
		СтавкаНДСВознаграждения = ?(ЗначениеЗаполнено(ДанныеИБ.СтавкаНДСВознаграждения),
									СтавкаНДСПоСправочнику(ДанныеИБ.СтавкаНДСВознаграждения),
									Перечисления.СтавкиНДС.БезНДС);
	Иначе	
		СтавкаНДСВознаграждения = Новый Структура; 
		ПредСтавкаНДС = ?(ЗначениеЗаполнено(ДанныеИБ.СтавкаНДСВознаграждения),ДанныеИБ.СтавкаНДСВознаграждения, 
								Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС",Перечисления.СтавкиНДС.БезНДС));
		СтавкаНДСВознаграждения.Вставить("Значение", ПредСтавкаНДС);
		СтавкаНДСВознаграждения.Вставить("ИмяПКО", "СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	ДанныеXDTO.Вставить("СтавкаНДСВознаграждения", СтавкаНДСВознаграждения);
	//-- Локализация
	ВыгрузитьПодразделение(ДанныеИБ, ДанныеXDTO);
	
	Если ДанныеИБ.РасчетыЧерезОтдельногоКонтрагента Тогда
		КонтрагентСсылка = ДанныеИБ.Контрагент;
	Иначе
		КонтрагентСсылка = КонтрагентИзОрганизации(ДанныеИБ.Организация, КомпонентыОбмена);
	КонецЕсли;
	ДанныеXDTO.Вставить("Контрагент", КонтрагентСсылка);
	
	#Область Договор
	
	ИнструкцияДоговор = Неопределено;
	Если ДанныеИБ.РасчетыЧерезОтдельногоКонтрагента
		И ЗначениеЗаполнено(ДанныеИБ.ДоговорПродажи)
		И ОбщегоНазначения.СсылкаСуществует(ДанныеИБ.ДоговорПродажи) Тогда
			ИнструкцияДоговор = Новый Структура;
			ИнструкцияДоговор.Вставить("ИмяПКО",   "Справочник_ДоговорыКонтрагентов");
			ИнструкцияДоговор.Вставить("Значение", ДанныеИБ.ДоговорПродажи);
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
		
		ДанныеДоговора = ДанныеДоговораМеждуОрганизациями(КомпонентыОбмена, ДанныеИБ.Договор);
		ИнструкцияДоговор = Новый Структура("Значение, ИмяПКО", ДанныеДоговора, "Справочник_ДоговорыКонтрагентов_ИзСтруктуры");
		
	Иначе
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.ВидДоговора              = "СКомитентом";
		ПараметрыПоУмолчанию.Организация              = ДанныеИБ.Комиссионер;
		ПараметрыПоУмолчанию.Контрагент               = КонтрагентСсылка;
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = ДанныеИБ.Валюта;
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = Ложь;
		#Удаление
		ИнструкцияДоговор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию,
							КомпонентыОбмена,
							ДанныеИБ.Договор);
		#КонецУдаления
		#Вставка
		если значениезаполнено(ДанныеИБ.Договор) тогда
			ПараметрыПоУмолчанию.Вставить("ДоговорОрганизаций",СОКРЛП(ДанныеИБ.Договор.Наименование));
		конецесли;
		ИнструкцияДоговор=ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетовОрганизаций(ПараметрыПоУмолчанию, КомпонентыОбмена);
		#КонецВставки
	КонецЕсли;
	ДанныеXDTO.Вставить("Договор", ИнструкцияДоговор);
	
	#КонецОбласти
	
	ДанныеXDTO.Вставить("СуммаВключаетНДС", Истина);
	
	ВыгрузитьКурсИКратностьВзаиморасчетов(ДанныеXDTO, ДанныеИБ.Валюта, ДанныеИБ.Дата, ДанныеИБ.Организация);
	
	// Табличная часть
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.НомерСтроки КАК НомерСтрокиДокумента,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.Номенклатура КАК Номенклатура,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.Характеристика КАК Характеристика,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ОтчетПоКомиссииМеждуОрганизациямиТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаСНДС / ОтчетПоКомиссииМеждуОрганизациямиТовары.Количество < 0.01
	|					ТОГДА 0.01
	|				ИНАЧЕ ВЫРАЗИТЬ(ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаСНДС / ОтчетПоКомиссииМеждуОрганизациямиТовары.Количество КАК ЧИСЛО(31, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаПоступления,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаСНДС КАК СуммаПоступления,
	|	ВЫБОР
	|		КОГДА ОтчетПоКомиссииМеждуОрганизациямиТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаПродажи / ОтчетПоКомиссииМеждуОрганизациямиТовары.Количество < 0.01
	|					ТОГДА 0.01
	|				ИНАЧЕ ВЫРАЗИТЬ(ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаПродажи / ОтчетПоКомиссииМеждуОрганизациямиТовары.Количество КАК ЧИСЛО(31, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаПродажи КАК Сумма,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаПродажиНДС КАК СуммаНДС,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаВознаграждения КАК СуммаВознаграждения,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.ДатаСчетаФактурыКомиссионера КАК ДатаРеализации,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.Покупатель КАК Покупатель
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями.Товары КАК ОтчетПоКомиссииМеждуОрганизациямиТовары
	|ГДЕ
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыЗапасов.Количество КАК Количество,
	|	&ТекстЗапросаРНПТ,
	|	&ТекстЗапросаГТД,
	|	ВЫБОР
	|		КОГДА ВидыЗапасов.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА ВЫБОР
	|					КОГДА ВидыЗапасов.ВидЗапасов.ВидЗапасовВладельца.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|						ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
	|					ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
	|	КОНЕЦ КАК ТипЗапасов,
	|	ВидыЗапасов.ДатаСчетаФактурыКомиссионера КАК ДатаРеализации,
	|	ВидыЗапасов.Покупатель КАК Покупатель,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями.ВидыЗапасов КАК ВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО ВидыЗапасов.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|ГДЕ
	|	ВидыЗапасов.Ссылка = &Ссылка
	|	И ВидыЗапасов.Количество > 0";
	
	ЗаполнитьСобственныеТоварыВТексте(ТекстЗапроса);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРНПТ",
	ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "ВидыЗапасов", "Аналитика"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаГТД",
	ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ВидыЗапасов"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Товары = РезультатыЗапроса[0].Выгрузить();
	ВидыЗапасов = РезультатыЗапроса[1].Выбрать();
	
	Если Товары.Итог("СуммаНДСВознаграждения") <> ДанныеИБ.СуммаНДСВознаграждения Тогда
		
		БазаРаспределенияПоСуммеВознаграждения = Товары.ВыгрузитьКолонку("СуммаВознаграждения");
		РаспределениеНДСВознаграждения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеИБ.СуммаНДСВознаграждения, 
		БазаРаспределенияПоСуммеВознаграждения);
		
		Если ЗначениеЗаполнено(РаспределениеНДСВознаграждения) Тогда
			Товары.ЗагрузитьКолонку(РаспределениеНДСВознаграждения, "СуммаНДСВознаграждения");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		
		Товары.Колонки.Добавить("НомерГТД");
		Товары.Колонки.Добавить("СтранаПроисхождения");
		Товары.Колонки.Добавить("КоличествоРНПТ");
		Товары.Колонки.Добавить("ПрослеживаемыйТовар");
		Товары.Колонки.Добавить("ЕдиницаИзмеренияПрослеживаемости");
		
		РеквизитыПоиска = "Номенклатура, Характеристика, ДатаРеализации, Покупатель";
		
		ЗаполняемыеРеквизиты = "НомерГТД, СтранаПроисхождения, КоличествоРНПТ, ПрослеживаемыйТовар, ЕдиницаИзмеренияПрослеживаемости";
		СтруктураПоиска = Новый Структура(РеквизитыПоиска);
		
		Пока ВидыЗапасов.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВидыЗапасов);
			НайденныеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
			ОсталосьВидаЗапасов = ВидыЗапасов.Количество;
			
			Для Каждого СтрокаДокумента Из НайденныеСтроки Цикл
				Если ОсталосьВидаЗапасов = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если СтрокаДокумента.Количество <= ОсталосьВидаЗапасов Тогда
					ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВидыЗапасов, ЗаполняемыеРеквизиты); 
					Если ЗначениеЗаполнено(СтрокаДокумента.ПрослеживаемыйТовар) и СтрокаДокумента.ПрослеживаемыйТовар И ТИПЗНЧ(СтрокаДокумента.НомерГТД) = Тип("Строка") Тогда
						СпрДокументаНомерГТД = Справочники.НомераГТД.НайтиПоКоду(ВидыЗапасов.НомерГТД);  
						Если Не ЗначениеЗаполнено(СпрДокументаНомерГТД) Тогда
							СтрокаДокумента.НомерГТД = Справочники.НомераГТД.ПустаяСсылка();
						Иначе 	
							СтрокаДокумента.НомерГТД = СпрДокументаНомерГТД.Ссылка;
						КонецЕсли;
					КонецЕсли;
					ОсталосьВидаЗапасов = ОсталосьВидаЗапасов - СтрокаДокумента.Количество;
				Иначе
					// Выделение новой строки с заполненным видом запасов.
					НоваяСтрока = Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
					
					ДоляВидаЗапасовВСтрокеДокумента = ОсталосьВидаЗапасов / СтрокаДокумента.Количество;
					НоваяСтрока.Количество             = ОсталосьВидаЗапасов;
					НоваяСтрока.СуммаПоступления       = Окр(СтрокаДокумента.СуммаПоступления * ДоляВидаЗапасовВСтрокеДокумента, 2);
					НоваяСтрока.Сумма                  = Окр(СтрокаДокумента.Сумма * ДоляВидаЗапасовВСтрокеДокумента, 2);
					НоваяСтрока.СуммаНДС               = Окр(СтрокаДокумента.СуммаНДС * ДоляВидаЗапасовВСтрокеДокумента, 2);
					НоваяСтрока.СуммаВознаграждения    = Окр(СтрокаДокумента.СуммаВознаграждения * ДоляВидаЗапасовВСтрокеДокумента, 2);
					НоваяСтрока.СуммаНДСВознаграждения = Окр(СтрокаДокумента.СуммаНДСВознаграждения * ДоляВидаЗапасовВСтрокеДокумента, 2);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВидыЗапасов, ЗаполняемыеРеквизиты);
					
					СтрокаДокумента.Количество             = СтрокаДокумента.Количество - НоваяСтрока.Количество;
					СтрокаДокумента.СуммаПоступления       = СтрокаДокумента.СуммаПоступления - НоваяСтрока.СуммаПоступления;
					СтрокаДокумента.Сумма                  = СтрокаДокумента.Сумма - НоваяСтрока.Сумма;
					СтрокаДокумента.СуммаНДС               = СтрокаДокумента.СуммаНДС - НоваяСтрока.СуммаНДС;
					СтрокаДокумента.СуммаВознаграждения    = СтрокаДокумента.СуммаВознаграждения - НоваяСтрока.СуммаВознаграждения;
					СтрокаДокумента.СуммаНДСВознаграждения = СтрокаДокумента.СуммаНДСВознаграждения - НоваяСтрока.СуммаНДСВознаграждения;
					ОсталосьВидаЗапасов = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, Товары, Истина, Ложь);
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(Товары, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить("Товары", Товары);
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.ОтчетПоКомиссииМеждуОрганизациями.ВидыЗапасов"; 
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов);
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

#КонецОбласти

&ИзменениеИКонтроль ("ДобавитьПОД_Документ_ОтчетБанкаПоЭквайрингу_Отправка")
Процедура ДОК_ДобавитьПОД_Документ_ОтчетБанкаПоЭквайрингу_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ОтчетБанкаПоЭквайрингу_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ОтчетБанкаПоОперациямЭквайринга;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ОтчетБанкаПоОперациямЭквайринга_Отправка");
	#Вставка
	ПравилоОбработки.ПриОбработке            = "Документ_ОтчетБанкаПоОперациямЭквайринга_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных           = истина;
	#КонецВставки
	
КонецПроцедуры


&Вместо ("ПОД_Справочник_ШтрихкодыНоменклатуры_Отправка_ПриОбработке")
Процедура ДОК_ПОД_Справочник_ШтрихкодыНоменклатуры_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Справочник_ШтрихкодыНоменклатуры_Отправка = ложь;
КонецПроцедуры
&ИзменениеИКонтроль ("ПОД_Документ_АвансовыйОтчет_ПриОбработке")
Процедура ДОК_ПОД_Документ_АвансовыйОтчет_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	Если ТипЗнч(ДанныеИБ) = Тип("Структура") Тогда
		Если ДанныеИБ.Свойство("ВыгружатьУдалениеПоСсылке") Тогда
			ИспользованиеПКО.Документ_АвансовыйОтчет_Отправка = Ложь;
		Иначе
			ИспользованиеПКО.Удалить("Документ_АвансовыйОтчет_Отправка");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ОчиститьИспользованиеПКО(ИспользованиеПКО);
	
	ПравилоАвансовыйОтчет = КомпонентыОбмена.ПравилаОбработкиДанных.Найти("Документ_АвансовыйОтчет", "Имя");
	Если ПравилоАвансовыйОтчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.Ссылка КАК ПриобретениеТоваровУслуг,
		|	ПриобретениеТоваровУслуг.Склад КАК Склад,
		//++ Локализация
		|	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
		//-- Локализация
		|	ПриобретениеТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС
		|ПОМЕСТИТЬ втДокументыПриобретения
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		//++ Локализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО ПриобретениеТоваровУслуг.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|			И (СчетФактураПолученныйДокументыОснования.Ссылка.Проведен)
		//-- Локализация
		|ГДЕ
		|	ПриобретениеТоваровУслуг.АвансовыйОтчет = &Ссылка
		|	И ПриобретениеТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровУслуг.Ссылка,
		|	ПриобретениеТоваровУслуг.Склад,
		|	ПриобретениеТоваровУслуг.ЦенаВключаетНДС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПриобретениеТоваровУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтрокиДокумента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Серия КАК Серия,
		|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Товары.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА втДокументыПриобретения.ЦенаВключаетНДС
		|			ТОГДА Товары.Сумма
		|		ИНАЧЕ Товары.Сумма + Товары.СуммаНДС
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА Товары.Количество > 0
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА втДокументыПриобретения.ЦенаВключаетНДС
		|							ТОГДА Товары.Сумма
		|						ИНАЧЕ Товары.Сумма + Товары.СуммаНДС
		|					КОНЕЦ / Товары.Количество КАК ЧИСЛО(31, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА Товары.КоличествоУпаковок > 0
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА втДокументыПриобретения.ЦенаВключаетНДС
		|							ТОГДА Товары.Сумма
		|						ИНАЧЕ Товары.Сумма + Товары.СуммаНДС
		|					КОНЕЦ / Товары.КоличествоУпаковок КАК ЧИСЛО(31, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаЗаУпаковку,
		|	Товары.Упаковка КАК Упаковка,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.СуммаНДС КАК СуммаНДС,
		|	Товары.СтатьяРасходов КАК СтатьяРасходов,
		|	&ТекстЗапросаПризнаватьРасходамиПриУСН_ТоварыУслуги,
		|	Товары.НомерГТД КАК НомерГТД,
		|	Товары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
		|	Товары.СтатьяРасходов.КорреспондирующийСчет КАК КорреспондирующийСчет,
		|	Товары.Ссылка.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
		|	Товары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	Товары.Подразделение КАК Подразделение,
		|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Товары.Ссылка.Контрагент КАК Поставщик,
		|	Товары.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	Товары.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	Товары.Ссылка.Валюта КАК Валюта,
		//++ Локализация
		|	ВЫБОР
		|		КОГДА СчетФактураПолученный.Ссылка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПредъявленСФ,
		|	СчетФактураПолученный.ДатаСоставления КАК ДатаСФ,
		|	СчетФактураПолученный.Номер КАК НомерСФ,
		//-- Локализация
		|	Товары.Ссылка.ХозяйственнаяОперация КАК ХозяйственнаяОперация
		|ПОМЕСТИТЬ втТоварыУслуги
		|ИЗ
		|	втДокументыПриобретения КАК втДокументыПриобретения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
		|		ПО втДокументыПриобретения.ПриобретениеТоваровУслуг = Товары.Ссылка
		//++ Локализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|		ПО втДокументыПриобретения.СчетФактура = СчетФактураПолученный.Ссылка
		//-- Локализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслугШтрихкодыУпаковок.НомерСтроки КАК НомерСтрокиДокумента,
		//++ Локализация
		|	ШтрихкодыУпаковокТоваров.ТипУпаковки КАК ТипУпаковки,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		//-- Локализация
		|	ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ втШтрихкодыУпаковок
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.ШтрихкодыУпаковок КАК ПриобретениеТоваровУслугШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДокументыПриобретения КАК втДокументыПриобретения
		|		ПО ПриобретениеТоваровУслугШтрихкодыУпаковок.Ссылка = втДокументыПриобретения.ПриобретениеТоваровУслуг
		//++ Локализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
		//-- Локализация
		|ГДЕ
		|	&ВыгружатьШтрихкодыУпаковок
		//++ Локализация
		|	И НЕ ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		//-- Локализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	втДокументыПриобретения.Склад КАК Склад
		|ИЗ
		|	втДокументыПриобретения КАК втДокументыПриобретения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	втТовары.Номенклатура КАК Номенклатура,
		|	&ТекстЗапросаХарактеристика,
		|	&ТекстЗапросаУпаковка,
		|	&ТекстЗапросаСерия,
		|	&ТекстЗапросаРНПТ,
		|	&ТекстЗапросаГТД,
		|	втТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	втТовары.Количество КАК Количество,
		|	втТовары.Сумма КАК Сумма,
		|	втТовары.Цена КАК Цена,
		|	втТовары.СтавкаНДС КАК СтавкаНДС,
		|	втТовары.СуммаНДС КАК СуммаНДС,
		|	втТовары.СтатьяРасходов КАК СтатьяРасходов,
		|	втТовары.ВключатьРасходыВУСН КАК ВключатьРасходыВУСН,
		|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	втТовары.Поставщик КАК Поставщик,
		|	втТовары.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	втТовары.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА втТовары.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
		|				И втТовары.ВернутьМногооборотнуюТару
		|			ТОГДА ""ВозвратнаяТара""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА втТовары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаКомиссию)
		|					ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
		|				ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
		|			КОНЕЦ
		|	КОНЕЦ КАК ТипЗапасов,
		//++ Локализация
		|	втТовары.ПредъявленСФ КАК ПредъявленСФ,
		|	втТовары.ДатаСФ КАК ДатаСФ,
		|	втТовары.НомерСФ КАК НомерСФ,
		//-- Локализация
		|	втТовары.Валюта КАК Валюта
		|ИЗ
		|	втТоварыУслуги КАК втТовары
		|ГДЕ
		|	втТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	NULL КАК Номенклатура,
		|	АвансовыйОтчетПрочиеРасходы.Контрагент КАК Поставщик,
		|	АвансовыйОтчетПрочиеРасходы.Сумма КАК Сумма,
		|	АвансовыйОтчетПрочиеРасходы.СтавкаНДС КАК СтавкаНДС,
		|	АвансовыйОтчетПрочиеРасходы.СуммаНДС КАК СуммаНДС,
		|	АвансовыйОтчетПрочиеРасходы.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	АвансовыйОтчетПрочиеРасходы.Подразделение КАК Подразделение,
	#Удаление
		|	АвансовыйОтчетПрочиеРасходы.СтатьяРасходов КАК СтатьяРасходов,
	#КонецУдаления 
	#Вставка
	|	АвансовыйОтчетПрочиеРасходы.СтатьяРасходовБУ КАК СтатьяРасходов,
	#КонецВставки
		|	&ТекстЗапросаПризнаватьРасходамиПриУСН_ПрочиеРасходы,
		|	АвансовыйОтчетПрочиеРасходы.ИдентификаторСтроки КАК ИдентификаторСтроки,
		//++ Локализация
		
		|	АвансовыйОтчетПрочиеРасходы.ПредъявленСФ КАК ПредъявленСФ,
		|	АвансовыйОтчетПрочиеРасходы.ДатаСФ КАК ДатаСФ,
		|	АвансовыйОтчетПрочиеРасходы.НомерСФ КАК НомерСФ,
		
		//-- Локализация
		|	АвансовыйОтчетПрочиеРасходы.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	АвансовыйОтчетПрочиеРасходы.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	АвансовыйОтчетПрочиеРасходы.НаименованиеВходящегоДокумента КАК НаименованиеВходящегоДокумента,
		|	АвансовыйОтчетПрочиеРасходы.Содержание КАК Содержание,
		|	АвансовыйОтчетПрочиеРасходы.Валюта КАК Валюта
		|ИЗ
		|	Документ.АвансовыйОтчет.ПрочиеРасходы КАК АвансовыйОтчетПрочиеРасходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|		ПО (СтатьиРасходов.Ссылка = АвансовыйОтчетПрочиеРасходы.СтатьяРасходов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
		|		ПО (СтатьиАктивовПассивов.Ссылка = АвансовыйОтчетПрочиеРасходы.СтатьяРасходов)
		|ГДЕ
		|	АвансовыйОтчетПрочиеРасходы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втУслуги.Номенклатура,
		|	втУслуги.Поставщик,
		|	втУслуги.Сумма,
		|	втУслуги.СтавкаНДС,
		|	втУслуги.СуммаНДС,
		|	NULL,
		|	втУслуги.Подразделение,
		|	втУслуги.СтатьяРасходов,
		|	втУслуги.ВключатьРасходыВУСН,
		|	втУслуги.ИдентификаторСтроки,
		//++ Локализация
		
		|	втУслуги.ПредъявленСФ,
		|	втУслуги.ДатаСФ,
		|	втУслуги.НомерСФ,
		
		//-- Локализация
		|	втУслуги.НомерВходящегоДокумента,
		|	втУслуги.ДатаВходящегоДокумента,
		|	NULL,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(втУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(5))) = ""     ""
		|			ТОГДА втУслуги.Номенклатура.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(втУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(250))
		|	КОНЕЦ,
		|	втУслуги.Валюта
		|ИЗ
		|	втТоварыУслуги КАК втУслуги
		|ГДЕ
		|	(втУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|			ИЛИ втУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АвансовыйОтчетОплатаПоставщикам.Контрагент КАК Контрагент,
		|	АвансовыйОтчетОплатаПоставщикам.Сумма КАК Сумма,
		|	АвансовыйОтчетОплатаПоставщикам.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	АвансовыйОтчетОплатаПоставщикам.Комментарий КАК Содержание,
		|	АвансовыйОтчетОплатаПоставщикам.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	АвансовыйОтчетОплатаПоставщикам.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	АвансовыйОтчетОплатаПоставщикам.ОбъектРасчетов.Объект КАК Заказ,
		|	АвансовыйОтчетОплатаПоставщикам.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ЕСТЬNULL(ОтносительныйКурсВалюты.КурсЧислитель, 1) КАК КурсВзаиморасчетов,
		|	ЕСТЬNULL(ОтносительныйКурсВалюты.КурсЗнаменатель, 1) КАК КратностьВзаиморасчетов,
		|	АвансовыйОтчетОплатаПоставщикам.Валюта КАК Валюта
		|ИЗ
		|	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК АвансовыйОтчетОплатаПоставщикам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК ОтносительныйКурсВалюты
		|		ПО АвансовыйОтчетОплатаПоставщикам.ВалютаВзаиморасчетов = ОтносительныйКурсВалюты.Валюта
		|ГДЕ
		|	АвансовыйОтчетОплатаПоставщикам.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//++ Локализация
		|	втШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
		|	&ТипАкцизнойМарки,
		|	&ТекстЗапросаХарактеристикаАкцизныеМарки,
		|	&ТекстЗапросаСерияАкцизныеМарки,
		|	&ТекстЗапросаУпаковкаАкцизныеМарки,
		|	втШтрихкодыУпаковок.ЗначениеШтрихкода КАК НомерАкцизнойМарки,
		//-- Локализация
		|	втШтрихкодыУпаковок.НомерСтрокиДокумента КАК НомерСтрокиДокумента
		|ИЗ
		|	втШтрихкодыУпаковок КАК втШтрихкодыУпаковок
		//++ Локализация
		|ГДЕ
		|	втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		//-- Локализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШтрихкодыУпаковок.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	втШтрихкодыУпаковок.ШтрихкодУпаковки КАК МаркировкаУпаковки
		|ИЗ
		|	втШтрихкодыУпаковок КАК втШтрихкодыУпаковок
		//++ Локализация
		|ГДЕ
		|	НЕ втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		|	И НЕ втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
		//-- Локализация
		|";
	
	ЗаполнитьСобственныеТоварыВТексте(ТекстЗапроса);
	
	//++ Локализация
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристикаАкцизныеМарки",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "втШтрихкодыУпаковок"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаСерияАкцизныеМарки",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "втШтрихкодыУпаковок"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаУпаковкаАкцизныеМарки",
		ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "втШтрихкодыУпаковок", Ложь));
	//-- Локализация
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "втТовары"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаУпаковка",
		ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "втТовары"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаСерия",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "втТовары"));
	
	//++ Локализация
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТипАкцизнойМарки",
		ПолучитьТекстЗапросаТипАкцизнойМарки(КомпонентыОбмена, "втШтрихкодыУпаковок"));
	//-- Локализация
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРНПТ",
		ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "втТовары"));
			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаГТД",
		ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "втТовары"));
		
	ПрименяетсяУСНДоходыМинусРасходы = Ложь;
		
	//++ Локализация
	ПрименяетсяУСНДоходыМинусРасходы = ПолучитьСистемуНалогообложения(ДанныеИБ.Организация, ДанныеИБ.Дата, Ложь) = "УпрощеннаяДоходМинусРасход";
	//-- Локализация
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПризнаватьРасходамиПриУСН_ПрочиеРасходы",
		ТекстЗапросаПризнаватьРасходамиПриУСН(КомпонентыОбмена, "АвансовыйОтчетПрочиеРасходы", ПрименяетсяУСНДоходыМинусРасходы));  
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПризнаватьРасходамиПриУСН_ТоварыУслуги",
		ТекстЗапросаПризнаватьРасходамиПриУСН(КомпонентыОбмена, "Товары", ПрименяетсяУСНДоходыМинусРасходы));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",                     ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("Дата",                       ДанныеИБ.Дата);
	Запрос.УстановитьПараметр("БазоваяВалюта",              ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация));
	Запрос.УстановитьПараметр("ВыгружатьШтрихкодыУпаковок", ВыгружатьШтрихкодыУпаковок(КомпонентыОбмена));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапкиПриобретения	= РезультатыЗапроса[РезультатыЗапроса.Количество() - 6].Выбрать();
	Товары					= РезультатыЗапроса[РезультатыЗапроса.Количество() - 5].Выгрузить();
	ПрочиеРасходы			= РезультатыЗапроса[РезультатыЗапроса.Количество() - 4].Выгрузить();
	ОплатаКонтрагентам		= РезультатыЗапроса[РезультатыЗапроса.Количество() - 3].Выгрузить();
	АкцизныеМарки			= РезультатыЗапроса[РезультатыЗапроса.Количество() - 2].Выгрузить();
	МаркировкиУпаковок		= РезультатыЗапроса[РезультатыЗапроса.Количество() - 1].Выгрузить();
	
	Если Товары.Итог("Сумма") + ПрочиеРасходы.Итог("Сумма") + ОплатаКонтрагентам.Итог("Сумма") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Склад = Неопределено;
	Если ДанныеШапкиПриобретения.Следующий() Тогда
		Склад = ДанныеШапкиПриобретения.Склад;
	КонецЕсли;
	
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, Товары);
	//++ Локализация
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, АкцизныеМарки);
	//-- Локализация
	ЗаполнитьВидДеятельностиНДСВТЧ(КомпонентыОбмена, ДанныеИБ, Товары, "ЗакупкаПодДеятельность", "ЗакупкаПодДеятельность");
	
	#Область ПрочиеРасходы
	ПрочиеРасходы.Колонки.Добавить("ПодразделениеЗатрат");
	ПрочиеРасходы.Колонки.Добавить("СчетЗатрат");
	ПрочиеРасходы.Колонки.Добавить("СтатьяЗатрат");
	Для Каждого СтрокаПрочее Из ПрочиеРасходы Цикл
		Если ЗначениеЗаполнено(СтрокаПрочее.Подразделение) Тогда
			СтруктураПодразделение = Новый Структура();
			ВыгрузитьПодразделение(ДанныеИБ, СтруктураПодразделение, СтрокаПрочее.Подразделение);
			СтрокаПрочее.ПодразделениеЗатрат = СтруктураПодразделение.Подразделение;
		КонецЕсли;
		
		
		//++ Локализация
		Если ТипЗнч(СтрокаПрочее.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда
			СтрокаПрочее.СтатьяЗатрат = СтрокаПрочее.СтатьяРасходов;
		КонецЕсли;
		//-- Локализация
	КонецЦикла;
	
	ЗаполнитьВидДеятельностиНДСВТЧ(КомпонентыОбмена, ДанныеИБ, ПрочиеРасходы, "ЗакупкаПодДеятельность", "ЗакупкаПодДеятельность");
	
	#КонецОбласти
	
	#Область ОплатаКонтрагентам
	
	// Заполнение договора
	ОплатаКонтрагентам.Колонки.Добавить("Договор");
	ОплатаКонтрагентам.Колонки.Добавить("ДокументРасчетов");
	Для Каждого СтрокаТаблицы Из ОплатаКонтрагентам Цикл
		ТекДоговор = Неопределено;
		РасчетыВУсловныхЕдиницах = Ложь;
		Соглашение = Неопределено;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
			
			Если ТипЗнч(СтрокаТаблицы.Заказ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				СтрокаТаблицы.ДокументРасчетов = СтрокаТаблицы.Заказ;
			КонецЕсли;
			
			Если ТипЗнч(СтрокаТаблицы.Заказ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				ТекДоговор = СтрокаТаблицы.Заказ;
			КонецЕсли;
				
			Если ТекДоговор = Неопределено Тогда
				Если СтрокаТаблицы.Заказ.Метаданные().Реквизиты.Найти("Договор") <> Неопределено Тогда
					ТекДоговор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Заказ, "Договор");
				Иначе
					// Не удалось определить договор из заказа. Договор будет вычислен позже.
					ТекДоговор = Неопределено;
				КонецЕсли;
				Если СтрокаТаблицы.Заказ.Метаданные().Реквизиты.Найти("Соглашение") <> Неопределено Тогда
					Соглашение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Заказ, "Соглашение");
				Иначе
					// Не удалось определить соглашение из заказа. Соглашение будет вычислено позже.
					Соглашение = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ТекДоговор <> Неопределено И ЗначениеЗаполнено(ТекДоговор) Тогда
			СтрокаТаблицы.Договор = ТекДоговор;
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Соглашение) Тогда
			ДанныеРасчетаУЕ          = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "ВалютаВзаиморасчетов, ОплатаВВалюте, Организация");
			РасчетыВУсловныхЕдиницах = ВедетсяРасчетВУЕ(ДанныеРасчетаУЕ.ВалютаВзаиморасчетов, ДанныеРасчетаУЕ.ОплатаВВалюте, ДанныеРасчетаУЕ.Организация, КомпонентыОбмена);
		Иначе
			РасчетыВУсловныхЕдиницах = ДанныеИБ.Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация) И ДанныеИБ.Валюта <> СтрокаТаблицы.ВалютаВзаиморасчетов;
		КонецЕсли;
		
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.ВидДоговора = "СПоставщиком";
		ПараметрыПоУмолчанию.Организация = ДанныеИБ.Организация;
		ПараметрыПоУмолчанию.Контрагент = СтрокаТаблицы.Контрагент;
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов = СтрокаТаблицы.ВалютаВзаиморасчетов;
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = РасчетыВУсловныхЕдиницах;
		
		Заказ = Новый Структура("Заказ, Соглашение, Сделка", СтрокаТаблицы.Заказ, Соглашение, Неопределено);
		Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, Заказ, ДанныеИБ);
		СтрокаТаблицы.Договор = Договор;
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ВыданныеАвансы
	
	ВыданныеАвансы = Новый ТаблицаЗначений;
	ВыданныеАвансы.Колонки.Добавить("Документ");
	ВыданныеАвансы.Колонки.Добавить("Сумма");
	ВыданныеАвансы.Колонки.Добавить("Валюта");
	Если ЗначениеЗаполнено(ДанныеИБ.ДокументОснование)
		И ОбщегоНазначения.СсылкаСуществует(ДанныеИБ.ДокументОснование)Тогда
	
		ИмяПКО = "";
		Если ТипЗнч(ДанныеИБ.ДокументОснование) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
			ИмяПКО = "Документ_РКОРасчетыССотрудниками_Отправка";
		ИначеЕсли ТипЗнч(ДанныеИБ.ДокументОснование) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
			ИмяПКО = "Документ_СБДСРасчетыССотрудниками_Отправка";
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяПКО) Тогда
			Инструкция = Новый Структура("Значение, ИмяПКО", ДанныеИБ.ДокументОснование, ИмяПКО);
			
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.ДокументОснование, "Валюта, СуммаДокумента");
			
			СтрокаАванс = ВыданныеАвансы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаАванс, РеквизитыОснования);
			СтрокаАванс.Документ = Инструкция;
			
		КонецЕсли;
	КонецЕсли;
	
	#КонецОбласти
	
	ДополнительныеРеквизиты = ДанныеИБ.ДополнительныеРеквизиты.Выгрузить();
	
	Если Не ДанныеИБ.Мультивалютный Тогда
		ДанныеИБСтруктура = Новый Структура("Ссылка, Номер, Дата, Организация, Подразделение, Валюта, 
		|КоличествоДокументов, КоличествоЛистов, Комментарий, НазначениеАванса, ПодотчетноеЛицо, ДокументОснование, ЗакупкаПодДеятельность");
		ЗаполнитьЗначенияСвойств(ДанныеИБСтруктура, ДанныеИБ);
		
		ДанныеИБСтруктура.Вставить("Ответственный",           ДанныеИБ.Автор);
		ДанныеИБСтруктура.Вставить("Товары",                  Товары);
		ДанныеИБСтруктура.Вставить("ПрочиеРасходы",           ПрочиеРасходы);
		ДанныеИБСтруктура.Вставить("ОплатаКонтрагентам",      ОплатаКонтрагентам);
		ДанныеИБСтруктура.Вставить("ВыданныеАвансы",          ВыданныеАвансы);
		//++ Локализация
		ДанныеИБСтруктура.Вставить("АкцизныеМарки",           АкцизныеМарки);
		ДанныеИБСтруктура.Вставить("МаркировкиУпаковок",      МаркировкиУпаковок);
		//-- Локализация
		ДанныеИБСтруктура.Вставить("ДополнительныеРеквизиты", ДополнительныеРеквизиты);
		Если ЗначениеЗаполнено(Склад) Тогда
			ДанныеИБСтруктура.Вставить("Склад", Склад);
		КонецЕсли;
		
		ОбменДаннымиXDTOСервер.ВыгрузкаОбъектаВыборки(КомпонентыОбмена, 
			ДанныеИБСтруктура, 
			ПравилоАвансовыйОтчет);
	Иначе
		МассивВалют = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВалют,
			Товары.ВыгрузитьКолонку("Валюта"), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВалют,
			ПрочиеРасходы.ВыгрузитьКолонку("Валюта"), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВалют,
			ОплатаКонтрагентам.ВыгрузитьКолонку("Валюта"), Истина);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта,
		|	ЕСТЬNULL(ПОДСТРОКА(Валюты.Наименование, 1, 2), """") КАК ПрефиксВалюты
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Ссылка В(&Валюты)");
		Запрос.УстановитьПараметр("Валюты", МассивВалют);
	
		ВалютыДокумента = Запрос.Выполнить().Выгрузить();
		
		ВалютаРеглУчета   = ВалютаРегламентированногоУчета(ДанныеИБ.Организация);
		ВыгружатьУдаление = (ВалютыДокумента.Найти(ВалютаРеглУчета, "Валюта") = Неопределено);
		
		Для Каждого ВалютаДокумента Из ВалютыДокумента Цикл
			
			ОтборПоВалюте = Новый Структура("Валюта", ВалютаДокумента.Валюта);
			
			ТоварыПоВалюте             = Товары.Скопировать(ОтборПоВалюте);
			ПрочиеРасходыПоВалюте      = ПрочиеРасходы.Скопировать(ОтборПоВалюте);
			ОплатаКонтрагентамПоВалюте = ОплатаКонтрагентам.Скопировать(ОтборПоВалюте);
			ВыданныеАвансыПоВалюте     = ВыданныеАвансы.Скопировать(ОтборПоВалюте);
			
			ДанныеИБСтруктура = Новый Структура("Номер, Дата, Организация, Подразделение,
			|КоличествоДокументов, КоличествоЛистов, Комментарий, НазначениеАванса, ПодотчетноеЛицо, ДокументОснование, ЗакупкаПодДеятельность");
			ЗаполнитьЗначенияСвойств(ДанныеИБСтруктура, ДанныеИБ);
			
			Если ВалютаДокумента.Валюта = ВалютаРеглУчета Тогда
				ДанныеИБСтруктура.Вставить("Ссылка", ДанныеИБ.Ссылка);
			Иначе
				НомерБезПрефиксов = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(ДанныеИБ.Номер, Истина, Истина);
				СтандартныеПрефиксы = СтрЗаменить(ДанныеИБ.Номер, НомерБезПрефиксов, "");
				ПрефиксНомера = СтандартныеПрефиксы + ВалютаДокумента.ПрефиксВалюты;
				НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеИБ.Номер, Истина, Истина);
				Если СтрДлина(ПрефиксНомера + НомерНаПечать) <= 11 Тогда
					ДанныеИБСтруктура.Номер = ПрефиксНомера
						+ СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерНаПечать, 11 - СтрДлина(ПрефиксНомера));
				КонецЕсли;
			КонецЕсли;
			
			ДанныеИБСтруктура.Вставить("Ответственный",           ДанныеИБ.Автор);
			ДанныеИБСтруктура.Вставить("Валюта",                  ВалютаДокумента.Валюта);
			ДанныеИБСтруктура.Вставить("Товары",                  ТоварыПоВалюте);
			ДанныеИБСтруктура.Вставить("ПрочиеРасходы",           ПрочиеРасходыПоВалюте);
			ДанныеИБСтруктура.Вставить("ОплатаКонтрагентам",      ОплатаКонтрагентамПоВалюте);
			ДанныеИБСтруктура.Вставить("ВыданныеАвансы",          ВыданныеАвансыПоВалюте);
			ДанныеИБСтруктура.Вставить("ДополнительныеРеквизиты", ДополнительныеРеквизиты);
			Если ЗначениеЗаполнено(Склад) Тогда
				ДанныеИБСтруктура.Вставить("Склад", Склад);
			КонецЕсли;
			
			Если ВыгружатьУдаление Тогда
				ДанныеИБСтруктура.Вставить("ВыгружатьУдалениеПоСсылке", Истина);
				ДанныеИБСтруктура.Вставить("Ссылка", ДанныеИБ.Ссылка);
				ВыгружатьУдаление = Ложь;
			КонецЕсли;
			
			ОбменДаннымиXDTOСервер.ВыгрузкаОбъектаВыборки(КомпонентыОбмена, 
				ДанныеИБСтруктура, 
				ПравилоАвансовыйОтчет);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&ИзменениеИКонтроль ("ПКО_Документ_ПоступлениеУслугПрочихАктивов_Отправка_ПриОтправкеДанных")
Процедура ДОК_ПКО_Документ_ПоступлениеУслугПрочихАктивов_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Префикс = "S";
	//++ Локализация
	Префикс = "У";
	//-- Локализация
	Номер = Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 7);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Номер);	
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	ВерсияФормата17ИВыше = ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17");
	
	Если ВерсияФормата17ИВыше Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ПоступлениеУслугПрочихАктивов_Отправка", 
										"Услуги", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	ДанныеXDTO.Вставить("ВидОперации", "ПокупкаУПоставщика");
	
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	ВыгрузитьПодразделение(ДанныеИБ, ДанныеXDTO);
	
	ВалютаРеглУчета = ВалютаРегламентированногоУчета(ДанныеИБ.Организация);
	
	Если ДанныеИБ.Валюта = ВалютаРеглУчета
		Или ДанныеИБ.ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
		ДанныеXDTO.Вставить("КурсВзаиморасчетов",      ДанныеИБ.КурсЧислитель);
		ДанныеXDTO.Вставить("КратностьВзаиморасчетов", ДанныеИБ.КурсЗнаменатель);
	Иначе
		ВыгрузитьКурсИКратностьВзаиморасчетов(ДанныеXDTO, ДанныеИБ.Валюта, ДанныеИБ.Дата, ДанныеИБ.Организация);
	КонецЕсли;
	
	// Дополнительные свойства для договора
	Если ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
		ДанныеXDTO.Вставить("Договор", ДанныеИБ.Договор);
	Иначе
		
		Если ЗначениеЗаполнено(ДанныеИБ.Соглашение) Тогда
			ДанныеРасчетаУЕ          = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.Соглашение, "ВалютаВзаиморасчетов, ОплатаВВалюте, Организация");
			РасчетыВУсловныхЕдиницах = ВедетсяРасчетВУЕ(ДанныеРасчетаУЕ.ВалютаВзаиморасчетов, ДанныеРасчетаУЕ.ОплатаВВалюте, ДанныеРасчетаУЕ.Организация, КомпонентыОбмена);
		Иначе
			РасчетыВУсловныхЕдиницах = ДанныеИБ.Валюта = ВалютаРеглУчета И ДанныеИБ.Валюта <> ДанныеИБ.ВалютаВзаиморасчетов;
		КонецЕсли;
	
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.Контрагент               = ДанныеИБ.Контрагент;
		ПараметрыПоУмолчанию.Организация              = ДанныеИБ.Организация;
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = ДанныеИБ.ВалютаВзаиморасчетов;
		ПараметрыПоУмолчанию.ВидДоговора              = "СПоставщиком";
		ПараметрыПоУмолчанию.Дата                     = ДанныеИБ.Дата;
		ПараметрыПоУмолчанию.Номер                    = ДанныеИБ.Номер;
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = РасчетыВУсловныхЕдиницах;
		
		Заказ = Новый Структура("Заказ, Соглашение, Сделка", Неопределено, ДанныеИБ.Соглашение, Неопределено);
		Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, Заказ, ДанныеИБ);
		
		ДанныеXDTO.Вставить("Договор", Договор);
		
	КонецЕсли;
	
	//Услуги
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Расходы.Содержание,
	|	ВЫБОР КОГДА Расходы.Количество = 0 ТОГДА 1 ИНАЧЕ Расходы.Количество КОНЕЦ КАК Количество,
	|	Расходы.Цена,
	|	Расходы.Сумма,
	|	Расходы.СтавкаНДС,
	|	Расходы.СуммаНДС,
	#Удаление
	|	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	#КонецУдаления
	#Вставка
	|	Расходы.СтатьяРасходовБУ КАК СтатьяРасходов,
	#КонецВставки
	|	Расходы.Подразделение КАК Подразделение,
	#Удаление   
	|	ВЫБОР
	|		КОГДА Расходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА 0
	|		ИНАЧЕ Расходы.СуммаСНДС
	|	КОНЕЦ КАК СуммаСНДС,
	|	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА Расходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоДопРасходы
	#КонецУдаления             
	#Вставка      
	|	ВЫБОР
	|		КОГДА Расходы.СтатьяРасходовБУ.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА 0
	|		ИНАЧЕ Расходы.СуммаСНДС
	|	КОНЕЦ КАК СуммаСНДС,
	|	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА Расходы.СтатьяРасходовБУ.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоДопРасходы
	#КонецВставки
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК Расходы
	|ГДЕ
	|	Расходы.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Услуги = Запрос.Выполнить().Выгрузить();
	Услуги.Колонки.Добавить("СчетЗатрат");
	Услуги.Колонки.Добавить("ПодразделениеЗатрат");
	Услуги.Колонки.Добавить("СтатьяЗатрат");
	
	// Заполнение счета затрат.
	Для Каждого СтрокаУслуги Из Услуги Цикл
		
		СтрокаУслугиСчетУчета = Неопределено;
		
		// Параметры №2,3 и 4 необходимы для вычисления счета затрат в УП/КА.
		СтрокаУслуги.СчетЗатрат = СчетУчетаПоСтатье(СтрокаУслуги.СтатьяРасходов, ДанныеИБ.Организация, СтрокаУслуги.Подразделение, СтрокаУслугиСчетУчета);
		
		Если ЗначениеЗаполнено(СтрокаУслуги.Подразделение) Тогда
			СтруктураПодразделение = Новый Структура();
			ВыгрузитьПодразделение(ДанныеИБ, СтруктураПодразделение, СтрокаУслуги.Подразделение);
			СтрокаУслуги.ПодразделениеЗатрат = СтруктураПодразделение.Подразделение;
		КонецЕсли;
		
		//++ Локализация
		Если ТипЗнч(СтрокаУслуги.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда
			СтрокаУслуги.СтатьяЗатрат = СтрокаУслуги.СтатьяРасходов;
		КонецЕсли;
		//-- Локализация
	КонецЦикла;
	
	НДСПоСтавкам2и4 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.Контрагент, "НДСпоСтавкам4и2");
	
	ДанныеXDTO.Вставить("Сумма", Услуги.Итог("Сумма"));
	
	РасшифровкаДопРасходов = ДоходыИРасходыСервер.РаспределениеРасходовНаСебестоимостьТоваров(ДанныеИБ.Ссылка);
	// Удаление строк с пустыми суммами из расшифровки.
	КоличествоСтрокДопРасходы = РасшифровкаДопРасходов.Количество();
	Для НомерСтроки = 1 По КоличествоСтрокДопРасходы Цикл
		Индекс = КоличествоСтрокДопРасходы - НомерСтроки;
		Если Окр(РасшифровкаДопРасходов[Индекс].Сумма,2) = 0 Тогда
			РасшифровкаДопРасходов.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	// Не переносим как допрасходы, если есть незаполненные документы поступления.
	НетБазыДляРаспределения = (РасшифровкаДопРасходов.Количество()=0);
	Для Каждого СтрокаРасшифровкаДопРасходов Из РасшифровкаДопРасходов Цикл
		Если Не ЗначениеЗаполнено(СтрокаРасшифровкаДопРасходов.ДокументПоступления) Тогда
			НетБазыДляРаспределения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НетБазыДляРаспределения Тогда
		Услуги.ЗаполнитьЗначения(Ложь, "ЭтоДопРасходы");
		РасшифровкаДопРасходов.Очистить();
	КонецЕсли;
	
	Если РасшифровкаДопРасходов.Количество() > 0 Тогда
		Для каждого Услуга Из Услуги Цикл 
			Отбор = Новый Структура("ДокументПоступления", Услуга.АналитикаРасходов);
			Услуга.ЭтоДопРасходы = РасшифровкаДопРасходов.НайтиСтроки(Отбор).Количество() > 0;
		КонецЦикла;
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(Услуги, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить("Услуги", Услуги);  
	ВсегоСтрок = РасшифровкаДопРасходов.Количество();
	Если ВсегоСтрок > 0 Тогда   
		Если ВерсияФормата17ИВыше Тогда 
			РасшифровкаДопРасходов.Колонки.ДокументПоступления.Имя = "ДокументПоступленияСсылка";  
			РасшифровкаДопРасходов.Колонки.Добавить("ДокументПоступления");
			Для каждого Стр Из РасшифровкаДопРасходов Цикл
				Если ТипЗНЧ(Стр.ДокументПоступленияСсылка) = ТИП("ДокументСсылка.СборкаТоваров") Тогда  
					ПКО = "Документ_СборкаТоваров";  
				ИначеЕсли ТипЗНЧ(Стр.ДокументПоступленияСсылка) = ТИП("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда	
					ПКО = "Документ_ПоступлениеТоваровУслуг_Отправка";
				КонецЕсли;
				Если ЗначениеЗаполнено(ПКО) Тогда
					Инструкция = Новый Структура("Значение, ИмяПКО", Стр.ДокументПоступленияСсылка, ПКО);
					Стр.ДокументПоступления = Инструкция;
				КонецЕсли;
			КонецЦикла; 
		Иначе
			Для Счетчик = 0 По ВсегоСтрок - 1 Цикл 
				ТекущаяСтрока = РасшифровкаДопРасходов[ВсегоСтрок - Счетчик - 1];
				Если ТИПЗНЧ(ТекущаяСтрока.ДокументПоступления) = ТИП("ДокументСсылка.СборкаТоваров") Тогда
					РасшифровкаДопРасходов.Удалить(ТекущаяСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ДанныеXDTO.Вставить("РасшифровкаДопРасходов", РасшифровкаДопРасходов);
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
КонецПроцедуры


#Область СлужебныеПроцедуры
Функция ВозвратитьДанныеКонтрагента(Документ)
	ДокументИсточник=Документ; 
	Партнер=Справочники.Партнеры.НайтиПоНаименованию("ФИЗИЧЕСКОЕ ЛИЦО");
	Контрагент=Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("0562ed9b-4ca4-11e1-8e7d-001e101f9843")); 
	Договор_стр="С покупателем, руб";   
	СведенияКонтрагента=Новый Структура;
	СведенияКонтрагента.Вставить("Контрагент",Контрагент);
	СведенияКонтрагента.Вставить("Партнер",Партнер);
	СведенияКонтрагента.Вставить("Договор",Договор_стр);
	СведенияКонтрагента.Вставить("Подмена",истина);
	
	если ДокументИсточник.Метаданные().имя="ОтчетОРозничныхПродажах"  тогда
		Возврат СведенияКонтрагента;	
	конецесли;          
	если ДокументИсточник.Метаданные().имя="ОперацияПоПлатежнойКарте"  тогда 
		если значениезаполнено(ДокументИсточник.Контрагент) и ДокументИсточник.Контрагент.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ФизЛицо тогда
			Возврат СведенияКонтрагента;	
		конецесли;	
	конецесли;
	если ДокументИсточник.Метаданные().имя="ПриходныйКассовыйОрдер" тогда
		если значениезаполнено(ДокументИсточник.СтатьяДвиженияДенежныхСредств) тогда
			если НАЙТИ(ДокументИсточник.СтатьяДвиженияДенежныхСредств, "ВЫРУЧКА ФИЗИЧЕСКИЕ ЛИЦА")>0 тогда
				Возврат СведенияКонтрагента;	
			конецесли;			
		иначеесли ДокументИсточник.РасшифровкаПлатежа.Количество()>0 тогда
			если НАЙТИ(ДокументИсточник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств, "ВЫРУЧКА ФИЗИЧЕСКИЕ ЛИЦА")>0 тогда
				Возврат СведенияКонтрагента;	
			конецесли;	
		конецесли;			
	конецесли;
	если ДокументИсточник.Метаданные().имя="РасходныйКассовыйОрдер" тогда
		если значениезаполнено(ДокументИсточник.СтатьяДвиженияДенежныхСредств) тогда
			если НАЙТИ(ДокументИсточник.СтатьяДвиженияДенежныхСредств, "ВОЗВРАТ ФИЗИЧЕСКОМУ ЛИЦУ")>0 тогда
				Возврат СведенияКонтрагента;	
			конецесли;	
		иначеесли ДокументИсточник.РасшифровкаПлатежа.Количество()>0 тогда
			если НАЙТИ(ДокументИсточник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств, "ВОЗВРАТ ФИЗИЧЕСКОМУ ЛИЦУ")>0 тогда
				Возврат СведенияКонтрагента;	
			конецесли;	
		конецесли;			
	конецесли;
	
	СведенияКонтрагента=Новый Структура;
	СведенияКонтрагента.Вставить("Контрагент",Документ.Контрагент);
	СведенияКонтрагента.Вставить("Партнер",НЕОПРЕДЕЛЕНО);
	СведенияКонтрагента.Вставить("Договор","");
	СведенияКонтрагента.Вставить("Подмена",ложь);
	СведенияКонтрагента.Вставить("Склад",Справочники.Склады.ПустаяСсылка());
	если ДокументИсточник.Метаданные().имя="РеализацияТоваровУслуг" и ДокументИсточник.ХозяйственнаяОперация<>Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию тогда
		ЗначениеСклада=ВозвратитьСклад(ДокументИсточник);
		СведенияКонтрагента.Склад=ЗначениеСклада;
		Если ЕСТЬСФ(ДокументИсточник) Тогда
			СведенияКонтрагента.Контрагент=ДокументИсточник.Контрагент;
			СведенияКонтрагента.Партнер=ДокументИсточник.Партнер;
		иначе
			СведенияКонтрагента.Контрагент=Контрагент;
			СведенияКонтрагента.Партнер=Партнер;
			СведенияКонтрагента.Подмена=истина;
			СведенияКонтрагента.Договор=Договор_стр;
		конецесли;	
	иначе
		если (Метаданные.Документы[ДокументИсточник.Метаданные().имя].Реквизиты.Найти("ДокументРеализации")<>НЕОПРЕДЕЛЕНО) тогда
			если ДокументИсточник.ДокументРеализации<>НЕОПРЕДЕЛЕНО Тогда
				ДокументИсточник=ДокументИсточник.ДокументРеализации;
				СведенияКонтрагента=ВозвратитьДанныеКонтрагента(ДокументИсточник);
			конецесли;
		Конецесли;	
		
		если (Метаданные.Документы[ДокументИсточник.Метаданные().имя].Реквизиты.Найти("ДокументОснование")<>НЕОПРЕДЕЛЕНО)
			и ДокументИсточник.Метаданные().имя<>"РеализацияУслугПрочихАктивов" тогда
			если ДокументИсточник.ДокументОснование<>НЕОПРЕДЕЛЕНО и ДокументИсточник.ДокументОснование.Метаданные().имя<>"КоммерческоеПредложениеКлиенту" Тогда
				ДокументИсточник=ДокументИсточник.ДокументОснование;
				СведенияКонтрагента=ВозвратитьДанныеКонтрагента(ДокументИсточник);
			конецесли;
		Конецесли;		
	конецесли;	
	Возврат СведенияКонтрагента;
КонецФункции
Функция КонтрагентПоРеквизиту(Контрагент)
	если значениезаполнено(Контрагент) тогда  
		если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо тогда
		Контрагент=Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("0562ed9b-4ca4-11e1-8e7d-001e101f9843")); 
	   конецесли;
	конецесли;	
	
возврат Контрагент;	

КонецФункции // ()

Функция ВозвратитьСклад(Документ)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслугТовары.Склад.СкладДляБухгалтерии КАК Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугТовары.Ссылка.Склад.ЭтоГруппа
	|	И РеализацияТоваровУслугТовары.Склад.СкладДляБухгалтерии <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Склад.СкладДляБухгалтерии
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	И НЕ РеализацияТоваровУслуг.Ссылка.Склад.ЭтоГруппа
	|	И РеализацияТоваровУслуг.Склад.СкладДляБухгалтерии <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслугТовары.Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугТовары.Ссылка.Склад.ЭтоГруппа
	|	И РеализацияТоваровУслугТовары.Склад.СкладДляБухгалтерии = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	И НЕ РеализацияТоваровУслуг.Ссылка.Склад.ЭтоГруппа
	|	И РеализацияТоваровУслуг.Склад.СкладДляБухгалтерии = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	если НЕ РезультатЗапроса.Пустой() тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		если Выборка.Следующий() тогда
			Возврат Выборка.Склад;
			
		иначе
			Возврат Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	иначе
		Возврат Справочники.Склады.ПустаяСсылка()
	КонецЕсли;
КонецФункции
Функция ЕстьСФ(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданный.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Проведен
	|	И СчетФактураВыданный.ДокументОснование = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданныйДокументыОснования.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
	|	И СчетФактураВыданныйДокументыОснования.ДокументОснование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	возврат не результатЗапроса.Пустой();
КонецФункции
Функция ПолучитьАгентскийДоговорПоУмолчанию(Организация, ДатаДействия, Контрагент)
	// Устинов агентский договор
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ первые 1
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДоговорыКонтрагентов.ДатаОкончанияДействия > &ДатаДействия
	|		КОНЕЦ
	|	И ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомитентом)";
	
	Запрос.УстановитьПараметр("ДатаДействия", ДатаДействия);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	если РезультатЗапроса.Пустой() тогда 
		СтруктураДанныеДоговора = Новый Структура("Контрагент, Организация, ВалютаВзаиморасчетов");
		СтруктураДанныеДоговора.Вставить("Контрагент", Контрагент);
		СтруктураДанныеДоговора.Вставить("Организация", Организация);
		СтруктураДанныеДоговора.Вставить("РасчетыВУсловныхЕдиницах", ложь);
		СтруктураДанныеДоговора.Вставить("ВидДоговора", "СКомитентом");
		СтруктураДанныеДоговора.Вставить("ВалютаВзаиморасчетов", Константы.ВалютаРегламентированногоУчета.Получить());
		возврат Новый Структура("Значение, ИмяПКО",СтруктураДанныеДоговора,"Справочник_ДоговорыКонтрагентов_ИзСтруктуры") ;
	иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		возврат ВыборкаДетальныеЗаписи.ссылка;
	конецесли;
КонецФункции

Процедура ИзменитьПКС_ИспользуетсяАлгоритм(ПравилаКонвертации,ИмяПКО,СвойствоКонфигурации)
	ПКО=ПравилаКонвертации.найти(ИмяПКО,"ИмяПКО");
	если ПКО=Неопределено тогда
		возврат;
	конецесли;
	ПКС=ПКО.Свойства.Найти(СвойствоКонфигурации,"СвойствоКонфигурации");
	если ПКС = неопределено тогда
		возврат;
	иначе
		ПКС.ИспользуетсяАлгоритмКонвертации=истина;
	конецесли;	
	
КонецПроцедуры	
Процедура ДобавитьИзменитьПКС(ПравилаКонвертации,ИмяПКО,ТаблЧасть="",СтруктураСвойства)
	ПКО=ПравилаКонвертации.найти(ИмяПКО,"ИмяПКО");
	если ПКО=Неопределено тогда
		возврат;
	конецесли;
	если ТаблЧасть="" тогда
		ДобавитьИзменитьСвойство(ПКО,СтруктураСвойства);
	иначе
		ПКТЧ=ПКО.СвойстваТабличныхЧастей.Найти(ТаблЧасть);
		если ПКТЧ<>НЕОПРЕДЕЛЕНО тогда
			ДобавитьИзменитьСвойство(ПКТЧ,СтруктураСвойства);
		конецесли;	
	конецесли;
КонецПроцедуры	
Процедура ДобавитьИзменитьСвойство(ПКО,СтруктураСвойства)
	если СтруктураСвойства.СвойствоКонфигурации<>"" тогда
		ПКС=ПКО.Свойства.Найти(СтруктураСвойства.СвойствоКонфигурации,"СвойствоКонфигурации");
	иначе
		ПКС=ПКО.Свойства.Найти(СтруктураСвойства.СвойствоФормата,"СвойствоФормата");
	конецесли;
	если ПКС = Неопределено тогда
		НовоеСвойство=ПКО.Свойства.Добавить();
		для каждого стр из СтруктураСвойства цикл
			если ПКО.Свойства.Колонки.Найти(Стр.Ключ)<>неопределено тогда
				НовоеСвойство[стр.Ключ]=стр.Значение;
			конецесли;
		конеццикла;	
	иначе
		для каждого стр из СтруктураСвойства цикл
			если стр.ключ="СвойствоКонфигурации" тогда
				продолжить;
			конецесли;	
			если ПКО.Свойства.Колонки.Найти(Стр.Ключ)<>неопределено тогда
				ПКС[стр.Ключ]=стр.Значение;
			конецесли;
		конеццикла;	
	конецесли;	
	
КонецПроцедуры

#КонецОбласти

////Новые объекты к обмену:
&После("ЗаполнитьПравилаОбработкиДанных")
Процедура Док_ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных)
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПОД_Документ_ПорчаТоваров_Отправка(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры

#Область ДобавленныеОбъекты

#Область Документ_ПорчаТоваров_Отправка

Процедура ДобавитьПОД_Документ_ПорчаТоваров_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ПорчаТоваров_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ПорчаТоваров;
	ПравилоОбработки.ПриОбработке            = "ПОД_Документ_ПорчаТоваров_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных           = Истина;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПорчаВОприходование_Отправка");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПорчаВСписаниеЗапасов_Отправка");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПорчаТоваров_Отправка");
КонецПроцедуры                                 
Процедура ПОД_Документ_ПорчаТоваров_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ВерсияФорматаМеньше1_19 = (ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.19"));
	Если Не ВерсияФорматаМеньше1_19 Тогда	
		ИспользованиеПКО.Документ_ПорчаТоваров_Отправка = Истина; 
		ИспользованиеПКО.Документ_ПорчаВОприходование_Отправка = Ложь;
		ИспользованиеПКО.Документ_ПорчаВСписаниеЗапасов_Отправка = Ложь;
	Иначе 
		ИспользованиеПКО.Документ_ПорчаТоваров_Отправка = Ложь;
		ИспользованиеПКО.Документ_ПорчаВОприходование_Отправка = Истина;
		ИспользованиеПКО.Документ_ПорчаВСписаниеЗапасов_Отправка = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",    ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("Дата",      ДанныеИБ.Дата);
	Запрос.УстановитьПараметр("ВидЦен",    ДанныеИБ.ВидЦены);
	Запрос.УстановитьПараметр("РегВалюта", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("УпрВалюта", Константы.ВалютаУправленческогоУчета.Получить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.НоменклатураОприходование КАК Номенклатура,
	|	Товары.ХарактеристикаОприходование КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Номенклатура КАК НоменклатураСписание,
	|	Товары.Характеристика КАК ХарактеристикаСписание,
	|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Коэффициент,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Цена * Товары.Количество КАК Сумма,
	|	ВидыЗапасов.НомерГТД.Код КАК НомерГТД,
	|	ВидыЗапасов.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВременнаяТаблицаТовары
	|ИЗ
	|	Документ.ПорчаТоваров.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПорчаТоваров.ВидыЗапасов КАК ВидыЗапасов
	|		ПО Товары.Ссылка = ВидыЗапасов.Ссылка
	|			И Товары.АналитикаУчетаНоменклатурыОприходование = ВидыЗапасов.АналитикаУчетаНоменклатурыОприходование
	|			И Товары.АналитикаУчетаНоменклатуры = ВидыЗапасов.АналитикаУчетаНоменклатуры
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураСписание,
	|	ХарактеристикаСписание";
	
	Запрос.Выполнить();
	
	Если ДанныеИБ.ПриходоватьТоварыПоСебестоимостиСписания Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТовары.Характеристика КАК Характеристика,
		// изменение
		|	ВременнаяТаблицаТовары.НоменклатураСписание КАК НоменклатураСписание,
		|	Выразить(ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
		|		КОГДА &РегВалюта <> ЦеныНоменклатурыСрезПоследних.Валюта
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) > 0
		|							И ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) > 0
		|							И ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
		|							И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
		|						ТОГДА КурсыВалютыЦены.Курс * КурсыВалюты.Кратность / (КурсыВалюты.Курс * КурсыВалютыЦены.Кратность)
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Число(15, 2)) КАК Цена,
		|	ВременнаяТаблицаТовары.НомерГТД КАК НомерГТД,
		|	ВременнаяТаблицаТовары.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ВременнаяТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВременнаяТаблицаТовары.Коэффициент КАК Коэффициент,
		|	ВременнаяТаблицаТовары.Количество КАК Количество,
		|	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаТовары.Серия КАК Серия
		|ПОМЕСТИТЬ ПервичныеДанные
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&Дата,
		|				ВидЦены = &ВидЦен
		|					И (Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							ВременнаяТаблицаТовары.НоменклатураСписание,
		|							ВременнаяТаблицаТовары.ХарактеристикаСписание
		|						ИЗ
		|							ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВременнаяТаблицаТовары.НоменклатураСписание = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ВременнаяТаблицаТовары.ХарактеристикаСписание = ЦеныНоменклатурыСрезПоследних.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютыЦены
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &РегВалюта) КАК КурсыВалюты
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПервичныеДанные.Номенклатура КАК Номенклатура,
		// изменение
		|	ПервичныеДанные.НоменклатураСписание ,
		|	&ТекстЗапросаХарактеристика,
		|	&ТекстЗапросаСерия,
		|	ВЫБОР
		|		КОГДА ПервичныеДанные.Цена < 0.01
		|			ТОГДА 0.01
		|		ИНАЧЕ ВЫРАЗИТЬ(ПервичныеДанные.Цена КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК Цена,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ПервичныеДанные.Цена < 0.01
		|				ТОГДА 0.01
		|			ИНАЧЕ ВЫРАЗИТЬ(ПервичныеДанные.Цена КАК ЧИСЛО(15, 2))
		|		КОНЕЦ * ПервичныеДанные.Количество КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ПервичныеДанные.НомерГТД КАК НомерГТД,
		|	ПервичныеДанные.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ПервичныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПервичныеДанные.Коэффициент КАК Коэффициент,
		|	ПервичныеДанные.Количество КАК Количество,
		|	ПервичныеДанные.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ПервичныеДанные КАК ПервичныеДанные";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЦеныНоменклатурыСрезПоследних.Упаковка",
		"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВременнаяТаблицаТовары.ЕдиницаИзмерения",
		"ВременнаяТаблицаТовары.Номенклатура"));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ПервичныеДанные"));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаСерия",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ПервичныеДанные"));
		
		Запрос.УстановитьПараметр("Дата",   ДанныеИБ.Дата);
		Запрос.УстановитьПараметр("ВидЦен", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.Склад, "УчетныйВидЦены"));
		Запрос.УстановитьПараметр("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		// изменение
		|	ВременнаяТаблицаТовары.НоменклатураСписание,
		|	&ТекстЗапросаХарактеристика,
		|	&ТекстЗапросаСерия,
		|	ВременнаяТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВременнаяТаблицаТовары.Коэффициент КАК Коэффициент,
		|	ВременнаяТаблицаТовары.Количество КАК Количество,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТовары.Цена * ВЫБОР
		|			КОГДА &РегВалюта <> &УпрВалюта
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) > 0
		|								И ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
		|							ТОГДА КурсыВалютыЦены.Курс * КурсыВалюты.Кратность / (КурсыВалюты.Курс * КурсыВалютыЦены.Кратность)
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТовары.Сумма * ВЫБОР
		|			КОГДА &РегВалюта <> &УпрВалюта
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) > 0
		|								И ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
		|							ТОГДА КурсыВалютыЦены.Курс * КурсыВалюты.Кратность / (КурсыВалюты.Курс * КурсыВалютыЦены.Кратность)
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВременнаяТаблицаТовары.НомерГТД КАК НомерГТД,
		|	ВременнаяТаблицаТовары.СтранаПроисхождения КАК СтранаПроисхождения
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &УпрВалюта) КАК КурсыВалютыЦены
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &РегВалюта) КАК КурсыВалюты
		|		ПО (ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВременнаяТаблицаТовары.НомерСтроки";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ВременнаяТаблицаТовары"));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаСерия",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ВременнаяТаблицаТовары"));
		
	КонецЕсли;
	
	ТаблицаТовары = Запрос.Выполнить().Выгрузить();
	
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, ТаблицаТовары, Истина, Ложь);
	
	ЕстьПустая = Ложь;
	Для Каждого Строка Из ТаблицаТовары Цикл
		Если Не ЗначениеЗаполнено(Строка.Цена) Или Не ЗначениеЗаполнено(Строка.Сумма) Тогда
			ЕстьПустая = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьПустая Тогда
		
		ИспользованиеПКО.Документ_ПорчаВОприходование_Отправка = Ложь;
		ИспользованиеПКО.Документ_ПорчаВСписаниеЗапасов_Отправка      = Ложь;
		
		ШаблонПредупреждения = НСтр("ru = 'Документ %1 не может быть выгружен,
		|т.к. не для всех приходуемых номенклатурных позиций задана учетная цена.
		|Тип учетной цены задается в параметрах склада как ""Учетный вид цены"".'");
		
		ТекстПредупреждения = СтрШаблон(ШаблонПредупреждения, ДанныеИБ.Ссылка);
		ПредупреждениеПриСинхронизации(КомпонентыОбмена, ДанныеИБ.Ссылка, ТекстПредупреждения);
		
	ИначеЕсли ДанныеИБ.ПометкаУдаления ИЛИ
		
		(КомпонентыОбмена.УзелКорреспондента =      
		ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоНаименованию("Бухгалтерия предприятия (магазин у дома)") 
		И ДанныеИБ.Организация <> АльтерраОбщегоНазначения.ПолучитьИПВинников()) Тогда 
		
		ИспользованиеПКО.Документ_ПорчаВОприходование_Отправка = Ложь;
		ИспользованиеПКО.Документ_ПорчаВСписаниеЗапасов_Отправка      = Ложь;
	КонецЕсли;
	
	ДанныеИБ.ДополнительныеСвойства.Вставить("Товары", ТаблицаТовары);
КонецПроцедуры

Процедура ДобавитьПКО_Документ_ПорчаТоваров_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ПорчаТоваров_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ПорчаТоваров;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ПересортицаТоваров"; //@NON-NLS-1
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПорчаТоваров_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",          "Дата");
	ДобавитьПКС(СвойстваШапки, "Комментарий",   "Комментарий");
	ДобавитьПКС(СвойстваШапки, "",              "Налогообложение", 1);
	ДобавитьПКС(СвойстваШапки, "",              "Номер", 1);
	ДобавитьПКС(СвойстваШапки, "Организация",   "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "",              "Основание", 1);
	ДобавитьПКС(СвойстваШапки, "Ответственный", "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "",              "Подразделение", 1);
	ДобавитьПКС(СвойстваШапки, "",              "Склад", 1, "Справочник_Склады_Отправка");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1, "Справочник_ДополнительныеРеквизиты");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "СведенияРНПТ");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмеренияРНПТ", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НаименованиеТовара", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "РНПТ", 1, "Справочник_НомераГТД_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "СуммаРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Упаковка", 1, "Справочник_Упаковки");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмеренияПрослеживаемости", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоУпаковок", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НоменклатураОприходование", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерГТД", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПрослеживаемыйТовар", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Серия", 1, "Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "СерияОприходование", 1, "Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "СтранаПроисхождения", 1, "Справочник_СтраныМира");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ТипЗапасов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Характеристика", 1, "Справочник_ХарактеристикиНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "ХарактеристикаОприходование", 1, "Справочник_ХарактеристикиНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);

КонецПроцедуры
Процедура ПКО_Документ_ПорчаТоваров_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ПорчаТоваров_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	
	Префикс = "S";
	//++ Локализация
	Префикс = "Ч";
	//-- Локализация
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 7));
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
		
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	ДанныеXDTO.Вставить("Основание", Строка(ДанныеИБ));
	
	#Область Товары
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыЗапасов.Количество КАК Количество,
		|	ВидыЗапасов.НомерГТД КАК НомерГТД,
		|	ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
		|	1 КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
		|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
		|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
		|	КОНЕЦ КАК ТипЗапасов,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		|	ВидыЗапасов.АналитикаУчетаНоменклатурыОприходование.Номенклатура КАК НоменклатураОприходование,
		|	ВидыЗапасов.АналитикаУчетаНоменклатурыОприходование.Характеристика КАК ХарактеристикаОприходование,
		|	ВидыЗапасов.АналитикаУчетаНоменклатурыОприходование.Серия КАК СерияОприходование,
		|	ВидыЗапасов.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВидыЗапасов
		|ИЗ
		|	Документ.ПорчаТоваров.ВидыЗапасов КАК ВидыЗапасов
		|ГДЕ
		|	ВидыЗапасов.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Товары.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ПорядокСтрокТаблицыТовары
		|ИЗ
		|	Документ.ПорчаТоваров.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЗапасов.Номенклатура КАК Номенклатура,
		|	ВидыЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыЗапасов.Коэффициент КАК Коэффициент,
		|	ВидыЗапасов.ТипЗапасов КАК ТипЗапасов,
		|	ЕСТЬNULL(ПорядокСтрокТаблицыТовары.НомерСтроки, 0) КАК НомерСтрокиДокумента,
		|	ВидыЗапасов.Количество КАК Количество,
		|	&ТекстЗапросаХарактеристика,
		|	&ТекстЗапросаСерия,
		|	&ТекстЗапросаРНПТ,
		|	&ТекстЗапросаГТД,
		|	ВидыЗапасов.НоменклатураОприходование КАК НоменклатураОприходование,
		|	ВидыЗапасов.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
		|	ВидыЗапасов.СерияОприходование КАК СерияОприходование,
		|	ВидыЗапасов.Сумма КАК Сумма,
		|	ВЫРАЗИТЬ(ВидыЗапасов.Сумма / ВидыЗапасов.Количество КАК ЧИСЛО(15, 2)) КАК Цена
	     	|ИЗ
		|	ВидыЗапасов КАК ВидыЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокСтрокТаблицыТовары КАК ПорядокСтрокТаблицыТовары
		|		ПО ВидыЗапасов.Номенклатура = ПорядокСтрокТаблицыТовары.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЕСТЬNULL(ПорядокСтрокТаблицыТовары.НомерСтроки, 0)";
	
	ЗаполнитьСобственныеТоварыВТексте(ТекстЗапроса);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ВидыЗапасов"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаСерия",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ВидыЗапасов"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРНПТ",
		ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "ВидыЗапасов"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаГТД",
		ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ВидыЗапасов"));
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	Товары = Запрос.Выполнить().Выгрузить();
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, Товары, Истина, Ложь);
	
	ДанныеXDTO.Вставить("Товары", Товары);
	
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.ПорчаТоваров.ВидыЗапасов"; 
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов);
	КонецЕсли; 
	//-- Локализация
	
	#КонецОбласти
КонецПроцедуры

Процедура ДобавитьПКО_Документ_ПорчаВОприходование_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ПорчаВОприходование_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ПорчаТоваров;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ОприходованиеТоваров";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПорчаВОприходование_Отправка_ПриОтправкеДанных";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ВидЦены",        "ТипЦен", , "Справочник_ТипыЦен");
	ДобавитьПКС(СвойстваШапки, "Дата",           "Дата");
	ДобавитьПКС(СвойстваШапки, "Комментарий",    "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Организация",    "Организация", , "Справочник_Организации_Отправка");
	
	ДобавитьПКС(СвойстваШапки, "Ответственный",  "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "СтатьяРасходов", "СтатьяДоходов", , "Справочник_СтатьиДоходов");
	ДобавитьПКС(СвойстваШапки, "",               "Налогообложение", 1);
	ДобавитьПКС(СвойстваШапки, "",               "Номер", 1);
	ДобавитьПКС(СвойстваШапки, "",               "Основание", 1);
	ДобавитьПКС(СвойстваШапки, "",               "Подразделение", 1);
	ДобавитьПКС(СвойстваШапки, "",               "Склад", 1, "Справочник_Склады_Отправка");
	ДобавитьПКС(СвойстваШапки, "",               "Сумма", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1,"Справочник_ДополнительныеРеквизиты");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1,"Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1,"Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НоменклатураСписание", 1,"Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерГТД", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ОприходованиеПодДеятельность", 1,"ВидДеятельностиРаздельногоУчетаНДС");
	ДобавитьПКС(СвойстваТЧ, "", "Серия", 1,"Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "СтранаПроисхождения", 1,"Справочник_СтраныМира");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ТипЗапасов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Характеристика", 1,"Справочник_ХарактеристикиНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);
	
	//как в доработке по пересортице
	ДобавитьИзменитьПКС(ПравилаКонвертации,"Документ_ПорчаВОприходование_Отправка","Товары",Новый Структура("СвойствоКонфигурации,СвойствоФормата,ИспользуетсяАлгоритмКонвертации,ПравилоКонвертацииСвойства","","НоменклатураСписание",Истина,"Справочник_Номенклатура_Отправка"));
КонецПроцедуры
Процедура ПКО_Документ_ПорчаВОприходование_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеИБ.Номер, 5) + "Ч" + Сред(ДанныеИБ.Номер, 7));
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
	ДанныеXDTO.Вставить("Основание", Строка(ДанныеИБ));
	
	ТаблицаТовары = ДанныеИБ.ДополнительныеСвойства.Товары;
	ТаблицаТовары.Колонки.Добавить("ТипЗапасов");
	ТаблицаТовары.ЗаполнитьЗначения("СобственныеТовары", "ТипЗапасов");
	
	ЗаполнитьВидДеятельностиНДСВТЧ(КомпонентыОбмена, ДанныеИБ, ТаблицаТовары, "ОприходованиеПодДеятельность", "ВидДеятельностиНДС");
	
	ДанныеXDTO.Вставить("Товары", ТаблицаТовары);
	ДанныеXDTO.Вставить("Сумма", ТаблицаТовары.Итог("Сумма"));
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);   
	
	МассивКолонки=ДанныеXDTO.Товары.ВыгрузитьКолонку("Номенклатура");  
	МассивСтр="";
	для каждого стр из МассивКолонки цикл          
		МассивСтр=МассивСтр+стр.УникальныйИдентификатор()+";";
	конеццикла;	
	ДанныеXDTO.Вставить("AdditionalInfo",МассивСтр);

КонецПроцедуры

Процедура ДобавитьПКО_Документ_ПорчаВСписаниеЗапасов_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ПорчаВСписаниеЗапасов_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ПорчаТоваров;
	ПравилоКонвертации.ОбъектФормата     = "Документ.СписаниеЗапасов"; //@NON-NLS-1
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПорчаВСписаниеЗапасов_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",          "Дата");
	ДобавитьПКС(СвойстваШапки, "Комментарий",   "Комментарий");
	ДобавитьПКС(СвойстваШапки, "",              "Налогообложение", 1);
	ДобавитьПКС(СвойстваШапки, "",              "Номер", 1);
	ДобавитьПКС(СвойстваШапки, "Организация",   "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "",              "Основание", 1);
	ДобавитьПКС(СвойстваШапки, "Ответственный", "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "",              "Подразделение", 1);
	ДобавитьПКС(СвойстваШапки, "",              "Склад", 1, "Справочник_Склады_Отправка");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1, "Справочник_ДополнительныеРеквизиты");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "СведенияРНПТ");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмеренияРНПТ", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НаименованиеТовара", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "РНПТ", 1, "Справочник_НомераГТД_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "СуммаРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Упаковка", 1, "Справочник_Упаковки");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмеренияПрослеживаемости", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерГТД", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПрослеживаемыйТовар", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Серия", 1, "Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "СтранаПроисхождения", 1, "Справочник_СтраныМира");
	ДобавитьПКС(СвойстваТЧ, "", "ТипЗапасов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Характеристика", 1, "Справочник_ХарактеристикиНоменклатуры");

КонецПроцедуры
Процедура ПКО_Документ_ПорчаВСписаниеЗапасов_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ПорчаВСписаниеЗапасов_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	
	Префикс = "S";
	//++ Локализация
	Префикс = "Ч";
	//-- Локализация
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 7));
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	ДанныеXDTO.Вставить("Основание", Строка(ДанныеИБ));
	
	#Область Товары
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыЗапасов.Количество КАК Количество,
		|	ВидыЗапасов.НомерГТД КАК НомерГТД,
		|	ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
		|	1 КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
		|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
		|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
		|	КОНЕЦ КАК ТипЗапасов,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Серия КАК Серия
		|ПОМЕСТИТЬ ВидыЗапасов
		|ИЗ
		|	Документ.ПорчаТоваров.ВидыЗапасов КАК ВидыЗапасов
		|ГДЕ
		|	ВидыЗапасов.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Товары.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ПорядокСтрокТаблицыТовары
		|ИЗ
		|	Документ.ПорчаТоваров.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЗапасов.Номенклатура КАК Номенклатура,
		|	ВидыЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыЗапасов.Коэффициент КАК Коэффициент,
		|	ВидыЗапасов.ТипЗапасов КАК ТипЗапасов,
		|	ЕСТЬNULL(ПорядокСтрокТаблицыТовары.НомерСтроки, 0) КАК НомерСтрокиДокумента,
		|	ВидыЗапасов.Количество КАК Количество,
		|	&ТекстЗапросаХарактеристика,
		|	&ТекстЗапросаСерия,
		|	&ТекстЗапросаРНПТ,
		|	&ТекстЗапросаГТД
		|ИЗ
		|	ВидыЗапасов КАК ВидыЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокСтрокТаблицыТовары КАК ПорядокСтрокТаблицыТовары
		|		ПО ВидыЗапасов.Номенклатура = ПорядокСтрокТаблицыТовары.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЕСТЬNULL(ПорядокСтрокТаблицыТовары.НомерСтроки, 0)";
	
	ЗаполнитьСобственныеТоварыВТексте(ТекстЗапроса);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ВидыЗапасов"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаСерия",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ВидыЗапасов"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРНПТ",
		ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "ВидыЗапасов"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаГТД",
		ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ВидыЗапасов"));
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	Товары = Запрос.Выполнить().Выгрузить();
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, Товары, Истина, Ложь);
	
	ДанныеXDTO.Вставить("Товары", Товары);
	
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.ПорчаТоваров.ВидыЗапасов"; 
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов);
	КонецЕсли; 
	//-- Локализация
	
	#КонецОбласти
КонецПроцедуры

#КонецОбласти

#Область Документ_ВозвратТоваровМеждуОрганизациями
&После("ПКО_ВозвратМеждуОрганизациями_ОтПокупателя_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_ВозвратМеждуОрганизациями_ОтПокупателя_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если ДанныеXDTO.Свойство("Склад") И ДанныеXDTO.Свойство("Подразделение") Тогда
		Если ЗначениеЗаполнено(ДанныеИБ.СкладПолучатель) Тогда
			ДанныеXDTO.Склад = ДанныеИБ.СкладПолучатель;	
			Если ТипЗнч(ДанныеXDTO.Подразделение) = Тип("Структура") И ДанныеXDTO.Подразделение.Свойство("Значение") Тогда
				ДанныеXDTO.Подразделение.Значение = ДанныеИБ.СкладПолучатель.Подразделение;
			ИначеЕсли ТипЗнч(ДанныеXDTO.Подразделение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
				ДанныеXDTO.Подразделение = ДанныеИБ.СкладПолучатель.Подразделение;	
			КонецЕсли;
		Иначе
			ДанныеXDTO.Склад = ДанныеИБ.Склад;	
			Если ТипЗнч(ДанныеXDTO.Подразделение) = Тип("Структура") И ДанныеXDTO.Подразделение.Свойство("Значение") Тогда
				ДанныеXDTO.Подразделение.Значение = ДанныеИБ.Склад.Подразделение;
			ИначеЕсли ТипЗнч(ДанныеXDTO.Подразделение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
				ДанныеXDTO.Подразделение = ДанныеИБ.Склад.Подразделение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область Документ_РКО_Отправка
&ИзменениеИКонтроль ("ПКО_Документ_РКОВыплатаЗарплаты_Отправка_ПриОтправкеДанных")
Процедура ДОК_ПКО_Документ_РКОВыплатаЗарплаты_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Касса");
	ВыгрузитьОтветственноеЛицо(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "ГлавныйБухгалтер");
	ВыгрузитьОтветственноеЛицо(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Руководитель");
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7")
		И ЗначениеЗаполнено(ДанныеИБ.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
		ДанныеXDTO.Вставить("ЗаявкаНаРасходДенежныхСредств", ДанныеИБ.ЗаявкаНаРасходованиеДенежныхСредств);
	КонецЕсли;
	
	ТабРасшифровка = Новый ТаблицаЗначений;
	ТабРасшифровка.Колонки.Добавить("СтатьяДДС");
	ТабРасшифровка.Колонки.Добавить("Сумма");
	ТабРасшифровка.Колонки.Добавить("ДатаВедомостиНаВыплатуЗарплаты");
	ТабРасшифровка.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	ТабРасшифровка.Колонки.Добавить("Сотрудник");
	
	НоваяСтрока = ТабРасшифровка.Добавить();
	НоваяСтрока.СтатьяДДС = ДанныеИБ.СтатьяДвиженияДенежныхСредств;
	НоваяСтрока.Сумма = ДанныеИБ.СуммаДокумента;
	
	НоваяСтрока.ДатаВедомостиНаВыплатуЗарплаты = ДанныеИБ.ДатаВедомостиНаВыплатуЗарплаты;
	НоваяСтрока.НомерВедомостиНаВыплатуЗарплаты = ДанныеИБ.НомерВедомостиНаВыплатуЗарплаты;
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыРаботнику
		ИЛИ ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыРаздатчиком Тогда
		НоваяСтрока.Сотрудник = ДанныеИБ.ПодотчетноеЛицо;
	КонецЕсли;	
	#Вставка
	КодАльтерра(ДанныеИБ, НоваяСтрока);
	#КонецВставки
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", ТабРасшифровка);
КонецПроцедуры

Процедура КодАльтерра(ДанныеИБ, НоваяСтрока)
	Если ДанныеИБ.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("01-000007") // Депонированная заработная плата (76.04)
		И ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу 
		И ЗначениеЗаполнено(ДанныеИБ.Выдать) Тогда 
		Сотрудник = ДопМодуль.НайтиФизЛицоПоНаименованию(ДанныеИБ.Выдать);
		Если ЗначениеЗаполнено(Сотрудник) Тогда    
			НоваяСтрока.Сотрудник = Сотрудник;   
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

// новые правила
&После ("ПОД_Документ_СписаниеБезналичныхДенежныхСредств_ПриОбработке")
Процедура ДОК_ПОД_Документ_СписаниеБезналичныхДенежныхСредств_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту Тогда     
		ИспользованиеПКО.Документ_СБДСРасчетыСКонтрагентами_Отправка = Истина;
	КонецЕсли;
конецпроцедуры	

&ИзменениеИКонтроль("ПКО_Документ_СБДСРасчетыСКонтрагентами_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_СБДСРасчетыСКонтрагентами_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ПривестиНомерКФормату11(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_СБДСРасчетыСКонтрагентами_Отправка", 
										"РасшифровкаПлатежа", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	
	ПодразделениеИБ = ДанныеИБ["Подразделение"];
	Если ЗначениеЗаполнено(ПодразделениеИБ) Тогда
		ВыгрузитьПодразделение(ДанныеИБ, ДанныеXDTO, ПодразделениеИБ, "Подразделение");
	Иначе
		ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "БанковскийСчет");
	КонецЕсли;
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		Или ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
		
		ДанныеКонтрагента = ПолучитьДанныеКонтрагентаПоБанкСчетуОрганизации(ДанныеИБ.БанковскийСчетПолучатель, КомпонентыОбмена);
		ДанныеXDTO.Вставить("Контрагент",     ДанныеКонтрагента.Контрагент);
		ДанныеXDTO.Вставить("БанковскийСчет", ДанныеКонтрагента.БанковскийСчетКонтрагента);
	
		КонтрагентСсылка = ДанныеКонтрагента.Контрагент;
	ИначеЕсли ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту	Тогда
		КонтрагентСсылка = ?(ЗначениеЗаполнено(ДанныеИБ.Контрагент), ДанныеИБ.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
		ДанныеXDTO.Вставить("Контрагент",      КонтрагентСсылка);
		ДанныеXDTO.Вставить("БанковскийСчет",  ДанныеИБ.БанковскийСчетКонтрагента);
	Иначе
		
		КонтрагентСсылка = ?(ЗначениеЗаполнено(ДанныеИБ.Контрагент), ДанныеИБ.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
		ДанныеXDTO.Вставить("БанковскийСчет", ДанныеИБ.БанковскийСчетКонтрагента);
		ДанныеXDTO.Вставить("Контрагент",     КонтрагентСсылка);
	
	КонецЕсли;
	
	ЗаполнитьДанныеВходящегоДокументаСБДС(ДанныеИБ, ДанныеXDTO);
	
	ДанныеШапки = ДанныеИБ.ДополнительныеСвойства.ДанныеШапки;
	#Удаление
	ДанныеXDTO.Вставить("ВидРасчетов", ДанныеШапки.ВидРасчетов);
#КонецУдаления
	#Вставка
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту тогда
		ДанныеXDTO.Вставить("ВидРасчетов", "Прочее");
	иначе     
		ДанныеXDTO.Вставить("ВидРасчетов", ДанныеШапки.ВидРасчетов);
	конецесли;
	#КонецВставки
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7")
		И ЗначениеЗаполнено(ДанныеИБ.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
		ДанныеXDTO.Вставить("ЗаявкаНаРасходДенежныхСредств", ДанныеИБ.ЗаявкаНаРасходованиеДенежныхСредств);
	КонецЕсли;
	
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту	Тогда 
		РасшифровкаПлатежа = Новый ТаблицаЗначений;
		РасшифровкаПлатежа.Колонки.Добавить("Договор");
		РасшифровкаПлатежа.Колонки.Добавить("ДокументРасчетов");
		РасшифровкаПлатежа.Колонки.Добавить("Сумма");
		РасшифровкаПлатежа.Колонки.Добавить("ВалютаВзаиморасчетов");  
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.Сумма = ДанныеИБ.СуммаДокумента;
		НоваяСтрока.ВалютаВзаиморасчетов = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация); 
		НоваяСтрока.Договор = ДанныеИБ.Договор;
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
			ПереопределитьСтавкуНДСДляСтарыхФорматов(РасшифровкаПлатежа, Ложь);
		КонецЕсли; 
		ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	Иначе
		ВыгрузитьРасшифровкуКонтрагенты_СписаниеДС(ДанныеИБ, ДанныеXDTO, КонтрагентСсылка, КомпонентыОбмена);
	КонецЕсли;
	#Вставка   
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту тогда
		ТабРасшифровка = Новый ТаблицаЗначений;
		ТабРасшифровка.Колонки.Добавить("СтатьяДДС");
		ТабРасшифровка.Колонки.Добавить("Сумма");
		ТабРасшифровка.Колонки.Добавить("СуммаВзаиморасчетов");
		ТабРасшифровка.Колонки.Добавить("СчетУчетаРасчетовСКонтрагентом");
		ТабРасшифровка.Колонки.Добавить("Договор");    
		ТабРасшифровка.Колонки.Добавить("Заказ");    
		
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.Организация              = ДанныеИБ.Организация;
		ПараметрыПоУмолчанию.Контрагент               = КонтрагентСсылка;
		ПараметрыПоУмолчанию.ВидДоговора              = "Прочее";
		ПараметрыПоУмолчанию.Наименование              =
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация);
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = Ложь;	
		
		НоваяСтрока = ТабРасшифровка.Добавить();
		НоваяСтрока.СтатьяДДС         = ДанныеИБ.СтатьяДвиженияДенежныхСредств;
		НоваяСтрока.Сумма             = ДанныеИБ.СуммаДокумента;
		НоваяСтрока.СуммаВзаиморасчетов             = ДанныеИБ.СуммаДокумента;
		НоваяСтрока.СчетУчетаРасчетовСКонтрагентом = "57.03";
        ДоговорЭквайринга=ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена);
		НоваяСтрока.Договор           = ДоговорЭквайринга;	 
	  
		ДанныеXDTO.Вставить("РасшифровкаПлатежа", ТабРасшифровка);		
		
 	иначе     
		ВыгрузитьРасшифровкуКонтрагенты_СписаниеДС(ДанныеИБ, ДанныеXDTO, КонтрагентСсылка, КомпонентыОбмена);
	конецесли;
	#КонецВставки
КонецПроцедуры
&После ("ПКО_Документ_ВЗ_НашаОрганизация_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_ВЗ_НашаОрганизация_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	ДанныеXDTO.Вставить("КонтрагентДебитор",  КонтрагентПоРеквизиту(ДанныеИБ.КонтрагентДебитор));
	ДанныеXDTO.Вставить("КонтрагентКредитор", КонтрагентПоРеквизиту(ДанныеИБ.КонтрагентКредитор));
	
КонецПроцедуры

&ИзменениеИКонтроль("ВыгрузитьТаблицуЗадолженности")
Функция Док_ВыгрузитьТаблицуЗадолженности(ИмяТЧ, Ссылка, ТекКонтрагент, ТекОрганизация, ОрганизацияДокумента = Неопределено, КомпонентыОбмена)
	ТекстЗапроса = "ВЫБРАТЬ
		|	Задолженность.ОбъектРасчетов.Объект КАК Заказ,
		|	Задолженность.ТипРасчетов КАК ВидРасчетов,
		|	Задолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	Задолженность.СуммаРегл КАК Сумма,
		|	Задолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ЕстьNULL(КурсыВалют.КурсЧислитель, 1) КАК КурсВзаиморасчетов,
		|	ЕстьNULL(КурсыВалют.КурсЗнаменатель, 1) КАК КратностьВзаиморасчетов
		|ИЗ &ТаблицаДокумента КАК Задолженность
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаДок, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалют
		|	ПО Задолженность.ВалютаВзаиморасчетов = КурсыВалют.Валюта 
		|ГДЕ
		|	Задолженность.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаЗадолженности") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Задолженность.СуммаРегл КАК",
			"ВЫРАЗИТЬ(Задолженность.Сумма * ЕСТЬNULL(КурсыВалют.КурсЧислитель, 1) / ЕСТЬNULL(КурсыВалют.КурсЗнаменатель, 1) КАК ЧИСЛО(31, 2)) КАК");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Задолженность.СуммаВзаиморасчетов КАК", "Задолженность.Сумма КАК");
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаПриобретения") Или ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Задолженность.СуммаРегл КАК",
			"ВЫРАЗИТЬ(Задолженность.СуммаКорректировки * ЕСТЬNULL(КурсыВалют.КурсЧислитель, 1) / ЕСТЬNULL(КурсыВалют.КурсЗнаменатель, 1) КАК ЧИСЛО(31, 2)) КАК");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Задолженность.ВалютаВзаиморасчетов",
			"Задолженность.Ссылка.ВалютаВзаиморасчетов"); 
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Задолженность.ТипРасчетов КАК",
				"ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Задолженность.ТипРасчетов КАК",
				"ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ТаблицаДокумента", "Документ." + Ссылка.Метаданные().Имя + "." + ИмяТЧ);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", Ссылка.Дата);
	Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ТекОрганизация));
	ДанныеЗадолженность = Запрос.Выполнить().Выгрузить();
	
	ДанныеЗадолженность.Колонки.Добавить("Договор");
	ДанныеЗадолженность.Колонки.Добавить("ДокументРасчетов");
	
	Для Каждого СтрокаТаблицы Из ДанныеЗадолженность Цикл
		
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
			
			ТипЗаказа = ТипЗнч(СтрокаТаблицы.Заказ);
			
			Если ТипЗаказа = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				СтрокаТаблицы.Договор = СтрокаТаблицы.Заказ;
				#Вставка
				если ТекКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо тогда
					НазваниеПоУмолчанию = ТекКонтрагент.Партнер.Наименование + " " + Строка(ТекКонтрагент.Партнер.код);
					ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
                    заполнитьЗначенияСвойств(ПараметрыПоУмолчанию,СтрокаТаблицы.Договор);  
					ПараметрыПоУмолчанию.Вставить("Контрагент", КонтрагентПоРеквизиту(ТекКонтрагент)); 
					ПараметрыПоУмолчанию.Вставить("Наименование", НазваниеПоУмолчанию);    
					ПараметрыПоУмолчанию.Вставить("РасчетыВУсловныхЕдиницах", ложь); 
					ПараметрыПоУмолчанию.Вставить("ВидДоговора", "СПокупателем"); 
					
					Договор = Новый Структура("Значение, ИмяПКО", ПараметрыПоУмолчанию, "Справочник_ДоговорыКонтрагентов_ИзСтруктуры");
					СтрокаТаблицы.Договор = Договор;

				конецесли;
				#КонецВставки

			Иначе
				Если СтрокаТаблицы.Заказ.Метаданные().Реквизиты.Найти("Договор") <> Неопределено Тогда
					ТекДоговор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Заказ, "Договор");
					Если ТипЗнч(ТекДоговор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
						СтрокаТаблицы.Договор = ТекДоговор;
					КонецЕсли;
				КонецЕсли;
				
				ИмяПКО = ИмяПКОДляОбъектаДанных(КомпонентыОбмена, СтрокаТаблицы.Заказ, ТекКонтрагент);
				
				Если Не ПустаяСтрока(ИмяПКО) Тогда
					СтрокаТаблицы.ДокументРасчетов = Новый Структура("Значение, ИмяПКО", СтрокаТаблицы.Заказ, ИмяПКО);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Договор) Тогда
			Продолжить;
		КонецЕсли;
		
		ИнвертироватьПараметрыДоговора = Ложь;
		РасчетыВУсловныхЕдиницах       = Ложь;
		ВидДоговора                    = "";
		
		Если ЗначениеЗаполнено(ОрганизацияДокумента)
			И ОрганизацияДокумента <> ТекОрганизация Тогда
			ИнвертироватьПараметрыДоговора = Истина;
		КонецЕсли;
		
		ПолучитьПараметрыДоговораПоЗаказу(СтрокаТаблицы.Заказ, СтрокаТаблицы.ВидРасчетов,
			ВидДоговора, РасчетыВУсловныхЕдиницах, ИнвертироватьПараметрыДоговора);
		
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.Организация              = ТекОрганизация;
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов     = СтрокаТаблицы.ВалютаВзаиморасчетов;
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = РасчетыВУсловныхЕдиницах;
		ПараметрыПоУмолчанию.ВидДоговора              = ВидДоговора; 
		ПараметрыПоУмолчанию.Контрагент               = ТекКонтрагент;
		
		СтрокаТаблицы.Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, СтрокаТаблицы.Заказ, Ссылка);
		
	КонецЦикла;
	
	ДанныеЗадолженность.Колонки.Удалить("Заказ");
	
	Возврат ДанныеЗадолженность;
КонецФункции

&ИзменениеИКонтроль("ПКО_Документ_КорректировкаРеализации_Отправка_ПриОтправкеДанных")
Процедура Док_ПКО_Документ_КорректировкаРеализации_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	ПоддерживаетсяКомиссионнаяТорговля = ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17");
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
		"Документ_КорректировкаРеализации_Отправка", 
		"Товары", 
		"НомерГТД",
		Истина,
		"Справочник_НомераГТД_Отправка");
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
		"Документ_КорректировкаРеализации_Отправка", 
		"Товары", 
		"НомерГТДДоИзменения",
		Истина,
		"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
		"Документ_КорректировкаРеализации_Отправка", 
		"Товары", 
		"СтавкаНДС",
		Истина,
		"СправочникСсылка_СтавкиНДС_Отправка"); 
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
		"Документ_КорректировкаРеализации_Отправка", 
		"Услуги", 
		"СтавкаНДС",
		Истина,
		"СправочникСсылка_СтавкиНДС_Отправка");
		
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
		"Документ_КорректировкаРеализации_Отправка", 
		"Товары", 
		"СтавкаНДСДоИзменения",
		Истина,
		"СправочникСсылка_СтавкиНДС_Отправка"); 
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
		"Документ_КорректировкаРеализации_Отправка", 
		"Услуги", 
		"СтавкаНДСДоИзменения",
		Истина,
		"СправочникСсылка_СтавкиНДС_Отправка");
		
	КонецЕсли;
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	// Данные исходного документа реализации
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Док.ЗаказКлиента КАК ЗаказКлиента,
	|	Док.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	докЗаказКлиента.Дата КАК Дата,
	|	докЗаказКлиента.Ссылка КАК Ссылка,
	|	докЗаказКлиента.Номер КАК Номер,
	|	докЗаказКлиента.Организация КАК Организация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК докЗаказКлиента
	|		ПО Док.ЗаказКлиента = докЗаказКлиента.Ссылка
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.ЗаказКлиента,
	|	ЛОЖЬ,
	|	ДокЗаказКлиента.Дата,
	|	ДокЗаказКлиента.Ссылка,
	|	ДокЗаказКлиента.Номер,
	|	ДокЗаказКлиента.Организация
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокЗаказКлиента
	|		ПО Док.ЗаказКлиента = ДокЗаказКлиента.Ссылка
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование";
	
	// Ссылка на исправляемый документ
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК Ссылка,
	|	КорректировкаРеализации.МоментВремени КАК МоментВремени,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &МеждународнаяВерсия
	|				ТОГДА ЛОЖЬ
	//++ Локализация
	|			КОГДА СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	//-- Локализация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Корректировочный,
	|	ЛОЖЬ КАК ЭтоДокументОснование,
	|	КорректировкаРеализации.ТипКорректировки КАК ТипКорректировки,
	|	КорректировкаРеализации.ВидКорректировки КАК ВидКорректировки
	|ПОМЕСТИТЬ ПараметрыДокументовПоследовательности
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	//++ Локализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО КорректировкаРеализации.Ссылка = СчетФактураВыданный.ДокументОснование
	|			И (СчетФактураВыданный.Корректировочный)
	|			И (НЕ СчетФактураВыданный.ПометкаУдаления)
	//-- Локализация
	|ГДЕ
	|	КорректировкаРеализации.Проведен
	|	И КорректировкаРеализации.МоментВремени <= &МоментВремени
	|	И КорректировкаРеализации.ДокументОснование = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализации.Ссылка,
	|	КорректировкаРеализации.МоментВремени,
	|	КорректировкаРеализации.ТипКорректировки,
	|	КорректировкаРеализации.ВидКорректировки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.ДокументОснование,
	|	КорректировкаРеализации.ДокументОснование.МоментВремени,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &МеждународнаяВерсия
	|				ТОГДА ЛОЖЬ
	//++ Локализация
	|			КОГДА СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	//-- Локализация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ),
	|	ИСТИНА,
	|	КорректировкаРеализации.ТипКорректировки,
	|	КорректировкаРеализации.ВидКорректировки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	//++ Локализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО КорректировкаРеализации.ДокументОснование = СчетФактураВыданный.ДокументОснование
	|			И (НЕ СчетФактураВыданный.ПометкаУдаления)
	|			И (СчетФактураВыданный.Корректировочный)
	//-- Локализация
	|ГДЕ
	|	КорректировкаРеализации.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализации.ДокументОснование,
	|	КорректировкаРеализации.ТипКорректировки,
	|	КорректировкаРеализации.ВидКорректировки,
	|	КорректировкаРеализации.ДокументОснование.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Параметры1.Ссылка КАК Ссылка,
	|	Параметры1.Корректировочный КАК Корректировочный,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА Параметры1.Корректировочный
	|					И НЕ Параметры2.Корректировочный
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ИсходныйКорректировочный
	|ПОМЕСТИТЬ ПараметрыОтбора
	|ИЗ
	|	ПараметрыДокументовПоследовательности КАК Параметры1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыДокументовПоследовательности КАК Параметры2
	|		ПО (Параметры1.Ссылка = &Ссылка)
	|			И (Параметры2.Ссылка <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Параметры1.Ссылка,
	|	Параметры1.Корректировочный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Параметры1.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсправляемыеДокументы.Ссылка КАК Ссылка,
	|	ИсправляемыеДокументы.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ ИсправляемыйДокумент
	|ИЗ
	|	ПараметрыДокументовПоследовательности КАК ИсправляемыеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыОтбора КАК ПараметрыОтбора
	|		ПО (ИсправляемыеДокументы.Корректировочный = ПараметрыОтбора.Корректировочный
	|				ИЛИ ПараметрыОтбора.ИсходныйКорректировочный
	|				ИЛИ ИсправляемыеДокументы.ЭтоДокументОснование)
	|			И ИсправляемыеДокументы.Ссылка <> ПараметрыОтбора.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсправляемыеДокументы.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсправляемыеДокументы.Ссылка КАК Ссылка,
	|	ИсправляемыеДокументы.МоментВремени КАК МоментВремени,
	|	ИсправляемыеДокументы.Ссылка.Дата КАК Дата,
	|	ИсправляемыеДокументы.Ссылка.Организация КАК Организация,
	|	ИсправляемыеДокументы.Ссылка.Номер КАК Номер,  
	|	ИсправляемыеДокументы.ВидКорректировки КАК ВидКорректировки,
	|	ПараметрыОтбора.ИсходныйКорректировочный КАК ИсходныйКорректировочный
	|ИЗ
	|	ПараметрыДокументовПоследовательности КАК ИсправляемыеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыОтбора КАК ПараметрыОтбора
	|		ПО ИсправляемыеДокументы.Ссылка <> ПараметрыОтбора.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсправляемыеДокументы.МоментВремени УБЫВ";
	
	// Ссылка на основание исправления (корректировки) и документ до корректировки
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсправляемыеДокументы.Ссылка КАК Ссылка,
	|	ИсправляемыеДокументы.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ ДокументДоКорректировки
	|ИЗ
	|	ПараметрыДокументовПоследовательности КАК ИсправляемыеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыОтбора КАК ПараметрыОтбора
	|		ПО (ПараметрыОтбора.Корректировочный)
	|			И (НЕ ПараметрыОтбора.ИсходныйКорректировочный)
	|			И (НЕ ИсправляемыеДокументы.Корректировочный)
	|			И ИсправляемыеДокументы.Ссылка <> ПараметрыОтбора.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсправляемыеДокументы.ЭтоДокументОснование,
	|	ИсправляемыеДокументы.МоментВремени УБЫВ";
	
	// Товары исходной реализации
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
	|	КорректировкаРеализацииТовары.Характеристика КАК Характеристика,
	|	КорректировкаРеализацииТовары.Серия КАК Серия,
	|	КорректировкаРеализацииТовары.Упаковка КАК Упаковка,
	|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаРеализацииТовары.НомерГТД КАК НомерГТД,
	|	ЕСТЬNULL(КорректировкаРеализацииВидыЗапасовКорректировкаВыручки.ВидЗапасов.ТипЗапасов, ЕСТЬNULL(КорректировкаРеализацииВидыЗапасовОприходование.ВидЗапасов.ТипЗапасов, КорректировкаРеализацииВидыЗапасовСписание.ВидЗапасов.ТипЗапасов)) КАК ТипЗапасов,
	|	КорректировкаРеализацииТовары.Количество КАК Количество,
	|	КорректировкаРеализацииТовары.КоличествоУпаковок - КорректировкаРеализацииРасхождения.КоличествоУпаковок КАК КоличествоУпаковок,
	|	КорректировкаРеализацииТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	КорректировкаРеализацииТовары.СуммаСНДС КАК СуммаСНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
	|	КорректировкаРеализацииТовары.Ссылка.ТипКорректировки КАК ТипКорректировки,
	|	КорректировкаРеализацииРасхождения.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	КорректировкаРеализацииТовары.Ссылка КАК Ссылка,
	|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|	КорректировкаРеализацииРасхождения.ВариантОтражения КАК ВариантОтражения
	|ПОМЕСТИТЬ ТоварыКорректировкиВводаОстатков
	|ИЗ
	|	ПараметрыДокументовПоследовательности КАК ПараметрыДокументовПоследовательности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Расхождения КАК КорректировкаРеализацииРасхождения
	|			ПО КорректировкаРеализацииТовары.Ссылка = КорректировкаРеализацииРасхождения.Ссылка
	|				И КорректировкаРеализацииТовары.Номенклатура = КорректировкаРеализацииРасхождения.Номенклатура
	|				И КорректировкаРеализацииТовары.Характеристика = КорректировкаРеализацииРасхождения.Характеристика
	|				И КорректировкаРеализацииТовары.НомерСтроки = КорректировкаРеализацииРасхождения.НомерСтроки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК КорректировкаРеализацииВидыЗапасовКорректировкаВыручки
	|			ПО КорректировкаРеализацииТовары.Ссылка = КорректировкаРеализацииВидыЗапасовКорректировкаВыручки.Ссылка
	|				И КорректировкаРеализацииТовары.Номенклатура = КорректировкаРеализацииВидыЗапасовКорректировкаВыручки.АналитикаУчетаНоменклатуры.Номенклатура
	|				И КорректировкаРеализацииТовары.Характеристика = КорректировкаРеализацииВидыЗапасовКорректировкаВыручки.АналитикаУчетаНоменклатуры.Характеристика
	|				И КорректировкаРеализацииТовары.Серия = КорректировкаРеализацииВидыЗапасовКорректировкаВыручки.АналитикаУчетаНоменклатуры.Серия
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК КорректировкаРеализацииВидыЗапасовОприходование
	|			ПО КорректировкаРеализацииТовары.Ссылка = КорректировкаРеализацииВидыЗапасовОприходование.Ссылка
	|				И КорректировкаРеализацииТовары.Номенклатура = КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Номенклатура
	|				И КорректировкаРеализацииТовары.Характеристика = КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Характеристика
	|				И КорректировкаРеализацииТовары.Серия = КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Серия
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК КорректировкаРеализацииВидыЗапасовСписание 
	|			ПО КорректировкаРеализацииТовары.Ссылка = КорректировкаРеализацииВидыЗапасовСписание.Ссылка
	|			И (КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура = КорректировкаРеализацииТовары.Номенклатура)
	|			И (КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Характеристика = КорректировкаРеализацииТовары.Характеристика)
	|			И (КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Серия = КорректировкаРеализацииТовары.Серия)
	|		ПО ПараметрыДокументовПоследовательности.Ссылка = КорректировкаРеализацииТовары.Ссылка
	|ГДЕ
	|	ПараметрыДокументовПоследовательности.ТипКорректировки = ЗНАЧЕНИЕ(Перечисление.ТипыКорректировки.КорректировкаДоВводаОстатковТоваровИУслуг)
	|	И ПараметрыДокументовПоследовательности.Ссылка ССЫЛКА Документ.КорректировкаРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.Характеристика,
	|	КорректировкаРеализацииТовары.Серия,
	|	КорректировкаРеализацииТовары.Упаковка,
	|	КорректировкаРеализацииТовары.НомерГТД,
	|	КорректировкаРеализацииТовары.Количество,
	|	КорректировкаРеализацииТовары.КоличествоУпаковок - КорректировкаРеализацииРасхождения.КоличествоУпаковок,
	|	КорректировкаРеализацииТовары.КоличествоПоРНПТ,
	|	КорректировкаРеализацииТовары.СуммаСНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС,
	|	КорректировкаРеализацииТовары.Ссылка.ТипКорректировки,
	|	КорректировкаРеализацииРасхождения.Номенклатура.ТипНоменклатуры,
	|	ЕСТЬNULL(КорректировкаРеализацииВидыЗапасовКорректировкаВыручки.ВидЗапасов.ТипЗапасов, ЕСТЬNULL(КорректировкаРеализацииВидыЗапасовОприходование.ВидЗапасов.ТипЗапасов, КорректировкаРеализацииВидыЗапасовСписание.ВидЗапасов.ТипЗапасов)),
	|	КорректировкаРеализацииТовары.Ссылка,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	КорректировкаРеализацииТовары.НомерСтроки,
	|	КорректировкаРеализацииТовары.Сумма,
	|	КорректировкаРеализацииРасхождения.ВариантОтражения  
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Товары.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Товары.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	СУММА(Товары.Количество) КАК Количество,
	|	СУММА(Товары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(Товары.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
	|	СУММА(Товары.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	"""" КАК ТипКорректировки,
	|	Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|ПОМЕСТИТЬ ТоварыРеализацииОснования
	|	ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Товары
	|	ГДЕ
	|	Товары.Ссылка = &ДокументОснование
	|	И ВЫБОР
	|		КОГДА Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА ИСТИНА
	|		КОГДА Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ &ВернутьМногооборотнуюТару
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|	
	|	СГРУППИРОВАТЬ ПО
	|	Товары.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Товары.АналитикаУчетаНоменклатуры.Характеристика,
	|	Товары.СтавкаНДС,
	|	Товары.Упаковка,
	|	Товары.НомерГТД,
	|	Товары.ВидЗапасов.ТипЗапасов,
	|	Товары.АналитикаУчетаНоменклатуры.Серия,
	|	Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры
	|;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
	|	КорректировкаРеализацииТовары.Характеристика КАК Характеристика,
	|	КорректировкаРеализацииТовары.Серия КАК Серия,
	|	КорректировкаРеализацииТовары.Упаковка КАК Упаковка,
	|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаРеализацииТовары.НомерГТД КАК НомерГТД,
	|	КорректировкаРеализацииТовары.Количество КАК Количество,
	|	КорректировкаРеализацииТовары.КоличествоУпаковок - КорректировкаРеализацииРасхождения.КоличествоУпаковок КАК КоличествоУпаковок,
	|	КорректировкаРеализацииТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	КорректировкаРеализацииТовары.СуммаСНДС КАК СуммаСНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
	|	КорректировкаРеализацииТовары.Ссылка.ТипКорректировки КАК ТипКорректировки,
	|	КорректировкаРеализацииРасхождения.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	КорректировкаРеализацииТовары.Ссылка КАК Ссылка,
	|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|	КорректировкаРеализацииРасхождения.ВариантОтражения КАК ВариантОтражения
	|ПОМЕСТИТЬ ТоварыКорректировкиУвеличениеРеализации
	|ИЗ
	|	ПараметрыДокументовПоследовательности КАК ПараметрыДокументовПоследовательности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Расхождения КАК КорректировкаРеализацииРасхождения
	|			ПО КорректировкаРеализацииТовары.Ссылка = КорректировкаРеализацииРасхождения.Ссылка
	|				И КорректировкаРеализацииТовары.Номенклатура = КорректировкаРеализацииРасхождения.Номенклатура
	|				И КорректировкаРеализацииТовары.Характеристика = КорректировкаРеализацииРасхождения.Характеристика
	|		ПО ПараметрыДокументовПоследовательности.Ссылка = КорректировкаРеализацииТовары.Ссылка
	|	ГДЕ
	|	КорректировкаРеализацииРасхождения.ВариантОтражения В(&ВариантыОтражения)
	|	И НЕ КорректировкаРеализацииТовары.Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыРеализацииОснования.Номенклатура
	|				ИЗ
	|					ТоварыРеализацииОснования КАК ТоварыРеализацииОснования)
	|	
	|	СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.Характеристика,
	|	КорректировкаРеализацииТовары.Серия,
	|	КорректировкаРеализацииТовары.Упаковка,
	|	КорректировкаРеализацииТовары.НомерГТД,
	|	КорректировкаРеализацииТовары.Количество,
	|	КорректировкаРеализацииТовары.КоличествоУпаковок - КорректировкаРеализацииРасхождения.КоличествоУпаковок,
	|	КорректировкаРеализацииТовары.КоличествоПоРНПТ,
	|	КорректировкаРеализацииТовары.СуммаСНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС,
	|	КорректировкаРеализацииТовары.Ссылка.ТипКорректировки,
	|	КорректировкаРеализацииРасхождения.Номенклатура.ТипНоменклатуры,
	|	КорректировкаРеализацииТовары.Ссылка,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	КорректировкаРеализацииТовары.НомерСтроки,
	|	КорректировкаРеализацииТовары.Сумма,
	|	КорректировкаРеализацииРасхождения.ВариантОтражения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Товары.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Товары.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	СУММА(Товары.Количество) КАК Количество,
	|	СУММА(Товары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(Товары.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
	|	СУММА(Товары.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	"""" КАК ТипКорректировки,
	|	Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ВариантОтражения
	|ПОМЕСТИТЬ ТоварыИсходнойРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ДокументОснование
	|	И ВЫБОР
	|			КОГДА Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ИСТИНА
	|			КОГДА Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|					И НЕ &ВернутьМногооборотнуюТару
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Товары.АналитикаУчетаНоменклатуры.Характеристика,
	|	Товары.СтавкаНДС,
	|	Товары.Упаковка,
	|	Товары.НомерГТД,
	|	Товары.ВидЗапасов.ТипЗапасов,
	|	Товары.АналитикаУчетаНоменклатуры.Серия,
	|	Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТоварыКорректировкиВводаОстатков.Номенклатура,
	|	ТоварыКорректировкиВводаОстатков.Характеристика,
	|	ТоварыКорректировкиВводаОстатков.Серия,
	|	ТоварыКорректировкиВводаОстатков.Упаковка,
	|	ТоварыКорректировкиВводаОстатков.СтавкаНДС,
	|	ТоварыКорректировкиВводаОстатков.НомерГТД,
	|	ЕСТЬNULL(ТоварыКорректировкиВводаОстатков.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар)),
	|	ТоварыКорректировкиВводаОстатков.Количество,
	|	ТоварыКорректировкиВводаОстатков.КоличествоУпаковок,
	|	ТоварыКорректировкиВводаОстатков.КоличествоПоРНПТ,
	|	ТоварыКорректировкиВводаОстатков.СуммаСНДС,
	|	ТоварыКорректировкиВводаОстатков.СуммаНДС,
	|	ТоварыКорректировкиВводаОстатков.ТипКорректировки,
	|	ТоварыКорректировкиВводаОстатков.ТипНоменклатуры,
	|	ТоварыКорректировкиВводаОстатков.ВариантОтражения
	|ИЗ
	|	ТоварыКорректировкиВводаОстатков КАК ТоварыКорректировкиВводаОстатков
	|ГДЕ
	|	ТоварыКорректировкиВводаОстатков.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) 
	|	И ТоварыКорректировкиВводаОстатков.Ссылка = &Ссылка	
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ТоварыКорректировкиУвеличениеРеализации.Номенклатура,
	|	ТоварыКорректировкиУвеличениеРеализации.Характеристика,
	|	ТоварыКорректировкиУвеличениеРеализации.Серия,
	|	ТоварыКорректировкиУвеличениеРеализации.Упаковка,
	|	ТоварыКорректировкиУвеличениеРеализации.СтавкаНДС,
	|	МАКСИМУМ(ТоварыКорректировкиУвеличениеРеализации.НомерГТД),
	|	ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар),
	|	ТоварыКорректировкиУвеличениеРеализации.Количество,
	|	ТоварыКорректировкиУвеличениеРеализации.КоличествоУпаковок,
	|	ТоварыКорректировкиУвеличениеРеализации.КоличествоПоРНПТ,
	|	ТоварыКорректировкиУвеличениеРеализации.СуммаСНДС,
	|	ТоварыКорректировкиУвеличениеРеализации.СуммаНДС,
	|	ТоварыКорректировкиУвеличениеРеализации.ТипКорректировки,
	|	ТоварыКорректировкиУвеличениеРеализации.ТипНоменклатуры,
	|	ТоварыКорректировкиУвеличениеРеализации.ВариантОтражения
	|ИЗ
	|	ТоварыКорректировкиУвеличениеРеализации КАК ТоварыКорректировкиУвеличениеРеализации   
	|ГДЕ
	|	ТоварыКорректировкиУвеличениеРеализации.Ссылка = &Ссылка  
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКорректировкиУвеличениеРеализации.Номенклатура,
	|	ТоварыКорректировкиУвеличениеРеализации.Характеристика,
	|	ТоварыКорректировкиУвеличениеРеализации.Серия,
	|	ТоварыКорректировкиУвеличениеРеализации.Упаковка,
	|	ТоварыКорректировкиУвеличениеРеализации.СтавкаНДС,
	|	ТоварыКорректировкиУвеличениеРеализации.Количество,
	|	ТоварыКорректировкиУвеличениеРеализации.КоличествоУпаковок,
	|	ТоварыКорректировкиУвеличениеРеализации.КоличествоПоРНПТ,
	|	ТоварыКорректировкиУвеличениеРеализации.СуммаСНДС,
	|	ТоварыКорректировкиУвеличениеРеализации.СуммаНДС,
	|	ТоварыКорректировкиУвеличениеРеализации.ТипКорректировки,
	|	ТоварыКорректировкиУвеличениеРеализации.ТипНоменклатуры,
	|	ТоварыКорректировкиУвеличениеРеализации.ВариантОтражения
	|";
	
	#Вставка
	ТекстЗапроса=Стрзаменить(ТекстЗапроса,"СУММА(Товары.СуммаСНДС) КАК СуммаСНДС","СУММА(Товары.СуммаСНДС+Товары.СуммаСНДСРТ) КАК СуммаСНДС");
	ТекстЗапроса=Стрзаменить(ТекстЗапроса,"СУММА(Товары.СуммаНДС) КАК СуммаНДС","СУММА(Товары.СуммаНДС+Товары.СуммаНДСРТ) КАК СуммаНДС");
	#КонецВставки
	// Изменения в товарах
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаВыручки.Ссылка КАК Ссылка,
	|	РС_АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	РС_АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	РС_АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	КорректировкаВыручки.Упаковка КАК Упаковка,
	|	КорректировкаВыручки.НомерГТД КАК НомерГТД,
	|	КорректировкаВыручки.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаВыручки.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	0 КАК Количество,
	|	0 КАК КоличествоУпаковок,
	|	0 КАК КоличествоПоРНПТ,
	|	КорректировкаВыручки.СуммаНДС КАК СуммаНДС,
	|	КорректировкаВыручки.СуммаСНДС КАК СуммаСНДС,
	|	КорректировкаВыручки.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ИзмененияВТоварахСОтборомПредв
	|ИЗ
	|	ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК КорректировкаВыручки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК РС_АналитикаУчетаНоменклатуры
	|			ПО (РС_АналитикаУчетаНоменклатуры.Номенклатура = КорректировкаВыручки.АналитикаУчетаНоменклатуры.Номенклатура)
	|				И (РС_АналитикаУчетаНоменклатуры.Характеристика = КорректировкаВыручки.АналитикаУчетаНоменклатуры.Характеристика)
	|				И КорректировкаВыручки.АналитикаУчетаНоменклатуры.Серия = РС_АналитикаУчетаНоменклатуры.Серия
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА РС_АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ИСТИНА
	|			КОГДА РС_АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|					И НЕ &ВернутьМногооборотнуюТару
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И РС_АналитикаУчетаНоменклатуры.Номенклатура В
	|			(ВЫБРАТЬ
	|				ТоварыИсходнойРеализации.Номенклатура
	|			ИЗ
	|				ТоварыИсходнойРеализации КАК ТоварыИсходнойРеализации)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТоварыКОприходованию.Ссылка,
	|	ТоварыКОприходованию.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ТоварыКОприходованию.АналитикаУчетаНоменклатуры.Характеристика,
	|	ТоварыКОприходованию.АналитикаУчетаНоменклатуры.Серия,
	|	ТоварыКОприходованию.Упаковка,
	|	ТоварыКОприходованию.НомерГТД,
	|	ТоварыКОприходованию.СтавкаНДС,
	|	ТоварыКОприходованию.ВидЗапасов.ТипЗапасов,
	|	-ТоварыКОприходованию.Количество,
	|	-ТоварыКОприходованию.КоличествоУпаковок,
	|	-ТоварыКОприходованию.КоличествоПоРНПТ,
	|	-ТоварыКОприходованию.СуммаНДС,
	|	-ТоварыКОприходованию.СуммаСНДС,
	|	ТоварыКОприходованию.НомерСтроки
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ТоварыКОприходованию
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК РС_АналитикаУчетаНоменклатуры
	|		ПО (РС_АналитикаУчетаНоменклатуры.Номенклатура = ТоварыКОприходованию.АналитикаУчетаНоменклатуры.Номенклатура)
	|			И (РС_АналитикаУчетаНоменклатуры.Характеристика = ТоварыКОприходованию.АналитикаУчетаНоменклатуры.Характеристика)
	|			И ТоварыКОприходованию.АналитикаУчетаНоменклатуры.Серия = РС_АналитикаУчетаНоменклатуры.Серия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыДокументовПоследовательности КАК Последовательность
	|		ПО (НЕ Последовательность.ЭтоДокументОснование)
	|			И ТоварыКОприходованию.Ссылка = Последовательность.Ссылка
	|ГДЕ
	|	РС_АналитикаУчетаНоменклатуры.Номенклатура В
	|			(ВЫБРАТЬ
	|				ТоварыИсходнойРеализации.Номенклатура
	|			ИЗ
	|				ТоварыИсходнойРеализации КАК ТоварыИсходнойРеализации)
	|	И ВЫБОР
	|			КОГДА РС_АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ИСТИНА
	|			КОГДА РС_АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|					И НЕ &ВернутьМногооборотнуюТару
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТоварыКСписанию.Ссылка,
	|	ТоварыКСписанию.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ТоварыКСписанию.АналитикаУчетаНоменклатуры.Характеристика,
	|	ТоварыКСписанию.АналитикаУчетаНоменклатуры.Серия,
	|	ТоварыКСписанию.Упаковка,
	|	ТоварыКСписанию.НомерГТД,
	|	ТоварыКСписанию.СтавкаНДС,
	|	ТоварыКСписанию.ВидЗапасов.ТипЗапасов,
	|	ТоварыКСписанию.Количество,
	|	ТоварыКСписанию.КоличествоУпаковок,
	|	ТоварыКСписанию.КоличествоПоРНПТ,
	|	ТоварыКСписанию.СуммаНДС,
	|	ТоварыКСписанию.СуммаСНДС,
	|	ТоварыКСписанию.НомерСтроки
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ТоварыКСписанию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК РС_АналитикаУчетаНоменклатуры
	|		ПО (РС_АналитикаУчетаНоменклатуры.Номенклатура = ТоварыКСписанию.АналитикаУчетаНоменклатуры.Номенклатура)
	|			И (РС_АналитикаУчетаНоменклатуры.Характеристика = ТоварыКСписанию.АналитикаУчетаНоменклатуры.Характеристика)
	|			И ТоварыКСписанию.АналитикаУчетаНоменклатуры.Серия = РС_АналитикаУчетаНоменклатуры.Серия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО (ИСТИНА)
	|ГДЕ
	|	РС_АналитикаУчетаНоменклатуры.Номенклатура В
	|			(ВЫБРАТЬ
	|				ТоварыИсходнойРеализации.Номенклатура
	|			ИЗ
	|				ТоварыИсходнойРеализации КАК ТоварыИсходнойРеализации)
	|	И ВЫБОР
	|			КОГДА РС_АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ИСТИНА
	|			КОГДА РС_АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|					И НЕ &ВернутьМногооборотнуюТару
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КорректировкаВыручки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|	ИзмененияВТоварахСОтбором.Ссылка КАК Ссылка,
	|	ИзмененияВТоварахСОтбором.Номенклатура КАК Номенклатура,
	|	ИзмененияВТоварахСОтбором.Характеристика КАК Характеристика,
	|	ИзмененияВТоварахСОтбором.Серия КАК Серия,
	|	ИзмененияВТоварахСОтбором.Упаковка КАК Упаковка,
	|	ИзмененияВТоварахСОтбором.НомерГТД КАК НомерГТД,
	|	ИзмененияВТоварахСОтбором.СтавкаНДС КАК СтавкаНДС,
	|	ИзмененияВТоварахСОтбором.ТипЗапасов КАК ТипЗапасов,
	|	ИзмененияВТоварахСОтбором.Количество КАК Количество,
	|	ИзмененияВТоварахСОтбором.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ИзмененияВТоварахСОтбором.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СУММА(ИзмененияВТоварахСОтбором.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ИзмененияВТоварахСОтбором.СуммаСНДС) КАК СуммаСНДС
	|ПОМЕСТИТЬ ИзмененияВТоварахСОтбором
	|ИЗ
	|	ИзмененияВТоварахСОтборомПредв КАК ИзмененияВТоварахСОтбором
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененияВТоварахСОтбором.Ссылка,
	|	ИзмененияВТоварахСОтбором.Номенклатура,
	|	ИзмененияВТоварахСОтбором.Характеристика,
	|	ИзмененияВТоварахСОтбором.Серия,
	|	ИзмененияВТоварахСОтбором.Упаковка,
	|	ИзмененияВТоварахСОтбором.НомерГТД,
	|	ИзмененияВТоварахСОтбором.СтавкаНДС,
	|	ИзмененияВТоварахСОтбором.ТипЗапасов,
	|	ИзмененияВТоварахСОтбором.Количество,
	|	ИзмененияВТоварахСОтбором.КоличествоУпаковок,
	|	ИзмененияВТоварахСОтбором.КоличествоПоРНПТ
	|;
	// Поля НомерГТД и КоличествоПоРНПТ в ТЧ ВидыЗапасов... документа КорректировкаРеализации могут быть пустыми 
	// в ситуации, когда выбран вариант отражения расхождений - на прочих доходах или не подобрались остатки
	// по этой причине предусмотрена подстановка НомераГТД и КоличестваРНПТ по данным исходного документа Реализации
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Изменения.Номенклатура КАК Номенклатура,
	|	Изменения.Характеристика КАК Характеристика,
	|	Изменения.Серия КАК Серия,
	|	Изменения.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА Изменения.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|			ТОГДА ТоварыИсходнойРеализации.НомерГТД
	|		ИНАЧЕ Изменения.НомерГТД
	|	КОНЕЦ КАК НомерГТД,
	|	Изменения.СтавкаНДС КАК СтавкаНДС,
	|	Изменения.ТипЗапасов КАК ТипЗапасов,
	|	Изменения.Количество КАК Количество,
	|	Изменения.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА Изменения.Количество <> 0
	|				И Изменения.КоличествоПоРНПТ = 0
	|				И ТоварыИсходнойРеализации.КоличествоПоРНПТ <> 0
	|				И ТоварыИсходнойРеализации.Количество <> 0
	|			ТОГДА ТоварыИсходнойРеализации.КоличествоПоРНПТ * Изменения.Количество / ТоварыИсходнойРеализации.Количество
	|		ИНАЧЕ Изменения.КоличествоПоРНПТ
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	Изменения.СуммаНДС КАК СуммаНДС,
	|	Изменения.СуммаСНДС КАК СуммаСНДС,
	|	ВЫБОР
	|		КОГДА НЕ Последовательность.Корректировочный
	|				И Последовательность.МоментВремени <= ДокументДоКорректировки.МоментВремени
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзмененияДоКорректировки,
	|	ВЫБОР
	|		КОГДА Последовательность.МоментВремени <= ИсправляемыйДокумент.МоментВремени
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзмененияДоИсправления
	|ПОМЕСТИТЬ ИзмененияВТоварахРазвернуто
	|ИЗ
	|	ИзмененияВТоварахСОтбором КАК Изменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИсходнойРеализации КАК ТоварыИсходнойРеализации
	|		ПО (ТоварыИсходнойРеализации.Номенклатура = Изменения.Номенклатура)
	|			И (ТоварыИсходнойРеализации.Характеристика = Изменения.Характеристика)
	|			И (ТоварыИсходнойРеализации.Серия = Изменения.Серия)	  		
	|			И (ТоварыИсходнойРеализации.ТипЗапасов = Изменения.ТипЗапасов)
	|			И (ТоварыИсходнойРеализации.НомерГТД = Изменения.НомерГТД)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыДокументовПоследовательности КАК Последовательность
	|		ПО (НЕ Последовательность.ЭтоДокументОснование)
	|			И Изменения.Ссылка = Последовательность.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументДоКорректировки КАК ДокументДоКорректировки
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииРасхождения.Номенклатура,
	|	КорректировкаРеализацииРасхождения.Характеристика,
	|	КорректировкаРеализацииРасхождения.Серия,
	|	КорректировкаРеализацииРасхождения.Упаковка,
	|	КорректировкаРеализацииРасхождения.НомерГТД,
	|	КорректировкаРеализацииРасхождения.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыКорректировкиВводаОстатков.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				И ТоварыКорректировкиВводаОстатков.ТипЗапасов ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(перечисление.ТипыЗапасов.Товар)
	|		ИНАЧЕ ТоварыКорректировкиВводаОстатков.ТипЗапасов
	|	КОНЕЦ,
	|	КорректировкаРеализацииРасхождения.Количество,
	|	КорректировкаРеализацииРасхождения.КоличествоУпаковок,
	|	КорректировкаРеализацииРасхождения.КоличествоПоРНПТ,
	|	КорректировкаРеализацииРасхождения.СуммаНДС,
	|	КорректировкаРеализацииРасхождения.СуммаСНДС,
	|	ВЫБОР
	|		КОГДА НЕ Последовательность.Корректировочный
	|				И Последовательность.МоментВремени <= КорректировкаРеализацииРасхождения.Ссылка.МоментВремени
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Последовательность.МоментВремени <= ИсправляемыйДокумент.МоментВремени
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	ПараметрыДокументовПоследовательности КАК Последовательность
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Расхождения КАК КорректировкаРеализацииРасхождения
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКорректировкиВводаОстатков КАК ТоварыКорректировкиВводаОстатков
	|			ПО КорректировкаРеализацииРасхождения.Номенклатура = ТоварыКорректировкиВводаОстатков.Номенклатура
	|				И КорректировкаРеализацииРасхождения.Характеристика = ТоварыКорректировкиВводаОстатков.Характеристика
	|				И КорректировкаРеализацииРасхождения.Серия = ТоварыКорректировкиВводаОстатков.Серия
	|				И КорректировкаРеализацииРасхождения.Ссылка = ТоварыКорректировкиВводаОстатков.Ссылка
	|		ПО (НЕ Последовательность.ЭтоДокументОснование)
	|			И (КорректировкаРеализацииРасхождения.Ссылка = Последовательность.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КорректировкаРеализацииРасхождения.Ссылка.ТипКорректировки = ЗНАЧЕНИЕ(Перечисление.ТипыКорректировки.КорректировкаДоВводаОстатковТоваровИУслуг)
	|	И КорректировкаРеализацииРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзмененияВТоварахРазвернуто.Номенклатура КАК Номенклатура,
	|	ИзмененияВТоварахРазвернуто.Характеристика КАК Характеристика,
	|	ИзмененияВТоварахРазвернуто.Серия КАК Серия,
	|	ИзмененияВТоварахРазвернуто.Упаковка КАК Упаковка,
	|	ИзмененияВТоварахРазвернуто.НомерГТД КАК НомерГТД,
	|	ИзмененияВТоварахРазвернуто.СтавкаНДС КАК СтавкаНДС,
	|	ИзмененияВТоварахРазвернуто.Количество КАК Количество,
	|	ИзмененияВТоварахРазвернуто.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ИзмененияВТоварахРазвернуто.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	ИзмененияВТоварахРазвернуто.СуммаНДС КАК СуммаНДС,
	|	ИзмененияВТоварахРазвернуто.СуммаСНДС КАК СуммаСНДС,
	|	ИзмененияВТоварахРазвернуто.ТипЗапасов КАК ТипЗапасов,
	|	ИзмененияВТоварахРазвернуто.ИзмененияДоКорректировки КАК ИзмененияДоКорректировки,
	|	ИзмененияВТоварахРазвернуто.ИзмененияДоИсправления КАК ИзмененияДоИсправления
	|ПОМЕСТИТЬ ИзмененияВТоварах
	|ИЗ
	|	ИзмененияВТоварахРазвернуто КАК ИзмененияВТоварахРазвернуто";
	
	// Табличные части Товары (до корректировки, до исправления, после исправления)
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ТоварыИсходнойРеализации.Номенклатура КАК Номенклатура,
	|	ТоварыИсходнойРеализации.Характеристика КАК Характеристика,
	|	ТоварыИсходнойРеализации.Серия КАК Серия,
	|	ТоварыИсходнойРеализации.Упаковка КАК Упаковка,
	|	ТоварыИсходнойРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыИсходнойРеализации.НомерГТД КАК НомерГТД,
	|	ЕСТЬNULL(ТоварыИсходнойРеализации.ТипЗапасов, ВЫБОР
	|			КОГДА ТоварыИсходнойРеализации.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ЗНАЧЕНИЕ(перечисление.ТипыЗапасов.Товар)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ТипЗапасов,
	|	СУММА(ТоварыИсходнойРеализации.Количество) КАК Количество,
	|	СУММА(ТоварыИсходнойРеализации.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ТоварыИсходнойРеализации.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
	|	СУММА(ТоварыИсходнойРеализации.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ТоварыИсходнойРеализации.СуммаНДС) КАК СуммаНДС,
	|	ЛОЖЬ КАК ИзмененияДоКорректировки,
	|	ЛОЖЬ КАК ИзмененияДоИсправления
	|ПОМЕСТИТЬ ТоварыДоКорректировкиРазвернуто
	|ИЗ
	|	ТоварыИсходнойРеализации КАК ТоварыИсходнойРеализации
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ТоварыИсходнойРеализации.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА ИСТИНА
	|		КОГДА ТоварыИсходнойРеализации.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ &ВернутьМногооборотнуюТару
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыИсходнойРеализации.Номенклатура,
	|	ТоварыИсходнойРеализации.Характеристика,
	|	ТоварыИсходнойРеализации.НомерГТД,
	|	ТоварыИсходнойРеализации.Серия,
	|	ТоварыИсходнойРеализации.Упаковка,
	|	ЕСТЬNULL(ТоварыИсходнойРеализации.ТипЗапасов, ВЫБОР
	|			КОГДА ТоварыИсходнойРеализации.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ЗНАЧЕНИЕ(перечисление.ТипыЗапасов.Товар)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ),
	|	ТоварыИсходнойРеализации.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИзмененияВТоварах.Номенклатура,
	|	ИзмененияВТоварах.Характеристика,
	|	ИзмененияВТоварах.Серия,
	|	ИзмененияВТоварах.Упаковка,
	|	ИзмененияВТоварах.СтавкаНДС,
	|	ИзмененияВТоварах.НомерГТД,
	|	ИзмененияВТоварах.ТипЗапасов,
	|	СУММА(ИзмененияВТоварах.Количество),
	|	СУММА(ИзмененияВТоварах.КоличествоУпаковок),
	|	СУММА(ИзмененияВТоварах.КоличествоПоРНПТ),
	|	СУММА(ИзмененияВТоварах.СуммаСНДС),
	|	СУММА(ИзмененияВТоварах.СуммаНДС),
	|	ИзмененияВТоварах.ИзмененияДоКорректировки,
	|	ИзмененияВТоварах.ИзмененияДоИсправления
	|ИЗ
	|	ИзмененияВТоварах КАК ИзмененияВТоварах
	|ГДЕ
	|	ИзмененияВТоварах.ИзмененияДоКорректировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененияВТоварах.Номенклатура,
	|	ИзмененияВТоварах.Характеристика,
	|	ИзмененияВТоварах.Серия,
	|	ИзмененияВТоварах.Упаковка,
	|	ИзмененияВТоварах.НомерГТД,
	|	ИзмененияВТоварах.СтавкаНДС,
	|	ИзмененияВТоварах.ИзмененияДоКорректировки,
	|	ИзмененияВТоварах.ИзмененияДоИсправления,
	|	ИзмененияВТоварах.ТипЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	СтавкаНДС,
	|	НомерГТД,
	|	ТипЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДоКорректировкиРазвернуто.Номенклатура КАК Номенклатура,
	|	ТоварыДоКорректировкиРазвернуто.Характеристика КАК Характеристика,
	|	ТоварыДоКорректировкиРазвернуто.Серия КАК Серия,
	|	ТоварыДоКорректировкиРазвернуто.Упаковка КАК Упаковка,
	|	ТоварыДоКорректировкиРазвернуто.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыДоКорректировкиРазвернуто.НомерГТД КАК НомерГТД,
	|	ТоварыДоКорректировкиРазвернуто.ТипЗапасов КАК ТипЗапасов,
	|	СУММА(ТоварыДоКорректировкиРазвернуто.Количество) КАК Количество,
	|	СУММА(ТоварыДоКорректировкиРазвернуто.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ТоварыДоКорректировкиРазвернуто.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
	|	СУММА(ТоварыДоКорректировкиРазвернуто.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ТоварыДоКорректировкиРазвернуто.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ТоварыДоКорректировки
	|ИЗ
	|	ТоварыДоКорректировкиРазвернуто КАК ТоварыДоКорректировкиРазвернуто
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДоКорректировкиРазвернуто.Номенклатура,
	|	ТоварыДоКорректировкиРазвернуто.Характеристика,
	|	ТоварыДоКорректировкиРазвернуто.СтавкаНДС,
	|	ТоварыДоКорректировкиРазвернуто.НомерГТД,
	|	ТоварыДоКорректировкиРазвернуто.ТипЗапасов,
	|	ТоварыДоКорректировкиРазвернуто.Серия,
	|	ТоварыДоКорректировкиРазвернуто.Упаковка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	СтавкаНДС,
	|	НомерГТД,
	|	ТипЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыИсходнойРеализации.Номенклатура КАК Номенклатура,
	|	ТоварыИсходнойРеализации.Характеристика КАК Характеристика,
	|	ТоварыИсходнойРеализации.Серия КАК Серия,
	|	ТоварыИсходнойРеализации.Упаковка КАК Упаковка,
	|	ТоварыИсходнойРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыИсходнойРеализации.НомерГТД КАК НомерГТД,
	|	ЕСТЬNULL(ТоварыИсходнойРеализации.ТипЗапасов, ВЫБОР
	|			КОГДА ТоварыИсходнойРеализации.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ЗНАЧЕНИЕ(перечисление.ТипыЗапасов.Товар)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ТипЗапасов,
	|	СУММА(ТоварыИсходнойРеализации.Количество) КАК Количество,
	|	СУММА(ТоварыИсходнойРеализации.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ТоварыИсходнойРеализации.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
	|	СУММА(ТоварыИсходнойРеализации.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ТоварыИсходнойРеализации.СуммаНДС) КАК СуммаНДС,
	|	ЛОЖЬ КАК ИзмененияДоКорректировки,
	|	ЛОЖЬ КАК ИзмененияДоИсправления
	|ПОМЕСТИТЬ ТоварыДоИсправленияРазвернуто
	|ИЗ
	|	ТоварыИсходнойРеализации КАК ТоварыИсходнойРеализации
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТоварыИсходнойРеализации.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ИСТИНА
	|			КОГДА ТоварыИсходнойРеализации.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|					И НЕ &ВернутьМногооборотнуюТару
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|   И НЕ ТоварыИсходнойРеализации.ВариантОтражения В(&ВариантыОтражения)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыИсходнойРеализации.Номенклатура,
	|	ТоварыИсходнойРеализации.Характеристика,
	|	ТоварыИсходнойРеализации.НомерГТД,
	|	ТоварыИсходнойРеализации.Серия,
	|	ТоварыИсходнойРеализации.Упаковка,
	|	ЕСТЬNULL(ТоварыИсходнойРеализации.ТипЗапасов, ВЫБОР
	|			КОГДА ТоварыИсходнойРеализации.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ЗНАЧЕНИЕ(перечисление.ТипыЗапасов.Товар)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ),
	|	ТоварыИсходнойРеализации.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИзмененияВТоварах.Номенклатура,
	|	ИзмененияВТоварах.Характеристика,
	|	ИзмененияВТоварах.Серия,
	|	ИзмененияВТоварах.Упаковка,
	|	ИзмененияВТоварах.СтавкаНДС,
	|	ИзмененияВТоварах.НомерГТД,
	|	ИзмененияВТоварах.ТипЗапасов,
	|	СУММА(ИзмененияВТоварах.Количество),
	|	СУММА(ИзмененияВТоварах.КоличествоУпаковок),
	|	СУММА(ИзмененияВТоварах.КоличествоПоРНПТ),
	|	СУММА(ИзмененияВТоварах.СуммаСНДС),
	|	СУММА(ИзмененияВТоварах.СуммаНДС),
	|	ИзмененияВТоварах.ИзмененияДоКорректировки,
	|	ИзмененияВТоварах.ИзмененияДоИсправления
	|ИЗ
	|	ИзмененияВТоварах КАК ИзмененияВТоварах
	|ГДЕ
	|	ИзмененияВТоварах.ИзмененияДоИсправления
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененияВТоварах.Номенклатура,
	|	ИзмененияВТоварах.Характеристика,
	|	ИзмененияВТоварах.Серия,
	|	ИзмененияВТоварах.Упаковка,
	|	ИзмененияВТоварах.НомерГТД,
	|	ИзмененияВТоварах.СтавкаНДС,
	|	ИзмененияВТоварах.ТипЗапасов,
	|	ИзмененияВТоварах.ИзмененияДоКорректировки,
	|	ИзмененияВТоварах.ИзмененияДоИсправления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	СтавкаНДС,
	|	НомерГТД,
	|	ТипЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДоИсправленияРазвернуто.Номенклатура КАК Номенклатура,
	|	ТоварыДоИсправленияРазвернуто.Характеристика КАК Характеристика,
	|	ТоварыДоИсправленияРазвернуто.Серия КАК Серия,
	|	ТоварыДоИсправленияРазвернуто.Упаковка КАК Упаковка,
	|	ТоварыДоИсправленияРазвернуто.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыДоИсправленияРазвернуто.НомерГТД КАК НомерГТД,
	|	ТоварыДоИсправленияРазвернуто.ТипЗапасов КАК ТипЗапасов,
	|	СУММА(ТоварыДоИсправленияРазвернуто.Количество) КАК Количество,
	|	СУММА(ТоварыДоИсправленияРазвернуто.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ТоварыДоИсправленияРазвернуто.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
	|	СУММА(ТоварыДоИсправленияРазвернуто.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ТоварыДоИсправленияРазвернуто.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ТоварыДоИсправления
	|ИЗ
	|	ТоварыДоИсправленияРазвернуто КАК ТоварыДоИсправленияРазвернуто
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДоИсправленияРазвернуто.Номенклатура,
	|	ТоварыДоИсправленияРазвернуто.Характеристика,
	|	ТоварыДоИсправленияРазвернуто.СтавкаНДС,
	|	ТоварыДоИсправленияРазвернуто.НомерГТД,
	|	ТоварыДоИсправленияРазвернуто.ТипЗапасов,
	|	ТоварыДоИсправленияРазвернуто.Серия,
	|	ТоварыДоИсправленияРазвернуто.Упаковка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	СтавкаНДС,
	|	НомерГТД,
	|	ТипЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыИсходнойРеализации.Номенклатура КАК Номенклатура,
	|	ТоварыИсходнойРеализации.Характеристика КАК Характеристика,
	|	ТоварыИсходнойРеализации.Серия КАК Серия,
	|	ТоварыИсходнойРеализации.Упаковка КАК Упаковка,
	|	ТоварыИсходнойРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыИсходнойРеализации.НомерГТД КАК НомерГТД,
	|	ТоварыИсходнойРеализации.ТипЗапасов КАК ТипЗапасов,
	|	ТоварыИсходнойРеализации.Количество КАК Количество,
	|	ТоварыИсходнойРеализации.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТоварыИсходнойРеализации.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	ТоварыИсходнойРеализации.СуммаСНДС КАК СуммаСНДС,
	|	ТоварыИсходнойРеализации.СуммаНДС КАК СуммаНДС,
	|	ЛОЖЬ КАК ИзмененияДоКорректировки,
	|	ЛОЖЬ КАК ИзмененияДоИсправления
	|ПОМЕСТИТЬ ТоварыКонечныеРазвернуто
	|ИЗ
	|	ТоварыИсходнойРеализации КАК ТоварыИсходнойРеализации 
	|ГДЕ  
	|	НЕ ТоварыИсходнойРеализации.ВариантОтражения В(&ВариантыОтражения)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыИсходнойРеализации.Номенклатура,
	|	ТоварыИсходнойРеализации.Характеристика,
	|	ТоварыИсходнойРеализации.НомерГТД,
	|	ТоварыИсходнойРеализации.ТипЗапасов,
	|	ТоварыИсходнойРеализации.Серия,
	|	ТоварыИсходнойРеализации.Упаковка,
	|	ТоварыИсходнойРеализации.Количество,
	|	ТоварыИсходнойРеализации.КоличествоУпаковок,
	|	ТоварыИсходнойРеализации.КоличествоПоРНПТ,
	|	ТоварыИсходнойРеализации.СуммаСНДС,
	|	ТоварыИсходнойРеализации.СуммаНДС,
	|	ТоварыИсходнойРеализации.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИзмененияВТоварах.Номенклатура,
	|	ИзмененияВТоварах.Характеристика,
	|	ИзмененияВТоварах.Серия,
	|	ИзмененияВТоварах.Упаковка,
	|	ИзмененияВТоварах.СтавкаНДС,
	|	ИзмененияВТоварах.НомерГТД,
	|	ИзмененияВТоварах.ТипЗапасов,
	|	ИзмененияВТоварах.Количество,
	|	ИзмененияВТоварах.КоличествоУпаковок,
	|	ИзмененияВТоварах.КоличествоПоРНПТ,
	|	ИзмененияВТоварах.СуммаСНДС,
	|	ИзмененияВТоварах.СуммаНДС,
	|	ИзмененияВТоварах.ИзмененияДоКорректировки,
	|	ИзмененияВТоварах.ИзмененияДоИсправления
	|ИЗ
	|	ИзмененияВТоварах КАК ИзмененияВТоварах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	СтавкаНДС,
	|	НомерГТД,
	|	ТипЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонечныеРазвернуто.Номенклатура КАК Номенклатура,
	|	ТоварыКонечныеРазвернуто.Характеристика КАК Характеристика,
	|	ТоварыКонечныеРазвернуто.Серия КАК Серия,
	|	ТоварыКонечныеРазвернуто.Упаковка КАК Упаковка,
	|	ТоварыКонечныеРазвернуто.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыКонечныеРазвернуто.НомерГТД КАК НомерГТД,
	|	ТоварыКонечныеРазвернуто.ТипЗапасов КАК ТипЗапасов,
	|	СУММА(ТоварыКонечныеРазвернуто.Количество) КАК Количество,
	|	СУММА(ТоварыКонечныеРазвернуто.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ТоварыКонечныеРазвернуто.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
	|	СУММА(ТоварыКонечныеРазвернуто.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ТоварыКонечныеРазвернуто.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ТоварыКонечные
	|ИЗ
	|	ТоварыКонечныеРазвернуто КАК ТоварыКонечныеРазвернуто
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКонечныеРазвернуто.Номенклатура,
	|	ТоварыКонечныеРазвернуто.Характеристика,
	|	ТоварыКонечныеРазвернуто.СтавкаНДС,
	|	ТоварыКонечныеРазвернуто.ТипЗапасов,
	|	ТоварыКонечныеРазвернуто.Серия,  
	|	ТоварыКонечныеРазвернуто.НомерГТД,
	|	ТоварыКонечныеРазвернуто.Упаковка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	СтавкаНДС,
	|	НомерГТД,
	|	ТипЗапасов";
	
	// Результирующая табличная часть Товары
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Упаковка КАК Упаковка,
	|	"""" КАК Содержание,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ НомераСтрокРазвернутые
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО Товары.Ссылка = ИсправляемыйДокумент.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	Услуги.Содержание,
	|	Услуги.НомерСтроки
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО Услуги.Ссылка = ИсправляемыйДокумент.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Упаковка,
	|	Товары.Содержание,
	|	Товары.НомерСтроки
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО Товары.Ссылка = ИсправляемыйДокумент.Ссылка 
	|	
	|ОБЪЕДИНИТЬ ВСЕ 
	|	
	|ВЫБРАТЬ
	|	ТоварыКорректировкиВводаОстатков.Номенклатура,
	|	ТоварыКорректировкиВводаОстатков.Характеристика,
	|	ТоварыКорректировкиВводаОстатков.Серия,
	|	ТоварыКорректировкиВводаОстатков.Упаковка,
	|	ТоварыКорректировкиВводаОстатков.Номенклатура.Наименование,
	|	ТоварыКорректировкиВводаОстатков.НомерСтроки
	|ИЗ
	|	ТоварыКорректировкиВводаОстатков КАК ТоварыКорректировкиВводаОстатков 
	|ГДЕ
	|	ТоварыКорректировкиВводаОстатков.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокРазвернутые.Номенклатура КАК Номенклатура,
	|	НомераСтрокРазвернутые.Содержание КАК Содержание,
	|	МАКСИМУМ(НомераСтрокРазвернутые.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ НомераСтрок
	|ИЗ
	|	НомераСтрокРазвернутые КАК НомераСтрокРазвернутые
	|
	|СГРУППИРОВАТЬ ПО
	|	НомераСтрокРазвернутые.Номенклатура,
	|	НомераСтрокРазвернутые.Содержание
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомераСтрокРазвернутые.Номенклатура,
	|	НомераСтрокРазвернутые.Содержание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Серия КАК Серия,
	|	Т.Упаковка КАК Упаковка,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.НомерГТД КАК НомерГТД,
	|	Т.ТипЗапасов КАК ТипЗапасов,
	|	МАКСИМУМ(Т.ТоварыИсправляемогоДокумента_Количество) КАК ТоварыИсправляемогоДокумента_Количество,
	|	МАКСИМУМ(Т.ТоварыИсправляемогоДокумента_КоличествоУпаковок) КАК ТоварыИсправляемогоДокумента_КоличествоУпаковок,
	|	МАКСИМУМ(Т.ТоварыИсправляемогоДокумента_КоличествоПоРНПТ) КАК ТоварыИсправляемогоДокумента_КоличествоПоРНПТ,
	|	МАКСИМУМ(Т.ТоварыИсправляемогоДокумента_Сумма) КАК ТоварыИсправляемогоДокумента_Сумма,
	|	МАКСИМУМ(Т.ТоварыИсправляемогоДокумента_СуммаНДС) КАК ТоварыИсправляемогоДокумента_СуммаНДС,
	|	МАКСИМУМ(Т.ТоварыИсправляемогоДокумента_СуммаСНДС) КАК ТоварыИсправляемогоДокумента_СуммаСНДС,
	|	МАКСИМУМ(Т.ТоварыИсправительногоДокумента_Количество) КАК ТоварыИсправительногоДокумента_Количество,
	|	МАКСИМУМ(Т.ТоварыИсправительногоДокумента_КоличествоУпаковок) КАК ТоварыИсправительногоДокумента_КоличествоУпаковок,
	|	МАКСИМУМ(Т.ТоварыИсправительногоДокумента_КоличествоПоРНПТ) КАК ТоварыИсправительногоДокумента_КоличествоПоРНПТ,
	|	МАКСИМУМ(Т.ТоварыИсправительногоДокумента_Сумма) КАК ТоварыИсправительногоДокумента_Сумма,
	|	МАКСИМУМ(Т.ТоварыИсправительногоДокумента_СуммаНДС) КАК ТоварыИсправительногоДокумента_СуммаНДС,
	|	МАКСИМУМ(Т.ТоварыИсправительногоДокумента_СуммаСНДС) КАК ТоварыИсправительногоДокумента_СуммаСНДС,
	|	МАКСИМУМ(Т.ТоварыДокументаДоКорректировки_Количество) КАК ТоварыДокументаДоКорректировки_Количество,
	|	МАКСИМУМ(Т.ТоварыДокументаДоКорректировки_КоличествоУпаковок) КАК ТоварыДокументаДоКорректировки_КоличествоУпаковок,
	|	МАКСИМУМ(Т.ТоварыДокументаДоКорректировки_КоличествоПоРНПТ) КАК ТоварыДокументаДоКорректировки_КоличествоПоРНПТ,
	|	МАКСИМУМ(Т.ТоварыДокументаДоКорректировки_Сумма) КАК ТоварыДокументаДоКорректировки_Сумма,
	|	МАКСИМУМ(Т.ТоварыДокументаДоКорректировки_СуммаНДС) КАК ТоварыДокументаДоКорректировки_СуммаНДС,
	|	МАКСИМУМ(Т.ТоварыДокументаДоКорректировки_СуммаСНДС) КАК ТоварыДокументаДоКорректировки_СуммаСНДС
	|ПОМЕСТИТЬ РезультатСопоставленияТоваровВрем
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыИсправляемогоДокумента.Номенклатура КАК Номенклатура,
	|		ТоварыИсправляемогоДокумента.Характеристика КАК Характеристика,
	|		ТоварыИсправляемогоДокумента.Серия КАК Серия,
	|		ТоварыИсправляемогоДокумента.Упаковка КАК Упаковка,
	|		ТоварыИсправляемогоДокумента.СтавкаНДС КАК СтавкаНДС,
	|		ЕСТЬNULL(ТоварыИсправляемогоДокумента.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)) КАК НомерГТД,
	|		ТоварыИсправляемогоДокумента.ТипЗапасов КАК ТипЗапасов,
	|		ТоварыИсправляемогоДокумента.Количество КАК ТоварыИсправляемогоДокумента_Количество,
	|		ТоварыИсправляемогоДокумента.КоличествоУпаковок КАК ТоварыИсправляемогоДокумента_КоличествоУпаковок,
	|		ТоварыИсправляемогоДокумента.КоличествоПоРНПТ КАК ТоварыИсправляемогоДокумента_КоличествоПоРНПТ,
	|		ВЫБОР
	|			КОГДА &ЦенаВключаетНДС
	|				ТОГДА ТоварыИсправляемогоДокумента.СуммаСНДС
	|			ИНАЧЕ ТоварыИсправляемогоДокумента.СуммаСНДС - ТоварыИсправляемогоДокумента.СуммаНДС
	|		КОНЕЦ КАК ТоварыИсправляемогоДокумента_Сумма,
	|		ТоварыИсправляемогоДокумента.СуммаНДС КАК ТоварыИсправляемогоДокумента_СуммаНДС,
	|		ТоварыИсправляемогоДокумента.СуммаСНДС КАК ТоварыИсправляемогоДокумента_СуммаСНДС,
	|		0 КАК ТоварыИсправительногоДокумента_Количество,
	|		0 КАК ТоварыИсправительногоДокумента_КоличествоУпаковок,
	|		0 КАК ТоварыИсправительногоДокумента_КоличествоПоРНПТ,
	|		0 КАК ТоварыИсправительногоДокумента_Сумма,
	|		0 КАК ТоварыИсправительногоДокумента_СуммаСНДС,
	|		0 КАК ТоварыИсправительногоДокумента_СуммаНДС,
	|		0 КАК ТоварыДокументаДоКорректировки_Количество,
	|		0 КАК ТоварыДокументаДоКорректировки_КоличествоУпаковок,
	|		0 КАК ТоварыДокументаДоКорректировки_КоличествоПоРНПТ,
	|		0 КАК ТоварыДокументаДоКорректировки_Сумма,
	|		0 КАК ТоварыДокументаДоКорректировки_СуммаНДС,
	|		0 КАК ТоварыДокументаДоКорректировки_СуммаСНДС
	|		ИЗ
	|		ТоварыДоИсправления КАК ТоварыИсправляемогоДокумента
	|		ОБЪЕДИНИТЬ ВСЕ
	|		ВЫБРАТЬ
	|		ТоварыИсправительногоДокумента.Номенклатура,
	|		ТоварыИсправительногоДокумента.Характеристика,
	|		ТоварыИсправительногоДокумента.Серия,
	|		ТоварыИсправительногоДокумента.Упаковка,
	|		ТоварыИсправительногоДокумента.СтавкаНДС,
	|		ЕСТЬNULL(ТоварыИсправительногоДокумента.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)),
	|		ТоварыИсправительногоДокумента.ТипЗапасов,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ТоварыИсправительногоДокумента.Количество,
	|		ТоварыИсправительногоДокумента.КоличествоУпаковок,
	|		ТоварыИсправительногоДокумента.КоличествоПоРНПТ,
	|		ВЫБОР
	|			КОГДА &ЦенаВключаетНДС
	|				ТОГДА ТоварыИсправительногоДокумента.СуммаСНДС
	|			ИНАЧЕ ТоварыИсправительногоДокумента.СуммаСНДС - ТоварыИсправительногоДокумента.СуммаНДС
	|		КОНЕЦ,
	|		ТоварыИсправительногоДокумента.СуммаСНДС,
	|		ТоварыИсправительногоДокумента.СуммаНДС,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|		ИЗ
	|		ТоварыКонечные КАК ТоварыИсправительногоДокумента
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТоварыДокументаДоКорректировки.Номенклатура,
	|		ТоварыДокументаДоКорректировки.Характеристика,
	|		ТоварыДокументаДоКорректировки.Серия,
	|		ТоварыДокументаДоКорректировки.Упаковка,
	|		ТоварыДокументаДоКорректировки.СтавкаНДС,
	|		ЕСТЬNULL(ТоварыДокументаДоКорректировки.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)),
	|		ТоварыДокументаДоКорректировки.ТипЗапасов,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ТоварыДокументаДоКорректировки.Количество,
	|		ТоварыДокументаДоКорректировки.КоличествоУпаковок,
	|		ТоварыДокументаДоКорректировки.КоличествоПоРНПТ,
	|		ВЫБОР
	|			КОГДА &ЦенаВключаетНДС
	|				ТОГДА ТоварыДокументаДоКорректировки.СуммаСНДС
	|			ИНАЧЕ ТоварыДокументаДоКорректировки.СуммаСНДС - ТоварыДокументаДоКорректировки.СуммаНДС
	|		КОНЕЦ,
	|		ТоварыДокументаДоКорректировки.СуммаНДС,
	|		ТоварыДокументаДоКорректировки.СуммаСНДС
	|		ИЗ
	|		ТоварыДоКорректировки КАК ТоварыДокументаДоКорректировки) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтавкаНДС,
	|	Т.НомерГТД,
	|	Т.ТипЗапасов,
	|	Т.Серия,
	|	Т.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатСопоставленияТоваровВрем.Номенклатура КАК Номенклатура,
	|	РезультатСопоставленияТоваровВрем.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РезультатСопоставленияТоваровВрем.Характеристика КАК Характеристика,
	|	РезультатСопоставленияТоваровВрем.Серия КАК Серия,
	|	РезультатСопоставленияТоваровВрем.Упаковка КАК Упаковка,
	|	РезультатСопоставленияТоваровВрем.СтавкаНДС КАК СтавкаНДС,
	|	РезультатСопоставленияТоваровВрем.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА РезультатСопоставленияТоваровВрем.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ""ТоварыНаСкладе""
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчета,
	|	РезультатСопоставленияТоваровВрем.ТоварыДокументаДоКорректировки_Количество КАК КоличествоДоКорректировки,
	|	РезультатСопоставленияТоваровВрем.ТоварыДокументаДоКорректировки_КоличествоУпаковок КАК КоличествоУпаковокДоКорректировки,
	|	РезультатСопоставленияТоваровВрем.ТоварыДокументаДоКорректировки_КоличествоПоРНПТ КАК КоличествоПоРНПТДоКорректировки,
	|	РезультатСопоставленияТоваровВрем.ТоварыДокументаДоКорректировки_СуммаСНДС - ВЫБОР
	|		КОГДА &ЦенаВключаетНДС
	|			ТОГДА 0
	|		ИНАЧЕ РезультатСопоставленияТоваровВрем.ТоварыДокументаДоКорректировки_СуммаНДС
	|	КОНЕЦ КАК СуммаДоКорректировки,
	|	РезультатСопоставленияТоваровВрем.ТоварыДокументаДоКорректировки_СуммаНДС КАК СуммаНДСДоКорректировки,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправляемогоДокумента_Количество КАК КоличествоДоИзменения,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправляемогоДокумента_КоличествоУпаковок КАК КоличествоУпаковокДоИзменения,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправляемогоДокумента_КоличествоПоРНПТ КАК КоличествоПоРНПТДоИзменения,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправляемогоДокумента_СуммаСНДС - ВЫБОР
	|		КОГДА &ЦенаВключаетНДС
	|			ТОГДА 0
	|		ИНАЧЕ РезультатСопоставленияТоваровВрем.ТоварыИсправляемогоДокумента_СуммаНДС
	|	КОНЕЦ КАК СуммаДоИзменения,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправляемогоДокумента_СуммаНДС КАК СуммаНДСДоИзменения,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправительногоДокумента_СуммаСНДС КАК СуммаСНДС,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправительногоДокумента_Количество КАК Количество,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправительногоДокумента_КоличествоУпаковок КАК КоличествоУпаковок,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправительногоДокумента_КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправительногоДокумента_СуммаСНДС - ВЫБОР
	|		КОГДА &ЦенаВключаетНДС
	|			ТОГДА 0
	|		ИНАЧЕ РезультатСопоставленияТоваровВрем.ТоварыИсправительногоДокумента_СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	РезультатСопоставленияТоваровВрем.ТоварыИсправительногоДокумента_СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА РезультатСопоставленияТоваровВрем.ТоварыИсправляемогоДокумента_СуммаСНДС ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьВДокументеПоступленияРеализации
	|ПОМЕСТИТЬ РезультатСопоставленияТоваров
	|ИЗ
	|	РезультатСопоставленияТоваровВрем КАК РезультатСопоставленияТоваровВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатСопоставления.Номенклатура КАК Номенклатура,
	|	&ТекстЗапросаХарактеристика,
	|	&ТекстЗапросаУпаковка,
	|	&ТекстЗапросаСерия,
	|	&ТекстЗапросаГТД,
	|	&ТекстЗапросаГТДДоИзменения,
	|	&ТекстЗапросаРНПТ,
	|	&ТекстЗапросаРНПТДоКорректировки,
	|	&ТекстЗапросаРНПТДоИзменения,
	|	РезультатСопоставления.СтавкаНДС КАК СтавкаНДС,
	|	РезультатСопоставления.СтавкаНДС КАК СтавкаНДСДоИзменения,
	|	ЕСТЬNULL(РезультатСопоставления.КоличествоДоКорректировки,0) КАК КоличествоДоКорректировки,
	|	ЕСТЬNULL(РезультатСопоставления.КоличествоДоИзменения,0) КАК КоличествоДоИзменения,
	|	РезультатСопоставления.Количество КАК Количество,
	|	ЕСТЬNULL(РезультатСопоставления.КоличествоУпаковокДоКорректировки,0) КАК КоличествоУпаковокДоКорректировки,
	|	ЕСТЬNULL(РезультатСопоставления.КоличествоУпаковокДоИзменения,0) КАК КоличествоУпаковокДоИзменения,
	|	РезультатСопоставления.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЕСТЬNULL(РезультатСопоставления.СуммаДоКорректировки,0) КАК СуммаДоКорректировки,
	|	ЕСТЬNULL(РезультатСопоставления.СуммаДоИзменения,0) КАК СуммаДоИзменения,
	|	РезультатСопоставления.Сумма КАК Сумма,
	|	ЕСТЬNULL(РезультатСопоставления.СуммаНДСДоИзменения,0) КАК СуммаНДСДоИзменения,
	|	ЕСТЬNULL(РезультатСопоставления.СуммаНДС,0) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РезультатСопоставления.КоличествоДоКорректировки, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатСопоставления.СуммаДоКорректировки / РезультатСопоставления.КоличествоДоКорректировки < 0.01
	|					ТОГДА 0.01
	|				ИНАЧЕ ВЫРАЗИТЬ(РезультатСопоставления.СуммаДоКорректировки / РезультатСопоставления.КоличествоДоКорректировки КАК ЧИСЛО(31, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДоКорректировки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РезультатСопоставления.КоличествоДоИзменения, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатСопоставления.СуммаДоИзменения / РезультатСопоставления.КоличествоДоИзменения < 0.01
	|					ТОГДА 0.01
	|				ИНАЧЕ ВЫРАЗИТЬ(РезультатСопоставления.СуммаДоИзменения / РезультатСопоставления.КоличествоДоИзменения КАК ЧИСЛО(31, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДоИзменения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РезультатСопоставления.Количество, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатСопоставления.Сумма / РезультатСопоставления.Количество < 0.01
	|					ТОГДА 0.01
	|				ИНАЧЕ ВЫРАЗИТЬ(РезультатСопоставления.Сумма / РезультатСопоставления.Количество КАК ЧИСЛО(31, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ЕстьNull(НомераСтрок.НомерСтроки, 0) КАК НомерСтрокиДокумента,
	|	РезультатСопоставления.ЕстьВДокументеПоступленияРеализации КАК ЕстьВДокументеПоступленияРеализации
	|ИЗ
	|	РезультатСопоставленияТоваров КАК РезультатСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрок КАК НомераСтрок
	|		ПО РезультатСопоставления.Номенклатура = НомераСтрок.Номенклатура
	|    ГДЕ
	|    (РезультатСопоставления.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|    		ИЛИ РезультатСопоставления.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|    			И НЕ &ВернутьМногооборотнуюТару)
	|УПОРЯДОЧИТЬ ПО
	|	РезультатСопоставления.ЕстьВДокументеПоступленияРеализации УБЫВ,
	|	ЕстьNull(НомераСтрок.НомерСтроки, 0)";
	
	// Табличные части Услуги (до корректировки, до исправления, после исправления)
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	"""" КАК Содержание,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.СуммаНДС
	|ПОМЕСТИТЬ УслугиДоКорректировкиРазвернутые
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументДоКорректировки КАК ДокументДоКорректировки
	|		ПО Товары.Ссылка = ДокументДоКорректировки.Ссылка
	|			И (Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	#Вставка
	| И не Товары.Ссылка.РаспределитьТранспортные
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Услуги.Номенклатура,
	|	Услуги.Содержание,
	|	Услуги.СтавкаНДС,
	|	Услуги.Количество,
	|	Услуги.Сумма,
	|	Услуги.СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументДоКорректировки КАК ДокументДоКорректировки
	|		ПО Услуги.Ссылка = ДокументДоКорректировки.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПустаяНоменклатура,
	|	Услуги.Содержание,
	|	Услуги.СтавкаНДС,
	|	Услуги.Количество,
	|	Услуги.Сумма,
	|	Услуги.СуммаНДС
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов.Доходы КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументДоКорректировки КАК ДокументДоКорректировки
	|		ПО Услуги.Ссылка = ДокументДоКорректировки.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Содержание,
	|	Товары.СтавкаНДС,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументДоКорректировки КАК ДокументДоКорректировки
	|		ПО Товары.Ссылка = ДокументДоКорректировки.Ссылка
	|			И (Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|				ИЛИ &РеализацияУслуг)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКорректировкиВводаОстатков.Номенклатура,
	|	ТоварыКорректировкиВводаОстатков.Номенклатура.Наименование,
	|	ТоварыКорректировкиВводаОстатков.СтавкаНДС,
	|	ТоварыКорректировкиВводаОстатков.Количество,
	|	ТоварыКорректировкиВводаОстатков.Сумма,
	|	ТоварыКорректировкиВводаОстатков.СуммаНДС
	|ИЗ
	|	ТоварыКорректировкиВводаОстатков КАК ТоварыКорректировкиВводаОстатков
	|ГДЕ
	|	(ТоварыКорректировкиВводаОстатков.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИЛИ ТоварыКорректировкиВводаОстатков.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДоКорректировкиРазвернутые.Номенклатура,
	|	УслугиДоКорректировкиРазвернутые.Содержание,
	|	УслугиДоКорректировкиРазвернутые.СтавкаНДС,
	|	СУММА(УслугиДоКорректировкиРазвернутые.Количество) КАК Количество,
	|	СУММА(УслугиДоКорректировкиРазвернутые.Сумма) КАК Сумма,
	|	СУММА(УслугиДоКорректировкиРазвернутые.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ УслугиДоКорректировки
	|ИЗ
	|	УслугиДоКорректировкиРазвернутые КАК УслугиДоКорректировкиРазвернутые
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиДоКорректировкиРазвернутые.Номенклатура,
	|	УслугиДоКорректировкиРазвернутые.Содержание,
	|	УслугиДоКорректировкиРазвернутые.СтавкаНДС 
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	"""" КАК Содержание,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.СуммаСНДС,
	|	Товары.СуммаНДС
	|ПОМЕСТИТЬ УслугиДоИсправленияРазвернутые
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО Товары.Ссылка = ИсправляемыйДокумент.Ссылка
	|			И (Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	#Вставка
	| И не Товары.Ссылка.РаспределитьТранспортные
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Услуги.Номенклатура,
	|	Услуги.Содержание,
	|	Услуги.СтавкаНДС,
	|	Услуги.Количество,
	|	Услуги.Сумма,
	|	Услуги.СуммаСНДС,
	|	Услуги.СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО Услуги.Ссылка = ИсправляемыйДокумент.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПустаяНоменклатура,
	|	Услуги.Содержание,
	|	Услуги.СтавкаНДС,
	|	Услуги.Количество,
	|	Услуги.Сумма,
	|	Услуги.СуммаСНДС,
	|	Услуги.СуммаНДС
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов.Доходы КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО Услуги.Ссылка = ИсправляемыйДокумент.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Содержание,
	|	Товары.СтавкаНДС,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.СуммаСНДС,
	|	Товары.СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ПО Товары.Ссылка = ИсправляемыйДокумент.Ссылка
	|			И (Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|				ИЛИ &РеализацияУслуг)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКорректировкиВводаОстатков.Номенклатура,
	|	ТоварыКорректировкиВводаОстатков.Номенклатура.Наименование,
	|	ТоварыКорректировкиВводаОстатков.СтавкаНДС,
	|	ТоварыКорректировкиВводаОстатков.Количество,
	|	ТоварыКорректировкиВводаОстатков.Сумма,
	|	ТоварыКорректировкиВводаОстатков.СуммаСНДС,
	|	ТоварыКорректировкиВводаОстатков.СуммаНДС
	|ИЗ
	|	ИсправляемыйДокумент КАК ИсправляемыйДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыКорректировкиВводаОстатков КАК ТоварыКорректировкиВводаОстатков
	|		ПО (ТоварыКорректировкиВводаОстатков.Ссылка = ИсправляемыйДокумент.Ссылка
	|					И ТоварыКорректировкиВводаОстатков.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ ТоварыКорректировкиВводаОстатков.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДоИсправленияРазвернутые.Номенклатура,
	|	УслугиДоИсправленияРазвернутые.Содержание,
	|	УслугиДоИсправленияРазвернутые.СтавкаНДС,
	|	СУММА(УслугиДоИсправленияРазвернутые.Количество) КАК Количество,
	|	СУММА(УслугиДоИсправленияРазвернутые.Сумма) КАК Сумма,
	|	СУММА(УслугиДоИсправленияРазвернутые.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(УслугиДоИсправленияРазвернутые.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ УслугиДоИсправления
	|ИЗ
	|	УслугиДоИсправленияРазвернутые КАК УслугиДоИсправленияРазвернутые
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиДоИсправленияРазвернутые.Номенклатура,
	|	УслугиДоИсправленияРазвернутые.Содержание,
	|	УслугиДоИсправленияРазвернутые.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Содержание,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(Товары.Количество) КАК Количество,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Товары.СуммаСНДС) КАК СуммаСНДС
	|ПОМЕСТИТЬ УслугиКонечные
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И (Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		ИЛИ Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		ИЛИ &РеализацияУслуг)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Содержание,
	|	Товары.СтавкаНДС";
	
	// Результирующая табличная часть Услуги
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	Т.Номенклатура,
	|	Т.Содержание,
	|	Т.СтавкаНДС,
	|	МАКСИМУМ(Т.УслугиИсправляемогоДокумента_Количество) КАК УслугиИсправляемогоДокумента_Количество,
	|	МАКСИМУМ(Т.УслугиИсправляемогоДокумента_Сумма) КАК УслугиИсправляемогоДокумента_Сумма,
	|	МАКСИМУМ(Т.УслугиИсправляемогоДокумента_СуммаНДС) КАК УслугиИсправляемогоДокумента_СуммаНДС,
	|	МАКСИМУМ(Т.УслугиИсправительногоДокумента_Количество) КАК УслугиИсправительногоДокумента_Количество,
	|	МАКСИМУМ(Т.УслугиИсправительногоДокумента_Сумма) КАК УслугиИсправительногоДокумента_Сумма,
	|	МАКСИМУМ(Т.УслугиИсправительногоДокумента_СуммаНДС) КАК УслугиИсправительногоДокумента_СуммаНДС,
	|	МАКСИМУМ(Т.УслугиИсправительногоДокумента_СуммаСНДС) КАК УслугиИсправительногоДокумента_СуммаСНДС,
	|	МАКСИМУМ(Т.УслугиДокументаДоКорректировки_Количество) КАК УслугиДокументаДоКорректировки_Количество,
	|	МАКСИМУМ(Т.УслугиДокументаДоКорректировки_Сумма) КАК УслугиДокументаДоКорректировки_Сумма,
	|	МАКСИМУМ(Т.УслугиДокументаДоКорректировки_СуммаНДС) КАК УслугиДокументаДоКорректировки_СуммаНДС
	|ПОМЕСТИТЬ РезультатСопоставленияУслугВрем
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиИсправляемогоДокумента.Номенклатура КАК Номенклатура,
	|		УслугиИсправляемогоДокумента.Содержание КАК Содержание,
	|		УслугиИсправляемогоДокумента.СтавкаНДС КАК СтавкаНДС,
	|		NULL КАК УслугиИсправляемогоДокумента_Количество,
	|		NULL КАК УслугиИсправляемогоДокумента_Сумма,
	|		NULL КАК УслугиИсправляемогоДокумента_СуммаНДС,
	|		УслугиИсправляемогоДокумента.Количество КАК УслугиИсправительногоДокумента_Количество,
	|		УслугиИсправляемогоДокумента.Сумма КАК УслугиИсправительногоДокумента_Сумма,
	|		УслугиИсправляемогоДокумента.СуммаСНДС КАК УслугиИсправительногоДокумента_СуммаСНДС,
	|		УслугиИсправляемогоДокумента.СуммаНДС КАК УслугиИсправительногоДокумента_СуммаНДС,
	|		NULL КАК УслугиДокументаДоКорректировки_Количество,
	|		NULL КАК УслугиДокументаДоКорректировки_Сумма,
	|		NULL КАК УслугиДокументаДоКорректировки_СуммаНДС
	|	ИЗ
	|		УслугиКонечные КАК УслугиИсправляемогоДокумента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УслугиИсправительногоДокумента.Номенклатура,
	|		УслугиИсправительногоДокумента.Содержание,
	|		УслугиИсправительногоДокумента.СтавкаНДС,
	|		УслугиИсправительногоДокумента.Количество,
	|		УслугиИсправительногоДокумента.Сумма,
	|		УслугиИсправительногоДокумента.СуммаНДС,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL
	|	ИЗ
	|		УслугиДоИсправления КАК УслугиИсправительногоДокумента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УслугиДокументаДоКорректировки.Номенклатура,
	|		УслугиДокументаДоКорректировки.Содержание,
	|		УслугиДокументаДоКорректировки.СтавкаНДС,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		УслугиДокументаДоКорректировки.Количество,
	|		УслугиДокументаДоКорректировки.Сумма,
	|		УслугиДокументаДоКорректировки.СуммаНДС
	|	ИЗ
	|		УслугиДоКорректировки КАК УслугиДокументаДоКорректировки) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Номенклатура,
	|	Т.Содержание,
	|	Т.СтавкаНДС
	|;
	|
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Содержание,
	|	СтавкаНДС,
	|	УслугиДокументаДоКорректировки_Количество КАК КоличествоДоКорректировки,
	|	УслугиДокументаДоКорректировки_Сумма КАК СуммаДоКорректировки,
	|	УслугиДокументаДоКорректировки_СуммаНДС КАК СуммаНДСДоКорректировки,
	|	УслугиИсправляемогоДокумента_Количество КАК КоличествоДоИзменения,
	|	УслугиИсправляемогоДокумента_Сумма КАК СуммаДоИзменения,
	|	УслугиИсправляемогоДокумента_СуммаНДС КАК СуммаНДСДоИзменения,
	|	УслугиИсправительногоДокумента_СуммаСНДС КАК СуммаСНДС,
	|	УслугиИсправительногоДокумента_Количество КАК Количество,
	|	УслугиИсправительногоДокумента_Сумма КАК Сумма,
	|	УслугиИсправительногоДокумента_СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА УслугиИсправляемогоДокумента_Сумма ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьВДокументеРеализации
	|ПОМЕСТИТЬ РезультатСопоставленияУслуг
	|ИЗ
	|	РезультатСопоставленияУслугВрем КАК РезультатСопоставленияУслугВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатСопоставления.Номенклатура,
	|	РезультатСопоставления.Содержание,
	|	РезультатСопоставления.Содержание КАК СодержаниеДоИзменения,
	|	РезультатСопоставления.СтавкаНДС,
	|	РезультатСопоставления.СтавкаНДС КАК СтавкаНДСДоИзменения,
	|	РезультатСопоставления.КоличествоДоКорректировки,
	|	РезультатСопоставления.КоличествоДоИзменения,
	|	РезультатСопоставления.Количество,
	|	РезультатСопоставления.СуммаДоКорректировки,
	|	РезультатСопоставления.СуммаДоИзменения,
	|	РезультатСопоставления.Сумма КАК Сумма,
	|	РезультатСопоставления.СуммаНДСДоКорректировки,
	|	РезультатСопоставления.СуммаНДСДоИзменения,
	|	РезультатСопоставления.СуммаНДС КАК СуммаНДС,
	|	РезультатСопоставления.Номенклатура.Принципал 	КАК ПринципалСсылка,
	|	ВЫБОР КОГДА 
	|		РезультатСопоставления.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме)
	|		ИЛИ РезультатСопоставления.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером) ТОГДА
	|			""Агентские""
	|		ИНАЧЕ ""Собственные""
	|	КОНЕЦ КАК ТипУслуги,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РезультатСопоставления.КоличествоДоКорректировки, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(РезультатСопоставления.СуммаДоКорректировки / РезультатСопоставления.КоличествоДоКорректировки КАК ЧИСЛО(31, 2))
	|	КОНЕЦ КАК ЦенаДоКорректировки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РезультатСопоставления.КоличествоДоИзменения, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(РезультатСопоставления.СуммаДоИзменения / РезультатСопоставления.КоличествоДоИзменения КАК ЧИСЛО(31, 2))
	|	КОНЕЦ КАК ЦенаДоИзменения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РезультатСопоставления.Количество, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(РезультатСопоставления.Сумма / РезультатСопоставления.Количество КАК ЧИСЛО(31, 2))
	|	КОНЕЦ КАК Цена,
	|	ЕстьNull(НомераСтрок.НомерСтроки, 0) КАК НомерСтрокиДокумента,
	|	РезультатСопоставления.ЕстьВДокументеРеализации
	|ИЗ
	|	РезультатСопоставленияУслуг КАК РезультатСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрок КАК НомераСтрок
	|		ПО РезультатСопоставления.Номенклатура = НомераСтрок.Номенклатура
	|			И РезультатСопоставления.Содержание = НомераСтрок.Содержание
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезультатСопоставления.ЕстьВДокументеРеализации УБЫВ,
	|	ЕстьNull(НомераСтрок.НомерСтроки, 0)";
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		ТекстЗапросаГТДДоИзменения = "РезультатСопоставления.НомерГТД КАК НомерГТДДоИзменения";
		ТекстЗапросаРНПТДоИзменения = "РезультатСопоставления.КоличествоПоРНПТДоИзменения КАК КоличествоРНПТДоИзменения";
		ТекстЗапросаРНПТДоКорректировки = "РезультатСопоставления.КоличествоПоРНПТДоКорректировки КАК КоличествоРНПТДоКорректировки";
	Иначе
		ТекстЗапросаГТДДоИзменения = "РезультатСопоставления.НомерГТД.Код КАК НомерГТДДоИзменения,
		|	РезультатСопоставления.НомерГТД.СтранаПроисхождения КАК СтранаПроисхожденияДоИзменения";
		ТекстЗапросаРНПТДоИзменения = "НЕОПРЕДЕЛЕНО КАК КоличествоРНПТДоИзменения";
		ТекстЗапросаРНПТДоКорректировки = "НЕОПРЕДЕЛЕНО КАК КоличествоРНПТДоКорректировки";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаГТДДоИзменения", ТекстЗапросаГТДДоИзменения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРНПТДоИзменения", ТекстЗапросаРНПТДоИзменения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРНПТДоКорректировки", ТекстЗапросаРНПТДоКорректировки);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристика",
	ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "РезультатСопоставления"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаСерия",
	ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "РезультатСопоставления"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаУпаковка",
	ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "РезультатСопоставления", Ложь));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаГТД",
	ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "РезультатСопоставления"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРНПТ",
	ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "РезультатСопоставления"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеИБ.ДокументОснование);
	Запрос.УстановитьПараметр("МоментВремени", ДанныеИБ.МоментВремени());  
	ВариантыОтражения = Новый СписокЗначений;
	ВариантыОтражения.Добавить(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУчестьПриИнвентаризации); 
	ВариантыОтражения.Добавить(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки);
	ВариантыОтражения.Добавить(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализацию);
	Запрос.УстановитьПараметр("ВариантыОтражения", ВариантыОтражения);
	Запрос.УстановитьПараметр("РеализацияУслуг", 
	ТипЗнч(ДанныеИБ.ДокументОснование) = Тип("ДокументСсылка.АктВыполненныхРабот")
	ИЛИ ТипЗнч(ДанныеИБ.ДокументОснование) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов"));
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС", ДанныеИБ.ЦенаВключаетНДС);
	Если ТипЗнч(ДанныеИБ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ВернутьМногооборотнуюТару =  ДанныеИБ.ДокументОснование.ВернутьМногооборотнуюТару
	Иначе	
		ВернутьМногооборотнуюТару = Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	
	МеждународнаяВерсия = Истина;
	//++ Локализация
	МеждународнаяВерсия = Ложь;
	//-- Локализация
	Запрос.УстановитьПараметр("МеждународнаяВерсия", МеждународнаяВерсия);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДокументРеализацииСсылка = Неопределено;
	ВыборкаДанных = РезультатыЗапроса[4].Выбрать(); 
	Если ВыборкаДанных.Следующий() Тогда
		ВидПервичнойКорректировки = ВыборкаДанных.ВидКорректировки; 
	Иначе ВидПервичнойКорректировки = Неопределено;
	КонецЕсли;
	СтруктураКлючевыеСвойства = Новый Структура("Дата, Номер, Ссылка, Организация");  
	//++ Локализация
	ОснованиеПоСчетуФактуре = Неопределено;
	Если ТипЗнч(ДанныеИБ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура
		|ПОМЕСТИТЬ ВТ_СФ
		|ИЗ
		|	Документ.СчетФактураВыданный.Товары КАК СчетФактураВыданныйТовары
		|ГДЕ
		|	СчетФактураВыданныйТовары.Ссылка.ДокументОснование = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СФ.ПредыдущийСчетФактура.ДокументОснование КАК ДокументОснование,
		|	ВТ_СФ.ПредыдущийСчетФактура.ДокументОснование.Номер КАК Номер,
		|	ВТ_СФ.ПредыдущийСчетФактура.ДокументОснование.Дата КАК Дата,
		|	ВТ_СФ.ПредыдущийСчетФактура.ДокументОснование.Организация КАК Организация
		|ИЗ
		|	ВТ_СФ КАК ВТ_СФ";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеИБ.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
				ДанныеРеализации = Новый Структура;
				ДанныеРеализации.Вставить("Дата",ВыборкаДетальныеЗаписи.Дата); 
				ДанныеРеализации.Вставить("Номер",ВыборкаДетальныеЗаписи.Номер);
				ДанныеРеализации.Вставить("Организация",ВыборкаДетальныеЗаписи.Организация);
				ОснованиеПоСчетуФактуре = ВыборкаДетальныеЗаписи.ДокументОснование;
			КонецЕсли;
		КонецЦикла;  
	КонецЕсли;
	//-- Локализация
	Если (ДанныеИБ.ВидКорректировки = Перечисления.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон 
		И ВидПервичнойКорректировки = Неопределено) ИЛИ  ВидПервичнойКорректировки = Перечисления.ХозяйственныеОперации.ИсправлениеОшибок Тогда
		ДокументРеализацииСсылка = ДанныеИБ.ДокументОснование;
		Если ЗначениеЗаполнено(ДанныеИБ.ДокументОснование) Тогда
			ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.ДокументОснование, "Дата, Номер, Организация");
			ЗаполнитьЗначенияСвойств(СтруктураКлючевыеСвойства, ДанныеОснования); 
		КонецЕсли;
		СтруктураКлючевыеСвойства.Ссылка = ДокументРеализацииСсылка;
		//++ Локализация
	ИначеЕсли Не ОснованиеПоСчетуФактуре = Неопределено Тогда  
		ДокументРеализацииСсылка = ОснованиеПоСчетуФактуре;  
		ЗаполнитьЗначенияСвойств(СтруктураКлючевыеСвойства, ДанныеРеализации);
		СтруктураКлючевыеСвойства.Ссылка = ОснованиеПоСчетуФактуре;
		//-- Локализация
	ИначеЕсли  ВыборкаДанных.Количество() > 0 Тогда // Вид корректировки ИсправлениеОшибки
		ДокументРеализацииСсылка = ВыборкаДанных.Ссылка;
		ЗаполнитьЗначенияСвойств(СтруктураКлючевыеСвойства, ВыборкаДанных);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументРеализацииСсылка) Тогда
		
		ТипСсылки = ТипЗнч(ДокументРеализацииСсылка);
		ИмяПКО = "";
		Если ТипСсылки = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
			ИмяПКО = "Документ_ВозвратТоваровОтКлиента_Отправка";
			//++ Локализация
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ИмяПКО = "Документ_СчетФактураВыданный_Отправка";
			//-- Локализация
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
			ИмяПКО = "Документ_ВозвратТоваровПоставщику_Отправка";
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
			ИмяПКО = "Документ_РеализацияТоваровУслуг_Отправка";
			Если ПоддерживаетсяКомиссионнаяТорговля И РеализацияЧерезКомиссионера(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ДокументРеализацииСсылка, "ХозяйственнаяОперация")) Тогда
				ИмяПКО = "Документ_РеализацияТоваровУслугКомиссия_Отправка";
				ДополнительныеДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализацииСсылка, 
				"Контрагент, ХозяйственнаяОперация");
				СтруктураКлючевыеСвойства.Вставить("Контрагент", ДополнительныеДанныеОснования.Контрагент);
				СтруктураКлючевыеСвойства.Вставить("ХозяйственнаяОперация", ДополнительныеДанныеОснования.ХозяйственнаяОперация);
			КонецЕсли;
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
			ИмяПКО = "Документ_ОтчетКомиссионера_Отправка";
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
			ИмяПКО = "Документ_ОтчетКомитенту_Отправка";
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.КорректировкаРеализации")  Тогда
			ИмяПКО = "Документ_КорректировкаРеализации_Отправка";
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
			ИмяПКО = "Документ_АктВыполненныхРабот_Отправка";
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
			ИмяПКО = "Документ_РеализацияУслугПрочихАктивов_Отправка"; 
		ИначеЕсли	ТипСсылки = Тип("ДокументСсылка.ПервичныйДокумент")Тогда
			ИмяПКО = "Документ_ПервичныйДокумент_Отправка"; 
			СтруктураКлючевыеСвойства = Новый Структура("Дата, Номер, Ссылка, Организация, ДатаВходящегоДокумента,
			|НаименованиеВходящегоДокумента, НомерВходящегоДокумента, Контрагент, Договор");  
			ЗаполнитьЗначенияСвойств(СтруктураКлючевыеСвойства, ДокументРеализацииСсылка);
		КонецЕсли;  
		
		Если ИмяПКО = "Документ_АктВыполненныхРабот_Отправка"
			И Не СвойствоФорматаОбмена(КомпонентыОбмена, "Документ.АктВыполненныхРабот") Тогда
			ИмяПКО = "Документ_АктВыполненныхРаботРТУ_Отправка";
		КонецЕсли;
		
		Если ИмяПКО <> "" Тогда
			ДанныеXDTO.Вставить("ДокументРеализации", Новый Структура("Значение, ИмяПКО", СтруктураКлючевыеСвойства, ИмяПКО));
		КонецЕсли;
	КонецЕсли;
	
	ДанныеXDTO.Вставить("ВидОперации");
	ДанныеXDTO.ВидОперации = ?(ДанныеИБ.ВидКорректировки = Перечисления.ХозяйственныеОперации.ИсправлениеОшибок,
	"ИсправлениеОшибки", "СогласованноеИзменение");
	
	Если ДанныеИБ.ВидКорректировки = Перечисления.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон Тогда
		Если ДанныеXDTO.Свойство("ДокументРеализации") И ЗначениеЗаполнено(ДанныеXDTO.ДокументРеализации) Тогда
			ДанныеXDTO.Вставить("ИсправляемыйДокументРеализации", ДанныеXDTO.ДокументРеализации);
		КонецЕсли;
	Иначе // Вид корректировки ИсправлениеОшибки
		ВыборкаДанных = РезультатыЗапроса[4].Выбрать();
		Если ВыборкаДанных.Следующий() Тогда
			Если ЗначениеЗаполнено(ВыборкаДанных.Ссылка) Тогда
				СтруктураКлючевыеСвойства = Новый Структура("Дата, Номер, Ссылка, Организация");
				ТипСсылки = ТипЗнч(ВыборкаДанных.Ссылка);
				ИмяПКО = "";
				Если ТипСсылки = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
					ИмяПКО = "Документ_ВозвратТоваровОтКлиента_Отправка";
					//++ Локализация
				ИначеЕсли ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
					ИмяПКО = "Документ_СчетФактураВыданный_Отправка";
					//-- Локализация
				ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
					ИмяПКО = "Документ_ВозвратТоваровПоставщику_Отправка";
				ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					ИмяПКО = "Документ_РеализацияТоваровУслуг_Отправка"; 
					Если ПоддерживаетсяКомиссионнаяТорговля И РеализацияЧерезКомиссионера(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						ВыборкаДанных.Ссылка, "ХозяйственнаяОперация")) Тогда
						ИмяПКО = "Документ_РеализацияТоваровУслугКомиссия_Отправка";
						ДополнительныеДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализацииСсылка, 
						"Контрагент, ХозяйственнаяОперация");
						СтруктураКлючевыеСвойства.Вставить("Контрагент", ДополнительныеДанныеОснования.Контрагент);
						СтруктураКлючевыеСвойства.Вставить("ХозяйственнаяОперация", ДополнительныеДанныеОснования.ХозяйственнаяОперация);
					КонецЕсли;
				ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
					ИмяПКО = "Документ_ОтчетКомиссионера_Отправка";
				ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
					ИмяПКО = "Документ_ОтчетКомитенту_Отправка";
				ИначеЕсли ТипСсылки = Тип("ДокументСсылка.КорректировкаРеализации")Тогда 
					ИмяПКО = "Документ_КорректировкаРеализации_Отправка";  
				ИначеЕсли	ТипСсылки = Тип("ДокументСсылка.ПервичныйДокумент")Тогда
					ИмяПКО = "Документ_ПервичныйДокумент_Отправка"; 
					СтруктураКлючевыеСвойства = Новый Структура("Дата, Номер, Ссылка, Организация, ДатаВходящегоДокумента,
					|НаименованиеВходящегоДокумента, НомерВходящегоДокумента, Контрагент, Договор");  
					ЗаполнитьЗначенияСвойств(СтруктураКлючевыеСвойства, ДокументРеализацииСсылка);
				ИначеЕсли ТипСсылки = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
					ИмяПКО = "Документ_АктВыполненныхРабот_Отправка";
				ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
					ИмяПКО = "Документ_РеализацияУслугПрочихАктивов_Отправка";
				КонецЕсли;
				
				Если ИмяПКО = "Документ_АктВыполненныхРабот_Отправка"
					И Не СвойствоФорматаОбмена(КомпонентыОбмена, "Документ.АктВыполненныхРабот") Тогда
					ИмяПКО = "Документ_АктВыполненныхРаботРТУ_Отправка";
				КонецЕсли;
				
				Если ИмяПКО <> "" Тогда
					ЗаполнитьЗначенияСвойств(СтруктураКлючевыеСвойства, ВыборкаДанных);
					ДанныеXDTO.Вставить("ИсправляемыйДокументРеализации", Новый Структура("Значение, ИмяПКО", СтруктураКлючевыеСвойства, ИмяПКО));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	НомерПоследнего = РезультатыЗапроса.Количество() - 1;
	ТаблицаТовары = РезультатыЗапроса[24].Выгрузить();
	ТаблицаУслуги = РезультатыЗапроса[НомерПоследнего].Выгрузить();
	
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, ТаблицаТовары, Истина, Истина);
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	
	// Сумма документа.
	СуммаДокумента = 0;
	СуммаДокумента = СуммаДокумента + ТаблицаТовары.Итог("Сумма");
	СуммаДокумента = СуммаДокумента + ТаблицаУслуги.Итог("Сумма");
	Если НЕ ДанныеИБ.ЦенаВключаетНДС Тогда
		СуммаДокумента = СуммаДокумента + ТаблицаТовары.Итог("СуммаНДС");
		СуммаДокумента = СуммаДокумента + ТаблицаУслуги.Итог("СуммаНДС");
	КонецЕсли;
	Если СуммаДокумента = 0 Тогда
		СуммаДокумента = -1;
	КонецЕсли;
	ДанныеXDTO.Вставить("Сумма", СуммаДокумента);
	
	#Удаление
	ТаблицаУслугЗаполнитьПринципала(КомпонентыОбмена, ТаблицаУслуги);
	#КонецУдаления 
	#Вставка
	ТаблицаУслугЗаполнитьПринципалаДоговор(КомпонентыОбмена, ТаблицаУслуги, ДанныеИБ);
	#КонецВставки
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		ПереопределитьСтавкуНДСДляСтарыхФорматов(ТаблицаТовары, Ложь);
		ПереопределитьСтавкуНДСДляСтарыхФорматов(ТаблицаУслуги, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить("Товары", ТаблицаТовары);
	ДанныеXDTO.Вставить("Услуги", ТаблицаУслуги);
	
	// Дополнительные свойства для договора
	Если ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
		ДанныеXDTO.Вставить("Договор", ДанныеИБ.Договор);
	Иначе
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.Контрагент = ДанныеИБ.Контрагент;
		ПараметрыПоУмолчанию.Организация = ДанныеИБ.Организация;
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов = ДанныеИБ.ВалютаВзаиморасчетов;
		ПараметрыПоУмолчанию.ВидДоговора = "СПокупателем";
		ПараметрыПоУмолчанию.Дата = ДанныеИБ.Дата;
		ПараметрыПоУмолчанию.Номер = ДанныеИБ.Номер;
		Если ЗначениеЗаполнено(ДанныеИБ.Соглашение) Тогда
			ДанныеРасчетаУЕ          = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.Соглашение, "ВалютаВзаиморасчетов, ОплатаВВалюте, Организация");
			РасчетыВУсловныхЕдиницах = ВедетсяРасчетВУЕ(ДанныеРасчетаУЕ.ВалютаВзаиморасчетов, ДанныеРасчетаУЕ.ОплатаВВалюте, ДанныеРасчетаУЕ.Организация, КомпонентыОбмена);
		Иначе
			РасчетыВУсловныхЕдиницах = (ДанныеИБ.Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация) И ДанныеИБ.Валюта <> ДанныеИБ.ВалютаВзаиморасчетов);
		КонецЕсли;
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = РасчетыВУсловныхЕдиницах;
		
		Выборка = РезультатыЗапроса[0].Выбрать();
		ЗаказКлиента = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
		Заказ = Новый Структура("Заказ, Соглашение, Сделка", ЗаказКлиента, ДанныеИБ.Соглашение, ДанныеИБ.Сделка);
		Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, Заказ, ДанныеИБ);
		ДанныеXDTO.Вставить("Договор", Договор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеИБ.БанковскийСчетОрганизации)
		И ДанныеИБ.БанковскийСчетОрганизации.Владелец <> ДанныеИБ.Организация Тогда
		ДанныеXDTO.Вставить("БанковскийСчетОрганизации", Неопределено);
	КонецЕсли;
	//Сведения РНПТ   
	
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ПолучитьСведенияРНПТКорректировкиРеализации(ДанныеИБ, ДанныеXDTO, ТаблицаТовары);    
	КонецЕсли;
	//-- Локализация 
	Если ПоддерживаетсяКомиссионнаяТорговля Тогда 
		
		Если ТипЗнч(ДанныеИБ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			И РеализацияЧерезКомиссионера(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеИБ.ДокументОснование, "ХозяйственнаяОперация")) Тогда
			
			ДанныеXDTO.Вставить("ДоговорПокупателяКомиссионногоТовара", ДанныеИБ.КлиентДоговор);
			ДанныеXDTO.Вставить("ПокупательКомиссионногоТовара", ДанныеИБ.КлиентКонтрагент);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации, Истина);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
КонецПроцедуры



#КонецОбласти

#КонецОбласти
