
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Дата1", НачалоДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("Дата2", КонецДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ПланФакт", Перечисления.ПланФакт.План);
	
	Если Параметры.Свойство("Подразделение") Тогда
		Подразделение= Параметры.Подразделение;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
	КонецЕсли;
	
	//Доп парараметры отбора автомобиля
	Если Параметры.Свойство("Вес") Тогда
		Вес= Параметры.Вес/1000;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Грузоподъемность", Вес, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
	КонецЕсли;
	Если Параметры.Свойство("Объем") Тогда
		Объем= Параметры.Объем;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Вместимость", Объем, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
	КонецЕсли;
	Если Параметры.Свойство("МаксимальнаяДлинаГруза") Тогда
		МаксимальнаяДлинаГруза= Параметры.МаксимальнаяДлинаГруза;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "МаксимальнаяДлинаГруза", МаксимальнаяДлинаГруза, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("МинимальныйТипТС") И ЗначениеЗаполнено(Параметры.МинимальныйТипТС) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ПриоритетТипаТС", Параметры.МинимальныйТипТС, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("НесовместимыеТипыТС") И ЗначениеЗаполнено(Параметры.НесовместимыеТипыТС) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ТипТС", Параметры.НесовместимыеТипыТС, ВидСравненияКомпоновкиДанных.НеВСписке,, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Возвр= Новый Структура;
	Возвр.Вставить("Водитель", Элементы.Список.ТекущиеДанные.Водитель);
	Возвр.Вставить("НомерСтроки", Элементы.Список.ТекущаяСтрока);
	ОповеститьОВыборе(Возвр);
КонецПроцедуры
