
&НаКлиенте
Процедура ЗаполнитьВсемиЭтапами(Команда)
	ЗаполнитьВсемиЭтапамиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсемиЭтапамиСервер()
	ТабВремяПоЭтапам = Объект.ВремяПоЭтапам;
	ТабВремяПоЭтапам.Очистить();
	МассивЭтапов = Новый Массив;
	МассивЭтапов.Добавить(Перечисления.ЭтапыПеремещения.ПустаяСсылка());
	Для каждого Этап из Перечисления.ЭтапыПеремещения Цикл
		МассивЭтапов.Добавить(Этап);
	КонецЦикла;

	Для ит=0 по МассивЭтапов.Количество()-1 Цикл
		Стр = ТабВремяПоЭтапам.Добавить();
		Стр.НачальноеСобытие = МассивЭтапов[ит];
		ит=ит+1;
		Стр.КонечноеСобытие = МассивЭтапов[ит];
	КонецЦикла;
КонецПроцедуры // ЗаполнитьВсемиЭтапамиСервер()
