
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
		
	Если Параметры.Свойство("Номенклатура") Тогда                                 
		ПоступлениеИОтгрузка.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	Иначе
		ПоступлениеИОтгрузка.Параметры.УстановитьЗначениеПараметра("Номенклатура", Неопределено);
	КонецЕсли;
	
	Если Параметры.Свойство("Склад") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПоступлениеИОтгрузка.Отбор, "Склад", Параметры.Склад, ВидСравненияКомпоновкиДанных.ВИерархии, , ЗначениеЗаполнено(Параметры.Склад));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеИОтгрузкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	Ссылка = Элемент.ТекущиеДанные.ДокументОснование;
	ПараметрыФормы = Новый Структура("Ключ", Ссылка);
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		ОткрытьФорму("Документ.ЗаказНаПеремещение.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		ОткрытьФорму("Документ.ЗаказНаСборку.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры
