
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ОтображениеНайстроекДляПодрядчика();
	
КонецПроцедуры

&НаСервере
Процедура Док_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	
	ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если не  объект.Родитель.Пустая() Тогда  
		Если объект.Родитель.ПринадлежитЭлементу(ГруппаПодрядчики) ИЛИ объект.Родитель = ГруппаПодрядчики Тогда 

		Если Не ЗначениеЗаполнено(Объект.ТелефонПодрядчика) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполенено поле контактной информации";
			Сообщение.Поле = "Объект.ТелефонПодрядчика";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.EMAILподрядчика) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполенено поле контактной информации";
			Сообщение.Поле = "Объект.EMAILподрядчика";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
		
		Элементы.НастройкаУведомленийПодрядчику.Доступность = ИСТИНА;
		Элементы.НастройкаУведомленийПодрядчику.Видимость = ИСТИНА;
		
		КонецЕсли;
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	
	ОтображениеНайстроекДляПодрядчика();
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеНайстроекДляПодрядчика() 
	
	ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если не  объект.Родитель.Пустая() Тогда  
		Если объект.Родитель.ПринадлежитЭлементу(ГруппаПодрядчики) ИЛИ объект.Родитель = ГруппаПодрядчики Тогда 
			Элементы.НастройкаУведомленийПодрядчику.Доступность = ИСТИНА;
			Элементы.НастройкаУведомленийПодрядчику.Видимость = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
	
	

КонецПроцедуры







