#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&ИзменениеИКонтроль("ПолучитьБлокируемыеРеквизитыОбъекта")
Функция Док_ПолучитьБлокируемыеРеквизитыОбъекта() экспорт

	Результат = Новый Массив;
	Результат.Добавить("ВалютаЦены; УточнениеВалютПоЦеновымГруппамПредставление");
	Результат.Добавить("ЦенаВключаетНДС");
	Результат.Добавить("ИспользоватьПриОптовойПродаже");
	Результат.Добавить("ИспользоватьПриРозничнойПродаже");
	Результат.Добавить("ИспользоватьПриПередачеМеждуОрганизациями");
	Результат.Добавить("ВспомогательнаяЦена");
	Результат.Добавить("Назначение;ВладелецИндивидуальногоВидаЦенПредставление");
	Результат.Добавить("СпособЗаданияЦены;ПараметрыВидаРасчета,ГлубинаАнализаДанных,СхемаКомпоновкиДанныхПредставление");
	Результат.Добавить("Идентификатор");
	Результат.Добавить("СхемаКомпоновкиДанных;КомпоновщикНастроекПредставление,РедактироватьСхемуКомпоновкиДанных");

	Результат.Добавить("ВариантОкругления;МетодОкругления,МетодОкругленияУпрощенно,ВыключитьРасширенныйРежим,ВключитьРасширенныйРежим");
	Результат.Добавить("ПорогСрабатывания;ПорогСрабатыванияПриУменьшении,ИспользоватьПорогиСрабатывания");
	Результат.Добавить("Формула;КоманднаяПанельФормулаКонструкторФормул");

	Результат.Добавить("ЦеновыеГруппы; ФормулыКонструкторФормулТекущейСтроки,УточнениеПоЦеновымГруппамПредставление");
	Результат.Добавить("ПорогиСрабатывания; УточнениеПороговСрабатыванияПредставление");
	Результат.Добавить("ПроцентРучнойСкидки; ГруппаОсновнойПроцентыСкидокНаценок,ИспользоватьПроцентыСкидокНаценок");
	Результат.Добавить("Формулы");
	Результат.Добавить("ПравилаОкругленияЦены");
	Результат.Добавить("БазовыйВидЦены");
	Результат.Добавить("Наценка;НаценкаИлиСкидка, НаценкаПоМодулю");
	Результат.Добавить("ОграничиватьОтборНоменклатуры; ОтборПредставление");
	Результат.Добавить("ЗапретитьРедактированиеЦеныЗаПределамиОтбора");

	Результат.Добавить("ТочностьОкругления");
	Результат.Добавить("Округлять; ИспользоватьРасширеннуюНастройкуОкругления,ТочностьОкругления,ВариантОкругления,КонструкторОкругления,УточнениеНастроекОкругленияПредставление");
	Результат.Добавить("УстанавливатьЦенуПриВводеНаОсновании");
	Результат.Добавить("ПараметрыСпособаЗаданияЦены; ПараметрыСпособаЗаданияЦеныПроизвольныйТип");
	
	#Вставка 
	Результат.Добавить("УточнениеПоНоменклатуре;УточнениеПоНоменклатуре_ЗагрузитьИзФайла_Альтерра");
	#КонецВставки

	Возврат Результат;

КонецФункции

&После ("ОбработкаПолученияДанныхВыбора")
Процедура Док_ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	если ДопМодуль.НовоеЦенообразование() и Параметры.Отбор.Свойство("Подразделение") тогда 
		
			СтандартнаяОбработка = Ложь;
				ДанныеВыбора = Новый СписокЗначений;

					Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВидыЦен.Ссылка КАК ВидЦен
			|ИЗ
			|	Справочник.ВидыЦен КАК ВидыЦен
			|ГДЕ
			|	ВидыЦен.ПометкаУдаления = ЛОЖЬ
			|	И ВидыЦен.РегионПрисутствия.Ссылка ЕСТЬ NULL
			|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
			|	И &ПодстановкаЦенаВключаетНДС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВидыЦен.Ссылка
			|ИЗ
			|	Справочник.ВидыЦен КАК ВидыЦен
			|ГДЕ
			|	ВидыЦен.ПометкаУдаления = ЛОЖЬ
			|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
			|	И ВидыЦен.РегионПрисутствия = &регионприсутствия
			|	И ВидыЦен.ФорматПодразделения = &ФорматПодразделения
			|	И &ПодстановкаЦенаВключаетНДС");   
					
			Запрос.УстановитьПараметр("регионприсутствия", Параметры.Отбор.Подразделение.регионприсутствия);
			Запрос.УстановитьПараметр("ФорматПодразделения", Параметры.Отбор.Подразделение.ФорматПодразделения);
					

		// Если в параметрах передан отбор по реквизиту "ЦенаВключаетНДС"
		Если Параметры.Отбор.Свойство("ЦенаВключаетНДС") Тогда
			Запрос.Текст=Стрзаменить(Запрос.Текст,"&ПодстановкаЦенаВключаетНДС","ВидыЦен.ЦенаВключаетНДС = &ЦенаВключаетНДС");
			Запрос.УстановитьПараметр("ЦенаВключаетНДС", Параметры.Отбор.ЦенаВключаетНДС); 
		иначе
			Запрос.Текст=Стрзаменить(Запрос.Текст,"&ПодстановкаЦенаВключаетНДС","истина");
		КонецЕсли;

		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЦен"));
		
 		ДанныеВыбора.Добавить(Справочники.ВидыЦен.ПустаяСсылка(), НСтр("ru='<произвольная>'")); 
	конецесли
	
КонецПроцедуры

#КонецЕсли         
