#Область НовоеЦенообразование

Функция ЦенаПродажиИОстаткиТовара_НЦ(Номенклатура, Характеристика, Соглашение, Валюта, Склады, ВидыЦен,Подразделение) Экспорт
	
	Перем СоставРазделовЗапроса;
	
	Запрос = Новый Запрос;
	
	ТекстДоступныхОстатков = ОбеспечениеВДокументахСервер.ТекстЗапросаДоступныхОстатковПоДатамДляПодбора(
		ЗначениеЗаполнено(Характеристика), СоставРазделовЗапроса);
		
	Запрос.Текст = ТекстДоступныхОстатков
		+ ПодборТоваровСервер.РазделительПакетаЗапросов()
		// изменение
		+ ПодборТоваровСервер.ТекстЗапросаЦенаПродажиТовара_НЦ(СоставРазделовЗапроса);
	
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("ВидыЦен", ВидыЦен);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДатаСеанса()));
	// изменение     
	если Соглашение=НЕОПРЕДЕЛЕНО тогда
		Запрос.УстановитьПараметр("ВидЦенСоглашение",Справочники.ВидыЦен.ПустаяСсылка() );
	иначе		
		Запрос.УстановитьПараметр("ВидЦенСоглашение",ВернутьВидЦенПоПараметрам(Соглашение.ГруппаВидовЦен,Подразделение) ); 
	конецесли;
	Запрос.УстановитьПараметр("ФорматПодразделения", Подразделение.ФорматПодразделения);
	Запрос.УстановитьПараметр("РегионПрисутствия", Подразделение.РегионПрисутствия);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Цена продажи.
	Коэффициент = 1;
	
	ЦенаПродажи = Новый Структура("ВидЦены, Цена, Упаковка, ЕдиницаИзмерения, Описание, СрокПоставки");
	
	ЦенаПродажи.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
	ЦенаПродажи.Цена = 0;
	ЦенаПродажи.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	ЦенаПродажи.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	ЦенаПродажи.Описание = "";
	ЦенаПродажи.СрокПоставки = '00010101';
	
	Выборка = Результат[СоставРазделовЗапроса.Найти("ЦенаПродажиТовара")].Выбрать();
	Если Выборка.Следующий() Тогда
		
		Коэффициент = Выборка.Коэффициент;
		ЗаполнитьЗначенияСвойств(ЦенаПродажи, Выборка);
		
	КонецЕсли;
	
	// Планируемые и текущие остатки.
	Выборка = Результат[СоставРазделовЗапроса.Найти("ПланируемыеОстатки")].Выбрать();
	ТекущиеОстатки     = Новый Массив;
	ПланируемыеОстатки = Новый Массив;
	ТекущийСклад = Неопределено;
	
		Пока Выборка.Следующий() Цикл
		
		Если Выборка.Склад <> ТекущийСклад Тогда
			
			//НоваяСтрока = Новый Структура("Склад, ВНаличии, Свободно");
			НоваяСтрока = Новый Структура("Склад, Запас, Свободно");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Свободно = ?(Выборка.Состояние = 0, Выборка.Свободно, 0) / Коэффициент;
			//НоваяСтрока.ВНаличии = Выборка.ВНаличии / Коэффициент;
			ТекущиеОстатки.Добавить(НоваяСтрока);

			
			ТекущийСклад = Выборка.Склад;
			ДоступноКДате = 0;
			
		КонецЕсли;
		
		ДоступноКДате = ДоступноКДате + Выборка.Свободно;
		
		Если Выборка.Состояние = 1 Тогда
			
			НоваяСтрока = Новый Структура("Склад, Период, Доступно,Запас");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Доступно = ДоступноКДате / Коэффициент;
			ПланируемыеОстатки.Добавить(НоваяСтрока);
		КонецЕсли;
			//Изменение
			НоваяСтрока.Запас = Выборка.Запас / Коэффициент;
	КонецЦикла;

	
	Возврат Новый Структура("ТекущиеОстатки, ПланируемыеОстатки, Цена", ТекущиеОстатки, ПланируемыеОстатки, ЦенаПродажи);
	
КонецФункции

Функция ВернутьВидЦенПоПараметрам(ГруппаВидовЦен,Подразделение) экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ первые 1
		|	ВидыЦен.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	ВидыЦен.РегионПрисутствия = &РегионПрисутствия
		|	И ВидыЦен.ГруппаВидовЦен = &ГруппаВидовЦен
		|	И ВидыЦен.ФорматПодразделения = &ФорматПодразделения";
	
	Запрос.УстановитьПараметр("ГруппаВидовЦен", ГруппаВидовЦен);
	Запрос.УстановитьПараметр("РегионПрисутствия", Подразделение.РегионПрисутствия);
	Запрос.УстановитьПараметр("ФорматПодразделения", Подразделение.ФорматПодразделения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
         возврат ВыборкаДетальныеЗаписи.Ссылка;
	 иначе
		 Возврат "";
	Конецесли;
	

КонецФункции // ()

Функция ВернутьВидЦенПоПараметрамПоставщика(Соглашение,Подразделение,Владелец) экспорт

	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ВидыЦенПоставщиков.Ссылка КАК ВидЦен
	|ИЗ
	|	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
	|ГДЕ
	|	ВидыЦенПоставщиков.ФорматПодразделения = &ФорматПодразделения
	|	И ВидыЦенПоставщиков.РегионПрисутствия = &РегионПрисутствия
	|	И ВидыЦенПоставщиков.Владелец = &Владелец
	|	И ВидыЦенПоставщиков.ГруппаВидовЦен = &ГруппаВидовЦен";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ГруппаВидовЦен", Соглашение.ГруппаВидовЦен);
	Запрос.УстановитьПараметр("ФорматПодразделения", Подразделение.ФорматПодразделения);
	Запрос.УстановитьПараметр("РегионПрисутствия", Подразделение.РегионПрисутствия); 
	РезультатЗапроса=Запрос.Выполнить();
	Выборка=РезультатЗапроса.Выбрать();
	если Выборка.Следующий() тогда
		возврат Выборка.Видцен;
	иначе
		возврат Справочники.ВидыЦен.ПустаяСсылка();
	конецесли;	

КонецФункции // ()

#КонецОбласти
