#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	Документы.ЗаявкаВЕГАИСЛес.ЗаполнитьДанныеПоОснованию(ДанныеЗаполнения, ЭтотОбъект);
	
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		Документы.ЗаявкаВЕГАИСЛес.ПроверкаНаличияЗаявкиПриСозданииНовой(Основание,Отказ);
	КонецЕсли;
	
	Если ТипКлиента = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо И ТипЗнч(Основание) <> Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Если Не ЗначениеЗаполнено(ФИОФЛ) Тогда
			Сообщить("Данные по физическому лицу обязательны к заполнению!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;                         
		
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Автор) Тогда
		ЭтотОбъект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)

	Если Не рольДоступна("ПолныеПрава") И Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтключитьКонтроль") Тогда
		Документы.ЗаданиеНаПеревозкуРейс.ПроверитьЧтоНетРейсовИлизаказовНаДоставку(Основание, Отказ);
	КонецЕсли;  

КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЭтотОбъект.ТипКлиента = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Документы.ЗаявкаВЕГАИСЛес.ЗаполнитьДанныеПоОснованию(ЭтотОбъект.Основание, ЭтотОбъект);
		ЭтотОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли


