
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ХранилищеНастроек=Объект.Ссылка.ХранилищеНастроек;
//	СписокНоменклатуры.ДоступныеЗначения.
	ЗаполнитьНастройки();
	УсловноеОформление();  
	Элементы.ГрафикЗаявок.Видимость=Объект.ИспользуетсяВРЗ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	Если ХранилищеНастроек <> Неопределено И ХранилищеНастроек.Получить() <> Неопределено Тогда
		СтруктураНастроек=ХранилищеНастроек.Получить();
		если СтруктураНастроек.Свойство("МассивМенеджеров") тогда
			СписокМенеджеров.ЗагрузитьЗначения(СтруктураНастроек.МассивМенеджеров);
		конецесли;	
		если СтруктураНастроек.Свойство("МассивНоменклатуры") тогда
			СписокНоменклатуры.ЗагрузитьЗначения(СтруктураНастроек.МассивНоменклатуры);
		конецесли;	
		если СтруктураНастроек.Свойство("СкладыОстатков") тогда
			СкладыОстатков.Загрузить(СтруктураНастроек.СкладыОстатков);
		конецесли;	
		
	конецесли;	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СтруктураНастроек=Новый Структура();
	СтруктураНастроек.Вставить("МассивМенеджеров",СписокМенеджеров.ВыгрузитьЗначения());
	СтруктураНастроек.Вставить("МассивНоменклатуры",СписокНоменклатуры.ВыгрузитьЗначения());
	СтруктураНастроек.Вставить("СкладыОстатков",СкладыОстатков.Выгрузить());
	
	ХранилищеНастроек=Новый ХранилищеЗначения(СтруктураНастроек);
	
	Если ХранилищеНастроек <> Неопределено И ХранилищеНастроек.Получить() <> Неопределено Тогда
		ТекущийОбъект.ХранилищеНастроек = ХранилищеНастроек;
	Конецесли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыОстатковСкладыОстатковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Массив = Новый Массив(); 
Массив.Добавить(Тип("СправочникСсылка.Склады")); 
НашеОписание = Новый ОписаниеТипов(Массив);
Элементы.СкладыОстатков.ТекущиеДанные.СкладыДляОстатков.ТипЗначения=НашеОписание;	

КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиГрафикЗаявокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЭлементКоманда = Элементы.Поставщики.ТекущиеДанные;
	РасписаниеКоманды =?(ЭлементКоманда.ГрафикЗаявок="Не заполнено" или ЭлементКоманда.ГрафикЗаявок="" ,Новый РасписаниерегламентногоЗадания,
	СтрокаВРасписание(ЭлементКоманда.ГрафикЗаявокСтрока)); 
	
	Контекст = Новый Структура;
	Контекст.Вставить("ЭлементКоманда", ЭлементКоманда);
	Обработчик = Новый ОписаниеОповещения("ПослеОкончанияРедактированияРасписания", ЭтотОбъект, Контекст);
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеКоманды);
	РедактированиеРасписания.Показать(Обработчик);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияРасписания(Расписание, Контекст) Экспорт 
	если Расписание<>НЕОПРЕДЕЛЕНО тогда
	ЭлементКоманда = Контекст.ЭлементКоманда;
	Если ДополнительныеОтчетыИОбработкиКлиентСервер.РасписаниеЗадано(Расписание) Тогда
		ТекущаяСтрока=Элементы.Поставщики.ТекущиеДанные;
		ТекущаяСтрока.ГрафикЗаявок=Строка(Расписание);
		ТекущаяСтрока.ГрафикЗаявокСтрока=РасписаниеВСтроку(Расписание);
	иначе
		ЭлементКоманда.ГрафикЗаявок= НСтр("ru = 'Не заполнено'");
	конецесли;       
	конецесли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьРасписаниеВСтруктуру(Расписание)
	СтруктураРасписания=ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(Расписание);
	Возврат СтруктураРасписания;
КонецФункции 

&НаСервере
Функция РасписаниеВСтроку(Расписание,Разделитель=",",РазделительМассива=";")
	
	Результат="";
	// массивы
	СтрокаДниНедели="";
	для каждого стр из Расписание.ДниНедели цикл
		СтрокаДниНедели=СтрокаДниНедели+строка(стр)+РазделительМассива;
	конеццикла;	
	
	СтрокаМесяцы="";
	для каждого стр из Расписание.Месяцы цикл
		СтрокаМесяцы=СтрокаМесяцы+строка(стр)+РазделительМассива;
	конеццикла;	
	
	
	Результат=Результат+?(не значениезаполнено(Расписание.ВремяЗавершения),"",Расписание.ВремяЗавершения)+Разделитель+
	?(не значениезаполнено(Расписание.ВремяКонца),"",Расписание.ВремяКонца)+Разделитель+
	Расписание.ВремяНачала+Разделитель+
	Расписание.ДатаКонца+Разделитель+
	Расписание.ДатаНачала+Разделитель+
	Расписание.ВремяКонца+Разделитель+
	Строка(Расписание.ДеньВМесяце)+Разделитель+
	Строка(Расписание.ДеньНеделиВМесяце)+Разделитель+
	Строка(Расписание.ИнтервалЗавершения)+Разделитель+
	Строка(Расписание.ПаузаПовтора)+Разделитель+
	Строка(Расписание.ПериодНедель)+Разделитель+
	Строка(Расписание.ПериодПовтораВтечениеДня)+Разделитель+
	Строка(Расписание.ПериодПовтораДней)+Разделитель+
	СтрокаДниНедели+Разделитель+
	СтрокаМесяцы;
	
	возврат Результат;	
	
КонецФункции // ЗаписатьРасписаниеВСтроку()

&НаСервере
Функция СтрокаВРасписание(строкаРасписания)
	Расписание=Новый РасписаниеРегламентногоЗадания;
	Массив=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(строкаРасписания,",");
	если Массив.Количество()= 0 тогда
		Возврат Расписание;
	конецесли;
	Расписание.ВремяЗавершения=Массив[0];
	Расписание.ВремяКонца=Массив[1];
	Расписание.ВремяНачала= Массив[2];
	Расписание.ДатаКонца= Массив[3];
	Расписание.ДатаНачала= Массив[4];
	Расписание.ВремяКонца= Массив[5];
	Расписание.ДеньВМесяце= Массив[6];
	Расписание.ДеньНеделиВМесяце=Массив[7];
	Расписание.ИнтервалЗавершения= Массив[8];
	Расписание.ПаузаПовтора= Массив[9];
	Расписание.ПериодНедель= Массив[10];
	Расписание.ПериодПовтораВтечениеДня=Массив[11];
	Расписание.ПериодПовтораДней=Массив[12];
	МассивДниНедели=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Массив[13],";",истина);
	для каждого стр из МассивДниНедели цикл
		стр=число(стр);
	конеццикла;	
	Расписание.ДниНедели=МассивДниНедели;
	МассивМесяцы=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Массив[14],";",истина);
	для каждого стр из МассивМесяцы цикл
		стр=число(стр);
	конеццикла;	
	Расписание.Месяцы=МассивМесяцы;
	
	Возврат Расписание;
КонецФункции // СтрокаВРасписание()

&НаСервере
Процедура УсловноеОформление()

	Элементы.ПоставщикиПоставщик.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Покупка;
	Элементы.ПоставщикиКонтрагент.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Покупка;
	Элементы.ПоставщикиДоговор.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Покупка;
	Элементы.ПоставщикиСоглашение.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Покупка;
	Элементы.Подтоварка.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Перемещение;

	// для подтоварки
	Элементы.ГруппаРЗ.Видимость=не Объект.Подтоварка;
	Элементы.КатегорийныйМенеджер.Видимость=не Объект.Подтоварка;
	Элементы.СписокМенеджеров.Видимость=не Объект.Подтоварка;
	Элементы.Показатель.Видимость=не Объект.Подтоварка;
	Элементы.ПоказательИнф.Видимость=не Объект.Подтоварка;
	Элементы.ПоказательРасход.Видимость=не Объект.Подтоварка;
	Элементы.СписокНоменклатуры.Видимость=не Объект.Подтоварка;
	Элементы.СкладыОстатковСкладыОстатков.Видимость=не Объект.Подтоварка;
	Элементы.СкладыОстатковПредельнаяДлинаПродаж.Видимость=не Объект.Подтоварка;
	Элементы.СкладыОстатковСпособыОбеспечения.Видимость=Объект.Подтоварка;
	Элементы.Оборачиваемость.Видимость=не Объект.Подтоварка;
	Элементы.Поставщики.Видимость=не Объект.Подтоварка;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбеспеченияПриИзменении(Элемент)  
	Объект.Подтоварка=?(объект.типОбеспечения<>предопределенноезначение("Перечисление.ТипыОбеспечения.Перемещение"),ложь,Объект.Подтоварка);
	УсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяВРЗПриИзменении(Элемент)
	Элементы.ГрафикЗаявок.Видимость=Объект.ИспользуетсяВРЗ;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗаявокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РасписаниеКоманды =?(Элементы.ГрафикЗаявок="Не заполнено" или Элементы.ГрафикЗаявок="" ,Новый РасписаниерегламентногоЗадания,
	СтрокаВРасписание(Объект.ГрафикЗаявокСтрока)); 
	ЭлементКоманда = Элементы;
	Контекст = Новый Структура;
	Контекст.Вставить("ЭлементКоманда", ЭлементКоманда);
	Обработчик = Новый ОписаниеОповещения("ПослеОкончанияРедактированияГрафика", ЭтотОбъект, Контекст);
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеКоманды);
	РедактированиеРасписания.Показать(Обработчик);

КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияГрафика(Расписание, Контекст) Экспорт 
	если Расписание<>НЕОПРЕДЕЛЕНО тогда   
		если Объект.ГрафикЗаявок<>Строка(Расписание)	тогда
			Объект.ДатаВыполненияРЗ="";
		конецесли;
		ЭлементКоманда = Контекст.ЭлементКоманда;
		Если ДополнительныеОтчетыИОбработкиКлиентСервер.РасписаниеЗадано(Расписание) Тогда
			Объект.ГрафикЗаявок=Строка(Расписание);
			Объект.ГрафикЗаявокСтрока=РасписаниеВСтроку(Расписание);
		иначе
			Объект.ГрафикЗаявок= НСтр("ru = 'Не заполнено'");
		конецесли;       
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура СкладыОстатковСпособыОбеспеченияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Массив = Новый Массив(); 
Массив.Добавить(Тип("СправочникСсылка.СпособыОбеспеченияПотребностей")); 
НашеОписание = Новый ОписаниеТипов(Массив);
Элементы.СкладыОстатков.ТекущиеДанные.СпособыОбеспечения.ТипЗначения=НашеОписание;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтоваркаПриИзменении(Элемент)
	УсловноеОформление();
КонецПроцедуры


