
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьСписок(Параметры.РегионыПрисутствия);
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок(СписокРегионов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Элементы.Ссылка КАК Значение,
		|	ИСТИНА КАК Пометка
		|ИЗ
		|	Справочник.РегионыПрисутствия КАК Элементы
		|ГДЕ
		|	Элементы.Ссылка В (&СписокРегионов)";
	
	Запрос.УстановитьПараметр("СписокРегионов", СписокРегионов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	РегионыПрисутствия.Очистить();
	Пока Выборка.Следующий() Цикл
		РегионыПрисутствия.Добавить(Выборка.значение,Выборка.значение,Выборка.Пометка);	
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	Закрыть(СписокРегионовРезультат());
КонецПроцедуры      

&НаСервере
Функция СписокРегионовРезультат() 
	СписокРегионов=Новый СписокЗначений;
	для каждого стр из РегионыПрисутствия цикл
		если Стр.Пометка тогда
			СписокРегионов.Добавить(Стр.Значение,Стр.Значение);
		конецесли;	
	конеццикла;	
	Возврат СписокРегионов;
	//  возврат РегионыПрисутствия; 
КонецФункции

&НаКлиенте
Процедура РегионыПрисутствияПометкаПриИзменении(Элемент)     
//	если не Элементы.регионыПрисутствия.ТекущиеДанные.Пометка тогда
	    УбратьЗависимыеРегионы();                                  
//	конецесли;	
КонецПроцедуры         

&НаКлиенте
Процедура УбратьЗависимыеРегионы()

	пока РекурсивнаяУбратьЗависимые() цикл
	конеццикла;	

КонецПроцедуры

&НаСервере
Функция РекурсивнаяУбратьЗависимые()
	
	найдено=ложь;
	МассивРегионов=Новый массив();
	для каждого стр из РегионыПрисутствия цикл
		если не стр.Пометка тогда
			МассивРегионов.Добавить(стр.значение);
		конецесли;
	конеццикла;	  
	для каждого стр из РегионыПрисутствия цикл
		если стр.Пометка и МассивРегионов.Найти(стр.Значение.Вышестоящийрегион)<>НЕОПРЕДЕЛЕНО тогда
			стр.Пометка=ложь;
			найдено=истина;
		конецесли;
	конеццикла;	  
	
	возврат Найдено;	
	
КонецФункции // ()


