#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	ПодтвержденСкладом = Ложь;
	ПодтвержденОтделомКачества = Ложь;
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	Документы.ПересчетТоваров.ИнициализироватьНовыйРасчетОтклонения(ЭтотОбъект);
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Ссылка.ПодтвержденСкладом И ЭтотОбъект.ПодтвержденСкладом Тогда
		ЭтотОбъект.ДатаПодтвержденияСкладом = ТекущаяДата();
	ИначеЕсли Ссылка.ПодтвержденСкладом И НЕ ЭтотОбъект.ПодтвержденСкладом Тогда 
		 ЭтотОбъект.ДатаПодтвержденияСкладом = Дата(1,1,1);
	КонецЕсли;
	
	Если НЕ Ссылка.ПодтвержденОтделомКачества И ЭтотОбъект.ПодтвержденОтделомКачества Тогда
		ЭтотОбъект.ДатаПодтвержденияОтделомКачества = ТекущаяДата();
	ИначеЕсли Ссылка.ПодтвержденОтделомКачества И НЕ ЭтотОбъект.ПодтвержденОтделомКачества Тогда 
		ЭтотОбъект.ДатаПодтвержденияОтделомКачества = Дата(1,1,1);
	КонецЕсли;    
	 
	УчетСкрыт = СкрытьКоличествоУчета();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Блокировки

&НаСервере
Процедура СоздатьБлокировку(ПричинаБлокировки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	БылаПометкаУдаления = Ложь;
	ДокБлокировка = Документы.БлокировкаДвиженияТоваров.НайтиПоРеквизиту("ДокументОснование", ЭтотОбъект.Ссылка);
	Если ДокБлокировка = Документы.БлокировкаДвиженияТоваров.ПустаяСсылка() Тогда
		ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
	Иначе
		ДокументБлокировки = ДокБлокировка.ПолучитьОбъект();
		БылаПометкаУдаления = ДокБлокировка.ПометкаУдаления;
		ДокументБлокировки.УстановитьПометкуУдаления(Ложь);
		Если Не БылаПометкаУдаления Тогда // если была пометка, то отмену сделала предыдущая строка
			ДокументБлокировки.Записать(РежимЗаписиДокумента.ОтменаПроведения); // чтобы товары, которые уже были заблокированы при пересчете отклонений отобразились как незаблокированные, чтоб их тоже можно было заблокировать
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Склад", ЭтотОбъект.Склад);
	ПараметрыЗаполнения.Вставить("ДокументОснование", ЭтотОбъект.Ссылка);
	ПараметрыЗаполнения.Вставить("Статус", Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
	ПараметрыЗаполнения.Вставить("ПричинаБлокировки", Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(ПричинаБлокировки));
	ПараметрыЗаполнения.Вставить("Комментарий", "Создан на минусовые отклонения");
	ТоварыВПараметры = ПолучитьТЗТовары(ЭтотОбъект.Товары.Выгрузить());
	Если ТоварыВПараметры.Количество() < 1 Тогда
		Сообщить("Блокировку создавать не на что. Возможно блокируемые товары уже заблокированы");
		// возвращаем исходное состояние документа блокировки, если он был
		Если ДокБлокировка <> Документы.БлокировкаДвиженияТоваров.ПустаяСсылка() Тогда
			ДокументБлокировки.Записать(РежимЗаписиДокумента.Проведение);
			ДокументБлокировки.УстановитьПометкуУдаления(БылаПометкаУдаления);
		КонецЕсли;
	Иначе
		ПараметрыЗаполнения.Вставить("Товары", ТоварыВПараметры);
		Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировки, ПараметрыЗаполнения, Истина);	
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗТовары(тзТовары)
	
	ТЗ = тзТовары.СкопироватьКолонки();
	
	Для Каждого стр Из тзТовары Цикл
		Отклонение = Документы.ПересчетТоваров.НовыйРасчетОтклонения(стр, ЭтотОбъект.НовыйРасчетОтклонения); 
		Если Отклонение < 0 Тогда // Сделано, чтоб если оно и так положительное, то не было лишнего запроса
			УжеЗаблокированныхНаСкладе = ПолучитьНетНаСкладе(ЭтотОбъект.Дата, ЭтотОбъект.Склад, стр.Номенклатура);
			// Отклонение минусовое. И нужно, чтоб не блокировались те, которые уже заблокированы
			Отклонение = Отклонение + УжеЗаблокированныхНаСкладе;
		КонецЕсли;
		// Если Отклонение после учета заблокированных все равно минусовое, то блокируем
        Если Отклонение < 0 Тогда
            Остатки = Альтерра_СкладСервер.ПолучитьОстатки(стр.Номенклатура, стр.Характеристика, ЭтотОбъект.Склад, Истина);
			Отклонение = -Отклонение;
			Если Остатки > 0 Тогда
	            Если Остатки < Отклонение Тогда
	               стр.Количество = Остатки;
	               стр.КоличествоУпаковок = Остатки;
	            Иначе
	               стр.Количество = Отклонение;
	               стр.КоличествоУпаковок = Отклонение;
	            КонецЕсли;
	            ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), стр);
			КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

&НаСервере
Функция ПолучитьНетНаСкладе(ДатаОстатков, Склад, Номенклатура)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	БлокировкаОстатки.ПричинаБлокировки КАК ПричинаБлокировки,
	|	БлокировкаОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.БлокировкаДвиженияТоваров.Остатки(КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ), Склад = &Склад И ПричинаБлокировки В (&СписокПричин)) КАК БлокировкаОстатки
	|ГДЕ
	|	БлокировкаОстатки.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	// Причины блокировки, по которым уже нет товара на складе
   	СписокПричин = Новый Массив;
    //СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Брак"));
	//СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Брак от покупателей"));
	//СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Товар в паллетах, поддоны под товаром"));
	//СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Возврат поставщику"));
	//СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Для благотворительности"));
	//СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Сроки годности"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Пересортица"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Нет на складе"));
	//СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Брак на складе"));
    Запрос.УстановитьПараметр("СписокПричин", СписокПричин);
	Результат = Запрос.Выполнить().Выбрать();
	Количество = 0;
	Пока Результат.Следующий() Цикл
		Количество = Количество + Результат.КоличествоОстаток;
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

&НаСервере
Функция ПолучитьБлокировкиПоТоварам(ВсеТовары = Истина, Товар = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ВсеТовары Тогда
		ЗапросВыбораТоваров = " 
			|ВЫБРАТЬ
			|	Товары.Номенклатура,
			|	Товары.Характеристика
			|ПОМЕСТИТЬ
			|	втПересчетТоваров
			|ИЗ
			|	&Товары КАК Товары
			|;";
		Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДата());
			
	Иначе
		ЗапросВыбораТоваров = " 
			|ВЫБРАТЬ
			|	&Номенклатура КАК Номенклатура, 
			|	&Характеристика КАК Характеристика
			|ПОМЕСТИТЬ
			|	втПересчетТоваров
			|;";	
			
		Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Товар.Характеристика);
		Запрос.УстановитьПараметр("Склад", Товар.Склад);
		Запрос.УстановитьПараметр("ДатаОстатков", Товар.Дата);
	КонецЕсли;
		
	Запрос.Текст = ЗапросВыбораТоваров + Символы.ПС + " 
		|ВЫБРАТЬ
		|	ПересчетТоваров.Номенклатура КАК Номенклатура,
		|	ПересчетТоваров.Характеристика КАК Характеристика,
		|	БлокировкаОстатки.Склад КАК Склад,
		|	БлокировкаОстатки.ПричинаБлокировки КАК ПричинаБлокировки,
		|	БлокировкаОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	втПересчетТоваров КАК ПересчетТоваров
		|	СОЕДИНЕНИЕ
		|		РегистрНакопления.БлокировкаДвиженияТоваров.Остатки(КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ), Склад = &Склад
		|			И ПричинаБлокировки В (&СписокПричин)) КАК БлокировкаОстатки
		|	ПО ПересчетТоваров.Номенклатура = БлокировкаОстатки.Номенклатура
		|	И ПересчетТоваров.Характеристика = БлокировкаОстатки.Характеристика
		|УПОРЯДОЧИТЬ ПО
		|	ПересчетТоваров.Номенклатура,
		|	ПересчетТоваров.Характеристика,
		|	БлокировкаОстатки.ПричинаБлокировки
		|ИТОГИ ПО
		|	ПересчетТоваров.Номенклатура,
		|	ПересчетТоваров.Характеристика";
	
   	СписокПричин = Новый Массив;
    СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Брак"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Брак от покупателей"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Товар в паллетах, поддоны под товаром"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Возврат поставщику"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Для благотворительности"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Сроки годности"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Пересортица"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Нет на складе"));
	СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Брак на складе"));
    //+Альтерра 
    СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при перемещении (брак, излишки)"));
    СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при поступлении (брак, излишки)"));
    СписокПричин.Добавить(Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при поступлении (нет кода маркировки)"));
    //+
    Запрос.УстановитьПараметр("СписокПричин", СписокПричин);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаЗначенийБлокировок = Новый ТаблицаЗначений; 
	ТаблицаЗначенийБлокировок.Колонки.Добавить("Номенклатура");
	ТаблицаЗначенийБлокировок.Колонки.Добавить("Характеристика");
	ТаблицаЗначенийБлокировок.Колонки.Добавить("Блокировка");
	
	ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаХарактеристика.Следующий() Цикл
			
			ВыборкаДетальная = ВыборкаХарактеристика.Выбрать();
			
			БлокировкиТоваров = "";
			Пока ВыборкаДетальная.Следующий() Цикл
				
				Если БлокировкиТоваров <> "" Тогда
					БлокировкиТоваров = БлокировкиТоваров + ", " ;
				КонецЕсли;
				
				БлокировкиТоваров = БлокировкиТоваров + ВыборкаДетальная.ПричинаБлокировки + " - " +Строка(ВыборкаДетальная.КоличествоОстаток);
			КонецЦикла;
			
			СтрокаТаблицы = ТаблицаЗначенийБлокировок.Добавить();
			СтрокаТаблицы.Номенклатура = ВыборкаНоменклатура.Номенклатура;
			СтрокаТаблицы.Характеристика = ВыборкаХарактеристика.Характеристика;
			СтрокаТаблицы.Блокировка = БлокировкиТоваров;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаЗначенийБлокировок;
	
КонецФункции      

#КонецОбласти  

#Область ПересчетКоличества
 
&НаСервере
Функция ПересчитатьПоУчетуВДокументе(ТЗТовары, ТолькоДляНулевогоФакта = Истина) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  	
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Назначение КАК Назначение,
		|	Товары.Количество КАК Количество,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Товары.КоличествоФакт КАК КоличествоФакт,
		|	Товары.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
		|	Товары.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|	Товары.Отсканирован КАК Отсканирован
		|ПОМЕСТИТЬ ВР_Табл
		|ИЗ
		|	&Товары КАК Товары
		|ГДЕ
		|	&КоличествоФакт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА &НовыйРасчетОтклонения
		|			ТОГДА ЕСТЬNULL(ЯПХОстатки.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЯПХ,
		|	ВЫБОР
		|		КОГДА &НовыйРасчетОтклонения
		|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - ЕСТЬNULL(ЯПХОстатки.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПоУчетуВЗонеХранения,
		|	ВР_Табл.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|	ВР_Табл.Отсканирован КАК Отсканирован
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Табл КАК ВР_Табл
		|		ПО (ВР_Табл.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
		|			И (ВР_Табл.Характеристика = ТоварыНаСкладахОстатки.Характеристика)
		|			И (ВР_Табл.Назначение = ТоварыНаСкладахОстатки.Назначение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТоварыВЯчейкеПромежуточногоХранения.Номенклатура КАК Номенклатура,
		|			ТоварыВЯчейкеПромежуточногоХранения.Характеристика КАК Характеристика,
		|			ТоварыВЯчейкеПромежуточногоХранения.Назначение КАК Назначение,
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад КАК Склад,
		|			СУММА(ТоварыВЯчейкеПромежуточногоХранения.Количество) КАК КоличествоОстаток
		|		ИЗ
		|			РегистрСведений.ТоварыВЯчейкеПромежуточногоХранения КАК ТоварыВЯчейкеПромежуточногоХранения
		|		ГДЕ
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад = &Склад
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТоварыВЯчейкеПромежуточногоХранения.Номенклатура,
		|			ТоварыВЯчейкеПромежуточногоХранения.Характеристика,
		|			ТоварыВЯчейкеПромежуточногоХранения.Назначение,
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад) КАК ЯПХОстатки
		|		ПО (ЯПХОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
		|			И (ЯПХОстатки.Характеристика = ТоварыНаСкладахОстатки.Характеристика)
		|			И (ЯПХОстатки.Назначение = ТоварыНаСкладахОстатки.Назначение)
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Номенклатура В
		|			(ВЫБРАТЬ
		|				ВР_Табл.Номенклатура
		|			ИЗ
		|				ВР_Табл)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВР_Табл.Номенклатура,
		|	ВР_Табл.Характеристика,
		|	ВР_Табл.Назначение,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0),
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0),
		|	ВЫБОР
		|		КОГДА &НовыйРасчетОтклонения
		|			ТОГДА ЕСТЬNULL(ЯПХОстатки.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &НовыйРасчетОтклонения
		|			ТОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ЯПХОстатки.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВР_Табл.СпособВводаКоличестваТовара,
		|	ВР_Табл.Отсканирован
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ПРАВОЕ СОЕДИНЕНИЕ ВР_Табл КАК ВР_Табл
		|		ПО (ВР_Табл.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
		|			И (ВР_Табл.Характеристика = ТоварыНаСкладахОстатки.Характеристика)
		|			И (ВР_Табл.Назначение = ТоварыНаСкладахОстатки.Назначение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТоварыВЯчейкеПромежуточногоХранения.Номенклатура КАК Номенклатура,
		|			ТоварыВЯчейкеПромежуточногоХранения.Характеристика КАК Характеристика,
		|			ТоварыВЯчейкеПромежуточногоХранения.Назначение КАК Назначение,
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад КАК Склад,
		|			СУММА(ТоварыВЯчейкеПромежуточногоХранения.Количество) КАК КоличествоОстаток
		|		ИЗ
		|			РегистрСведений.ТоварыВЯчейкеПромежуточногоХранения КАК ТоварыВЯчейкеПромежуточногоХранения
		|		ГДЕ
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад = &Склад
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТоварыВЯчейкеПромежуточногоХранения.Номенклатура,
		|			ТоварыВЯчейкеПромежуточногоХранения.Характеристика,
		|			ТоварыВЯчейкеПромежуточногоХранения.Назначение,
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад) КАК ЯПХОстатки
		|		ПО (ЯПХОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
		|			И (ЯПХОстатки.Характеристика = ТоварыНаСкладахОстатки.Характеристика)
        |			И (ЯПХОстатки.Назначение = ТоварыНаСкладахОстатки.Назначение)";
	
		
	Если ТолькоДляНулевогоФакта	 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&КоличествоФакт", "Товары.КоличествоУпаковокФакт = 0"); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&КоличествоФакт", "ИСТИНА"); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Товары", ТЗТовары);
	Запрос.УстановитьПараметр("НовыйРасчетОтклонения", НовыйРасчетОтклонения);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТЗ;
КонецФункции

&После("ИнициализироватьДокумент")
Процедура Док_ИнициализироватьДокумент()
	Если ЭтотОбъект.Ссылка = Документы.ПересчетТоваров.ПустаяСсылка() И ЭтотОбъект.Склад.ИспользоватьСтатусыПересчетовТоваров Тогда
		ЭтотОбъект.Статус = Перечисления.СтатусыПересчетовТоваров.Подготовлено;
	КонецЕсли;	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьКоличествоПоУчету")
Процедура Док_ЗаполнитьКоличествоПоУчету()
	
#Вставка	
	Если Не ТипПересчета.ПересчитыватьУчетПриНулевомФакте Тогда
#КонецВставки
	
	Запрос = Новый Запрос;     
	
	Если СкладыСервер.ИспользоватьАдресноеХранение(Склад, Помещение, Дата) Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Упаковка КАК Упаковка,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Назначение КАК Назначение,
		|	Таблица.Серия КАК Серия,
		|	Таблица.Ячейка КАК Ячейка,
		|	Таблица.КоличествоФакт КАК КоличествоФакт,
		|	Таблица.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
		|	Таблица.НомерСтроки   
#Вставка
		|	,Таблица.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|	Таблица.Отсканирован КАК Отсканирован
#КонецВставки
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровСОстатками.Ячейка,
		|	ТаблицаТоваровСОстатками.Номенклатура,
		|	ТаблицаТоваровСОстатками.Характеристика,
		|	ТаблицаТоваровСОстатками.Назначение,
		|	ТаблицаТоваровСОстатками.Упаковка,
		|	ТаблицаТоваровСОстатками.Серия КАК Серия,
		|	СУММА(ТаблицаТоваровСОстатками.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ТаблицаТоваровСОстатками.Количество) КАК Количество,
		|	СУММА(ТаблицаТоваровСОстатками.КоличествоФакт) КАК КоличествоФакт,
		|	СУММА(ТаблицаТоваровСОстатками.КоличествоУпаковокФакт) КАК КоличествоУпаковокФакт 
#Вставка
		|	,ТаблицаТоваровСОстатками.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|	ТаблицаТоваровСОстатками.Отсканирован КАК Отсканирован
#КонецВставки
		|ПОМЕСТИТЬ ТаблицаТоваровСОстатками
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаНоменклатуры.Ячейка КАК Ячейка,
		|		ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|		ТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|		ТаблицаНоменклатуры.Назначение КАК Назначение,
		|		ТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|		ТаблицаНоменклатуры.Серия КАК Серия,
		|		0 КАК КоличествоУпаковок,
		|		0 КАК Количество,
		|		ТаблицаНоменклатуры.КоличествоФакт КАК КоличествоФакт,
		|		ТаблицаНоменклатуры.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт  
#Вставка
		|		,ТаблицаНоменклатуры.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|		ТаблицаНоменклатуры.Отсканирован КАК Отсканирован
#КонецВставки
		|	ИЗ
		|		ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|	ГДЕ
		|		ТаблицаНоменклатуры.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТаблицаНоменклатуры.Ячейка,
		|		ЕСТЬNULL(ТоварыВЯчейкахОстатки.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
		|		ЕСТЬNULL(ТоварыВЯчейкахОстатки.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
		|		ЕСТЬNULL(ТоварыВЯчейкахОстатки.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)),
		|		ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)),
		|		ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)),
		|		ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0),
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 0) = 0
		|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
		|			ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * &ТекстЗапросаКоэффициентУпаковки
		|		КОНЕЦ,
		|		0,
		|		0
#Вставка
		|		,ТаблицаНоменклатуры.СпособВводаКоличестваТовара,
		|		ТаблицаНоменклатуры.Отсканирован
#КонецВставки
		|	ИЗ
		|		ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(&ДатаОстатков, ) КАК ТоварыВЯчейкахОстатки
		|			ПО (ТоварыВЯчейкахОстатки.Ячейка = ТаблицаНоменклатуры.Ячейка)
		|				И (ВЫБОР
		|					КОГДА ТаблицаНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ТоварыВЯчейкахОстатки.Номенклатура = ТаблицаНоменклатуры.Номенклатура
		|				КОНЕЦ)
		|				И (ВЫБОР
		|					КОГДА ТаблицаНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ТоварыВЯчейкахОстатки.Характеристика = ТаблицаНоменклатуры.Характеристика
		|				КОНЕЦ)
		|				И (ВЫБОР
		|					КОГДА ТаблицаНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ТоварыВЯчейкахОстатки.Назначение = ТаблицаНоменклатуры.Назначение
		|				КОНЕЦ)
		|				И (ВЫБОР
		|					КОГДА ТаблицаНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ТоварыВЯчейкахОстатки.Серия = ТаблицаНоменклатуры.Серия
		|				КОНЕЦ)
		|				И (ВЫБОР
		|					КОГДА ТаблицаНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ТоварыВЯчейкахОстатки.Упаковка = ТаблицаНоменклатуры.Упаковка
		|				КОНЕЦ)
		|	ГДЕ
		|		(ТаблицаНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|				ИЛИ ТаблицаНоменклатуры.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|					И НЕ (ТоварыВЯчейкахОстатки.Номенклатура ЕСТЬ NULL
		|							И ТоварыВЯчейкахОстатки.Характеристика ЕСТЬ NULL
		|							И ТоварыВЯчейкахОстатки.Назначение ЕСТЬ NULL
		|							И ТоварыВЯчейкахОстатки.Упаковка ЕСТЬ NULL
		|							И ТоварыВЯчейкахОстатки.Серия ЕСТЬ NULL))) КАК ТаблицаТоваровСОстатками
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТоваровСОстатками.Ячейка,
		|	ТаблицаТоваровСОстатками.Упаковка,
		|	ТаблицаТоваровСОстатками.Характеристика,
		|	ТаблицаТоваровСОстатками.Назначение,
		|	ТаблицаТоваровСОстатками.Номенклатура,
		|	ТаблицаТоваровСОстатками.Серия  
#Вставка
		|	,ТаблицаНоменклатуры.СпособВводаКоличестваТовара,
		|	ТаблицаНоменклатуры.Отсканирован
#КонецВставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровСОстатками.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваровСОстатками.Характеристика КАК Характеристика,
		|	ТаблицаТоваровСОстатками.Назначение КАК Назначение,
		|	ТаблицаТоваровСОстатками.Упаковка КАК Упаковка,
		|	ТаблицаТоваровСОстатками.Ячейка КАК Ячейка,
		|	ТаблицаТоваровСОстатками.Серия КАК Серия,
		|	ТаблицаТоваровСОстатками.КоличествоУпаковок,
		|	ТаблицаТоваровСОстатками.Количество,
		|	ТаблицаТоваровСОстатками.КоличествоФакт,
		|	ТаблицаТоваровСОстатками.КоличествоУпаковокФакт,
		|	ЕСТЬNULL(ТаблицаНоменклатуры.НомерСтроки, &МаксимальноВозможноеКоличествоСтрокВТЧ) КАК НомерСтроки,
#Вставка
		|	ВЫБОР
		|		КОГДА &НовыйРасчетОтклонения
		|			ТОГДА ЕСТЬNULL(ЯПХОстатки.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЯПХ,
		|	ВЫБОР
		|		КОГДА &НовыйРасчетОтклонения
		|			ТОГДА ТаблицаТоваровСОстатками.КоличествоУпаковок - ЕСТЬNULL(ЯПХОстатки.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПоУчетуВЗонеХранения,
		|	ТаблицаНоменклатуры.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|	ТаблицаНоменклатуры.Отсканирован КАК Отсканирован,
#КонецВставки
		|	ЛОЖЬ КАК ИзлишекПорча
		|ИЗ
		|	ТаблицаТоваровСОстатками КАК ТаблицаТоваровСОстатками
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|		ПО ТаблицаТоваровСОстатками.Номенклатура = ТаблицаНоменклатуры.Номенклатура
		|			И ТаблицаТоваровСОстатками.Характеристика = ТаблицаНоменклатуры.Характеристика
		|			И ТаблицаТоваровСОстатками.Назначение = ТаблицаНоменклатуры.Назначение
		|			И ТаблицаТоваровСОстатками.Упаковка = ТаблицаНоменклатуры.Упаковка
		|			И ТаблицаТоваровСОстатками.Ячейка = ТаблицаНоменклатуры.Ячейка
		|			И ТаблицаТоваровСОстатками.Серия = ТаблицаНоменклатуры.Серия
#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТоварыВЯчейкеПромежуточногоХранения.Номенклатура КАК Номенклатура,
		|			ТоварыВЯчейкеПромежуточногоХранения.Характеристика КАК Характеристика,
		|			ТоварыВЯчейкеПромежуточногоХранения.Назначение КАК Назначение,
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад КАК Склад,
		|			СУММА(ТоварыВЯчейкеПромежуточногоХранения.Количество) КАК КоличествоОстаток
		|		ИЗ
		|			РегистрСведений.ТоварыВЯчейкеПромежуточногоХранения КАК ТоварыВЯчейкеПромежуточногоХранения
		|		ГДЕ
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад = &Склад
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТоварыВЯчейкеПромежуточногоХранения.Номенклатура,
		|			ТоварыВЯчейкеПромежуточногоХранения.Характеристика,
		|			ТоварыВЯчейкеПромежуточногоХранения.Назначение,
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад) КАК ЯПХОстатки
		|		ПО ТаблицаТоваровСОстатками.Номенклатура = ЯПХОстатки.Номенклатура
		|			И ТаблицаТоваровСОстатками.Характеристика = ЯПХОстатки.Характеристика
		|			И ТаблицаТоваровСОстатками.Назначение = ЯПХОстатки.Назначение
#КонецВставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ВЫРАЗИТЬ(ТаблицаТоваровСОстатками.Ячейка КАК Справочник.СкладскиеЯчейки).РабочийУчасток,
		|	ВЫРАЗИТЬ(ТаблицаТоваровСОстатками.Ячейка КАК Справочник.СкладскиеЯчейки).ПорядокОбхода,
		|	ВЫРАЗИТЬ(ТаблицаТоваровСОстатками.Ячейка КАК Справочник.СкладскиеЯчейки).Код,
		|	ТаблицаТоваровСОстатками.Серия.Номер,
		|	ТаблицаТоваровСОстатками.Серия.ГоденДо";

		Запрос.Текст = СтрЗаменить(Запрос.Текст,
									"&ТекстЗапросаКоэффициентУпаковки",
									Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
										"ТоварыВЯчейкахОстатки.Упаковка",
										"ТоварыВЯчейкахОстатки.Номенклатура"));
		
		Запрос.УстановитьПараметр("МаксимальноВозможноеКоличествоСтрокВТЧ", 100000);
#Вставка
		Запрос.УстановитьПараметр("Склад", Склад);
#КонецВставки

	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Назначение КАК Назначение,
		|	Таблица.Серия КАК Серия,
		|	Таблица.КоличествоФакт КАК КоличествоФакт,
		|	Таблица.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
		|	Таблица.НомерСтроки
#Вставка
		|	,Таблица.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|	Таблица.Отсканирован КАК Отсканирован
#КонецВставки
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровСОстатками.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваровСОстатками.Характеристика КАК Характеристика,
		|	ТаблицаТоваровСОстатками.Назначение КАК Назначение,
		|	ТаблицаТоваровСОстатками.Серия КАК Серия,
		|	СУММА(ТаблицаТоваровСОстатками.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ТаблицаТоваровСОстатками.Количество) КАК Количество,
		|	СУММА(ТаблицаТоваровСОстатками.КоличествоФакт) КАК КоличествоФакт,
		|	СУММА(ТаблицаТоваровСОстатками.КоличествоУпаковокФакт) КАК КоличествоУпаковокФакт
#Вставка
		|	,ТаблицаТоваровСОстатками.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|	ТаблицаТоваровСОстатками.Отсканирован КАК Отсканирован
#КонецВставки
		|ПОМЕСТИТЬ ТаблицаТоваровСОстатками
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|		ТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|		ТаблицаНоменклатуры.Назначение КАК Назначение,
		|		ТаблицаНоменклатуры.Серия КАК Серия,
		|		0 КАК КоличествоУпаковок,
		|		0 КАК Количество,
		|		ТаблицаНоменклатуры.КоличествоФакт КАК КоличествоФакт,
		|		ТаблицаНоменклатуры.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт
#Вставка
		|		,ТаблицаНоменклатуры.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|		ТаблицаНоменклатуры.Отсканирован КАК Отсканирован
#КонецВставки
		|	ИЗ
		|		ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыНаСкладахОстатки.Номенклатура,
		|		ТоварыНаСкладахОстатки.Характеристика,
		|		ТоварыНаСкладахОстатки.Назначение,
		|		ТоварыНаСкладахОстатки.Серия,
		|		ТоварыНаСкладахОстатки.ВНаличииОстаток,
		|		ТоварыНаСкладахОстатки.ВНаличииОстаток,
		|		0,
		|		0
#Вставка
		|		,Таблица.СпособВводаКоличестваТовара,
		|		Таблица.Отсканирован
#КонецВставки
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&ДатаОстатков,
		|				(Номенклатура, Характеристика, Назначение, Склад, Помещение) В
		|					(ВЫБРАТЬ
		|						Таблица.Номенклатура,
		|						Таблица.Характеристика,
		|						Таблица.Назначение,
		|						&Склад,
		|						&Помещение
		|					ИЗ
#Удаление
		|						ТаблицаНоменклатуры КАК Таблица)) КАК ТоварыНаСкладахОстатки) КАК ТаблицаТоваровСОстатками
#КонецУдаления
#Вставка
		|						ТаблицаНоменклатуры КАК Таблица)) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНоменклатуры КАК Таблица
		|			ПО Таблица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|				И таблица.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|				И Таблица.Назначение = ТоварыНаСкладахОстатки.Назначение
		|				И Таблица.Серия = ТоварыНаСкладахОстатки.Серия) КАК ТаблицаТоваровСОстатками
#КонецВставки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТоваровСОстатками.Номенклатура,
		|	ТаблицаТоваровСОстатками.Характеристика,
		|	ТаблицаТоваровСОстатками.Назначение,
		|	ТаблицаТоваровСОстатками.Серия
#Вставка
		|	,ТаблицаТоваровСОстатками.СпособВводаКоличестваТовара,
		|	ТаблицаТоваровСОстатками.Отсканирован
#КонецВставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровСОстатками.Номенклатура,
		|	ТаблицаТоваровСОстатками.Характеристика,
		|	ТаблицаТоваровСОстатками.Назначение,
		|	ТаблицаТоваровСОстатками.Серия КАК Серия,
		|	ТаблицаТоваровСОстатками.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаТоваровСОстатками.Количество КАК Количество,
		|	ТаблицаТоваровСОстатками.КоличествоФакт КАК КоличествоФакт,
		|	ТаблицаТоваровСОстатками.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
		|	ТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
#Вставка
		|	ВЫБОР
		|		КОГДА &НовыйРасчетОтклонения
		|			ТОГДА ЕСТЬNULL(ЯПХОстатки.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЯПХ,
		|	ВЫБОР
		|		КОГДА &НовыйРасчетОтклонения
		|			ТОГДА ТаблицаТоваровСОстатками.КоличествоУпаковок - ЕСТЬNULL(ЯПХОстатки.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПоУчетуВЗонеХранения,
		|	ТаблицаНоменклатуры.СпособВводаКоличестваТовара КАК СпособВводаКоличестваТовара,
		|	ТаблицаНоменклатуры.Отсканирован КАК Отсканирован,
#КонецВставки
		|	ЛОЖЬ КАК ИзлишекПорча
		|ИЗ
		|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровСОстатками КАК ТаблицаТоваровСОстатками
		|		ПО ТаблицаНоменклатуры.Номенклатура = ТаблицаТоваровСОстатками.Номенклатура
		|			И ТаблицаНоменклатуры.Характеристика = ТаблицаТоваровСОстатками.Характеристика
		|			И ТаблицаНоменклатуры.Серия = ТаблицаТоваровСОстатками.Серия
		|			И ТаблицаНоменклатуры.Назначение = ТаблицаТоваровСОстатками.Назначение
#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТоварыВЯчейкеПромежуточногоХранения.Номенклатура КАК Номенклатура,
		|			ТоварыВЯчейкеПромежуточногоХранения.Характеристика КАК Характеристика,
		|			ТоварыВЯчейкеПромежуточногоХранения.Назначение КАК Назначение,
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад КАК Склад,
		|			СУММА(ТоварыВЯчейкеПромежуточногоХранения.Количество) КАК КоличествоОстаток
		|		ИЗ
		|			РегистрСведений.ТоварыВЯчейкеПромежуточногоХранения КАК ТоварыВЯчейкеПромежуточногоХранения
		|		ГДЕ
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад = &Склад
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТоварыВЯчейкеПромежуточногоХранения.Номенклатура,
		|			ТоварыВЯчейкеПромежуточногоХранения.Характеристика,
		|			ТоварыВЯчейкеПромежуточногоХранения.Назначение,
		|			ТоварыВЯчейкеПромежуточногоХранения.Склад) КАК ЯПХОстатки
		|		ПО ТаблицаТоваровСОстатками.Номенклатура = ЯПХОстатки.Номенклатура
		|			И ТаблицаТоваровСОстатками.Характеристика = ЯПХОстатки.Характеристика
		|			И ТаблицаТоваровСОстатками.Назначение = ЯПХОстатки.Назначение
#КонецВставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ТаблицаТоваровСОстатками.Серия.Номер,
		|	ТаблицаТоваровСОстатками.Серия.ГоденДо";

		Запрос.УстановитьПараметр("Ссылка",		Ссылка);
		Запрос.УстановитьПараметр("Склад",		Склад);
		Запрос.УстановитьПараметр("Помещение",	Помещение);

	КонецЕсли;

	ДатаОстатков = Новый Граница(Дата, ВидГраницы.Включая);

	Запрос.УстановитьПараметр("ДатаОстатков",			ДатаОстатков);
#Вставка
	Запрос.УстановитьПараметр("ДатаДок",				Дата);
	Запрос.УстановитьПараметр("НовыйРасчетОтклонения",  НовыйРасчетОтклонения);
#КонецВставки
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры",	Товары.Выгрузить());
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект,
		НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ПересчетТоваров)); 
#Вставка
	КонецЕсли;
#КонецВставки

	УчетныеДанныеЗаполнены = Истина;

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Ссылка.Просчитано Тогда 
		РегистрыСведений.ПроверкаЦенников.ЗаписьВРегистре(Ссылка);
	КонецЕсли;
	//ЗаполнитьПриходРасход();
КонецПроцедуры



#КонецОбласти  

#КонецОбласти  

Функция  СкрытьКоличествоУчета()Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);  
	ОграничениеДоступностиОстатков = АльтерраОбщегоНазначения.ПолучитьОграничениеДоступностиОстатков();
	Если ОграничениеДоступностиОстатков Тогда
		СкрытьКоличествоУчетаВПересчетах = РабочийУчасток.СкрытьКоличествоПоУчету;
	Иначе
		СкрытьКоличествоУчетаВПересчетах = Склад.СкрытьКоличествоУчетаВПересчетах;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);   
	
	Возврат	 СкрытьКоличествоУчетаВПересчетах;
КонецФункции 

Процедура ЗаполнитьПриходРасход()
	Проверка = ЕстьСтатусПересчетовТоваров(ЭтотОбъект.Склад);
	Если ТипЗнч(Проверка) = Тип("Булево") Тогда
		Если Проверка Тогда
			СписокНоменклатуры = Новый Массив;
			Для каждого Строка из ЭтотОбъект.Товары Цикл
				СписокНоменклатуры.Добавить(Строка.Номенклатура);
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура,
				|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииПриход КАК Приход,
				|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииРасход КАК Расход
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания,,, Номенклатура В
				|		(&СписокНоменклатуры)) КАК ТоварыНаСкладахОстаткиИОбороты
				|ГДЕ
				|	ТоварыНаСкладахОстаткиИОбороты.Склад = &Склад";
			
			Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
			Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаНачала", ЭтотОбъект.Дата);
			Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				МассивПоСтроке = ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Назначение", ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Характеристика, ВыборкаДетальныеЗаписи.Назначение));
				Для каждого Строка из МассивПоСТроке Цикл
					Если Строка.КоличествоУпаковокОтклонение<>0 Тогда
						Строка.Приход = ВыборкаДетальныеЗаписи.Приход;
						Строка.Расход = ВыборкаДетальныеЗаписи.Расход;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Функция ЕстьСтатусПересчетовТоваров(Склад)
	СтруктураПараметров = Новый Структура("Склад", Склад);
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыПересчетовТоваров", СтруктураПараметров);	
КонецФункции

#КонецЕсли

&ИзменениеИКонтроль("ПроверитьДругиеПересчеты")
Процедура Док_ПроверитьДругиеПересчеты(Отказ)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыКОформлениюИзлишковНедостач");

	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");

	СтатусБыл = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");

	Если Статус = Перечисления.СтатусыПересчетовТоваров.Выполнено
		ИЛИ СтатусБыл = Перечисления.СтатусыПересчетовТоваров.Выполнено Тогда
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Иначе
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	КонецЕсли;

	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Серия,
	|	ТаблицаТовары.НомерСтроки
	|ПОМЕСТИТЬ ВТТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	#Удаление
	|	ВТТаблицаТовары.НомерСтроки
	#КонецУдаления
	#Вставка
	|	ВТТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ПересчетТоваровТовары.Ссылка.Номер КАК НомерДокумента,
	|	ПересчетТоваровТовары.Ссылка.Дата КАК Дата
	#КонецВставки
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаТовары КАК ВТТаблицаТовары
	|		ПО (ВТТаблицаТовары.Номенклатура = ПересчетТоваровТовары.Номенклатура)
	|			И (ВТТаблицаТовары.Характеристика = ПересчетТоваровТовары.Характеристика)
	|			И (ВТТаблицаТовары.Серия = ПересчетТоваровТовары.Серия)
	|ГДЕ
	|	ПересчетТоваровТовары.Ссылка.Склад = &Склад
	|	И ПересчетТоваровТовары.Ссылка.Помещение = &Помещение
	|	И ПересчетТоваровТовары.Ссылка.Проведен
	|	И НЕ ПересчетТоваровТовары.Ссылка = &Ссылка
	|	И ПересчетТоваровТовары.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.ВРаботе), ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.ВнесениеРезультатов))
	|
	|СГРУППИРОВАТЬ ПО
	#Удаление
	|	ВТТаблицаТовары.НомерСтроки";
	#КонецУдаления
	#Вставка
	|	ВТТаблицаТовары.НомерСтроки,
	|	ПересчетТоваровТовары.Ссылка.Номер,
	|	ПересчетТоваровТовары.Ссылка.Дата";
	#КонецВставки

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("ТаблицаТовары", Товары.Выгрузить());

	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	Результат = МассивРезультатовЗапроса[1]; // РезультатЗапроса
	ВыборкаПересчеты = Результат.Выбрать();
	Пока ВыборкаПересчеты.Следующий() Цикл
		#Удаление
		ТекстСообщения = НСтр("ru = 'Товар в строке %НомерСтроки% уже включен в пересчеты товаров в статусе ""В работе"" или ""Внесение результатов"" на этом же складе (помещении).'");
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("ru = 'Товар в строке %НомерСтроки% уже включен в пересчеты товаров №%NNNN% от %ДД.ММ.ГГГГ% в статусе ""В работе"" или ""Внесение результатов"" на этом же складе (помещении).'");
		#КонецВставки
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", ВыборкаПересчеты.НомерСтроки);
		#Вставка
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%NNNN%", ВыборкаПересчеты.НомерДокумента);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДД.ММ.ГГГГ%", Формат(ВыборкаПересчеты.Дата,"Дф=дд.ММ.гггг"));
		#КонецВставки
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ВыборкаПересчеты.НомерСтроки, "НомерСтроки");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,Поле,"Объект",Отказ);
	КонецЦикла;

КонецПроцедуры

