
&НаКлиенте
Процедура НомерПриИзменении(Элемент)
    ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыПродажи,"Номер",Номер,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыПродажи, "ТипДокумента",ТипДокумента,ВидСравненияКомпоновкиДанных.Равно,Истина);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "Состояние",ПредопределенноеЗначение("Перечисление.СостоянияЗаказовКлиентов.Закрыт"),ВидСравненияКомпоновкиДанных.НеРавно,,?(Состояние="Все",Ложь,Истина));
	
КонецПроцедуры
 
#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ДанныеЗвонка") Тогда 
		ДатаНачалаЗвонка = ТекущаяДата(); 
		ИдентификаторЗвонкаВАТС = Параметры.ДанныеЗвонка.ИдентификаторЗвонкаВАТС; 
		НомерТелефонаВходящий = Параметры.ДанныеЗвонка.НомерТелефонаАбонента;
		ЗаполнитьГруппуВходящие(НомерТелефонаВходящий);	
	Иначе
		УстановитьВидимостьГруппРабочейОбластиФормы(Истина);
	КонецЕсли;
	
	ТекущийСотрудник = Пользователи.ТекущийПользователь();
	Элементы.НачислитьББЗаИдею.Видимость = Ложь;
		
	ВнутреннийНомер = ТелефонияСервер.ВнутреннийНомерПользователя();
	
	ПриИзмененииОтбораМоиЗаказы();

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Заказы, "Состояние",Перечисления.СостоянияЗаказовКлиентов.Закрыт,Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыПродажи,"Номер",Номер,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Партнеры, "ТелефонПартнера",Справочники.ВидыКонтактнойИнформации.ТелефонПартнера,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Партнеры, "ПочтаПартнера",Справочники.ВидыКонтактнойИнформации.EmailПартнера,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыПродажи, "ТипДокумента","1",ВидСравненияКомпоновкиДанных.Равно,Истина);

	УстановитьВидимостьКомандФормы();
 
	ЗаполнитьНастройкиХранилища();
		
КонецПроцедуры

Процедура ПриИзмененииОтбораМоиЗаказы()
	
	Если Не ЗначениеЗаполнено(ОтборМоиЗаказы) Тогда
		ОтборМоиЗаказы = ТекущийСотрудник;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЖурналКЦ, "Менеджер", ОтборМоиЗаказы,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьЗапросыНаПерезвон", 15, Ложь);
	ПодключитьОбработчикОжидания("ОткрытьТекущийЗвонок", 2, Ложь);
	ПодключитьОбработчикОжидания("ЗакрытьТекущийЗвонок", 2, Ложь); 
	ПодключитьОбработчикОжидания("ОбновитьОчередьЗвонков", 3, Ложь); 

	//Секундомер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Обработка.РабочееМестоОператораCallЦентра.ВходящийЗвонок" Тогда
		ЗаполнитьГруппуВходящие(Параметр.ДанныеЗвонка.НомерТелефонаАбонента);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	Декорация2НажатиеНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.Реквизит1Ссылка Тогда 
		ОткрытьЗначение(Элемент.ТекущиеДанные.ЗаказНаДоставку);
	Иначе
		ОткрытьЗначение(Элемент.ТекущиеДанные.ФИОКлиента);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоФилиалуПриИзменении(Элемент)
	
	УстановитьПериодОбзвона();
	УстановитьЗапросЗаказыНаДоставку(ПолучитьПодразделение());
	Примечание="Фильтр: "+Строка(ОтборПоФилиалу);

КонецПроцедуры

&НаКлиенте
Процедура ПериодОбзвонаПриИзменении(Элемент)
	
	УстановитьПериодОбзвона();
	УстановитьЗапросЗаказыНаДоставку(ПолучитьПодразделение());
	
КонецПроцедуры

&НаКлиенте
Процедура ТиШаблонаСМСПриИзменении(Элемент)
	
	ТиШаблонаСМСПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтборПоФилиалу1ПриИзмененииНаСервере()
	
	ОпределениеШаблона(ОтборПоФилиалу); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоФилиалу1ПриИзменении(Элемент)
	
	ОтборПоФилиалу1ПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроверкиСвязиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаПроверкиСвязи.ТекущиеДанные;
	ТелефонияКлиент.ПозвонитьПоНомеру(ТекущаяСтрока.Номер,,,""); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросыНаПерезвон1ПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ЗапросыНаПерезвон1.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда  
		НомерТелефонаИсходящий = ТекущаяСтрока.АбонентКакСвязаться;
	КонецЕсли;  
	
КонецПроцедуры

 &НаКлиенте
Процедура ЖурналКЦ1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ЖурналКЦ1.ТекущиеДанные;
    ОткрытьЗначение(ТекущаяСтрока.Ссылка);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПапкаДляВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ДиалогВыбораПути = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    ДиалогВыбораПути.ПроверятьСуществованиеФайла = Истина;
    ДиалогВыбораПути.МножественныйВыбор = Ложь;
    ДиалогВыбораПути.Заголовок = "Выберите папку файла выгрузки";
 
    Если ДиалогВыбораПути.Выбрать() Тогда     
        ПапкаДляВыгрузки = ДиалогВыбораПути.Каталог;
    Иначе
        Возврат;
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьЗапросовНаЗвонокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ОчередьЗапросовНаЗвонок.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда  
		НомерТелефонаИсходящий = ТекущаяСтрока.НомерТелефона;
		АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефонаИсходящий);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЖурналКЦ1ПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.ЖурналКЦ1.ТекущиеДанные;
	НомерТелефонаИсходящий = АльтерраОбщегоНазначения.ПолучитьТелефонПартнера(ТекущаяСтрока.Партнер);
КонецПроцедуры

#Область ОбработчикиКомандФормы   

&НаКлиенте
Процедура Включить(Команда)
	
	Элементы.Декорация4.Заголовок = "Состояние линии: Вход выполнен";
	Элементы.Включить.Доступность = Ложь;       
	Элементы.Выключить.Доступность = Истина;    
	
	ВключитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Выключить(Команда)

	Элементы.Декорация4.Заголовок = "Состояние линии: Выход выполнен";
	Элементы.Выключить.Доступность = Ложь;
	Элементы.Включить.Доступность = Истина;

	ВыключитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РабочееОкно(Команда)
	
    УстановитьВидимостьКомандФормы(Не Элементы.ДокументыПродажи.Видимость);
    УстановитьВидимостьГруппРабочейОбластиФормы(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Входящие(Команда)

    УстановитьВидимостьГруппРабочейОбластиФормы(,Истина);   
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтернетЗаказы(Команда)
	
	УстановитьВидимостьГруппРабочейОбластиФормы(,,,,,Истина);  
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПродажи(Команда)
	
	УстановитьВидимостьГруппРабочейОбластиФормы(,,,,,,,,Истина);  

КонецПроцедуры

&НаКлиенте
Процедура ПартнерКонтрагенты(Команда)
	
	УстановитьВидимостьГруппРабочейОбластиФормы(,,Истина);  

КонецПроцедуры

&НаКлиенте
Процедура ОбращенияКлиента(Команда)
	
	УстановитьВидимостьГруппРабочейОбластиФормы(,,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	
	НомерТелефонаВБуферОбмена();   
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПартнера(Команда)
	
	НайтиПартнераНаСервере(ПоискКлиента);  
	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)

	ЗапросНаПерезвон = Истина;
	ТекущаяСтрока = Элементы.ОчередьЗапросовНаЗвонок.ТекущиеДанные;
	
	ТелефонияКлиент.ПозвонитьПоНомеру(НомерТелефонаИсходящий, Партнер, , "");	
	ЗаполнитьГруппуВходящие(НомерТелефонаИсходящий);

	Если Не ТекущаяСтрока = Неопределено Тогда  
		ОчиститьОчередь(Новый Структура("ДатаЗвонка,НомерТелефона",ТекущаяСтрока.ДатаЗвонка,ТекущаяСтрока.НомерТелефона)); 
	КонецЕсли; 
	
	ЗаполнитьОчередьЗапросовНаЗвонок();

КонецПроцедуры

&НаКлиенте
Процедура Исходящие(Команда)
	
	УстановитьВидимостьГруппРабочейОбластиФормы(,,,,Истина);
	Если Не ЗначениеЗаполнено(ВидыОбзвонов) Тогда
		УстановитьВидимостьОбзвонов();
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваДоставки") Тогда
		УстановитьВидимостьОбзвонов(Истина);
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок") Тогда
		УстановитьВидимостьОбзвонов(,Истина);
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ") Тогда
		УстановитьВидимостьОбзвонов(,,Истина);
		Элементы.НачислитьББЗаИдею.Видимость = Истина;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонПричинВозвратаТовара") Тогда
		УстановитьВидимостьОбзвонов(,,,Истина);
		Элементы.ОценкаПоЗвонку.Видимость = Ложь;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку") Тогда    //обзвон качества работы КЦ
		УстановитьВидимостьОбзвонов(,,,,Истина);
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки") Тогда
		УстановитьВидимостьОбзвонов(,,,,,Истина);
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера") Тогда	
		УстановитьВидимостьОбзвонов(,,,,,,Истина);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)

	ОтправитьСМСНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура SMSпомощник(Команда)
	
  УстановитьВидимостьГруппРабочейОбластиФормы(,,,,,,Истина);   
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПродажи(Команда)
	
	ДополнительныеОтчетыИОбработкиКлиент.ОткрытьВариантДополнительногоОтчета(ПолучитьСсылкуНаОтчет("Анализ показателей менеджеров"),"Анализ показателей менеджеров по отделам (КЦ)");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОтметкиКассы(Команда)
	
	ДополнительныеОтчетыИОбработкиКлиент.ОткрытьВариантДополнительногоОтчета(ПолучитьСсылкуНаОтчет("Закрытие дня"),"30132b70-9f38-4c8c-843d-ec8dea23158c"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗвонки(Команда)

	ДополнительныеОтчетыИОбработкиКлиент.ОткрытьВариантДополнительногоОтчета(ПолучитьСсылкуНаОтчет("Журнал звонков новый"),"0944b5d7-3872-4b8a-b26f-e8da5829c16a"); 
	
КонецПроцедуры

&НаКлиенте
Процедура Отчеты(Команда)
	
	УстановитьВидимостьКомандФормы(,Не Элементы.ОтчетЗвонки.Видимость); 
	
КонецПроцедуры

&НаКлиенте
Процедура Логистика(Команда)
	
	УстановитьВидимостьКомандФормы(,,Не Элементы.ДоставкаПоиск.Видимость);   
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСвязи(Команда)
	
	Элементы.ТаблицаПроверкиСвязи.Видимость = Не Элементы.ТаблицаПроверкиСвязи.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ДоставкаИнтервалы(Команда)

	ПараметрыФормы = Новый Структура("МониторИнтервалов", Истина);
	ОткрытьФорму("Справочник.ИнтервалыДоставки.Форма.ФормаВыбораВРейсе", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПоиск(Команда)
	
    УстановитьВидимостьГруппРабочейОбластиФормы(,,,,,,,Истина);  

КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПрайс(Команда) 
	
	ОткрытьФорму("Обработка.КартографическийИнтерфейсДоставка.Форма.Карта",); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьКлиента(Команда)
	
	ОткрытьФорму("Справочник.Партнеры.Форма.ФормаЭлемента");

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборПоКлиенту(Команда)
	
	ДокументыПродажи.Отбор.Элементы.Очистить();
	ИсторияЗвонков.Отбор.Элементы.Очистить();
	ОбращенияКлиентов.Отбор.Элементы.Очистить();   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСохранить(Команда)
	
	ЗакрытьНаСервере(); 
	ЗапросНаПерезвон = Ложь;
	
	ПодключитьОбработчикОжидания("ОткрытьТекущийЗвонок", 2, Ложь); 
		
КонецПроцедуры
 
&НаКлиенте
Процедура МоиЗаказы(Команда)
	
	УстановитьВидимостьГруппРабочейОбластиФормы(,,,,,,,,,Истина);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросыНаПерезвон(Команда)
	
	УстановитьВидимостьГруппРабочейОбластиФормы(,,,,,,,,,,Истина);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтбор(Команда)

	ЖурналКЦ.Отбор.Элементы.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)



	ТекСтрока = Неопределено;
	ОпределитьВидЗвонков(ТекСтрока);

	ОценкаКачестваДоставки = ТекСтрока.ОценкаКачестваДоставки;
	ПартнерОбзвона = ТекСтрока.ФИОКлиента;
	СоздатьЗаписьВРегистр(ОценкаКачестваДоставки, ПартнерОбзвона);
	ОценкаПоЗвонку = "";
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьВидЗвонков(ТекСтрока)
	
	Если ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваДоставки") Тогда
		ТекСтрока = Элементы.Реквизит1.ТекущиеДанные
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок") Тогда
		ТекСтрока = Элементы.ОбзвонКачестваКрупныхПокупок.ТекущиеДанные
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ") Тогда
		ТекСтрока = Элементы.ОбзвонУдобстваРаботыВИМ.ТекущиеДанные
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонПричинВозвратаТовара") Тогда
		ТекСтрока = Элементы.ОбзвонПричинВозвратаТовара.ТекущиеДанные
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку") Тогда
		ТекСтрока = Элементы.ОбзвонКачестваРаботыКЦ.ТекущиеДанные
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки") Тогда
		ТекСтрока = Элементы.ОбзвонРаботыКорзинки.ТекущиеДанные
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера")  Тогда
		ТекСтрока = Элементы.ОбзвонКачестваРаботыОсновногоМенеджера.ТекущиеДанные
	КонецЕсли;
	
	Возврат ТекСтрока

КонецФункции
	
	
	
	
&НаСервере
Процедура СоздатьЗаписьВРегистр(ОценкаКачестваДоставки, ПартнерОбзвона, Недозвон = Ложь)
	
	ДанныеОбзвонов = РегистрыСведений.ДанныеОбзвонов;
	НаборЗапись = ДанныеОбзвонов.СоздатьНаборЗаписей();
	
	НаборЗапись.Отбор.ОбъектОбзвона.Установить(ОбъектОбзвона); 
	НаборЗапись.Отбор.ВидОбзвона.Установить(ВидыОбзвонов);
	НаборЗапись.Прочитать();
	
	Если НаборЗапись.Количество() = 0 Тогда
	    Запись = НаборЗапись.Добавить();
	    Запись.ОбъектОбзвона = ОбъектОбзвона;
	    Запись.ВидОбзвона = ВидыОбзвонов; 
	Иначе
		Запись = НаборЗапись[0];
	КонецЕсли;
	Запись.Период = ТекущаяДата();
    Запись.НомерТелефона = НомерТелефонаИсходящий; 
	Запись.Комментарий = Комментарий;
	Если ОценкаПоЗвонку <> Неопределено Тогда
		Запись.Оценка = ОценкаПоЗвонку;
	Иначе
		Запись.Оценка = Перечисления.ОценкиКлиентов.НетОценки
	КонецЕсли;
	Если Недозвон Тогда
		Запись.Комментарий = "Недозвон"
	КонецЕсли;
	Если ОценкаКачестваДоставки <> Неопределено Тогда
		Запись.ОценкаКачестваДоставки = ОценкаКачестваДоставки;
	КонецЕсли;
	Запись.Примечание = Примечание;
	Запись.Пользователь = Пользователи.ТекущийПользователь();
	Запись.Партнер = Партнер;
	НаборЗапись.Записать(); 

КонецПроцедуры


&НаКлиенте
Процедура СохранитьВExcel(Команда)     
	
	Если ПустаяСтрока(ПапкаДляВыгрузки) Тогда
		Сообщить("Выберите каталог для выгрузки!");
	Иначе
		СохранитьВExcelНаСервере();     
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Перезвонить(Команда)
	
	ТелефонияКлиент.ПозвонитьПоНомеру(НомерТелефонаВходящий, Партнер, , "");	

КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьИнтернетЗаказ(Команда)
	ТекущаяСтрока = Элементы.ЖурналКЦ1.ТекущиеДанные;
	ДатаНачалаЗвонка = ТекущаяДата();
	Если НомерТелефонаИсходящий <> "" Тогда
		ТелефонияКлиент.ПозвонитьПоНомеру(АльтерраОбщегоНазначения.ПолчитьТелефонБезКода(НомерТелефонаИсходящий), текущаяСтрока.Партнер, , "");
	Иначе
		Сообщить("Не введен номер телефона");
	КонецЕсли;
	ЗаполнитьДатуПервогоЗвонка(ТекущаяСтрока.Ссылка);
	Элементы.ПозвонитьИнтернетЗаказ.Видимость = Ложь;
	Элементы.ЗаказыЗавершитьРазговор.Видимость = Истина;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьДатуПервогоЗвонка(Ссылка)
	ДокОбъект = Ссылка.ПолучитьОбъект();
	Если ДокОбъект.ДатаПервогоЗвонка = Дата(1,1,1) Тогда
		ДокОбъект.ДатаПервогоЗвонка = ТекущаяДата();
		ДокОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРазговор(Команда)
	Элементы.ПозвонитьИнтернетЗаказ.Видимость = Истина;
	Элементы.ЗаказыЗавершитьРазговор.Видимость = Ложь;
	ТекущаяСтрока = Элементы.ЖурналКЦ1.ТекущиеДанные;
	ДополнительныеПараметры = Новый Структура("Ссылка, Дата", ТекущаяСтрока.Ссылка, ТекущаяДата());
	
	СтрокаВопроса = "На звонок ответили?";
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОДозвоне", ЭтотОбъект, ДополнительныеПараметры);   
	ПоказатьВопрос(Оповещение, СтрокаВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОДозвоне(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьУспешныйРазговор(Истина, ДопПараметры);
	Иначе
		ЗаписатьУспешныйРазговор(Ложь, ДопПараметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьУспешныйРазговор(ОтвеченныйЗвонок, ДопПараметры)
	ДокОбъект = ДопПараметры.Ссылка.ПолучитьОбъект();
	ДлительностьРазговора = ДопПараметры.Дата-ДатаНачалаЗвонка;
	ДокОбъект.ДлительностьЗвонка = ДлительностьРазговора;
	ДокОбъект.УспешныйЗвонок = ОтвеченныйЗвонок;
	ДокОбъект.Записать();
КонецПроцедуры


&НаКлиенте
Процедура Недозвон(Команда)
	СоздатьЗаписьВРегистр(Неопределено, Партнер, Истина);
	Сообщить("Cоздана запись в регистр");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ВключитьНаСервере()
	
	ТелефонияСервер.ВходВОчередь();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыключитьНаСервере()
	
	ТелефонияСервер.ВыходИзОчереди();
	
КонецПроцедуры

&НаСервере
Процедура Декорация2НажатиеНаСервере()

	ТелефонияСервер.СтатусОчереди();	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуВходящие(НомерТелефонаВходящий)
	
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефонаВходящий); 
	
	НомерТелефона = НомерТелефонаВходящий;
	
	Партнер = АльтерраОбщегоНазначения.ПолучитьПартнераПоТелефону(НомерТелефона);
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		
		Если БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Партнер) Тогда
			Баллы = БонусыАльтерра.ПолучитьИнформациюПоБаллам(ТекущаяДата(),Партнер); 
			Статус = ПолучитьСтатусПартнера(Партнер);
			ИнформацияПоБонуснойПрограмме = "Доступно баллов: " + Строка(Баллы.ДоступныеБаллы) + Символы.ПС + "Статус участника по бонусной программе: " + Статус; 
		КонецЕсли;
		
		ДокументыПродажи.Отбор.Элементы.Очистить();
		ИсторияЗвонков.Отбор.Элементы.Очистить();
		ОбращенияКлиентов.Отбор.Элементы.Очистить();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыПродажи, "Партнер", Партнер, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗвонков, "АбонентКонтакт", Партнер, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОбращенияКлиентов, "Клиент", Партнер, ВидСравненияКомпоновкиДанных.Равно,,Истина);
				
	КонецЕсли;  
	
	УстановитьВидимостьЭлементовПоТипуПартнера(Партнер);
	УстановитьВидимостьГруппРабочейОбластиФормы(,Истина); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомандФормы(ГруппаРабочееОкно=Ложь,ГруппаОтчеты=Ложь,ГруппаЛогистика=Ложь)
	
	Элементы.ДокументыПродажи.Видимость = ГруппаРабочееОкно; 
	Элементы.ПартнерКонтрагенты.Видимость = ГруппаРабочееОкно; 
	Элементы.ОбращенияКлиента.Видимость = ГруппаРабочееОкно; 
	
	Элементы.ОтчетЗвонки.Видимость = ГруппаОтчеты;  
	Элементы.ОтчетЗвонкиСтарый.Видимость = ГруппаОтчеты; 
	Элементы.ОтчетПродажи.Видимость = ГруппаОтчеты; 
	Элементы.ОтчетОтметкиКассы.Видимость = ГруппаОтчеты; 
	
	Элементы.ДоставкаИнтервалы.Видимость = ГруппаЛогистика; 
	Элементы.ДоставкаПоиск.Видимость = ГруппаЛогистика; 
	Элементы.ДоставкаПрайс.Видимость = ГруппаЛогистика; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппРабочейОбластиФормы(Гр1=Ложь,Гр2=Ложь,Гр3=Ложь,Гр4=Ложь,Гр5=Ложь,Гр6=Ложь,Гр7=Ложь,Гр8=Ложь,Гр9=Ложь,Гр10=Ложь,Гр11=Ложь, Гр12=Ложь)
		
	Элементы.ОбластьНачальнаяСтраница.Видимость = Гр1;
	Элементы.ОбластьВходящие.Видимость = Гр2;
	Элементы.ОбластьПартнерКонрагенты.Видимость = Гр3;
	Элементы.ОбластьОбращения.Видимость = Гр4;
	Элементы.ГруппаОбзвонов.Видимость = Гр5;
	Элементы.ОбластьЗаказКлиентов.Видимость = Гр6;
	Элементы.ОбластьSMSПомощник.Видимость = Гр7;
	Элементы.ОбластьЗаказыНаДоставку.Видимость = Гр8;
	Элементы.ОбластьДокументыПродажи.Видимость = Гр9;
	Элементы.ОбластьЖурналКЦ.Видимость = Гр10;
	Элементы.ОбластьЗапросыНаПерезвон.Видимость = Гр11; 
	Элементы.ОбластьЧерныйСписок.Видимость = Гр12;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗапросыНаПерезвон() Экспорт 
	
	Попытка
		Если ЭтаФорма.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ЗаполнитьОчередьЗапросовНаЗвонок();

	КоличествоЗапросов = ОчередьЗапросовНаЗвонок.Количество();
	Если КоличествоЗапросов > 0 Тогда
		Элементы.ЗапросыНаПерезвон.Заголовок = "Запросы на перезвон (" + Строка(КоличествоЗапросов) + ")";  
	Иначе
		Элементы.ЗапросыНаПерезвон.Заголовок = "Запросы на перезвон";  	
	КонецЕсли;     
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОчередьЗвонков() Экспорт 
	
	Попытка
		Если ЭтаФорма.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Элементы.Декорация2.Заголовок = ПолучитьОчередьНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущийЗвонок() Экспорт  
	
	Попытка
		Если ЭтаФорма.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ПолучитьТекущийЗвонок(ТекущийСотрудник) Тогда
		ЭтаФорма.Активизировать();
		ОтключитьОбработчикОжидания("ОткрытьТекущийЗвонок");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьТекущийЗвонок() Экспорт  
	
	Попытка
		Если ЭтаФорма.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ЗавершитьТекущийЗвонок(ТекущийСотрудник) Тогда
		ЭтаФорма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийЗвонок(ТекущийСотрудник)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТекущиеВходящиеЗвонки.АбонентОтКого КАК АбонентОтКого,
		|	ТекущиеВходящиеЗвонки.НомерТелефонаАбонента КАК НомерТелефонаАбонента,
		|	ТекущиеВходящиеЗвонки.ИдентификаторЗвонкаВАТС КАК ИдентификаторЗвонкаВАТС
		|ИЗ
		|	РегистрСведений.ТекущиеВходящиеЗвонки КАК ТекущиеВходящиеЗвонки
		|ГДЕ
		|	ТекущиеВходящиеЗвонки.ПользовательКому = &ПользовательКому
		|   И Не ТекущиеВходящиеЗвонки.Завершен";
	
	Запрос.УстановитьПараметр("ПользовательКому", ТекущийСотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДатаНачалаЗвонка = ТекущаяДата(); 
		ИдентификаторЗвонкаВАТС = ВыборкаДетальныеЗаписи.ИдентификаторЗвонкаВАТС; 
		НомерТелефонаВходящий = ВыборкаДетальныеЗаписи.НомерТелефонаАбонента;
		ЗаполнитьГруппуВходящие(НомерТелефонаВходящий);	
		
		Набор = РегистрыСведений.ТекущиеВходящиеЗвонки.СоздатьНаборЗаписей();
	    Набор.Отбор.ПользовательКому.Установить(ТекущийСотрудник);
	    Набор.Записать();

		Возврат Истина;
		
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ЗавершитьТекущийЗвонок(ТекущийСотрудник)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Истина
		|ИЗ
		|	РегистрСведений.ТекущиеВходящиеЗвонки КАК ТекущиеВходящиеЗвонки
		|ГДЕ
		|	ТекущиеВходящиеЗвонки.ПользовательКому = &ПользовательКому
		|   И ТекущиеВходящиеЗвонки.Завершен";
	
	Запрос.УстановитьПараметр("ПользовательКому", ТекущийСотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
			
		Набор = РегистрыСведений.ТекущиеВходящиеЗвонки.СоздатьНаборЗаписей();
	    Набор.Отбор.ПользовательКому.Установить(ТекущийСотрудник);
	    Набор.Записать();

		Возврат Истина;
		
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОчередьНаСервере()

	Возврат	ТелефонияСервер.СтатусОчереди(); 
	
КонецФункции

&НаКлиенте
Процедура НомерТелефонаВБуферОбмена()
	
	Телефон_ = НомерТелефонаВходящий;
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(Телефон_);
	HTML = Новый COMОбъект("htmlfile");
	HTML.parentWindow.clipboardData.setData("Text",Телефон_);  
	
КонецПроцедуры

&НаСервере
Процедура НайтиПартнераНаСервере(ТекстПоиска)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Партнер
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.Наименование ПОДОБНО ""%"" + &Наименование + ""%""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Партнеры.Ссылка
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
		|		ПО ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Представление ПОДОБНО ""%"" + &Наименование + ""%""";
	
	Запрос.УстановитьПараметр("Наименование", ТекстПоиска);
	
	Если Не ПустаяСтрока(ТекстПоиска) Тогда
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		СписокПартнеров.Загрузить(РезультатЗапроса);
		
		Элементы.СписокПартнеров.Видимость = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоТипуПартнера(Партнер)
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		Если Партнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
			ВидимостьГруппыФЛ=Истина;
			ВидимостьГруппыЮЛ=Ложь;
			ВидимостьНовый=Ложь;
		Иначе
			ВидимостьГруппыФЛ=Ложь;
			ВидимостьГруппыЮЛ=Истина;
			ВидимостьНовый=Ложь;
		КонецЕсли;
	Иначе
		ВидимостьГруппыФЛ=Ложь;
		ВидимостьГруппыЮЛ=Ложь;
		ВидимостьНовый=Истина;
	КонецЕсли;
	
	Элементы.ГруппаФЛ.Видимость=ВидимостьГруппыФЛ;
	Элементы.ГруппаЮЛ.Видимость=ВидимостьГруппыЮЛ;
	Элементы.ГруппаНовый.Видимость=ВидимостьНовый;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделение()
	
	МассивПодразделений = Новый Массив();
	
	Если ОтборПоФилиалу = "" Тогда
		ОтборПоФилиалу = "Барнаул";
	КонецЕсли;
	
	Если ОтборПоФилиалу = "ЦБ" ИЛИ ОтборПоФилиалу = "Все" Тогда
		МассивПодразделений.Добавить(Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000001"));
	КонецЕсли;
	
	Если ОтборПоФилиалу = "Барнаул" ИЛИ ОтборПоФилиалу = "Все" Тогда
		МассивПодразделений.Добавить(Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000002"));
	КонецЕсли; 
	
	Если  ОтборПоФилиалу = "Выбор" ИЛИ ОтборПоФилиалу = "Все" Тогда
		МассивПодразделений.Добавить(Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000003"));
	КонецЕсли;	
	
	Если  ОтборПоФилиалу = "Бийск" ИЛИ ОтборПоФилиалу = "Все" Тогда
		МассивПодразделений.Добавить(Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000004"));
	КонецЕсли;
	
	Если  ОтборПоФилиалу = "Майма" ИЛИ ОтборПоФилиалу = "Все" Тогда
		МассивПодразделений.Добавить(Справочники.СтруктураПредприятия.НайтиПоКоду("01-000002"));
	КонецЕсли;
	
	Примечание = "Фильтр: "+Строка(ОтборПоФилиалу);

	Возврат МассивПодразделений;
	
КонецФункции

&НаСервере
Процедура УстановитьЗапросЗаказыНаДоставку(Подразделения)
	
	ОценкаДоставки.Очистить();
	
	Для каждого Подразделение из Подразделения Цикл
				
		ОценкаДоставкиПоЗапросу = Обработки.РабочееМестоОператораCallЦентра.ПолучитьВыборкуЗаказовНаДоставкуДляОценки(ПериодОбзвона.ДатаНачала,ПериодОбзвона.ДатаОкончания,Подразделение); 	
		
		Для каждого Строка из ОценкаДоставкиПоЗапросу Цикл
			
			НоваяСтрока = ОценкаДоставки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			
		КонецЦикла;   
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ТиШаблонаСМСПриИзмененииНаСервере()
	
	Если ТиШаблонаСМС = "Адрес" Тогда
		Элементы.ОтборПоФилиалу1.Видимость = Истина;
	Иначе
		Элементы.ОтборПоФилиалу1.Видимость = Ложь;
		ОпределениеШаблона(ТиШаблонаСМС);
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ОпределениеШаблона(Тип="")
	
	Структура = ДопМодуль.ПолучитьНастройкиХранилища("ШаблоныSMSРабочееМестоОператораCallЦентра");  
	
	ТекстСМС = Структура[Тип];
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСМСНаСервере()
	
	АльтерраОбщегоНазначения.ОтправитьСМС(НомерТелефонаВходящий,ТекстСМС);  
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаОтчет(ИмяОбработки) 
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяОбработки);     
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкиХранилища()
	
	Структура = ДопМодуль.ПолучитьНастройкиХранилища("ШаблоныSMSРабочееМестоОператораCallЦентра"); 
	ТаблицаПроверкиСвязи.Загрузить(Структура["НомераТелефонов"]);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусПартнера(Партнер)  
	
	Статус = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СрезПоследних(, Партнер = &Партнер) КАК СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Статус = ВыборкаДетальныеЗаписи.Статус; 
	КонецЦикла;
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Процедура ЗакрытьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗвонка = "" Тогда 
		Сообщить("Тип обращения не выбран! Звонок не закрыт.");
		Возврат;
	Иначе 
	ТелефонияСервер.СоздатьСобытиеПоДаннымЗвонка(НомерТелефонаВходящий,Партнер,ДатаНачалаЗвонка,ИдентификаторЗвонкаВАТС, 
	Перечисления.ВходящееИсходящееСобытие.Входящее, Перечисления.ТипыОбращенийВCallЦентр[ТипЗвонка], Комментарий, ЗапросНаПерезвон); 
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
		
	НомерТелефонаВходящий = "";
	Партнер = Неопределено;
	ИнформацияПоБонуснойПрограмме = ""; 
	Комментарий = "";
	ТипЗвонка = "";
	ДокументыПродажи.Отбор.Элементы.Очистить();
	ИсторияЗвонков.Отбор.Элементы.Очистить();
	ОбращенияКлиентов.Отбор.Элементы.Очистить(); 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(ЗаказНаДоставку)
	
	ДокументОбъект = ЗаказНаДоставку.ПолучитьОбъект();
	ДокументОбъект.КомментарийПоДоставке = Комментарий; 
	ДокументОбъект.ОценкаПоЗвонку = ОценкаПоЗвонку; 
	ДокументОбъект.Записать();   
	
КонецПроцедуры

&НаКлиенте
Процедура Секундомер()
	
	СекундомерHTML =
	"<html>
	|	<head>
	|		<script language='JavaScript' type='text/javascript'>
	|			var running = 0;
	|			var startTime = 0;
	|			var savedTime = 0;
	|			
	|			document.startStop = function() {startStop()};
	|			document.clearClock = function() {clearClock()};
	|		 
	|			function clearClock() {
	|				running = 0;
	|               document.savedTime = savedTime + new Date().getTime() - startTime;
	|				savedTime = 0;
	|				document.getElementById('stopwatch').innerHTML = '00:00:00';
	|				
	|		 	}
	|		
	|		 
	|		 	function startStop() {
	|			
	|				if (running == 0){
	|					running = 1;
	|					startTime = new Date().getTime();
	|					showTime(); 
	|				} else {
	|					running = 0;
	|					savedTime = savedTime + new Date().getTime() - startTime;
	|					updateText(savedTime);
	|					document.savedTime = savedTime}
	|			}
	|		
	|		
	|		 	function showTime() {
	|				if (running == 0){return};
	|				updateText(savedTime + new Date().getTime() - startTime);
	|				setTimeout('showTime()', 10);
	|			}
	|		
	|		
	|			function updateText(seconds) {
	|				time = new Date(seconds);
	|				var hours = time.getUTCHours().toString();
	|				var minutes = time.getMinutes().toString();
	|				var seconds = time.getSeconds().toString();
	|				
	|				if (hours.length < 2) {hours = '0' + hours;}
	|				if (minutes.length < 2) {minutes = '0' + minutes;}
	|				if (seconds.length < 2) {seconds = '0' + seconds;}
	|		
	|				document.getElementById('stopwatch').innerHTML = hours + ':' + minutes + ':' + seconds;
	|		 	}
	|			
	|			</script> 
	|	</head>		
	|			
	|	<body style='text-align: center; color:red; overflow: hidden'>
	|		<h1 id='stopwatch'> 00:00:00</h1>
	|	</body>
	|	
	|</html>";
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВExcelНаСервере()
	Если ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваДоставки") Тогда
		ТаблицаЗначений = ОценкаДоставки;
		Фильтр = ОтборПоФилиалу;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок") Тогда
		ТаблицаЗначений = ОбзвонКачестваКрупныхПокупок;
		Фильтр = СпособПолучения;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ") Тогда
		ТаблицаЗначений = ОбзвонУдобстваРаботыВИМ;
		Фильтр = "";
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонПричинВозвратаТовара") Тогда
		ТаблицаЗначений = ОбзвонПричинВозвратаТовара;
		Фильтр = ВидКлиентаВозвратТоваров;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку") Тогда    
		ТаблицаЗначений = ОбзвонКачестваРаботыКЦ;
		Фильтр = Строка(НомераКЦ);
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки") Тогда
		ТаблицаЗначений = ОбзвонРаботыКорзинки;
		Фильтр = Строка(МестоОплаты) + " Сумма больше " + Строка(МинимальнаяСумма);
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера") Тогда
		ТаблицаЗначений = ОбзвонКачестваРаботыОсновногоМенеджера;
		Фильтр = "";
	КонецЕсли;
	Обработки.РабочееМестоОператораCallЦентра.СохранитьВExcelНаСервере(ТаблицаЗначений,ПапкаДляВыгрузки, ВидыОбзвонов, Фильтр);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодОбзвона()
	
	Если ПериодОбзвона.ДатаНачала = Дата(1,1,1) ИЛИ ПериодОбзвона.ДатаОкончания = Дата(1,1,1) Тогда
		ПериодОбзвона.ДатаНачала = НачалоМесяца(ТекущаяДата());
		ПериодОбзвона.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОчередьЗапросовНаЗвонок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧерныйСписок.КонтактныеДанные КАК КонтактныеДанные
		|ПОМЕСТИТЬ ВТ_Исключения
		|ИЗ
		|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОчередьЗапросовНаОбратныйЗвонок.ДатаЗвонка КАК ДатаЗвонка,
		|	ОчередьЗапросовНаОбратныйЗвонок.Подразделение КАК Подразделение,
		|	ОчередьЗапросовНаОбратныйЗвонок.Партнер КАК Партнер,
		|	ОчередьЗапросовНаОбратныйЗвонок.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	РегистрСведений.ОчередьЗапросовНаОбратныйЗвонок КАК ОчередьЗапросовНаОбратныйЗвонок
		|ГДЕ
		|	НЕ ОчередьЗапросовНаОбратныйЗвонок.Выполнен
		|	И НЕ ОчередьЗапросовНаОбратныйЗвонок.НомерТелефона В
		|				(ВЫБРАТЬ
		|					ВТ_Исключения.КонтактныеДанные КАК НомерТелефона
		|				ИЗ
		|					ВТ_Исключения)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ОчередьЗапросовНаЗвонок.Загрузить(РезультатЗапроса);

		
КонецПроцедуры  

&НаСервере
Процедура ОчиститьОчередь(ПараметрыЗапроса)
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Набор = РегистрыСведений.ОчередьЗапросовНаОбратныйЗвонок.СоздатьНаборЗаписей();
	
	Набор.Отбор.ДатаЗвонка.Установить(ПараметрыЗапроса.ДатаЗвонка);
	Набор.Отбор.НомерТелефона.Установить(ПараметрыЗапроса.НомерТелефона);
	Набор.Прочитать();
	Если Набор.Количество()>0 Тогда
		Запись = Набор[0];
		Запись.Выполнен = Истина;
		Запись.ДатаВыполнения = ТекущаяДата();
		Запись.Оператор = ТекущийСотрудник;
		Набор.Записать();
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры  

&НаКлиенте
Процедура СписокПартнеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СписокПартнеров.ТекущиеДанные; 
	Если ТекущаяСтрока <> Неопределено Тогда
		ЗаполнитьПоПартнеру(ТекущаяСтрока.Партнер);   
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПартнеру(Партнер)
		
	Если ЗначениеЗаполнено(Партнер) Тогда
		
		Если БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Партнер) Тогда
			Баллы = БонусыАльтерра.ПолучитьИнформациюПоБаллам(ТекущаяДата(),Партнер); 
			Статус = ПолучитьСтатусПартнера(Партнер);
			ИнформацияПоБонуснойПрограмме = "Доступно баллов: " + Строка(Баллы.ДоступныеБаллы) + Символы.ПС + "Статус участника по бонусной программе: " + Статус; 
		КонецЕсли;
		
		ДокументыПродажи.Отбор.Элементы.Очистить();
		ИсторияЗвонков.Отбор.Элементы.Очистить();
		ОбращенияКлиентов.Отбор.Элементы.Очистить();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыПродажи, "Клиент", Партнер, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗвонков, "АбонентКонтакт", Партнер, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОбращенияКлиентов, "Клиент", Партнер, ВидСравненияКомпоновкиДанных.Равно,,Истина);
				
	КонецЕсли;  
	
	УстановитьВидимостьЭлементовПоТипуПартнера(Партнер);
	УстановитьВидимостьГруппРабочейОбластиФормы(,Истина); 
		
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьКлиентаИзОбзвонаПоДоставкеПриИзменении(Элемент)
	
	ИсключитьКлиентаИзОбзвонаПоДоставкеСервер(Элементы.Реквизит1.ТекущиеДанные.Партнер); 
	
КонецПроцедуры

Процедура ИсключитьКлиентаИзОбзвонаПоДоставкеСервер(Партнер)
	
	РегистрыСведений.СобытияОбъектовАльтерра.ЗаписатьСобытие(Партнер, Справочники.СобытияОбъектовАльтерра.ИсключениеПартнераИзОбзвонаПоДоставке);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСостояниюСервер()
	
	Если Состояние = "ВсеОткрытые" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "Состояние", Перечисления.СостоянияЗаказовКлиентов.Закрыт, ВидСравненияКомпоновкиДанных.НеРавно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "ПометкаУдаления", Ложь,,, Истина);
		
	ИначеЕсли Состояние = "ВсеОжидающиеОплаты" Тогда
		
		МассивСостояний = Новый Массив();
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяАвансДоОбеспечения);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяПредоплатаДоОтгрузки);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "Состояние", МассивСостояний, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "ПометкаУдаления", Ложь,,, Истина);
		
	ИначеЕсли Состояние = "ВсеОжидающиеИсполнения" Тогда
		
		МассивСостояний = Новый Массив();
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяСогласование);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКОбеспечению);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОбеспечение);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКОтгрузке);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ВПроцессеОтгрузки);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКЗакрытию);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "Состояние", МассивСостояний, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "ПометкаУдаления", Ложь,,, Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "Состояние", Состояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Состояние));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналКЦ, "ПометкаУдаления",,,, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	
	УстановитьОтборПоСостояниюСервер();   
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораОтбораПоСостояниюСервер(СписокВыбора)
	
	СтандартнаяОбработка = Истина;
	Параметры = Новый Структура;
	
	СписокВыбора.Добавить("ВсеОткрытые", НСтр("ru='Все открытые'"));
	СписокВыбора.Добавить("ВсеОжидающиеОплаты", НСтр("ru='Все ожидающие оплаты'"));
	СписокВыбора.Добавить("ВсеОжидающиеИсполнения", НСтр("ru='Все ожидающие исполнения'"));
	
	СписокВыбора.Добавить(Перечисления.СостоянияЗаказовКлиентов.Закрыт);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОтработан(Команда)
	
	ТекущаяСтрока = Элементы.ОчередьЗапросовНаЗвонок.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда  
		ОчиститьОчередь(Новый Структура("ДатаЗвонка,НомерТелефона",ТекущаяСтрока.ДатаЗвонка,ТекущаяСтрока.НомерТелефона)); 
	КонецЕсли; 

	ЗаполнитьОчередьЗапросовНаЗвонок();

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПродажи1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДокументыПродажи1.ТекущиеДанные;
    ОткрытьЗначение(ТекущаяСтрока.Ссылка);  

КонецПроцедуры

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Заказы.ТекущиеДанные;
    ОткрытьЗначение(ТекущаяСтрока.Ссылка); 

КонецПроцедуры

&НаКлиенте
Процедура ОтборМоиЗаказыПриИзменении(Элемент)

	ПриИзмененииОтбораМоиЗаказы(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗвонкиСтарый(Команда)
	
	ДополнительныеОтчетыИОбработкиКлиент.ОткрытьВариантДополнительногоОтчета(ПолучитьСсылкуНаОтчет("Статистика запросов на обратный звонок"),"Статистика запросов)"); 

КонецПроцедуры

&НаКлиенте
Процедура ОбзвонДоставки(Команда)
	ТелефонияКлиент.ПозвонитьПоНомеру(НомерТелефонаИсходящий, Партнер, , "");	
КонецПроцедуры  

&НаКлиенте
Процедура ПолучитьДанныеОчереди(Команда)
	ОткрытьФорму("Обработка.РабочееМестоОператораCallЦентра.Форма.ФормаОчереди");	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьНомерИзОбзвона(Команда)
	ВводКомментарийДляЧСЗавершение = Новый ОписаниеОповещения("ВводКомментарийДляЧСЗавершение", ЭтотОбъект);
	ПоказатьВводСтроки(ВводКомментарийДляЧСЗавершение, "", "Введите причину добавления в ЧС");	
КонецПроцедуры

&НаКлиенте
Процедура ВводКомментарийДляЧСЗавершение(СтрокаВвода, ДопПараметры) Экспорт
   ИсключитьНомерИзОбзвонаНаСервере(НомерТелефонаИсходящий, СтрокаВвода);
	Если ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваДоставки") Тогда
		ТекСтрока = Элементы.Реквизит1;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок") Тогда
		ТекСтрока = Элементы.ОбзвонКачестваКрупныхПокупок;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ") Тогда
		ТекСтрока = Элементы.ОбзвонУдобстваРаботыВИМ;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонПричинВозвратаТовара") Тогда
		ТекСтрока = Элементы.ОбзвонПричинВозвратаТовара;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку") Тогда    //обзвон качества работы КЦ
		ТекСтрока = Элементы.ОбзвонКачестваРаботыКЦ;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки") Тогда
		ТекСтрока = Элементы.ОбзвонРаботыКорзинки;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера") Тогда
		ТекСтрока = Элементы.ОбзвонКачестваРаботыОсновногоМенеджера;
	Иначе
		ТекСтрока = Неопределено;
	КонецЕсли;
	ТекСтрока.ТекущиеДанные.Комментарий = "Номер добавлен в ЧС. "+ТекСтрока.ТекущиеДанные.Комментарий;
КонецПроцедуры


&НаСервере
Процедура ИсключитьНомерИзОбзвонаНаСервере(Телефон, КомментарийИсключения)
	РегистрыСведений.ЧерныйСписокКонтактов.ДобавитьЗапись(Телефон, КомментарийИсключения, Пользователи.ТекущийПользователь());
КонецПроцедуры   

&НаКлиенте
Процедура ЧерныйСписок(Команда)
	УстановитьВидимостьГруппРабочейОбластиФормы(,,,,,,,,,,,Истина);
КонецПроцедуры

	#Область Обзвоны
&НаКлиенте
Процедура ВидыОбзвоновОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НомерТелефонаИсходящий = ""; 
	Партнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	Элементы.ОценкаПоЗвонку.Видимость = Истина;
	Элементы.НачислитьББЗаИдею.Видимость = Ложь;
	ОценкаПоЗвонку = "";
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваДоставки") Тогда
		УстановитьВидимостьОбзвонов(Истина);
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок") Тогда
		УстановитьВидимостьОбзвонов(,Истина);
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ") Тогда
		УстановитьВидимостьОбзвонов(,,Истина);
		ЗагрузитьДанныеДляОбзвонаУдобстваРаботыВИМ();
		Элементы.НачислитьББЗаИдею.Видимость = Истина;
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонПричинВозвратаТовара") Тогда
		УстановитьВидимостьОбзвонов(,,,Истина);
		Элементы.ОценкаПоЗвонку.Видимость = Ложь;
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку") Тогда    //обзвон качества работы КЦ
		УстановитьВидимостьОбзвонов(,,,,Истина);
		Элементы.НомераКЦ.СписокВыбора.ЗагрузитьЗначения(ПолучитьВнутренниеНомера());
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки") Тогда
		УстановитьВидимостьОбзвонов(,,,,,Истина);
		//Элементы.МестоОплаты.СписокВыбора.ЗагрузитьЗначения(ПолучитьМестаОплаты());
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера") Тогда	
		УстановитьВидимостьОбзвонов(,,,,,,Истина);
		ЗагрузитьДанныеДляОбзвонаОценкиКачестваРаботыОсновногоМенеджера();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОбзвонов(Гр0=Ложь,Гр1=Ложь,Гр2=Ложь,Гр3=Ложь,Гр4=Ложь,Гр5=Ложь,Гр6=Ложь)
		
	Элементы.ОбластьИсходящие.Видимость = Гр0;
	Элементы.ОбластьКачестваКрупныхПокупок.Видимость = Гр1;
	Элементы.ОбластьОбзвонКачестваРаботыВИМ.Видимость = Гр2;
	Элементы.ОбластьПричиныВозвратаТовара.Видимость = Гр3;
	Элементы.ОбластьОбзвонКачестваРаботыКЦ.Видимость = Гр4;
	Элементы.ОбластьОбзвонРаботыКорзинки.Видимость = Гр5;
	Элементы.ОбластьОбзвонКачестваРаботыОсновногоМенеджера.Видимость = Гр6;

КонецПроцедуры

&НаСервере
Функция Получить5СлучайныхЗаписей(РезультатЗапроса, ТаблицаЗначений)

	ВыборкаТЗ = РезультатЗапроса.Выгрузить();
	ТаблицаЗначений.Очистить();
	КоличествоЗаписей = ВыборкаТЗ.Количество();
	Генератор = Новый ГенераторСлучайныхЧисел();
	
	МассивЗначений = Новый Массив;
	
	Если ВыборкаТЗ.Количество()>5 Тогда 
		Пока МассивЗначений.Количество()<5 Цикл
			Инд = Генератор.СлучайноеЧисло(0, КоличествоЗаписей - 1);
			Если МассивЗначений.Найти(Инд) = Неопределено Тогда
				МассивЗначений.Добавить(Инд);
				СтрокаТЗ = ТаблицаЗначений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, ВыборкаТЗ[инд]);
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТаблицаЗначений.Загрузить(ВыборкаТЗ);
	КонецЕсли;

КонецФункции 

&НаСервере
Процедура ЗагрузитьДанныеДляОбзвонаКачестваКрупныхПокупок()
	
	ОбзвонКачестваКрупныхПокупок.Очистить();
	ВидЖалобы = Новый Массив;
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000003"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000002"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000001"));
	
	Доставка = Новый Массив;
	Доставка.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги доставки", Истина));
	Доставка.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги 1СК", Истина));

	Если СпособПолучения = "Самовывоз" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
			|ПОМЕСТИТЬ ВТЧерныйСписок
			|ИЗ
			|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеЗвонков.Контрагент КАК Клиент
			|ПОМЕСТИТЬ ВТ_Исключения
			|ИЗ
			|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
			|ГДЕ
			|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
			|	И ДанныеЗвонков.ДатаСобытия > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ОбращениеКлиента.Клиент
			|ИЗ
			|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
			|ГДЕ
			|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
			|	И ОбращениеКлиента.ВидЖалобы В(&ВидЖалобы)
			|	И ОбращениеКлиента.Дата > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТДокументыСДоставкой
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
			|		ПО (ВидыНоменклатуры.Ссылка = РеализацияТоваровУслугТовары.Номенклатура.ВидНоменклатуры)
			|ГДЕ
			|	ВидыНоменклатуры.Ссылка В(&Доставка)
			|	И РеализацияТоваровУслугТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЧекККМТовары.Ссылка
			|ИЗ
			|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
			|		ПО ЧекККМТовары.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
			|ГДЕ
			|	ВидыНоменклатуры.Ссылка В(&Доставка)
			|	И ЧекККМТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Партнеры.Ссылка КАК ФИОКлиента,
			|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона,
			|	МАКСИМУМ(ЧекККМ.Ссылка) КАК ДокументПокупки,
			|	ДанныеОбзвонов.Оценка КАК ОценкаПоЗвонку,
			|	ДанныеОбзвонов.Комментарий КАК Комментарий
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
			|				ПО (ВидыНоменклатуры.Ссылка = ЧекККМТовары.Номенклатура.ВидНоменклатуры)
			|			ПО (ЧекККМТовары.Ссылка = ЧекККМ.Ссылка
			|				И ЧекККМ.Магазин.ФорматПодразделения = &ТСК
			|				И ЧекККМ.СуммаДокумента >= 300000
			|				И НЕ ЧекККМ.Ссылка В
			|							(ВЫБРАТЬ
			|								ВТДокументыСДоставкой.Ссылка
			|							ИЗ
			|								ВТДокументыСДоставкой КАК ВТДокументыСДоставкой)
			|				И ЧекККМТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30))
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|			ПО (ДанныеОбзвонов.ОбъектОбзвона = ЧекККМ.Ссылка)
			|				И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО Партнеры.Ссылка = ЧекККМ.Партнер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка
			|			И ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица"")
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка
			|			И Партнеры.ЮрФизЛицо = &ЮрФизЛицо
			|			И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%""
			|			И ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|ГДЕ
			|	НЕ Партнеры.Ссылка В
			|						(ВЫБРАТЬ
			|							ВТ_Исключения.Клиент КАК Клиент
			|						ИЗ
			|							ВТ_Исключения)
			|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|				(ВЫБРАТЬ
			|					ВТЧерныйСписок.Номер КАК Номер
			|				ИЗ
			|					ВТЧерныйСписок)
			|
			|СГРУППИРОВАТЬ ПО
			|	Партнеры.Ссылка,
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Партнеры.Ссылка,
			|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона),
			|	МАКСИМУМ(РеализацияТоваровУслуг.Ссылка),
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары   
			|			ПО (РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
			|				И РеализацияТоваровУслуг.Магазин.ФорматПодразделения = &ТСК
			|				И РеализацияТоваровУслуг.СуммаДокумента >= 300000
			|				И НЕ РеализацияТоваровУслуг.Ссылка В
			|							(ВЫБРАТЬ
			|								ВТДокументыСДоставкой.Ссылка
			|							ИЗ
			|								ВТДокументыСДоставкой КАК ВТДокументыСДоставкой)
			|				И РеализацияТоваровУслуг.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30))
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|			ПО (ДанныеОбзвонов.ОбъектОбзвона = РеализацияТоваровУслуг.Ссылка)
			|				И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО Партнеры.Ссылка = РеализацияТоваровУслуг.Партнер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка
			|			И ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица"")
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка
			|			И Партнеры.ЮрФизЛицо = &ЮрФизЛицо
			|			И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%""
			|			И ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|ГДЕ
			|	
			|	НЕ Партнеры.Ссылка В
			|						(ВЫБРАТЬ
			|							ВТ_Исключения.Клиент КАК Клиент
			|						ИЗ
			|							ВТ_Исключения)
			|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|				(ВЫБРАТЬ
			|					ВТЧерныйСписок.Номер КАК Номер
			|				ИЗ
			|					ВТЧерныйСписок)
			|
			|СГРУППИРОВАТЬ ПО
			|	Партнеры.Ссылка,
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	Партнеры.Ссылка КАК ФИОКлиента,
			|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона,
			|	МАКСИМУМ(ЧекККМ.Ссылка) КАК ДокументПокупки,
			|	ДанныеОбзвонов.Оценка КАК ОценкаПоЗвонку,
			|	ДанныеОбзвонов.Комментарий
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
			|				ПО (ВидыНоменклатуры.Ссылка = ЧекККМТовары.Номенклатура.ВидНоменклатуры)
			|			ПО (ЧекККМТовары.Ссылка = ЧекККМ.Ссылка
			|				И ЧекККМ.Магазин.ФорматПодразделения = &МД
			|				И ЧекККМ.СуммаДокумента >= 100000
			|				И НЕ ЧекККМ.Ссылка В
			|							(ВЫБРАТЬ
			|								ВТДокументыСДоставкой.Ссылка
			|							ИЗ
			|								ВТДокументыСДоставкой КАК ВТДокументыСДоставкой)
			|				И ЧекККМ.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30))
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|			ПО (ДанныеОбзвонов.ОбъектОбзвона = ЧекККМ.Ссылка)
			|				И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО Партнеры.Ссылка = ЧекККМ.Партнер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка
			|			И ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица"")
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка
			|			И Партнеры.ЮрФизЛицо = &ЮрФизЛицо
			|			И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%""
			|			И ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|ГДЕ
			|	НЕ Партнеры.Ссылка В
			|						(ВЫБРАТЬ
			|							ВТ_Исключения.Клиент КАК Клиент
			|						ИЗ
			|							ВТ_Исключения)
			|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|				(ВЫБРАТЬ
			|					ВТЧерныйСписок.Номер КАК Номер
			|				ИЗ
			|					ВТЧерныйСписок)
			|
			|СГРУППИРОВАТЬ ПО
			|	Партнеры.Ссылка,
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Партнеры.Ссылка,
			|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона),
			|	МАКСИМУМ(РеализацияТоваровУслуг.Ссылка),
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары   
			|			ПО (РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
			|				И РеализацияТоваровУслуг.Магазин.ФорматПодразделения = &МД
			|				И РеализацияТоваровУслуг.СуммаДокумента >= 100000
			|				И НЕ РеализацияТоваровУслуг.Ссылка В
			|							(ВЫБРАТЬ
			|								ВТДокументыСДоставкой.Ссылка
			|							ИЗ
			|								ВТДокументыСДоставкой КАК ВТДокументыСДоставкой)
			|				И РеализацияТоваровУслуг.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30))
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|			ПО (ДанныеОбзвонов.ОбъектОбзвона = РеализацияТоваровУслуг.Ссылка)
			|				И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО Партнеры.Ссылка = РеализацияТоваровУслуг.Партнер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка
			|			И ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица"")
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка
			|			И Партнеры.ЮрФизЛицо = &ЮрФизЛицо
			|			И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%""
			|			И ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|ГДЕ
			|	
			|	НЕ Партнеры.Ссылка В
			|						(ВЫБРАТЬ
			|							ВТ_Исключения.Клиент КАК Клиент
			|						ИЗ
			|							ВТ_Исключения)
			|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|				(ВЫБРАТЬ
			|					ВТЧерныйСписок.Номер КАК Номер
			|				ИЗ
			|					ВТЧерныйСписок)
			|
			|СГРУППИРОВАТЬ ПО
			|	Партнеры.Ссылка,
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий";
		
		Запрос.УстановитьПараметр("ВидЖалобы", ВидЖалобы);
		Запрос.УстановитьПараметр("Доставка", Доставка);
		Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("МД", Справочники.ФорматыПодразделений.НайтиПоКоду("000000001"));
		Запрос.УстановитьПараметр("ТСК", Справочники.ФорматыПодразделений.НайтиПоКоду("000000002"));
		Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
		Запрос.УстановитьПараметр("ВидОбзвона", Перечисления.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок);
		
		РезультатЗапроса = Запрос.Выполнить();
		
	Иначе
		ФорматПодразделения = Новый Массив;
		Если СпособПолучения = "ТСК" Тогда
			ФорматПодразделения.Добавить(Справочники.ФорматыПодразделений.НайтиПоКоду("000000002"));
			СуммаДокумента = 300000;
		Иначе
			ФорматПодразделения.Добавить(Справочники.ФорматыПодразделений.НайтиПоКоду("000000001"));
			СуммаДокумента = 100000;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
			|ПОМЕСТИТЬ ВТЧерныйСписок
			|ИЗ
			|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеЗвонков.Контрагент КАК Клиент
			|ПОМЕСТИТЬ ВТ_Исключения
			|ИЗ
			|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
			|ГДЕ
			|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
			|	И ДанныеЗвонков.ДатаСобытия > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ОбращениеКлиента.Клиент
			|ИЗ
			|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
			|ГДЕ
			|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
			|	И ОбращениеКлиента.ВидЖалобы В(&ВидЖалобы)
			|	И ОбращениеКлиента.Дата > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Партнеры.Ссылка КАК ФИОКлиента,
			|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона,
			|	МАКСИМУМ(ЧекККМ.Ссылка) КАК ДокументПокупки,
			|	ДанныеОбзвонов.Оценка КАК ОценкаПоЗвонку,
			|	ДанныеОбзвонов.Комментарий КАК Комментарий
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
			|				ПО (ВидыНоменклатуры.Ссылка = ЧекККМТовары.Номенклатура.ВидНоменклатуры)
			|			ПО (ЧекККМТовары.Ссылка = ЧекККМ.Ссылка)
			|				И (ЧекККМ.Магазин.ФорматПодразделения В (&ФорматПодразделения))
			|				И (ЧекККМ.СуммаДокумента >= &СуммаДокумента)
			|				И (ЧекККМ.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30))
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|			ПО (ДанныеОбзвонов.ОбъектОбзвона = ЧекККМ.Ссылка)
			|				И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО Партнеры.Ссылка = ЧекККМ.Партнер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка)
			|			И (ВЫБОР
			|				КОГДА ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ГруппыПартнеров""
			|					ТОГДА ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица""
			|			КОНЕЦ)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка)
			|			И (Партнеры.ЮрФизЛицо = &ЮрФизЛицо)
			|			И (ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%"")
			|			И (ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|ГДЕ
			|	НЕ Партнеры.Ссылка В
			|				(ВЫБРАТЬ
			|					ВТ_Исключения.Клиент КАК Клиент
			|				ИЗ
			|					ВТ_Исключения)
			|	И ВидыНоменклатуры.Ссылка В(&Доставка)
			|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|				(ВЫБРАТЬ
			|					ВТЧерныйСписок.Номер КАК Номер
			|				ИЗ
			|					ВТЧерныйСписок)
			|
			|СГРУППИРОВАТЬ ПО
			|	Партнеры.Ссылка,
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Партнеры.Ссылка,
			|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона),
			|	МАКСИМУМ(РеализацияТоваровУслуг.Ссылка),
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
			|				ПО (ВидыНоменклатуры.Ссылка = РеализацияТоваровУслугТовары.Номенклатура.ВидНоменклатуры)
			|			ПО (РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
			|				И РеализацияТоваровУслуг.Магазин.ФорматПодразделения В(&ФорматПодразделения)
			|				И РеализацияТоваровУслуг.СуммаДокумента >= &СуммаДокумента
			|				И РеализацияТоваровУслуг.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30))
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|			ПО (ДанныеОбзвонов.ОбъектОбзвона = РеализацияТоваровУслуг.Ссылка)
			|				И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО Партнеры.Ссылка = РеализацияТоваровУслуг.Партнер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка
			|			И ВЫБОР
			|					КОГДА ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ГруппыПартнеров""
			|						ТОГДА ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица""
			|				КОНЕЦ)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка
			|			И Партнеры.ЮрФизЛицо = &ЮрФизЛицо   
			|			И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%""
			|			И ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|ГДЕ
			|	НЕ Партнеры.Ссылка В
			|				(ВЫБРАТЬ
			|					ВТ_Исключения.Клиент КАК Клиент
			|				ИЗ
			|					ВТ_Исключения)
			|	И ВидыНоменклатуры.Ссылка В(&Доставка)
			|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|				(ВЫБРАТЬ
			|					ВТЧерныйСписок.Номер КАК Номер
			|				ИЗ
			|					ВТЧерныйСписок) 
			|
			|СГРУППИРОВАТЬ ПО
			|	Партнеры.Ссылка,
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий";
		
		Запрос.УстановитьПараметр("ВидЖалобы", ВидЖалобы);
		Запрос.УстановитьПараметр("Доставка", Доставка);
		Запрос.УстановитьПараметр("СуммаДокумента", СуммаДокумента);
		Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ФорматПодразделения", ФорматПодразделения);
		Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
		Запрос.УстановитьПараметр("ВидОбзвона", Перечисления.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок);
		
		РезультатЗапроса = Запрос.Выполнить();

	КонецЕсли;

	Если Не РезультатЗапроса.Пустой() Тогда
		Получить5СлучайныхЗаписей(РезультатЗапроса, ОбзвонКачестваКрупныхПокупок);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеДляОбзвонаПричинВозврата()

	ОбзвонПричинВозвратаТовара.Очистить();
	ВидЖалобы = Новый Массив;
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000003"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000002"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000001"));
	
	ПричинаВозврата = Новый Массив;
	ПричинаВозврата.Добавить(Справочники.ПричиныВозвратаТоваровДляОрганизации.НайтиПоКоду("000000027"));
	ПричинаВозврата.Добавить(Справочники.ПричиныВозвратаТоваровДляОрганизации.НайтиПоКоду("000000028"));
	ПричинаВозврата.Добавить(Справочники.ПричиныВозвратаТоваровДляОрганизации.НайтиПоКоду("000000035"));
	ПричинаВозврата.Добавить(Справочники.ПричиныВозвратаТоваровДляОрганизации.НайтиПоКоду("000000012"));
	ПричинаВозврата.Добавить(Справочники.ПричиныВозвратаТоваровДляОрганизации.НайтиПоКоду("000000032"));
	ПричинаВозврата.Добавить(Справочники.ПричиныВозвратаТоваровДляОрганизации.НайтиПоКоду("000000033"));
	
	Если ВидКлиентаВозвратТоваров = "Частное лицо" Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
			|ПОМЕСТИТЬ ВТЧерныйСписок
			|ИЗ
			|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеЗвонков.Контрагент КАК Клиент
			|ПОМЕСТИТЬ ВТ_Исключения
			|ИЗ
			|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
			|ГДЕ
			|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
			|	И ДанныеЗвонков.ДатаСобытия > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ОбращениеКлиента.Клиент
			|ИЗ
			|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
			|ГДЕ
			|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
			|	И ОбращениеКлиента.ВидЖалобы В(&ВидЖалобы)
			|	И ОбращениеКлиента.Дата > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Партнеры.Ссылка КАК ФИОКлиента,
			|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
			|	ВозвратТоваровОтКлиента.Ссылка КАК ДокументВозврата,
			|	ДанныеОбзвонов.Оценка КАК ОценкаПоЗвонку,
			|	ДанныеОбзвонов.Комментарий КАК Комментарий
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка
			|			И ВЫБОР
			|					КОГДА ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ГруппыПартнеров""
			|						ТОГДА ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица""
			|				КОНЕЦ)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка                                          
			|			И Партнеры.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
			|			И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона = """"
			|			И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%""
			|			И ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|				ПО (ДанныеОбзвонов.ОбъектОбзвона = ВозвратТоваровОтКлиента.Ссылка)
			|					И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО (ВозвратТоваровОтКлиента.Партнер = Партнеры.Ссылка 
			|			И ВозвратТоваровОтКлиента.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30)
			|			И ВозвратТоваровОтКлиента.ПричинаДляОрганизацииСпр В(&ПричинаВозврата))
			|ГДЕ
			|	НЕ Партнеры.Ссылка В
			|				(ВЫБРАТЬ
			|					ВТ_Исключения.Клиент КАК Клиент
			|				ИЗ
			|					ВТ_Исключения)
			|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|				(ВЫБРАТЬ
			|					ВТЧерныйСписок.Номер КАК Номер
			|				ИЗ
			|					ВТЧерныйСписок)";
		
		Запрос.УстановитьПараметр("ВидЖалобы", ВидЖалобы);
		Запрос.УстановитьПараметр("ПричинаВозврата", ПричинаВозврата);
		Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
		Запрос.УстановитьПараметр("ВидОбзвона", Перечисления.ВидыОбзвонов.ОбзвонПричинВозвратаТовара);

		РезультатЗапроса = Запрос.Выполнить();
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
			|ПОМЕСТИТЬ ВТЧерныйСписок
			|ИЗ
			|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеЗвонков.Контрагент КАК Клиент
			|ПОМЕСТИТЬ ВТ_Исключения
			|ИЗ
			|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
			|ГДЕ
			|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
			|	И ДанныеЗвонков.ДатаСобытия > &ТекущаяДата
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ОбращениеКлиента.Клиент
			|ИЗ
			|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
			|ГДЕ
			|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
			|	И ОбращениеКлиента.ВидЖалобы В (&ВидЖалобы)
			|	И ОбращениеКлиента.Дата > &ТекущаяДата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	пользователи.Ссылка КАК Пользователь
			|ПОМЕСТИТЬ ВТПользователи
			|ИЗ
			|	Справочник.Пользователи КАК пользователи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|		ПО (ДополнительныеСведения.Объект = пользователи.Ссылка
			|			И &УсловияДляОтделов)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Партнеры.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТПартнеры
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты КАК ВыручкаИСебестоимостьПродажОбороты
			|		ПО Партнеры.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер
			|			И &Выручка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПользователи КАК ВТПользователи
			|		ПО (ВТПользователи.Пользователь = Партнеры.ОсновнойМенеджер)
			|ГДЕ
			|	НЕ Партнеры.Ссылка В
			|				(ВЫБРАТЬ
			|					ВТ_Исключения.Клиент КАК Клиент
			|				ИЗ
			|					ВТ_Исключения)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Партнеры.Ссылка КАК ФИОКлиента,
			|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона,
			|	МАКСИМУМ(ВозвратТоваровОтКлиента.Ссылка) КАК ДокументВозврата,
			|	ДанныеОбзвонов.Оценка КАК ОценкаПоЗвонку,
			|	ДанныеОбзвонов.Комментарий КАК Комментарий
			|ИЗ
			|	ВТПартнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка)
			|			И (НЕ ПартнерыКонтактнаяИнформация.НомерТелефона = """")
			|			И (ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%"")
			|			И (ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|			И (НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|						(ВЫБРАТЬ
			|							ВТЧерныйСписок.Номер КАК Номер
			|						ИЗ
			|							ВТЧерныйСписок))
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|			ПО (ДанныеОбзвонов.ОбъектОбзвона = ВозвратТоваровОтКлиента.Ссылка)
			|				И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО (ВозвратТоваровОтКлиента.Партнер = Партнеры.Ссылка)
			|			И (ВозвратТоваровОтКлиента.Дата >= &ТекущаяДата)
			|			И (ВозвратТоваровОтКлиента.ПричинаДляОрганизацииСпр В (&ПричинаВозврата))
			|
			|СГРУППИРОВАТЬ ПО
			|	Партнеры.Ссылка,
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Партнеры.Ссылка,
			|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона),
			|	МАКСИМУМ(КорректировкаРеализации.Ссылка),
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий
			|ИЗ
			|	ВТПартнеры КАК Партнеры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка)
			|			И (НЕ ПартнерыКонтактнаяИнформация.НомерТелефона = """")
			|			И (ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%"")
			|			И (ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
			|			И (НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
			|						(ВЫБРАТЬ
			|							ВТЧерныйСписок.Номер КАК Номер
			|						ИЗ
			|							ВТЧерныйСписок))
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
			|			ПО (ДанныеОбзвонов.ОбъектОбзвона = КорректировкаРеализации.Ссылка)
			|				И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
			|		ПО (КорректировкаРеализации.Партнер = Партнеры.Ссылка)
			|			И (КорректировкаРеализации.Дата >= &ТекущаяДата)
			|
			|СГРУППИРОВАТЬ ПО
			|	Партнеры.Ссылка,
			|	ДанныеОбзвонов.Оценка,
			|	ДанныеОбзвонов.Комментарий";

		Если ВидКлиентаВозвратТоваров = "КО" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияДляОтделов", "ДополнительныеСведения.Значение.Наименование = ""Коммерческий отдел""");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Выручка", "ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот >= 150000
													 |			 И ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот <= 1000000");
			
		ИначеЕсли ВидКлиентаВозвратТоваров = "ОД" ТОгда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияДляОтделов", "ДополнительныеСведения.Значение.Наименование = ""Отдел дистрибуции""");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Выручка", "ИСТИНА");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидЖалобы", ВидЖалобы);
		Запрос.УстановитьПараметр("ПричинаВозврата", ПричинаВозврата);
		Запрос.УстановитьПараметр("ТекущаяДата", ДобавитьМесяц(ТекущаяДата(), -1));
		Запрос.УстановитьПараметр("ВидОбзвона", Перечисления.ВидыОбзвонов.ОбзвонПричинВозвратаТовара);
		
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Получить5СлучайныхЗаписей(РезультатЗапроса, ОбзвонПричинВозвратаТовара);	
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьДанныеДляОбзвонаУдобстваРаботыВИМ()

	ОбзвонУдобстваРаботыВИМ.Очистить();
	ВидЖалобы = Новый Массив;
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000003"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000002"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000001"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
		|ПОМЕСТИТЬ ВТЧерныйСписок
		|ИЗ
		|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеЗвонков.Контрагент КАК Клиент
		|ПОМЕСТИТЬ ВТ_Исключения
		|ИЗ
		|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
		|ГДЕ
		|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
		|	И ДанныеЗвонков.ДатаСобытия > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОбращениеКлиента.Клиент
		|ИЗ
		|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
		|ГДЕ
		|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
		|	И ОбращениеКлиента.ВидЖалобы В(&ВидЖалобы)
		|	И ОбращениеКлиента.Дата > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказКлиента.Партнер КАК ФИОКлиента,
		|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона,
		|	МАКСИМУМ(ЗаказКлиента.Ссылка) КАК ЗаказКлиента,
		|	ДанныеОбзвонов.Оценка КАК ОценкаПоЗвонку,
		|	ДанныеОбзвонов.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|			ПО (ПартнерыДополнительныеРеквизиты.Ссылка = ПартнерыКонтактнаяИнформация.Ссылка)
		|				И (НЕ(ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ГруппыПартнеров""
		|						И ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Сотрудники""))
		|				И (НЕ ПартнерыДополнительныеРеквизиты.Ссылка.ПометкаУдаления)
		|		ПО ЗаказКлиента.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
		|			И (НЕ ПартнерыКонтактнаяИнформация.НомерТелефона = """")
		|			И (ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%"")
		|			И (ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
		|			И (ЗаказКлиента.ССайта)
		|			И (ЗаказКлиента.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -30))
		|			И (ЗаказКлиента.Партнер.ЮрФизЛицо = &ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
		|		ПО (ДанныеОбзвонов.ОбъектОбзвона = ЗаказКлиента.Ссылка)
		|			И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
		|ГДЕ
		|	НЕ ЗаказКлиента.Партнер В
		|				(ВЫБРАТЬ
		|					ВТ_Исключения.Клиент КАК Клиент
		|				ИЗ
		|					ВТ_Исключения)
		|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
		|				(ВЫБРАТЬ
		|					ВТЧерныйСписок.Номер КАК Номер
		|				ИЗ
		|					ВТЧерныйСписок)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Партнер,
		|	ДанныеОбзвонов.Оценка,
		|	ДанныеОбзвонов.Комментарий";
	
	Запрос.УстановитьПараметр("ВидЖалобы", ВидЖалобы);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
	Запрос.УстановитьПараметр("ВидОбзвона", Перечисления.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Получить5СлучайныхЗаписей(РезультатЗапроса, ОбзвонУдобстваРаботыВИМ);
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьДанныеДляОбзвонаОценкиКачестваРаботыОсновногоМенеджера()
	ОбзвонКачестваРаботыОсновногоМенеджера.Очистить();
	ВидЖалобы = Новый Массив;
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000003"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000002"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000001"));
	
	КомОтделСписок = Новый Массив;
	КомОтделСписок.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Коммерческий отдел Барнаул", Истина));
	КомОтделСписок.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Коммерческий отдел Бийск", Истина));
	КомОтделСписок.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Коммерческий отдел Выбор", Истина));
	КомОтделСписок.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Коммерческий отдел Майма", Истина));
	КомОтделСписок.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Коммерческий отдел ЦБ", Истина));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
		|ПОМЕСТИТЬ ВТЧерныйСписок
		|ИЗ
		|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеЗвонков.Контрагент КАК Клиент
		|ПОМЕСТИТЬ ВТ_Исключения
		|ИЗ
		|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
		|ГДЕ
		|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
		|	И ДанныеЗвонков.ДатаСобытия > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОбращениеКлиента.Клиент
		|ИЗ
		|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
		|ГДЕ
		|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
		|	И ОбращениеКлиента.ВидЖалобы В(&ВидЖалобы)
		|	И ОбращениеКлиента.Дата > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -90)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
		|	Партнеры.Ссылка КАК Партнер,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &РольМенеджерСнабженец
		|				ТОГДА КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК МенеджерСнабженец,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &РольДиректор
		|				ТОГДА КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Директор,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НЕ(КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &РольМенеджерСнабженец
		|							ИЛИ КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &РольДиректор)
		|					ИЛИ КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица ЕСТЬ NULL
		|				ТОГДА КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Прочие
		|ПОМЕСТИТЬ ВТВыборПоРолям
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|				ПО (ДополнительныеСведения.Объект = Партнеры.ОсновнойМенеджер)
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
		|				ПО (ДанныеЗвонков.Контрагент = Партнеры.Ссылка)
		|			ПО (КонтактныеЛицаПартнеров.Владелец = Партнеры.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
		|			ПО (КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка = КонтактныеЛицаПартнеров.Ссылка)
		|		ПО (КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = КонтактныеЛицаПартнеров.Ссылка)
		|			И (НЕ КонтактныеЛицаПартнеров.ПометкаУдаления)
		|			И (НЕ КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона = """")
		|			И (КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%"")
		|			И (ДЛИНАСТРОКИ(КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона) = 10)
		|ГДЕ
		|	(ДополнительныеСведения.Значение.Наименование = ""Отдел дистрибуции""
		|			ИЛИ ДополнительныеСведения.Значение.Наименование = ""Коммерческий отдел"")
		|	И НЕ КонтактныеЛицаПартнеров.Владелец В
		|				(ВЫБРАТЬ
		|					ВТ_Исключения.Клиент КАК Клиент
		|				ИЗ
		|					ВТ_Исключения)
		|	И НЕ КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона В
		|				(ВЫБРАТЬ
		|					ВТЧерныйСписок.Номер КАК Номер
		|				ИЗ
		|					ВТЧерныйСписок)
		|	И НЕ Партнеры.ОсновнойМенеджер В (&КомОтдел)
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица,
		|	КонтактныеЛицаПартнеров.Ссылка,
		|	Партнеры.Ссылка,
		|	ВЫБОР
		|		КОГДА НЕ(КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &РольМенеджерСнабженец
		|					ИЛИ КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &РольДиректор
		|					ИЛИ КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица ЕСТЬ NULL)
		|			ТОГДА КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВыборПоРолям.Партнер КАК Партнер,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТВыборПоРолям.МенеджерСнабженец <> """"
		|				ТОГДА ВТВыборПоРолям.МенеджерСнабженец
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВТВыборПоРолям.Директор <> """"
		|						ТОГДА ВТВыборПоРолям.Директор
		|					ИНАЧЕ ВТВыборПоРолям.Прочие
		|				КОНЕЦ
		|		КОНЕЦ) КАК НомерТелефона
		|ПОМЕСТИТЬ ВТПартнерыСНомерами
		|ИЗ
		|	ВТВыборПоРолям КАК ВТВыборПоРолям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВыборПоРолям.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПартнерыСНомерами.Партнер КАК Партнер,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка КАК ФИОКлиента,
		|	ВТПартнерыСНомерами.НомерТелефона КАК НомерТелефона,
		|	КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица КАК Должность,
		|	ВТПартнерыСНомерами.Партнер.ОсновнойМенеджер КАК Менеджер,
		|	ДанныеОбзвонов.Оценка КАК ОценкаПоЗвонку,
		|	ДанныеОбзвонов.Комментарий КАК Комментарий
		|ИЗ
		|	ВТПартнерыСНомерами КАК ВТПартнерыСНомерами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
		|				ПО (КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка = КонтактныеЛицаПартнеров.Ссылка)
		|			ПО (КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = КонтактныеЛицаПартнеров.Ссылка)
		|		ПО (КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона = ВТПартнерыСНомерами.НомерТелефона)
		|			И (КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец = ВТПартнерыСНомерами.Партнер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
		|		ПО (ДанныеОбзвонов.ОбъектОбзвона = ВТПартнерыСНомерами.Партнер.ОсновнойМенеджер)
		|			И (ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)";
	
	Запрос.УстановитьПараметр("ВидЖалобы", ВидЖалобы);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("РольДиректор", Справочники.РолиКонтактныхЛицПартнеров.НайтиПоНаименованию("Директор", Истина));
	Запрос.УстановитьПараметр("РольМенеджерСнабженец", Справочники.РолиКонтактныхЛицПартнеров.НайтиПоНаименованию("Менеджер/снабженец", Истина));
	Запрос.УстановитьПараметр("КомОтдел", КомОтделСписок);
	Запрос.УстановитьПараметр("ВидОбзвона", Перечисления.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Получить5СлучайныхЗаписей(РезультатЗапроса, ОбзвонКачестваРаботыОсновногоМенеджера);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОбзвоныПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда  
		НомерТелефонаИсходящий = ТекущаяСтрока.НомерТелефона; 
		Партнер = ТекущаяСтрока.ФИОКлиента;
		АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефонаИсходящий);  
	
		Если Элемент.Имя = "Реквизит1" Тогда
			ОбъектОбзвона = ТекущаяСтрока.ЗаказНаДоставку;
		ИначеЕсли Элемент.Имя = "ОбзвонКачестваКрупныхПокупок" Тогда
			ОбъектОбзвона = ТекущаяСтрока.ДокументПокупки;
		ИначеЕсли Элемент.Имя = "ОбзвонПричинВозвратаТовара" Тогда
			ОбъектОбзвона = ТекущаяСтрока.ДокументВозврата;
		ИначеЕсли Элемент.Имя = "ОбзвонУдобстваРаботыВИМ" Тогда
			ОбъектОбзвона = ТекущаяСтрока.ЗаказКлиента;
		ИначеЕсли Элемент.Имя = "ОбзвонКачестваРаботыОсновногоМенеджера" Тогда
			ОбъектОбзвона = ТекущаяСтрока.Менеджер;
		ИначеЕсли Элемент.Имя = "ОбзвонКачестваРаботыКЦ" Тогда 		
			ОбъектОбзвона = ТекущаяСтрока.ФИОКлиента;
		ИначеЕсли Элемент.Имя = "ОбзвонРаботыКорзинки" Тогда 		
			ОбъектОбзвона = ТекущаяСтрока.Чек;
		Иначе
			ОбъектОбзвона = "";
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСпособуПолученияПриИзменении(Элемент)
	НомерТелефонаИсходящий = "";
	ЗагрузитьДанныеДляОбзвонаКачестваКрупныхПокупок();
	Примечание="Фильтр: "+Строка(СпособПолучения);
КонецПроцедуры

&НаКлиенте
Процедура ВидКлиентаВозвратТоваровПриИзменении(Элемент)
	НомерТелефонаИсходящий = "";
	ЗагрузитьДанныеДляОбзвонаПричинВозврата();
	Примечание="Фильтр: "+Строка(ВидКлиентаВозвратТоваров);
КонецПроцедуры

&НаКлиенте
Процедура НачислитьББЗаИдею(Команда)
	Форма = ПолучитьФорму("Документ.НачислениеИСписаниеБонусныхБаллов.ФормаОбъекта");
    ДанныеФормы = Форма.Объект;    
	ТекущаяСтрока = Элементы.ОбзвонУдобстваРаботыВИМ.ТекущиеДанные;
    НачислитьББЗаИдеюНаСервере(ДанныеФормы, ТекущаяСтрока.ФИОКлиента); 
	
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
    Форма.Открыть();
КонецПроцедуры

&НаСервере
Процедура НачислитьББЗаИдеюНаСервере(ДанныеФормы, Партнер)
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.НачислениеИСписаниеБонусныхБаллов"));
	Док.Комментарий = "Начисление 100 ББ за идею по улучшению работы ИМ";
	Док.Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоКоду("000000007");
	Стр = Док.Начисление.Добавить();
	Стр.Партнер = Партнер;
	Стр.Баллы = 100;
	ЗначениеВДанныеФормы(Док, ДанныеФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОбзвонПричинВозвратаТовараВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ОбзвонПричинВозвратаТовараДокументВозврата Тогда 
		ОткрытьЗначение(Элемент.ТекущиеДанные.ДокументВозврата);
	Иначе
		ОткрытьЗначение(Элемент.ТекущиеДанные.ФИОКлиента);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбзвонУдобстваРаботыВИМВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ОбзвонУдобстваРаботыВИМЗаказКлиента Тогда 
		ОткрытьЗначение(Элемент.ТекущиеДанные.ЗаказКлиента);
	Иначе
		ОткрытьЗначение(Элемент.ТекущиеДанные.ФИОКлиента);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбзвонКачестваРаботыОсновногоМенеджераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Партнер);
КонецПроцедуры

&НаКлиенте
Процедура ОбзвонКачестваКрупныхПокупокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ОбзвонКачестваКрупныхПокупокДокументПокупки Тогда 
		ОткрытьЗначение(Элемент.ТекущиеДанные.ДокументПокупки);
	Иначе
		ОткрытьЗначение(Элемент.ТекущиеДанные.ФИОКлиента);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбзвонКачестваРаботыКЦВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.ФИОКлиента);
КонецПроцедуры

&НаКлиенте
Процедура ОбзвонРаботыКорзинкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ОбзвонРаботыКорзинкиЧек Тогда 
		ОткрытьЗначение(Элемент.ТекущиеДанные.Чек);
	Иначе
		ОткрытьЗначение(Элемент.ТекущиеДанные.ФИОКлиента);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОценкаПоЗвонкуПриИзменении(Элемент)
	Если ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваДоставки") Тогда
		ТекСтрока = Элементы.Реквизит1.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок") Тогда
		ТекСтрока = Элементы.ОбзвонКачестваКрупныхПокупок.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ") Тогда
		ТекСтрока = Элементы.ОбзвонУдобстваРаботыВИМ.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонПричинВозвратаТовара") Тогда
		ТекСтрока = Элементы.ОбзвонПричинВозвратаТовара.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку") Тогда    //обзвон качества работы КЦ
		ТекСтрока = Элементы.ОбзвонКачестваРаботыКЦ.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки") Тогда
		ТекСтрока = Элементы.ОбзвонРаботыКорзинки.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера") Тогда
		ТекСтрока = Элементы.ОбзвонКачестваРаботыОсновногоМенеджера.ТекущиеДанные;
	Иначе
		ТекСтрока = Неопределено;
	КонецЕсли;
	Если Не ТекСтрока = Неопределено Тогда
		Если ОценкаПоЗвонку <> Неопределено Тогда;
			ТекСтрока.ОценкаПоЗвонку = ОценкаПоЗвонку;
		Иначе
			ТекСтрока.ОценкаПоЗвонку = ПредопределенноеЗначение("Перечиление.ОценкиКлиентов.НетОценки");
		КонецЕсли;
	Иначе
		Сообщить("Выберите строку из обзвона");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомПоДоставкеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваДоставки") Тогда
		ТекСтрока = Элементы.Реквизит1.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок") Тогда
		ТекСтрока = Элементы.ОбзвонКачестваКрупныхПокупок.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ") Тогда
		ТекСтрока = Элементы.ОбзвонУдобстваРаботыВИМ.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонПричинВозвратаТовара") Тогда
		ТекСтрока = Элементы.ОбзвонПричинВозвратаТовара.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку") Тогда    //обзвон качества работы КЦ
		ТекСтрока = Элементы.ОбзвонКачестваРаботыКЦ.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки") Тогда
		ТекСтрока = Элементы.ОбзвонРаботыКорзинки.ТекущиеДанные;
	ИначеЕсли ВидыОбзвонов = ПредопределенноеЗначение("Перечисление.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера") Тогда
		ТекСтрока = Элементы.ОбзвонКачестваРаботыОсновногоМенеджера.ТекущиеДанные;
	Иначе
		ТекСтрока = Неопределено;
	КонецЕсли;
	Если НЕ ТекСтрока = Неопределено Тогда
		ТекСтрока.Комментарий = Текст;
	Иначе
		Сообщить("Выберите строку из обзвона");
	КонецЕсли;
	Комментарий = Текст;
КонецПроцедуры

&НаСервере
Функция ПолучитьВнутренниеНомера()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователейТелефонии.ВнутреннийНомер КАК ВнутреннийНомер
		|ИЗ
		|	РегистрСведений.НастройкиПользователейТелефонии КАК НастройкиПользователейТелефонии
		|ГДЕ
		|	НастройкиПользователейТелефонии.Пользователь <> &Пользователь"; 
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	ВнутренниеНомера = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВнутреннийНомер");
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ВнутренниеНомера
	
КонецФункции

&НаКлиенте
Процедура НомераКЦПриИзменении(Элемент)
	СформироватьСписокКачестваРаботыКЦНаСервере();
	Примечание = "Фильтр: "+Строка(НомераКЦ);
КонецПроцедуры

&НаКлиенте
Процедура МестоОплатыМинимальнаяСуммаПриИзменении(Элемент)
	Примечание = "Фильтр: "+Строка(МестоОплаты)+ " Сумма больше "+ Строка(МинимальнаяСумма);
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокКачестваРаботыКЦНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
		|ПОМЕСТИТЬ ВТЧерныйСписок
		|ИЗ
		|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеЗвонков.Контрагент КАК Клиент
		|ПОМЕСТИТЬ ВТ_Исключения
		|ИЗ
		|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
		|ГДЕ
		|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
		|	И ДанныеЗвонков.ДатаСобытия > &ДатаСобытия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОбращениеКлиента.Клиент
		|ИЗ
		|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
		|ГДЕ
		|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
		|	И ОбращениеКлиента.Дата > &ДатаСобытия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Максимум(ДанныеЗвонков.ДатаСобытия) КАК ДатаСобытия,
		|	ДанныеЗвонков.Контрагент КАК Контрагент
		|Поместить ВТ_Клиенты
		|ИЗ
		|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК СпрПартнеры
		|		ПО (ДанныеЗвонков.Контрагент = СпрПартнеры.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО (ДанныеЗвонков.Контрагент = ПартнерыДополнительныеРеквизиты.Ссылка)
		|ГДЕ
		|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
		|	И ДанныеЗвонков.ДатаСобытия > &ДатаСобытия
		|	И ДанныеЗвонков.НомерКому = &НомерКому
		|	И ДанныеЗвонков.ДлительностьРазговора МЕЖДУ 30 И 180
		|	И СпрПартнеры.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо)
		|	И ВЫБОР
		|			КОГДА ПартнерыДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""%Группы партнеров%""
		|				ТОГДА НЕ ПартнерыДополнительныеРеквизиты.Значение.Наименование ПОДОБНО ""%Сотрудники%""
		|		КОНЕЦ
		|	И НЕ ДанныеЗвонков.Контрагент В
		|				(ВЫБРАТЬ
		|					ВТ_Исключения.Клиент КАК Клиент
		|				ИЗ
		|					ВТ_Исключения)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеЗвонков.Контрагент 
		|;
		|////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Клиенты.ДатаСобытия КАК ДатаСобытия,
		|	ВТ_Клиенты.Контрагент КАК ФИОКлиента,
		|	ДанныеЗвонков.НомерОтКого КАК НомерТелефона
		|ИЗ
		|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Клиенты КАК ВТ_Клиенты
		|		ПО (ВТ_Клиенты.ДатаСобытия = ДанныеЗвонков.ДатаСобытия)
		|			И (ВТ_Клиенты.Контрагент = ДанныеЗвонков.Контрагент) 
		|ГДЕ 
		|	НЕ ДанныеЗвонков.НомерОтКого В
		|						(ВЫБРАТЬ
		|							ВТЧерныйСписок.Номер КАК Номер
		|						ИЗ
		|							ВТЧерныйСписок)";
	
	Запрос.УстановитьПараметр("ДатаСобытия", ДобавитьМесяц(ТекущаяДата(), -3));
	Запрос.УстановитьПараметр("НомерКому", НомераКЦ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой()Тогда
		Получить5СлучайныхЗаписей(РезультатЗапроса, ОбзвонКачестваРаботыКЦ);
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокОбзвонаРаботыКорзинки(Команда)
	СформироватьСписокОбзвонаРаботыКорзинкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокОбзвонаРаботыКорзинкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
		|ПОМЕСТИТЬ ВТЧерныйСписок
		|ИЗ
		|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеЗвонков.Контрагент КАК Клиент
		|ПОМЕСТИТЬ ВТ_Исключения
		|ИЗ
		|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
		|ГДЕ
		|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
		|	И ДанныеЗвонков.ДатаСобытия > &Дата
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОбращениеКлиента.Клиент
		|ИЗ
		|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
		|ГДЕ
		|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
		|	И ОбращениеКлиента.Дата > &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЧекККМ.Ссылка) КАК Чек,
		|	СпрПартнеры.Ссылка КАК ФИОКлиента,
		|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона
		|		
		|ИЗ
		|	Справочник.Партнеры КАК СпрПартнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
		|		ПО СпрПартнеры.Ссылка = ЧекККМ.Партнер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|		ПО СпрПартнеры.Ссылка = ПартнерыКонтактнаяИнформация.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО СпрПартнеры.Ссылка = ПартнерыДополнительныеРеквизиты.Ссылка
		|ГДЕ
		|	ЧекККМ.Дата > &Дата
		|	и ЧекККМ.Проведен = Истина
		|	И СпрПартнеры.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо)
		|	И ВЫБОР
		|			КОГДА ПартнерыДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""%Группы партнеров%""
		|				ТОГДА НЕ ПартнерыДополнительныеРеквизиты.Значение.Наименование ПОДОБНО ""%Сотрудники%""
		|		КОНЕЦ
		|	И ПартнерыКонтактнаяИнформация.НомерТелефона <> """"
		|	И (ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 11
		|				И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""89%""
		|			ИЛИ ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10
		|				И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%"")
		|	И ЧекККМ.МестоОплаты В(&МестаОплаты)
		|	И ЧекККМ.СуммаДокумента > &МинСумма
		|	И НЕ СпрПартнеры.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_Исключения.Клиент КАК Клиент
		|				ИЗ
		|					ВТ_Исключения)
		|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
		|				(ВЫБРАТЬ
		|					ВТЧерныйСписок.Номер КАК Номер
		|				ИЗ
		|					ВТЧерныйСписок)
		|
		|СГРУППИРОВАТЬ ПО
		|	СпрПартнеры.Ссылка";

	Запрос.УстановитьПараметр("Дата",ДобавитьМесяц(ТекущаяДата(), -1)); 
	Запрос.УстановитьПараметр("МестаОплаты", МестоОплаты);
	Запрос.УстановитьПараметр("МинСумма", МинимальнаяСумма);

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой()Тогда
		Получить5СлучайныхЗаписей(РезультатЗапроса, ОбзвонРаботыКорзинки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидыОбзвоновПриИзменении(Элемент)
	ПолучитьДанныеИзХранилища(ВидыОбзвонов);
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеИзХранилища(ВидыОбзвонов)
	//Подключаемся к хранилищу настроек
	ХранилищеСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Настройки хранилища");
	Хранилище = ХранилищеСсылка.ХранилищеНастроек.Получить();
	//Скрипт - реквезит на форме, тип "Строка"
	Если ВидыОбзвонов = Перечисления.ВидыОбзвонов.ОбзвонКачестваДоставки Тогда
		Скрипт = Хранилище.ШаблонСкриптовРабочееМестоОператораCallЦентра.ОбзвонКачестваРаботы
	ИначеЕсли ВидыОбзвонов = Перечисления.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок Тогда
		Скрипт = Хранилище.ШаблонСкриптовРабочееМестоОператораCallЦентра.ОбзвонКачестваКрупныхПокупок
	ИначеЕсли ВидыОбзвонов = Перечисления.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки Тогда
		Скрипт = Хранилище.ШаблонСкриптовРабочееМестоОператораCallЦентра.ОбзвонКачестваРаботыКорзинки
	ИначеЕсли ВидыОбзвонов = Перечисления.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку Тогда
		Скрипт = Хранилище.ШаблонСкриптовРабочееМестоОператораCallЦентра.ОбзвонКачестваРаботыОператораКЦПоЗвонку
	ИначеЕсли ВидыОбзвонов = Перечисления.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера Тогда
		Скрипт = Хранилище.ШаблонСкриптовРабочееМестоОператораCallЦентра.ОбзвонКачестваРаботыОсновногоМенеджера
	ИначеЕсли ВидыОбзвонов = Перечисления.ВидыОбзвонов.ОбзвонПричинВозвратаТовара Тогда
		Скрипт = Хранилище.ШаблонСкриптовРабочееМестоОператораCallЦентра.ОбзвонПричинВозвратаТовара
	ИначеЕсли ВидыОбзвонов = Перечисления.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ Тогда
		Скрипт = Хранилище.ШаблонСкриптовРабочееМестоОператораCallЦентра.ОбзвонУдобстваРаботыВИМ
	КонецЕсли
			
КонецФункции

&НаСервере
Функция ПроверитьРольУправленияОценкой()
	Возврат РольДоступна("УправлениеОценкойКонтактныйЦентр") ИЛИ РольДоступна("ПолныеПрава");
КонецФункции

&НаКлиенте
Процедура ОценкаКлиентаАст(Команда)
	Если ПроверитьРольУправленияОценкой() Тогда
		ИзминениеОценки = ИзминитьОценку();
	Иначе 
		Сообщить("Не достаточно прав для управления оценкой");
		Возврат;
	КонецЕсли; 
	Если ИзминениеОценки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ИзминениеОценки = 1 Тогда
		Элементы.Декорация5.Заголовок = "Оценка включена";
	ИначеЕсли ИзминениеОценки = 0 Тогда
		Элементы.Декорация5.Заголовок = "Оценка выключена";
	КонецЕсли;
КонецПроцедуры

Функция ИзминитьОценку()
	УстановитьПривилегированныйРежим(Истина);
	
	Оценка = Константы.ОценкаКонтактногоЦентраАстериск.Получить();
	
	Включить = ?(Оценка, Ложь, Истина);
	Если НСтр(СтрокаСоединенияИнформационнойБазы(), "Ref") = "trade" Тогда
		Адрес = "192.168.8.9";
	Иначе
		Адрес = "192.168.8.250";
	КонецЕсли;	
	Порт = 8081;
	АдресРесурса = "/api/toggle-operator-mark";
	
	ЗначениеОценки = ?(Включить,"true","false");
		
	ПараметрыЗапроса = НСтр("ru = '{""enabled"": "+ ЗначениеОценки + "}'"); 
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	
	HTTPСоединение = Новый HTTPСоединение(Адрес, Порт);
	Ответ = HTTPСоединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		JSONОтвет = Ответ.ПолучитьТелоКакСтроку(); 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(JSONОтвет);
		Результат = ПрочитатьJSON(ЧтениеJSON); 
		Статус = Результат["status"]; 
		ЗначениеMark = Результат["enabled"];
		Если ЗначениеMark Тогда
			Сообщить("Оценка включена");
			Константы.ОценкаКонтактногоЦентраАстериск.Установить(Истина);
		Иначе
			Сообщить("Оценка выключена");
			Константы.ОценкаКонтактногоЦентраАстериск.Установить(Ложь);
		КонецЕсли;
	Иначе
		Сообщить("Ошибка HTTP: " + Ответ.КодСостояния + " - " + Ответ.ПолучитьТелоКакСтроку());
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Неопределено;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ЗначениеMark;
КонецФункции



#КонецОбласти
#КонецОбласти