
&НаСервере
&ИзменениеИКонтроль("ОбработатьПодарочныеСертификатыНаСервере")
Процедура Док_ОбработатьПодарочныеСертификатыНаСервере()

	ОтборПоПодарочномуСертификату = Объект.ПодарочныеСертификаты.Выгрузить(,"ПодарочныйСертификат").ВыгрузитьКолонку("ПодарочныйСертификат");
	Выборка = Справочники.ПодарочныеСертификаты.ВыборкаДанныхПоПодарочнымСертификатамДляОбработки(ОтборПоПодарочномуСертификату, Объект);

	Для Каждого стрСертификат Из Объект.ПодарочныеСертификаты Цикл

		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(СтрСертификат.ПодарочныйСертификат, "ПодарочныйСертификат") Тогда
            #Удаление
			стрСертификат.Сумма = Выборка.Сумма;
			
			стрСертификат.Номинал        = Выборка.Номинал;
            #КонецУдаления
			#Вставка
			Если Выборка.Номинал <> 1 тогда
				стрСертификат.Сумма = Выборка.Сумма;
				стрСертификат.Номинал        = Выборка.Номинал;
			иначе
				стрСертификат.Номинал = Выборка.Сумма;
			КонецЕсли;
			#КонецВставки
			
			стрСертификат.ВалютаНоминала = Выборка.ВалютаНоминала;

		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("НастроитьРМКЛокализация")
Процедура Док_НастроитьРМКЛокализация(ДоступныеВидыОплаты, ЭлементыНаПерегруппировку)

	//++ Локализация
	Если СуммаДокумента = 0 Тогда
		СуммаДокумента = Объект.ПодарочныеСертификаты.Итог("Сумма");
	КонецЕсли;
    #Удаление
	Элементы.ОплатитьСБП.Видимость       = ДоступныеВидыОплаты.СБП И ОбщаяСуммаОплатыСБП > 0
	ИЛИ ДоступныеВидыОплаты.СБП И Не ЗначениеЗаполнено(Объект.РеализацияПодарочныхСертификатов);
	#КонецУдаления
	Элементы.СмешаннаяОплата.Видимость   = (Элементы.СмешаннаяОплата.Видимость ИЛИ Элементы.ОплатитьСБП.Видимость)
	И СуммаДокумента <> ОбщаяСуммаОплатыСБП;

	ЭлементыНаПерегруппировку.Добавить(Элементы.ОплатитьСБП);

	Элементы.ДекоративноеПолеГруппаСуммаКВозврату2.Видимость = Не Элементы.ОплатитьСБП.Видимость;
	Элементы.СуммаКВозвратуСБП.Видимость = Элементы.ОплатитьСБП.Видимость;
	#Вставка
	//Проверить работоспособность СБП при обновлении, заглушка типовой кнопки
	Элементы.СмешаннаяОплата.Видимость       = ДоступныеВидыОплаты.СБП И ОбщаяСуммаОплатыСБП > 0;

	Элементы.ОплатитьСБП.Видимость = Ложь;
	Элементы.СуммаКВозвратуСБП.Видимость = ДоступныеВидыОплаты.СБП И ОбщаяСуммаОплатыСБП > 0;
	#КонецВставки
	//-- Локализация

КонецПроцедуры
