#Область ВходящиеЗапросы

Функция getOperation(Запрос)
	
	Возврат ОбработатьHTTPЗапрос(Запрос);
	
КонецФункции

Функция postOperation(Запрос)
	
	Возврат ОбработатьHTTPЗапрос(Запрос, Ложь);
	
КонецФункции

#КонецОбласти 

#Область ОбработкаЗапросов

Функция ОбработатьHTTPЗапрос(Запрос, GET = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка                        
		ИдентификаторБанка = ПолучитьБанкКолбэка(Запрос.ПараметрыЗапроса);
		ПапкаЛоговКолбэков = ИнтеграцияБанки.ПолучитьПапкуЛоговКолбэков(ИдентификаторБанка).Ответ;
		
		ПараметрыОперации = Новый Структура;
		ПараметрыОперации.Вставить("ИдентификаторБанка", ИдентификаторБанка);
		Для Каждого ПараметрЗапроса ИЗ Запрос.ПараметрыЗапроса Цикл
			ПараметрыОперации.Вставить(ПараметрЗапроса.Ключ, СтрЗаменить(ПараметрЗапроса.Значение, "+", " "));
		КонецЦикла;		        
		
		ИнтеграцияБанки.ОбработатьОперациюДинамическойСсылки(ПараметрыОперации);
		
		Возврат ЗаписатьНТТPОтвет(Запрос, GET, , ПапкаЛоговКолбэков);
	Исключение
		Возврат ЗаписатьHTTPОшибку(Запрос, GET, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), , ПапкаЛоговКолбэков);
	КонецПопытки;
	
КонецФункции	

Функция ЗаписатьНТТPОтвет(Запрос, GET, Статус = 200, ПапкаЛогов)
	
	Ответ = Новый HTTPСервисОтвет(Статус);   
	ИнтеграцияREST.УстановитьHTTPЗаголовки(Ответ);
	
	ЗаписьJSON = Новый ЗаписьJSON;   
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);

	ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("error");
		ЗаписьJSON.ЗаписатьЗначение(Ложь);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("response");
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			Если Запрос.ПараметрыЗапроса.Количество() > 0 Тогда 
				
				ЗаписьJSON.ЗаписатьИмяСвойства("params");
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
					Для Каждого ПараметрЗапроса ИЗ Запрос.ПараметрыЗапроса Цикл
						ЗаписьJSON.ЗаписатьИмяСвойства(ПараметрЗапроса.Ключ);
						ЗаписьJSON.ЗаписатьЗначение(ПараметрЗапроса.Значение);
					КонецЦикла;
					
				ЗаписьJSON.ЗаписатьКонецОбъекта();
				
			КонецЕсли;
			
			Тело = Запрос.ПолучитьТелоКакСтроку();
			Если ЗначениеЗаполнено(Тело) Тогда
				ЗаписьJSON.ЗаписатьИмяСвойства("body");
				ЗаписьJSON.ЗаписатьБезОбработки(Тело);
			КонецЕсли; 
			
		ЗаписьJSON.ЗаписатьКонецОбъекта();

	ЗаписьJSON.ЗаписатьКонецОбъекта();			
		 
	СтрокаJSON = ЗаписьJSON.Закрыть();  
	ЗаписатьЛог(Запрос, GET, Тело, СтрокаJSON, ПапкаЛогов); 
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	Возврат Ответ; 
	
 КонецФункции	
 
Функция ЗаписатьHTTPОшибку(Запрос, GET, ТекстОшибки, Статус = 400, ПапкаЛогов = "")
	
	Ответ = Новый HTTPСервисОтвет(Статус);
	ИнтеграцияREST.УстановитьHTTPЗаголовки(Ответ);		
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
		ЗаписьJSON.ЗаписатьИмяСвойства("error");
		ЗаписьJSON.ЗаписатьЗначение(Истина);	
		
			ЗаписьJSON.ЗаписатьИмяСвойства("response");
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
				ЗаписьJSON.ЗаписатьИмяСвойства("status");
				ЗаписьJSON.ЗаписатьЗначение(Статус);
				
				ЗаписьJSON.ЗаписатьИмяСвойства("description");
				ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки); 
				
			ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();  
	
	СтрокаJSON = ЗаписьJSON.Закрыть();    
	ЗаписатьЛог(Запрос, GET, Запрос.ПолучитьТелоКакСтроку(), СтрокаJSON, ПапкаЛогов);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);	
	Возврат Ответ; 
	
КонецФункции  
 
 #КонецОбласти    
 
 #Область Колбэк
 
 Функция ПолучитьБанкКолбэка(ПараметрыЗапроса)  
	 
	Если
		ПараметрыЗапроса.Получить("orderNumber")	<> Неопределено
		И ПараметрыЗапроса.Получить("mdOrder")		<> Неопределено
		И ПараметрыЗапроса.Получить("operation")	<> Неопределено
		И ПараметрыЗапроса.Получить("status")		<> Неопределено
	Тогда 
		Возврат "АльфаБанк";
	КонецЕсли;
		
	Возврат "";
	 
КонецФункции	 

#КонецОбласти 
 
 #Область Логи
 
Процедура ЗаписатьЛог(Запрос, GET, Тело, Ответ, ПапкаЛогов)
	
	Если Не ЗначениеЗаполнено(ПапкаЛогов) Тогда
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДатаСеанса();
	ИмяКаталога =  ПапкаЛогов + ?(Прав(ПапкаЛогов, 1) <> "\", "\", "") + Формат(ТекДата, "ДФ=ггггММдд"); 
	
	Попытка 
		КаталогЛогов = Новый Файл(ИмяКаталога);
		Если Не КаталогЛогов.Существует() Тогда
			СоздатьКаталог(ИмяКаталога);
		КонецЕсли;   
		
		Имялога = "log_" + Формат(ТекДата, "ДФ=ггггММдд") + "_" + Формат(ТекДата, "ДФ=ЧЧммсс") + "_callback.txt"; 
		
		ТекстЛога = ?(GET, "GET", "POST") + " запрос:" + Символы.ПС +
			ИнтеграцияREST.ПолучитьHTTPСтрокуЗапроса(Запрос) + Символы.ПС +
			?(ЗначениеЗаполнено(Тело), "Тело:" + Символы.ПС + Тело + Символы.ПС, "") +
			"Ответ:" + Символы.ПС + Ответ + Символы.ПС;
		
		ФайлЛогов = Новый ЗаписьТекста(ИмяКаталога + "\" + ИмяЛога, КодировкаТекста.UTF8, , Истина);
		ФайлЛогов.ЗаписатьСтроку(ТекстЛога);
		ФайлЛогов.Закрыть();

	Исключение
		ФайлЛогов = Неопределено;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти 