&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ОграничениеДоступа = РольДоступна("МенеджерТорговогоЗала") Или РольДоступна("СотрудникМД")
КонецПроцедуры


&НаКлиенте
Процедура Док_ЖурналОрдеровПриАктивизацииСтрокиПосле(Элемент)  
	
	ТекущиеДанные = Элементы.ЖурналОрдеров.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ОграничениеДоступа Тогда
			Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары")  Тогда
				Элементы.ЖурналОрдеровКонтекстноеМенюОтменаПроведения.Доступность = Ложь;
				Элементы.ЖурналОрдеровКонтекстноеМенюПроведение.Доступность = Ложь;
				Элементы.ЖурналОрдеровКонтекстноеМенюУстановитьПометкуУдаления.Доступность = Ложь;
			Иначе
				Элементы.ЖурналОрдеровКонтекстноеМенюОтменаПроведения.Доступность = Истина;
				Элементы.ЖурналОрдеровКонтекстноеМенюПроведение.Доступность = Истина;
				Элементы.ЖурналОрдеровКонтекстноеМенюУстановитьПометкуУдаления.Доступность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Док_ЖурналОрдеровВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ИмяПоля = Поле.Имя;
	Если СтрНайти(ИмяПоля,"ОригиналДокумента") Тогда 
		СтандартнаяОбработка = Ложь;
		Док_ЖурналОрдеровВыборВместоНаСервере(ВыбраннаяСтрока);
	КонецЕсли;
	Элементы.ЖурналОрдеров.Обновить();
КонецПроцедуры


&НаСервере
Процедура Док_ЖурналОрдеровВыборВместоНаСервере(ВыбраннаяСтрока)
	//Если РольДоступна("ПодтверждениеОтделомКачества") Или РольДоступна("_ОтделБухгалтерии") Или РольДоступна("ПолныеПрава") Тогда  
	Если РольДоступна("ИзменениеОригиналДокумента") Или РольДоступна("ПолныеПрава") Тогда
		ДокОбъект = ВыбраннаяСтрока.ПолучитьОбъект();
		ДокОбъект._ОригиналДокумента = Не ДокОбъект._ОригиналДокумента;
		УстановитьПривилегированныйРежим(Истина);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокОбъект,,,РежимЗаписиДокумента.Запись);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры
