
&ИзменениеИКонтроль("ПроверитьОбъектыРасчетовПередЗаписью")
Процедура Док_ПроверитьОбъектыРасчетовПередЗаписью(Объект, МассивСтруктур, РежимЗаписи, Отказ)
	
	// Очистка объекта от ссылок на объекты расчетов.
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОчиститьОбъектыРасчетов(Объект, МассивСтруктур);
	КонецЕсли;
	
	МассивОбъектовРасшифровки = Новый Массив();
	ТаблицаСторон = ТаблицаСторон(Объект, МассивСтруктур);
	Ссылка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.Ссылка");
	
	Для Каждого СтруктураПараметров Из МассивСтруктур Цикл
		
		Если СтруктураПараметров.Свойство("СсылкаНового") Тогда
			Ссылка = СтруктураПараметров.СсылкаНового;
		КонецЕсли;
		
		//Создание элементов справочника
		ОбъектРасчетов = Неопределено;
		Если СсылкаЯвляетсяОбъектомРасчетов(Объект, СтруктураПараметров) Тогда
			ОбъектРасчетов = ПроверитьЗаполнитьОбъектРасчетовПоСтруктуре(Объект, СтруктураПараметров,,РежимЗаписи);
		КонецЕсли;
		
		//Заполнение расшифровки платежа
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа)
			И СтруктураПараметров.ИзменяетРасчеты Тогда
			
			СуммыДокумента        = ВзаиморасчетыСервер.СуммыДокумента(Объект, СтруктураПараметров);
			
			//Документ мультивалютный, расшифровку не проверяем.
			Если СуммыДокумента.СуммаДокументаБезЗалога = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа); // ТабличнаяЧасть
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОбъектовРасшифровки, РасшифровкаПлатежа.Выгрузить().ВыгрузитьКолонку("ОбъектРасчетов"));
			
			Валюта                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента);
			Дата                  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
			ЗаказОснование        = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
			Договор               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
			ПорядокРасчетов       = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
			Организация           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
			ТипРасчетов           = СтруктураПараметров.ТипРасчетов;
			
			//В документах возврата Порядок расчетов не кэшируется и получается из договора.
			Если ПорядокРасчетов = Неопределено Тогда
				Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
				Если ЗначениеЗаполнено(Договор) Тогда
					ПорядокРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокРасчетов")
				КонецЕсли;
			КонецЕсли;
			
			Если СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент
				И Метаданные.ОпределяемыеТипы.ОбъектРасчетовАванс.Тип.СодержитТип(ТипЗнч(Ссылка))
				И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				// При отмене проведения удаляем объект расчетов платежку
				ТаблицаСторон.Очистить();
				
			ИначеЕсли СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент
				И Метаданные.ОпределяемыеТипы.ОбъектРасчетовАванс.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
				
				СтрокиСПустымОбъектом = РасшифровкаПлатежа.Выгрузить(Новый Структура("ОбъектРасчетов",Справочники.ОбъектыРасчетов.ПустаяСсылка()));
				МассивВалютВзаиморасчетов = СтрокиСПустымОбъектом.ВыгрузитьКолонку("ВалютаВзаиморасчетов");
				МассивВалютВзаиморасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВалютВзаиморасчетов);
				Если МассивВалютВзаиморасчетов.Количество() > 1 Тогда
					ТекстОшибки = НСтр("ru = 'Запрещено указывать разные валюты взаиморасчетов для неразнесенного платежа.'");
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
				КонецЕсли;
				
				ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетовВТабличнойЧасти(
					Валюта,
					Дата,
					РасшифровкаПлатежа,
					Организация);
				
				ЗаполнитьСтавкуНДС = РасшифровкаПлатежа.Количество() > 0 
					И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РасшифровкаПлатежа[0], "СтавкаНДС");
				СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				
				Если СтрокиСПустымОбъектом.Количество() > 0 И ЗначениеЗаполнено(ЗаказОснование) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам Тогда
					ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(ЗаказОснование, Организация, ТипРасчетов);
					Если ЗаполнитьСтавкуНДС Тогда
						СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
					КонецЕсли;
					
					КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
					ОбрабатываемыеСтроки = Новый Массив();
					
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов;
							Если ЗаполнитьСтавкуНДС И ЗначениеЗаполнено(СтавкаНДС) Тогда
								СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
								ОбрабатываемыеСтроки.Добавить(СтрокаРасшифровки);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
					СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					
					ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
						ОбрабатываемыеСтроки,
						СтруктураДействий,
						РасшифровкаПлатежа,
						КэшированныеЗначения);
					
				ИначеЕсли СтрокиСПустымОбъектом.Количество() > 0 И ЗначениеЗаполнено(Договор) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Договор, Организация, ТипРасчетов);
					Если ЗаполнитьСтавкуНДС Тогда
						СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
					КонецЕсли;
					
					КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
					ОбрабатываемыеСтроки = Новый Массив();
					
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов;
							Если ЗаполнитьСтавкуНДС И ЗначениеЗаполнено(СтавкаНДС) Тогда
								СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
								ОбрабатываемыеСтроки.Добавить(СтрокаРасшифровки);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
					СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
						ОбрабатываемыеСтроки,
						СтруктураДействий,
						РасшифровкаПлатежа,
						КэшированныеЗначения);
						
				Иначе
					ОбъектыРасчетов = ПроверитьЗаполнитьОбъектРасчетовПоСтруктуре(Объект, СтруктураПараметров, Истина, РежимЗаписи);
					
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Организация");
					СтруктураПоиска.Вставить("Контрагент");СтруктураПоиска.Вставить("Партнер");
					
					КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
					ОбрабатываемыеСтроки = Новый Массив();
					
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
							И ОбъектыРасчетов.Количество() > 0 Тогда
							
							Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
								Идентификатор = СтрокаРасшифровки.ПолучитьИдентификатор();
							Иначе
								Идентификатор = СтрокаРасшифровки.НомерСтроки;
							КонецЕсли;
							
							Если СтруктураПараметров.ОрганизацияВСтроках Тогда
								СтруктураПоиска.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация, Идентификатор);
							Иначе
								СтруктураПоиска.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
							КонецЕсли;
							
							Если СтруктураПараметров.КонтрагентВСтроках Тогда
								СтруктураПоиска.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент, Идентификатор);
							Иначе
								СтруктураПоиска.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент);
							КонецЕсли;
							
							Если СтруктураПараметров.ПартнерВСтроках Тогда
								СтруктураПоиска.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер, Идентификатор);
							Иначе
								СтруктураПоиска.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер);
							КонецЕсли;
							
							#Вставка
							Если Не (ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Или
								ТипЗнч(Объект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств")) Тогда
							#КонецВставки
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектыРасчетов.НайтиСтроки(СтруктураПоиска)[0].ОбъектРасчетов;
							#Вставка
							КонецЕсли;
							#КонецВставки
							Если ЗаполнитьСтавкуНДС
								И Не ЗначениеЗаполнено(СтрокаРасшифровки.СтавкаНДС) Тогда
								СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, СтрокаРасшифровки.ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
								Если ЗначениеЗаполнено(СтавкаНДС) Тогда
									СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
									ОбрабатываемыеСтроки.Добавить(СтрокаРасшифровки);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
					СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
						ОбрабатываемыеСтроки,
						СтруктураДействий,
						РасшифровкаПлатежа,
						КэшированныеЗначения);
				КонецЕсли;
				
			ИначеЕсли СтруктураПараметров.ЭтоПродажаЗакупка И ЗначениеЗаполнено(ОбъектРасчетов) Тогда
				
				СуммаДокумента        = СуммыДокумента.СуммаЗалогаЗаТару + СуммыДокумента.СуммаДокументаБезЗалога;
				СуммаВзаиморасчетов   = СуммыДокумента.СуммаВзаиморасчетовБезЗалога + СуммыДокумента.СуммаВзаиморасчетовПоТаре;
				ВзаиморасчетыСервер.ЗаполнитьСуммыРасшифровкиНакладной(СуммаДокумента, СуммаВзаиморасчетов, РасшифровкаПлатежа, ОбъектРасчетов);
				
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураПараметров.Организация = Справочники.Организации.УправленческаяОрганизация Тогда
			МассивОбъектовРасшифровки.Добавить(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ОбъектРасчетов));
		КонецЕсли;
		
	КонецЦикла;
	
	// Удаление лишних элементов справочника.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТаблицаСторон.Организация КАК Организация,
	|	ТаблицаСторон.Контрагент  КАК Контрагент,
	|	ТаблицаСторон.Партнер     КАК Партнер,
	|	ТаблицаСторон.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаСторон.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ТаблицаСторон
	|ИЗ &ТаблицаСторон КАК ТаблицаСторон
	|;
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК Ссылка,
	|	ОбъектыРасчетов.ТолькоОстатки КАК ТолькоОстатки
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСторон КАК ТаблицаСторон
	|			ПО ТаблицаСторон.Организация = ОбъектыРасчетов.Организация
	|				И ТаблицаСторон.ТипРасчетов = ОбъектыРасчетов.ТипРасчетов
	|				И ТаблицаСторон.Контрагент = ОбъектыРасчетов.Контрагент
	|				И ТаблицаСторон.Партнер = ОбъектыРасчетов.Партнер
	|				И ТаблицаСторон.ВалютаВзаиморасчетов = ОбъектыРасчетов.ВалютаВзаиморасчетов
	|				И НЕ ОбъектыРасчетов.ТолькоОстатки
	|ГДЕ
	|	ОбъектыРасчетов.Объект = &Ссылка
	|	И ТаблицаСторон.ТипРасчетов ЕСТЬ NULL
	|	И ОбъектыРасчетов.Ссылка НЕ В (&МассивОбъектовРасшифровки)");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТаблицаСторон", ТаблицаСторон);
	Запрос.УстановитьПараметр("МассивОбъектовРасшифровки", МассивОбъектовРасшифровки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ОбъектыРасчетов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Блокировка.Заблокировать();
		
		ПроверитьУдалитьОбъектРасчетов(Выборка.Ссылка, Отказ, НЕ Выборка.ТолькоОстатки);
	КонецЦикла;
	
	//Заполнение объектов расчетов в Объект
	Если НЕ Отказ И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЗаполнитьОчиститьОбъектРасчетов(Объект, МассивСтруктур, РежимЗаписи);
	КонецЕсли;
	
КонецПроцедуры
