
#Область ПрограммныйИнтерфейс

#Область ПодключаемыеКоманды
// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	//++ Локализация
	

	//-- Локализация
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Обработчик события ПриСозданииНаСервере форм элемента справочника ДоговорыКонтрагентов.
//
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//  Отказ                - Булево - признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ПриСозданииНаСервереФормаЭлемента(Форма, Отказ, СтандартнаяОбработка) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация
	Объект = Форма.Объект;
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	ПараметрыПроцедуры = Новый Структура("ВариантОтображения", "Однострочный");
	СПАРКРиски.ПриСозданииНаСервере(
		Форма,
		Неопределено,
		Объект.Контрагент,
		Перечисления.ЮрФизЛицо.ВидКонтрагентаСПАРКРиски(Объект.Контрагент),
		ПараметрыПроцедуры);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	//-- Локализация
КонецПроцедуры

// Обработчик события ОбработкаПроверкиЗаполненияНаСервере
// 
// Параметры:
// 	Отказ - Булево - признак отказа.
// 	ПроверяемыеРеквизиты - Массив - массив путей к проверяемым реквизитам.
// 	Форма - ФормаКлиентскогоПриложения - форма обработчика.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

// Вызывается при создании/чтении формы на сервере
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма обработчика
//
Процедура ПриЧтенииСозданииНаСервере(Форма) Экспорт
	//++ Локализация

	Форма.ПоддержкаЭлектронногоАктированияВЕИС = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеАктированиеВЕИС");
	Форма.Элементы.ЛокализацияГруппаНастроитьГОЗ.Видимость = Форма.ПоддержкаПлатежей275ФЗ ИЛИ Форма.ПоддержкаЭлектронногоАктированияВЕИС;
	
	ДоговорыКонтрагентовЛокализацияКлиентСервер.УправлениеНастройкойГОЗ(Форма);
	
	
	ИспользоватьЭДО = ПолучитьФункциональнуюОпцию("ИспользоватьОбменЭД");
	ИспользоватьМаркировку = ПолучитьФункциональнуюОпцию("ВестиУчетМаркировкиПродукцииВГИСМ") или ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
	
	Если (Не ИспользоватьЭДО) Или (Не ИспользоватьМаркировку) Или Форма.Объект.ДоговорССамозанятым Тогда
		Форма.Элементы.ЛокализацияГруппаВариантВыбытияМаркируемойПродукции.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьПорядкаОтраженияНеотфактурованныхПоставокНУ(Форма);
	УстановитьВидимостьФлагаНеПрименятьПоложения67ФЗ(Форма);
	
	Форма.ИспользоватьВыплатыСамозанятым = ПолучитьФункциональнуюОпцию("ИспользоватьВыплатыСамозанятым");
	
	УстановитьВидимостьФлагаДоговорССамозанятым(Форма);
	
	Если Форма.Объект.ДоговорССамозанятым Тогда
		Форма.Элементы.ГруппаНалогообложениеНДС.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьИдентификатораВалютногоКонтракта(Форма);
	
	
	//-- Локализация
КонецПроцедуры

// Обработчик события ПослеЗаписиНаСервере формы элемента справочника ДоговорыКонтрагентов
//
// Параметры:
//  ТекущийОбъект   - СправочникОбъект - объект, который будет прочитан.
//  ПараметрыЗаписи - Структура - структура, содержащая параметры записи.
//  Форма           - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, Форма) Экспорт
	//++ Локализация
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРиски.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	
	//-- Локализация
КонецПроцедуры

// Обработчик события ПередЗаписьюНаСервере формы элемента справочника ДоговорыКонтрагентов
//
// Параметры:
//  Отказ           - Булево - признак отказа.
//  ТекущийОбъект   - СправочникОбъект - объект, который будет прочитан.
//  ПараметрыЗаписи - Структура - структура, содержащая параметры записи.
//  Форма           - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Форма) Экспорт
	//++ Локализация
	
	
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура ПриОкончанииИзмененияРеквизита(ИмяЭлемента, Форма, ПараметрыОбработки) Экспорт
	Если ТипЗнч(ИмяЭлемента) = Тип("Массив") Тогда
		Для каждого ТекЭлемент Из ИмяЭлемента Цикл
			ПриОкончанииИзмененияРеквизита(ТекЭлемент, Форма, ПараметрыОбработки);
		КонецЦикла;
	КонецЕсли;
	//++ Локализация

	Если ИмяЭлемента = "ТипДоговора" Тогда
		ТипДоговораПриИзменении(Форма);
	КонецЕсли;
	Если ИмяЭлемента = "НалогообложениеНДС" Тогда
		НалогообложениеНДСПриИзменении(Форма);
	КонецЕсли;
	Если ИмяЭлемента = "ИспользоватьОформлениеДокументовРаздельнойЗакупки" Тогда
		УстановитьДоступностьПорядкаОтраженияНеотфактурованныхПоставокНУ(Форма);
	КонецЕсли;
	Если ИмяЭлемента = "ВариантОформленияРаздельнойЗакупки" Тогда
		УстановитьДоступностьПорядкаОтраженияНеотфактурованныхПоставокНУ(Форма);
	КонецЕсли;
	
	Если ИмяЭлемента = "ДоговорССамозанятым" Тогда
		ДоговорССамозанятымПриИзменении(Форма);
	КонецЕсли;
	
	Если ИмяЭлемента = "Контрагент" Тогда
		ВыключитьПризнакДоговораССамозанятым(Форма);
		УстановитьВидимостьФлагаДоговорССамозанятым(Форма);
		УстановитьВидимостьИдентификатораВалютногоКонтракта(Форма);
	КонецЕсли;
	
	Если ИмяЭлемента = "Валюта" Тогда
		УстановитьВидимостьИдентификатораВалютногоКонтракта(Форма);
		УстановитьВидимостьФлагаНеПрименятьПоложения67ФЗ(Форма);
	КонецЕсли; 
	
	
	//-- Локализация
КонецПроцедуры

Процедура ВыполнитьКомандуЛокализации(Форма, ИмяКоманды, ПараметрыОбработки) Экспорт
	
	Если ТипЗнч(ИмяКоманды) = Тип("Массив") Тогда
		Для каждого ТекЭлемент Из ИмяКоманды Цикл
			ВыполнитьКомандуЛокализации(Форма, ТекЭлемент, ПараметрыОбработки);
		КонецЦикла;
	КонецЕсли;
	//++ Локализация
	
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМодуляОбъекта

// Обработчик события ОбработкаПроверкиЗаполнения объекта справочника ДоговорыКонтрагентов.
// См. описание платформенного метода ОбработкаПроверкиЗаполнения.
// 
// Параметры:
//   Отказ - Булево
//   ПроверяемыеРеквизиты - Массив из Строка
//   МассивНепроверяемыхРеквизитов - Массив из Строка
//   СправочникОбъект - СправочникОбъект.ДоговорыКонтрагентов
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, СправочникОбъект) Экспорт
	//++ Локализация

	Перем Ошибки;
	
		МассивНепроверяемыхРеквизитов.Добавить("ГосударственныйКонтракт");
	
	
	КонтрагентЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СправочникОбъект.Контрагент, "ЮрФизЛицо");
	
	Если СправочникОбъект.УникальныйНомерВалютногоКонтроля <> ""
		И ИспользоватьУникальныйНомерВалютногоКонтроля(СправочникОбъект, КонтрагентЮрФизЛицо) Тогда
		ДенежныеСредстваКлиентСерверЛокализация.ПроверитьУникальныйНомерВалютногоКонтракта(
			СправочникОбъект, СправочникОбъект.УникальныйНомерВалютногоКонтроля, Отказ);
	КонецЕсли;
	
	ДенежныеСредстваСерверЛокализация.ПроверитьДоговорНаВозможностьКорреспонденцииСоСчетомЦифровогоРубля(СправочникОбъект, Отказ);
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	//-- Локализация
КонецПроцедуры

//  см. описание платформенного метода ПередЗаписью
// Обработчик события ПередЗаписью объекта справочника ДоговорыКонтрагентов
//
// Параметры:
// Отказ - Булево
// СправочникОбъект - СправочникОбъект
//
Процедура ПередЗаписью(Отказ, СправочникОбъект) Экспорт
	//++ Локализация

	Если СправочникОбъект.ДоговорССамозанятым Тогда
		ЗаполнитьДоговорПоУмолчаниюСПризнакомДоговорССамозанятым(СправочникОбъект);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СправочникОбъект.Дата) И ЗначениеЗаполнено(СправочникОбъект.Номер) И Не СправочникОбъект.ПлатежиПо275ФЗ 
		И НЕ ЗначениеЗаполнено(СправочникОбъект.ИдентификаторПлатежа) Тогда
		СправочникОбъект.ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(СправочникОбъект);
	КонецЕсли;
	
	Если СправочникОбъект.УникальныйНомерВалютногоКонтроля <> "" Тогда
		
		КонтрагентЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СправочникОбъект.Контрагент, "ЮрФизЛицо");
		
		Если Не ИспользоватьУникальныйНомерВалютногоКонтроля(СправочникОбъект, КонтрагентЮрФизЛицо) Тогда
			СправочникОбъект.УникальныйНомерВалютногоКонтроля = "";
		КонецЕсли;
		
	КонецЕсли;
	
	//-- Локализация	
КонецПроцедуры

// Обработчик события ПриКопировании объекта справочника ДоговорыКонтрагентов
//  см. описание платформенного метода ПриКопировании
//
// Параметры:
// ОбъектКопирования - СправочникОбъект
// СправочникОбъект - СправочникОбъект
Процедура ПриКопировании(ОбъектКопирования, СправочникОбъект) Экспорт
	//++ Локализация
	СправочникОбъект.ИдентификаторПлатежа = Неопределено;
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область УсловноеОформление

// Устанавливает условное оформление формы
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма обработчика
//
Процедура УстановитьУсловноеОформление(Форма) Экспорт
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы =  Форма.Элементы;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовШапкиФормы_Служебные
//++ Локализация


Процедура НалогообложениеНДСПриИзменении(Форма)
	
	Если Форма.Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС  Тогда 
		Форма.Объект.УчетАгентскогоНДС = Истина;
	Иначе
		Форма.Объект.УчетАгентскогоНДС = Ложь;
		Форма.Объект.ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.ПустаяСсылка();
	КонецЕсли;	
	
КонецПроцедуры

// Параметры:
// 	Форма - ФормаКлиентскогоПриложения
//
Процедура ТипДоговораПриИзменении(Форма)
	Объект = Форма.Объект;
	
	ОперацииЗакупки = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	ОперацииИмпорта = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ОперацииВСтранахЕАЭС = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	
	РеквизитыПартнера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Партнер, "Клиент, Поставщик");
	Если ЗначениеЗаполнено(Объект.Партнер)
		И (Не РеквизитыПартнера.Клиент
			И (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту
				Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию))
		И (Не РеквизитыПартнера.Поставщик
			И (ОперацииЗакупки.Найти(Объект.ХозяйственнаяОперация) <> Неопределено
				Или ОперацииИмпорта.Найти(Объект.ХозяйственнаяОперация) <> Неопределено
				Или ОперацииВСтранахЕАЭС.Найти(Объект.ХозяйственнаяОперация) <> Неопределено
				Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
				Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи)) Тогда
		
		Объект.Партнер    = Справочники.Партнеры.ПустаяСсылка();
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		
	КонецЕсли;
	
	Если Не (Объект.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем
		Или Объект.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком) Тогда
		Объект.ПлатежиПо275ФЗ = Ложь;
		Объект.ДоговорСУчастникомГОЗ = Ложь;
	КонецЕсли;
	ДоговорыКонтрагентовЛокализацияКлиентСервер.УправлениеНастройкойГОЗ(Форма);
	УстановитьДоступностьПорядкаОтраженияНеотфактурованныхПоставокНУ(Форма);
	
	ВыключитьПризнакДоговораССамозанятым(Форма);
	УстановитьВидимостьФлагаДоговорССамозанятым(Форма);
	УстановитьВидимостьИдентификатораВалютногоКонтракта(Форма);
	УстановитьВидимостьФлагаНеПрименятьПоложения67ФЗ(Форма);
	
КонецПроцедуры

Процедура УстановитьДоступностьПорядкаОтраженияНеотфактурованныхПоставокНУ(Форма)
	
	ВидимостьПорядкаОтраженияВНУ = Ложь;
	
	
	Элементы = Форма.Элементы;
	
	Элементы.ПорядокОтраженияНеотфактурованныхПоставокПриПоступлении.Видимость = ВидимостьПорядкаОтраженияВНУ;
	Элементы.ПорядокОтраженияНеотфактурованныхПоставокПриФактуровке.Видимость = ВидимостьПорядкаОтраженияВНУ;
		
КонецПроцедуры


// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма:
// 		* Объект - СправочникОбъект.ДоговорыКонтрагентов
//
Процедура УстановитьВидимостьФлагаНеПрименятьПоложения67ФЗ(Форма)
	
	Объект = Форма.Объект;
	
	ВидимостьЭлемента = Истина;
	Если Объект.ВалютаВзаиморасчетов = Форма.ВалютаРегламентированногоУчета Тогда
		ВидимостьЭлемента = Ложь;
	КонецЕсли;
	
	// Настройка доступна только для договоров, в рамках которых могут продаваться комиссионные товары (агентские услуги),
	// в том числе по субкомиссионной схеме.
	Если Объект.ТипДоговора <> Перечисления.ТипыДоговоров.СПокупателем
		И Объект.ТипДоговора <> Перечисления.ТипыДоговоров.СКомиссионером
		И Объект.ТипДоговора <> Перечисления.ТипыДоговоров.РеализацияЧерезКомиссионера Тогда
		ВидимостьЭлемента = Ложь;
	КонецЕсли;
	
	ПлательщикНалогаНаПрибыль = Ложь;
	Если Не ПлательщикНалогаНаПрибыль Тогда
		ВидимостьЭлемента = Ложь;
	КонецЕсли;
	
	Форма.Элементы.ПриПереоценкеЗадолженностиКлиентаНеПрименятьПоложения67ФЗ.Видимость = ВидимостьЭлемента;
	
КонецПроцедуры

Процедура ДоговорССамозанятымПриИзменении(Форма)

	Объект = Форма.Объект;
	
	Если Объект.ДоговорССамозанятым Тогда
	
		Форма.РежимНалогообложения = 0;
		ЗаполнитьДоговорПоУмолчаниюСПризнакомДоговорССамозанятым(Объект);
	
	КонецЕсли;
	
	ДоговорыКонтрагентовЛокализацияКлиентСервер.УправлениеНастройкойГОЗ(Форма);
	
	ИспользоватьЭДО = ПолучитьФункциональнуюОпцию("ИспользоватьОбменЭД");
	ИспользоватьМаркировку = ПолучитьФункциональнуюОпцию("ВестиУчетМаркировкиПродукцииВГИСМ")
								Или ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
	
	Если (Не ИспользоватьЭДО) Или (Не ИспользоватьМаркировку) Или Объект.ДоговорССамозанятым Тогда 
		Форма.Элементы.ЛокализацияГруппаВариантВыбытияМаркируемойПродукции.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ВыключитьПризнакДоговораССамозанятым(Форма)

	Если Не ДопустимоИспользоватьДоговорССамозанятым(Форма) Тогда
		
		Форма.Объект.ДоговорССамозанятым = Ложь;
		ДоговорССамозанятымПриИзменении(Форма);
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДоговорПоУмолчаниюСПризнакомДоговорССамозанятым(Объект)

	Объект.НалогообложениеНДСОпределяетсяВДокументе = Ложь;
	Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	
	УчетНДСУП.ЗаполнитьСтавкуНДСДляПлатежей(Объект.СтавкаНДС, Объект.НалогообложениеНДС, Объект.Организация, Объект.ДатаОкончанияДействия);
	
	Объект.УчетАгентскогоНДС = Ложь;
	Объект.ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.ПустаяСсылка();
	
	Объект.ПлатежиПо275ФЗ = Ложь;
	Объект.ДоговорСУчастникомГОЗ = Ложь;
	Объект.ГосударственныйКонтракт = Справочники.ГосударственныеКонтракты.ПустаяСсылка();
	
	Объект.ВариантВыбытияМаркируемойПродукции = Перечисления.ВариантыВыбытияМаркируемойПродукции.ПустаяСсылка();

КонецПроцедуры

// Отображает или скрывает флаг "Договор плательщика НПД" в карточке договора.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой изменяется отображение.
//
Процедура УстановитьВидимостьФлагаДоговорССамозанятым(Форма)

	Элементы = Форма.Элементы;
	Элементы.ДоговорССамозанятым.Видимость = ДопустимоИспользоватьДоговорССамозанятым(Форма);

КонецПроцедуры

Функция ДопустимоИспользоватьДоговорССамозанятым(Форма)

	ВидыСамозанятых = Новый Массив;
	ВидыСамозанятых.Добавить(Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель);
	ВидыСамозанятых.Добавить(Перечисления.ЮрФизЛицо.ФизЛицо);
	
	Возврат ВидыСамозанятых.Найти(Форма.КонтрагентЮрФизЛицо) <> Неопределено
			И Форма.Объект.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком;

КонецФункции

Процедура УстановитьВидимостьИдентификатораВалютногоКонтракта(Форма)

	Элементы = Форма.Элементы;
	Элементы.УникальныйНомерВалютногоКонтроля.Видимость = ИспользоватьУникальныйНомерВалютногоКонтроля(Форма.Объект, Форма.КонтрагентЮрФизЛицо);
	
КонецПроцедуры

Функция ИспользоватьУникальныйНомерВалютногоКонтроля(Объект, КонтрагентЮрФизЛицо)

	ТипыДоговоров = Новый Массив;
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СПоставщиком);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.Импорт);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.ВвозИзЕАЭС);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СКомитентом);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СКомиссионером);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СПокупателем);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.РеализацияЧерезКомиссионера);
	
	Возврат ТипыДоговоров.Найти(Объект.ТипДоговора) <> Неопределено
		И ДенежныеСредстваКлиентСерверЛокализация.ПрименяетсяВалютныйКонтроль(КонтрагентЮрФизЛицо);

КонецФункции


//-- Локализация
#КонецОбласти

#Область ПрочиеСлужебныеПроцедуры

//++ Локализация

Функция ПолучитьКонтрактСЗаказчиком(ГосударственныйКонтракт, Организация) Экспорт
	
	КонтрактСЗаказчиком = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК ДоговорСсылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов
	|ГДЕ
	|	ГосударственныйКонтракт = &Госконтракт
	|	И Организация = &Организация
	|	И ТипДоговора В(
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем))
	|	И НЕ ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.ДоговорыМеждуОрганизациями
	|ГДЕ
	|	ГосударственныйКонтракт = &Госконтракт
	|	И НЕ ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("Госконтракт", ГосударственныйКонтракт);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 1 Тогда
		КонтрактСЗаказчиком = Результат[0].ДоговорСсылка;
	КонецЕсли;
	
	Возврат КонтрактСЗаказчиком
КонецФункции


//-- Локализация
#КонецОбласти

#КонецОбласти
