#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НужнаДоставка") Тогда
		НужнаДоставка= Параметры.НужнаДоставка;
	КонецЕсли;
	
	Если НужнаДоставка Тогда
		Партнер= Параметры.Партнер;
		
		Подразделение= Пользователи.ТекущийПользователь().Подразделение;
		Если ЗначениеЗаполнено(Подразделение.Родитель) Тогда
			Филиал= Подразделение.Родитель;
		Иначе
			Филиал= Подразделение;
		КонецЕсли;

		ВидДоставки= Параметры.ВидДоставки;
		Тариф= Параметры.Тариф;
		Адрес= Параметры.АдресДоставки;
	КонецЕсли;
	ЗначенияПоУмолчанию();
КонецПроцедуры
&НаСервере
Процедура ЗначенияПоУмолчанию()
	Если Не ЗначениеЗаполнено(ВидДоставки) Тогда
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВариантДоставки) Тогда
		Если ВидДоставки= Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда	
			ВариантДоставки= "ОРК";
		Иначе
			ВариантДоставки= "Розница";
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		Подразделение= Пользователи.ТекущийПользователь().Подразделение;
		Если ЗначениеЗаполнено(Подразделение.Родитель) Тогда
			Филиал= Подразделение.Родитель;
		Иначе
			Филиал= Подразделение;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Тариф) Тогда
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Если ЗначениеЗаполнено(Партнер) Тогда
			Адрес= АльтерраОбщегоНазначения.ПолучитьКонтактнуюИнформацию(Партнер, Справочники.ВидыКонтактнойИнформации.АдресПартнера);
		КонецЕсли
	КонецЕсли;
	НДС= "БезНДС";
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Если НужнаДоставка Тогда 
		Элементы.Филиал.Доступность= Ложь;
		//Элементы.ВариантДоставки.Видимость= Ложь;
		//Элементы.Тариф.Доступность= Ложь;
	КонецЕсли;	
	
	Элементы.Тариф.ТолькоПросмотр= Ложь;
	
	Если ВариантДоставки = "Выписка/АктивДо1т" Тогда
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
		Элементы.Тариф.ТолькоПросмотр= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИнициализироватьКарту();
	
	ПодключитьОбработчикОжидания("ЗабратьДанныеСкарты_Ожидание", 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОтключитьОбработчикОжидания("ЗабратьДанныеСкарты_Ожидание");
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ТарифНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ПараметрыФормы= Новый Структура("ВидДоставки", ВидДоставки);
	ВыборТарифаЗавершение= Новый ОписаниеОповещения("ВыборТарифаЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.ТарифыПеревозчиков.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ВыборТарифаЗавершение);	
КонецПроцедуры
&НаКлиенте
Процедура ВыборТарифаЗавершение(Результат, ДопПараметры) Экспорт 
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.Тариф= Результат;
		Тариф= Результат;
		
		ИнициализироватьКарту();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	ИнициализироватьКарту();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьданныеВыбора(ДанныеВыбора)
	Тариф1= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
	ДанныеВыбора= Новый СписокЗначений;
	ДанныеВыбора.Добавить(Тариф);
КонецПроцедуры

&НаКлиенте
Процедура ВариантДоставкиПриИзменении(Элемент)
	Если ВариантДоставки = "ОРК" Тогда
		ВидДоставки= ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.СборнаяОРК");
		НДС= "СНДС";
	Иначе
		ВидДоставки= ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная");
		НДС= "БезНДС";
	КонецЕсли;
	
	ИнициализироватьКарту();
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура РасчетПоРасстояниюПриИзменении(Элемент)
	Элементы.ГруппаРасстояние.Видимость= РасчетПоРасстоянию;
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияКарты
&НаКлиенте
Процедура ИнициализироватьКарту()
	СтоимостьЗаКм= ПолучитьСтоимостьЗаКмПоТарифу(Филиал, Тариф);
	Расстояние= 0;
	РасчетПоРасстоянию= Ложь;
	Элементы.ГруппаРасстояние.Видимость= РасчетПоРасстоянию;
	
	КартаЯндекс= "";
	КартаЯндекс= ПолучитьТекстМакета();
	ГеокодированиеКлиент.УстановитьКлючЯндекс(КартаЯндекс);
	ГеокодированиеКлиент.УстановитьНачальныеКоординаты(Филиал, КартаЯндекс);
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#СтоимостьЗаКм#", СтоимостьЗаКм);
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#Адрес#", Адрес);
КонецПроцедуры
&НаСервере
Функция ПолучитьТекстМакета()
	Обработка= РеквизитФормыВЗначение("Объект");
	Макет= Обработка.ПолучитьМакет("МакетЯндексКарты");
	//Макет= ПолучитьОбщийМакет("МакетЯндексКарты");
	
	стрМакет = Макет.ПолучитьТекст();
	
	Если ВариантДоставки = "Розница" Тогда
		ВидСтоимости= "СтоимостьДляКлиента";
	ИначеЕсли ВариантДоставки = "ОРК" Тогда
		ВидСтоимости= "СтоимостьДляВодителя";
	ИначеЕсли ВариантДоставки = "Выписка/Актив" Тогда
		ВидСтоимости= "СтоимостьДляВодителя";
	ИначеЕсли ВариантДоставки = "Выписка/АктивДо1т" Тогда 
		ВидСтоимости= "СтоимостьДляКлиента";
	Иначе
		ВидСтоимости= "СтоимостьДляКлиента";
	КонецЕсли;
	
	ПеренестиЗоныВМакетСТарифами(стрМакет, ВидСтоимости);
	
	Возврат стрМакет;
КонецФункции
&НаСервере
Процедура ПеренестиЗоныВМакетСТарифами(стрМакет, ВидСтоимости) Экспорт
	РезультатЗапроса= ЗапросКТарифам();
	
	ВыборкаПоФилиалу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	
	Зоны= "";	
	Пока ВыборкаПоФилиалу.Следующий() Цикл
		
		Выборка= ВыборкаПоФилиалу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока Выборка.Следующий() Цикл
			мСтрок= Новый Массив;
			
			Стоимость= Выборка[ВидСтоимости];
			
			Если НДС = "СНДС" Тогда
				СтавкаНДС= УчетНДСУП.СтавкаНДСПоУмолчанию(Неопределено,Объект.Дата);
				СтавкаНДСЧислом= ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС)/100+1;
				Стоимость= Стоимость*СтавкаНДСЧислом;
			КонецЕсли;
			
			Стоимость= Формат(Стоимость, "ЧРД=.; ЧРГ=' '; ЧГ=0");
			Если Не ЗначениеЗаполнено(Стоимость) Тогда
				Стоимость= 0;
			КонецЕсли;
			
			стрЦены= "Стоимость: "+Стоимость;	
			
			Цвет= Выборка.Цвет;
			Если Не ПустаяСтрока(Цвет) Тогда
				Цвет= СтрЗаменить(Цвет, " ","");
				Цвет= Прав(Цвет,6);
			КонецЕсли;
			
			мСтрок.Добавить(СтрШаблон("sZone: '%1',", Выборка.Координаты));
			мСтрок.Добавить(СтрШаблон("zone: '%1',", Выборка.Наименование));
			мСтрок.Добавить(СтрШаблон("branch: '%1',", Выборка.Подразделение));
			мСтрок.Добавить(СтрШаблон("price: %1,", Формат(Стоимость, "ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0")));
			мСтрок.Добавить(СтрШаблон("hintContent: '%1',", Выборка.Наименование+" - "+стрЦены));
			мСтрок.Добавить(СтрШаблон("opacity: %1,", "0.5"));
			
			мСтрок.Добавить(СтрШаблон("visible: %1,", "false"));
			Если Не ПустаяСтрока(Цвет) Тогда
				мСтрок.Добавить(СтрШаблон("fillColor: '%1',", Цвет));
				мСтрок.Добавить(СтрШаблон("visible: %1,", "true"));
			КонецЕсли;
			//мСтрок.Добавить(СтрШаблон("fillColor: '#%1'", "333333"));
			
			Зоны= Зоны+"{";
			Для Каждого стр Из мСтрок Цикл
				Зоны= Зоны+Символы.ПС+стр;	
			КонецЦикла;
			Зоны= Зоны+"},"+Символы.ПС;
			
			//Зоны= Зоны+"{"+Символы.ПС+стр1+Символы.ПС+стр2+Символы.ПС+стр3+"},";
		КонецЦикла;
	КонецЦикла;
	Зоны= Лев(Зоны, СтрДлина(Зоны)-1);
	стрМакет= СтрЗаменить(стрМакет, "#Зоны#", Зоны);
	
КонецПроцедуры
&НаСервере
Функция ЗапросКТарифам()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗоныДоставкиДоКлиента.Ссылка КАК Ссылка,
	|	ЗоныДоставкиДоКлиента.Наименование КАК Наименование,
	|	ЗоныДоставкиДоКлиента.Координаты КАК Координаты,
	|	ЗоныДоставкиДоКлиента.Цвет КАК Цвет,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляВодителя, 0) КАК СтоимостьДляВодителя,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляКлиента, 0) КАК СтоимостьДляКлиента,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.МинимальнаяСтоимость, 0) КАК МинимальнаяСтоимость,
	|	ЗоныДоставкиДоКлиента.Подразделение КАК Подразделение,
	|	0 КАК Сортировка
	|ИЗ
	|	Справочник.ЗоныДоставкиДоКлиента КАК ЗоныДоставкиДоКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьДоставкиПоЗонам.СрезПоследних(&Период, ) КАК СтоимостьДоставкиПоЗонамСрезПоследних
	|		ПО (СтоимостьДоставкиПоЗонамСрезПоследних.ЗонаДоставки = ЗоныДоставкиДоКлиента.Ссылка)
	|			И (СтоимостьДоставкиПоЗонамСрезПоследних.Тариф = &Тариф)
	|ГДЕ
	|	ЗоныДоставкиДоКлиента.ПометкаУдаления = ЛОЖЬ
	|	И ЗоныДоставкиДоКлиента.ВидДоставки = &ВидДоставки
	|	И ЗоныДоставкиДоКлиента.Подразделение = &Подразделение
	|	И ЗоныДоставкиДоКлиента.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗоныДоставкиДоКлиента.Ссылка,
	|	ЗоныДоставкиДоКлиента.Наименование,
	|	ЗоныДоставкиДоКлиента.Координаты,
	|	"""",
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляВодителя, 0),
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляКлиента, 0),
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.МинимальнаяСтоимость, 0),
	|	ЗоныДоставкиДоКлиента.Подразделение,
	|	1
	|ИЗ
	|	Справочник.ЗоныДоставкиДоКлиента КАК ЗоныДоставкиДоКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьДоставкиПоЗонам.СрезПоследних(&Период, ) КАК СтоимостьДоставкиПоЗонамСрезПоследних
	|		ПО (СтоимостьДоставкиПоЗонамСрезПоследних.ЗонаДоставки = ЗоныДоставкиДоКлиента.Ссылка)
	|			И (СтоимостьДоставкиПоЗонамСрезПоследних.Тариф = &Тариф)
	|ГДЕ
	|	ЗоныДоставкиДоКлиента.ПометкаУдаления = ЛОЖЬ
	|	И ЗоныДоставкиДоКлиента.ВидДоставки = &ВидДоставки
	|	И ЗоныДоставкиДоКлиента.Подразделение <> &Подразделение
	|	И ЗоныДоставкиДоКлиента.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка,
	|	Наименование
	|ИТОГИ ПО
	|	Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Филиал);
	Запрос.УстановитьПараметр("ВидДоставки", ВидДоставки);
	Запрос.УстановитьПараметр("Тариф", Тариф); 
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции
#КонецОбласти

#Область СобытияКарты
&НаСервереБезКонтекста
Функция  ПолучитьСтоимостьЗаКмПоТарифу(Подразделение, Тариф)
	Стоимость= Документы.ЗаказНаДоставкуКлиенту.ПолучитьСтоимостьЗаКмПоТарифу(Подразделение, Тариф);
	Возврат Стоимость;
КонецФункции

&НаКлиенте
Процедура ЗабратьДанныеСкарты_Ожидание()
	Попытка
		Адрес= Элементы.КартаЯндекс.document.getElementById("address").value;
		Широта= Элементы.КартаЯндекс.document.getElementById("CoordX").value;
		Долгота= Элементы.КартаЯндекс.document.getElementById("CoordY").value;
		Расстояние= Элементы.КартаЯндекс.document.getElementById("distance").value;
		Время= Элементы.КартаЯндекс.document.getElementById("duration").value;
		Зона= Элементы.КартаЯндекс.document.getElementById("zone").value;
		Стоимость= Элементы.КартаЯндекс.document.getElementById("price").value;
		СтрокаИнформации= Элементы.КартаЯндекс.document.getElementById("info").value;
		JSON= Элементы.КартаЯндекс.document.getElementById("json").value;
		
		СтоимостьПоРасстоянию= СтоимостьЗаКМ*Расстояние;
		//Если Не ПустаяСтрока(ЗонаСтр) Тогда
		//	ДанныеКарты.Зона= ПолучитьЗонуДоставкиИзСпр(ЗонаСтр);
		//КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДанные(Команда)
	СтоимостьДоставки= 0;
	СтоимостьДоставкиСНДС= 0;
	
	Если НДС = "БезНДС" Тогда
		СтоимостьДоставки= Стоимость;
	Иначе
		СтоимостьДоставкиСНДС= Стоимость;
	КонецЕсли;
	
	
	ДанныеКарты= Новый Структура("Адрес, ВидДоставки, Широта, Долгота, ВремяВПути, Расстояние, СтрокаИнформации, Зона, Тариф, СтоимостьЗаКм, НДС, СтоимостьДоставки, СтоимостьДоставкиСНДС, РасчетПоРасстоянию, СтоимостьПоРасстоянию, JSON",
	Адрес, ВидДоставки, Широта, Долгота, ВремяВПути, Расстояние, СтрокаИнформации, Зона, Тариф, СтоимостьЗаКм, НДС, СтоимостьДоставки, СтоимостьДоставкиСНДС, РасчетПоРасстоянию, СтоимостьПоРасстоянию, JSON);
	Закрыть(ДанныеКарты);
КонецПроцедуры

#КонецОбласти


