
Процедура ПередЗаписью(Отказ, Замещение)
	//Анализировать Дату заказа!!!!
	//Отказ писать записи у которых дата заказа свежее чем дата окончания лицензии
	
	МассивУдаляемыхЗаписей = новый Массив;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		//Сообщения помеченные символом # в колонке ТипСообщения считаются удаленными и не должны влиять на статистику
		Если Лев(СокрЛП(Запись.ТипСообщения),1)="#"
			ИЛИ Запись.СообщениеСсылка.ОтклоненоОтправителем Тогда 
			МассивУдаляемыхЗаписей.Добавить(Запись);
			
		//Премодерация необходимости действий (например исходящие должны быть доставлены)
		ИначеЕсли Запись.Направление="Исходящее" 
			И Запись.Статус <>"Доставлен"  
			И Запись.Статус <>"Доставлен с уточнением" Тогда 
			МассивУдаляемыхЗаписей.Добавить(Запись);
		//сообщения без номера заказа - следует проставить хоть какой-то номер
		ИначеЕсли Запись.НомерЗаказа="" Тогда
			Запись.НомерЗаказа = "Нет номера";
		//Заказ
		ИначеЕсли Запись.ТипСообщения="ORDERS" 
			И 
			НЕ (Запись.Статус = "Загружен" 
					ИЛИ (Запись.Статус = "Отклонен" И Запись.СообщениеСсылка.ТребуемоеДействие = "СообщениеОтклоненоПолучателем") 
					ИЛИ Запись.Статус = "ВходящийОжидаетУстановкиСоответствий") Тогда
				//заказ со статусом, исключающим его отражение в статистике
			Запись.Активность=ложь;
			
		//Ответ на заказ
		ИначеЕсли Запись.ТипСообщения="ORDRSP" И Запись.СтатусСтрокиТоваров="Отклонен" Тогда 
			Запись.Количество = 0; 
			Запись.СуммаБезНДС = 0; 
			Запись.СуммаСНДС = 0; 
			Запись.СуммаНДС = 0;
			
		///еще кейсы?	
		КонецЕсли;

	КонецЦикла;
	
	//удаляем помеченные
	КоличествоУдаляемых = МассивУдаляемыхЗаписей.Количество();
	Если КоличествоУдаляемых>0 Тогда 
		Для й = 1 По КоличествоУдаляемых Цикл
			ЭтотОбъект.Удалить(КоличествоУдаляемых-й);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры