
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Сборка", Сборка);
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Номенклатура = Параметры.Номенклатура;
	Характеристика = Параметры.Характеристика;
	Остаток = Параметры.Остаток;
	Организация = Параметры.Организация;
	Склад = Параметры.Склад;
	ВариантыКомплектации.Загрузить(Параметры.ВариантыКомплектации.Выгрузить());
	ЗаполнитьКомплектИКоплектующие(); 
	УсловноеОформлениеХарактеристик();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомплектИКоплектующие()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вариант.Ссылка КАК Вариант,
		|	Вариант.Основной КАК ОсновнойВариант,
		|	ЛОЖЬ КАК Использовать,
		|	Вариант.Владелец КАК ОсновнаяНоменклатура,
		|	Вариант.Владелец.ЕдиницаИзмерения КАК ЕдиницаИзмеренияКомплект,
		|	Вариант.КоличествоУпаковок КАК ОсновноеКоличество,
		|	ВариантТовары.Номенклатура КАК Номенклатура,
		|	ВариантТовары.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	ВариантТовары.Характеристика КАК Характеристика,
		|	ВариантТовары.КоличествоУпаковок КАК КоличествоВариант,
		|	ВЫБОР
		|		КОГДА Остатки.ВНаличииОстаток - Остатки.РезервироватьНаСкладеОстаток - Остатки.РезервироватьПоМереПоступленияОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ Остатки.ВНаличииОстаток - Остатки.РезервироватьНаСкладеОстаток - Остатки.РезервироватьПоМереПоступленияОстаток
		|	КОНЕЦ КАК Остаток,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ВариантТовары.КоличествоУпаковок = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) - ЕСТЬNULL(Остатки.РезервироватьНаСкладеОстаток, 0) - ЕСТЬNULL(Остатки.РезервироватьПоМереПоступленияОстаток, 0) < 0
		|						ТОГДА 0
		|					ИНАЧЕ ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) - ЕСТЬNULL(Остатки.РезервироватьНаСкладеОстаток, 0) - ЕСТЬNULL(Остатки.РезервироватьПоМереПоступленияОстаток, 0)
		|				КОНЕЦ / ВариантТовары.КоличествоУпаковок * Вариант.КоличествоУпаковок
		|		КОНЕЦ) КАК МожноСобрать,
		|	ВариантТовары.КоличествоУпаковок * Вариант.КоличествоУпаковок КАК Кратность
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК Вариант
		|		ПО (Вариант.Ссылка = ВариантТовары.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(, Склад = &Склад и Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Остатки
		|		ПО ВариантТовары.Номенклатура = Остатки.Номенклатура
		|			И ВариантТовары.Характеристика = Остатки.Характеристика
		|ГДЕ
		|	Вариант.Владелец = &Владелец
		|	И НЕ Вариант.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Вариант.Ссылка,
		|	Вариант.Основной,
		|	Вариант.Владелец,
		|	Вариант.Владелец.ЕдиницаИзмерения,
		|	Вариант.КоличествоУпаковок,
		|	ВариантТовары.Номенклатура,
		|	ВариантТовары.Номенклатура.ЕдиницаИзмерения,
		|	ВариантТовары.Характеристика,
		|	ВариантТовары.КоличествоУпаковок,
		|	Остатки.ВНаличииОстаток,
		|	Остатки.РезервироватьНаСкладеОстаток,
		|	Остатки.РезервироватьПоМереПоступленияОстаток";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		Комплект.Очистить();
		СтрокаКомплект = Комплект.Добавить();
		СтрокаКомплект.Номенклатура = Выборка.ОсновнаяНоменклатура;
		СтрокаКомплект.Упаковка = Выборка.ЕдиницаИзмеренияКомплект;
	КонецЦикла;
	
	ТаблицаДерево = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой); 
	ЗначениеВРеквизитФормы(ТаблицаДерево, "Комплектующие"); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для каждого ТекСтрока из Комплектующие Цикл
		Если ИспользоватьХарактеристики(ТекСтрока.Номенклатура) Тогда
			ТекСтрока.Кратность = ПолучитьКратностьКомплектующей(ТекСтрока.Характеристика)	
		КонецЕсли;	
	КонецЦикла;
	Комплектующие[0].Использовать = истина;
	Комплект[0].КоличествоВариант = Комплектующие[0].Кратность;
	Если Комплектующие.Количество() > 1 Тогда
		Для каждого ТекСтрока из Комплектующие Цикл
			Если ТекСтрока.МожноСобрать > 0 Тогда 
				Комплектующие[0].Использовать = Ложь;
				ТекСтрока.Использовать = Истина;
				Комплект[0].КоличествоВариант = ТекСтрока.Кратность;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Элементы.КомплектНужноСобрать.Доступность = Истина;
	Элементы.КомплектБудетСобрано.Доступность = Ложь; 
	УсловноеОформлениеХарактеристик();
  	Если Комплектующие.Количество() = 1 Тогда
		Элементы.КомплектующиеИспользовать.Доступность = Ложь;
	Иначе
		Элементы.КомплектующиеИспользовать.Доступность = Истина;
	КонецЕсли;  

	Если ИспользоватьХарактеристики(Номенклатура) и Не ЗначениеЗаполнено(Комплект[0].Характеристика) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберете характеристику у номенклатуры комплекта!", , "Комплект[0].Характеристика",,Истина);
	КонецЕсли;

	Для Каждого ТекСтрока из Комплектующие Цикл
		Если ТекСтрока.Использовать Тогда
			Если ИспользоватьХарактеристики(ТекСтрока.Номенклатура) Тогда
				Если ТекСтрока.МожноСобрать = 0 Тогда
					Индекс = Комплектующие.Индекс(ТекСтрока);
					ОбщегоНазначенияКлиент.СообщитьПользователю("Выберете другую характеристику у номенклатуры комплектующих!", , "Комплектующие["+Индекс+"].Характеристика",,Истина);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеИспользоватьПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Комплектующие.ТекущиеДанные;
	ТекСтрока = Элементы.Комплект.ТекущиеДанные;
	Если Комплектующие.Количество() = 1 Тогда
		Элементы.КомплектующиеИспользовать.Доступность = Ложь;
		Элементы.КомплектНужноСобрать.Доступность = Истина;
		ВариантыКомплектации[0].ВариантКомплектации = ТекущаяСтрока.Вариант;
		ВариантыКомплектации[0].МожноСобрать = ТекущаяСтрока.МожноСобрать;
	Иначе
		Если ТекущаяСтрока.Использовать Тогда
			Для каждого ТекКомплектующий из Комплектующие Цикл
				Если ТекКомплектующий.Вариант <> ТекущаяСтрока.Вариант Тогда
					ТекКомплектующий.Использовать = Ложь;
				КонецЕсли;
			КонецЦикла;
			ТекСтрока.КоличествоВариант = ТекущаяСтрока.Кратность;
			ТекСтрока.НужноСобрать = 0;
			ТекСтрока.БудетСобрано = 0;
			Элементы.КомплектНужноСобрать.Доступность = Истина;
			ВариантыКомплектации[0].ВариантКомплектации = ТекущаяСтрока.Вариант;
			ВариантыКомплектации[0].МожноСобрать = ТекущаяСтрока.МожноСобрать;
			Если ИспользоватьХарактеристики(ТекущаяСтрока.Номенклатура) Тогда
				Если ТекущаяСтрока.МожноСобрать = 0 Тогда
					ОчиститьСообщения(); 
					Если ИспользоватьХарактеристики(Номенклатура) и Не ЗначениеЗаполнено(Комплект[0].Характеристика) Тогда
						ОбщегоНазначенияКлиент.СообщитьПользователю("Выберете характеристику у номенклатуры комплекта!", , "Комплект[0].Характеристика",,Истина);
				    КонецЕсли;
					Индекс = Комплектующие.Индекс(ТекущаяСтрока);
					ОбщегоНазначенияКлиент.СообщитьПользователю("Выберете другую характеристику у номенклатуры комплектующих!", , "Комплектующие["+Индекс+"].Характеристика",,Истина);
				КонецЕсли;		
			КонецЕсли;
      	Иначе
			ТекСтрока.БудетСобрано = 0;
			ТекСтрока.КоличествоВариант = 0;
			ТекСтрока.НужноСобрать = 0;
			Элементы.КомплектНужноСобрать.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектНужноСобратьПриИзменении(Элемент)
	ТекСтрока = Элементы.Комплект.ТекущиеДанные;
	Для каждого ТекКомплектующий из Комплектующие цикл 
		Если ТекКомплектующий.Использовать Тогда 
			ТекСтрока.КоличествоВариант = ТекКомплектующий.Кратность;
			Если ТекСтрока.КоличествоВариант = 0 Тогда
				ТекСтрока.НужноСобрать = 0;
				ТекСтрока.БудетСобрано = 0;
				Сообщить("Выберете вариант комплектации!");
			Иначе
				Если ЗначениеЗаполнено(ТекСтрока.Характеристика) Тогда
					НужноСобратьКратное = ТекКомплектующий.Кратность;
				Иначе
					НужноСобратьКратное = ПолучитьНужноСобратьКратноКоличеству(ТекСтрока.НужноСобрать,ТекКомплектующий.Кратность);
				КонецЕсли;				
			ТекСтрока.НужноСобрать = ?(НужноСобратьКратное>ТекКомплектующий.МожноСобрать,ТекКомплектующий.МожноСобрать,НужноСобратьКратное);
			ТекСтрока.БудетСобрано = ?(ТекКомплектующий.МожноСобрать>ТекСтрока.НужноСобрать,ТекСтрока.НужноСобрать,ТекКомплектующий.МожноСобрать);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьНужноСобратьКратноКоличеству(НужноСобрать,ОсновноеКоличество)
	Кратность = НужноСобрать / ОсновноеКоличество;
	НужноСобрать = ?(Кратность = Цел(Кратность), Цел(Кратность)*ОсновноеКоличество, (Цел(Кратность)+1)*ОсновноеКоличество);
	Возврат НужноСобрать;
КонецФункции

&НаКлиенте
Процедура КомплектХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	МассивХарактеристик = СписокХарактеристик(Номенклатура,Склад);
	СписокХарактеристик1 = Новый СписокЗначений;
	СписокХарактеристик1.ЗагрузитьЗначения(МассивХарактеристик);
	
	СтандартнаяОбработка = Ложь;    
    Форма = ПолучитьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора",, Элемент);
    ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = СписокХарактеристик1;  
    Форма.Открыть();

КонецПроцедуры  

&НаСервере
Функция СписокХарактеристик(Номенклатура,Склад)
	УстановитьПривилегированныйРежим(Истина);
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
	|	ХарактеристикиНоменклатуры.Владелец.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	&Склад КАК Склад,
	|	ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) КАК Доступно,
	|	ИСТИНА КАК ХарактеристикиИспользуются,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка) КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК СодержитТовары,
	|	ЛОЖЬ КАК СодержитУслуги
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|			ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|			ЗапасыИПотребностиОстатки.ВНаличииОстаток КАК ВНаличии
	|		ИЗ
	|			РегистрНакопления.ЗапасыИПотребности.Остатки(
	|					,
	|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						И Склад = &Склад) КАК ЗапасыИПотребностиОстатки) КАК РаспределениеЗапасов
	|		ПО ХарактеристикиНоменклатуры.Владелец = РаспределениеЗапасов.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = РаспределениеЗапасов.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
	|		ПО ХарактеристикиНоменклатуры.Владелец = ТоварыКОтгрузкеОстатки.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = ТоварыКОтгрузкеОстатки.Характеристика
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец
	|	И ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) = 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТЗ.ВыгрузитьКолонку("Характеристика");
	
КонецФункции

&НаСервере
Функция ИспользоватьХарактеристики(Номенклатура)
	Возврат Не Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
КонецФункции     

&НаСервере
Функция УсловноеОформлениеХарактеристик()
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();       
    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.КомплектХарактеристика.Имя);
    ПолеОформления.Использование = Истина;
    Если Комплект[0].Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста); 
	иначе
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	КонецЕсли;
	
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста); 
	ГруппаЭлементовОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
    ГруппаЭлементовОтбора.Использование = Истина;
    ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Комплектующие.Номенклатура"); 
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;   
    ЭлементОтбора.ПравоеЗначение = Истина;   
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Комплектующие.Характеристика");  
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;   
    ЭлементОтбора.ПравоеЗначение = Истина;      
    ЭлементОтбора.Использование = Истина;
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();       
    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.КомплектующиеХарактеристика.Имя);
    ПолеОформления.Использование = Истина;

КонецФункции

&НаКлиенте
Процедура КомплектХарактеристикаПриИзменении(Элемент)
	Характеристика = Элементы.Комплект.ТекущиеДанные.Характеристика;
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТекСтрока = Элементы.Комплектующие.ТекущиеДанные;

	МассивХарактеристик = СписокХарактеристикКомплектующие(ТекСтрока.Номенклатура,Склад);
	СписокХарактеристик1 = Новый СписокЗначений;
	СписокХарактеристик1.ЗагрузитьЗначения(МассивХарактеристик);
	
	СтандартнаяОбработка = Ложь;    
    Форма = ПолучитьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора",, Элемент);
    ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = СписокХарактеристик1;  
    Форма.Открыть();
КонецПроцедуры

&НаСервере
Функция СписокХарактеристикКомплектующие(Номенклатура,Склад)
	УстановитьПривилегированныйРежим(Истина);
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
	|	ХарактеристикиНоменклатуры.Владелец.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	&Склад КАК Склад,
	|	ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) КАК Доступно,
	|	ИСТИНА КАК ХарактеристикиИспользуются,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка) КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК СодержитТовары,
	|	ЛОЖЬ КАК СодержитУслуги
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|			ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|			ЗапасыИПотребностиОстатки.ВНаличииОстаток КАК ВНаличии
	|		ИЗ
	|			РегистрНакопления.ЗапасыИПотребности.Остатки(
	|					,
	|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						И Склад = &Склад) КАК ЗапасыИПотребностиОстатки) КАК РаспределениеЗапасов
	|		ПО ХарактеристикиНоменклатуры.Владелец = РаспределениеЗапасов.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = РаспределениеЗапасов.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
	|		ПО ХарактеристикиНоменклатуры.Владелец = ТоварыКОтгрузкеОстатки.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = ТоварыКОтгрузкеОстатки.Характеристика
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец
	|	И ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) > 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	РезультатЗапроса = Новый ТаблицаЗначений;
	ТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТЗ.ВыгрузитьКолонку("Характеристика");
	
КонецФункции

&НаКлиенте
Процедура КомплектующиеХарактеристикаПриИзменении(Элемент)
	ТекСтрока = Элементы.Комплектующие.ТекущиеДанные;
	ТекущаяСтрока = Элементы.Комплект.ТекущиеДанные;
	ТекСтрока.Остаток = ПолучитьОстатокКомплектующие(ТекСтрока.Номенклатура,Склад,ТекСтрока.Характеристика);
	КратностьКомплектующей = ПолучитьКратностьКомплектующей(ТекСтрока.Характеристика);
	ТекСтрока.Кратность = КратностьКомплектующей;
    ТекСтрока.МожноСобрать = ТекСтрока.Остаток;
	ТекущаяСтрока.КоличествоВариант = ТекСтрока.Кратность;  
	ВариантыКомплектации[0].МожноСобрать = ТекСтрока.МожноСобрать;
	ХарактеристикаКомплектующейИзменена = Истина;
	ХарактеристикаКомплектующей = ТекСтрока.Характеристика;
	ОчиститьСообщения(); 
	Если ИспользоватьХарактеристики(Номенклатура) и Не ЗначениеЗаполнено(Комплект[0].Характеристика) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберете характеристику у номенклатуры комплекта!", , "Комплект[0].Характеристика",,Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьОстатокКомплектующие(Номенклатура,Склад,Характеристика)
	УстановитьПривилегированныйРежим(Истина);
	Запрос= Новый Запрос;
	Запрос.Текст=
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Остатки.ВНаличииОстаток - Остатки.РезервироватьНаСкладеОстаток - Остатки.РезервироватьПоМереПоступленияОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ Остатки.ВНаличииОстаток - Остатки.РезервироватьНаСкладеОстаток - Остатки.РезервироватьПоМереПоступленияОстаток
		|	КОНЕЦ КАК Остаток
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Склад = &Склад и Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Остатки
		|ГДЕ
		|	Остатки.Номенклатура = &Номенклатура
		|	И Остатки.Характеристика = &Характеристика
		|	И Остатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Остаток;

КонецФункции

&НаСервере
Функция ПолучитьКратностьКомплектующей(Характеристика)
	МассивПодстрок = СтрРазделить(Характеристика, " ", Ложь);
	Для Каждого Подстрока Из МассивПодстрок Цикл
		ПодстрокаБезЗапятых = СтрЗаменить(Подстрока, ",", ".");
	    Попытка
			ДробноеЧисло = Число(ПодстрокаБезЗапятых);
	        Если ТипЗнч(ДробноеЧисло) = Тип("Число") Тогда
				Возврат ДробноеЧисло;
	        КонецЕсли;
		Исключение
	    КонецПопытки;
	КонецЦикла;
	Сообщить("Проверьте правильность написания характеристики!");
	Возврат 0;

КонецФункции

&НаКлиенте
Процедура Собрать(Команда)  
	
	ТЧ = Элементы.Комплект.ТекущиеДанные;	
	
	ВариантыКомплектации[0].Собрать = ТЧ.БудетСобрано;
 	Отношение = ВариантыКомплектации[0].Собрать /ВариантыКомплектации[0].КоличествоКомплект;
	Если Отношение < 1 Тогда
		ВариантыКомплектации[0].ЧислоКомплектов = 1;
	ИначеЕсли  Цел(Отношение)*ВариантыКомплектации[0].КоличествоКомплект  >= ВариантыКомплектации[0].Собрать Тогда
		ВариантыКомплектации[0].ЧислоКомплектов = Отношение; 
	Иначе 
		ВариантыКомплектации[0].ЧислоКомплектов = Цел(Отношение)+1;
	КонецЕсли; 

	ОчиститьСообщения(); 

	Если ИспользоватьХарактеристики(Номенклатура) и Не ЗначениеЗаполнено(ТЧ.Характеристика) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберете характеристику у номенклатуры комплекта!", , "Комплект[0].Характеристика",,Истина);
	ИначеЕсли Не ЗначениеЗаполнено(ТЧ.БудетСобрано) Тогда
		Сообщить("В поле ""Нужно собрать"" у комплекта не указано количество");
	Иначе
		ВариантыКомплектации[0].Собрать = ТЧ.БудетСобрано;
		СобратьНаСервере(ВариантыКомплектации[0].ВариантКомплектации, ТЧ.БудетСобрано);  
		ПодключитьОбработчикОжидания("ОбработкаОжидания", 2, Ложь);
	КонецЕсли;

	//ЕСЛИ НУЖНО ОТКРЫВАТЬ ФОРМУ
	//СсылкаНаДокумент = 	СобратьНаСервере(ВариантыКомплектации[0].ВариантКомплектации, ТЧ.БудетСобрано);
	//ОткрытьЗначение(СсылкаНаДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжидания()
	ОтключитьОбработчикОжидания("ОбработкаОжидания"); 
	Закрыть();		
КонецПроцедуры

&НаСервере
Процедура СобратьНаСервере(Ссылка, БудетСобрано) 
	
	КомплектацияСсылка = Ссылка; 
	СборкаТоваров = Документы.СборкаТоваров.СоздатьДокумент();
    	
    СборкаТоваров.Дата = ТекущаяДата();
	СборкаТоваров.ВариантКомплектации = Ссылка;
	СборкаТоваров.Организация = Организация; 
    СборкаТоваров.Склад = Склад;
    СборкаТоваров.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров; 
    СборкаТоваров.Номенклатура = Номенклатура;
    СборкаТоваров.Характеристика = Характеристика;
    СборкаТоваров.КоличествоУпаковок = БудетСобрано; 
    СборкаТоваров.Количество = СборкаТоваров.КоличествоУпаковок; 
    СборкаТоваров.Комментарий = "Создан из помощника продаж";
    СборкаТоваров.Заполнить(Новый Структура ("Организация",Организация));
 
    
    СборкаСсылка = СборкаТоваров.Ссылка;
    ЗаполнитьТоварыПоВариантуКомплектации(СборкаТоваров.ЭтотОбъект);
    РуководительСекции = ПолучитьРуководителяСекции();
    Попытка
    	СборкаТоваров.Записать(РежимЗаписиДокумента.Проведение);
    	ОбщегоНазначения.СообщитьПользователю("Создан документ Сборки/Разборки " + СборкаТоваров, СборкаТоваров);
    	Сборка = СборкаТоваров.Ссылка;
		Если ЗначениеЗаполнено(РуководительСекции) Тогда
			АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс("Создан документ Сборки/Разборки " + СборкаТоваров, РуководительСекции);
			Сборка = СборкаТоваров.Ссылка;
		КонецЕсли;	
	Исключение
    	Сообщить("Не удалось создать документ сборки");
    КонецПопытки; 
    
    Если Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Или Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда
    	Документы.СборкаТоваров.ОформитьОрдера(СборкаТоваров.Ссылка); 
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоВариантуКомплектации(СборкаОбъект)
		
	СборкаОбъект.Товары.Загрузить(ПолучитьКомплектующиеНоменклатуры(СборкаОбъект.ВариантКомплектации, , СборкаОбъект.Количество));	
		
	СтруктураДействий = Новый Структура();
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(СборкаОбъект.Товары, СтруктураДействий, Неопределено);  
		
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(СборкаОбъект, Документы.СборкаТоваров); 
		
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(СборкаОбъект,ПараметрыУказанияСерий.ТЧ);
		
	Если Не ХарактеристикаКомплектующейИзменена Тогда
		Справочники.ВариантыКомплектацииНоменклатуры.ОбновитьКоличествоКомплектующихПоКоличествуКомплектов(
		СборкаОбъект.Товары, СборкаОбъект.Количество, СборкаОбъект.ВариантКомплектации);
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Функция ПолучитьКомплектующиеНоменклатуры(ВариантКомплектации, Упаковка = Неопределено, Количество = 1)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ХарактеристикаКомплектующейИзменена
	|			ТОГДА &ХарактеристикаКомплектующей
	|		ИНАЧЕ Товары.Характеристика
	|	КОНЕЦ КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	&КоличествоКомплектов * Товары.КоличествоУпаковок / Товары.Ссылка.Количество КАК КоличествоУпаковок,
	|	&КоличествоКомплектов * Товары.Количество / Товары.Ссылка.Количество КАК Количество,
	|	Товары.ДоляСтоимости КАК ДоляСтоимости
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ВариантКомплектации);
	Запрос.УстановитьПараметр("КоличествоКомплектов", Количество);
	Запрос.УстановитьПараметр("ХарактеристикаКомплектующей", ХарактеристикаКомплектующей);
	Запрос.УстановитьПараметр("ХарактеристикаКомплектующейИзменена", ХарактеристикаКомплектующейИзменена);

	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаКомплектующих;

КонецФункции

&НаСервере
Функция ПолучитьРуководителяСекции()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад КАК Склад,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК ЯчейкаРабочийУчасток,
		|	РабочиеУчастки.Руководитель КАК Руководитель
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеУчастки КАК РабочиеУчастки
		|		ПО РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = РабочиеУчастки.Ссылка
		|ГДЕ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = &Номенклатура
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Руководитель;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	
КонецФункции






