
&НаСервере
Процедура ПриОткрытииНаСервере()
	 //заполнение тч ресурсов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТехническиеРесурсыСкладов.Склад КАК Склад,
		|	ТехническиеРесурсыСкладов.ДопустимоеКоличество КАК КоличествоРесурса
		|ИЗ
		|	РегистрСведений.ТехническиеРесурсыСкладов КАК ТехническиеРесурсыСкладов
		|ГДЕ
		|	ТехническиеРесурсыСкладов.Оборудование = &Оборудование";
	Запрос.УстановитьПараметр("Оборудование", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрТабРесурсы = РесурсыПоСкладам.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТабРесурсы, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Модифицированность Тогда
		ЗаписатьДанныеВРегистрРесурсов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВРегистрРесурсов()

	НаборЗаписей = РегистрыСведений.ТехническиеРесурсыСкладов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Оборудование.Установить(Объект.Ссылка);
	НаборЗаписей.Очистить();
	Для ит=0 по ит<РесурсыПоСкладам.Количество()-1 Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Оборудование = Объект.Ссылка;
		НоваяЗапись.Склад = РесурсыПоСкладам[ит].Склад;
		НоваяЗапись.ДопустимоеКоличество = РесурсыПоСкладам[ит].КоличествоРесурса;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры // ЗаписатьДанныеВРегистрРесурсов()

&НаКлиенте
Процедура РесурсыПоСкладамПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры


