	  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивОтделов") Тогда
		Для Каждого Отдел Из Параметры.МассивОтделов Цикл
			НоваяСтрока = Отделы.Добавить();
			НоваяСтрока.Отдел = Отдел;	
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр Тогда
		Элементы.Сохранить.Доступность = Ложь;
		Элементы.ДобавитьОтдел.Доступность = Ложь;
		Элементы.Удалить.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтдел(Команда)
	ОткрытьФорму("Справочник.Отделы.ФормаВыбора",
				 Новый Структура("МножественныйВыбор", Истина),
				 ЭтаФорма, 
				 , 
				 , 
				 , 
				 Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма), 
				 РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры			 

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(МассивОтделов, ДопПараметры) Экспорт
	Если МассивОтделов <> Неопределено Тогда
		Если ТипЗнч(МассивОтделов) = Тип("Массив") Тогда 
			Для Каждого Отдел Из МассивОтделов Цикл
				Если Не ЗначениеЗаполнено(Отделы.НайтиСтроки(Новый Структура("Отдел", Отдел))) Тогда
					НоваяСтрока = Отделы.Добавить();
					НоваяСтрока.Отдел = Отдел;
				КонецЕсли;
			КонецЦикла;    
		ИначеЕсли ТипЗнч(МассивОтделов) = Тип("СправочникСсылка.Отделы") Тогда
			Если Не ЗначениеЗаполнено(Отделы.НайтиСтроки(Новый Структура("Отдел", МассивОтделов))) Тогда
				НоваяСтрока = Отделы.Добавить();
				НоваяСтрока.Отдел = МассивОтделов;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ТекущиеДанные = Элементы.Отделы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Отделы.Удалить(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Закрыть(МассивОтделов());
КонецПроцедуры 

&НаСервере
Функция МассивОтделов()
	Возврат Отделы.Выгрузить().ВыгрузитьКолонку("Отдел");
КонецФункции
         





































































