	 
&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	СписокДокументыЗакупки.ТекстЗапроса = СтрЗаменить(СписокДокументыЗакупки.ТекстЗапроса, "ЗНАЧЕНИЕ(Перечисление.СтатусыДокументаЭДО.ПустаяСсылка)",	
		"	ВЫБОР
		|		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПриобретениеТоваровУслуг ИЛИ 
		|				РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов ИЛИ
		|				РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.КорректировкаПриобретения
		|			ТОГДА РеестрДокументовПереопределяемый.Ссылка.СтатусДокументаВЭДО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыДокументаЭДО.ПустаяСсылка)
		|	КОНЕЦ
		|");      
	
	БлокируемыеПоля = Новый Массив;
	БлокируемыеПоля.Добавить("СуммаНДС");
	БлокируемыеПоля.Добавить("НомерСФ");
	БлокируемыеПоля.Добавить("ДатаСФ");
	
	СписокДокументыЗакупки.УстановитьОграниченияИспользованияВГруппировке(БлокируемыеПоля);
	СписокДокументыЗакупки.УстановитьОграниченияИспользованияВОтборе(БлокируемыеПоля);
	СписокДокументыЗакупки.УстановитьОграниченияИспользованияВПорядке(БлокируемыеПоля);
	
	Элементы.СтатусВЭДО.СписокВыбора.Очистить();
	Элементы.СтатусВЭДО.СписокВыбора.Добавить(Перечисления.СтатусыДокументаЭДО.Подписан);
	Элементы.СтатусВЭДО.СписокВыбора.Добавить(Перечисления.СтатусыДокументаЭДО.НеПодписан);
КонецПроцедуры

#Область ПолучитьДопПоляДляСписокДокументыЗакупки

&НаСервере
&ИзменениеИКонтроль("ТекстЗапросаСписокДокументыЗакупки")
Функция Док_ТекстЗапросаСписокДокументыЗакупки()
	
#Вставка
	СписокДокументыЗакупки.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ХозяйственныеОперацииИДокументы",	
	ХозяйственныеОперацииИДокументы.Выгрузить(, "ПолноеИмяДокумента").ВыгрузитьКолонку(0));
#КонецВставки
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РеестрДокументов.Ссылка КАК Ссылка,
	|	РеестрДокументов.НомерДокументаИБ КАК Номер,
	|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументов.Статус,
	|	РеестрДокументов.Проведен,
	|	РеестрДокументов.ПометкаУдаления,
	|	РеестрДокументов.ХозяйственнаяОперация,
	|	РеестрДокументов.Партнер,
	|	ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты) КАК Контрагент,
	|	РеестрДокументов.Контрагент КАК КонтрагентКлюч,
	|	РеестрДокументов.Договор,
	|	&Соглашение КАК Соглашение,
	|	РеестрДокументов.Организация,
	|	РеестрДокументов.Подразделение,
	|	РеестрДокументов.МестоХранения КАК МестоХранения,
	|	ВЫРАЗИТЬ(РеестрДокументов.МестоХранения.Ключ КАК Справочник.Склады) КАК Склад,
	|	РеестрДокументов.Валюта,
	|	РеестрДокументов.Сумма КАК СуммаДокумента,
	|	РеестрДокументов.Ответственный КАК Менеджер,
	|	РеестрДокументов.Автор КАК Автор,
	|	РеестрДокументов.Комментарий,
	|	РеестрДокументов.НомерПервичногоДокумента КАК НомерВходящегоДокумента,
	|	РеестрДокументов.ДатаПервичногоДокумента КАК ДатаВходящегоДокумента,
	|	РеестрДокументов.Дополнительно,
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|	СостоянияЭД.СостояниеЭДО,
	|	СостоянияЭД.ПредставлениеСостояния КАК ПредставлениеСостояния,	
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|	ВЫБОР
	|		КОГДА ДокументыСОшибкамиПроверкиКонтрагентов.Документ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиПроверкиКонтрагентов,
	|	ВЫБОР
	|		КОГДА РеестрДокументов.Проведен
	|			ТОГДА 0
	|		КОГДА РеестрДокументов.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК НестандартнаяКартинка,
	|	РеестрДокументов.ДополнительнаяЗапись,
	|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
	#Вставка
	|	ВЫБОР
	|		КОГДА РеестрДокументов.Ссылка ССЫЛКА Документ.ПриобретениеТоваровУслуг ИЛИ 
	|				РеестрДокументов.Ссылка ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов ИЛИ
	|				РеестрДокументов.Ссылка ССЫЛКА Документ.КорректировкаПриобретения
	|			ТОГДА РеестрДокументов.Ссылка.СтатусДокументаВЭДО
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыДокументаЭДО.ПустаяСсылка)
	|	КОНЕЦ КАК СтатусДокументаВЭДО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерСФ,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСФ,
	#КонецВставки
	|	ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) КАК ТипЗначения,
	|	&СтатусПроверки КАК СтатусПроверки,
	|	&ИндикаторПроверки КАК ИндикаторПроверки,
	|	РеестрДокументов.СторноИсправление КАК СторноИсправление,
	|	ВЫБОР
	|		КОГДА НЕ РеестрДокументов.СторноИсправление
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеестрДокументов.СторнируемыйДокумент
	|	КОНЕЦ КАК СторнируемыйИсправляемыйДокумент,
	|	РеестрДокументов.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	|	NULL КАК СостояниеОригиналаПервичногоДокумента,
	|	ИСТИНА КАК ОбщееСостояние,
	|	0 КАК СостояниеОригиналПолучен,
	|	ВЫРАЗИТЬ("""" КАК Строка(50)) КАК СостояниеГИСМТ
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	|{ГДЕ
	|	РеестрДокументов.Ссылка.* КАК Ссылка,
	|	РеестрДокументов.МестоХранения.* КАК МестоХранения,
	|	ВЫРАЗИТЬ(РеестрДокументов.МестоХранения.Ключ КАК Справочник.Склады).* КАК Склад,
	|	РеестрДокументов.Организация.* КАК Организация,
	|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументов.НомерДокументаИБ КАК Номер,
	|	РеестрДокументов.Статус КАК Статус,
	|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеестрДокументов.Партнер.* КАК Партнер,
	|	ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты).* КАК Контрагент,
	|	РеестрДокументов.Договор.* КАК Договор,
	|	&Соглашение КАК Соглашение,
	|	РеестрДокументов.Подразделение.* КАК Подразделение,
	|	РеестрДокументов.Ответственный.* КАК Менеджер,
	|	РеестрДокументов.Автор.* КАК Автор,
	|	РеестрДокументов.Дополнительно КАК Дополнительно,
	|	РеестрДокументов.Комментарий КАК Комментарий,
	|	РеестрДокументов.Проведен КАК Проведен,
	|	РеестрДокументов.ПометкаУдаления КАК ПометкаУдаления,
	|	(РеестрДокументов.ДатаДокументаИБ >= &НачалоПериода
	|	И РеестрДокументов.ДатаДокументаИБ <= &КонецПериода)}
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		{
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
	|		ПО (СостоянияЭД.СсылкаНаОбъект = РеестрДокументов.Ссылка)
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыСОшибкамиПроверкиКонтрагентов КАК ДокументыСОшибкамиПроверкиКонтрагентов
	|		ПО РеестрДокументов.Ссылка = ДокументыСОшибкамиПроверкиКонтрагентов.Документ
	|		И (&ИспользованиеПроверкиВозможно)}";
	
	Возврат ТекстЗапроса;
КонецФункции   

&НаСервереБезКонтекста
Процедура ПолучитьШаблонЗапроса(ТекстЗапроса, ПоследняяИтерация = Ложь)
	
	Если ПоследняяИтерация Тогда ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.ДокументОснование КАК ДокументОснование,
		|	СУММА(ЕСТЬNULL(Док.СуммаНДС, 0)) КАК СуммаНДС,
		|	Док.Ссылка.Номер КАК НомерСФ,
		|	НАЧАЛОПЕРИОДА(Док.Ссылка.ДатаСоставления, ДЕНЬ) КАК ДатаСФ
		|ПОМЕСТИТЬ ВТСчетФактураПолученный
		|ИЗ
		|	Документ.СчетФактураПолученный.ДокументыОснования КАК Док
		|ГДЕ
		|	(Док.Ссылка В (&мСтроки) ИЛИ Док.ДокументОснование В (&мСтроки))
		|	И НЕ Док.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Док.Ссылка,
		|	Док.ДокументОснование,
		|	Док.Ссылка.Номер,
		|	НАЧАЛОПЕРИОДА(Док.Ссылка.ДатаСоставления, ДЕНЬ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Док.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(Док.НомерСФ) КАК НомерСФ,
		|	МАКСИМУМ(Док.ДатаСФ) КАК ДатаСФ
		|ПОМЕСТИТЬ ВТСчетФактураПолученныйИтог
		|ИЗ
		|	ВТСчетФактураПолученный КАК Док
		|
		|СГРУППИРОВАТЬ ПО
		|	Док.ДокументОснование
		|	
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОснование
		|;
		|////////////////////////////////////////////////////////////////////////////////
		| " + ТекстЗапроса;
	КонецЕсли;
	
	Если Не ПоследняяИтерация И Не ЗначениеЗаполнено(ТекстЗапроса) Тогда ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Итог.Ссылка КАК Ссылка,
		|	СУММА(Итог.СуммаНДС) КАК СуммаНДС,
		|	ЕСТЬNULL(СчетФактураПолученный.НомерСФ, """") КАК НомерСФ,
		|	ЕСТЬNULL(СчетФактураПолученный.ДатаСФ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСФ
		|ИЗ
		|	(ВЫБРАТЬ
		|		Док.Ссылка КАК Ссылка,
		|		ЕСТЬNULL(Док.СуммаНДС, 0) КАК СуммаНДС
		|	ИЗ
		|		<НаименованиеДокумента><ТабЧасть> КАК Док
		|	ГДЕ
		|		Док.Ссылка В (&мСтроки)
		|";
	ИначеЕсли Не ПоследняяИтерация И ЗначениеЗаполнено(ТекстЗапроса) Тогда ТекстЗапроса = ТекстЗапроса + " 
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Док.Ссылка,
		|		ЕСТЬNULL(Док.СуммаНДС, 0)
		|	ИЗ
		|		<НаименованиеДокумента><ТабЧасть> КАК Док
		|	ГДЕ
		|		Док.Ссылка В (&мСтроки)
		|";
	Иначе ТекстЗапроса = ТекстЗапроса + "	
		|
		|	) КАК Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетФактураПолученныйИтог КАК СчетФактураПолученный
		|		ПО (СчетФактураПолученный.ДокументОснование = Итог.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.Ссылка,
		|	ЕСТЬNULL(СчетФактураПолученный.НомерСФ, """"),
		|	ЕСТЬNULL(СчетФактураПолученный.ДатаСФ, ДАТАВРЕМЯ(1, 1, 1))";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДопПоляДляЗапроса(ХозяйственныеОперацииИДокументы)      
	
	ТекстЗапроса = "";
	Для Каждого Элемент Из ХозяйственныеОперацииИДокументы Цикл

		Если Элемент = "Документ.СчетФактураПолученный" Тогда
			Если СтрНайти(ТекстЗапроса, "ВТСчетФактураПолученный") <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПолучитьШаблонЗапроса(ТекстЗапроса);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<НаименованиеДокумента>", "ВТСчетФактураПолученный");
		ИначеЕсли СтрНайти(ТекстЗапроса, Элемент) <> 0 Тогда
			Продолжить;
		ИначеЕсли Элемент = "Документ.ПриемкаТоваровНаХранение" ИЛИ
			Элемент = "Документ.ОтчетОСписанииТоваровСХранения" ИЛИ
			Элемент = "Документ.ОтгрузкаТоваровСХранения"  Тогда
			Продолжить;	
		Иначе
			ПолучитьШаблонЗапроса(ТекстЗапроса);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<НаименованиеДокумента>", Элемент);
		КонецЕсли;
	
		// <ТабЧасть> 
		Если Элемент = "Документ.ПриобретениеУслугПрочихАктивов" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<ТабЧасть>", ".Расходы");
		ИначеЕсли Элемент = "Документ.СчетФактураПолученный" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<ТабЧасть>", "");
		ИначеЕсли Элемент = "Документ.СчетФактураПолученныйНалоговыйАгент" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<ТабЧасть>", ".ДокументыОснования");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<ТабЧасть>", ".Товары");
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ПолучитьШаблонЗапроса(ТекстЗапроса, Истина);
	КонецЕсли;         
	
	Возврат ТекстЗапроса;

КонецФункции 

&НаСервереБезКонтекста
Процедура Док_СписокДокументыЗакупкиПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	
	ХозяйственныеОперацииИДокументы = Неопределено;
	Настройки.ДополнительныеСвойства.Свойство("ХозяйственныеОперацииИДокументы", ХозяйственныеОперацииИДокументы);  
	
	Запрос = Новый Запрос(ПолучитьДопПоляДляЗапроса(ХозяйственныеОперацииИДокументы));
	Ключи = Строки.ПолучитьКлючи();
	
	ДопПоля = Новый ТаблицаЗначений;
	ДопПоля.Колонки.Добавить("Ссылка");
	ДопПоля.Колонки.Добавить("СтрокаСписка");
	   
	Для Каждого Стр Из Ключи Цикл 
		НЗ = ДопПоля.Добавить();
		НЗ.Ссылка = Стр.Ссылка;
		НЗ.СтрокаСписка = Строки[Стр];
	КонецЦикла;
	
	Запрос.УстановитьПараметр("мСтроки", ДопПоля.ВыгрузитьКолонку("Ссылка"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Поиск = ДопПоля.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Для Каждого Стр Из Поиск Цикл    
			Данные = Стр.СтрокаСписка.Данные;
			Если Данные.Свойство("СуммаНДС") Тогда
				Данные.СуммаНДС = Выборка.СуммаНДС;
			КонецЕсли;
			Если Данные.Свойство("НомерСФ") Тогда
				Данные.НомерСФ = Выборка.НомерСФ;
			КонецЕсли;
			Если Данные.Свойство("ДатаСФ") Тогда
				Данные.ДатаСФ = Выборка.ДатаСФ;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Док_УстановитьСтатусПодписаноПосле(Команда)   
	УстановитьСтатус("Подписан");
КонецПроцедуры

&НаКлиенте
Процедура Док_УстановитьСтатусНеподписаноПосле(Команда)      
	УстановитьСтатус("НеПодписан");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Статус)	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.СписокДокументыЗакупки);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;                                
	
	СтатусУстановлен = Ложь;
	
	Для Каждого ДокументСтр Из ВыделенныеСтроки Цикл
		Если УстановитьСтатусНаДокумент(ДокументСтр, Статус) Тогда
			СтатусУстановлен = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если СтатусУстановлен Тогда
		Элементы.СписокДокументыЗакупки.Обновить();
	КонецЕсли;
КонецПроцедуры    

&НаСервере
Функция УстановитьСтатусНаДокумент(ДокументСтр, Статус)
	
	СтатусУстановлен = Ложь;
	
	ДокументОбъект = ДокументСтр.Ссылка.ПолучитьОбъект();
	МетаданныеОбъекта = ДокументОбъект.Метаданные();
	
	Если Общегоназначения.ЕстьРеквизитОбъекта("СтатусДокументаВЭДО",МетаданныеОбъекта) Тогда
		
		Если ДокументОбъект.СтатусДокументаВЭДО <> Перечисления.СтатусыДокументаЭДО[Статус]  Тогда
			
			Если ДокументОбъект.СтатусДокументаВЭДО <> Перечисления.СтатусыДокументаЭДО.Подписан Тогда	
				
				СтатусУстановлен = Истина;
		
				ДокументОбъект.СтатусДокументаВЭДО = Перечисления.СтатусыДокументаЭДО[Статус];
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
				ДопМодуль.ОбработатьЛистСогласованияПоДокументу(Статус, ДокументСтр.Ссылка);	
			Иначе
				Сообщить("У документа " + ДокументОбъект.Ссылка + " cтатус ""Подписан"" не может быть изменен");
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Сообщить("Для документа " + ДокументОбъект.Ссылка + " не предусмотрена установка статуса");
	КонецЕсли;
	
	Возврат СтатусУстановлен;

КонецФункции

&НаКлиенте
Процедура Док_СтатусВЭДОПриИзмененииПосле(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДокументыЗакупки,
		"СтатусДокументаВЭДО", 
		СтатусВЭДО, 
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ЗначениеЗаполнено(СтатусВЭДО));
КонецПроцедуры

