////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, управляющие настройками системы (локализация)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Константы

// Дополняет значения констант в новой ИБ по умолчанию.
//
// Параметры:
// 	Результат - Структура - Дополняемая структура констант
//
Процедура ДополнитьЗначенияКонстантПоУмолчанию(Результат) Экспорт
	
	//++ Локализация
	БазоваяВерсия = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	УстановитьВалютуРегламентированногоУчета();
	УстановитьВалютуУправленческогоУчета();
	
#Область Финансы
	Результат.Вставить(Метаданные.Константы.ВестиУправленческийУчетОрганизаций.Имя, НЕ БазоваяВерсия);
#КонецОбласти
	
#Область Партионный_учет
	Результат.Вставить(Метаданные.Константы.ИспользоватьПартионныйУчет.Имя, 		НЕ БазоваяВерсия);
	Результат.Вставить(Метаданные.Константы.ПартионныйУчетВерсии22.Имя, 			НЕ БазоваяВерсия);
#КонецОбласти
	
#Область Начисление_Зарплаты
	Результат.Вставить(Метаданные.Константы.ИспользоватьНачислениеЗарплаты.Имя, Ложь); // в УТ11

#КонецОбласти
	
#Область Изменения_законодательства
	Результат.Вставить(Метаданные.Константы.ДатаНачалаПримененияПриказа107н.Имя, '20140101');
	Результат.Вставить(Метаданные.Константы.ДатаНачалаПримененияПриказа126н.Имя, '20150101');
#КонецОбласти
	
#Область Розница
	Результат.Вставить(Метаданные.Константы.ОперацияПриЗакрытииКассовойСмены.Имя, Перечисления.ОперацииПриЗакрытииКассовойСмены.Нет);
#КонецОбласти
	

#Область НДС
	Результат.Вставить(Метаданные.Константы.ФормироватьОтчетностьПоНДС.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.СрокВыставленияСчетаФактуры.Имя, 5);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУчетНДС.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРазделыТаможеннойДекларацииИмпорт.Имя, Истина);
#КонецОбласти

#Область ЛокализацияРФ

	Результат.Вставить(Метаданные.Константы.ЛокализацияРФ.Имя, Истина);

#КонецОбласти

#Область Финансы
	
	Результат.Вставить(Метаданные.Константы.ВестиУправленческийУчетОрганизаций.Имя, НЕ БазоваяВерсия);
	
#КонецОбласти

#Область Партионный_учет
	Результат.Вставить(Метаданные.Константы.ИспользоватьПартионныйУчет.Имя, НЕ БазоваяВерсия);
	Результат.Вставить(Метаданные.Константы.ПартионныйУчетВерсии22.Имя, НЕ БазоваяВерсия);
#КонецОбласти

#Область ЭДО

	Результат.Вставить(Метаданные.Константы.ИспользоватьЭлектронныеПодписи.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбменЭД.Имя, Истина);

#КонецОбласти

#Область Печать
	Результат.Вставить(Метаданные.Константы.ИспользоватьМеждународныеПечатныеФормы.Имя, Ложь);
#КонецОбласти

	
#Область ИспользоватьОперацииСводнойКорректировкиЗадолженности
	Результат.Вставить(Метаданные.Константы.ИспользоватьОперацииСводнойКорректировкиЗадолженностиПоПриобретению.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОперацииСводнойКорректировкиЗадолженностиПоРеализации.Имя, Ложь);
#КонецОбласти

#Область Номенклатура
	Результат.Вставить(Метаданные.Константы.ВариантПроверкиСтатусовСертификатовНоменклатурыРосаккредитации.Имя,
						Перечисления.ВариантыПроверкиСтатусовСертификатовНоменклатурыРосаккредитации.ПроверятьИОбновлятьСтатусДействия);
#КонецОбласти

#Область МногострановойУчет
	Результат.Вставить(Метаданные.Константы.ИспользоватьМногострановойУчет.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьМногострановойУчет.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ОсновнаяСтрана.Имя, Справочники.СтраныМира.Россия);
#КонецОбласти
	
	#Область ТМЦВЭксплуатации
	УчетТМЦВЭксплуатацииУПКА = Ложь;
	Результат.Вставить(Метаданные.Константы.УчетТМЦВЭксплуатацииУПКА.Имя, УчетТМЦВЭксплуатацииУПКА);
	
	Результат.Вставить(Метаданные.Константы.УчетТМЦВЭксплуатацииWE.Имя, Ложь);
	#КонецОбласти
	
	//-- Локализация
	
	Возврат
	
КонецПроцедуры

// Возвращает код валюты по умолчанию
// 
// Возвращаемое значение:
//  Строка - код валюты
//
Функция КодВалютыПоУмолчанию() Экспорт
	
	//++ Локализация
	КодВалюты = "643"; //RUB
	ПереопределитьКодВалютыПоУмолчанию(КодВалюты);
	Возврат КодВалюты
	//-- Локализация
	
КонецФункции

// Возвращает валюту регламентированного учета по умолчанию
// 
// Возвращаемое значение:
//  СправочникСсылка.Валюты - валюта регламентированного учета по умолчанию
//
Функция ВалютаРегламентированногоУчетаПоУмолчанию() Экспорт
	
	//++ Локализация
	КодВалюты = КодВалютыПоУмолчанию();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	НЕ Валюты.ПометкаУдаления
		|	И Валюты.Код = &КодВалюты");
	Запрос.УстановитьПараметр("КодВалюты", КодВалюты);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Коды = Новый Массив;
		Коды.Добавить(КодВалюты);
		НоваяВалюта = РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(Коды);
		Если НоваяВалюта.Количество() > 0 Тогда
			ВалютаРегламентированногоУчета = НоваяВалюта[0];
		КонецЕсли;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ВалютаРегламентированногоУчета = Выборка.Ссылка;
		
	КонецЕсли;
	
	РаботаСКурсамиВалютУТ.ПроверитьКорректностьОтносительногоКурсаНа01_01_1980(ВалютаРегламентированногоУчета);
	
	Возврат ВалютаРегламентированногоУчета;
	//-- Локализация
	
КонецФункции

// Возвращает основную старну по умолчанию
// 
// Возвращаемое значение:
//  СправочникСсылка.СтраныМира - Основная страна по умолчанию
//
Функция ОсновнаяСтранаПоУмолчанию() Экспорт
	
	//++ Локализация
	
	Возврат Справочники.СтраныМира.Россия;
	
	//-- Локализация
	
КонецФункции

// Дополняет значения констант, контролируемых в базовой версии.
//
// Параметры:
// 	Результат - Структура - Дополняемая структура констант
//
Процедура ДополнитьЗначенияКонстантКонтролируемыхВБазовойВерсии(Результат) Экспорт 
	//++ Локализация
	Результат.Вставить(Метаданные.Константы.БазоваяВерсия.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.НеБазоваяВерсия.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ВедетсяРаботаЧерезТорговыхПредставителей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ДетализироватьЗаданияТорговымПредставителямПоНоменклатуре.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьABCXYZКлассификациюНоменклатурыПоВаловойПрибыли.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьABCXYZКлассификациюНоменклатурыПоВыручке.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьABCXYZКлассификациюНоменклатурыПоКоличествуПродаж.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьABCXYZКлассификациюПартнеровПоВаловойПрибыли.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьABCXYZКлассификациюПартнеровПоВыручке.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьABCXYZКлассификациюПартнеровПоКоличествуПродаж.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАктыВыполненныхРаботПоНесколькимЗаказам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАктыНаПередачуПрав.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАнкетирование.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАссортимент.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьБизнесПроцессыИЗадачи.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьБизнесРегионы.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьБюджетирование.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВерсионированиеОбъектов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВидыСвязейМеждуФизическимиЛицами.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВидыСвязейПартнеров.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВнешнихПользователей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВнутреннееПотреблениеПоНесколькимЗаказам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьГруппыАналитическогоУчетаНоменклатуры.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьГруппыДоступаНоменклатуры.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьГруппыДоступаПартнеров.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьГруппыПользователей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьГруппыФинансовогоУчета.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДоговорыКредитовИДепозитов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЕжедневныеОтчеты1СДокументооборота.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЖурналПлатежей.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаданияДляУправленияТорговымиПредставителями.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаданияТорговымПредставителямДляПланирования.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаметки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗапретОтгрузки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаявкиНаРасходованиеДенежныхСредств.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВвозТоваровИзТаможенногоСоюзаНеотфактурованныеПоставки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьИмпортныеЗакупкиТоваровВПути.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьИнтеграциюС1СДокументооборот.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКачествоТоваров.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКоммерческиеПредложенияКлиентам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКонкурентнуюРазведку.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЛимитыРасходаДенежныхСредств.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЛимитыРасходаДенежныхСредствПоОрганизациям.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЛимитыРасходаДенежныхСредствПоПодразделениям.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьМаркетинговыеМероприятия.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьМногооборотнуюТару.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьМониторингЦелевыхПоказателей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНаборы.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНапоминанияПользователя.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНачислениеЗарплаты.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоОрганизаций.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНоменклатуруПродаваемуюСовместно.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНеотфактурованныеПоставки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбобщенныйУчетНекачественныхТоваров.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбособленноеОбеспечениеЗаказов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОграниченияРучныхСкидокВПродажахПоПользователям.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОграниченияРучныхСкидокВПродажахПоСоглашениям.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОрдерныеСклады.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОтветственноеХранениеВПроцессеЗакупки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОтгрузкуБезПереходаПраваСобственности.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПервичныйСпрос.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПеремещениеПоНесколькимЗаказам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПеренаправлениеЗадач.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПланированиеЗакупок.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПланированиеПродаж.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПланированиеОстатков.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПланированиеПродажПоКатегориям.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПланированиеСборкиРазборки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПланированиеВнутреннихПотреблений.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСбалансированностьПлановУТ.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПодарочныеСертификаты.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПодразделения.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПоступлениеПоНесколькимЗаказам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПочтовыйКлиент.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПризнакРассмотрено.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПродажуАгентскихУслуг.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПроекты.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПроизводство.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПроцессыИЗадачи1СДокументооборота.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПрочиеВзаимодействия.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРасширенноеОбеспечениеПотребностей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРеализациюПоНесколькимЗаказам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРейтингиПродажНоменклатуры.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРолиКонтактныхЛицПартнеров.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРолиПартнеровИКонтактныхЛицВСделкахИПроектах.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСвязанныеДокументы1СДокументооборота.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСделкиСКлиентами.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСегментыНоменклатуры.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСегментыПартнеров.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСезонныеКоэффициенты.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСертификатыНоменклатуры.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСкладыВТабличнойЧастиДокументовЗакупки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСкладыВТабличнойЧастиДокументовПродажи.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСогласованиеЗаказовКлиентов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСогласованиеЗаказовНаВнутреннееПотребление.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСогласованиеЗаказовПоставщикам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСогласованиеЗаявокНаВозвратТоваровОтКлиентов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСогласованиеСоглашенийСКлиентами.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСогласованиеЦенНоменклатуры.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСтатусыЗаказовНаВнутреннееПотребление.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСтатусыЗаказовНаПеремещение.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСтатусыЗаказовНаСборку.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСтатусыЗаказовПоставщикам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСтатусыПеремещенийТоваров.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСтатусыРеализацийТоваровУслуг.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСтатусыСборокТоваров.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСчетаНаОплатуКлиентам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьТоварныеКатегории.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьТоварыВПутиОтПоставщиков.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУпаковочныеЛисты.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеДоставкой.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеДоступом.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеКоллекциями.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеСделками.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправленческуюОрганизацию.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУпрощеннуюСхемуОплатыВЗакупках.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУпрощеннуюСхемуОплатыВПродажах.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользоватьФайловоеХранилище1СДокументооборота.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьФорматыМагазинов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЦеновыеГруппы.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЭлектроннуюПочту1СДокументооборота.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.КонтролироватьОстаткиТоваровОрганизацийКОформлениюПоПоступлениям.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.КонтролироватьПревышениеЛимитовРасходаДенежныхСредств.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НазначатьСкидкиПоКнопкеРасчетВЧекеККМ.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НезависимоеИспользованиеДополнительныхОтчетовИОбработокВМоделиСервиса.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеЗакрыватьЗаказыКлиентовБезПолнойОплаты.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеЗакрыватьЗаказыКлиентовБезПолнойОтгрузки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеЗакрыватьЗаказыПоставщикамБезПолногоПоступления.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеЗакрыватьЗаказыПоставщикамБезПолнойОплаты.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьЖурналПлатежей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьРасширенноеОбеспечениеПотребностей.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.РазрешитьОбособлениеТоваровСверхПотребности.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ОграничиватьДоступНаУровнеЗаписей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ВедетсяУчетПостоянныхИВременныхРазницОбщая.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ПредлагатьДополнитьДокументыМногооборотнойТарой.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ПроверятьЭлектронныеПодписиНаСервере.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРазделениеПоОбластямДанных.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.РедактироватьАдресаДоставкиТолькоВДиалоге.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.СоздаватьЭлектронныеПодписиНаСервере.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ЭтоАвтономноеРабочееМесто.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанных.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.УправлениеТорговлей.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ФиксироватьПервичныйИнтерес.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ФиксироватьПретензии.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ФормироватьВидыЗапасовПоПодразделениямМенеджерам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ФормироватьВидыЗапасовПоПоставщикам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ФормироватьВидыЗапасовПоСделкам.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ФормироватьОтчетностьПоНДС.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ФормироватьУправленческийБаланс.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ФормироватьФинансовыйРезультат.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбменЭДМеждуОрганизациями.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ВестиУправленческийУчетОрганизаций.Имя, Ложь);
	
	// Ретро-бонусы
	Результат.Вставить(Метаданные.Константы.ИспользоватьРетроБонусыКлиентов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСогласованиеСписанийРетроБонусовКлиентов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРетроБонусыПоставщиков.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСогласованиеСписанийРетроБонусовПоставщиков.Имя, Ложь);
	
	// Прочие начальные значения
	Результат.Вставить(Метаданные.Константы.ИспользоватьДоверенностиНаПолучениеТМЦ.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользованиеЭтаповОплатыВЗакупках.Имя, Перечисления.ИспользованиеЭтаповОплаты.УпрощеннаяСхема);
	Результат.Вставить(Метаданные.Константы.ИспользованиеЭтаповОплатыВПродажах.Имя, Перечисления.ИспользованиеЭтаповОплаты.УпрощеннаяСхема);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОтчетДвиженияЗаказов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСинхронизациюДанных.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ФормироватьУправленческийБаланс.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПартионныйУчет.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУчетНДС.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЭлектронноеАктированиеВЕИС.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЭлектронноеАктированиеЗаказчикаВЕИС.Имя, Ложь);
	
	
	//-- Локализация
	Возврат
КонецПроцедуры

// Дополняет список констант, которые доступны для изменения в базовой версии.
//
// Параметры:
// 	Результат - Структура - Дополняемая структура констант
//
Процедура ДополнитьКонстантыДоступныеВБазовойВерсии(Результат) Экспорт 
	//++ Локализация
	Результат.Вставить(Метаданные.Константы.ВидЦеныСтоимостиПрослеживаемыхТоваров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЭлектронныеПодписи.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьШифрование.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУчетПрочихДоходовРасходов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУчетПрочихДоходовРасходовРегл.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСерииНоменклатуры.Имя);
	Результат.Вставить(Метаданные.Константы.ВестиОтдельнуюНумерациюСчетовФактурНаАвансы.Имя);
	Результат.Вставить(Метаданные.Константы.ВестиСведенияДляДекларацийПоАлкогольнойПродукции.Имя);
	Результат.Вставить(Метаданные.Константы.ВестиУчетПодконтрольныхТоваровВЕТИС.Имя);
	Результат.Вставить(Метаданные.Константы.ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи.Имя);
	Результат.Вставить(Метаданные.Константы.ДатаОбновленияПовторноИспользуемыхЗначенийМРО.Имя);
	Результат.Вставить(Метаданные.Константы.ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД.Имя);
	Результат.Вставить(Метаданные.Константы.ЗапретитьПоступлениеТоваровБезНомеровГТД.Имя);
	Результат.Вставить(Метаданные.Константы.ПроверятьЗаполнениеНомеровГТДПриЗакупкеУПоставщикаПоСхемеТоварыВПути.Имя);
	Результат.Вставить(Метаданные.Константы.КонтролироватьОстаткиНомеровГТДПриЗакупкеУПоставщикаПоСхемеТоварыВПути.Имя);
	Результат.Вставить(Метаданные.Константы.КонтролироватьОстаткиНомеровГТДПриИмпортеПоСхемеТоварыВПути.Имя);
	Результат.Вставить(Метаданные.Константы.ИзменятьЗаданияЗаднимЧислом.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользованиеКлассификаторовНоменклатуры.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользованиеСтарыхКлассификаторовОКПиОКВЭД.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАвтоматическиеСкидкиВПродажах.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАвтоматическоеЗакрытиеСтрокЗаказовМерныхТоваров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАктыРасхожденийПослеОтгрузки.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАктыРасхожденийПослеПеремещения.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАктыРасхожденийПослеПриемки.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьБонусныеПрограммыЛояльности.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВалютныеПлатежи.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВнутреннееПотребление.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВнутреннееСогласованиеЗаказовКлиентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВнутреннееСогласованиеЗаявокНаВозвратТоваровОтКлиентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВнутреннееСогласованиеКоммерческихПредложений.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВнутреннееСогласованиеСоглашенийСКлиентами.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьГрафикиОплаты.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДатуИВремяВСрокахЗадач.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДатуНачалаЗадач.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДатыЗапретаЗагрузки.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДатыЗапретаИзменения.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДоговорыМеждуОрганизациями.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДоговорыСКлиентами.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДоговорыСПоставщиками.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДополнительныеОтчетыИОбработки.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДополнительныеРеквизитыИСведения.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЕдиницыИзмеренияДляОтчетов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаказыКлиентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаказыНаВнутреннееПотребление.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаказыНаПеремещение.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаказыНаСборку.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаказыПоставщикам.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаказыПоставщикамИЗаявкиНаРасходованиеДС.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаказыХотяБыОдногоВида.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьИмпортныеЗакупки.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьИмпортныеТовары.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьИндивидуальныеСоглашенияСКлиентами.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОнлайнОплаты.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКартыЛояльности.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКомиссиюПриЗакупках.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКомиссиюПриЗакупкахБазовая.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКомиссиюПриЗакупкахНеБазовая.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКомиссиюПриПродажах.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКомиссиюПриПродажахБазовая.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКомиссиюПриПродажахНеБазовая.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКорректировкиПриобретений.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьКорректировкиРеализаций.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьМобильноеПриложение1СЗаказыКлиентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоВалют.Имя);
	Результат.Вставить(Метаданные.Константы.ВалютыУпрИРеглУчетаСовпадают.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоВидовНоменклатуры.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоВидовЦен.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоКасс.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоКассККМ.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоПроизводственныхКалендарей.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоРасчетныхСчетов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоРасчетныхСчетовКасс.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоСкладов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНоменклатуруПартнеров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбменБизнесСеть.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбменСБанками.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбменСПодключаемымОборудованиемOffline.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбменССайтом.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОбменЭД.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОплатуПлатежнымиКартами.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОтветственноеХранение.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОтправкуSMSВШаблонахСообщений.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПартнеровИКонтрагентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПартнеровКакКонтрагентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПередачиТоваровМеждуОрганизациями.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПеремещениеТоваров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПодключаемоеОборудование.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПодключаемоеОборудованиеИОплатуПлатежнымиКартами.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПодчиненныеБизнесПроцессы.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПолнотекстовыйПоиск.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПолнотекстовыйПоискПриПодбореТоваров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПричиныОтменыЗаказовКлиентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПричиныОтменыЗаказовПоставщикам.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПроверкуКонтрагентов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПродажиНаЭкспортНесырьевыхТоваров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПродажиНаЭкспортСырьевыхТоваровУслуг.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПрочееОприходованиеТоваров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРасширенныеВозможностиЗаказаКлиента.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРеглУчет.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРозничныеПродажи.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРучныеСкидкиВЗакупках.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьРучныеСкидкиВПродажах.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСборкуРазборку.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСервисСПАРКРиски.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСинхронизациюДанныхВЛокальномРежиме.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСинхронизациюДанныхВМоделиСервиса.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСоглашенияСКлиентами.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСоглашенияСПоставщиками.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСтатусыАвансовыхОтчетов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьТиповыеИИндивидуальныеСоглашенияСКлиентами.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьТиповыеСоглашенияСКлиентами.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьТТН.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУпаковкиНоменклатуры.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеПроизводством.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеПроизводством2_2.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУчетДрагоценныхМатериалов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУчетПрочихАктивовПассивов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьХарактеристикиНоменклатуры.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьШаблоныСообщений.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьШтрихкодированиеПечатныхФормОбъектов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЭлектроннуюПочтуВШаблонахСообщений.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользуетсяОбменСБухгалтериейПредприятия.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользуетсяСборкаРазборкаИСерииНоменклатуры.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользуютсяПрофилиБезопасности.Имя);
	Результат.Вставить(Метаданные.Константы.ИсточникДанныхАдресногоКлассификатора.Имя);
	Результат.Вставить(Метаданные.Константы.КомплекснаяАвтоматизация.Имя);
	Результат.Вставить(Метаданные.Константы.КонтролироватьВыдачуПодОтчетВРазрезеЦелей.Имя);
	Результат.Вставить(Метаданные.Константы.КонтролироватьОстаткиТоваровОрганизаций.Имя);
	Результат.Вставить(Метаданные.Константы.КонтролироватьУникальностьНоменклатурыПоСочетаниюЗначенийРеквизитов.Имя);
	Результат.Вставить(Метаданные.Константы.НеВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи.Имя);
	Результат.Вставить(Метаданные.Константы.НеДетализироватьЗаданияТорговымПредставителямПоНоменклатуре.Имя);
	Результат.Вставить(Метаданные.Константы.НеЗакрыватьЗаказыНаВнутреннееПотреблениеБезПолнойОтгрузки.Имя);
	Результат.Вставить(Метаданные.Константы.НеЗакрыватьЗаказыНаПеремещениеБезПолнойОтгрузки.Имя);
	Результат.Вставить(Метаданные.Константы.НеЗакрыватьЗаказыНаСборкуБезПолнойОтгрузки.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьБизнесРегионы.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьЗаявкиНаРасходованиеДенежныхСредств.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьНесколькоВалют.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьНесколькоКасс.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьНесколькоКассККМ.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьНесколькоОрганизаций.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьНесколькоРасчетныхСчетов.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьНесколькоСкладов.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанныхИЭтоКА.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанныхИЭтоУТ.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьРозничныеПродажи.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьСчетаНаОплатуВыбиратьВариантВыводаСкидок.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьСчетаНаОплатуНеВыбиратьВариантВыводаСкидок.Имя);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьЦеновыеГруппы.Имя);
	Результат.Вставить(Метаданные.Константы.НеФормироватьФинансовыйРезультат.Имя);
	Результат.Вставить(Метаданные.Константы.ОтветственныйВДокументах.Имя);
	Результат.Вставить(Метаданные.Константы.ОтложенноеОбновлениеВГлавномУзлеЗавершеноУспешно.Имя);
	Результат.Вставить(Метаданные.Константы.ОтложенноеОбновлениеЗавершеноУспешно.Имя);
	Результат.Вставить(Метаданные.Константы.ОтправлятьПисьмаВФорматеHTML.Имя);
	Результат.Вставить(Метаданные.Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Имя);
	Результат.Вставить(Метаданные.Константы.РазрешенаРаботаСНовостями.Имя);
	Результат.Вставить(Метаданные.Константы.РазрешенаРаботаСНовостямиЧерезИнтернет.Имя);
	Результат.Вставить(Метаданные.Константы.РассчитыватьПредварительнуюСтоимостьРегламентнымЗаданием.Имя);
	Результат.Вставить(Метаданные.Константы.РасходныеОрдераФормируютсяМенеджером.Имя);
	Результат.Вставить(Метаданные.Константы.СайтСоздан.Имя);
	Результат.Вставить(Метаданные.Константы.СинхронизироватьФайлы.Имя);
	Результат.Вставить(Метаданные.Константы.УправлениеПредприятием.Имя);
	Результат.Вставить(Метаданные.Константы.ХранитьФайлыВТомахНаДиске.Имя);
	Результат.Вставить(Метаданные.Константы.АвтоматическиСоздаватьПартнеровПриОтправкеЭлектронногоЧекаПокупателю.Имя);
	Результат.Вставить(Метаданные.Константы.ГруппаДоступаПартнераПриАвтоматическомСоздании.Имя);
	Результат.Вставить(Метаданные.Константы.ОбновлятьКонтактнуюИнформациюПартнеровПриОтправкеЭлектронныхЧеков.Имя);
	Результат.Вставить(Метаданные.Константы.НеПечататьФискальныйЧекПриОтправкеЭлектронногоЧекаПокупателю.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУдалениеПомеченныхОбъектов.Имя);
	Результат.Вставить(Метаданные.Константы.ПродажаТоваровОблагаемыхНДСУПокупателя.Имя);
	Результат.Вставить(Метаданные.Константы.ПокупкаТоваровОблагаемыхНДСУПокупателя.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСервисРаботаСНоменклатурой.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьСкрытиеПерсональныхДанныхСубъектов.Имя);
	Результат.Вставить(Метаданные.Константы.ФормироватьВидыЗапасовПоГруппамФинансовогоУчета.Имя);
	Результат.Вставить(Метаданные.Константы.ОграничиватьДоступНаУровнеЗаписейУниверсально.Имя);
	Результат.Вставить(Метаданные.Константы.ПисьмаОбменСБанками.Имя);
	Результат.Вставить(Метаданные.Константы.НоваяАрхитектураВзаиморасчетов.Имя);
	Результат.Вставить(Метаданные.Константы.НеНоваяАрхитектураВзаиморасчетов.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОтчетВедомостьРасчетовМеждуОрганизациями.Имя);
	Результат.Вставить(Метаданные.Константы.ИспользоватьОтчетРасчетыМеждуОрганизациями.Имя);
	Результат.Вставить(Метаданные.Константы.ДатаНачалаПримененияСводныхСправок.Имя);
	//-- Локализация
	Возврат
КонецПроцедуры

// Дополняет значения констант контролируемых в НЕ базовой версии.
//
// Параметры:
// 	Результат - Структура - Дополняемая структура констант
//
Процедура ДополнитьЗначенияКонстантКонтролируемыхВНеБазовойВерсии(Результат) Экспорт 
	//++ Локализация
	Результат.Вставить(Метаданные.Константы.БазоваяВерсия.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеБазоваяВерсия.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеДоступом.Имя, Истина);
	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Результат.Вставить(Метаданные.Константы.ИспользоватьОтчетДвиженияЗаказов.Имя, Константы.ИспользоватьРасширенныеВозможностиЗаказаКлиента.Получить());
	Иначе
		Результат.Вставить(Метаданные.Константы.ИспользоватьОтчетДвиженияЗаказов.Имя, Ложь);
	КонецЕсли;

	//-- Локализация
	Возврат
КонецПроцедуры


// Дополняет таблицу, описывающую зависимость констант в конфигурации.
// Каждая строка таблицы означает:
// для родительской константы со значением Х допустимо только значение Y для подчиненной константы.
// Параметры:
// 	Результат - ТаблицаЗначений:
//		* ИмяРодительскойКонстанты - Строка
//		* ИмяПодчиненнойКонстанты - Строка
//		* ЗначениеРодительскойКонстанты - Булево
//		* ЗначениеПодчиненнойКонстанты - Булево.
//
Процедура ДополнитьТаблицуЗависимостиКонстант(Результат) Экспорт
	//++ Локализация
	БазоваяВерсия = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	
#Область Технология_сервиса
	ЭтоКА = ПолучитьФункциональнуюОпцию("КомплекснаяАвтоматизация");
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанных.Имя, Истина,
		Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанныхИЭтоКА.Имя, ЭтоКА);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанных.Имя, Ложь,
		Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанныхИЭтоКА.Имя, Ложь);
		
	ЭтоУТ = ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанных.Имя, Истина,
		Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанныхИЭтоУТ.Имя, ЭтоУТ);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанных.Имя, Ложь,
		Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанныхИЭтоУТ.Имя, Ложь);
#КонецОбласти

#Область Управление_доступом
#КонецОбласти

#Область Синхронизация_данных
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьОбменССайтом.Имя, Истина,
		Метаданные.Константы.ИспользоватьДополнительныеРеквизитыИСведения.Имя, Истина);
#КонецОбласти
	
#Область ЭДО
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьОбменЭД.Имя, Ложь,
		Метаданные.Константы.ИспользоватьОбменЭДМеждуОрганизациями.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьОбменЭД.Имя, Ложь,
		Метаданные.Константы.ИспользоватьОбменСБанками.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьОбменЭД.Имя, Ложь,
		Метаданные.Константы.ИспользоватьОтложеннуюОтправкуЭлектронныхДокументов.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьОбменЭД.Имя, Истина, 
		Метаданные.Константы.ИспользоватьНоменклатуруПартнеров.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьЭлектронноеАктированиеВЕИС.Имя, Истина, 
		Метаданные.Константы.ИспользоватьНоменклатуруПартнеров.Имя, Истина);
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьЭлектронныеПодписи.Имя, Ложь,
		Метаданные.Константы.ИспользоватьОбменЭДМеждуОрганизациями.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьЭлектронныеПодписи.Имя, Ложь,
		Метаданные.Константы.ИспользоватьОбменСБанками.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьЭлектронныеПодписи.Имя, Ложь,
		Метаданные.Константы.ИспользоватьОтложеннуюОтправкуЭлектронныхДокументов.Имя, Ложь);
		
#КонецОбласти

#Область Склад_и_доставка
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьСервис1СДоставка.Имя, Истина,
		Метаданные.Константы.ИспользоватьУправлениеДоставкой.Имя, Истина);
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьСервис1СКурьер.Имя, Истина,
		Метаданные.Константы.ИспользоватьУправлениеДоставкой.Имя, Истина);
		
#КонецОбласти

#Область Печатные_формы_отчеты_и_обработки
#КонецОбласти

#Область Организации_финансы
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьПартионныйУчет.Имя, Ложь,
		Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Ложь);
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Истина,
		Метаданные.Константы.ИспользоватьПартионныйУчет.Имя, Истина);

	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Ложь,
		Метаданные.Константы.РаспределениеДопРасходовПоВыбывшимТоварам.Имя, Ложь);
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Истина,
		Метаданные.Константы.РаспределениеДопРасходовПоВыбывшимТоварам.Имя, Истина);
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Ложь,
		Метаданные.Константы.ВестиУправленческийУчетОрганизаций.Имя, Ложь);
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Истина,
		Метаданные.Константы.ВестиУправленческийУчетОрганизаций.Имя, Истина);
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Ложь,
		Метаданные.Константы.ИспользоватьТоварыВПутиОтПоставщиков.Имя, Ложь);	
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ПартионныйУчетВерсии22.Имя, Ложь,
		Метаданные.Константы.ИспользоватьНеотфактурованныеПоставки.Имя, Ложь);	
		
	
#КонецОбласти
			
	
	
#Область СПАРК
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьДоговорыСКлиентами.Имя, Ложь,
		Метаданные.Константы.АвтоПостановкаКлиентовНаМониторингСПАРК.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьДоговорыСПоставщиками.Имя, Ложь,
		Метаданные.Константы.АвтоПостановкаПоставщиковНаМониторингСПАРК.Имя, Ложь);
#КонецОбласти
	
#Область Розница
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьАвтоматическиеСкидкиВПродажах.Имя, Ложь,
		Метаданные.Константы.НазначатьСкидкиПоКнопкеРасчетВЧекеККМ.Имя, Ложь);
#КонецОбласти
		
#Область ЭкспортныеОперации
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьПродажиНаЭкспортНесырьевыхТоваров.Имя, Истина,
		Метаданные.Константы.ИспользованиеКлассификаторовНоменклатуры.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьПродажиНаЭкспортСырьевыхТоваровУслуг.Имя, Истина,
		Метаданные.Константы.ИспользованиеКлассификаторовНоменклатуры.Имя, Истина);
#КонецОбласти

#Область УчетИмпортныхТоваров
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьИмпортныеТовары.Имя, Ложь,
		Метаданные.Константы.ИспользоватьИмпортныеЗакупки.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьИмпортныеТовары.Имя, Ложь,
		Метаданные.Константы.ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьИмпортныеТовары.Имя, Ложь,
		Метаданные.Константы.ЗапретитьПоступлениеТоваровБезНомеровГТД.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьИмпортныеТовары.Имя, Ложь,
		Метаданные.Константы.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров.Имя, Ложь,
		Метаданные.Константы.ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД.Имя, Ложь);
#КонецОбласти
	
#Область Продажи
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьРасширенныеВозможностиЗаказаКлиента.Имя, Истина,
		Метаданные.Константы.ИспользоватьОтчетДвиженияЗаказов.Имя, НЕ БазоваяВерсия);
#КонецОбласти
	
#Область Комиссия
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьПродажуАгентскихУслуг.Имя, Истина,
		Метаданные.Константы.ИспользоватьКомиссиюПриЗакупках.Имя, Истина);	
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользуетсяКомиссионнаяПродажа20.Имя, Истина,
		Метаданные.Константы.ИспользоватьКомиссиюПриПродажахБазовая.Имя, Истина И БазоваяВерсия);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользуетсяКомиссионнаяПродажа20.Имя, Истина,
		Метаданные.Константы.ИспользоватьКомиссиюПриПродажахНеБазовая.Имя, Истина И НЕ БазоваяВерсия);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользуетсяКомиссионнаяПродажа20.Имя, Ложь,
		Метаданные.Константы.ИспользоватьКомиссиюПриПродажахБазовая.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользуетсяКомиссионнаяПродажа20.Имя, Ложь,
		Метаданные.Константы.ИспользоватьКомиссиюПриПродажахНеБазовая.Имя, Ложь);
			
#КонецОбласти

#Область Производство
#КонецОбласти


	
	
	
#Область ИнтеграцияГИСМ
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркировкиПродукцииВГИСМ.Имя, Истина,
		Метаданные.Константы.ИспользованиеКлассификаторовНоменклатуры.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркировкиПродукцииВГИСМ.Имя, Истина,
		Метаданные.Константы.ИспользоватьСерииНоменклатуры.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркировкиПродукцииВГИСМ.Имя, Истина,
		Метаданные.Константы.ИспользоватьНесколькоВидовНоменклатуры.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркировкиПродукцииВГИСМ.Имя, Истина,
		Метаданные.Константы.КонтролироватьУникальностьНоменклатурыПоСочетаниюЗначенийРеквизитов.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркировкиПродукцииВГИСМ.Имя, Истина,
		Метаданные.Константы.ИспользоватьЭлектронныеПодписи.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркировкиПродукцииВГИСМ.Имя, Ложь,
		Метаданные.Константы.ИспользоватьАвтоматическуюОтправкуПолучениеДанныхГИСМ.Имя, Ложь);
	
#КонецОбласти
	
#Область ИнтеграцияЕГАИС
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиСведенияДляДекларацийПоАлкогольнойПродукции.Имя, Истина,
		Метаданные.Константы.ИспользоватьНесколькоВидовНоменклатуры.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиСведенияДляДекларацийПоАлкогольнойПродукции.Имя, Истина,
		Метаданные.Константы.ВестиСведенияДляДекларацийАлкоВРознице.Имя, Истина);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиСведенияДляДекларацийПоАлкогольнойПродукции.Имя, Ложь,
		Метаданные.Константы.ВестиСведенияДляДекларацийАлкоВРознице.Имя, Ложь);
	
#КонецОбласти
	
#Область ИнтеграцияВЕТИС
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетПодконтрольныхТоваровВЕТИС.Имя, Истина,
		Метаданные.Константы.ИспользоватьНесколькоВидовНоменклатуры.Имя, Истина);

	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетПодконтрольныхТоваровВЕТИС.Имя, Ложь,
		Метаданные.Константы.РежимРаботыСТестовымКонтуромВЕТИС.Имя, Ложь);
		
#КонецОбласти
	
#Область ИнтеграцияИСМП
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркируемойПродукцииИСМП.Имя, Истина,
		Метаданные.Константы.ИспользоватьАктыРасхожденийПослеОтгрузки.Имя, Истина);

	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркируемойПродукцииИСМП.Имя, Истина,
		Метаданные.Константы.ИспользоватьАктыРасхожденийПослеПриемки.Имя, Истина);
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркируемойПродукцииИСМП.Имя, Истина,
		Метаданные.Константы.ИспользоватьКорректировкиПриобретений.Имя, Истина);

	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркируемойПродукцииИСМП.Имя, Истина,
		Метаданные.Константы.ИспользоватьКорректировкиРеализаций.Имя, Истина);

	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркируемойПродукцииИСМП.Имя, Истина,
		Метаданные.Константы.ИспользоватьНесколькоВидовНоменклатуры.Имя, Истина);

	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетМаркируемойПродукцииИСМП.Имя, Истина,
		Метаданные.Константы.ИспользоватьЭлектронныеПодписи.Имя, Истина);

#КонецОбласти

#Область ИнтеграцияЗЕРНО
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО.Имя, Истина,
		Метаданные.Константы.ИспользоватьНесколькоВидовНоменклатуры.Имя, Истина);

	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО.Имя, Истина,
		Метаданные.Константы.ИспользоватьЭлектронныеПодписи.Имя, Истина);
	
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО.Имя, Истина,
		Метаданные.Константы.ИспользованиеКлассификаторовНоменклатуры.Имя, Истина);
	
#КонецОбласти

#Область СервисРаботаСНоменклатурой
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьСервисРаботаСНоменклатурой.Имя, Истина,
		Метаданные.Константы.ИспользоватьДополнительныеРеквизитыИСведения.Имя, Истина);
#КонецОбласти

#Область ФЗ54
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ОтправкаЭлектронныхЧековПослеПробитияЧека.Имя, Ложь,
		Метаданные.Константы.ОтправлятьЭлектронныеЧекиПоSMSЧерезОФД.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ОтправкаЭлектронныхЧековПослеПробитияЧека.Имя, Ложь,
		Метаданные.Константы.ОтправлятьЭлектронныеЧекиПоEmailЧерезОФД.Имя, Ложь);
		
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ОтправкаЭлектронныхЧековПослеПробитияЧека.Имя, Ложь,
		Метаданные.Константы.НеПечататьФискальныйЧекПриОтправкеЭлектронногоЧекаПокупателю.Имя, Ложь);
#КонецОбласти
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ПрочийПрограммныйИнтерфейс

// Устанавливает видимость групп элементов, относящихся к элементам локализации. 
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, в которой необходима установка видимости.
Процедура УстановитьВидимостьЭлементовЛокализации(Форма) Экспорт
	ЛокализацияРФ = ПолучитьФункциональнуюОпцию("ЛокализацияРФ");
	Если ЛокализацияРФ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = тип("ГруппаФормы") 
			И СтрНачинаетсяС(ЭлементФормы.Имя, "Локализация") Тогда
			ЭлементФормы.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Позволяет переопределить код валюты по умолчанию.
//
// Параметры:
//  КодВалюты	 - Строка - код валюты, если не задан, то RUB (643).
//
Процедура ПереопределитьКодВалютыПоУмолчанию(КодВалюты) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользоватьОбменССайтом() Экспорт
	Результат = Ложь;
	//++ Локализация
	Результат = ПолучитьФункциональнуюОпцию("ИспользоватьОбменССайтом");
	//-- Локализация
	Возврат Результат
КонецФункции

// Переопределяет имя макета с правилами обмена.
// Параметры:
// 	ИмяПравилОбмена -  Строка - Имя макета.
Процедура ДополнитьИмяПравилОбменаПомощникВыгрузкиЗагрузкиМоделиМеждународногоУчета(ИмяПравилОбмена) Экспорт
	//++ Локализация
	ИмяПравилОбмена = "ПравилаОбмена";
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СинхронизироватьЗначенияПодчиненныхКонстант(ИмяКонстанты, ЗначениеКонстанты, Отказ) Экспорт
	//++ Локализация

	
	Если ИмяКонстанты = Метаданные.Константы.ИспользоватьСогласованиеЗаявокНаВозвратТоваровОтКлиентов.Имя
			Или ИмяКонстанты = Метаданные.Константы.ИспользоватьСогласованиеЗаказовКлиентов.Имя
			Или ИмяКонстанты = Метаданные.Константы.ИспользоватьСогласованиеСоглашенийСКлиентами.Имя Тогда
		
		ИмяПодчиненнойКонстанты = СтрЗаменить(
			ИмяКонстанты,
			"ИспользоватьСогласование",
			"ИспользоватьВнутреннееСогласование");
		ЗначениеПодчиненнойКонстанты = ЗначениеКонстанты;
		// ИнтеграцияС1СДокументооборотом
		ЗначениеПодчиненнойКонстанты = ЗначениеПодчиненнойКонстанты
			И Не Константы.ИспользоватьСогласованиеЧерез1СДокументооборот.Получить();
		// Конец ИнтеграцияС1СДокументооборотом
		
		НастройкиСистемы.УстановитьЗначениеКонстанты(
			Константы[ИмяПодчиненнойКонстанты],
			ЗначениеПодчиненнойКонстанты);
		
	ИначеЕсли ИмяКонстанты = Метаданные.Константы.ОтображениеСкидокВПечатныхФормахДокументовПродажи.Имя Тогда
		
		ИспользоватьСчетаНаОплатуКлиентом = Константы.ИспользоватьСчетаНаОплатуКлиентам.Получить();
		
		ЗначениеПодчиненнойКонстанты = ?(НЕ ИспользоватьСчетаНаОплатуКлиентом, Константы.ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи.Получить(), Ложь);
		
		НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.НеИспользоватьСчетаНаОплатуВыбиратьВариантВыводаСкидок, ЗначениеПодчиненнойКонстанты);
		НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.НеИспользоватьСчетаНаОплатуНеВыбиратьВариантВыводаСкидок, ?(НЕ ИспользоватьСчетаНаОплатуКлиентом, НЕ ЗначениеПодчиненнойКонстанты, ЗначениеПодчиненнойКонстанты));
		
	ИначеЕсли ИмяКонстанты = Метаданные.Константы.ИспользоватьИмпортныеТовары.Имя
		Или ИмяКонстанты = Метаданные.Константы.ИспользоватьТоварыВПутиОтПоставщиков.Имя Тогда
		
		ЗначениеКонстантыДляУстановки = Константы.ИспользоватьИмпортныеТовары.Получить()
										И Константы.ИспользоватьТоварыВПутиОтПоставщиков.Получить();
		
		НастройкиСистемы.УстановитьЗначениеКонстанты(
			Константы.КонтролироватьОстаткиНомеровГТДПриИмпортеПоСхемеТоварыВПути,
			ЗначениеКонстантыДляУстановки);
		
		НастройкиСистемы.УстановитьЗначениеКонстанты(
			Константы.ПроверятьЗаполнениеНомеровГТДПриЗакупкеУПоставщикаПоСхемеТоварыВПути,
			ЗначениеКонстантыДляУстановки);
		
		НастройкиСистемы.УстановитьЗначениеКонстанты(
			Константы.КонтролироватьОстаткиНомеровГТДПриЗакупкеУПоставщикаПоСхемеТоварыВПути,
			ЗначениеКонстантыДляУстановки);
	
	ИначеЕсли ИмяКонстанты = Метаданные.Константы.ИспользованиеКлассификаторовНоменклатуры.Имя
			ИЛИ ИмяКонстанты = Метаданные.Константы.ИспользоватьРеглУчет.Имя Тогда
		
		ИспользованиеКлассификаторовНоменклатуры = Константы.ИспользованиеКлассификаторовНоменклатуры.Получить();
		ИспользоватьРеглУчет = Константы.ИспользоватьРеглУчет.Получить();
		ЗначениеКонстантыДляУстановки = ИспользованиеКлассификаторовНоменклатуры ИЛИ ИспользоватьРеглУчет;
		НастройкиСистемы.УстановитьЗначениеКонстанты(
			Константы.ИспользованиеСтарыхКлассификаторовОКПиОКВЭД,
			ЗначениеКонстантыДляУстановки);
		
	КонецЕсли;
	
	Если ИмяКонстанты = Метаданные.Константы.ИспользоватьВвозТоваровИзТаможенногоСоюза.Имя
		ИЛИ ИмяКонстанты = Метаданные.Константы.ИспользоватьТоварыВПутиОтПоставщиков.Имя Тогда
		
		ИспользоватьВвозТоваровИзТаможенногоСоюза = Константы.ИспользоватьВвозТоваровИзТаможенногоСоюза.Получить();
		ИспользоватьТоварыВПутиОтПоставщиков = Константы.ИспользоватьТоварыВПутиОтПоставщиков.Получить();
		
		НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.ИспользоватьВвозТоваровИзТаможенногоСоюзаТоварыВПути, 
			ИспользоватьВвозТоваровИзТаможенногоСоюза И ИспользоватьТоварыВПутиОтПоставщиков);
		
	КонецЕсли;
	
	Если ИмяКонстанты = Метаданные.Константы.ИспользоватьВвозТоваровИзТаможенногоСоюза.Имя
		ИЛИ ИмяКонстанты = Метаданные.Константы.ИспользоватьНеотфактурованныеПоставки.Имя Тогда
		
		ИспользоватьВвозТоваровИзТаможенногоСоюза = Константы.ИспользоватьВвозТоваровИзТаможенногоСоюза.Получить();
		ИспользоватьНеотфактурованныеПоставки = Константы.ИспользоватьНеотфактурованныеПоставки.Получить();
		
		НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.ИспользоватьВвозТоваровИзТаможенногоСоюзаНеотфактурованныеПоставки, 
			ИспользоватьВвозТоваровИзТаможенногоСоюза И ИспользоватьНеотфактурованныеПоставки);
		
	КонецЕсли;
	
	Если ИмяКонстанты = Метаданные.Константы.ИспользоватьПродажиНаЭкспортНесырьевыхТоваров.Имя
		ИЛИ ИмяКонстанты = Метаданные.Константы.ИспользоватьПродажиНаЭкспортСырьевыхТоваровУслуг.Имя Тогда
		
		ИспользоватьПродажиНаЭкспортНесырьевыхТоваров = Константы.ИспользоватьПродажиНаЭкспортНесырьевыхТоваров.Получить();
		ИспользоватьПродажиНаЭкспортСырьевыхТоваровУслуг = Константы.ИспользоватьПродажиНаЭкспортСырьевыхТоваровУслуг.Получить();
		
		НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.ИспользоватьПродажиНаЭкспорт, 
			ИспользоватьПродажиНаЭкспортНесырьевыхТоваров ИЛИ ИспользоватьПродажиНаЭкспортСырьевыхТоваровУслуг);
		
	КонецЕсли;
	
	
	Если ИмяКонстанты = "ИспользоватьНесколькоВалют" Тогда
		
		Если НЕ ЗначениеКонстанты Тогда
			
			ЗначениеПодчиненнойКонстанты = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета();
			
			НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.ВалютаРегламентированногоУчета, ЗначениеПодчиненнойКонстанты);
		КонецЕсли;
		
	КонецЕсли;
		
	//-- Локализация
	Возврат
КонецПроцедуры

#Область ОбработчикиСобытийПанелейАдминистрирования

#Область ОбработчикиСобытий_ПанельСправочниковНСИ_КлассификаторыНоменклатуры

// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - 
Процедура УстановитьДоступность_КлассификаторыНоменклатуры(Форма) Экспорт
	//++ Локализация
	Элементы = Форма.Элементы; 
	
	// Функциональные опции
	// ИнтеграцияГИСМ
	ВестиУчетМаркировкиПродукцииВГИСМ        = ПолучитьФункциональнуюОпцию("ВестиУчетМаркировкиПродукцииВГИСМ");
	// Конец ИнтеграцияГИСМ
	
	// ИнтеграцияИСМП
	ВестиУчетМаркируемойПродукцииИСМП        = ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
	// Конец ИнтеграцияИСМП
	
	ИспользованиеКлассификаторовНоменклатуры         = ПолучитьФункциональнуюОпцию("ИспользованиеКлассификаторовНоменклатуры");
	ИспользованиеСтарыхКлассификаторовОКПиОКВЭД      = ПолучитьФункциональнуюОпцию("ИспользованиеСтарыхКлассификаторовОКПиОКВЭД");
	ВестиСведенияДляДекларацийПоАлкогольнойПродукции = ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
	
	// Право чтения
	// ИнтеграцияГИСМ
	ПравоДоступаКлассификаторВидыМехаГИСМ	= ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыМехаГИСМ);
	// Конец ИнтеграцияГИСМ
	ПравоДоступаКлассификаторыОКВЭД			= ПравоДоступа("Просмотр", Метаданные.Справочники.КлассификаторВидовЭкономическойДеятельности);
	ПравоДоступаКлассификаторыОКП			= ПравоДоступа("Просмотр", Метаданные.Справочники.ОбщероссийскийКлассификаторПродукции);
	ПравоДоступаКлассификаторыОКВЭД2		= ПравоДоступа("Просмотр", Метаданные.Справочники.КлассификаторОКВЭД2);
	ПравоДоступаКлассификаторыОКПД2			= ПравоДоступа("Просмотр", Метаданные.Справочники.КлассификаторОКПД2);
	ПравоДоступаКлассификаторыТНВЭД			= ПравоДоступа("Просмотр", Метаданные.Справочники.КлассификаторТНВЭД);
	
	// Видимость
	// ИнтеграцияГИСМ
	Элементы.ОткрытьВидыМехаГИСМ.Видимость = ПравоДоступаКлассификаторВидыМехаГИСМ 
		И ВестиУчетМаркируемойПродукцииИСМП;
	// Конец ИнтеграцияГИСМ
	Элементы.ГруппаНоменклатураВидАлкоголя.Видимость = ВестиСведенияДляДекларацийПоАлкогольнойПродукции;
	Элементы.ОткрытьКлассификаторОКПД2.Видимость = ИспользованиеКлассификаторовНоменклатуры
		И ПравоДоступаКлассификаторыОКПД2;
	Элементы.ОткрытьКлассификаторОКВЭД2.Видимость = ИспользованиеКлассификаторовНоменклатуры
		И ПравоДоступаКлассификаторыОКВЭД2;
	Элементы.ОткрытьКлассификаторВидовЭкономическойДеятельности.Видимость = ИспользованиеСтарыхКлассификаторовОКПиОКВЭД
		И ПравоДоступаКлассификаторыОКВЭД;
	Элементы.ОткрытьОбщероссийскийКлассификаторПродукции.Видимость = ИспользованиеСтарыхКлассификаторовОКПиОКВЭД
		И ПравоДоступаКлассификаторыОКП;
	
	Элементы.ОткрытьКлассификаторТНВЭД.Видимость = (Элементы.ОткрытьКлассификаторТНВЭД.Видимость
														Или ВестиУчетМаркировкиПродукцииВГИСМ)
													И ПравоДоступаКлассификаторыТНВЭД;
	
	//-- Локализация
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Закупки

Процедура ПриСозданииНаСервере_Закупки(Форма) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - 
Процедура ПриЧтенииНаСервере_Закупки(Форма) Экспорт
	//++ Локализация
	ЗначенияПоУмолчанию = Форма.ЗначенияПоУмолчанию;
	Если ЗначенияПоУмолчанию = Неопределено Тогда
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;
	Форма.ЗначенияПоУмолчанию = ЗначенияПоУмолчанию;
	//-- Локализация
	Возврат
КонецПроцедуры

// Параметры:
// 	РеквизитПутьКДанным - Строка -
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Закупки
Процедура УстановитьДоступность_Закупки(РеквизитПутьКДанным, Форма) Экспорт
	//++ Локализация

	Элементы = Форма.Элементы; // ЭлементыФормы - 
	НаборКонстант = Форма.НаборКонстант;
		
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьДоговорыСПоставщиками" ИЛИ РеквизитПутьКДанным = "" Тогда
		ЗначениеКонстанты = НаборКонстант.ИспользоватьДоговорыСПоставщиками;
		ПолеФормы = Элементы.ЛокализацияГруппаАвтоПостановкаПоставщиковНаМониторингСПАРК; //ПолеФормы - 
		ПолеФормы.Доступность = ЗначениеКонстанты;
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьДоговорыСПоставщиками" ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстанты275ФЗ = Ложь;
		
		ДоговорыСПоставщикамиРедактированиеДоступно = Элементы.ИспользоватьДоговорыСПоставщиками.Доступность
													И Не ЗначениеКонстанты275ФЗ;
			
		Элементы.ИспользоватьДоговорыСПоставщиками.Доступность = ДоговорыСПоставщикамиРедактированиеДоступно;
		Элементы.ГруппаДоговорыСПоставщикамиНевозможноОтключить.Видимость = Не ДоговорыСПоставщикамиРедактированиеДоступно;
		
		ТекстКомментария = Элементы.КомментарийИспользоватьДоговорыСПоставщиками.Заголовок;
		
		ТекстКомментария = ТекстКомментария
			+ ?(ЗначениеКонстанты275ФЗ,
			Символы.ПС + НСтр("ru = '— включена поддержка платежей в соответствии с 275-ФЗ в разделе ""Казначейство""'"),
			"");
		
		Элементы.КомментарийИспользоватьДоговорыСПоставщиками.Заголовок = ТекстКомментария;
		
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьКорректировкиПриобретений" ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстантыИСМП = Константы.ВестиУчетМаркируемойПродукцииИСМП.Получить();
		
		Элементы.ЛокализацияГруппаКомментарийИспользоватьКорректировкиПриобретений.Видимость = ЗначениеКонстантыИСМП;
		Элементы.ИспользоватьКорректировкиПриобретений.Доступность = Не ЗначениеКонстантыИСМП;
		
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьАктыРасхожденийПослеПриемки" ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстантыИСМП = Константы.ВестиУчетМаркируемойПродукцииИСМП.Получить();
		
		Элементы.ЛокализацияГруппаКомментарийИспользоватьАктыОРасхожденияхПослеПриемки.Видимость = ЗначениеКонстантыИСМП;
		Элементы.ГруппаИспользоватьАктыОРасхожденияхПослеПриемки.Доступность = Не ЗначениеКонстантыИСМП;
		
	КонецЕсли;
	
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура СохранитьЗначениеРеквизита_Закупки(КонстантаИмя, КонстантаЗначение, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ОтображениеПредупрежденияПриРедактировании_Закупки(СтруктураКонстант) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Казначейство

Процедура ПриСозданииНаСервере_Казначейство(Форма) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация
	//-- Локализация
КонецПроцедуры

Процедура ПриЧтенииНаСервере_Казначейство(Форма) Экспорт
	//++ Локализация
	ЗначенияПоУмолчанию = Форма.ЗначенияПоУмолчанию;
	Если ЗначенияПоУмолчанию = Неопределено Тогда
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;
	Форма.ЗначенияПоУмолчанию = ЗначенияПоУмолчанию;
	//-- Локализация
	Возврат
КонецПроцедуры

// Параметры:
// 	РеквизитПутьКДанным - Строка -
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Казначейство
Процедура УстановитьДоступность_Казначейство(РеквизитПутьКДанным, Форма) Экспорт
	//++ Локализация
	Элементы = Форма.Элементы;
	НаборКонстант = Форма.НаборКонстант;
	
	Если РеквизитПутьКДанным = "" Тогда
		УправлениеТорговлей = ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
		
		Элементы.ИспользоватьНесколькоРасчетныхСчетов.Доступность = Не НаборКонстант.ИспользоватьНесколькоОрганизаций
			И Не НаборКонстант.ИспользоватьВалютныеПлатежи;
				
		Элементы.ЛокализацияГруппаПоддержкаБанковскогоИКазначейскогоСопровожденияГосконтрактов.Видимость = Не УправлениеТорговлей;
	КонецЕсли;
	
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьИнтеграциюСоСмартвей" Или РеквизитПутьКДанным = "" Тогда
	
		Элемент = Элементы.ИнтеграцияСмартвей; // ПолеФормы
		Если Форма.НаборКонстант.ИспользоватьИнтеграциюСоСмартвей Тогда
			СтрокаЗаголовка = НСтр("ru = 'Интеграция с сервисом бронирования Smartway (используется)'");
		Иначе
			СтрокаЗаголовка = НСтр("ru = 'Интеграция с сервисом бронирования Smartway (не используется)'");
		КонецЕсли;
		Элемент.Заголовок = Новый ФорматированнаяСтрока(СтрокаЗаголовка,,,, "НастроитьИнтеграциюСмартвей");
	КонецЕсли;
	
	Элементы.ИнтеграцияСмартвей.Доступность = Форма.НаборКонстант.НоваяАрхитектураВзаиморасчетов
			ИЛИ Форма.НаборКонстант.ИспользоватьИнтеграциюСоСмартвей;
		Элементы.ГруппаКомментарийИспользованияСмартвей.Видимость = Не Элементы.ИнтеграцияСмартвей.Доступность;
	
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура СохранитьЗначениеРеквизита_Казначейство(КонстантаИмя, КонстантаЗначение, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ОтображениеПредупрежденияПриРедактировании_Казначейство(СтруктураКонстант) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_НастройкиНоменклатуры

// Параметры:
//	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.НастройкиНоменклатуры
//
Процедура ПриСозданииНаСервере_НастройкиНоменклатуры(Форма) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация

	РежимРаботы = Форма.РежимРаботы;
	СоставНабораКонстантФормы = РежимРаботы.СоставНабораКонстантФормы;
	ВнешниеРодительскиеКонстанты = РежимРаботы.ВнешниеРодительскиеКонстанты;
	УправлениеПредприятием = РежимРаботы.УправлениеПредприятием;
	
	ВнешниеРодительскиеКонстанты = Новый Структура(ВнешниеРодительскиеКонстанты);
	ВнешниеРодительскиеКонстанты.Вставить("ВестиУчетМаркировкиПродукцииВГИСМ");
	ВнешниеРодительскиеКонстанты.Вставить("ИспользоватьОбменЭД");
	ВнешниеРодительскиеКонстанты.Вставить("ИспользоватьЭлектронноеАктированиеВЕИС");
	
	РежимРаботы = Новый Структура;
	РежимРаботы.Вставить("СоставНабораКонстантФормы",    СоставНабораКонстантФормы);
	РежимРаботы.Вставить("ВнешниеРодительскиеКонстанты", Новый ФиксированнаяСтруктура(ВнешниеРодительскиеКонстанты));
	РежимРаботы.Вставить("УправлениеПредприятием",	 	 УправлениеПредприятием);
	
	Форма.РежимРаботы = Новый ФиксированнаяСтруктура(РежимРаботы);
	
	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.ОткрытьЕдиницыИзмерения.РасширеннаяПодсказка.Заголовок = НСтр("ru='Классификатор единиц измерения, основывающийся на Общероссийском классификаторе единиц измерения.'");
	
	ЭлементыФормы.ИспользоватьУчетДрагоценныхМатериалов.Видимость = Ложь;
		
	ЭлементыФормы.НастройкиСертификатовНоменклатуры.Видимость = Истина;
	
	//-- Локализация
	Возврат
КонецПроцедуры 

Процедура ПриЧтенииНаСервере_НастройкиНоменклатуры(Форма) Экспорт
	//++ Локализация
	ЗначенияПоУмолчанию = Форма.ЗначенияПоУмолчанию;
	Если ЗначенияПоУмолчанию = Неопределено Тогда
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;
	Форма.ЗначенияПоУмолчанию = ЗначенияПоУмолчанию;
	//-- Локализация
	Возврат
КонецПроцедуры

// Параметры:
// 	РеквизитПутьКДанным - Строка -
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.НастройкиНоменклатуры
Процедура УстановитьДоступность_НастройкиНоменклатуры(РеквизитПутьКДанным, Форма) Экспорт
	//++ Локализация
	Элементы = Форма.Элементы;
	НаборКонстант = Форма.НаборКонстант;
	
	Если РеквизитПутьКДанным = "" Тогда
		
		ИспользоватьКлассификаторыНоменклатуры	= НаборКонстант.ВестиУчетМаркировкиПродукцииВГИСМ
													Или НаборКонстант.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО;
		КоличествоВключенныхОпций				= Число(НаборКонстант.ВестиУчетМаркировкиПродукцииВГИСМ)
													+ Число(НаборКонстант.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО);
		
		Элементы.ГруппаКомментарийИспользоватьКлассификаторыНоменклатуры.Видимость =
			ИспользоватьКлассификаторыНоменклатуры;
			
		Элементы.ИспользованиеКлассификаторовНоменклатуры.Доступность = Не ИспользоватьКлассификаторыНоменклатуры;
		
		Если КоличествоВключенныхОпций > 0 Тогда
			
			РазделительТекстов = ?(КоличествоВключенныхОпций = 1, Символы.НПП, Символы.ПС + "—" + Символы.НПП);
			
			ТекстКомментария = ?(КоличествоВключенныхОпций = 1,
								НСтр("ru = 'Невозможно отключение использования классификаторов номенклатуры, потому что включена опция'"),
								НСтр("ru = 'Невозможно отключение использования классификаторов номенклатуры, потому что включены опции:'"));
			
			
			ТекстКомментария = ТекстКомментария
								+ ?(НаборКонстант.ВестиУчетМаркировкиПродукцииВГИСМ,
									РазделительТекстов + НСтр("ru = '""Маркировка товаров контрольными (идентификационными) знаками"" (находится в разделе ""1С:Маркировка"");'"),
									"");
			
			ТекстКомментария = ТекстКомментария
								+ ?(НаборКонстант.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО,
								РазделительТекстов + НСтр("ru = '""Учет зерна и продуктов переработки"" (находится в разделе ""Настройка интеграции с ФГИС ""Зерно"");'"),
								"");
			
			ТекстКомментария = Сред(ТекстКомментария, 1, СтрДлина(ТекстКомментария) - 1) + ".";
			
			Элементы.КомментарийИспользоватьКлассификаторыНоменклатуры.Заголовок = ТекстКомментария;
		КонецЕсли;
		
		Элементы.ГруппаГруппаДоступаНоменклатурыИзСервиса.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСервисРаботаСНоменклатурой");
		
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьНоменклатуруПартнеров"
		Или РеквизитПутьКДанным = "" Тогда
		
		ИспользоватьОбменЭД = НаборКонстант.ИспользоватьОбменЭД;
		ИспользоватьЭлектронноеАктированиеВЕИС = НаборКонстант.ИспользоватьЭлектронноеАктированиеВЕИС;
		
		КоличествоВключенныхОпций = Число(ИспользоватьОбменЭД)
								  + Число(ИспользоватьЭлектронноеАктированиеВЕИС);
		
		РазделительТекстов = ?(КоличествоВключенныхОпций = 1, Символы.НПП, Символы.ПС + "—" + Символы.НПП);
		
		ТекстКомментария = ?(КоличествоВключенныхОпций = 1,
							НСтр("ru = 'Невозможно отключение использования номенклатуры поставщиков, потому что включена опция'"),
							НСтр("ru = 'Невозможно отключение использования номенклатуры поставщиков, потому что включены опции:'"));
		
		ТекстКомментария = ТекстКомментария
							+ ?(ИспользоватьОбменЭД,
								РазделительТекстов + НСтр("ru = '""Сервисы ЭДО"" (находится в разделе ""Обмен электронными документами"");'"),
								"");
								
		ТекстКомментария = ТекстКомментария
							+ ?(ИспользоватьЭлектронноеАктированиеВЕИС,
								РазделительТекстов + НСтр("ru = 'Обмен с ЕИС для целей электронного актирования поставщика;'"),
								"");
		
		ТекстКомментария = Сред(ТекстКомментария, 1, СтрДлина(ТекстКомментария) - 1) + ".";
		
		Элементы.ГруппаКомментарийИспользоватьНоменклатуруПоставщиков.Видимость = ИспользоватьОбменЭД Или ИспользоватьЭлектронноеАктированиеВЕИС;
		Элементы.ИспользоватьНоменклатуруПартнеров.Доступность = Не ИспользоватьОбменЭД И Не ИспользоватьЭлектронноеАктированиеВЕИС;
		Элементы.КомментарийИспользоватьНоменклатуруПоставщиков.Заголовок = ТекстКомментария;
		
	КонецЕсли; 
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользованиеКлассификаторовНоменклатуры"
		Или РеквизитПутьКДанным = "" Тогда
		
		Элементы.ИспользованиеСтарыхКлассификаторовОКПиОКВЭД.Доступность = 
			НаборКонстант.ИспользованиеКлассификаторовНоменклатуры
			И Не НаборКонстант.ИспользоватьРеглУчет;
		
	КонецЕсли;
		
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьНесколькоВидовНоменклатуры"
		Или РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстанты = НаборКонстант.ИспользоватьНесколькоВидовНоменклатуры;
		
		Элементы.ИспользоватьМногооборотнуюТару.Доступность = ЗначениеКонстанты;
		Элементы.ПредлагатьДополнитьДокументыМногооборотнойТарой.Доступность = ЗначениеКонстанты
			И НаборКонстант.ИспользоватьМногооборотнуюТару;
			
		Элементы.ГруппаКомментарийИспользоватьНесколькоВидов.Видимость = НаборКонстант.ВестиУчетМаркируемойПродукцииИСМП
			Или НаборКонстант.ВестиСведенияДляДекларацийПоАлкогольнойПродукции
			Или НаборКонстант.ВестиУчетПодконтрольныхТоваровВЕТИС
			Или НаборКонстант.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО;
			
		Элементы.ИспользоватьНесколькоВидовНоменклатуры.Доступность = Не НаборКонстант.ВестиУчетМаркируемойПродукцииИСМП
			И Не НаборКонстант.ВестиСведенияДляДекларацийПоАлкогольнойПродукции
			И Не НаборКонстант.ВестиУчетПодконтрольныхТоваровВЕТИС
			И Не НаборКонстант.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО;
		
		
		КоличествоВключенныхОпций = + Число(НаборКонстант.ВестиУчетМаркируемойПродукцииИСМП)
									+ Число(НаборКонстант.ВестиСведенияДляДекларацийПоАлкогольнойПродукции)
									+ Число(НаборКонстант.ВестиУчетПодконтрольныхТоваровВЕТИС)
									+ Число(НаборКонстант.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО);
									
		Если КоличествоВключенныхОпций > 0 Тогда
			
			РазделительТекстов = ?(КоличествоВключенныхОпций = 1, Символы.НПП, Символы.ПС + "—" + Символы.НПП);
			
			ТекстКомментария = ?(КоличествоВключенныхОпций = 1,
								НСтр("ru = 'Невозможно отключение множества видов номенклатуры, потому что включена опция'"),
								НСтр("ru = 'Невозможно отключение множества видов номенклатуры, потому что включены опции:'"));
								
			
			ТекстКомментария = ТекстКомментария
								+ ?(НаборКонстант.ВестиСведенияДляДекларацийПоАлкогольнойПродукции,
									РазделительТекстов + НСтр("ru = '""Используется алкогольная (спиртосодержащая) продукция в рознице"" (находится в разделе ""Продажи"");'"),
									"");
			
			ТекстКомментария = ТекстКомментария
								+ ?(НаборКонстант.ВестиУчетМаркируемойПродукцииИСМП,
								РазделительТекстов + НСтр("ru = '""Маркировка товаров"" (находится в разделе ""Настройка интеграции с ИС МП"");'"),
								"");
						
			ТекстКомментария = ТекстКомментария
								+ ?(НаборКонстант.ВестиУчетПодконтрольныхТоваровВЕТИС,
								РазделительТекстов + НСтр("ru = '""Используется продукция, подконтрольная ВетИС"" (находится в разделе ""Настройка интеграции с ВетИС"");'"),
								"");
			
			ТекстКомментария = ТекстКомментария
								+ ?(НаборКонстант.ВестиУчетЗернаИПродуктовПереработкиЗЕРНО,
								РазделительТекстов + НСтр("ru = '""Учет зерна и продуктов переработки"" (находится в разделе ""Настройка интеграции с ФГИС ""Зерно"");'"),
								"");
			
			ТекстКомментария = Сред(ТекстКомментария, 1, СтрДлина(ТекстКомментария) - 1) + ".";
			
			Элементы.КомментарийИспользоватьНесколькоВидов.Заголовок = ТекстКомментария;
		КонецЕсли;
		
	КонецЕсли;

	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьМногооборотнуюТару" 
		Или РеквизитПутьКДанным = "НаборКонстант.ИспользоватьНесколькоВидовНоменклатуры"
		Или РеквизитПутьКДанным = "" Тогда
		ЗначениеКонстанты = НаборКонстант.ИспользоватьМногооборотнуюТару;
		
		ОбщегоНазначенияУТКлиентСервер.ОтображениеПредупрежденияПриРедактировании(
			Элементы.ИспользоватьМногооборотнуюТару, ЗначениеКонстанты);
			
		Элементы.ПредлагатьДополнитьДокументыМногооборотнойТарой.Доступность = ЗначениеКонстанты;
	КонецЕсли;
		
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьСерииНоменклатуры" Или РеквизитПутьКДанным = "" Тогда
		Элементы.ГруппаКомментарийНевозможноОтключениеСерий.Видимость = НаборКонстант.ВестиУчетМаркировкиПродукцииВГИСМ;
		Элементы.ИспользоватьСерииНоменклатуры.Доступность = Не НаборКонстант.ВестиУчетМаркировкиПродукцииВГИСМ;
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.КонтролироватьУникальностьНоменклатурыПоСочетаниюЗначенийРеквизитов"
		Или РеквизитПутьКДанным = "" Тогда
		ЗначениеКонстанты = НаборКонстант.КонтролироватьУникальностьНоменклатурыПоСочетаниюЗначенийРеквизитов;
		Элементы.ГруппаКомментарийКонтролироватьУникальность.Видимость = НаборКонстант.ВестиУчетМаркировкиПродукцииВГИСМ;
		Элементы.КонтролироватьУникальностьНоменклатурыПоСочетаниюЗначенийРеквизитов.Доступность = Не НаборКонстант.ВестиУчетМаркировкиПродукцииВГИСМ;
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьСертификатыНоменклатуры"
		Или РеквизитПутьКДанным = "" Тогда
		
		Элементы.НастройкиСертификатовНоменклатуры.Доступность =
			НаборКонстант.ИспользоватьСертификатыНоменклатуры;
		
	КонецЕсли;
		
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура СохранитьЗначениеРеквизита_НастройкиНоменклатуры(КонстантаИмя, КонстантаЗначение, Форма) Экспорт
	//++ Локализация
	
	Если КонстантаИмя <> "" Тогда
		
		КонстантаЗначение	= Форма.НаборКонстант[КонстантаИмя];
		НаборКонстант		= Форма.НаборКонстант;
		
				
		Если КонстантаИмя = "ВариантПроверкиСтатусовСертификатовНоменклатурыРосаккредитации" Тогда
			Использование = НаборКонстант.ИспользоватьСертификатыНоменклатуры
							И ЗначениеЗаполнено(КонстантаЗначение)
							И КонстантаЗначение <> Перечисления.ВариантыПроверкиСтатусовСертификатовНоменклатурыРосаккредитации.НеПроверять;
			
			НастройкиЗадания = Новый Структура;
			НастройкиЗадания.Вставить("Расписание",		Форма.ОбновлениеСтатусовСертификатовНоменклатурыРосаккредитацииРасписание);
			НастройкиЗадания.Вставить("Использование",	Использование);
			
			СохранитьИзмененияРегламентногоЗадания(Форма.ОбновлениеСтатусовСертификатовНоменклатурыРосаккредитацииИдентификатор,
													НастройкиЗадания);
		КонецЕсли;
		
	КонецЕсли;
	
	//-- Локализация
	Возврат
	
КонецПроцедуры

Процедура ОтображениеПредупрежденияПриРедактировании_НастройкиНоменклатуры(СтруктураКонстант) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_НачальноеЗаполнение


// Описание
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - 
Процедура ПриСозданииНаСервере_НачальноеЗаполнение(Форма) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация
	Элементы = Форма.Элементы;
	
	// Настройки видимости при запуске
	УправлениеТорговлей = ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
	ЛокальныйРежим      = ПолучитьФункциональнуюОпцию("РаботаВЛокальномРежиме");
	
	РазделенныйРежим = ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	
	Элементы.ГруппаОбработкаПомощникПереходаСБухгалтерияПредприятияОткрыть.Видимость = Не РазделенныйРежим;
	
	Элементы.ГруппаОбработкаПомощникПереходаСУправлениеПроизводственнымПредприятиемОткрыть.Видимость = Не УправлениеТорговлей И Не РазделенныйРежим;
	Элементы.ГруппаОбработкаПомощникПереходаСКомплекснаяАвтоматизацияОткрыть.Видимость = Не УправлениеТорговлей И Не РазделенныйРежим;
	Элементы.ГруппаОбработкаПомощникПереходаСЗарплатаИУправлениеПерсоналом25Открыть.Видимость = Не УправлениеТорговлей И Не РазделенныйРежим;
	Элементы.ГруппаОбработкаПомощникПереходаСЗарплатаИУправлениеПерсоналом31Открыть.Видимость = Не УправлениеТорговлей И Не РазделенныйРежим;
	
	Элементы.ГруппаОбработкаПомощникПереходаСТорговляИСклад77Открыть.Видимость = УправлениеТорговлей И ЛокальныйРежим И Не РазделенныйРежим;
	
	Элементы.ГруппаОбработкаЗагрузкаДанныхИзУТ103Открыть.Видимость = УправлениеТорговлей И Не РазделенныйРежим;
	
	Элементы.ГруппаПереносДанныхЗарплатаКадры.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыУТ");
	
	ВидимостьЗагрузкаМетодическойМоделиМеждународногоУчета = Ложь;
	Элементы.ГруппаЗагрузкаМетодическойМоделиМеждународногоУчета.Видимость = ВидимостьЗагрузкаМетодическойМоделиМеждународногоУчета;
	
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ПриЧтенииНаСервере_НачальноеЗаполнение(Форма) Экспорт
	//++ Локализация
	ЗначенияПоУмолчанию = Форма.ЗначенияПоУмолчанию;
	Если ЗначенияПоУмолчанию = Неопределено Тогда
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;
	Форма.ЗначенияПоУмолчанию = ЗначенияПоУмолчанию;
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура УстановитьДоступность_НачальноеЗаполнение(РеквизитПутьКДанным, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура СохранитьЗначениеРеквизита_НачальноеЗаполнение(КонстантаИмя, КонстантаЗначение, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ОтображениеПредупрежденияПриРедактировании_НачальноеЗаполнение(СтруктураКонстант) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Предприятие

// Параметры:
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Предприятие
Процедура ПриСозданииНаСервере_Предприятие(Форма) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация
	Форма.Элементы.ГруппаЗагрузкаКурсовВалютЕЦБ.Видимость = Ложь;
	Форма.Элементы.ВалютаРегламентированногоУчета.Видимость = Истина;
	Форма.Элементы.БазоваяВалютаПоУмолчанию.Видимость = Ложь;
	Форма.Элементы.ГруппаВалютыУчетаЛево.РасширеннаяПодсказка.Заголовок = 
		НСтр("ru = 'Валюта регламентированного учета. Для РФ — российский рубль (для других государств — национальная валюта).'");
	Форма.Элементы.ГруппаМногострановойУчет.Видимость = Ложь;
	Форма.Элементы.МногострановойУчет.Видимость = Ложь;
	Форма.Элементы.ГруппаОсновнаяСтрана.Видимость = Ложь;
	//-- Локализация
КонецПроцедуры

// Параметры:
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Предприятие
Процедура ПриЧтенииНаСервере_Предприятие(Форма) Экспорт
	//++ Локализация
	ЗначенияПоУмолчанию = Форма.ЗначенияПоУмолчанию;
	Если ЗначенияПоУмолчанию = Неопределено Тогда
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;
	Форма.ЗначенияПоУмолчанию = ЗначенияПоУмолчанию;
	//-- Локализация
	Возврат
КонецПроцедуры

// Параметры:
// 	РеквизитПутьКДанным - Строка -
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Предприятие
Процедура УстановитьДоступность_Предприятие(РеквизитПутьКДанным, Форма) Экспорт
	//++ Локализация
	Элементы = Форма.Элементы;
	НаборКонстант = Форма.НаборКонстант;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьНесколькоОрганизаций" ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстанты = НаборКонстант.ИспользоватьНесколькоОрганизаций;
		
		Элементы.ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс.Доступность = ЗначениеКонстанты 
			И НаборКонстант.ИспользоватьПодразделения;
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ВалютаРегламентированногоУчета" ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ОтображениеПредупрежденияПриРедактировании(
				Элементы.ВалютаРегламентированногоУчета, ЗначениеЗаполнено(НаборКонстант.ВалютаРегламентированногоУчета));
			
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьНесколькоВалют" ИЛИ РеквизитПутьКДанным = "Справочник.Валюты"
	ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстанты = НаборКонстант.ИспользоватьНесколькоВалют;
	
		Элементы.ВалютаРегламентированногоУчета.Доступность = ЗначениеКонстанты
			ИЛИ НЕ ЗначениеЗаполнено(НаборКонстант.ВалютаРегламентированногоУчета);
			
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьМногострановойУчет" 
		Или Не ЗначениеЗаполнено(РеквизитПутьКДанным) Тогда

			ЗначениеКонстанты = НаборКонстант.ИспользоватьМногострановойУчет; 
	
			Элементы.ВалютаРегламентированногоУчета.Видимость = НЕ ЗначениеКонстанты;
			
	КонецЕсли;	
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура СохранитьЗначениеРеквизита_Предприятие(КонстантаИмя, КонстантаЗначение, Форма) Экспорт
	//++ Локализация
	Если КонстантаИмя = Метаданные.Константы.ВалютаРегламентированногоУчета.Имя Тогда
		Константы.БазоваяВалютаПоУмолчанию.Установить(КонстантаЗначение);
	КонецЕсли;
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ОтображениеПредупрежденияПриРедактировании_Предприятие(СтруктураКонстант) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Продажи

// Параметры:
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Продажи
Процедура ПриСозданииНаСервере_Продажи(Форма) Экспорт
	//++ Локализация
	Элементы = Форма.Элементы;
	
	// Настройки видимости при запуске
	УправлениеПредприятием = ПолучитьФункциональнуюОпцию("УправлениеПредприятием");
	
	Элементы.ПояснениеИспользованиеЭтаповОплатыВПродажах.Заголовок = НСтр(
		"ru = 'Настройка определяет возможные варианты планирования оплаты в документах ""Заказ клиента"", ""Отчет комиссионера"",
		|""Заявка на возврат товаров от клиента"".'");
	
	Элементы.ГруппаПроизводствоИзДавальческогоСырья.Видимость = Ложь;
	
	РозничныеПродажиЛокализация.ПанельАдминистрированияУТПродажиНастроитьВидимостьЭлементовОплатыЭСФСС(Форма);
	РозничныеПродажиЛокализация.ПанельАдминистрированияУТПродажиЗаполнитьПараметрыПодключенияНСПК(Форма);
	
	//-- Локализация
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
КонецПроцедуры

// Параметры:
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Продажи
Процедура ПриСозданииНаСервере_ПродажиБазовая(Форма) Экспорт
	//++ Локализация
	
	РозничныеПродажиЛокализация.УправлениеВидимостьюЭлементовНастроекЖурналовОперацийБПО(Форма);
	РозничныеПродажиЛокализация.ПанельАдминистрированияУТПродажиНастроитьВидимостьЭлементовОплатыЭСФСС(Форма);
	РозничныеПродажиЛокализация.ПанельАдминистрированияУТПродажиЗаполнитьПараметрыПодключенияНСПК(Форма);
	//-- Локализация
КонецПроцедуры

Процедура ПриЧтенииНаСервере_Продажи(Форма) Экспорт
	//++ Локализация

	ЗначенияПоУмолчанию = Форма.ЗначенияПоУмолчанию;
	Если ЗначенияПоУмолчанию = Неопределено Тогда
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;
	Форма.ЗначенияПоУмолчанию = ЗначенияПоУмолчанию;
	//-- Локализация
	Возврат
КонецПроцедуры

// Параметры:
// 	РеквизитПутьКДанным - Строка -
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Продажи
Процедура УстановитьДоступность_Продажи(РеквизитПутьКДанным, Форма) Экспорт
	//++ Локализация
	Элементы = Форма.Элементы;
	НаборКонстант = Форма.НаборКонстант;

	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьЗаказыКлиентов" 
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ВедетсяРаботаЧерезТорговыхПредставителей"
		ИЛИ РеквизитПутьКДанным = "" Тогда
		
		УстановитьДоступностьНастроекТорговыхПредставителей(Форма);
	
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьТТН" ИЛИ РеквизитПутьКДанным = "" Тогда
		Элементы.НаименованиеДляПечатиВидовНоменклатуры.Доступность = НаборКонстант.ИспользоватьТТН;
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьДоговорыСКлиентами" ИЛИ РеквизитПутьКДанным = "" Тогда
		ЗначениеКонстанты = Константы.ИспользоватьДоговорыСКлиентами.Получить();
		Элементы.ЛокализацияГруппаАвтоПостановкаКлиентовНаМониторингСПАРК.Доступность = ЗначениеКонстанты;
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьДоговорыСКлиентами"
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи"
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ИспользоватьОказаниеАгентскихУслугПриЗакупке"
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ИспользоватьСоглашенияСКлиентами"
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ИспользоватьКомиссиюПриПродажах"
		ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстанты275ФЗ = Ложь;
		
		ЗначениеКонстантыЕИС = Ложь;
		
		ДоступноРедактированиеДоговорыСКлиентами = Элементы.ИспользоватьДоговорыСКлиентами.Доступность
			И Не ЗначениеКонстанты275ФЗ
			И Не ЗначениеКонстантыЕИС;
		
		Элементы.ИспользоватьДоговорыСКлиентами.Доступность = ДоступноРедактированиеДоговорыСКлиентами;
		Элементы.ГруппаИспользоватьДоговорыСКлиентамиПредупреждение.Видимость = Не ДоступноРедактированиеДоговорыСКлиентами;
		
		ТекстКомментария = Элементы.КомментарийИспользоватьДоговорыСКлиентамиПредупреждение.Заголовок;
		
		ТекстКомментария = ТекстКомментария
			+ ?(ЗначениеКонстанты275ФЗ,
			Символы.ПС + НСтр("ru = '— включена поддержка платежей в соответствии с 275-ФЗ в разделе ""Казначейство""'"),
			"");
		
		ТекстКомментария = ТекстКомментария
			+ ?(ЗначениеКонстантыЕИС,
			Символы.ПС + НСтр("ru = '— включена опция ""Использовать обмен с ЕИС для целей электронного актирования поставщика"" в разделе ""Обмен электронными документами""'"),
			"");
		
		Элементы.КомментарийИспользоватьДоговорыСКлиентамиПредупреждение.Заголовок = ТекстКомментария;
			
	КонецЕсли;

	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьКорректировкиРеализаций" ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстантыИСМП = Константы.ВестиУчетМаркируемойПродукцииИСМП.Получить();
		
		Элементы.ЛокализацияГруппаКомментарийИспользоватьКорректировкиРеализации.Видимость = ЗначениеКонстантыИСМП;
		Элементы.ИспользоватьКорректировкиРеализаций.Доступность = Не ЗначениеКонстантыИСМП;
		
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьАктыРасхожденийПослеОтгрузки" ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЗначениеКонстантыИСМП = Константы.ВестиУчетМаркируемойПродукцииИСМП.Получить();
		
		Элементы.ЛокализацияГруппаКомментарийИспользоватьАктыОРасхожденияхПослеОтгрузки.Видимость = ЗначениеКонстантыИСМП;
		Элементы.ГруппаИспользоватьАктыОРасхожденияхПослеОтгрузки.Доступность = Не ЗначениеКонстантыИСМП;
		
	КонецЕсли;
	
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьРозничныеПродажи" 
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ВестиСведенияДляДекларацийПоАлкогольнойПродукции"
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ИспользоватьОплатуПлатежнымиКартами"
		ИЛИ РеквизитПутьКДанным = "" Тогда
		ЗначениеКонстанты = НаборКонстант.ИспользоватьРозничныеПродажи;
		Элементы.ПечататьОтдельныйСлипЧекЭквайринговойОперации.Доступность = (ЗначениеКонстанты И НаборКонстант.ИспользоватьОплатуПлатежнымиКартами);
	КонецЕсли;
		
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура СохранитьЗначениеРеквизита_Продажи(КонстантаИмя, КонстантаЗначение, Форма) Экспорт
	
	//++ Локализация
	Если КонстантаИмя = "ОплатаЭлектроннымиСертификатамиФСС" Тогда
		РозничныеПродажиЛокализация.ПанельАдминистрированияУТПродажиНастроитьВидимостьЭлементовОплатыЭСФСС(Форма);
		РозничныеПродажиЛокализация.ПанельАдминистрированияУТПродажиЗаполнитьПараметрыПодключенияНСПК(Форма);
	КонецЕсли;
	//-- Локализация
	
	Возврат
КонецПроцедуры

Процедура ОтображениеПредупрежденияПриРедактировании_Продажи(СтруктураКонстант) Экспорт
	//++ Локализация
	СтруктураКонстант.Вставить("ИспользоватьКомиссиюПриЗакупках");
	
	
	//-- Локализация
	Возврат
КонецПроцедуры

//++ Локализация

// Параметры:
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.Продажи
Процедура УстановитьДоступностьНастроекТорговыхПредставителей(Форма)
	
	Элементы = Форма.Элементы;
	ЗначениеКонстанты = Форма.НаборКонстант.ВедетсяРаботаЧерезТорговыхПредставителей;
	
	Элементы.ДекорацияОткрытьМобильныеКомпьютеры.Доступность 					= ЗначениеКонстанты;
	Элементы.ДекорацияОткрытьМобильныеПриложения.Доступность 					= ЗначениеКонстанты;
	Элементы.ДекорацияОткрытьНастройкиКомпонентыОбменаДаннымиСКПК.Доступность	= ЗначениеКонстанты;
	Элементы.ДекорацияОткрытьНастройкиТорговыхПредставителей.Доступность		= ЗначениеКонстанты;
	Элементы.ИспользованиеЗаданийТорговымПредставителям.Доступность				= ЗначениеКонстанты;
	
	Элементы.ДетализироватьЗаданияТорговымПредставителямПоНоменклатуре.Доступность =
		Форма.НаборКонстант.ИспользованиеЗаданийТорговымПредставителям <> Перечисления.ИспользованиеЗаданийТорговымПредставителям.НеИспользуются;
	
КонецПроцедуры
//-- Локализация

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_ФинансовыйРезультат

Процедура ПриСозданииНаСервере_ФинансовыйРезультат(Форма) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация
	//-- Локализация
КонецПроцедуры

Процедура ПриЧтенииНаСервере_ФинансовыйРезультат(Форма) Экспорт
	//++ Локализация
	ЗначенияПоУмолчанию = Форма.ЗначенияПоУмолчанию;
	Если ЗначенияПоУмолчанию = Неопределено Тогда
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;
	
	Форма.ЗначенияПоУмолчанию = ЗначенияПоУмолчанию;
	//-- Локализация
	Возврат
КонецПроцедуры

// Параметры:
// 	РеквизитПутьКДанным - Строка -
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.ФинансовыйРезультатИКонтроллинг
Процедура УстановитьДоступность_ФинансовыйРезультат(РеквизитПутьКДанным, Форма) Экспорт
	//++ Локализация
	Элементы = Форма.Элементы;
	НаборКонстант = Форма.НаборКонстант;
	
	ИспользоватьВнеоборотныеАктивы2_2 = Ложь;
	
	// В новой базе выключена видимость выбора версии партионного учета:
	// если включен партионный учет версии 2.2 с пустой датой перехода.
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22()
	 И Не ЗначениеЗаполнено(РасчетСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22()) Тогда
		ПартионныйУчетВерсии22ВоВсехПериодах = Истина;
	Иначе
		ПартионныйУчетВерсии22ВоВсехПериодах = Ложь;
	КонецЕсли;
	
	// В новой базе нельзя выключить управленческий учет по правилам МФУ (выключена видимость флажка):
	// если включен управленческий учет организаций с пустой датой перехода и
	// ранее не использовались внеоборотные активы версии 2.2.
	Если РасчетСебестоимостиПовтИсп.УправленческийУчетОрганизаций()
	 И НЕ ЗначениеЗаполнено(РасчетСебестоимостиПовтИсп.ДатаНачалаВеденияУправленческогоУчетаОрганизаций())
	 И Не ИспользоватьВнеоборотныеАктивы2_2 Тогда
		УправленческийУчетОрганизацийВоВсехПериодах = Истина;
	Иначе
		УправленческийУчетОрганизацийВоВсехПериодах = Ложь;
	КонецЕсли;
	
	Элементы.ДекорацияДопНастройкиУчетаСебестоимости.Видимость = НЕ ПартионныйУчетВерсии22ВоВсехПериодах
		ИЛИ НЕ УправленческийУчетОрганизацийВоВсехПериодах;
	
	ПолеДоступно = Истина;
	
	Элементы.ИспользоватьУчетСебестоимости.Доступность 				  = ПолеДоступно;
	Элементы.ДатаНачалаУчетаСебестоимости.Доступность 				  = ПолеДоступно И НаборКонстант.ИспользоватьУчетСебестоимости;
	Элементы.ГруппаКомментарийИспользоватьУчетСебестоимости.Видимость = НЕ ПолеДоступно;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьПартионныйУчет"
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ПартионныйУчетВерсии22" 
		ИЛИ РеквизитПутьКДанным = "" Тогда
		ПартионныйУчет21 = НаборКонстант.ИспользоватьПартионныйУчет И НЕ НаборКонстант.ПартионныйУчетВерсии22;
		ОбщиеСведенияОНастроенныхОбменах = ОбменДаннымиУТУП.ОбщиеСведенияОНастроенныхОбменах();
		НоваяАрхитектураВзаиморасчетов = Константы.НоваяАрхитектураВзаиморасчетов.Получить();
		Элементы.ИспользоватьИсправлениеДокументов.Доступность = 
			НоваяАрхитектураВзаиморасчетов
			И НЕ ПартионныйУчет21;
		Элементы.ГруппаКомментарийИспользоватьИсправлениеДокументовПартионныйУчет.Видимость = ПартионныйУчет21;
	КонецЕсли;
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

Процедура СохранитьЗначениеРеквизита_ФинансовыйРезультат(КонстантаИмя, КонстантаЗначение, Форма) Экспорт
	//++ Локализация
	НаборКонстант = Форма.НаборКонстант;
	
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ОтображениеПредупрежденияПриРедактировании_ФинансовыйРезультат(СтруктураКонстант) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ДоступностьВестиУправленческийУчетОрганизаций(Форма, КомментарийОпции) Экспорт
	//++ Локализация


	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикСобытий_ПанельАдминистрированияУТ_СкладИДоставка

// Параметры:
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.СкладИДоставка
Процедура ПриСозданииНаСервере_СкладИДоставка(Форма) Экспорт
	
	//++ Локализация
	//-- Локализация
	
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	
КонецПроцедуры

// Установить доступность склад и доставка.
// 
// Параметры:
// 	РеквизитПутьКДанным - Строка -
// 	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.СкладИДоставка
Процедура УстановитьДоступность_СкладИДоставка(РеквизитПутьКДанным, Форма) Экспорт
	//++ Локализация
	
	// ЭлектронноеВзаимодействие.СервисДоставки
	НаборКонстант = Форма.НаборКонстант;
	Элементы = Форма.Элементы;
	Если РеквизитПутьКДанным = ""
		Или РеквизитПутьКДанным = "НаборКонстант.ИспользоватьУправлениеДоставкой" Тогда
	
		ИспользоватьСервисыДоставки = НаборКонстант.ИспользоватьСервис1СДоставка
										Или НаборКонстант.ИспользоватьСервис1СКурьер
										Или НаборКонстант.ИспользоватьСервис1ССДЭК;
		Элементы.ГруппаКомментарийИспользоватьУправлениеДоставкой.Видимость = ИспользоватьСервисыДоставки;
		Элементы.ИспользоватьУправлениеДоставкой.Доступность = Не ИспользоватьСервисыДоставки;
		
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.СервисДоставки
	
	//-- Локализация
	Возврат;
КонецПроцедуры

#КонецОбласти



#КонецОбласти

#Область Прочее

//++ Локализация

Процедура УстановитьВалютуРегламентированногоУчета()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВалютаРегламентированногоУчета.Получить()) Тогда
		
		Константы.ВалютаРегламентированногоУчета.Установить(ВалютаРегламентированногоУчетаПоУмолчанию());
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает значение валюты управленческого учета.
// Вызывается при первоначальном заполнении ИБ.
//
Процедура УстановитьВалютуУправленческогоУчета()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВалютаУправленческогоУчета.Получить())
		И Не Константы.ИспользоватьНесколькоВалют.Получить()Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 2
			|	Валюты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Валюты КАК Валюты
			|ГДЕ
			|	НЕ Валюты.ПометкаУдаления");
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				
				Константы.ВалютаУправленческогоУчета.Установить(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьИзмененияРегламентногоЗадания(ИдентификаторЗадания, НастройкиЗадания)
	
	РегламентноеЗадание = РегламентныеЗаданияСервер.Задание(ИдентификаторЗадания);
	
	Если РегламентноеЗадание <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(РегламентноеЗадание, НастройкиЗадания);
		
		РегламентноеЗадание.Записать();
	КонецЕсли;
	
КонецПроцедуры


//-- Локализация

#КонецОбласти

#КонецОбласти
