#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	СтатусДокументаВЭДО=Перечисления.СтатусыДокументаЭДО.НеВыгружен;
КонецПроцедуры
	
&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(СтатусДокументаВЭДО) Тогда
		СтатусДокументаВЭДО=Перечисления.СтатусыДокументаЭДО.НеВыгружен;
    КонецЕсли;	
КонецПроцедуры

#КонецЕсли
