
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") И Параметры.Номенклатура <> Неопределено Тогда
		Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	
	Если Параметры.Свойство("КомплектующийТовар") И Параметры.КомплектующийТовар <> Неопределено Тогда
		КомплектующийТовар = Параметры.КомплектующийТовар;
		ВидЗапроса = "Исправление";
	Иначе
		ВидЗапроса = "Добавление";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		АльтерраОбщегоНазначения.СообщитьПользователю( ,"Заполните поле 'Номенклатура'!");
		возврат;
	КонецЕсли;
	Если КомплектующийТовар = Справочники.Номенклатура.ПустаяСсылка() Тогда
		АльтерраОбщегоНазначения.СообщитьПользователю( ,"Заполните поле 'Комплектующий товар'!");
		возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Замечание) Тогда
		АльтерраОбщегоНазначения.СообщитьПользователю( ,"Заполните текст замечания!");
		возврат;
	КонецЕсли;
	
	ПараметрыСообщения = Новый Структура();
	ПараметрыСообщения.Вставить("Номенклатура", Номенклатура);
	ПараметрыСообщения.Вставить("КомплектующийТовар", КомплектующийТовар);
	ПараметрыСообщения.Вставить("ВидЗапроса", ВидЗапроса);
	ПараметрыСообщения.Вставить("Замечание", Замечание);
	ПараметрыСообщения.Вставить("АвторЗамечания", ПользователиКлиентСервер.ТекущийПользователь());
	ПараметрыСообщения.Вставить("ТекстСообщения", "Отредактируйте комплектующие номенклатуры - ");
	
	ДопМодуль.ОтправитьСообщениеОЗаменеКомплектующих(ПараметрыСообщения);
КонецПроцедуры
