
&ИзменениеИКонтроль("ТекстЗапросаПечати")
Функция Док_ТекстЗапросаПечати(Запрос, ИспользуетсяРеглУчет)

	ТекстЗапроса = Документы.АвансовыйОтчет.ТекстЗапросаДанныеАвансовыхОтчетов(Запрос, "СуммыАвансовыхОтчетов") +
	"
	|ВЫБРАТЬ // 9
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ДанныеШапки.Валюта КАК Валюта,
	|	СУММА(ДанныеШапки.СуммаВыданоНаличными) КАК СуммаВыданоНаличными,
	|	СУММА(ДанныеШапки.СуммаВыданоКартой) КАК СуммаВыданоКартой,
	|	СУММА(ДанныеШапки.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(ДанныеШапки.КонечныйПерерасход) КАК КонечныйПерерасход,
	#Удаление
	|	СУММА(ДанныеШапки.СуммаИзрасходовано + ДанныеШапки.СуммаВозвращено) КАК СуммаИзрасходовано,
	#КонецУдаления
	#Вставка
	|	СУММА(ДанныеШапки.СуммаИзрасходовано) КАК СуммаИзрасходовано,
	#КонецВставки
	|	СУММА(ДанныеШапки.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(ДанныеШапки.НачальныйПерерасход) КАК НачальныйПерерасход,
	|	СУММА(ДанныеШапки.СуммаВыданоНаличнымиРегл) КАК СуммаВыданоНаличнымиРегл,
	|	СУММА(ДанныеШапки.СуммаВыданоКартойРегл) КАК СуммаВыданоКартойРегл,
	|	СУММА(ДанныеШапки.КонечныйОстатокРегл) КАК КонечныйОстатокРегл,
	|	СУММА(ДанныеШапки.КонечныйПерерасходРегл) КАК КонечныйПерерасходРегл,
	#Удаление
	|	СУММА(ДанныеШапки.СуммаИзрасходованоРегл + ДанныеШапки.СуммаВозвращеноРегл) КАК СуммаИзрасходованоРегл,
	#КонецУдаления
	#Вставка
	|	СУММА(ДанныеШапки.СуммаИзрасходованоРегл) КАК СуммаИзрасходованоРегл,
	#КонецВставки
	|	СУММА(ДанныеШапки.НачальныйОстатокРегл) КАК НачальныйОстатокРегл,
	|	СУММА(ДанныеШапки.НачальныйПерерасходРегл) КАК НачальныйПерерасходРегл
	|ИЗ
	|	СуммыАвансовыхОтчетов КАК ДанныеШапки
	|ГДЕ
	|	(ДанныеШапки.ВалютаРегламентированногоУчета = ДанныеШапки.Валюта
	|				ИЛИ НЕ ДанныеШапки.СуммаВыданоНаличными = 0
	|				ИЛИ НЕ ДанныеШапки.СуммаВыданоКартой = 0
	|				ИЛИ НЕ ДанныеШапки.КонечныйОстаток = 0
	|				ИЛИ НЕ ДанныеШапки.КонечныйПерерасход = 0
	|				ИЛИ НЕ ДанныеШапки.СуммаИзрасходовано = 0
	|				ИЛИ НЕ ДанныеШапки.СуммаВозвращено = 0
	|				ИЛИ НЕ ДанныеШапки.НачальныйОстаток = 0
	|				ИЛИ НЕ ДанныеШапки.НачальныйПерерасход = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеШапки.Ссылка,
	|	ДанныеШапки.ВалютаРегламентированногоУчета,
	|	ДанныеШапки.Валюта
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ // 10
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Организация.Префикс КАК Префикс,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	#Вставка
	|	ДанныеДокумента.Автор КАК Автор,
	#КонецВставки
	|	ДанныеДокумента.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ЕСТЬNULL(ФИОПодотчетныхЛиц.ФамилияИмяОтчество,
	|			 ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ПодотчетноеЛицо)) КАК ПредставлениеПодотчетногоЛица,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.НаименованиеСокращенное КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.Организация.КодПоОКПО КАК ОрганизацияПоОКПО,
	|	ДанныеДокумента.НазначениеАванса КАК НазначениеАванса,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Подразделение) КАК ПредставлениеПодразделения,
	|	ДанныеДокумента.Подразделение.Код КАК КодПодразделения,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.Валюта) КАК ПредставлениеВалютыДокумента,
	|	ДанныеДокумента.Мультивалютный КАК Мультивалютный,
	|	ДанныеДокумента.КоличествоДокументов КАК КоличествоДокументов,
	|	ДанныеДокумента.КоличествоЛистов КАК КоличествоЛистов,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителяПредставление,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.АвансовыйОтчет КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|			ПО ДанныеДокумента.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИОПодотчетныхЛиц КАК ФИОПодотчетныхЛиц
	|			ПО ДанныеДокумента.ПодотчетноеЛицо = ФИОПодотчетныхЛиц.ФизическоеЛицо
	|			И ДанныеДокумента.Дата = ФИОПодотчетныхЛиц.Период
	|ГДЕ
	|	ДанныеДокумента.Ссылка В (&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ // 11
	|	ПрочиеРасходы.Ссылка                           КАК Ссылка,
	|	ПрочиеРасходы.Ссылка                           КАК ДокументДвижения,
	|	ПрочиеРасходы.Ссылка.Организация.ВалютаРегламентированногоУчета КАК ВалютаРеглУчета,
	|	ПрочиеРасходы.НаименованиеВходящегоДокумента   КАК НаименованиеРасхода,
	|	ПрочиеРасходы.НомерВходящегоДокумента          КАК ДокументНомер,
	|	ПрочиеРасходы.ДатаВходящегоДокумента           КАК ДокументДата,
	|	ПрочиеРасходы.СтатьяРасходов                   КАК СтатьяРасходов,
	|	ПрочиеРасходы.АналитикаРасходов                КАК АналитикаРасходов,
	|	ПрочиеРасходы.Контрагент                       КАК Контрагент,
	|	NULL                                           КАК КонтрагентОплаты,
	|	ВЫБОР КОГДА ПрочиеРасходы.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|		ПрочиеРасходы.Ссылка.Валюта
	|	ИНАЧЕ
	|		ПрочиеРасходы.Валюта
	|	КОНЕЦ КАК Валюта,
	|		НЕОПРЕДЕЛЕНО
	|	      КАК СчетУчета,
	|	ВЫБОР КОГДА НЕ ПрочиеРасходы.Отменено ТОГДА
	|		ВЫБОР КОГДА ПрочиеРасходы.Ссылка.Валюта = ПрочиеРасходы.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
	|			ЕСТЬNULL(ДвиженияПрочиеРасходы.СуммаРегл, ПрочиеРасходы.СуммаСНДС)
	|		ИНАЧЕ
	|			ЕСТЬNULL(ДвиженияПрочиеРасходы.СуммаРегл, ЕСТЬNULL(Суммы.СуммаНДСРегл, 0) + ЕСТЬNULL(Суммы.СуммаБезНДСРегл, 0))
	|		КОНЕЦ
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК ПоУчету,
	|	ВЫБОР КОГДА НЕ ПрочиеРасходы.Отменено ТОГДА
	|		ПрочиеРасходы.СуммаСНДС
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК ПоУчетуВВалюте,
	|
	|	ВЫБОР КОГДА ПрочиеРасходы.Ссылка.Валюта = ПрочиеРасходы.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
	|		ЕСТЬNULL(ДвиженияПрочиеРасходы.СуммаРегл, ПрочиеРасходы.СуммаСНДС)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДвиженияПрочиеРасходы.СуммаРегл, ЕСТЬNULL(Суммы.СуммаНДСРегл, 0) + ЕСТЬNULL(Суммы.СуммаБезНДСРегл, 0))
	|	КОНЕЦ КАК ПоОтчету,
	|	ПрочиеРасходы.СуммаСНДС КАК ПоОтчетуВВалюте,
	|
	|	ЕСТЬNULL(Суммы.СуммаНДСРегл, ПрочиеРасходы.СуммаНДС) КАК СуммаНДС,
	|	ПрочиеРасходы.ПервичныйДокумент КАК ПервичныйДокумент,
	|	1 КАК НомерРаздела,
	|	ПрочиеРасходы.ИдентификаторСтроки КАК НомерСтроки,
	|	ПрочиеРасходы.НомерСтроки КАК НомерСтрокиУпорядочивания
	|
	|ИЗ
	|	Документ.АвансовыйОтчет.ПрочиеРасходы КАК ПрочиеРасходы
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы КАК ДвиженияПрочиеРасходы
	|	ПО
	|		ДвиженияПрочиеРасходы.Регистратор = ПрочиеРасходы.Ссылка
	|		И ДвиженияПрочиеРасходы.СтатьяДоходовРасходов = ПрочиеРасходы.СтатьяРасходов
	|		И ДвиженияПрочиеРасходы.АналитикаРасходов = ПрочиеРасходы.АналитикаРасходов
	|		И ДвиженияПрочиеРасходы.АналитикаАктивовПассивов = ПрочиеРасходы.АналитикаАктивовПассивов
	|		И ДвиженияПрочиеРасходы.Подразделение = ПрочиеРасходы.Подразделение
	|		И ДвиженияПрочиеРасходы.СуммаВВалюте = ПрочиеРасходы.СуммаСНДС
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютахУчета КАК Суммы
	|	ПО
	|		Суммы.Регистратор = ПрочиеРасходы.Ссылка
	|		И Суммы.ИдентификаторСтроки = ПрочиеРасходы.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|
	|ГДЕ
	|	ПрочиеРасходы.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОплатаПоставщикам.Ссылка,
	|	ОплатаПоставщикам.Ссылка,
	|	ОплатаПоставщикам.Ссылка.Организация.ВалютаРегламентированногоУчета КАК ВалютаРеглУчета,
	|	ОплатаПоставщикам.НаименованиеВходящегоДокумента,
	|	ОплатаПоставщикам.НомерВходящегоДокумента,
	|	ОплатаПоставщикам.ДатаВходящегоДокумента,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ОплатаПоставщикам.Контрагент,
	|	ВЫБОР КОГДА ОплатаПоставщикам.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|		ОплатаПоставщикам.Ссылка.Валюта
	|	ИНАЧЕ
	|		ОплатаПоставщикам.Валюта
	|	КОНЕЦ КАК Валюта,
	|	НЕОПРЕДЕЛЕНО,

	|	ВЫБОР
	|		КОГДА ОплатаПоставщикам.ВалютаВзаиморасчетов = ОплатаПоставщикам.Ссылка.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ОплатаПоставщикам.СуммаВзаиморасчетов
	|		КОГДА ОплатаПоставщикам.Ссылка.Валюта = ОплатаПоставщикам.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
	|			ОплатаПоставщикам.Сумма
	|		ИНАЧЕ
	|			ЕСТЬNULL(Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл, ОплатаПоставщикам.Сумма)
	|	КОНЕЦ ПоУчету,
	|	ОплатаПоставщикам.Сумма КАК ПоУчетуВВалюте,
	|	ВЫБОР
	|		КОГДА ОплатаПоставщикам.ВалютаВзаиморасчетов = ОплатаПоставщикам.Ссылка.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ОплатаПоставщикам.СуммаВзаиморасчетов
	|		КОГДА ОплатаПоставщикам.Ссылка.Валюта = ОплатаПоставщикам.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
	|			ОплатаПоставщикам.Сумма
	|		ИНАЧЕ
	|			ЕСТЬNULL(Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл, ОплатаПоставщикам.Сумма)
	|	КОНЕЦ КАК ПоОтчету,
	|	ОплатаПоставщикам.Сумма КАК ПоОтчетуВВалюте,
	|	0 КАК СуммаНДС,
	|	НЕОПРЕДЕЛЕНО КАК ПервичныйДокумент,
	|	2 КАК НомерРаздела,
	|	ОплатаПоставщикам.НомерСтроки КАК НомерСтроки,
	|	ОплатаПоставщикам.НомерСтроки КАК НомерСтрокиУпорядочивания
	|
	|ИЗ
	|	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК ОплатаПоставщикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|			ПО Расчеты.ДокументРегистратор = ОплатаПоставщикам.Ссылка
	|				И Расчеты.ИдентификаторФинЗаписи = ОплатаПоставщикам.ИдентификаторСтроки
	|ГДЕ
	|	ОплатаПоставщикам.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументПриобретение.АвансовыйОтчет,
	|	ДокументПриобретение.Ссылка,
	|	ДокументПриобретение.Организация.ВалютаРегламентированногоУчета КАК ВалютаРеглУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.НаименованиеВходящегоДокумента = """" ТОГДА
	|			ДокументПриобретение.НаименованиеВходящегоДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.НаименованиеВходящегоДокумента
	|	КОНЕЦ КАК НаименованиеВходящегоДокумента,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.НомерВходящегоДокумента = """" ТОГДА
	|			ДокументПриобретение.НомерВходящегоДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.НомерВходящегоДокумента
	|	КОНЕЦ КАК НомерВходящегоДокумента,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1,1,1) ТОГДА
	|			ДокументПриобретение.ДатаВходящегоДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаВходящегоДокумента,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ДокументПриобретение.Валюта,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл,ДанныеДокумента.СуммаСНДС)) КАК ПоУчету,
	|	СУММА(ЕСТЬNULL(ДанныеДокумента.СуммаСНДС, 0)) КАК ПоУчетуВВалюте,
	|	СУММА(ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл,ДанныеДокумента.СуммаСНДС)) КАК ПоОтчету,
	|	СУММА(ЕСТЬNULL(ДанныеДокумента.СуммаСНДС, 0)) КАК ПоОтчетуВВалюте,
	|	0 КАК СуммаНДС,
	|	НЕОПРЕДЕЛЕНО КАК ПервичныйДокумент,
	|
	|	0 КАК НомерРаздела,
	|	МАКСИМУМ(ДанныеДокумента.ИдентификаторСтроки) КАК НомерСтроки,
	|	МАКСИМУМ(ДанныеДокумента.НомерСтроки) КАК НомерСтрокиУпорядочивания
	|
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ДокументПриобретение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Документ.ПриобретениеТоваровУслуг.Товары КАК ДанныеДокумента
	|		ПО
	|			ДокументПриобретение.Ссылка = ДанныеДокумента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.СуммыДокументовВВалютахУчета КАК Суммы
	|		ПО
	|			Суммы.Регистратор = ДанныеДокумента.Ссылка
	|			И Суммы.ИдентификаторСтроки = ДанныеДокумента.ИдентификаторСтроки
	|			И Суммы.СуммаБезНДСРегл <> 0
	|
	|ГДЕ
	|	ДокументПриобретение.АвансовыйОтчет В (&МассивДокументов)
	|	И ДокументПриобретение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
	|	И ДокументПриобретение.Проведен
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДокументПриобретение.Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.НаименованиеВходящегоДокумента = """" ТОГДА
	|			ДокументПриобретение.НаименованиеВходящегоДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.НаименованиеВходящегоДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.НомерВходящегоДокумента = """" ТОГДА
	|			ДокументПриобретение.НомерВходящегоДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.НомерВходящегоДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1,1,1) ТОГДА
	|			ДокументПриобретение.ДатаВходящегоДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.ДатаВходящегоДокумента
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.АвансовыйОтчет,
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Организация.ВалютаРегламентированногоУчета КАК ВалютаРеглУчета,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ТипУслуги),
	|	ДанныеДокумента.НомерБилета,
	|	ДанныеДокумента.Дата,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ДенежныеСредства.Валюта,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ДенежныеСредства.Сумма > 0
	|					ИЛИ ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ДенежныеСредства.Сумма < 0
	|					ТОГДА -ДенежныеСредства.СуммаРегл
	|				ИНАЧЕ ДенежныеСредства.СуммаРегл
	|			КОНЕЦ) КАК ПоУчету,
	|	СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ДенежныеСредства.Сумма > 0
	|					ИЛИ ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ДенежныеСредства.Сумма < 0
	|					ТОГДА -ДенежныеСредства.Сумма
	|				ИНАЧЕ ДенежныеСредства.Сумма
	|			КОНЕЦ) КАК ПоУчетуВВалюте,
	|	СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ДенежныеСредства.Сумма > 0
	|					ИЛИ ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ДенежныеСредства.Сумма < 0
	|					ТОГДА -ДенежныеСредства.СуммаРегл
	|				ИНАЧЕ ДенежныеСредства.СуммаРегл
	|			КОНЕЦ) КАК ПоОтчету,
	|	СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ДенежныеСредства.Сумма > 0
	|					ИЛИ ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ДенежныеСредства.Сумма < 0
	|					ТОГДА -ДенежныеСредства.Сумма
	|				ИНАЧЕ ДенежныеСредства.Сумма
	|			КОНЕЦ) КАК ПоОтчетуВВалюте,
	|	0 КАК СуммаНДС,
	|	НЕОПРЕДЕЛЕНО КАК ПервичныйДокумент,
	|	0 КАК НомерРаздела,
	|	ДанныеДокумента.Номер КАК НомерСтроки,
	|	ДанныеДокумента.Номер КАК НомерСтрокиУпорядочивания
	|ИЗ
	|	Документ.Бронирование КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет КАК ДанныеАвансовогоОтчета
	|	ПО ДанныеДокумента.АвансовыйОтчет = ДанныеАвансовогоОтчета.Ссылка	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц КАК ДенежныеСредства
	|	ПО ДенежныеСредства.Регистратор = ДанныеДокумента.Ссылка
	|	И ДанныеАвансовогоОтчета.ПодотчетноеЛицо = ДенежныеСредства.ПодотчетноеЛицо
	|ГДЕ
	|	ДанныеДокумента.АвансовыйОтчет В (&МассивДокументов)
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.АвансовыйОтчет,
	|	ДанныеДокумента.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ТипУслуги),
	|	ДанныеДокумента.НомерБилета,
	|	ДанныеДокумента.Дата,
	|	ДенежныеСредства.Валюта,
	|	ДанныеДокумента.Номер
	|
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерРаздела,
	|	НомерСтрокиУпорядочивания
	|
	|ИТОГИ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ // 12
	|	АвансовыйОтчетНаПечатьВТ3.Ссылка,
	|	АвансовыйОтчетНаПечатьВТ3.Организация,
	|	АвансовыйОтчетНаПечатьВТ3.ПодотчетноеЛицо,
	|	ТаблицаКонвертацияВалюты.Валюта КАК ВалютаИсходная,
	|	ТаблицаКонвертацияВалюты.Сумма КАК СуммаИсходная,
	|	ТаблицаКонвертацияВалюты.ВалютаКонвертации КАК ВалютаКонвертации,
	|	ТаблицаКонвертацияВалюты.СуммаКонвертации КАК СуммаКонвертации,
	|	ТаблицаКонвертацияВалюты.КурсКонвертации КАК Курс
	|ИЗ
	|	АвансовыйОтчетНаПечатьВТ3
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.АвансовыйОтчет.КонвертацияВалюты КАК ТаблицаКонвертацияВалюты
	|	ПО
	|		ТаблицаКонвертацияВалюты.Ссылка = АвансовыйОтчетНаПечатьВТ3.Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Если Не ИспользуетсяРеглУчет Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ //13
		|	ОплатаПоставщикам.Ссылка КАК Регистратор,
		|	ОплатаПоставщикам.Ссылка КАК ДокументДвижения,
		|	""60"" КАК СчетДт,
		|	ОплатаПоставщикам.Контрагент КАК ЗначениеСубконто,
		|	ВЫБОР КОГДА ОплатаПоставщикам.Ссылка.Валюта = ОплатаПоставщикам.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
		|		""71.01""
		|	ИНАЧЕ
		|		""71.21""
		|	КОНЕЦ КАК СчетКт,
		|	ОплатаПоставщикам.НомерСтроки КАК НомерСтроки,
		|	ОплатаПоставщикам.Сумма
		|
		|ИЗ
		|	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК ОплатаПоставщикам
		|ГДЕ
		|	ОплатаПоставщикам.Ссылка В (&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрочиеРасходы.Ссылка КАК Регистратор,
		|	ПрочиеРасходы.Ссылка КАК ДокументДвижения,
		|	ПрочиеРасходы.СтатьяРасходов.КорреспондирующийСчет,
		|	ПрочиеРасходы.СтатьяРасходов КАК ЗначениеСубконто,
		|	ВЫБОР КОГДА ПрочиеРасходы.Ссылка.Валюта = ПрочиеРасходы.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
		|		""71.01""
		|	ИНАЧЕ
		|		""71.21""
		|	КОНЕЦ КАК СчетКт,
		|	ПрочиеРасходы.НомерСтроки КАК НомерСтроки,

		|	ВЫБОР КОГДА НЕ ПрочиеРасходы.Отменено ТОГДА
		|		ВЫБОР КОГДА ПрочиеРасходы.Ссылка.Валюта = ПрочиеРасходы.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
		|			ЕСТЬNULL(ДвиженияПрочиеРасходы.СуммаРегл, ПрочиеРасходы.Сумма)
		|		ИНАЧЕ
		|			ЕСТЬNULL(ДвиженияПрочиеРасходы.СуммаРегл, ЕСТЬNULL(Суммы.СуммаНДСРегл, 0) + ЕСТЬNULL(Суммы.СуммаБезНДСРегл, 0))
		|		КОНЕЦ
		|	ИНАЧЕ
		|		0
		|	КОНЕЦ
		|
		|ИЗ
		|	Документ.АвансовыйОтчет.ПрочиеРасходы КАК ПрочиеРасходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы КАК ДвиженияПрочиеРасходы
		|		ПО
		|			ДвиженияПрочиеРасходы.Регистратор = ПрочиеРасходы.Ссылка
		|			И ДвиженияПрочиеРасходы.НомерСтроки = ПрочиеРасходы.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			РегистрСведений.СуммыДокументовВВалютахУчета КАК Суммы
		|		ПО
		|			Суммы.Регистратор = ПрочиеРасходы.Ссылка
		|			И Суммы.ИдентификаторСтроки = ПрочиеРасходы.ИдентификаторСтроки
		|			И Суммы.СуммаБезНДСРегл <> 0
		|ГДЕ
		|	ПрочиеРасходы.Ссылка В (&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПриобретениеТоваровУслуг.АвансовыйОтчет КАК Регистратор,
		|	ПриобретениеТоваровУслугТовары.Ссылка КАК ДокументДвижения,
		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) ТОГДА
		|		""41""
		|	ИНАЧЕ
		|		""91.02""
		|	КОНЕЦ КАК СчетДт,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Валюта = ПриобретениеТоваровУслугТовары.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
		|		""71.01""
		|	ИНАЧЕ
		|		""71.21""
		|	КОНЕЦ КАК СчетКт,
		|	1 КАК НомерСтроки,
		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС) ТОГДА
		|		СУММА(ПриобретениеТоваровУслугТовары.СуммаСНДС) - СУММА(ПриобретениеТоваровУслугТовары.СуммаНДС)
		|	ИНАЧЕ
		|		СУММА(ПриобретениеТоваровУслугТовары.СуммаСНДС)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|			ПО ПриобретениеТоваровУслуг.АвансовыйОтчет В (&МассивДокументов)
		|				И ПриобретениеТоваровУслуг.Ссылка = ПриобретениеТоваровУслугТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровУслуг.АвансовыйОтчет,
		|	ПриобретениеТоваровУслугТовары.Ссылка,
		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) ТОГДА
		|		""41""
		|	ИНАЧЕ
		|		""91.02""
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.АвансовыйОтчет КАК Регистратор,
		|	ПриобретениеТоваровУслугТовары.Ссылка КАК ДокументДвижения,
		|	""19"" КАК СчетДт,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Валюта = ПриобретениеТоваровУслугТовары.Ссылка.Организация.ВалютаРегламентированногоУчета ТОГДА
		|		""71.01""
		|	ИНАЧЕ
		|		""71.21""
		|	КОНЕЦ КАК СчетКт,
		|	2 КАК НомерСтроки,
		|	СУММА(ПриобретениеТоваровУслугТовары.СуммаНДС) КАК Сумма
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|			ПО ПриобретениеТоваровУслуг.АвансовыйОтчет В (&МассивДокументов)
		|				И ПриобретениеТоваровУслуг.Ссылка = ПриобретениеТоваровУслугТовары.Ссылка
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровУслуг.АвансовыйОтчет,
		|	ПриобретениеТоваровУслугТовары.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументДвижения,
		|	НомерСтроки
		|;
		|";
	Иначе
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции
&ИзменениеИКонтроль("ПриКопировании")
Процедура Док_ПриКопировании(Объект, ОбъектКопирования) Экспорт

	//++ Локализация
	Для каждого СтрокаТЧ Из Объект.ПрочиеРасходы Цикл
		СтрокаТЧ.ПредъявленСФ = Ложь;
		СтрокаТЧ.БланкСтрогойОтчетности = Ложь;
		СтрокаТЧ.НомерСФ = "";
		СтрокаТЧ.ДатаСФ = Неопределено;
		СтрокаТЧ.СчетФактура = Неопределено;
	КонецЦикла;
	//-- Локализация
	Возврат;

КонецПроцедуры
&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	
	МеханизмыДокумента.Добавить("РасходыПоОбъектам");
	
КонецПроцедуры

&После("ДополнитьТекстыЗапросовПроведения")
Процедура Док_ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры)
	ТекстЗапросаТаблицаРасходыПоОбъектам(Запрос, ТекстыЗапроса, Регистры);
КонецПроцедуры

Функция ТекстЗапросаТаблицаРасходыПоОбъектам(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РасходыПоОбъектам";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПрочиеРасходы", ТекстыЗапроса) Тогда
		Документы.АвансовыйОтчет.ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаТовары.Подразделение КАК Подразделение,
	|	ТаблицаТовары.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаТовары.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаТовары.ОбъектРасходов КАК ОбъектРасходов,
	|	ТаблицаТовары.АналитикаОбъекта КАК АналитикаОбъекта,
	|	МИНИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки,
	|	СУММА(ТаблицаТовары.СуммаСНДС) КАК Сумма
	|ИЗ
	|	Документ.АвансовыйОтчет.ПрочиеРасходы КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.ОбъектРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ ТаблицаТовары.АналитикаОбъекта = ЗНАЧЕНИЕ(Справочник.АналитикаОбъекта.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Подразделение,
	|	ТаблицаТовары.АналитикаРасходов,
	|	ТаблицаТовары.СтатьяРасходов,
	|	ТаблицаТовары.ОбъектРасходов,
	|	ТаблицаТовары.АналитикаОбъекта";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
	Возврат ТекстЗапроса;
	
КонецФункции

&ИзменениеИКонтроль("СформироватьПечатнуюФормуАвансовогоОтчета")
Функция Док_СформироватьПечатнуюФормуАвансовогоОтчета(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)

	ШаблонОшибки = НСтр("ru = 'Печать АО-1 используется только для документов с операцией ""Закупка через подотчетное лицо"".'");
	
	ИспользуетсяРеглУчет = ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АвансовыйОтчет";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
	СоздатьВТФИОПодотчетныхЛиц(МассивОбъектов, МенеджерВременныхТаблиц);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаПечати(Запрос, ИспользуетсяРеглУчет);
#Вставка
	Если Не ИспользуетсяРеглУчет Тогда
		Запрос.Текст = Запрос.Текст + ДопТекстЗапроса();
		Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	КонецЕсли;
#КонецВставки
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	РегистраторыДенежныеСредстваВыдано = ВводОстатковСервер.ДоступныеТипыВводаОстатков();
	РегистраторыДенежныеСредстваВыдано.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	Запрос.УстановитьПараметр("РегистраторыДенежныеСредстваВыдано", РегистраторыДенежныеСредстваВыдано);
	
	
	УстановитьПривилегированныйРежим(Истина);
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);            
	
	Выборка = МассивРезультатов[10].Выбрать();         
	ВыборкаПоказатели = МассивРезультатов[9].Выбрать();
	ВыборкаКонвертация = МассивРезультатов[12].Выбрать();
	ВыборкаОборотнаяСторона = МассивРезультатов[11].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ИспользуетсяРеглУчет Тогда
		ВыборкаПроводок = МассивРезультатов[15].Выбрать();
		ВыборкаСчетов = МассивРезультатов[16].Выбрать();
		ВыборкаСчетовУточнение = МассивРезультатов[16].Выбрать();
		Проводки = МассивРезультатов[15].Выгрузить();
	Иначе
		ВыборкаПроводок = МассивРезультатов[13].Выбрать();
		ВыборкаСчетов = МассивРезультатов[13].Выбрать();
		ВыборкаСчетовУточнение = МассивРезультатов[13].Выбрать();
		Проводки = МассивРезультатов[13].Выгрузить();
	КонецЕсли;
	
	Если МассивРезультатов[10].Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ШаблонОшибки);
	КонецЕсли;	 
	
	ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
		
		ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Выборка.Организация);
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьДвиженияПоНесколькимВалютам = МассивРезультатов[9].Выгрузить().НайтиСтроки(Новый Структура("Ссылка",Выборка.Ссылка)).Количество() > 1;
		ПечатьВИностраннойВалюте = Выборка.Мультивалютный Или ЕстьДвиженияПоНесколькимВалютам;
		Если ПечатьВИностраннойВалюте Тогда
			ИмяМакета = "Документ.АвансовыйОтчет.ПФ_MXL_АвансовыйОтчетВИностраннойВалюте_ru";
		Иначе
			ИмяМакета = "Документ.АвансовыйОтчет.ПФ_MXL_АвансовыйОтчет_ru";
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
		Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьТитул = Макет.ПолучитьОбласть("Титул");
		ОбластьТитулПодвал = Макет.ПолучитьОбласть("ТитулПодвал");
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьТитул, Выборка.Ссылка);
		
		ОбластьТитул.Параметры.Заполнить(Выборка);
		ОбластьТитул.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер);
		ОбластьТитул.Параметры.РуководительПредставление = Выборка.Руководитель;
		
		ОбластьТитулПодвал.Параметры.Заполнить(Выборка);
		ОбластьТитулПодвал.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер);
		ОбластьТитулПодвал.Параметры.ГлавныйБухгалтерПредставление = Выборка.ГлавныйБухгалтер;
		#Вставка
		ОбластьТитулПодвал.Параметры.Автор = Выборка.Автор;
		#КонецВставки
		
		СтруктураПоиска = Новый Структура("Ссылка", Выборка.Ссылка);
		
		Если Не ПечатьВИностраннойВалюте Тогда
			
			ПолученоИзКассы = 0; ПолученоПоБанковскимКартам = 0;
			ПолученоИзКассыВВалюте = ""; ПолученоПоБанковскимКартамВВалюте = "";
			НачальныйОстаток = 0; НачальныйПерерасход = 0;
			КонечныйОстаток = 0; КонечныйПерерасход = 0;
			Израсходовано = 0;
			
			Пока ВыборкаПоказатели.НайтиСледующий(СтруктураПоиска) Цикл
				
				Если ВыборкаПоказатели.Валюта <> ВалютаРегламентированногоУчета Тогда
					Если ВыборкаПоказатели.СуммаВыданоНаличными > 0 Тогда
						ПолученоИзКассыВВалюте = ПолученоИзКассыВВалюте
							+ " " + Строка(ВыборкаПоказатели.СуммаВыданоНаличными)
							+ " " + Строка(ВыборкаПоказатели.Валюта) + " ";
					КонецЕсли;
					Если ВыборкаПоказатели.СуммаВыданоКартой > 0 Тогда
						ПолученоПоБанковскимКартамВВалюте = ПолученоПоБанковскимКартамВВалюте
							+ " " + Строка(ВыборкаПоказатели.СуммаВыданоКартой)
							+ " " + Строка(ВыборкаПоказатели.Валюта) + " ";
					КонецЕсли;
				КонецЕсли;
				
				ПолученоИзКассы = ПолученоИзКассы + ВыборкаПоказатели.СуммаВыданоНаличнымиРегл;
				ПолученоПоБанковскимКартам = ПолученоПоБанковскимКартам + ВыборкаПоказатели.СуммаВыданоКартойРегл;
				
				НачальныйОстаток = НачальныйОстаток + ВыборкаПоказатели.НачальныйОстатокРегл;
				НачальныйПерерасход = НачальныйПерерасход + ВыборкаПоказатели.НачальныйПерерасходРегл;
				КонечныйОстаток = КонечныйОстаток + ВыборкаПоказатели.КонечныйОстатокРегл;
				КонечныйПерерасход = КонечныйПерерасход + ВыборкаПоказатели.КонечныйПерерасходРегл;
				Израсходовано = Израсходовано + ВыборкаПоказатели.СуммаИзрасходованоРегл;
			КонецЦикла;
			
			ВыборкаПоказатели.Сбросить();
			
			ВыводитьВалюту = Истина;
			Если НачальныйПерерасход > 0 И (ПолученоИзКассы > 0 Или ПолученоПоБанковскимКартам > 0) Тогда
				ВыводитьВалюту = Ложь;
			КонецЕсли;
			
			ОбластьТитул.Параметры.ПолученоИзКассы = ПолученоИзКассы;
			ОбластьТитул.Параметры.ПолученоПоБанковскимКартам = ПолученоПоБанковскимКартам;
			ОбластьТитул.Параметры.ИтогоПолучено = ПолученоИзКассы + ПолученоПоБанковскимКартам;
			Если ВыводитьВалюту Тогда
				ОбластьТитул.Параметры.ПолученоИзКассыВВалюте = ПолученоИзКассыВВалюте;
				ОбластьТитул.Параметры.ПолученоПоБанковскимКартамВВалюте = ПолученоПоБанковскимКартамВВалюте;
			КонецЕсли;
			#Удаление
			ОбластьТитул.Параметры.НачальныйОстаток = НачальныйОстаток;
			ОбластьТитул.Параметры.НачальныйПерерасход = НачальныйПерерасход;
			#КонецУдаления
			ОбластьТитул.Параметры.КонечныйОстаток = КонечныйОстаток;
			ОбластьТитул.Параметры.КонечныйПерерасход = КонечныйПерерасход;
			ОбластьТитул.Параметры.Израсходовано = Израсходовано;
			
			ОбластьТитулПодвал.Параметры.СуммаОтчетаПрописью =
				РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(Израсходовано, ВалютаРегламентированногоУчета, Ложь);
			
			ИспСумма = Окр(Израсходовано, 2, 1);
			ЦелСумма = Цел(Израсходовано);
			КопСумма = 100 * (Окр(ИспСумма - ЦелСумма, 2, 1));
			
			ОбластьТитул.Параметры.ИзрасходованоРуб = ЦелСумма;
			ОбластьТитул.Параметры.ИзрасходованоКоп = Формат(КопСумма,"ЧН=00");
			
			Счетчик = 0;
			Проводки.Свернуть("Регистратор, СчетДт, СчетКт", "Сумма");
			СтруктураПоиска = Новый Структура("Регистратор", Выборка.Ссылка);
			НайденныеПроводки = Проводки.НайтиСтроки(СтруктураПоиска);
			Для каждого Проводка Из НайденныеПроводки Цикл
				Счетчик = Счетчик + 1;
				Если Счетчик < 9 Тогда
					ОбластьТитул.Параметры["СубСчетДебет"  + Счетчик] = Проводка.СчетДт;
					ОбластьТитул.Параметры["СуммаДебет"    + Счетчик] = Проводка.Сумма;
					ОбластьТитул.Параметры["СубСчетКредит" + Счетчик] = Проводка.СчетКт;
					ОбластьТитул.Параметры["СуммаКредит"   + Счетчик] = Проводка.Сумма;
				Иначе
					Если Счетчик = 9 Тогда
						ТабличныйДокумент.Вывести(ОбластьТитул);
					КонецЕсли;
					ОбластьПроводок = Макет.ПолучитьОбласть("СтрокаПроводок");
					ОбластьПроводок.Параметры["СубСчетДебет" ] = Проводка.СчетДт;
					ОбластьПроводок.Параметры["СуммаДебет"   ] = Проводка.Сумма;
					ОбластьПроводок.Параметры["СубСчетКредит"] = Проводка.СчетКт;
					ОбластьПроводок.Параметры["СуммаКредит"  ] = Проводка.Сумма;
					ТабличныйДокумент.Вывести(ОбластьПроводок);
				КонецЕсли;
			КонецЦикла;
		
			Если Счетчик < 9 Тогда
				ТабличныйДокумент.Вывести(ОбластьТитул);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьТитулПодвал);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			// Оборотная сторона
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			
			ИтогоПоОтчету = 0;
			ИтогоПоОтчетуВВалюте = 0;
			ИтогоПоУчету = 0;
			ИтогоПоУчетуВВалюте = 0;
			
			НомерСтроки = 0;
			
			СтруктураПоиска = Новый Структура("Ссылка", Выборка.Ссылка);
			ВыборкаОборотнаяСторона.НайтиСледующий(СтруктураПоиска);
			
			ОбработанныеНомераСтрок = Новый Массив;
			ТекущийРаздел = 0;
			
			ВыборкаПоРасходам = ВыборкаОборотнаяСторона.Выбрать();
			Пока ВыборкаПоРасходам.Следующий() Цикл
				
				Если ТекущийРаздел <> ВыборкаПоРасходам.НомерРаздела Тогда
					ОбработанныеНомераСтрок.Очистить();
					ТекущийРаздел = ВыборкаПоРасходам.НомерРаздела;
				КонецЕсли;
				
				Если ОбработанныеНомераСтрок.Найти(ВыборкаПоРасходам.НомерСтроки) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ОбработанныеНомераСтрок.Добавить(ВыборкаПоРасходам.НомерСтроки);
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаПоРасходам);
				НомерСтроки = НомерСтроки + 1;
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				
				ИтогоПоОтчету = ИтогоПоОтчету + ВыборкаПоРасходам.ПоОтчету;
				ИтогоПоУчету = ИтогоПоУчету + ВыборкаПоРасходам.ПоУчету;
				Если ВыборкаПоРасходам.ВалютаРеглУчета <> ВыборкаПоРасходам.Валюта Тогда
					ИтогоПоОтчетуВВалюте = ИтогоПоОтчетуВВалюте + ВыборкаПоРасходам.ПоОтчетуВВалюте;
					ИтогоПоУчетуВВалюте = ИтогоПоУчетуВВалюте + ВыборкаПоРасходам.ПоУчетуВВалюте;
				Иначе
					ОбластьМакета.Параметры.ПоОтчетуВВалюте = 0;
					ОбластьМакета.Параметры.ПоУчетуВВалюте = 0;
				КонецЕсли;
				
				ОбластьМакета.Параметры.ДебетСубСчета = "";
				
				Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда // Оплата и прочие расходы
					
					МассивСчетов = Новый Массив;
					
					Если ЗначениеЗаполнено(ВыборкаПоРасходам.СчетУчета) Тогда
						
						МассивСчетов.Добавить(ВыборкаПоРасходам.СчетУчета);
					Иначе
						
						СтруктураПоиска = Новый Структура;
						СтруктураПоиска.Вставить("Регистратор",      Выборка.Ссылка);
						#Удаление
						СтруктураПоиска.Вставить("ДокументДвижения", ВыборкаПоРасходам.ДокументДвижения);
						#КонецУдаления
						Если ИспользуетсяРеглУчет Тогда 
							СтруктураПоиска.Вставить("ЗначениеСубконто", ВыборкаПоРасходам.СтатьяРасходов);
						КонецЕсли;
						
						ВыборкаСчетов.Сбросить();
					
						Пока ВыборкаСчетов.НайтиСледующий(СтруктураПоиска) Цикл
							МассивСчетов.Добавить(ВыборкаСчетов.СчетДт);
						КонецЦикла;
						
						СтруктураПоиска.Вставить("ЗначениеСубконто", ВыборкаПоРасходам.АналитикаРасходов);
						
						ВыборкаСчетов.Сбросить();
						Пока ВыборкаСчетов.НайтиСледующий(СтруктураПоиска) Цикл
							МассивСчетов.Добавить(ВыборкаСчетов.СчетДт);
						КонецЦикла;
						
						// НДС
						Если ВыборкаПоРасходам.НомерРаздела = 1 И ВыборкаПоРасходам.СуммаНДС <> 0 Тогда
							
							СтруктураПоиска = Новый Структура;
							СтруктураПоиска.Вставить("Регистратор",      Выборка.Ссылка);
							СтруктураПоиска.Вставить("ДокументДвижения", ВыборкаПоРасходам.ДокументДвижения);
							СтруктураПоиска.Вставить("ЗначениеСубконто",
								?(ЗначениеЗаполнено(ВыборкаПоРасходам.Контрагент), ВыборкаПоРасходам.Контрагент, Неопределено));
							
							ВыборкаСчетов.Сбросить();
							Пока ВыборкаСчетов.НайтиСледующий(СтруктураПоиска) Цикл
								
								СтруктураПоискаУточнение = Новый Структура;
								СтруктураПоискаУточнение.Вставить("СчетДт",           ВыборкаСчетов.СчетДт);
								СтруктураПоискаУточнение.Вставить("Регистратор",      Выборка.Ссылка);
								Если ЗначениеЗаполнено(ВыборкаПоРасходам.ПервичныйДокумент) Тогда
									СтруктураПоискаУточнение.Вставить("ЗначениеСубконто", ВыборкаПоРасходам.ПервичныйДокумент);
								Иначе
									СтруктураПоискаУточнение.Вставить("ЗначениеСубконто", ВыборкаПоРасходам.Ссылка);
								КонецЕсли;
								
								ВыборкаСчетовУточнение.Сбросить();
								Пока ВыборкаСчетовУточнение.НайтиСледующий(СтруктураПоискаУточнение) Цикл
									МассивСчетов.Добавить(ВыборкаСчетов.СчетДт);
								КонецЦикла;
							КонецЦикла;
						КонецЕсли;
						
						// Оплата
						Если ВыборкаПоРасходам.НомерРаздела = 2 Тогда
							
							СтруктураПоиска = Новый Структура;
							СтруктураПоиска.Вставить("Регистратор",      Выборка.Ссылка);
							СтруктураПоиска.Вставить("ЗначениеСубконто", ВыборкаПоРасходам.КонтрагентОплаты);
							
							ВыборкаСчетов.Сбросить();
							Пока ВыборкаСчетов.НайтиСледующий(СтруктураПоиска) Цикл
								
								СтруктураПоискаУточнение = Новый Структура;
								СтруктураПоискаУточнение.Вставить("СчетДт",           ВыборкаСчетов.СчетДт);
								СтруктураПоискаУточнение.Вставить("Регистратор",      Выборка.Ссылка);
								СтруктураПоискаУточнение.Вставить("ЗначениеСубконто", Выборка.Ссылка);
								
								ВыборкаСчетовУточнение.Сбросить();
								Если Не ВыборкаСчетовУточнение.НайтиСледующий(СтруктураПоискаУточнение) Тогда
									МассивСчетов.Добавить(ВыборкаСчетов.СчетДт);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(МассивСчетов);
				Для каждого СчетДт Из МассивСчетов Цикл
					ОбластьМакета.Параметры.ДебетСубСчета = ОбластьМакета.Параметры.ДебетСубСчета
						+ ?(ПустаяСтрока(ОбластьМакета.Параметры.ДебетСубСчета), "", ", ")
						+ СчетДт;
				КонецЦикла;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			// Подвал авансового отчета
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.ИтогоПоОтчету                 = ИтогоПоОтчету;
			ОбластьМакета.Параметры.ИтогоПоОтчетувВалюте          = ИтогоПоОтчетуВВалюте;
			ОбластьМакета.Параметры.ИтогоПоУчету                  = ИтогоПоУчету;
			ОбластьМакета.Параметры.ИтогоПоУчетувВалюте           = ИтогоПоУчетуВВалюте;
			ОбластьМакета.Параметры.ПредставлениеПодотчетногоЛица = Выборка.ПредставлениеПодотчетногоЛица;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ВыборкаОборотнаяСторона.Сбросить();
			
		Иначе // Валютный отчет
			
			ТабличныйДокумент.Вывести(ОбластьТитул);
			
			Область = Макет.ПолучитьОбласть("Титул1|Показатели");
			ТабличныйДокумент.Вывести(Область);
			ЕстьСтрокаКонвертации = ВыборкаКонвертация.НайтиСледующий(СтруктураПоиска);
			Если ЕстьСтрокаКонвертации Тогда
				Область = Макет.ПолучитьОбласть("Титул1|Конвертация");
				ТабличныйДокумент.Присоединить(Область);
			КонецЕсли;
			
			Пока ВыборкаПоказатели.НайтиСледующий(СтруктураПоиска) Цикл
				Если ВыборкаПоказатели.НачальныйОстаток <> 0 Тогда
					Область = Макет.ПолучитьОбласть("СтрокаТитул|Показатели");
					Область.Параметры.Валюта = ВыборкаПоказатели.Валюта;
					Область.Параметры.Сумма = ВыборкаПоказатели.НачальныйОстаток;
					ТабличныйДокумент.Вывести(Область);
					
					Если ЕстьСтрокаКонвертации Тогда
						ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ВыборкаПоказатели.Сбросить();
			
			Область = Макет.ПолучитьОбласть("Титул2|Показатели");
			ТабличныйДокумент.Вывести(Область);
			Если ЕстьСтрокаКонвертации Тогда
				ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
			КонецЕсли;
			
			Пока ВыборкаПоказатели.НайтиСледующий(СтруктураПоиска) Цикл
				Если ВыборкаПоказатели.НачальныйПерерасход <> 0 Тогда
					Область = Макет.ПолучитьОбласть("СтрокаТитул|Показатели");
					Область.Параметры.Валюта = ВыборкаПоказатели.Валюта;
					Область.Параметры.Сумма = ВыборкаПоказатели.НачальныйПерерасход;
					ТабличныйДокумент.Вывести(Область);
					
					Если ЕстьСтрокаКонвертации Тогда
						ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ВыборкаПоказатели.Сбросить();
			
			Область = Макет.ПолучитьОбласть("Титул3|Показатели");
			ТабличныйДокумент.Вывести(Область);
			Если ЕстьСтрокаКонвертации Тогда
				ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
			КонецЕсли;
			
			Пока ВыборкаПоказатели.НайтиСледующий(СтруктураПоиска) Цикл
				Если ВыборкаПоказатели.СуммаВыданоНаличными <> 0 Тогда
					Область = Макет.ПолучитьОбласть("СтрокаТитул|Показатели");
					Область.Параметры.Валюта = ВыборкаПоказатели.Валюта;
					Область.Параметры.Сумма = ВыборкаПоказатели.СуммаВыданоНаличными;
					ТабличныйДокумент.Вывести(Область);
					
					Если ЕстьСтрокаКонвертации Тогда
						ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ВыборкаПоказатели.Сбросить();
			
			Область = Макет.ПолучитьОбласть("Титул4|Показатели");
			ТабличныйДокумент.Вывести(Область);
			Если ЕстьСтрокаКонвертации Тогда
				ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
			КонецЕсли;
			
			Пока ВыборкаПоказатели.НайтиСледующий(СтруктураПоиска) Цикл
				Если ВыборкаПоказатели.СуммаВыданоКартой <> 0 Тогда
					Область = Макет.ПолучитьОбласть("СтрокаТитул|Показатели");
					Область.Параметры.Валюта = ВыборкаПоказатели.Валюта;
					Область.Параметры.Сумма = ВыборкаПоказатели.СуммаВыданоКартой;
					ТабличныйДокумент.Вывести(Область);
					
					Если ЕстьСтрокаКонвертации Тогда
						ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ВыборкаПоказатели.Сбросить();
			
			Область = Макет.ПолучитьОбласть("Титул5|Показатели");
			ТабличныйДокумент.Вывести(Область);
			Если ЕстьСтрокаКонвертации Тогда
				ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
			КонецЕсли;
			
			Пока ВыборкаПоказатели.НайтиСледующий(СтруктураПоиска) Цикл
				Если ВыборкаПоказатели.СуммаИзрасходовано <> 0 Тогда
					Область = Макет.ПолучитьОбласть("СтрокаТитул|Показатели");
					Область.Параметры.Валюта = ВыборкаПоказатели.Валюта;
					Область.Параметры.Сумма = ВыборкаПоказатели.СуммаИзрасходовано;
					ТабличныйДокумент.Вывести(Область);
					
					Если ЕстьСтрокаКонвертации Тогда
						ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ВыборкаПоказатели.Сбросить();
			
			Область = Макет.ПолучитьОбласть("Титул6|Показатели");
			ТабличныйДокумент.Вывести(Область);
			Если ЕстьСтрокаКонвертации Тогда
				ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
			КонецЕсли;
			
			Пока ВыборкаПоказатели.НайтиСледующий(СтруктураПоиска) Цикл
				Если ВыборкаПоказатели.КонечныйОстаток <> 0 Тогда
					Область = Макет.ПолучитьОбласть("СтрокаТитул|Показатели");
					Область.Параметры.Валюта = ВыборкаПоказатели.Валюта;
					Область.Параметры.Сумма = ВыборкаПоказатели.КонечныйОстаток;
					ТабличныйДокумент.Вывести(Область);
					
					Если ЕстьСтрокаКонвертации Тогда
						ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ВыборкаПоказатели.Сбросить();
			
			Область = Макет.ПолучитьОбласть("Титул7|Показатели");
			ТабличныйДокумент.Вывести(Область);
			Пока ЕстьСтрокаКонвертации Цикл
				ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
			КонецЦикла;
			
			Пока ВыборкаПоказатели.НайтиСледующий(СтруктураПоиска) Цикл
				Если ВыборкаПоказатели.КонечныйПерерасход <> 0 Тогда
					Область = Макет.ПолучитьОбласть("СтрокаТитул|Показатели");
					Область.Параметры.Валюта = ВыборкаПоказатели.Валюта;
					Область.Параметры.Сумма = ВыборкаПоказатели.КонечныйПерерасход;
					ТабличныйДокумент.Вывести(Область);
					
					Если ЕстьСтрокаКонвертации Тогда
						ЕстьСтрокаКонвертации = ВывестиСтрокуКонвертации(Макет, ТабличныйДокумент, ВыборкаКонвертация, СтруктураПоиска);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ВыборкаПоказатели.Сбросить();
			
			ТабличныйДокумент.Вывести(ОбластьТитулПодвал);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			// Оборотная сторона
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			
			НомерСтроки = 0;
			
			СтруктураПоиска = Новый Структура("Ссылка", Выборка.Ссылка);
			ВыборкаОборотнаяСторона.НайтиСледующий(СтруктураПоиска);
			
			ОбработанныеНомераСтрок = Новый Массив;
			ТекущийРаздел = 0;
			
			ВыборкаПоРасходам = ВыборкаОборотнаяСторона.Выбрать();
			Пока ВыборкаПоРасходам.Следующий() Цикл
				
				Если ТекущийРаздел <> ВыборкаПоРасходам.НомерРаздела Тогда
					ОбработанныеНомераСтрок.Очистить();
					ТекущийРаздел = ВыборкаПоРасходам.НомерРаздела;
				КонецЕсли;
				
				Если ОбработанныеНомераСтрок.Найти(ВыборкаПоРасходам.НомерСтроки) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ОбработанныеНомераСтрок.Добавить(ВыборкаПоРасходам.НомерСтроки);
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаПоРасходам);
				НомерСтроки = НомерСтроки + 1;
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			// Подвал авансового отчета
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ВыборкаОборотнаяСторона.Сбросить();
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент,
			НомерСтрокиНачало,
			ОбъектыПечати,
			Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДопТекстЗапроса()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ // 16
	|	ОплатаПоставщикам.Ссылка КАК Регистратор,
	|	""60"" КАК СчетДт,
	|	ОплатаПоставщикам.Контрагент КАК ЗначениеСубконто,
	|	ВЫБОР КОГДА ОплатаПоставщикам.Ссылка.Валюта = &ВалютаРегламентированногоУчета ТОГДА
	|		""71.01""
	|	ИНАЧЕ
	|		""71.21""
	|	КОНЕЦ КАК СчетКт,
	|	ОплатаПоставщикам.НомерСтроки КАК НомерСтроки,
	|	ОплатаПоставщикам.Сумма
	|	
	|ИЗ
	|	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК ОплатаПоставщикам
	|ГДЕ
	|	ОплатаПоставщикам.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Ссылка КАК Регистратор,
	|	ПрочиеРасходы.СтатьяРасходов.КорреспондирующийСчет,
	|	ПрочиеРасходы.СтатьяРасходов КАК ЗначениеСубконто,
	|	ВЫБОР КОГДА ПрочиеРасходы.Ссылка.Валюта = &ВалютаРегламентированногоУчета ТОГДА
	|		""71.01""
	|	ИНАЧЕ
	|		""71.21""
	|	КОНЕЦ КАК СчетКт,
	|	ПрочиеРасходы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР КОГДА НЕ ПрочиеРасходы.Отменено ТОГДА
	|		ВЫБОР КОГДА ПрочиеРасходы.Ссылка.Валюта = &ВалютаРегламентированногоУчета ТОГДА
	|			ЕСТЬNULL(ДвиженияПрочиеРасходы.СуммаРегл, ПрочиеРасходы.Сумма)
	|		ИНАЧЕ
	|			ЕСТЬNULL(ДвиженияПрочиеРасходы.СуммаРегл, ЕСТЬNULL(Суммы.СуммаНДСРегл, 0) + ЕСТЬNULL(Суммы.СуммаБезНДСРегл, 0))
	|		КОНЕЦ
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ
	|	
	|ИЗ
	|	Документ.АвансовыйОтчет.ПрочиеРасходы КАК ПрочиеРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы КАК ДвиженияПрочиеРасходы
	|		ПО
	|			ДвиженияПрочиеРасходы.Регистратор = ПрочиеРасходы.Ссылка
	|			И ДвиженияПрочиеРасходы.НомерСтроки = ПрочиеРасходы.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.СуммыДокументовВВалютахУчета КАК Суммы
	|		ПО
	|			Суммы.Регистратор = ПрочиеРасходы.Ссылка
	|			И Суммы.ИдентификаторСтроки = ПрочиеРасходы.ИдентификаторСтроки
	|			И Суммы.СуммаБезНДСРегл <> 0
	|ГДЕ
	|	ПрочиеРасходы.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка.АвансовыйОтчет КАК Регистратор,
	|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) ТОГДА
	|		""41""
	|	ИНАЧЕ
	|		""91.02""
	|	КОНЕЦ КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Валюта = &ВалютаРегламентированногоУчета ТОГДА
	|		""71.01""
	|	ИНАЧЕ
	|		""71.21""
	|	КОНЕЦ КАК СчетКт,
	|	1 КАК НомерСтроки,
	|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС) ТОГДА
	|		СУММА(ПриобретениеТоваровУслугТовары.СуммаСНДС) - СУММА(ПриобретениеТоваровУслугТовары.СуммаНДС)
	|	ИНАЧЕ
	|		СУММА(ПриобретениеТоваровУслугТовары.СуммаСНДС)
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка.АвансовыйОтчет В (&МассивДокументов)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Ссылка,
	|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) ТОГДА
	|		""41""
	|	ИНАЧЕ
	|		""91.02""
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка.АвансовыйОтчет КАК Регистратор,
	|	""19"" КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Валюта = &ВалютаРегламентированногоУчета ТОГДА
	|		""71.01""
	|	ИНАЧЕ
	|		""71.21""
	|	КОНЕЦ КАК СчетКт,
	|	2 КАК НомерСтроки,
	|	СУММА(ПриобретениеТоваровУслугТовары.СуммаНДС) КАК Сумма
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка.АвансовыйОтчет В (&МассивДокументов)
	|	И ПриобретениеТоваровУслугТовары.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|;
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции
