
&ИзменениеИКонтроль("СформироватьТаблицуПараметровДляОперацииФН")
Функция Док_СформироватьТаблицуПараметровДляОперацииФН(СтруктураПараметров, РевизияИнтерфейса)
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ParametersFiscal");
		ЗаписьXML.ЗаписатьАтрибут("CashierName" , XMLСтрока(?(СтруктураПараметров.Свойство("Кассир")   , XMLСтрока(СтруктураПараметров.Кассир), НСтр("ru='Администратор'"))));
		ЗаписьXML.ЗаписатьАтрибут("CashierINN"  , XMLСтрока(?(СтруктураПараметров.Свойство("КассирИНН"), XMLСтрока(СтруктураПараметров.КассирИНН), "")));
		Если РевизияИнтерфейса >= 3004 Тогда           
			// Коды причин изменения сведений о ККТ.
			Если Не ПустаяСтрока(СтруктураПараметров.КодыПричинИзмененияСведений) Тогда
				ЗаписьXML.ЗаписатьАтрибут("RegistrationLabelCodes", XMLСтрока(СтруктураПараметров.КодыПричинИзмененияСведений));
			КонецЕсли;
		Иначе
			// Код причины перерегистрации.
			ЗаписьXML.ЗаписатьАтрибут("RegistrationReasonCode", XMLСтрока(СтруктураПараметров.КодПричиныПеререгистрации));
		КонецЕсли;                 
		ЗаписьXML.ЗаписатьАтрибут("KKTNumber"         , XMLСтрока(СтруктураПараметров.РегистрационныйНомерККТ));
		ЗаписьXML.ЗаписатьАтрибут("CompanyName"       , XMLСтрока(СтруктураПараметров.ОрганизацияНазвание));
		ЗаписьXML.ЗаписатьАтрибут("INN"               , XMLСтрока(СтруктураПараметров.ОрганизацияИНН));
		ЗаписьXML.ЗаписатьАтрибут("SaleAddress"       , XMLСтрока(СтруктураПараметров.АдресПроведенияРасчетов));
		ЗаписьXML.ЗаписатьАтрибут("SaleLocation"      , XMLСтрока(СтруктураПараметров.МестоПроведенияРасчетов));
		ЗаписьXML.ЗаписатьАтрибут("TaxationSystems"   , XMLСтрока(СтруктураПараметров.КодыСистемыНалогообложения));
		ЗаписьXML.ЗаписатьАтрибут("IsOffline"         , XMLСтрока(СтруктураПараметров.ПризнакАвтономногоРежима));
		ЗаписьXML.ЗаписатьАтрибут("IsEncrypted"       , XMLСтрока(СтруктураПараметров.ПризнакШифрованиеДанных));
		ЗаписьXML.ЗаписатьАтрибут("IsService"         , XMLСтрока(СтруктураПараметров.ПризнакРасчетовЗаУслуги));
		ЗаписьXML.ЗаписатьАтрибут("IsExcisable"       , XMLСтрока(СтруктураПараметров.ПродажаПодакцизногоТовара));
		ЗаписьXML.ЗаписатьАтрибут("IsGambling"        , XMLСтрока(СтруктураПараметров.ПроведенияАзартныхИгр));
		ЗаписьXML.ЗаписатьАтрибут("IsLottery"         , XMLСтрока(СтруктураПараметров.ПроведенияЛотерей));
		ЗаписьXML.ЗаписатьАтрибут("AgentTypes"        , XMLСтрока(СтруктураПараметров.ПризнакиАгента));
		ЗаписьXML.ЗаписатьАтрибут("BSOSing"           , XMLСтрока(СтруктураПараметров.ПризнакФормированияБСО));
		ЗаписьXML.ЗаписатьАтрибут("IsOnlineOnly"      , XMLСтрока(СтруктураПараметров.ПризнакРасчетовТолькоВИнтернет));
		Если РевизияИнтерфейса >= 3004 Тогда  // Версия стандарта 3.4 (ОФД 1.2)
			ЗаписьXML.ЗаписатьАтрибут("IsOnline"    , XMLСтрока(СтруктураПараметров.ПроведенияРасчетаВИнтернет));
			ЗаписьXML.ЗаписатьАтрибут("IsMarking"   , XMLСтрока(СтруктураПараметров.ПродажаМаркированныхТоваров));
			ЗаписьXML.ЗаписатьАтрибут("IsPawnshop"  , XMLСтрока(СтруктураПараметров.ПризнакПримененияЛомбардами));
			ЗаписьXML.ЗаписатьАтрибут("IsAssurance" , XMLСтрока(СтруктураПараметров.ПризнакДеятельностиПоСтрахованию));
		КонецЕсли;
		Если РевизияИнтерфейса >= 4000 Тогда  // Версия стандарта 4.0 (ОФД 1.2)
			ЗаписьXML.ЗаписатьАтрибут("IsVendingMachine"  , XMLСтрока(СтруктураПараметров.ПризнакАвтоматическогоТорговогоАвтомата));
			ЗаписьXML.ЗаписатьАтрибут("IsCateringServices", XMLСтрока(СтруктураПараметров.ПризнакОказанииУслугОбщественногоПитания));
			ЗаписьXML.ЗаписатьАтрибут("IsWholesaleTrade"  , XMLСтрока(СтруктураПараметров.ПризнакОптовойТорговлиСОрганизациями));
		КонецЕсли;    
		ЗаписьXML.ЗаписатьАтрибут("IsAutomaticPrinter", XMLСтрока(СтруктураПараметров.УстановкаПринтераВАвтомате));
		ЗаписьXML.ЗаписатьАтрибут("IsAutomatic"       , XMLСтрока(СтруктураПараметров.ПризнакАвтоматическогоРежима));
		ЗаписьXML.ЗаписатьАтрибут("AutomaticNumber"   , XMLСтрока(СтруктураПараметров.НомерАвтоматаДляАвтоматическогоРежима));
		ЗаписьXML.ЗаписатьАтрибут("OFDCompany"        , XMLСтрока(СтруктураПараметров.ОрганизацияОФДНазвание));
		ЗаписьXML.ЗаписатьАтрибут("OFDCompanyINN"     , XMLСтрока(СтруктураПараметров.ОрганизацияОФДИНН));
		Если Не ПустаяСтрока(СтруктураПараметров.ОтправительEmail) Тогда
			#Удаление
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(СтруктураПараметров.ОтправительEmail));
			#КонецУдаления
			#Вставка
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока("noreply@taxcom.ru"));  
			#КонецВставки
		КонецЕсли;
		Если Не ПустаяСтрока(СтруктураПараметров.АдресСайтаФНС) Тогда
			ЗаписьXML.ЗаписатьАтрибут("FNSURL", XMLСтрока(СтруктураПараметров.АдресСайтаФНС));
		КонецЕсли;
	
	Иначе
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
		ЗаписьXML.ЗаписатьАтрибут("CashierName" , XMLСтрока(?(СтруктураПараметров.Свойство("Кассир")   , XMLСтрока(СтруктураПараметров.Кассир), НСтр("ru='Администратор'"))));
		ЗаписьXML.ЗаписатьАтрибут("CashierVATIN", XMLСтрока(?(СтруктураПараметров.Свойство("КассирИНН"), XMLСтрока(СтруктураПараметров.КассирИНН), "")));
		// ФФД 1.0.0
		ЗаписьXML.ЗаписатьАтрибут("KKTNumber"          , XMLСтрока(СтруктураПараметров.РегистрационныйНомерККТ));
		ЗаписьXML.ЗаписатьАтрибут("OFDVATIN"           , XMLСтрока(СтруктураПараметров.ОрганизацияОФДИНН));
		ЗаписьXML.ЗаписатьАтрибут("OFDOrganizationName", XMLСтрока(СтруктураПараметров.ОрганизацияОФДНазвание));
		ЗаписьXML.ЗаписатьАтрибут("OrganizationName"   , XMLСтрока(СтруктураПараметров.ОрганизацияНазвание));
		ЗаписьXML.ЗаписатьАтрибут("VATIN"              , XMLСтрока(СтруктураПараметров.ОрганизацияИНН));
		ЗаписьXML.ЗаписатьАтрибут("AddressSettle"      , XMLСтрока(СтруктураПараметров.АдресПроведенияРасчетов));
		ЗаписьXML.ЗаписатьАтрибут("TaxVariant"         , XMLСтрока(СтруктураПараметров.КодыСистемыНалогообложения));
		ЗаписьXML.ЗаписатьАтрибут("OfflineMode"        , XMLСтрока(СтруктураПараметров.ПризнакАвтономногоРежима));
		ЗаписьXML.ЗаписатьАтрибут("DataEncryption"     , XMLСтрока(СтруктураПараметров.ПризнакШифрованиеДанных));
		ЗаписьXML.ЗаписатьАтрибут("ServiceSign"        , XMLСтрока(СтруктураПараметров.ПризнакРасчетовЗаУслуги));
		ЗаписьXML.ЗаписатьАтрибут("BSOSing"            , XMLСтрока(СтруктураПараметров.ПризнакФормированияБСО));
		ЗаписьXML.ЗаписатьАтрибут("CalcOnlineSign"     , XMLСтрока(СтруктураПараметров.ПризнакРасчетовТолькоВИнтернет));
		ЗаписьXML.ЗаписатьАтрибут("AutomaticMode"      , XMLСтрока(СтруктураПараметров.ПризнакАвтоматическогоРежима));
		ЗаписьXML.ЗаписатьАтрибут("AutomaticNumber"    , XMLСтрока(СтруктураПараметров.НомерАвтоматаДляАвтоматическогоРежима));
		// ФФД 1.05 & 1.1
		ЗаписьXML.ЗаписатьАтрибут("PlaceSettle"        , XMLСтрока(СтруктураПараметров.МестоПроведенияРасчетов));
		ЗаписьXML.ЗаписатьАтрибут("SaleExcisableGoods" , XMLСтрока(СтруктураПараметров.ПродажаПодакцизногоТовара));
		ЗаписьXML.ЗаписатьАтрибут("SignOfGambling"     , XMLСтрока(СтруктураПараметров.ПроведенияАзартныхИгр));
		ЗаписьXML.ЗаписатьАтрибут("SignOfLottery"      , XMLСтрока(СтруктураПараметров.ПроведенияЛотерей));
		ЗаписьXML.ЗаписатьАтрибут("SignOfAgent"        , XMLСтрока(СтруктураПараметров.ПризнакиАгента));
		ЗаписьXML.ЗаписатьАтрибут("PrinterAutomatic"   , XMLСтрока(СтруктураПараметров.УстановкаПринтераВАвтомате));
		// Изменение параметров регистрации.
		ЗаписьXML.ЗаписатьАтрибут("ReasonCode"         , XMLСтрока(СтруктураПараметров.КодПричиныПеререгистрации));
		Если Не ПустаяСтрока(СтруктураПараметров.КодыПричинИзмененияСведений) Тогда
			ЗаписьXML.ЗаписатьАтрибут("InfoChangesReasonsCodes", XMLСтрока(СтруктураПараметров.КодыПричинИзмененияСведений));
		КонецЕсли;
		Если Не ПустаяСтрока(СтруктураПараметров.ОтправительEmail) Тогда
			#Удаление
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(СтруктураПараметров.ОтправительEmail));
			#КонецУдаления
			#Вставка 
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока("noreply@taxcom.ru"));  
			#КонецВставки
		КонецЕсли;
		Если Не ПустаяСтрока(СтруктураПараметров.АдресСайтаФНС) Тогда
			ЗаписьXML.ЗаписатьАтрибут("FNSWebSite", XMLСтрока(СтруктураПараметров.АдресСайтаФНС));
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

&ИзменениеИКонтроль("СформироватьXMLПакетДляФискализацияЧека")
Процедура Док_СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации, ВключатьПерсональныеДанные = Ложь,
	ПерсональныеДанные = Неопределено, ТипПерсональныхДанных = Неопределено) Экспорт
	
	// ++ Локализация
	ПозицииЧека  = ОбщиеПараметры.ПозицииЧека;
	ТаблицаОплат = ОбщиеПараметры.ТаблицаОплат;
	Электронно   = ОбщиеПараметры.Электронно;

	ТипРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодРасчетаДенежнымиСредствами(ОбщиеПараметры.ТипРасчета);
	СистемаНалогообложения = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодСистемыНалогообложенияККТ(ОбщиеПараметры.СистемаНалогообложения);
	
	// Таблица оплат
	СуммаЧека = 0;
	СуммаНаличные       = 0;
	СуммаЭлектронно     = 0;
	СуммаПредоплата     = 0;
	СуммаПостоплата     = 0;
	СуммаПредоставление = 0;

	Если ТаблицаОплат <> Неопределено Тогда
		Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
			Если ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно Тогда
				СуммаЭлектронно = СуммаЭлектронно + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата Тогда
				СуммаПредоплата = СуммаПредоплата + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Постоплата Тогда
				СуммаПостоплата = СуммаПостоплата + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление Тогда
				СуммаПредоставление = СуммаПредоставление + ТаблицаОплат[ИндексОплаты].Сумма;
			Иначе
				СуммаНаличные = СуммаНаличные + ТаблицаОплат[ИндексОплаты].Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ОплатаНеНаличными = СуммаЭлектронно + СуммаПостоплата + СуммаПредоплата + СуммаПредоставление;
	
	// Выводим в печатную форму чека дополнительную информацию по СПБ и НСПК
	Если ОбщиеПараметры.Свойство("ДетализацияОплаты") И ОбщиеПараметры.ДетализацияОплаты.Количество() > 0 И НЕ ПараметрыФискализации.ДетализацияОплатыДобавлено Тогда
		
		ПараметрыФискализации.ДетализацияОплатыДобавлено = Истина;
		
		СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека();
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека);
		
		ТекстСтроки = НСтр("ru='ДЕТАЛИЗАЦИЯ ОПЛАТЫ'");
		СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека(ТекстСтроки);
		СтрокаЧека.Выравнивание = "Центр";
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека);
		
		ФорматЧисла = "ЧРД=.;ЧЦ=12;ЧДЦ=2;ЧН=0.00;ЧГ=0";
		Для Каждого ДетализацияОплаты Из ОбщиеПараметры.ДетализацияОплаты Цикл
			ТекстСтроки = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ВыстроитьПоля(ДетализацияОплаты.НаименованиеТипаОплаты,
				Формат(ДетализацияОплаты.Сумма, ФорматЧисла), ПараметрыФискализации.ШиринаСтроки);
			СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека(ТекстСтроки);
			ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека);
		КонецЦикла       
	КонецЕсли;          
	
	// QR-код по СПБ и НСПК	
	Если ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств Тогда
		Если ОбщиеПараметры.Свойство("QRКод") И Не ПустаяСтрока(ОбщиеПараметры.QRКод.ЗначениеКода) И НЕ ПараметрыФискализации.QRКодДобавлено Тогда
			
			ПараметрыФискализации.QRКодДобавлено = Истина;
			
			СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека();
			ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека);
		
			СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыШтрихкодВСтрокеЧека("QR", ОбщиеПараметры.QRКод.ЗначениеКода);
			ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека);
		
			СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека();
			ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека);
		
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ТипПлатежнойСистемы) Тогда
				СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека(ОбщиеПараметры.ТипПлатежнойСистемы);
				СтрокаЧека.Выравнивание = "Центр";
				ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека);
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбщиеПараметры.QRКод.ТекстПользователя) Тогда
				СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека(ОбщиеПараметры.QRКод.ТекстПользователя);
				СтрокаЧека.Выравнивание = "Центр";
				ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека); 
			КонецЕсли;
			
			СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека();
			ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаЧека);    
			
		КонецЕсли;
	КонецЕсли;   
	
	// Пакетная печать чека. Подготовка пакета.
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CheckPackage");
	
	Если ПараметрыФискализации.РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
		ЗаписьXML.ЗаписатьАтрибут("CashierName",  XMLСтрока(ОбщиеПараметры.Кассир));
		Если Не ПустаяСтрока(ОбщиеПараметры.КассирИНН) Тогда 
			ЗаписьXML.ЗаписатьАтрибут("CashierINN", XMLСтрока(ОбщиеПараметры.КассирИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("OperationType", XMLСтрока(ТипРасчета));
		ЗаписьXML.ЗаписатьАтрибут("TaxationSystem" , XMLСтрока(СистемаНалогообложения));
		
		Если Не ПустаяСтрока(ОбщиеПараметры.ОтправительEmail) И Электронно Тогда // Отправитель Email указывается только для Электронно.
			#Удаление
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(ОбщиеПараметры.ОтправительEmail));
			#КонецУдаления
			#Вставка
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока("noreply@taxcom.ru"));  
			#КонецВставки
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("АдресРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.АдресРасчетов) Тогда   
			ЗаписьXML.ЗаписатьАтрибут("SaleAddress", XMLСтрока(ОбщиеПараметры.АдресРасчетов));
		КонецЕсли;
		Если ОбщиеПараметры.Свойство("МестоРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.МестоРасчетов) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("SaleLocation", XMLСтрока(ОбщиеПараметры.МестоРасчетов));
		КонецЕсли;
		
		Если ПараметрыФискализации.РевизияИнтерфейса >= 4000 Тогда      
			Если ОбщиеПараметры.Свойство("СворачиватьОдинаковыеСтрокПриПечати") Тогда  
				ЗаписьXML.ЗаписатьАтрибут("GroupingPositionsWhenPrinting", XMLСтрока(ОбщиеПараметры.СворачиватьОдинаковыеСтрокПриПечати));
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ПокупательEmail") Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerEmail", XMLСтрока(?(ОбщиеПараметры.Свойство("ПокупательEmail"), ОбщиеПараметры.ПокупательEmail, "")));
		КонецЕсли;
		// SMS отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("ПокупательНомер") Тогда
			ПокупательНомер = ?(ОбщиеПараметры.Свойство("ПокупательНомер"), ОбщиеПараметры.ПокупательНомер, "");    
			ПокупательНомер = МенеджерОборудованияКлиентСервер.АбонентскийНомерФорматФФД(ПокупательНомер);
			ЗаписьXML.ЗаписатьАтрибут("CustomerPhone", XMLСтрока(ПокупательНомер));
		КонецЕсли;
		
		Если ПараметрыФискализации.РевизияИнтерфейса < 3004 Тогда
			
			Получатель = ОбщиеПараметры.Получатель;
			Если ПустаяСтрока(Получатель) Тогда
				Получатель = ОбщиеПараметры.СведенияОПокупателе.Покупатель;
			КонецЕсли;
			ПолучательИНН = ОбщиеПараметры.ПолучательИНН;
			Если ПустаяСтрока(ПолучательИНН) Тогда
				ПолучательИНН = ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН;
			КонецЕсли;
			Если ПерсональныеДанные <> Неопределено Тогда
				Если ТипПерсональныхДанных = Перечисления.ТипыПерсональныхДанныхККТ.ИНН Тогда
					ПолучательИНН = ПерсональныеДанные.ИНН;
				ИначеЕсли Не ПустаяСтрока(ПерсональныеДанные.ДанныеДокумента) Тогда      
					Получатель = СтрШаблон("<%1> <%2>", Получатель, ПерсональныеДанные.ДанныеДокумента); 
				КонецЕсли;
			КонецЕсли;
			Если Не ПустаяСтрока(Получатель) Тогда
				ЗаписьXML.ЗаписатьАтрибут("CustomerInfo", XMLСтрока(Получатель));
			КонецЕсли;
			Если Не ПустаяСтрока(ПолучательИНН) Тогда
				ЗаписьXML.ЗаписатьАтрибут("CustomerINN", XMLСтрока(ПолучательИНН));
			КонецЕсли;
			
		Иначе
			Если ОбщиеПараметры.Свойство("НомерАвтомата") И НЕ ПустаяСтрока(ОбщиеПараметры.НомерАвтомата) Тогда
				ЗаписьXML.ЗаписатьАтрибут("AutomatNumber", XMLСтрока(ОбщиеПараметры.НомерАвтомата));
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ПризнакАгента") И НЕ ПустаяСтрока(ОбщиеПараметры.ПризнакАгента) Тогда
			ПризнакАгента = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодПризнакаАгента(ОбщиеПараметры.ПризнакАгента);
			ЗаписьXML.ЗаписатьАтрибут("AgentType", XMLСтрока(ПризнакАгента));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизит") И НЕ ПустаяСтрока(ОбщиеПараметры.ДополнительныйРеквизит) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(ОбщиеПараметры.ДополнительныйРеквизит));
		КонецЕсли;
		
		Если ПараметрыФискализации.РевизияИнтерфейса >= 4006 Тогда
			ЗаписьXML.ЗаписатьАтрибут("OperationOnline", XMLСтрока(ОбщиеПараметры.Интернет));
			Если ЗначениеЗаполнено(ОбщиеПараметры.ЧасоваяЗона) И ОбщиеПараметры.ЧасоваяЗона > 0 Тогда
				ЗаписьXML.ЗаписатьАтрибут("TimeZone", XMLСтрока(ОбщиеПараметры.ЧасоваяЗона));
			КонецЕсли;
		КонецЕсли;            
		
		Если ОбщиеПараметры.Свойство("ДанныеКоррекции") Тогда
			ЗаписатьДанныеКоррекции(ЗаписьXML, ОбщиеПараметры.ДанныеКоррекции, ПараметрыФискализации.РевизияИнтерфейса);
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизитПользователя") Тогда
			ЗаписатьДополнительныйРеквизитПользователя(ЗаписьXML, ОбщиеПараметры.ДополнительныйРеквизитПользователя);
		КонецЕсли;
		
		ЗаписатьДанныеАгента(ЗаписьXML, ОбщиеПараметры.ДанныеАгента, ПараметрыФискализации.РевизияИнтерфейса);
		ЗаписатьДанныеПоставщика(ЗаписьXML, ОбщиеПараметры.ДанныеПоставщика, ПараметрыФискализации.РевизияИнтерфейса);
		
		Если ПараметрыФискализации.РевизияИнтерфейса >= 3004 Тогда
			ЗаписатьСведенияОПокупателе(ЗаписьXML, ОбщиеПараметры, ПерсональныеДанные, ТипПерсональныхДанных);
			ЗаписатьОперационныйРеквизит(ЗаписьXML, ОбщиеПараметры.ОперационныйРеквизит);
			ЗаписатьОтраслевойРеквизит(ЗаписьXML, ОбщиеПараметры.ОтраслевойРеквизит);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ОбщиеПараметры.Свойство("ФорматФД") Тогда
			ФорматФД = ОбщиеПараметры.ФорматФД;
		Иначе
			ФорматФД = "1.2";
		КонецЕсли;
		
		// Табличная часть
		Если ОбщиеПараметры.ПозицииЧека <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
			Для ИндексМассива = 0 По ОбщиеПараметры.ПозицииЧека.Количество() - 1 Цикл
				ТекущаяПозиция = ОбщиеПараметры.ПозицииЧека[ИндексМассива]; // см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека
				
				Если ТекущаяПозиция.Свойство("ФискальнаяСтрока") Тогда // Фискальная строка
					
					Если ТекущаяПозиция.ЦенаСоСкидками = 0 И ТекущаяПозиция.Сумма > 0 И ТекущаяПозиция.Количество > 0 Тогда
						ЦенаСоСкидками = Окр(ТекущаяПозиция.Сумма / ТекущаяПозиция.Количество, 2); 
					Иначе
						ЦенаСоСкидками = ТекущаяПозиция.ЦенаСоСкидками; 
					КонецЕсли;
					ЗаписьXML.ЗаписатьНачалоЭлемента("FiscalString");
					ЗаписьXML.ЗаписатьАтрибут("Name"              , XMLСтрока(ТекущаяПозиция.Наименование)); // Наименование товара.
					ЗаписьXML.ЗаписатьАтрибут("Quantity"          , XMLСтрока(ТекущаяПозиция.Количество)); // Количество товара.
					ЗаписьXML.ЗаписатьАтрибут("PriceWithDiscount" , XMLСтрока(ЦенаСоСкидками)); // Цена единицы товара с учетом скидок/наценок.
					ЗаписьXML.ЗаписатьАтрибут("AmountWithDiscount", XMLСтрока(ТекущаяПозиция.Сумма)); // Конечная сумма по позиции чека с учетом всех скидок/наценок.
					ЗаписьXML.ЗаписатьАтрибут("DiscountAmount"    , XMLСтрока(ТекущаяПозиция.СуммаСкидок)); // Сумма скидок и наценок.
					ЗаписьXML.ЗаписатьАтрибут("Department"        , XMLСтрока(ТекущаяПозиция.НомерСекции)); // Отдел, по которому ведется продажа
					
					ОбработкаНДС = ПредставлениеСтавкиНДС(ТекущаяПозиция.СтавкаНДС, ПараметрыФискализации.РевизияИнтерфейса);     
					ЗаписьXML.ЗаписатьАтрибут("VATRate", XMLСтрока(ОбработкаНДС.ЗначениеСтавкаНДС)); // Ставка НДС    
					
					Если ТекущаяПозиция.Свойство("СуммаНДС") И НЕ ПустаяСтрока(ТекущаяПозиция.СуммаНДС) И ОбработкаНДС.ЗначениеСтавкаНДС <> "none" Тогда 
						СуммаНДС = ТекущаяПозиция.СуммаНДС; 
						Если ОбработкаНДС.КоррекцияСтавки Тогда 
							СуммаНДС = ПерерасчетСуммыНДС(ТекущаяПозиция.Сумма, ОбработкаНДС.СтавкаНДС); 
						КонецЕсли;
						ЗаписьXML.ЗаписатьАтрибут("VATAmount", XMLСтрока(СуммаНДС));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("ПризнакСпособаРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакСпособаРасчета) Тогда
						ПризнакСпособаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодПризнакаСпособаРасчета(ТекущаяПозиция.ПризнакСпособаРасчета);
						ЗаписьXML.ЗаписатьАтрибут("PaymentMethod", XMLСтрока(ПризнакСпособаРасчета));
					КонецЕсли;
					
					ПризнакПредметаРасчета = Неопределено;
					Если ТекущаяПозиция.Свойство("ПризнакПредметаРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакПредметаРасчета) Тогда
						ПризнакПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодПризнакаПредметаРасчета(ТекущаяПозиция.ПризнакПредметаРасчета);
						Если ПризнакПредметаРасчета <> Неопределено Тогда
							ЗаписьXML.ЗаписатьАтрибут("CalculationSubject", XMLСтрока(ПризнакПредметаРасчета));
						КонецЕсли;
					КонецЕсли;
				
					Если ТекущаяПозиция.Свойство("ПризнакАгентаПоПредметуРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакАгентаПоПредметуРасчета) Тогда
						ПризнакАгентаПоПредметуРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодПризнакаАгента(ТекущаяПозиция.ПризнакАгентаПоПредметуРасчета);
						ЗаписьXML.ЗаписатьАтрибут("CalculationAgent", XMLСтрока(ПризнакАгентаПоПредметуРасчета));
					КонецЕсли;  
					
					Если ТекущаяПозиция.Свойство("КодСтраныПроисхожденияТовара") И НЕ ПустаяСтрока(ТекущаяПозиция.КодСтраныПроисхожденияТовара) Тогда
						ЗаписьXML.ЗаписатьАтрибут("CountryOfOrigin", XMLСтрока(ТекущаяПозиция.КодСтраныПроисхожденияТовара));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("НомерТаможеннойДекларации") И НЕ ПустаяСтрока(ТекущаяПозиция.НомерТаможеннойДекларации) Тогда
						ЗаписьXML.ЗаписатьАтрибут("CustomsDeclaration", XMLСтрока(ТекущаяПозиция.НомерТаможеннойДекларации));
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("СуммаАкциза") И ТекущаяПозиция.СуммаАкциза <> Неопределено Тогда
						Если Число(ТекущаяПозиция.СуммаАкциза) > 0 Тогда
							ЗаписьXML.ЗаписатьАтрибут("ExciseAmount", XMLСтрока(ТекущаяПозиция.СуммаАкциза));
						ИначеЕсли ПризнакПредметаРасчета <> Неопределено Тогда       
							Если ПризнакПредметаРасчета = 2 Или ПризнакПредметаРасчета = 30 Или ПризнакПредметаРасчета = 31 Тогда      
								ЗаписьXML.ЗаписатьАтрибут("ExciseAmount", XMLСтрока(ТекущаяПозиция.СуммаАкциза));
							КонецЕсли;     
						КонецЕсли;
					КонецЕсли;
					
					Если ТекущаяПозиция.Свойство("ДополнительныйРеквизит") Тогда // Тэг 1191
						
						ДополнительныйРеквизит = "";
						Если НЕ ПустаяСтрока(ТекущаяПозиция.ДополнительныйРеквизит) Тогда
							ДополнительныйРеквизит = ТекущаяПозиция.ДополнительныйРеквизит;
						ИначеЕсли ВедетсяОбъемноСортовойУчет() И ТекущаяПозиция.ОбъемноСортовойУчет И ПараметрыФискализации.РевизияИнтерфейса < 3004 Тогда  
							// Передача сведений об объемно сортовой товара при оптовой продаже через ККТ
							ДополнительныйРеквизит = "crpt=mrk"; 
						ИначеЕсли ТекущаяПозиция.Свойство("ДробноеКоличество") И ПараметрыФискализации.РевизияИнтерфейса < 3004 Тогда
							// Дробное количество, рекомендации ЦРПТ "ВЫВОД ТОВАРА ИЗ ОБОРОТА ПРИ РЕАЛИЗАЦИИ КОНЕЧНЫМ ПОТРЕБИТЕЛЯМ (ЧАСТИЧНАЯ ПРОДАЖА)"
							// для 1.05 и 1.1 - пишем в 1191, Формирование и  передача фискального  документа в ГИС МТ 
							Если Не ПустаяСтрока(ТекущаяПозиция.ДробноеКоличество.Числитель) И Не ПустаяСтрока(ТекущаяПозиция.ДробноеКоличество.Знаменатель) Тогда
								Числитель = Число(ТекущаяПозиция.ДробноеКоличество.Числитель);
								Знаменатель = Число(ТекущаяПозиция.ДробноеКоличество.Знаменатель);
								ДополнительныйРеквизит = "mrk"; // Префикс «mrk», если  после «mrk» указание  дробной  части  отсутствует, упаковка считается выведенной из оборота полностью.
								Если Числитель <> Знаменатель Тогда
									ДополнительныйРеквизит = ДополнительныйРеквизит + Строка(Числитель) + "/" + Строка(Знаменатель) + "&"; 
								КонецЕсли;
							КонецЕсли;        
						КонецЕсли;
						Если Не ПустаяСтрока(ДополнительныйРеквизит) Тогда 
							ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(ДополнительныйРеквизит));  // Тэг 1191
						КонецЕсли;
					КонецЕсли;
					
					Если ПараметрыФискализации.РевизияИнтерфейса >= 3004 Тогда
						
						Если Не ПустаяСтрока(ТекущаяПозиция.КонтрольнаяМарка) Тогда
							ЗаписьXML.ЗаписатьАтрибут("MarkingCode", XMLСтрока(ТекущаяПозиция.КонтрольнаяМарка));
						КонецЕсли;
						
						Если ФорматФД = "1.2" Тогда
							ДробноеКоличествоУказано = Ложь;
							ДробноеКоличество = ТекущаяПозиция.ДробноеКоличество;
							Если Не ПустаяСтрока(ДробноеКоличество.Числитель) И Не ПустаяСтрока(ДробноеКоличество.Знаменатель) Тогда
								Если Число(ДробноеКоличество.Числитель) > 0 И Число(ДробноеКоличество.Знаменатель) > 0 Тогда 
									ДробноеКоличествоУказано = Истина;
								КонецЕсли;
							КонецЕсли;
							
							Если ДробноеКоличествоУказано Тогда            
								МераКоличестваПредметаРасчета = 0;
								ЗаписьXML.ЗаписатьАтрибут("MeasureOfQuantity", XMLСтрока(МераКоличестваПредметаРасчета));  
								ЗаписьXML.ЗаписатьНачалоЭлемента("FractionalQuantity");
								ЗаписьXML.ЗаписатьАтрибут("Numerator", XMLСтрока(ДробноеКоличество.Числитель));
								ЗаписьXML.ЗаписатьАтрибут("Denominator", XMLСтрока(ДробноеКоличество.Знаменатель));
								ЗаписьXML.ЗаписатьКонецЭлемента();  
							Иначе
								Если ВедетсяОбъемноСортовойУчет() И ТекущаяПозиция.ОбъемноСортовойУчет И Не ПустаяСтрока(ТекущаяПозиция.КоличествоВесовогоТовара) Тогда
									МераКоличестваПредметаРасчета = 11; // Килограмм
								Иначе
								МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(ТекущаяПозиция.КодЕдиницыИзмерения);
								МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчета);
								КонецЕсли;
								ЗаписьXML.ЗаписатьАтрибут("MeasureOfQuantity", XMLСтрока(МераКоличестваПредметаРасчета));
							КонецЕсли;    
						КонецЕсли;    
					Иначе
						Если ТекущаяПозиция.Свойство("ЕдиницаИзмерения") И ТекущаяПозиция.ЕдиницаИзмерения <> Неопределено Тогда
							#Вставка
							ИспользуемДругойТег = Ложь;
							ИспользоватьДопПроверку = ДопМодуль.ПолучитьНастройкиХранилища("ВключенияИзмененияВыводаТега2108ВЧеках").ВключитьВыводТега;
							
							Если ИспользоватьДопПроверку Тогда
								
								КассирДляПроверки = ДопМодуль.ПолучитьНастройкиХранилища("ВключенияИзмененияВыводаТега2108ВЧеках").КассирДляПроверки;
								
								Если ЗначениеЗаполнено(КассирДляПроверки) Тогда
									Если ОбщиеПараметры.Кассир = Строка(КассирДляПроверки) Тогда
										ИспользуемДругойТег =Истина;
									Иначе
										ИспользуемДругойТег=Ложь;
									КонецЕсли; 
								Иначе
									ИспользуемДругойТег =Истина;
								КонецЕсли;
							КонецЕсли;
							
							Если ИспользуемДругойТег Тогда
								МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(ТекущаяПозиция.КодЕдиницыИзмерения);
								МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчета);
								ЗаписьXML.ЗаписатьАтрибут("MeasureOfQuantity", XMLСтрока(МераКоличестваПредметаРасчета));
							Иначе
							#КонецВставки
							ЗаписьXML.ЗаписатьАтрибут("MeasurementUnit", XMLСтрока(Лев(ТекущаяПозиция.ЕдиницаИзмерения, 16)));
							#Вставка 
							КонецЕсли;
							#КонецВставки
						КонецЕсли;   
					КонецЕсли;             
					
					
					Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
						МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
						МодульМенеджерОборудованияМаркировка.ЗаписатьДанныеКодаТоварнойНоменклатуры(ЗаписьXML, ТекущаяПозиция, ПараметрыФискализации);
						
						Если ВедетсяОбъемноСортовойУчет() И ТекущаяПозиция.ОбъемноСортовойУчет Тогда    
							МодульМенеджерОборудованияМаркировка.ЗаполнитьОтраслевойРеквизитОбъемноСортовойУчет(ТекущаяПозиция);
						ИначеЕсли ОказываютсяУслугиОбщественноеПитания() И ТекущаяПозиция.ОбщественноеПитание Тогда    
							МодульМенеджерОборудованияМаркировка.ЗаполнитьОтраслевойРеквизитОбщественноеПитание(ТекущаяПозиция);
						ИначеЕсли ТекущаяПозиция.ВетеринарныйПрепарат Тогда 
							МодульМенеджерОборудованияМаркировка.ЗаполнитьОтраслевойРеквизитВетеринарныеПрепараты(ТекущаяПозиция);
						КонецЕсли;
						
						Если Не ПустаяСтрока(ТекущаяПозиция.ЗапросПроверкиКода.ИдентификаторЗапроса)
							И Не ПустаяСтрока(ТекущаяПозиция.ЗапросПроверкиКода.ВременнаяМетка) Тогда
							МодульМенеджерОборудованияМаркировка.ЗаполнитьДанныеЗапросПроверкиКода(ТекущаяПозиция);
						КонецЕсли;
						
					КонецЕсли;   
					
					ЗаписатьДанныеАгента(ЗаписьXML, ТекущаяПозиция.ДанныеАгента, ПараметрыФискализации.РевизияИнтерфейса);
					ЗаписатьДанныеПоставщика(ЗаписьXML, ТекущаяПозиция.ДанныеПоставщика, ПараметрыФискализации.РевизияИнтерфейса);
					Если ПараметрыФискализации.РевизияИнтерфейса >= 3004 Тогда
						ЗаписатьОтраслевойРеквизит(ЗаписьXML, ТекущаяПозиция.ОтраслевойРеквизит);
					КонецЕсли;
					ЗаписьXML.ЗаписатьКонецЭлемента();
					СуммаЧека = СуммаЧека + ТекущаяПозиция.Сумма;
			
				ИначеЕсли ТекущаяПозиция.Свойство("ТекстоваяСтрока") Тогда // Текстовая строка
					Если ТекущаяПозиция.Свойство("ПереносСтроки") И ТекущаяПозиция.ПереносСтроки Тогда 
						ТекстовыеСтроки = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПостроитьПолеПереносом(ТекущаяПозиция.Текст, ПараметрыФискализации.ШиринаСтроки);
					Иначе
						ТекстовыеСтроки = ТекущаяПозиция.Текст;
					КонецЕсли;
					Выравнивание = ?(ТекущаяПозиция.Свойство("Выравнивание"),  ТекущаяПозиция.Выравнивание, "Лево"); 
					Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстовыеСтроки) Цикл
						ВыделеннаяСтрока = СтрПолучитьСтроку(ТекстовыеСтроки, НомерСтроки);
						ВыделеннаяСтрока = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ВыровнятьПоле(ВыделеннаяСтрока, ПараметрыФискализации.ШиринаСтроки, Выравнивание); 
						ЗаписьXML.ЗаписатьНачалоЭлемента("TextString");
						ЗаписьXML.ЗаписатьАтрибут("Text", XMLСтрока(ВыделеннаяСтрока));
						ЗаписьXML.ЗаписатьКонецЭлемента();  
					КонецЦикла;
					
				ИначеЕсли ТекущаяПозиция.Свойство("ШтрихКод") Тогда // Штрихкод
					ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
					ЗаписьXML.ЗаписатьАтрибут("Type" , XMLСтрока(ТекущаяПозиция.ТипШтрихкода));
					// Значение штрихкода. Штрихкод кодируется текстом в кодировке Base64.
					Если ПараметрыФискализации.РевизияИнтерфейса >= 3003 Тогда
						ШтрихКодBase64 = МенеджерОборудованияКлиентСервер.ШтрихкодВBase64(ТекущаяПозиция.ШтрихКод);
						Если ТекущаяПозиция.Свойство("ШтрихКодBase64")
							И НЕ ПустаяСтрока(ТекущаяПозиция.ШтрихКодBase64) Тогда
							ШтрихКодBase64 = ТекущаяПозиция.ШтрихКодBase64;
						КонецЕсли;
						ЗаписьXML.ЗаписатьАтрибут("ValueBase64", XMLСтрока(ШтрихКодBase64));
					Иначе
					ЗаписьXML.ЗаписатьАтрибут("Value", XMLСтрока(ТекущаяПозиция.ШтрихКод));
					КонецЕсли;
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		// Таблица оплат
		Если ТаблицаОплат <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Payments");
			ЗаписьXML.ЗаписатьАтрибут("Cash", XMLСтрока(СуммаНаличные));
			ЗаписьXML.ЗаписатьАтрибут("ElectronicPayment", XMLСтрока(СуммаЭлектронно));
			ЗаписьXML.ЗаписатьАтрибут("PrePayment", XMLСтрока(СуммаПредоплата));
			ЗаписьXML.ЗаписатьАтрибут("PostPayment", XMLСтрока(СуммаПостоплата));
			ЗаписьXML.ЗаписатьАтрибут("Barter", XMLСтрока(СуммаПредоставление));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Если ПараметрыФискализации.РевизияИнтерфейса >= 4004 
			И ОбщиеПараметры.СведенияОБезналичнойОплате <> Неопределено 
			И ОбщиеПараметры.СведенияОБезналичнойОплате.Количество() Тогда 
			ЗаписьXML.ЗаписатьНачалоЭлемента("ElectronicPaymentInfo");
			Для Каждого СведенияОБезналичнойОплате Из ОбщиеПараметры.СведенияОБезналичнойОплате Цикл 
				ЗаписьXML.ЗаписатьНачалоЭлемента("ElectronicPayment");
				ЗаписьXML.ЗаписатьАтрибут("Amount", XMLСтрока(СведенияОБезналичнойОплате.Сумма));
				ЗаписьXML.ЗаписатьАтрибут("PaymentMethod", XMLСтрока(СведенияОБезналичнойОплате.ПризнакСпособаОплаты));
				ЗаписьXML.ЗаписатьАтрибут("Identifiers", XMLСтрока(СведенияОБезналичнойОплате.Идентификаторы));
				ЗаписьXML.ЗаписатьАтрибут("AdditionalInformation", XMLСтрока(СведенияОБезналичнойОплате.ДополнительныеCведения));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;   
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	ИначеЕсли ПараметрыФискализации.РевизияИнтерфейса > 2001 Тогда  // Версия стандарта 2.2 и выше
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
		ЗаписьXML.ЗаписатьАтрибут("PaymentType" , XMLСтрока(ТипРасчета));
		ЗаписьXML.ЗаписатьАтрибут("TaxVariant"  , XMLСтрока(СистемаНалогообложения));
		ЗаписьXML.ЗаписатьАтрибут("CashierName" , XMLСтрока(ОбщиеПараметры.Кассир));
		ЗаписьXML.ЗаписатьАтрибут("CashierVATIN", ?(ОбщиеПараметры.Свойство("КассирИНН"), XMLСтрока(ОбщиеПараметры.КассирИНН), ""));
		Если Не ПустаяСтрока(ОбщиеПараметры.ОтправительEmail) И Электронно Тогда // Отправитель Email указывается только для Электронно.
			#Удаление
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(ОбщиеПараметры.ОтправительEmail));
			#КонецУдаления
			#Вставка
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока("noreply@taxcom.ru"));  
			#КонецВставки	
		КонецЕсли;
		// Email отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("Отправляет1СEmail") И НЕ ОбщиеПараметры.Отправляет1СEmail Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerEmail", XMLСтрока(?(ОбщиеПараметры.Свойство("ПокупательEmail"), ОбщиеПараметры.ПокупательEmail, "")));
		КонецЕсли;
		// SMS отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("Отправляет1СSMS") И НЕ ОбщиеПараметры.Отправляет1СSMS Тогда
			ПокупательНомер = ?(ОбщиеПараметры.Свойство("ПокупательНомер"), ОбщиеПараметры.ПокупательНомер, "");
			Если Не ПустаяСтрока(ПокупательНомер) И Лев(ПокупательНомер, 1) <> "+" Тогда
				ПокупательНомер = "+" + ПокупательНомер;
			КонецЕсли;
			ЗаписьXML.ЗаписатьАтрибут("CustomerPhone", XMLСтрока(ПокупательНомер));
		КонецЕсли;
			
		Если ОбщиеПараметры.Свойство("ПризнакАгента") И НЕ ПустаяСтрока(ОбщиеПараметры.ПризнакАгента) Тогда  // Атрибут с ФФД 1.05 
			ПризнакАгента = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодПризнакаАгента(ОбщиеПараметры.ПризнакАгента);
			ЗаписьXML.ЗаписатьАтрибут("AgentSign", XMLСтрока(ПризнакАгента));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("АдресРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.АдресРасчетов) Тогда   
			ЗаписьXML.ЗаписатьАтрибут("AddressSettle", XMLСтрока(ОбщиеПараметры.АдресРасчетов));
		КонецЕсли;
		Если ОбщиеПараметры.Свойство("МестоРасчетов") И НЕ ПустаяСтрока(ОбщиеПараметры.МестоРасчетов) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("PlaceSettle", XMLСтрока(ОбщиеПараметры.МестоРасчетов));
		КонецЕсли;
		
		Получатель = ОбщиеПараметры.Получатель;
		Если ПустаяСтрока(Получатель) Тогда
			Получатель = ОбщиеПараметры.СведенияОПокупателе.Покупатель;
		КонецЕсли;
		ПолучательИНН = ОбщиеПараметры.ПолучательИНН;
		Если ПустаяСтрока(ПолучательИНН) Тогда
			ПолучательИНН = ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН;
		КонецЕсли;
		
		Если Не ПустаяСтрока(Получатель) Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerInfo", XMLСтрока(Получатель));
		КонецЕсли;
		Если Не ПустаяСтрока(ПолучательИНН) Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerINN", XMLСтрока(ПолучательИНН));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизит") И НЕ ПустаяСтрока(ОбщиеПараметры.ДополнительныйРеквизит) Тогда  
			ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(ОбщиеПараметры.ДополнительныйРеквизит));
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизитПользователя") Тогда
			ЗаписатьДополнительныйРеквизитПользователя(ЗаписьXML, ОбщиеПараметры.ДополнительныйРеквизитПользователя);
		КонецЕсли;
		
		ЗаписатьДанныеАгента(ЗаписьXML, ОбщиеПараметры.ДанныеАгента);
		ЗаписатьДанныеПоставщика(ЗаписьXML, ОбщиеПараметры.ДанныеПоставщика);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		// Табличная часть
		Если ОбщиеПараметры.ПозицииЧека <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
			Для ИндексМассива = 0 По ОбщиеПараметры.ПозицииЧека.Количество() - 1 Цикл
				ТекущаяПозиция = ОбщиеПараметры.ПозицииЧека[ИндексМассива]; //см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека
				
				Если ТекущаяПозиция.Свойство("ФискальнаяСтрока") Тогда
						Если ТекущаяПозиция.ЦенаСоСкидками = 0 И ТекущаяПозиция.Сумма > 0 И ТекущаяПозиция.Количество > 0 Тогда
							ЦенаСоСкидками = Окр(ТекущаяПозиция.Сумма / ТекущаяПозиция.Количество, 2); 
						Иначе
							ЦенаСоСкидками = ТекущаяПозиция.ЦенаСоСкидками; 
						КонецЕсли;
						ЗаписьXML.ЗаписатьНачалоЭлемента("FiscalString");
						ЗаписьXML.ЗаписатьАтрибут("Name"             , XMLСтрока(ТекущаяПозиция.Наименование));
						ЗаписьXML.ЗаписатьАтрибут("Quantity"         , XMLСтрока(ТекущаяПозиция.Количество));
						ЗаписьXML.ЗаписатьАтрибут("PriceWithDiscount", XMLСтрока(ЦенаСоСкидками));
						ЗаписьXML.ЗаписатьАтрибут("SumWithDiscount"  , XMLСтрока(ТекущаяПозиция.Сумма));
						ЗаписьXML.ЗаписатьАтрибут("DiscountSum"      , XMLСтрока(ТекущаяПозиция.СуммаСкидок));
						ЗаписьXML.ЗаписатьАтрибут("Department"       , XMLСтрока(ТекущаяПозиция.НомерСекции));
						
						ОбработкаНДС = ПредставлениеСтавкиНДС(ТекущаяПозиция.СтавкаНДС, ПараметрыФискализации.РевизияИнтерфейса);
						ЗаписьXML.ЗаписатьАтрибут("Tax", XMLСтрока(ОбработкаНДС.ЗначениеСтавкаНДС));
						Если ТекущаяПозиция.Свойство("СуммаНДС") И НЕ ПустаяСтрока(ТекущаяПозиция.СуммаНДС) Тогда
							ЗаписьXML.ЗаписатьАтрибут("TaxSum", XMLСтрока(ТекущаяПозиция.СуммаНДС));
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("ПризнакСпособаРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакСпособаРасчета) Тогда
							ПризнакСпособаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодПризнакаСпособаРасчета(ТекущаяПозиция.ПризнакСпособаРасчета);
							ЗаписьXML.ЗаписатьАтрибут("SignMethodCalculation", XMLСтрока(ПризнакСпособаРасчета));
						КонецЕсли;
						Если ТекущаяПозиция.Свойство("ПризнакПредметаРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакПредметаРасчета) Тогда
							ПризнакПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодПризнакаПредметаРасчета(ТекущаяПозиция.ПризнакПредметаРасчета);
							Если ПризнакПредметаРасчета <> Неопределено Тогда
								ЗаписьXML.ЗаписатьАтрибут("SignCalculationObject", XMLСтрока(ПризнакПредметаРасчета));
							КонецЕсли;
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("ПризнакАгентаПоПредметуРасчета") И НЕ ПустаяСтрока(ТекущаяПозиция.ПризнакАгентаПоПредметуРасчета) Тогда
							ПризнакАгентаПоПредметуРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодПризнакаАгента(ТекущаяПозиция.ПризнакАгентаПоПредметуРасчета);
							ЗаписьXML.ЗаписатьАтрибут("SignSubjectCalculationAgent", XMLСтрока(ПризнакАгентаПоПредметуРасчета));
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("ЕдиницаИзмерения") И ТекущаяПозиция.ЕдиницаИзмерения <> Неопределено Тогда
						#Вставка
							ИспользуемДругойТег = Ложь;
							ИспользоватьДопПроверку = ДопМодуль.ПолучитьНастройкиХранилища("ВключенияИзмененияВыводаТега2108ВЧеках").ВключитьВыводТега;
							
							Если ИспользоватьДопПроверку Тогда
								
								КассирДляПроверки = ДопМодуль.ПолучитьНастройкиХранилища("ВключенияИзмененияВыводаТега2108ВЧеках").КассирДляПроверки;
								
								Если ЗначениеЗаполнено(КассирДляПроверки) Тогда
									Если ОбщиеПараметры.Кассир = Строка(КассирДляПроверки) Тогда
										ИспользуемДругойТег =Истина;
									Иначе
										ИспользуемДругойТег=Ложь;
									КонецЕсли; 
								Иначе
									ИспользуемДругойТег =Истина;
								КонецЕсли;
							КонецЕсли;
							
							Если ИспользуемДругойТег Тогда
								МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(ТекущаяПозиция.КодЕдиницыИзмерения);
								МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчета);
								ЗаписьXML.ЗаписатьАтрибут("MeasureOfQuantity", XMLСтрока(МераКоличестваПредметаРасчета));
							Иначе
						#КонецВставки
							ЗаписьXML.ЗаписатьАтрибут("MeasurementUnit", XMLСтрока(Лев(ТекущаяПозиция.ЕдиницаИзмерения, 16)));
						#Вставка 
						КонецЕсли;
						#КонецВставки
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("КодСтраныПроисхожденияТовара") И НЕ ПустаяСтрока(ТекущаяПозиция.КодСтраныПроисхожденияТовара) Тогда
							ЗаписьXML.ЗаписатьАтрибут("CountryOfOrigin", XMLСтрока(ТекущаяПозиция.КодСтраныПроисхожденияТовара));
						КонецЕсли;
						Если ТекущаяПозиция.Свойство("НомерТаможеннойДекларации") И НЕ ПустаяСтрока(ТекущаяПозиция.НомерТаможеннойДекларации) Тогда
							ЗаписьXML.ЗаписатьАтрибут("CustomsDeclaration", XMLСтрока(ТекущаяПозиция.НомерТаможеннойДекларации));
						КонецЕсли;
						Если ТекущаяПозиция.Свойство("СуммаАкциза") И ТекущаяПозиция.СуммаАкциза <> Неопределено Тогда
							ЗаписьXML.ЗаписатьАтрибут("ExciseAmount", XMLСтрока(XMLСтрока(ТекущаяПозиция.СуммаАкциза)));
						КонецЕсли;
						
						Если ТекущаяПозиция.Свойство("ДополнительныйРеквизит") И НЕ ПустаяСтрока(ТекущаяПозиция.ДополнительныйРеквизит) Тогда
							ЗаписьXML.ЗаписатьАтрибут("AdditionalAttribute", XMLСтрока(XMLСтрока(ТекущаяПозиция.ДополнительныйРеквизит)));
						КонецЕсли;
						
						ЗаписатьДанныеАгента(ЗаписьXML, ТекущаяПозиция.ДанныеАгента);
						ЗаписатьДанныеПоставщика(ЗаписьXML, ТекущаяПозиция.ДанныеПоставщика);
						Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
							МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
							МодульМенеджерОборудованияМаркировка.ЗаписатьДанныеКодаТоварнойНоменклатуры(ЗаписьXML, ТекущаяПозиция, ПараметрыФискализации);
						КонецЕсли;
						
						ЗаписьXML.ЗаписатьКонецЭлемента();
						СуммаЧека = СуммаЧека + ТекущаяПозиция.Сумма;
						
					ИначеЕсли ТекущаяПозиция.Свойство("ТекстоваяСтрока") Тогда
						
						Если ТекущаяПозиция.Свойство("ПереносСтроки") И ТекущаяПозиция.ПереносСтроки Тогда 
							ТекстовыеСтроки = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПостроитьПолеПереносом(ТекущаяПозиция.Текст, ПараметрыФискализации.ШиринаСтроки);
						Иначе
							ТекстовыеСтроки = ТекущаяПозиция.Текст;
						КонецЕсли;
						Выравнивание = ?(ТекущаяПозиция.Свойство("Выравнивание"),  ТекущаяПозиция.Выравнивание, "Лево"); 
						Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстовыеСтроки) Цикл
							ВыделеннаяСтрока = СтрПолучитьСтроку(ТекстовыеСтроки, НомерСтроки);
							ВыделеннаяСтрока = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ВыровнятьПоле(ВыделеннаяСтрока, ПараметрыФискализации.ШиринаСтроки, Выравнивание); 
							ЗаписьXML.ЗаписатьНачалоЭлемента("TextString");
							ЗаписьXML.ЗаписатьАтрибут("Text", XMLСтрока(ВыделеннаяСтрока));
							ЗаписьXML.ЗаписатьКонецЭлемента();  
						КонецЦикла;
						
					ИначеЕсли ТекущаяПозиция.Свойство("ШтрихКод") Тогда
						ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
						ЗаписьXML.ЗаписатьАтрибут("BarcodeType", XMLСтрока(ТекущаяПозиция.ТипШтрихкода));
						ЗаписьXML.ЗаписатьАтрибут("Barcode", XMLСтрока(ТекущаяПозиция.ШтрихКод));
						ЗаписьXML.ЗаписатьКонецЭлемента();
					КонецЕсли;
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		// Таблица оплат
		Если ТаблицаОплат <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Payments");
			ЗаписьXML.ЗаписатьАтрибут("Cash"             , XMLСтрока(СуммаНаличные));
			ЗаписьXML.ЗаписатьАтрибут("ElectronicPayment", XMLСтрока(СуммаЭлектронно));
			ЗаписьXML.ЗаписатьАтрибут("Credit"           , XMLСтрока(СуммаПостоплата));
			ЗаписьXML.ЗаписатьАтрибут("AdvancePayment"   , XMLСтрока(СуммаПредоплата));
			ЗаписьXML.ЗаписатьАтрибут("CashProvision"    , XMLСтрока(СуммаПредоставление));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ДанныеЧекаXML = ЗаписьXML.Закрыть();
	
	Если ВключатьПерсональныеДанные Тогда
		ПараметрыФискализации.ДанныеЧекаXMLПерсональныеДанные = ДанныеЧекаXML;
	Иначе
		ПараметрыФискализации.ДанныеЧекаXML = ДанныеЧекаXML;
		ПараметрыФискализации.ТипРасчета = ОбщиеПараметры.ТипРасчета;
		ПараметрыФискализации.СуммаЧека = СуммаЧека;
		ПараметрыФискализации.ОплатаНаличные    = ?(СуммаНаличные + ОплатаНеНаличными > СуммаЧека, СуммаЧека - ОплатаНеНаличными, СуммаНаличные); 
		ПараметрыФискализации.ОплатаЭлектронно  = СуммаЭлектронно;
		ПараметрыФискализации.ОплатаПостоплата  = СуммаПостоплата;
		ПараметрыФискализации.ОплатаПредоплата  = СуммаПредоплата;
		ПараметрыФискализации.ОплатаВстречноеПредоставление = СуммаПредоставление;
	КонецЕсли;
	// -- Локализация
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаписатьФискальнуюОперацию")
Процедура Док_ЗаписатьФискальнуюОперацию(ПараметрыФискализации)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПустаяСтрока(ПараметрыФискализации.ИдентификаторФискальнойЗаписи) Тогда
		ИдентификаторЗаписи = Строка(Новый УникальныйИдентификатор);
		ПараметрыФискализации.ИдентификаторФискальнойЗаписи = ИдентификаторЗаписи;
	Иначе
		ИдентификаторЗаписи = ПараметрыФискализации.ИдентификаторФискальнойЗаписи;
	КонецЕсли;
	// ФискальныеОперации
	НаборЗаписей = РегистрыСведений.ФискальныеОперации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(ПараметрыФискализации.ДокументОснование, Истина);
	НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи, Истина);
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Дата = ПараметрыФискализации.ДатаВремяЧека;
	НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
	НоваяСтрока.ДокументОснование = ПараметрыФискализации.ДокументОснование;
	#Вставка
	НоваяСтрока.ДокументРодитель = ПараметрыФискализации.ДокументОснование;
	#КонецВставки
	НоваяСтрока.ФискальныйПризнак = ПараметрыФискализации.ФискальныйПризнак;
	НоваяСтрока.ТипДокумента      = ПараметрыФискализации.ТипДокумента; 
	НоваяСтрока.Организация       = ПараметрыФискализации.Организация;
	НоваяСтрока.ТорговыйОбъект    = ПараметрыФискализации.ТорговыйОбъект;
	НоваяСтрока.ТипРасчета        = ПараметрыФискализации.ТипРасчета;
	НоваяСтрока.НомерСменыККМ     = ПараметрыФискализации.НомерСменыККТ;
	НоваяСтрока.НомерЧекаККМ      = ПараметрыФискализации.НомерЧекаККТ;
	НоваяСтрока.Сумма            = ПараметрыФискализации.СуммаЧека;
	НоваяСтрока.ОплатаНаличные   = ПараметрыФискализации.ОплатаНаличные;
	НоваяСтрока.ОплатаЭлектронно = ПараметрыФискализации.ОплатаЭлектронно;
	НоваяСтрока.ОплатаПостоплата = ПараметрыФискализации.ОплатаПостоплата;
	НоваяСтрока.ОплатаПредоплата = ПараметрыФискализации.ОплатаПредоплата;
	НоваяСтрока.ОплатаВстречноеПредоставление = ПараметрыФискализации.ОплатаВстречноеПредоставление;
	НоваяСтрока.ДополнительныйРеквизит  = ПараметрыФискализации.ДополнительныйРеквизит;
	НоваяСтрока.АдресСайтаПроверки      = ПараметрыФискализации.АдресСайтаПроверки;
	НоваяСтрока.ЗаводскойНомерФН        = ПараметрыФискализации.ЗаводскойНомерФН;
	НоваяСтрока.РегистрационныйНомерККТ = ПараметрыФискализации.РегистрационныйНомерККТ; 
	НоваяСтрока.КорректируемыйДокумент  = ПараметрыФискализации.КорректируемыйДокумент;
	НоваяСтрока.СубъектПерсональныхДанных = ПараметрыФискализации.СубъектПерсональныхДанных;
	НоваяСтрока.ЕдиныйЧек                 = ПараметрыФискализации.ЕдиныйЧек;
	НоваяСтрока.ТипПлатежнойСистемы       = ПараметрыФискализации.ТипПлатежнойСистемы;
	НоваяСтрока.ИдентификаторОплатыПлатежнойСистемы  = ПараметрыФискализации.ИдентификаторОплатыПлатежнойСистемы;    
	Если ПараметрыФискализации.ДанныеЧекаXML <> Неопределено Тогда
		НоваяСтрока.ДанныеXML = Новый ХранилищеЗначения(ПараметрыФискализации.ДанныеЧекаXML);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	Если ПараметрыФискализации.Свойство("ЗаписьОперацииКМ") Тогда
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
		ПараметрыЗаписи = МодульМенеджерОборудованияМаркировка.ПараметрыЗаписиРезультатаПроверкиКМ();
		ПараметрыЗаписи.Ключ.ИдентификаторСессии = ПараметрыФискализации.ЗаписьОперацииКМ.ИдентификаторСессии;
		ПараметрыЗаписи.Ключ.ИдентификаторЗапроса = ПараметрыФискализации.ЗаписьОперацииКМ.ИдентификаторЗапроса;
		Если ПараметрыФискализации.ЗаписьОперацииКМ.ВыполнялосьПодтверждениеПокупки Тогда
			ПараметрыЗаписи.ПокупкаПодтверждена = Истина;
		КонецЕсли;
		МодульМенеджерОборудованияМаркировка.ОбновитьРезультатыПроверкиКодаМаркировкиВРегистре(ПараметрыЗаписи);
		МодульМенеджерОборудованияМаркировка.ОбновитьИдентификаторФискальнойОперацииРезультатаПроверкиКодаМаркировки(
			ПараметрыФискализации.ЗаписьОперацииКМ.ИдентификаторСессии, ИдентификаторЗаписи);
	КонецЕсли;
	
	Если ПараметрыФискализации.Свойство("ЗаписьОперацииЕГАИС") Тогда
		
		ЗаписьОперацииЕГАИС = ПараметрыФискализации.ЗаписьОперацииЕГАИС;
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
		ПараметрыЗаписи = МодульМенеджерОборудованияМаркировка.ПараметрыЗаписиРезультатаПроверкиЕГАИС();;
		ПараметрыЗаписи.ИдентификаторФискальнойОперации = ИдентификаторЗаписи;
		ПараметрыЗаписи.Выполнено = ЗаписьОперацииЕГАИС.Выполнено;
		ПараметрыЗаписи.ШтрихкодыПродукции = ПараметрыФискализации.ШтрихкодыПродукции;
		ПараметрыЗаписи.ИдентификаторЗапроса = ЗаписьОперацииЕГАИС.АдресЧека;
		ПараметрыЗаписи.ПодписьЧека = ЗаписьОперацииЕГАИС.ПодписьЧека;
		ПараметрыЗаписи.ВходящееСообщение = ЗаписьОперацииЕГАИС.ВходящееСообщение;
		ПараметрыЗаписи.ИсходящееСообщение = ЗаписьОперацииЕГАИС.ИсходящееСообщение;
		ПараметрыЗаписи.СообщениеПередано = ЗаписьОперацииЕГАИС.СообщениеПередано;
		ПараметрыЗаписи.ТекстОшибки = ЗаписьОперацииЕГАИС.ОписаниеОшибки;
		МодульМенеджерОборудованияМаркировка.ДобавитьРезультатыОтправкиЕГАИС(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("ПодготовитьДанныеОперации")
Функция Док_ПодготовитьДанныеОперации(ПараметрыПодключения, Команда, ПараметрыОперации)
	
	ШиринаСтроки = ?(ПараметрыПодключения.Свойство("ШиринаСтроки") И ПараметрыПодключения.ШиринаСтроки > 0, ПараметрыПодключения.ШиринаСтроки, 32);
	
	ДанныеОперации = Новый Структура();
	ДанныеОперации.Вставить("Результат", Истина);
	ДанныеОперации.Вставить("ТекстОшибки");
	ДанныеОперации.Вставить("ТестовыеЧеки");
	ДанныеОперации.Вставить("ТекстЧека");
	
	// Для всех операций проверяем корректность ИНН кассира.
	Если ПараметрыОперации <> Неопределено И ПараметрыОперации.Свойство("КассирИНН") И НЕ ПустаяСтрока(ПараметрыОперации.КассирИНН) Тогда
		ОписаниеОшибки = "";
		Если НЕ ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ИННСоответствуетТребованиям(ПараметрыОперации.КассирИНН, Ложь, ОписаниеОшибки) Тогда
			ТекстОшибки = НСтр("ru = 'ИНН кассира некорректен (%Ошибка%)'");
			ОписаниеОшибки = СтрЗаменить(ТекстОшибки, "%Ошибка%", ОписаниеОшибки);
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		КонецЕсли;
	КонецЕсли;
	
	// Для всех операций проверяем корректность ИНН организации.
	Если  ПараметрыОперации <> Неопределено И ПараметрыОперации.Свойство("ОрганизацияИНН") И НЕ ПустаяСтрока(ПараметрыОперации.ОрганизацияИНН) Тогда
		Если СтрДлина(ПараметрыОперации.ОрганизацияИНН) <> 10 И СтрДлина(ПараметрыОперации.ОрганизацияИНН) <> 12 Тогда
			ОписаниеОшибки = НСтр("ru = 'Неверная длина ИНН организации.'");
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		КонецЕсли;
	КонецЕсли;
	
	// Для всех операций проверяем корректность длины поля Кассир (ФФД 1021) (макс 64)
	Если  ПараметрыОперации <> Неопределено И ПараметрыОперации.Свойство("Кассир") И НЕ ПустаяСтрока(ПараметрыОперации.Кассир) Тогда
		Если СтрДлина(ПараметрыОперации.Кассир) > 64 Тогда
			ПараметрыОперации.Кассир = Лев(СокрЛП(ПараметрыОперации.Кассир),64);
		КонецЕсли;
	КонецЕсли;
	
	Если Команда = "CheckFiscalization" Тогда
		
		Если ПараметрыПодключения.ТипыОборудования.Свойство("ПринтерЧеков") И ПараметрыПодключения.ТипыОборудования.ПринтерЧеков 
				И ПараметрыОперации.Свойство("АвтономнаяККТ") И НЕ ПараметрыОперации.АвтономнаяККТ Тогда
			ОписаниеОшибки = НСтр("ru='Фискализация на принтерах чеков запрещена.'");
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		КонецЕсли;
		
		СтатусПоследнейСмены = ПолучитьСтатусПоследнейСмены(ПараметрыПодключения.ИдентификаторУстройства);
		Если ПараметрыОперации.Свойство("АвтономнаяККТ") И ПараметрыОперации.АвтономнаяККТ Тогда
			СтатусПоследнейСмены.Активна = Истина;
		КонецЕсли;
		Если Не СтатусПоследнейСмены.Активна = Истина Тогда
			ОписаниеОшибки = НСтр("ru='Кассовая смена не открыта или истекла.'");
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		ИначеЕсли 	ПараметрыОперации.Свойство("АвтономнаяККТ") И ПараметрыОперации.АвтономнаяККТ Тогда
		Иначе
			// Форматно логический контроль
			ОписаниеОшибки = "";
			Если ОбщегоНазначенияБПО.ИспользуетсяФорматноЛогическийКонтроль() Тогда
				МодульФорматноЛогическийКонтроль = ОбщегоНазначенияБПО.ОбщийМодуль("ФорматноЛогическийКонтроль");
				Если НЕ МодульФорматноЛогическийКонтроль.ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(ПараметрыОперации, 
					ПараметрыПодключения.ИдентификаторУстройства, ОписаниеОшибки) Тогда
					ДанныеОперации.Результат = Ложь;
					ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
					Возврат ДанныеОперации;
				КонецЕсли;
				МодульФорматноЛогическийКонтроль.ПривестиДанныеКТребуемомуФормату(ПараметрыОперации);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыОперации.ДокументОснование) И КонтрольФискализацииБезналичныхПлатежей() Тогда    
			ЗаполнитьДанныеПлатежныхОпераций(ПараметрыОперации);
		КонецЕсли;
		
		// Параметры фискализации чека
		ПараметрыФискализации = ПараметрыФискализацииЧека();
		ПараметрыФискализации.ТекущаяСмена = СтатусПоследнейСмены.КассоваяСмена;
		
		// Параметры регистрации ККТ
		ПараметрыРегистрации = ПараметрыРегистрацииУстройства(ПараметрыПодключения.ИдентификаторУстройства);
		ВерсияФФДККТ11 = ?(ПараметрыРегистрации.Свойство("ВерсияФФДККТ"), ПараметрыРегистрации.ВерсияФФДККТ, "1.05");
		ВерсияФФДККТ11 = ВерсияФФДККТ11 = "1.1" Или  ВерсияФФДККТ11 = "1.2"; // Признак ФФД 1.1
		
		ПараметрыОперации = ШаблонЧека(ПараметрыОперации, Перечисления.ТипыПодключаемогоОборудования.ККТ, Неопределено, ПараметрыПодключения.ИдентификаторУстройства);
		
		// Добавить текст короткого слип чека в тело фискального чека
		Если Не ПустаяСтрока(ПараметрыОперации.ТекстКороткогоСлипЧека) Тогда
			СтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека(ПараметрыОперации.ТекстКороткогоСлипЧека);
			СтрокаЧека.Выравнивание = "Центр";
			ПараметрыОперации.ПозицииЧека.Добавить(СтрокаЧека);
		КонецЕсли;
		
		ПараметрыФискализации.РегистрационныйНомерККТ = ?(ПараметрыРегистрации.Свойство("РегистрационныйНомерККТ"), ПараметрыРегистрации.РегистрационныйНомерККТ, "");
		ПараметрыФискализации.ЗаводскойНомерФН  = ?(ПараметрыРегистрации.Свойство("ЗаводскойНомерФН"), ПараметрыРегистрации.ЗаводскойНомерФН, "");
		ПараметрыФискализации.ШиринаСтроки      = ШиринаСтроки;
		ПараметрыФискализации.РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса;
		ПараметрыФискализации.ДокументОснование = ПараметрыОперации.ДокументОснование;
		ПараметрыФискализации.ИдентификаторФискальнойЗаписи = ПараметрыОперации.ИдентификаторФискальнойЗаписи;
		ПараметрыФискализации.Организация       = ПараметрыОперации.Организация;
		ПараметрыФискализации.ТорговыйОбъект    = ПараметрыОперации.ТорговыйОбъект;
		ПараметрыФискализации.ДополнительныйРеквизит = ПараметрыОперации.ДополнительныйРеквизит;  
		ПараметрыФискализации.СубъектПерсональныхДанных = ПараметрыОперации.СубъектПерсональныхДанных;
		ПараметрыФискализации.ЕстьПерсональныеДанные    = ПараметрыОперации.ЕстьПерсональныеДанные;
		Если ПараметрыОперации.Свойство("ИдентификаторОплатыПлатежнойСистемы") Тогда 
			ПараметрыФискализации.ИдентификаторОплатыПлатежнойСистемы = ПараметрыОперации.ИдентификаторОплатыПлатежнойСистемы;
		КонецЕсли;
		Если ПараметрыОперации.Свойство("ТипПлатежнойСистемы") Тогда 
			ПараметрыФискализации.ТипПлатежнойСистемы = ПараметрыОперации.ТипПлатежнойСистемы;
		КонецЕсли;
		Если ПараметрыОперации.Свойство("КорректируемыйДокумент") Тогда 
			ПараметрыФискализации.КорректируемыйДокумент = ПараметрыОперации.КорректируемыйДокумент;
		КонецЕсли;
		ПараметрыФискализации.Кассир       = ПараметрыОперации.Кассир;
		ПараметрыФискализации.КассирИНН    = ПараметрыОперации.КассирИНН;
		ПараметрыФискализации.Электронно   = ПараметрыОперации.Электронно;
		ПараметрыФискализации.Отправляет1СSMS   = ПараметрыОперации.Отправляет1СSMS;
		Если ПараметрыОперации.Отправляет1СSMS Тогда
			ПараметрыФискализации.ПокупательНомер = ПараметрыОперации.ПокупательНомер;
		КонецЕсли;
		ПараметрыФискализации.Отправляет1СEmail = ПараметрыОперации.Отправляет1СEmail;
		Если ПараметрыОперации.Отправляет1СEmail Тогда
			ПараметрыФискализации.ПокупательEmail = ПараметрыОперации.ПокупательEmail;
		КонецЕсли;
		ПараметрыФискализации.ВерсияФФДККТ11    = ВерсияФФДККТ11;
		ПараметрыФискализации.ЕдиныйЧек         = ПараметрыОперации.ЕдиныйЧек;
		ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек;      
		
		// Формирование XML
		СформироватьXMLПакетДляФискализацияЧека(ПараметрыОперации, ПараметрыФискализации);   
		
		Если ПараметрыФискализации.ЕстьПерсональныеДанные Тогда
			Если ПустаяСтрока(ПараметрыФискализации.ДатаВремяЧека) Тогда
				ДатаВремяЧека = ОбщегоНазначенияБПО.ДатаСеанса();
			Иначе
				ДатаВремяЧека = ПараметрыФискализации.ДатаВремяЧека;
			КонецЕсли;
			СведенияОПокупателе = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПерсональныеДанныеПокупателя();
			ПараметрыФискализации.ТипПерсональныхДанных = ПараметрыОперации.ТипПерсональныхДанных;
			МенеджерОборудованияВызовСервераПереопределяемый.ОбработкаЗаполненияПерсональныхДанных(СведенияОПокупателе, ПараметрыФискализации.СубъектПерсональныхДанных, 
				ПараметрыФискализации.ТипПерсональныхДанных, ДатаВремяЧека);
			СформироватьXMLПакетДляФискализацияЧека(ПараметрыОперации, ПараметрыФискализации, Истина, СведенияОПокупателе, ПараметрыФискализации.ТипПерсональныхДанных);
		КонецЕсли;
		
		ПараметрыФискализации.ТекущееСостояние.ПараметрыXML = ПолучитьXMLПакетДляОперации(ПараметрыОперации, ПараметрыПодключения.РевизияИнтерфейса);
			
		Если ЗначениеЗаполнено(ПараметрыОперации.УстройствоПечати) 
			И (ПараметрыПодключения.ТипыОборудования.Свойство("ПринтерЧеков") И НЕ ПараметрыПодключения.ТипыОборудования.ПринтерЧеков) 
			ИЛИ (ПараметрыОперации.Свойство("АвтономнаяККТ") И ПараметрыОперации.АвтономнаяККТ) Тогда
			
			Шаблон = ШаблоныФискальныхДокументов.ШаблонКассовыйЧек(ШиринаСтроки, ПараметрыОперации);
			ТекстЧека = ШаблоныФискальныхДокументов.ВывестиКакТекст(Шаблон);
			ПараметрыФискализации.КопияЧека = ПолучитьXMLПакетДляТекста(ТекстЧека, ПараметрыПодключения.РевизияИнтерфейса);
			ПараметрыФискализации.ТекстЧека = ТекстЧека;
			
		КонецЕсли;
		
		Если ПараметрыОперации.ПакетДокументов <> Неопределено И ПараметрыОперации.ПакетДокументов.Количество() > 0 Тогда
			
			Если ПараметрыФискализации.ДополнительныеДокументы = Неопределено Тогда
				ПараметрыФискализации.ДополнительныеДокументы = Новый Массив();
			КонецЕсли;
			
			Для Каждого ДополнительныйДокумент ИЗ ПараметрыОперации.ПакетДокументов Цикл
				ТекстПечати = ПолучитьXMLПакетДляТекста(ДополнительныйДокумент.Ключ, ПараметрыПодключения.РевизияИнтерфейса);
				ПараметрыФискализации.ДополнительныеДокументы.Добавить(Новый Структура("ТекстПечати, УстройствоПечати" , ТекстПечати, ДополнительныйДокумент.Значение));
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПараметрыОперации.НефискальныеДокументы <> Неопределено И ПараметрыОперации.НефискальныеДокументы.Количество() > 0 Тогда
			Если ПараметрыФискализации.ТестовыеЧеки = Неопределено Тогда
				ПараметрыФискализации.ТестовыеЧеки = Новый Массив();
			КонецЕсли;
				ЗаполнитьXMLПакетыДляТекстовогоДокумента(
				ПараметрыФискализации.ТестовыеЧеки, 
				ПараметрыОперации.НефискальныеДокументы, 
				ПараметрыПодключения, 
				ШиринаСтроки);
		КонецЕсли;
		
		Для Каждого Позиция Из ПараметрыОперации.ПозицииЧека Цикл
			Если Позиция.Свойство("ФискальнаяСтрока") Тогда
				ШтрихкодBase64 = ?(ЗначениеЗаполнено(Позиция.ШтрихкодBase64), 
					Позиция.ШтрихкодBase64, 
					ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64(Позиция.Штрихкод));
				Если ЗначениеЗаполнено(ШтрихкодBase64) Тогда
					
					ДанныеПродукции = Новый Структура;
					ДанныеПродукции.Вставить("Наименование", Позиция.Наименование);
					ПараметрыФискализации.ШтрихкодыПродукции.Вставить(ШтрихкодBase64, ДанныеПродукции);
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Возврат ПараметрыФискализации;
			
	ИначеЕсли Команда = "PrintReceiptCorrection" Тогда
		
		Если ПараметрыПодключения.ТипыОборудования.Свойство("ПринтерЧеков") И ПараметрыПодключения.ТипыОборудования.ПринтерЧеков 
				И ПараметрыОперации.Свойство("АвтономнаяККТ") И НЕ ПараметрыОперации.АвтономнаяККТ Тогда
			ОписаниеОшибки = НСтр("ru='Фискализация на принтерах чеков запрещена.'");
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		КонецЕсли;
		
		ПараметрыФискализации = ПараметрыФискализацииЧека();              
		// Параметры регистрации ККТ
		ПараметрыРегистрации = ПараметрыРегистрацииУстройства(ПараметрыПодключения.ИдентификаторУстройства); 
		ВерсияФФДККТ11 = ?(ПараметрыРегистрации.Свойство("ВерсияФФДККТ"), ПараметрыРегистрации.ВерсияФФДККТ, "1.05");
		ВерсияФФДККТ11 = ВерсияФФДККТ11 = "1.1" Или ВерсияФФДККТ11 = "1.2"; // Признак ФФД 1.1
		
		Если (ПараметрыПодключения.РевизияИнтерфейса < 3000 И ПараметрыОперации.НеприменениеККТ) 
			И (ПараметрыОперации.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств 
			Или ПараметрыОперации.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств) Тогда
			ПараметрыФискализации.Результат = Ложь;
			ПараметрыФискализации.ТекстОшибки = НСтр("ru='Для данного типа расчета нельзя сформировать чек коррекции для данного ККТ.'");
			Возврат ПараметрыФискализации;
		КонецЕсли;    
		
		// Параметры фискализации чека
		ПараметрыФискализации.НеприменениеККТ   = ПараметрыОперации.НеприменениеККТ;
		ПараметрыФискализации.Кассир            = ПараметрыОперации.Кассир;
		ПараметрыФискализации.Электронно        = ПараметрыОперации.Электронно;
		ПараметрыФискализации.Отправляет1СSMS   = ПараметрыОперации.Отправляет1СSMS;
		ПараметрыФискализации.Отправляет1СEmail = ПараметрыОперации.Отправляет1СEmail;
		ПараметрыФискализации.Организация       = ПараметрыОперации.Организация;
		ПараметрыФискализации.ТорговыйОбъект    = ПараметрыОперации.ТорговыйОбъект;
		ПараметрыФискализации.ДополнительныйРеквизит = ПараметрыОперации.ДополнительныйРеквизит;  
		ПараметрыФискализации.ВерсияФФДККТ11    = ВерсияФФДККТ11; 
		ПараметрыФискализации.ЕдиныйЧек         = ПараметрыОперации.ЕдиныйЧек;
		ПараметрыФискализации.РегистрационныйНомерККТ = ?(ПараметрыРегистрации.Свойство("РегистрационныйНомерККТ"), ПараметрыРегистрации.РегистрационныйНомерККТ, "");
		ПараметрыФискализации.ЗаводскойНомерФН  = ?(ПараметрыРегистрации.Свойство("ЗаводскойНомерФН"), ПараметрыРегистрации.ЗаводскойНомерФН, "");
		ПараметрыФискализации.ШиринаСтроки      = ШиринаСтроки;
		ПараметрыФискализации.РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса;
		ПараметрыФискализации.ДокументОснование = ПараметрыОперации.ДокументОснование;
		ПараметрыФискализации.ИдентификаторФискальнойЗаписи  = ПараметрыОперации.ИдентификаторФискальнойЗаписи;    
		ПараметрыФискализации.СформироватьЧекКоррекцииСторно = ПараметрыОперации.СформироватьЧекКоррекцииСторно;
		Если ПараметрыОперации.Свойство("КорректируемыйДокумент") Тогда 
			ПараметрыФискализации.КорректируемыйДокумент = ПараметрыОперации.КорректируемыйДокумент;
		КонецЕсли;
		
		Если ПараметрыОперации.НеприменениеККТ Тогда    
			ПараметрыФискализации.СформироватьЧекКоррекцииСторно = Ложь;   
		КонецЕсли; 
		
		Если НЕ ПараметрыФискализации.СформироватьЧекКоррекцииСторно Тогда 
			// Сценарий 1 - неприменение ККТ. 
			Если ПараметрыОперации.НеприменениеККТ И ЗначениеЗаполнено(ПараметрыОперации.КорректируемыйДокумент) Тогда
				ПараметрыФискализации.Результат = Ложь;
				ПараметрыФискализации.ТекстОшибки = НСтр("ru='Чек коррекции «неприменение ККТ» нельзя сформировать для фискализированного ранее чека.'");
				Возврат ПараметрыФискализации;
			КонецЕсли;                        
			
			ПараметрыФискализации.ЧекКоррекцииНаККТ = Истина;   
			Если НЕ ПараметрыФискализации.НеприменениеККТ И НЕ ПараметрыФискализации.СформироватьЧекКоррекцииСторно И НЕ ВерсияФФДККТ11 Тогда
				ПараметрыФискализации.ЧекКоррекцииНаККТ = Ложь;
				// НеприменениеККТ не используется, СформироватьЧекКоррекцииСторно содержит Ложь
				// ВерсияФФДККТ11 содержит Ложь, ФФД меньше 1.1
				ЗаменитьТипыОплатыПриКоррекции(ПараметрыОперации, Неопределено);
			КонецЕсли;                                                                                   
			ПараметрыФискализации.ТипДокумента = ?(ПараметрыФискализации.ЧекКоррекцииНаККТ, Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции, Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек);
			СформироватьXMLПакетДляФискализацияЧека(ПараметрыОперации, ПараметрыФискализации);
			#Вставка
			Если НЕ ПараметрыОперации.НеприменениеККТ Тогда
				ТипыДокументов = Новый Массив();
				ТипыДокументов.Добавить(Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек); // Для ФФД 1.05
				ТипыДокументов.Добавить(Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции); // Для ФФД 1.1
				
				КорректируемыйДокументОперация = ДанныеФискальнойОперации(ПараметрыОперации.КорректируемыйДокумент, ,ТипыДокументов); 
				
				Если КорректируемыйДокументОперация = Неопределено Тогда
					ПараметрыФискализации.Результат = Ложь; 
					ПараметрыФискализации.ТекстОшибки = НСтр("ru='Не найден ранее фискализированный кассовый чек для формирования чека коррекции.'");
					Возврат ПараметрыФискализации;
				КонецЕсли;
				
				ФискальныйПризнак = КорректируемыйДокументОперация.ФискальныйПризнак;
				
				// Формируем кассовый чек с корректными реквизитами.
				ПараметрыФискализации.ДополнительныйРеквизит = ФискальныйПризнак;  
				ПараметрыОперации.ДополнительныйРеквизит = ФискальныйПризнак;
				
				//// Формируем параметры фискализации для сторнирующего чека коррекции.
				//ДанныеСторноЧекаXML = КорректируемыйДокументОперация.ДанныеXML.Получить();
				//ОбщиеПараметрыСторно = ЗагрузитьДанныеФискализацииИзXML(ДанныеСторноЧекаXML);
				//ОбщиеПараметрыСторно.ДополнительныйРеквизит = ФискальныйПризнак;
				//
				//ЗаполнитьЗначенияСвойств(ОбщиеПараметрыСторно.ДанныеКоррекции, ПараметрыОперации.ДанныеКоррекции);
				//
				//ПараметрыФискализацииСторно = ПараметрыФискализацииЧека();
				//ЗаполнитьЗначенияСвойств(ПараметрыФискализацииСторно, ПараметрыФискализации);
				//
				//СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметрыСторно, ПараметрыФискализацииСторно);
				//
				//Возврат ПараметрыФискализацииСторно;
			КонецЕсли;
			#КонецВставки 
		Иначе
			// Сценарий 2 - исправление нарушений применения ККТ.
			Если ПустаяСтрока(ПараметрыОперации.КорректируемыйДокумент) Тогда
				ПараметрыФискализации.Результат = Ложь; 
				ПараметрыФискализации.ТекстОшибки = НСтр("ru='Корректируемый документ не указан для формирования чека коррекции.'");
				Возврат ПараметрыФискализации;
			КонецЕсли;       
			
			ТипыДокументов = Новый Массив();
			ТипыДокументов.Добавить(Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек); // Для ФФД 1.05
			ТипыДокументов.Добавить(Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции); // Для ФФД 1.1
			
			КорректируемыйДокументОперация = ДанныеФискальнойОперации(ПараметрыОперации.КорректируемыйДокумент, ,ТипыДокументов); 
			Если КорректируемыйДокументОперация = Неопределено Тогда
				ПараметрыФискализации.Результат = Ложь; 
				ПараметрыФискализации.ТекстОшибки = НСтр("ru='Не найден ранее фискализированный кассовый чек для формирования чека коррекции.'");
				Возврат ПараметрыФискализации;
			КонецЕсли;            
			
			// В зависимости от версии ФФД формируем "Кассовый чек" или "Кассовый чек коррекции".   
			ПараметрыФискализации.ЧекКоррекцииНаККТ = ВерсияФФДККТ11;
			ТипФискальногоДокументов = ?(ПараметрыФискализации.ЧекКоррекцииНаККТ, Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции, Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек);
			// Дополнительный реквизит чека - фискальным признаком документа основания (по которому идет коррекция).
			ФискальныйПризнак = КорректируемыйДокументОперация.ФискальныйПризнак;
			
			// Формируем кассовый чек с корректными реквизитами.
			ПараметрыОперации.ДополнительныйРеквизит = ФискальныйПризнак;
			ПараметрыФискализации.ДополнительныйРеквизит = ФискальныйПризнак;  
			ПараметрыФискализации.ТипДокумента = ТипФискальногоДокументов;
			
			// Формируем параметры фискализации для сторнирующего чека коррекции.
			ДанныеСторноЧекаXML = КорректируемыйДокументОперация.ДанныеXML.Получить();    
			// Чека коррекции не содержат данные о маркировке
			ОбщиеПараметрыСторно = ЗагрузитьДанныеФискализацииИзXML(ДанныеСторноЧекаXML, Ложь);
			ОбщиеПараметрыСторно.ДополнительныйРеквизит = ФискальныйПризнак;
			
			ЗаполнитьЗначенияСвойств(ОбщиеПараметрыСторно.ДанныеКоррекции, ПараметрыОперации.ДанныеКоррекции);
			ПодготовитьЧекКоррекции(ПараметрыОперации, ОбщиеПараметрыСторно, ВерсияФФДККТ11);
			// Для формата 1.05
			Если НЕ ВерсияФФДККТ11 Тогда            
				ЗаменитьТипыОплатыПриКоррекции(ПараметрыОперации, ОбщиеПараметрыСторно);
			КонецЕсли;  
			
			СформироватьXMLПакетДляФискализацияЧека(ПараметрыОперации, ПараметрыФискализации);
			
			ПараметрыФискализацииСторно = ПараметрыФискализацииЧека();
			ЗаполнитьЗначенияСвойств(ПараметрыФискализацииСторно, ПараметрыФискализации);
			СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметрыСторно, ПараметрыФискализацииСторно);
			
			ПараметрыФискализации.ЧекКоррекцииСторно = ПараметрыФискализацииСторно;
			
		КонецЕсли;
	
		Возврат ПараметрыФискализации;
		
	ИначеЕсли Команда = "PrintCheckCopy" Тогда            
		
		Аппаратно = ?(ПараметрыОперации.Свойство("Аппаратно"), ПараметрыОперации.Аппаратно, Истина);
		
		Если Не Аппаратно Тогда 
			ДокументСсылка = ?(ПараметрыОперации.Свойство("ДокументСсылка"), ПараметрыОперации.ДокументСсылка, Неопределено); 
			ФискальныйПризнак = ?(ПараметрыОперации.Свойство("ФискальныйПризнак"), ПараметрыОперации.ФискальныйПризнак, Неопределено); 
			
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) И ПустаяСтрока(ФискальныйПризнак) Тогда
				ТекстОшибки = НСтр("ru = 'Не указаны параметры печати копии документа.'");
				ДанныеОперации.Результат = Ложь;
				ДанныеОперации.ТекстОшибки = ТекстОшибки;
				Возврат ДанныеОперации;
			КонецЕсли;
				
			ФискальнаяОперация = ДанныеФискальнойОперации(ДокументСсылка, Неопределено, Неопределено, Неопределено, ФискальныйПризнак);
			Если ФискальнаяОперация = Неопределено Тогда
				ТекстОшибки = НСтр("ru = 'Фискальный документ для печати копии не найден.'");
				ДанныеОперации.Результат = Ложь;
				ДанныеОперации.ТекстОшибки = ТекстОшибки;
				Возврат ДанныеОперации;
			КонецЕсли;
			
			ПараметрыQRКода = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыQRКодаЧекаККТ();
			ПараметрыQRКода.ДатаВремяРасчета  = ФискальнаяОперация.Дата;
			ПараметрыQRКода.СуммаРасчета      = ФискальнаяОперация.Сумма;
			ПараметрыQRКода.ФискальныйПризнак = ФискальнаяОперация.ФискальныйПризнак;
			ПараметрыQRКода.ПризнакРасчета    = ФискальнаяОперация.ТипРасчета;
			ПараметрыQRКода.НомерФискальногоНакопителя = ФискальнаяОперация.ЗаводскойНомерФН;
			ПараметрыQRКода.НомерФискальногоДокумента  = ФискальнаяОперация.НомерЧекаККМ;
			QRКодЧекаККТ = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.СформироватьQRКодЧекаККТ(ПараметрыQRКода);
			
			ДанныеXML = ФискальнаяОперация.ДанныеXML.Получить();    
			ПараметрыКопииЧека = ЗагрузитьДанныеФискализацииИзXML(ДанныеXML);           
			ПараметрыКопииЧека.ДатаВремя = ФискальнаяОперация.Дата; 
			
			ПараметрыПечати  = ШаблоныФискальныхДокументов.ПараметрыШаблонаФискальногоДокумента();
			ПараметрыПечати.Заголовок = НСтр("ru = 'КОПИЯ ЧЕКА'");;
			ПараметрыПечати.ВыводитьФискальнуюИнформацию = Ложь;
			Шаблон    = ШаблоныФискальныхДокументов.ШаблонКассовыйЧек(ПараметрыПодключения.ШиринаСтроки, ПараметрыКопииЧека, ФискальнаяОперация, ПараметрыПечати);
			ТекстЧека = ШаблоныФискальныхДокументов.ВывестиКакТекст(Шаблон); 
			
			ТекстЧека = ПараметрыПечати.Заголовок + Символы.ПС + ТекстЧека;
			ТекстЧека = ТекстЧека  + Символы.ПС + ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ВыстроитьПоля(НСтр("ru = 'РН ККТ:'"), ФискальнаяОперация.РегистрационныйНомерККТ, ШиринаСтроки);
			ТекстЧека = ТекстЧека  + Символы.ПС + ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ВыстроитьПоля(НСтр("ru = 'ФН №:'")  , ФискальнаяОперация.ЗаводскойНомерФН, ШиринаСтроки);
			ТекстЧека = ТекстЧека  + Символы.ПС + ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ВыстроитьПоля(НСтр("ru = 'ФД №:'")  , Формат(ФискальнаяОперация.НомерЧекаККМ,"ЧГ="), ШиринаСтроки);
			ТекстЧека = ТекстЧека  + Символы.ПС + ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ВыстроитьПоля(НСтр("ru = 'ФП:'")    , ФискальнаяОперация.ФискальныйПризнак, ШиринаСтроки);
			ТекстЧека = ТекстЧека + Символы.ПС + "|ШтрихКод|QR|" + QRКодЧекаККТ; 
			ДанныеОперации.Вставить("ТестовыеЧеки", ПолучитьXMLПакетДляТекста(ТекстЧека, ПараметрыПодключения.РевизияИнтерфейса));     
			ДанныеОперации.ТекстЧека = ТекстЧека;

			ДанныеОперации.Вставить("ТестовыеЧеки", ПолучитьXMLПакетДляТекста(ТекстЧека, ПараметрыПодключения.РевизияИнтерфейса));   
		КонецЕсли;
		
		ДанныеОперации.Вставить("НомерЧека", ПараметрыОперации.НомерЧека);
		ДанныеОперации.Вставить("Аппаратно", Аппаратно); 
		
		Возврат ДанныеОперации;
		
	ИначеЕсли Команда = "PrintText" Тогда
		
		// Перенесено на клиент в модуль ОборудованиеЧекопечатающиеУстройстваКлиент
		
	ИначеЕсли Команда = "PrintQRCode" Тогда
		
		// Перенесено на клиент в модуль ОборудованиеЧекопечатающиеУстройстваКлиент
		
	ИначеЕсли Команда = "OpenShift"  Тогда
		
		Если ПараметрыПодключения.ТипыОборудования.Свойство("ПринтерЧеков") И ПараметрыПодключения.ТипыОборудования.ПринтерЧеков 
				И ПараметрыОперации.Свойство("АвтономнаяККТ") И НЕ ПараметрыОперации.АвтономнаяККТ Тогда
			ОписаниеОшибки = НСтр("ru='Фискализация на принтерах чеков запрещена.'");
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		КонецЕсли;
		
		ДанныеОперации = ПараметрыФискальнойОперации();
		Если ПараметрыОперации.Свойство("ДополнительныеПараметры") Тогда
			ДанныеОперации.ДополнительныеПараметры = ПараметрыОперации.ДополнительныеПараметры;
		КонецЕсли;
		 
		Если Не ПередОткрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации) Тогда
			Возврат ДанныеОперации;
		КонецЕсли;
			
		ДанныеОперации.ПараметрыXML = ПолучитьXMLПакетДляОперации(ПараметрыОперации, ПараметрыПодключения.РевизияИнтерфейса);
			
		Возврат ДанныеОперации;
		
	ИначеЕсли Команда = "CloseShift" Тогда
		
		Если ПараметрыПодключения.ТипыОборудования.Свойство("ПринтерЧеков") И ПараметрыПодключения.ТипыОборудования.ПринтерЧеков 
				И ПараметрыОперации.Свойство("АвтономнаяККТ") И НЕ ПараметрыОперации.АвтономнаяККТ Тогда
			ОписаниеОшибки = НСтр("ru='Фискализация на принтерах чеков запрещена.'");
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		КонецЕсли;
		
		ДанныеОперации = ПараметрыФискальнойОперации();
		Если ПараметрыОперации.Свойство("ДополнительныеПараметры") Тогда
			ДанныеОперации.ДополнительныеПараметры = ПараметрыОперации.ДополнительныеПараметры;
		КонецЕсли;
		
		Если Не ПередЗакрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации) Тогда
			Возврат ДанныеОперации;
		КонецЕсли;
		
		ДанныеОперации.ПараметрыXML = ПолучитьXMLПакетДляОперации(ПараметрыОперации, ПараметрыПодключения.РевизияИнтерфейса);
		
		Возврат ДанныеОперации;
		
	ИначеЕсли Команда = "ReportCurrentStatusOfSettlements" Или Команда = "GetCurrentStatus"  Тогда
		
		// Перенесено на клиент в модуль ОборудованиеЧекопечатающиеУстройстваКлиент
		
	ИначеЕсли Команда = "PrintXReport"  Тогда
		
		// Перенесено на клиент в модуль ОборудованиеЧекопечатающиеУстройстваКлиент
		
	ИначеЕсли Команда = "Encash" Тогда
		
		Если ПараметрыПодключения.ТипыОборудования.Свойство("ПринтерЧеков") И ПараметрыПодключения.ТипыОборудования.ПринтерЧеков 
				И ПараметрыОперации.Свойство("АвтономнаяККТ") И НЕ ПараметрыОперации.АвтономнаяККТ Тогда
			ОписаниеОшибки = НСтр("ru='Фискализация на принтерах чеков запрещена.'");
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		КонецЕсли;
		
		ПараметрыФискализации = ПараметрыФискализацииЧека();
		Если ПараметрыОперации.ТипИнкассации = 0 Тогда
			ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.Выемка
		Иначе
			ПараметрыФискализации.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.Внесение
		КонецЕсли;
		ПараметрыФискализации.ТипИнкассации = ПараметрыОперации.ТипИнкассации; 
		ПараметрыФискализации.ДатаВремяЧека = ОбщегоНазначенияБПО.ДатаСеанса();
		
		Если ПараметрыПодключения.ТипыОборудования.ККТ Тогда
			
			ПараметрыРегистрации = ПараметрыРегистрацииУстройства(ПараметрыПодключения.ИдентификаторУстройства);
			
			ПараметрыФискализации.РегистрационныйНомерККТ = ?(ПараметрыРегистрации.Свойство("РегистрационныйНомерККТ"), ПараметрыРегистрации.РегистрационныйНомерККТ, "");
			ПараметрыФискализации.ЗаводскойНомерФН  = ?(ПараметрыРегистрации.Свойство("ЗаводскойНомерФН"), ПараметрыРегистрации.ЗаводскойНомерФН, "");
			ПараметрыФискализации.ШиринаСтроки      = ?(ПараметрыПодключения.Свойство("ШиринаСтроки"), ПараметрыПодключения.ШиринаСтроки, 32);
			ПараметрыФискализации.РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса;
			
			Если ПараметрыОперации.Свойство("ДокументОснование") Тогда 
				ПараметрыФискализации.ДокументОснование = ПараметрыОперации.ДокументОснование;
			КонецЕсли;
			Если ПараметрыОперации.Свойство("Кассир") Тогда
				ПараметрыФискализации.Кассир = ПараметрыОперации.Кассир;
			КонецЕсли;
			Если ПараметрыОперации.Свойство("Организация") Тогда
				ПараметрыФискализации.Организация = ПараметрыОперации.Организация;
			КонецЕсли;
			Если ПараметрыОперации.Свойство("ТорговыйОбъект") Тогда
				ПараметрыФискализации.ТорговыйОбъект = ПараметрыОперации.ТорговыйОбъект;
			КонецЕсли;
			ПараметрыФискализации.СуммаЧека      = ПараметрыОперации.Сумма;
			ПараметрыФискализации.ОплатаНаличные = ПараметрыОперации.Сумма;
			ПараметрыФискализации.ДанныеЧекаXML  = ПолучитьXMLПакетДляОперации(ПараметрыОперации, ПараметрыПодключения.РевизияИнтерфейса);
			
		КонецЕсли;
		
		Возврат ПараметрыФискализации;
		
	ИначеЕсли Команда = "OperationFN" Тогда
		
		ДанныеОперации = ПараметрыФискальнойОперации();
		ДанныеОперации.Вставить("ТипОперации", ПараметрыОперации.ТипОперации);
		РевизияИнтерфейса  = ПараметрыПодключения.РевизияИнтерфейса;
		ДанныеОперации.ПараметрыXML = СформироватьТаблицуПараметровДляОперацииФН(ПараметрыОперации, РевизияИнтерфейса);
		Возврат ДанныеОперации;
		
	ИначеЕсли Команда = "RequestKM" Или Команда = "RequestKMKMNoWait" Тогда
		
		// Перенесено на клиент в модуль ОборудованиеЧекопечатающиеУстройстваКлиент
		
	ИначеЕсли Команда = "CheckKM" Тогда
		
		// Перенесено на клиент в модуль ОборудованиеЧекопечатающиеУстройстваКлиент
		
	ИначеЕсли Команда = "CheckFiscalizationPacket" Тогда
		
		СтатусПоследнейСмены = ПолучитьСтатусПоследнейСмены(ПараметрыПодключения.ИдентификаторУстройства);
		Если Не СтатусПоследнейСмены.Активна = Истина Тогда
			ОписаниеОшибки = НСтр("ru='Кассовая смена не открыта или истекла.'");
			ДанныеОперации.Результат = Ложь;
			ДанныеОперации.ТекстОшибки = ОписаниеОшибки;
			Возврат ДанныеОперации;
		КонецЕсли;
		
		ДанныеОперации = ПараметрыФискализацииЧека();       
		
		Если ПараметрыОперации <> Неопределено И ПараметрыОперации.Свойство("ДанныеЧекаXML") Тогда
			ДанныеОперации.ДанныеЧекаXML = ПараметрыОперации.ДанныеЧекаXML;
		КонецЕсли;
		
		Возврат ДанныеОперации;
		
	КонецЕсли
	
КонецФункции

&ИзменениеИКонтроль("ЗаписатьДанныеКоррекции")
Процедура Док_ЗаписатьДанныеКоррекции(ЗаписьXML, ДанныеКоррекции, РевизияИнтерфейса)
	
	НомерПредписания = ДанныеКоррекции.НомерПредписания;
	ТипКоррекции = ДанныеКоррекции.ТипКоррекции; // Тип коррекции: 0-самостоятельно, 1-по предписанию.
	
	// Приказ Федеральной налоговой службы от 26.03.2025 № ЕД-7-20/236@
	// Реквизит Номер предписания налогового органа (тег 1179) теперь обязателен только при коррекции по требованию ФНС
	Если РевизияИнтерфейса >= 4006 И ДанныеКоррекции.ТипКоррекции = 0 Тогда
		НомерПредписания = ""
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CorrectionData");
	ЗаписьXML.ЗаписатьАтрибут("Type",  XMLСтрока(ТипКоррекции));
	Если Не ПустаяСтрока(ДанныеКоррекции.ДатаКоррекции) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Date",  XMLСтрока(НачалоДня(ДанныеКоррекции.ДатаКоррекции)));
	КонецЕсли;
	#Удаление
	Если Не ПустаяСтрока(НомерПредписания) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Number",  XMLСтрока(НомерПредписания));
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеКоррекции.ОписаниеКоррекции) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Description",  XMLСтрока(ДанныеКоррекции.ОписаниеКоррекции));
	КонецЕсли;
	#КонецУдаления
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры
