
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ЦельПосещения") Тогда
		УстановитьВидимостьПриСозданииИзРабочегоМестаОпрератораКПП(Параметры.ЗначенияЗаполнения.ЦельПосещения);
	КонецЕсли;
	
	ПараметрыИзСправочникаСотрудники = ПолучитьПараметрыИзСправочникаСотрудники(Объект.Автор); 
	
	Если ПараметрыИзСправочникаСотрудники.Количество() = 0 Тогда 
		Сообщить("Не найден сотрудник");
		Отказ = Истина;
		Возврат;
	Иначе
		ПараметрыСотрудника = ПараметрыИзСправочникаСотрудники[0];

	КонецЕсли;
	
	УстановитьДоступность(ПараметрыСотрудника);
	УстановитьОграниченияВыбораЗоныДоступа(ПараметрыСотрудника.СписокЗон);
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ПараметрыСотрудника.ЗапретитьСоздаватьПропуск = Истина И НЕ РольДоступна("ПолныеПрава") Тогда	
			Сообщить("Запрещено создавать пропуск");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	КорректировкаДатыОкончанияПропуска(Дата(Элемент.ТекстРедактирования));	
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);

	ОбщегоНазначенияУТКлиент.РедактироватьПериод(Объект, 
		Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания"), Оповещение);
		
КонецПроцедуры

&НаКлиенте
Процедура НапечататьПропуск(Команда)
	
	Если НЕ(ЗначениеЗаполнено(Объект.ФИО) ИЛИ ЗначениеЗаполнено(Объект.ВидТранспортногоСредства) ИЛИ ЗначениеЗаполнено(Объект.НаименованиеОрганизации)) Тогда
		Сообщить("Не заполнены данные лица");
		Возврат;
	КонецЕсли;

	ПровестиДокумент();
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.Пропуск",
			"ПропускЭтикетка",
			Объект.Ссылка,
			Неопределено,
			Неопределено);

	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КорректировкаДатыОкончанияПропуска(ВыбраннаяДата)
	
	Если Объект.РазрешеноУстанавливатьПериодНеПозднее > 0 Тогда
		МакРазрешеннаяДата = Объект.ДатаНачала + 86400 * Объект.РазрешеноУстанавливатьПериодНеПозднее;
		Если МакРазрешеннаяДата <> ТекущаяДата() И МакРазрешеннаяДата < ВыбраннаяДата Тогда
			 Объект.ДатаОкончания = МакРазрешеннаяДата;
			 Сообщить("Действует ограничение выбора даты, максимальная разрешенная дата " + МакРазрешеннаяДата);
		 КонецЕсли;	
	 КонецЕсли;
	 
	Если Объект.ДатаОкончания <> Дата(1,1,1) И Час(Объект.ДатаОкончания) = 0 И Минута(Объект.ДатаОкончания) = 0 И Секунда(Объект.ДатаОкончания) = 0 Тогда
		Объект.ДатаОкончания = Дата(Год(Объект.ДатаОкончания), Месяц(Объект.ДатаОкончания), День(Объект.ДатаОкончания), 22, 0, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		КорректировкаДатыОкончанияПропуска(Результат.ДатаОкончания);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДокумент()
	ПараметрЗаписи =  Новый Структура;
	ПараметрЗаписи.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	ЭтаФорма.Записать(ПараметрЗаписи);
	
	//Добавляем QR-код 
	Объект.QRкод = ГенерацияШтрихкода.СформироватьQRКод(Объект.Ссылка);
	ЭтаФорма.Записать(ПараметрЗаписи);
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность(ПараметрыСотрудника)
	
	Элементы.Подразделение.Доступность = ПараметрыСотрудника.ИзменятьПодразделение;
	Элементы.ТипПропуска.Доступность = ПараметрыСотрудника.ИзменятьТипПропуска;     
	Элементы.ЦельПосещения.Доступность = ПараметрыСотрудника.ИзменятьЦель;
	Элементы.ТребуетсяПодтверждение.Доступность = ПараметрыСотрудника.ИзменятьТребуетПодтверждение;

КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияВыбораЗоныДоступа(СписокЗонДоступаСотрудника)
	
	мПараметрыВыбора = Новый Массив();
 
	Если СписокЗонДоступаСотрудника.Количество() > 0 Тогда	
		мДоступныеЗоны = Новый Массив();
		
		Для Каждого Стр Из СписокЗонДоступаСотрудника Цикл
			мДоступныеЗоны.Добавить(Стр.ЗонаДоступа);
		КонецЦикла;
		
		Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(мДоступныеЗоны));		
		мПараметрыВыбора.Добавить(Параметр);
		ЭтаФорма.Элементы.Доступ.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);			


	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПриСозданииИзРабочегоМестаОпрератораКПП(ЦельПосещения)
	
	Элементы.ГруппаОбщее.Видимость = Ложь;
	Если ЦельПосещения = Справочники.ЦелиПосещения.ВывозМусора ИЛИ ЦельПосещения = Справочники.ЦелиПосещения.Аутсорс ИЛИ ЦельПосещения = Справочники.ЦелиПосещения.Собеседование Тогда
		Элементы.НаименованиеОрганизации.Видимость = Ложь;
	КонецЕсли;
	Если ЦельПосещения = Справочники.ЦелиПосещения.Аутсорс ИЛИ ЦельПосещения = Справочники.ЦелиПосещения.Собеседование Тогда  
		Элементы.ВидТранспортногоСредства.Видимость = Ложь;
	КонецЕсли;
	Элементы.ГруппаКомментарий.Видимость = Ложь;
	Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
	Элементы.НапечататьПропуск.Видимость = Истина;
	
	Если ЦельПосещения = Справочники.ЦелиПосещения.КлиентПрочее Тогда 
		ЗаголовокБыстрогоПропуска = "Клиент";
	Иначе
		ЗаголовокБыстрогоПропуска = ЦельПосещения;
	КонецЕсли;	
	Элементы.НазваниеБыстрогоПропуска.Заголовок = ЗаголовокБыстрогоПропуска;
	Элементы.НазваниеБыстрогоПропуска.Видимость = Истина;

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыИзСправочникаСотрудники(Пользователь) Экспорт
	
	Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователь);
	
	Запрос = Новый Запрос;
	Если Сотрудник.Индивидуально Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ЗапретитьСоздаватьПропуск КАК ЗапретитьСоздаватьПропуск,
		|	Сотрудники.ИзменятьПодразделение КАК ИзменятьПодразделение,
		|	Сотрудники.ИзменятьТипПропуска КАК ИзменятьТипПропуска,
		|	Сотрудники.ИзменятьЦель КАК ИзменятьЦель,
		|	Сотрудники.ИзменятьТребуетПодтверждение КАК ИзменятьТребуетПодтверждение,
		|	Сотрудники.СписокЗон.(
		|		Ссылка КАК Ссылка,
		|		ЗонаДоступа КАК ЗонаДоступа
		|	) КАК СписокЗон
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Иначе 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Отделы.ЗапретитьСоздаватьПропуск КАК ЗапретитьСоздаватьПропуск,
		|	Отделы.ИзменятьПодразделение КАК ИзменятьПодразделение,
		|	Отделы.ИзменятьТипПропуска КАК ИзменятьТипПропуска,
		|	Отделы.ИзменятьЦель КАК ИзменятьЦель,
		|	Отделы.ИзменятьТребуетПодтверждение КАК ИзменятьТребуетПодтверждение,
		|	Отделы.СписокЗон.(
		|		Ссылка КАК Ссылка,
		|		ЗонаДоступа КАК ЗонаДоступа
		|	) КАК СписокЗон
		|ИЗ
		|	Справочник.Отделы КАК Отделы
		|ГДЕ
		|	Отделы.Ссылка = &Отдел";
		Запрос.УстановитьПараметр("Отдел", Сотрудник.Отдел);
	КонецЕсли;
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И 
		НЕ(ЗначениеЗаполнено(Объект.ФИО) ИЛИ ЗначениеЗаполнено(Объект.ВидТранспортногоСредства) ИЛИ ЗначениеЗаполнено(Объект.НаименованиеОрганизации)) Тогда
			Сообщить("Не заполнены данные лица");
			Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		ПровестиДокумент();
КонецПроцедуры 
	


#КонецОбласти





