#Область ОбработчикиСобытийФормы

&НаСервере
&После ("ПриСозданииНаСервере")
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
		если Объект.ДокументыОснования.Количество()=0 тогда 
			Объект.ДатаВыставления = ""; 
		конецесли;
		если Параметры.ключ.пустая() тогда
			Объект.ПредставлениеНомера="";
		конецесли;	
	
КонецПроцедуры   
	
&НаКлиенте
&ИзменениеИКонтроль ("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СобытияФормКлиент.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = НСтр("ru = 'Поле ""Дата выставления"" не заполнено'");
	#Удаление
	Если Выставлен И НЕ ЗначениеЗаполнено(Объект.ДатаВыставления) Тогда 
	#КонецУдаления
	#Вставка
	Если Выставлен И НЕ ЗначениеЗаполнено(Объект.ДатаВыставления) и Объект.ДокументыОснования.Количество()>0 Тогда  
		УстановитьПредставлениеНомера();
	#КонецВставки
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаВыставления","Объект",Отказ);
	ИначеЕсли НЕ Выставлен Тогда
		Объект.ДатаВыставления = '00010101';
		Объект.ВыставленВЭлектронномВиде = Ложь;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
