
&ИзменениеИКонтроль("ОчиститьНеиспользуемыеПравилаПродаж")
Процедура Док_ОчиститьНеиспользуемыеПравилаПродаж(Объект)

	Если Не Объект.ОграничиватьРучныеСкидки Тогда
		Объект.ПроцентРучнойСкидки = 0;
		Объект.ПроцентРучнойНаценки = 0;

		Если ТипЗнч(Объект) <> Тип("СправочникОбъект.НастройкиПродажДляПользователей") Тогда
			МассивСтрокКУдалению = Новый Массив();
			Для Каждого СтрокаТЧ Из Объект.ЦеновыеГруппы Цикл
				СтрокаТЧ.ПроцентРучнойСкидки  = 0;
				СтрокаТЧ.ПроцентРучнойНаценки = 0;
#Удаление
				Если СтрокаТЧ.ВидЦен.Пустая() Тогда
					МассивСтрокКУдалению.Добавить(СтрокаТЧ);
				КонецЕсли;
#КонецУдаления
#Вставка
				Если СтрокаТЧ.ВидЦен.Пустая() и не ДопМодуль.НовоеЦенообразование() Тогда
					МассивСтрокКУдалению.Добавить(СтрокаТЧ);
				КонецЕсли;
				Если СтрокаТЧ.ГруппаВидовЦен.Пустая() и ДопМодуль.НовоеЦенообразование() Тогда
					МассивСтрокКУдалению.Добавить(СтрокаТЧ);
				КонецЕсли;
#КонецВставки
			КонецЦикла;

			Для Каждого Элемент Из МассивСтрокКУдалению Цикл
				Объект.ЦеновыеГруппы.Удалить(Элемент);
			КонецЦикла;
		Иначе
			Объект.ЦеновыеГруппы.Очистить();
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
