
&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("Номенклатура", Номенклатура);
	ПараметрыОткрытия.Вставить("Склад", Склад);
	ПараметрыОткрытия.Вставить("Родитель", "ФормаБлокировки");
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект, , , , ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ХарактеристикаНоменклатуры = Значение;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.Номенклатура;
	Если Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
		Элементы.Характеристика.Видимость = Ложь;
	КонецЕсли;
	Если НЕ РольДоступна("ДобавлениеИзменениеБлокировкиДвиженияТоваров") И НЕ ЭтоРСН() И НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Склад.Доступность = Ложь;
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
    Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователи.ТекущийПользователь());
    Склад = ?(ЗначениеЗаполнено(Сотрудник), Сотрудник.Склад, Справочники.Склады.ПустаяСсылка());
	
	ОграничениеДоступностиОстатков = АльтерраОбщегоНазначения.ПолучитьОграничениеДоступностиОстатков();
	ПравоПросмотраОстатков = ?(ОграничениеДоступностиОстатков, АльтерраОбщегоНазначения.ЕстьПравоПросмотраОстатков(Пользователи.ТекущийПользователь()), Истина); 
	
	Остатки = Альтерра_СкладСервер.ПолучитьОстатки(Номенклатура, ХарактеристикаНоменклатуры, Склад, Истина);
	
	Если Не ПравоПросмотраОстатков Тогда
		Элементы.Остатки.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ПричинаБлокировки") Тогда
		ПричинаБлокировки = Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(Параметры.ПричинаБлокировки, Истина);
	Иначе
		ПричинаБлокировки = Справочники.ПричиныБлокировкиДвиженияТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор("6344630e-7e01-11ea-80e2-002590e168ab")); // Пересортица
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОстатки();
КонецПроцедуры

#Область СозданиеБлокировки

&НаКлиенте
Процедура СоздатьБлокировку(Команда)
	Если Количество = 0 И НЕ ПодОстаток Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для создания блокировки укажите количество !!!";
		Сообщение.Поле = "Количество";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	Если СоздатьБлокировкуДвиженияТоваров(ПричинаБлокировки, "Заблокировано из карточки номенклатуры") Тогда 
		ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.6, Истина);
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОжидания()
	ОтключитьОбработчикОжидания("ОбработкаОжидания"); 
	Закрыть();		
КонецПроцедуры

&НаСервере
Функция СоздатьБлокировкуДвиженияТоваров(ПричинаБлокировки, Комментарий)
	УстановитьПривилегированныйРежим(Истина);

	ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата",  ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Склад", Склад);
	ПараметрыЗаполнения.Вставить("ДокументОснование", Неопределено);
	ПараметрыЗаполнения.Вставить("Статус", Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
	ПараметрыЗаполнения.Вставить("ПричинаБлокировки", ПричинаБлокировки);
	//изменения: передается уже объект ПричинаБлокировки
	//ПараметрыЗаполнения.Вставить("ПричинаБлокировки",Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(ПричинаБлокировки));
	ПараметрыЗаполнения.Вставить("Комментарий", Комментарий + ": " + ЭтотОбъект.Комментарий);
	ПараметрыЗаполнения.Вставить("Товары", ПолучитьТЗТовары());
	
	Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировки,ПараметрыЗаполнения, Истина);
	
	УстановитьПривилегированныйРежим(Ложь);    

	Возврат ДокументБлокировки.Проведен;
	
КонецФункции

&НаСервере
Функция ПолучитьТЗТовары()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Характеристика");
	ТЗ.Колонки.Добавить("КоличествоУпаковок");
	НС = ТЗ.Добавить();
	НС.Номенклатура = Номенклатура;
	НС.Характеристика = ХарактеристикаНоменклатуры;
	НС.КоличествоУпаковок = Количество;
	Возврат ТЗ;
КонецФункции

#КонецОбласти

#Область ОбновлениеОстатковНаФорме

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	ОбновитьОстатки();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ПодОстатокПриИзменении(Элемент)
	Если ПодОстаток Тогда
		Элементы.Количество.Доступность = Ложь;
		Элементы.Количество.Видимость = ПравоПросмотраОстатков;
		Количество = ПолучитьОстатки(Номенклатура, ХарактеристикаНоменклатуры, Склад);
		ЭтаФорма.ТекущийЭлемент = Элементы.Комментарий;
	Иначе
		Элементы.Количество.Доступность = Истина;
		Элементы.Количество.Видимость = Истина;
		Количество = 0;
		ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОстатки(Номенклатура, ХарактеристикаНоменклатуры, Склад)
    Возврат Альтерра_СкладСервер.ПолучитьОстатки(Номенклатура, ХарактеристикаНоменклатуры, Склад, Истина);
КонецФункции

&НаКлиенте
Процедура ОбновитьОстатки()
	Остатки = ПолучитьОстатки(Номенклатура, ХарактеристикаНоменклатуры, Склад);
	Элементы.Остатки.Заголовок = "Остатки: " + Остатки;	
КонецПроцедуры

&НаСервере
Функция ЭтоРСН()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Должность = &Должность
		|	И Сотрудники.Пользователь = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Должность", Справочники.Должности.НайтиПоКоду("000000213"));//Руководитель складского направления (напр. Родионова)
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти