#Область СлужебныйПрограммныйИнтерфейс

Функция ВидыНалоговУплачиваемыеОтдельно(Период) Экспорт
	
	ВидыНалогов = Новый Массив;
	ВидыНалогов.Добавить(Справочники.ВидыНалоговВзносов.ЕдиныйНалоговыйПлатеж);
	ВидыНалогов.Добавить(Справочники.ВидыНалоговВзносов.ФССНС);
	Если Период >= ЕдиныйНалоговыйСчет.ДатаВыделенияДополнительныхВзносовЛетчиковИШахтеровИзСоставаЕНП() Тогда
		ВидыНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРДополнительныйТарифШахтеры);
		ВидыНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРДополнительныйТарифЛЭ);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ВидыНалогов);
	
КонецФункции


#КонецОбласти
