#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.СписокНачальноеЗаполнение.Доступность = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("Номенклатура") Тогда
		ОтборНоменклатура = Параметры.Номенклатура;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура", Параметры.Номенклатура, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НачальноеЗаполнение(Команда)
    НачальноеЗаполнениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнениеНаСервере()
    РегистрыСведений.ИзмененияШтрихкодов.НачальноеЗаполнениеРегистраИзмененийШтрихкодов();
КонецПроцедуры

