&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ) 
	
	Если Склад = СсылкаПустойСклад() Тогда
		   	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокПересчетов, "Склад", );
	КонецЕсли;
		
КонецПроцедуры

&После("СкладПриИзмененииСервер")
Процедура Док_СкладПриИзмененииСервер()
	
	Если Склад = СсылкаПустойСклад() Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокПересчетов, "Склад", );
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция СсылкаПустойСклад()

Возврат Справочники.Склады.ПустаяСсылка()	
	
КонецФункции
      