#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура СоздатьСообщениеВБитрихПоДокументуНехватки(ДокументНехватки) экспорт
		
	Текст = "Нехватка товара " + СОКРЛП(ДокументНехватки.Номер) + " от " + СокрЛП(ДокументНехватки.Дата) + Символы.ПС + Строка(ДокументНехватки.Клиент) + ";" + Символы.ПС;
	ТекстДляЖивойЛенты = "";
	
	Для Каждого Стр Из ДокументНехватки.Товары Цикл
		Менеджер = Стр.Номенклатура.МенеджерПоставок;
		Пользователь = Справочники.Пользователи.НайтиПоНаименованию(Менеджер, Истина);
		ТекстНоменклатуры = "" + Стр.Номенклатура + ", " + Стр.КлассТовара + ", " + Стр.Ликвидность + ", Нужно - " + Стр.БылоНужно + ", Остаток - " + Стр.Остаток + ", Нехватка - " + Стр.Нехватка + ", " + Менеджер + Символы.ПС;
		ТекстСообщенияМенеджеру = Текст + ТекстНоменклатуры;
		Если Пользователь <> Справочники.Пользователи.ПустаяСсылка() Тогда
			АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщенияМенеджеру, Пользователь);
		КонецЕсли;
		ТекстДляЖивойЛенты = ?(ТекстДляЖивойЛенты = "", ТекстСообщенияМенеджеру, ТекстДляЖивойЛенты + ТекстНоменклатуры);
	КонецЦикла;	  

	Результат = АльтерраВзаимодействиеСБитрикс24.СообщениеВЖивуюЛенту(
		"Нехватка" + Формат(ДокументНехватки.Дата, "ДФ=""ММММ""") + Формат(ДокументНехватки.Дата, "ДФ=""гггг""") + ", " + ДокументНехватки.Склад, 
		СтрЗаменить(ТекстДляЖивойЛенты, "&", ""), 
		, 
		"Группа 'Коммерческие вопросы'");
		
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаписьЖурналаРегистрации("Публикация информации о нехватке", УровеньЖурналаРегистрации.Ошибка, , , Результат);		
		Сообщить("Отправка сообщения в группу не удалась, попробуйте отправить вручную из документа Нехватки.");
	КонецЕсли;

КонецПроцедуры
	
	
#КонецЕсли
