
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Док_ПриСозданииНаСервереИзменениеИКонтроль(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	#Удаление
	Элементы.Список.ТолькоПросмотр = НЕ Пользователи.ЭтоПолноправныйПользователь();
	#КонецУдаления
		
	#Вставка
	Элементы.Список.ТолькоПросмотр = ?((Пользователи.ЭтоПолноправныйПользователь() ИЛИ РольДоступна("ДобавлениеИзменениеКорректировкиРегистров")), Ложь, Истина); 
	#КонецВставки
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	

	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);


	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры
