
&НаСервере
Процедура Док_ЗаполнитьПослеНаСервере()
	  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладскиеЯчейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|ГДЕ
		|	СкладскиеЯчейки.ПометкаУдаления = ЛОЖЬ";
	
	Если ЗначениеЗаполнено(_Группа) Тогда
		Запрос.Текст = Запрос.Текст + "
		|   И СкладскиеЯчейки.Родитель В ИЕРАРХИИ (&Родитель)";
		Запрос.УстановитьПараметр("Родитель", _Группа);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(_Секция) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И СкладскиеЯчейки.РабочийУчасток = &РабочийУчасток";
		Запрос.УстановитьПараметр("РабочийУчасток", _Секция);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Объект.СкладскиеЯчейки.Очистить();
	
	Пока РезультатЗапроса.Следующий() Цикл
		НоваяСтрока = Объект.СкладскиеЯчейки.Добавить();
		НоваяСтрока.Ячейка = РезультатЗапроса.Ссылка;
		НоваяСтрока.Штрихкод = ЧисловойКодПоСсылке(РезультатЗапроса.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗаполнитьПосле(Команда)
	Док_ЗаполнитьПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПринтеровНаКлиенте()
	
	Элементы.Принтер.СписокВыбора.Добавить("Принтер по умолчанию", "Принтер по умолчанию");
	Принтеры = Новый COMОбъект("WScript.Network"); 
	Prn = Принтеры.EnumPrinterConnections(); 
	КоличествоПринтеров = Prn.Count() - 1;
	Для Счетчик = 1 По КоличествоПринтеров Цикл
		Элементы.Принтер.СписокВыбора.Добавить(Prn.Item(Счетчик), Prn.Item(Счетчик));
		Счетчик = Счетчик + 1; // потому что имена идут парами: resource name + printer name
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ЗаполнитьСписокПринтеровНаКлиенте();
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ПолучитьПараметрыДляСкладскихЯчеек")
Функция Док_ПолучитьПараметрыДляСкладскихЯчеек()

	СкладскиеЯчейки = Объект.СкладскиеЯчейки.Выгрузить();

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("СкладскиеЯчейки",        ПоместитьВоВременноеХранилище(СкладскиеЯчейки, УникальныйИдентификатор));
	ПараметрыПечати.Вставить("ШаблонЭтикетки",         Объект.ШаблонЭтикетки);
	ПараметрыПечати.Вставить("КоличествоЭкземпляров",  Объект.КоличествоЭкземпляров);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);   
	#Вставка   
	ПараметрыПечати.Вставить("ПринтерИмя", Принтер);
	#КонецВставки

	Возврат ПараметрыПечати;

КонецФункции

