#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) И ЕдиницаИзмерения.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Неверно указана единица измерения! 'Тип измеряемой величины' элемента не должен быть = 'Упаковка'!");  
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если ЗначениеЗаполнено(МинимальноеЗначение) И ЗначениеЗаполнено(МаксимальноеЗначение) И МинимальноеЗначение > МаксимальноеЗначение Тогда 
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Минимальное значение должно быть меньше, чем Максимальное!");
		ИначеЕсли Не ЗначениеЗаполнено(МинимальноеЗначение) И Не ЗначениеЗаполнено(МаксимальноеЗначение) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить Минимальное либо Максимальное значение!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
