
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Подразделение") Тогда
       Подразделение = Параметры.Подразделение;
    КонецЕсли;
   
   Если Параметры.Свойство("Партнер") Тогда
	   ФИОКлиента = Параметры.Партнер.Наименование;
	   ТелефонКлиента = АЛьтерраОбщегоНазначения.ПолучитьТелефонПартнера(Параметры.Партнер); 
   КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Спр_СоздатьБППослеНаСервере()

	ПустаяСтрокаОтвета = "";
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Сообщить("Не заполнено подразделение!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;      
	
	Если НЕ ЗначениеЗаполнено(ФИОКлиента) Тогда
		Сообщить("Не заполнено ФИО клиента!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидРабот) Тогда
		Сообщить("Не заполнен вид работ!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Товары) Тогда
		Сообщить("Не заполнены товары!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаМонтажа) Тогда
		Сообщить("Не заполнена дата монтажа!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресКлиента) Тогда
		Сообщить("Не заполнен адрес клиента!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;   
	
	Если НЕ ЗначениеЗаполнено(НуженЗамер) Тогда
		Сообщить("Не заполнена информация по замеру!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;



	
	КодЭлементаПроцесса = Строка(ТекущаяДата());

	АвторЗаписи = АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя();

	Если Не ЗначениеЗаполнено(АвторЗаписи) Тогда
		Сообщить("Текущий пользователь не найден в базе данных битрикса!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	 
	СтруктураД  = Новый Структура();
	
	СтруктураД.Вставить("NAME", Строка(ВидРабот) + " " + Строка(ФИОКлиента));
	
	ПодразделениеНаименование = Подразделение.Наименование; 
	
	Если СтрНайти(ПодразделениеНаименование,"Филиал Барнаул",,,) > 0 Тогда 
		ИдПодразделения = "5390";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Филиал Выбор",,,) > 0 Тогда 
		ИдПодразделения = "5392";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Филиал Бийск",,,) > 0 Тогда
		ИдПодразделения = "5391";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Центральный",,,) > 0 Тогда
		ИдПодразделения = "5389";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"МДП Бийск",,,) > 0 Тогда
		ИдПодразделения = "5394"; 
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"МД",,,) > 0 Тогда
		ИдПодразделения = "5393";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Контактный",,,) > 0 Тогда
		ИдПодразделения = "5395";  
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Филиал Майма",,,) > 0 Тогда
		ИдПодразделения = "26485"; 
	Иначе
		ИдПодразделения = ""; 
	КонецЕсли;                  
	
    Если ИдПодразделения <> "" ТОгда 
		СтруктураД.Вставить("PROPERTY_1368", ИдПодразделения);
	Иначе
		Сообщить("Для обязательного поля в значении " + Строка(Подразделение) + " не задан идентификатор Битрикс");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;                
	
	Если ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.УстановкаДверей Тогда 
		ИдВидРабот = "1226"; 
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.МонтажДушевых Тогда 
		ИдВидРабот = "1227";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.МонтажТеплиц Тогда 
		ИдВидРабот = "1228";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.МонтажВодонагревателей Тогда 
		ИдВидРабот = "1330";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.МонтажРадиаторовОтопления Тогда 
		ИдВидРабот = "1331";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.УстановкаСанфаянса Тогда 
		ИдВидРабот = "1332";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.УстановкаГазовыхКотлов Тогда 
		ИдВидРабот = "1348";  
	Иначе
		ИдВидРабот = ""; 
	КонецЕсли;  
	
	Если ИдВидРабот <> "" ТОгда 
		СтруктураД.Вставить("PROPERTY_745", ИдВидРабот);
	Иначе
		Сообщить("Для обязательного поля в значении " + Строка(ВидРабот) + " не задан идентификатор Битрикс");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли; 
	
  	СтруктураД.Вставить("PROPERTY_744", ФИОКлиента);
	СтруктураД.Вставить("PROPERTY_746", Товары);
	СтруктураД.Вставить("PROPERTY_747", ДатаМонтажа);
	СтруктураД.Вставить("PROPERTY_748", ТелефонКлиента);
	СтруктураД.Вставить("PROPERTY_749", АдресКлиента);
	СтруктураД.Вставить("PROPERTY_750", Подрядчик);  
	
	Если НуженЗамер = Перечисления.ЗамерЗаявкиНаМонтаж.ЗамерНеНужен Тогда 
		ИдЗамер = "1273"; 
	ИначеЕсли НуженЗамер = Перечисления.ЗамерЗаявкиНаМонтаж.НуженЗамер Тогда 
		ИдЗамер = "1274";
	ИначеЕсли НуженЗамер = Перечисления.ЗамерЗаявкиНаМонтаж.НуженЗамерИМонтаж Тогда 
		ИдЗамер = "5388";
	ИначеЕсли НуженЗамер = Перечисления.ЗамерЗаявкиНаМонтаж.ЗамерБылПроизведенеРанее Тогда 
		ИдЗамер = "1291";
	Иначе
		ИдЗамер = "1273"; 
	КонецЕсли;  
	
	
	
	СтруктураД.Вставить("PROPERTY_842", ИдЗамер);
	
	
	СтруктураД.Вставить("CREATED_BY", АвторЗаписи);
	 
		
		СтруктураОтвета = АльтерраВзаимодействиеСБитрикс24.ДобавитьНовыйЭлементСписка("lists_socnet", "110", КодЭлементаПроцесса,СтруктураД);
	
	Если СтруктураОтвета.Свойство("НазваниеОшибки") Тогда
		Сообщить("Ошибка отправки в Битрикс: "+ СтруктураОтвета.ОписаниеОшибки + " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
	КонецЕсли;
	Если СтруктураОтвета.Свойство("Результат") или СтруктураОтвета.Свойство("result") Тогда
		Возврат СтруктураОтвета.result;
	Иначе
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Спр_СоздатьБППосле(Команда)
	
	КодЭлементаСписка = Спр_СоздатьБППослеНаСервере();
	Если Не ПустаяСтрока(КодЭлементаСписка) Тогда
		Сообщить("БП создан!");
	Иначе
		Сообщить("БП не создан!");
	КонецЕсли;

КонецПроцедуры
