
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отбор = СписокВопросов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Объект.Ссылка;
	ЕстьПрава = ПравоДоступа("Изменение", Объект.Ссылка.Метаданные());
	Элементы.СписокВопросовДобавитьВопрос.Видимость = ЕстьПрава;
	Элементы.СписокВопросовДобавитьРаздел.Видимость = ЕстьПрава;
	Элементы.СписокВопросовВверх.Видимость = ЕстьПрава;
	Элементы.СписокВопросовВниз.Видимость = ЕстьПрава;
	Элементы.СписокВопросовУдалить.Видимость = ЕстьПрава;
	Элементы.СписокВопросов.ТолькоПросмотр = Не ЕстьПрава;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЕстьПрава Тогда
		ОбновитьЭлементыФормы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы() Экспорт 
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.СписокВопросов.Доступность = Ложь;
		Элементы.НадписьСпискаВопросов.Заголовок = "Перед формированием списка вопросов необходимо записать данные";
	Иначе
		Элементы.СписокВопросов.Доступность = Истина;
		Элементы.НадписьСпискаВопросов.Заголовок = "Список вопросов:";
	КонецЕсли;
	Элементы.СписокВопросов.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВопрос(Команда)
	Если Элементы.СписокВопросов.ТекущиеДанные = Неопределено Тогда
		Родитель = ПредопределенноеЗначение("Справочник.ВопросыАнкетАльтерра.ПустаяСсылка");
	Иначе
		Родитель = Элементы.СписокВопросов.ТекущиеДанные.Ссылка;
	КонецЕсли;
	Номер = ПорядоквыйНомерНового();
	ОткрытьФорму("Справочник.ВопросыАнкетАльтерра.ФормаОбъекта", Новый Структура("Владелец, Родитель, ПорядковыйНомер", Объект.Ссылка, Родитель, Номер), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРаздел(Команда)
	Если Элементы.СписокВопросов.ТекущиеДанные = Неопределено Тогда
		Родитель = ПредопределенноеЗначение("Справочник.ВопросыАнкетАльтерра.ПустаяСсылка");
	Иначе
		Родитель = Элементы.СписокВопросов.ТекущиеДанные.Ссылка;
	КонецЕсли;
	Номер = ПорядоквыйНомерНового();
	ОткрытьФорму("Справочник.ВопросыАнкетАльтерра.ФормаГруппы", Новый Структура("Владелец, ЭтоГруппа, Родитель", Объект.Ссылка, Истина, Родитель), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(Ссылка)
	УстановитьПривилегированныйРежим(Истина);
	УдаляемыйЭлемент = Ссылка.ПолучитьОбъект();
	УдаляемыйЭлемент.Удалить();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере(Элементы.СписокВопросов.ТекущиеДанные.Ссылка);
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Функция ПорядоквыйНомерНового()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВопросыАнкетАльтерра.Владелец,
	               |	КОЛИЧЕСТВО(ВопросыАнкетАльтерра.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Справочник.ВопросыАнкетАльтерра КАК ВопросыАнкетАльтерра
	               |ГДЕ
	               |	ВопросыАнкетАльтерра.Владелец = &Владелец
	               |	И ВопросыАнкетАльтерра.ЭтоГруппа = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВопросыАнкетАльтерра.Владелец";
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка + 1;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ВверхНаСервере(Строка)
	Если Не Строка.ПорядковыйНомер = 1 Тогда
		ОбъектДо = Справочники.ВопросыАнкетАльтерра.НайтиПоРеквизиту("ПорядковыйНомер", Строка.ПорядковыйНомер - 1,, Объект.Ссылка).ПолучитьОбъект();
		ОбъектДо.ПорядковыйНомер = ОбъектДо.ПорядковыйНомер + 1;
		ОбъектДо.Записать();
		ОбъектБД = Строка.ПолучитьОбъект();
		ОбъектБД.ПорядковыйНомер = ОбъектБД.ПорядковыйНомер - 1;
		ОбъектБД.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Вверх(Команда)
	Если Не Элементы.СписокВопросов.ТекущиеДанные = Неопределено Тогда
		ВверхНаСервере(Элементы.СписокВопросов.ТекущиеДанные.Ссылка);
		Элементы.СписокВопросов.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВнизНаСервере(Строка)
	Если Не Строка.ПорядковыйНомер = ПорядоквыйНомерНового() - 1 Тогда
		ОбъектПосле = Справочники.ВопросыАнкетАльтерра.НайтиПоРеквизиту("ПорядковыйНомер", Строка.ПорядковыйНомер + 1,, Объект.Ссылка).ПолучитьОбъект();
		ОбъектПосле.ПорядковыйНомер = ОбъектПосле.ПорядковыйНомер - 1;
		ОбъектПосле.Записать();
		ОбъектБД = Строка.ПолучитьОбъект();
		ОбъектБД.ПорядковыйНомер = ОбъектБД.ПорядковыйНомер + 1;
		ОбъектБД.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Вниз(Команда)
	Если Не Элементы.СписокВопросов.ТекущиеДанные = Неопределено Тогда
		ВнизНаСервере(Элементы.СписокВопросов.ТекущиеДанные.Ссылка);
		Элементы.СписокВопросов.Обновить();
	КонецЕсли;
КонецПроцедуры
