#Область ПрограммныйИнтерфейс

#Область ПереопределяемыеФункцииУправленияДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Подразделения";
	ВидДоступа.Представление    = НСтр("ru = 'Подразделения'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.СтруктураПредприятия");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Склады";
	ВидДоступа.Представление    = НСтр("ru = 'Склады'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Склады");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Кассы";
	ВидДоступа.Представление    = НСтр("ru = 'Кассы'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Кассы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "КассыККМ";
	ВидДоступа.Представление    = НСтр("ru = 'Кассы ККМ'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.КассыККМ");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ЭквайринговыеТерминалы";
	ВидДоступа.Представление    = НСтр("ru = 'Эквайринговые терминалы'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ЭквайринговыеТерминалы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыЦен";
	ВидДоступа.Представление    = НСтр("ru = 'Виды цен'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ВидыЦен");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ХозяйственныеОперации";
	ВидДоступа.Представление = НСтр("ru = 'Хозяйственные операции'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ХозяйственныеОперации");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СоглашенияСКлиентамиЧтение";
	ВидДоступа.Представление = НСтр("ru = 'Виды соглашений с клиентами (чтение)'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыСоглашенийСКлиентамиДляОграниченияЧтения");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СоглашенияСКлиентамиИзменение";
	ВидДоступа.Представление = НСтр("ru = 'Виды соглашений с клиентами (изменение)'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыСоглашенийСКлиентамиДляОграниченияИзменения");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыНоменклатуры";
	ВидДоступа.Представление    = НСтр("ru = 'Группы номенклатуры'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Номенклатура");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаНоменклатуры");
	УправлениеДоступом.ДобавитьДополнительныеТипыВидаДоступа(ВидДоступа,
		Тип("СправочникСсылка.ВидыНоменклатуры"),
		Тип("СправочникСсылка.ГруппыДоступаНоменклатуры"));
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыПартнеров";
	ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыФизическихЛиц";
	ВидДоступа.Представление    = НСтр("ru = 'Группы физических лиц'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ФизическиеЛица");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаФизическихЛиц");
	
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ТипыОснованийАктаОРасхождениях";
	ВидДоступа.Представление = НСтр("ru = 'Типы оснований акта о расхождениях'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ТипыОснованияАктаОРасхождении");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыОперацийВзаимозачетаЗадолженности";
	ВидДоступа.Представление = НСтр("ru = 'Виды операций взаимозачета задолженности'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыОперацийВзаимозачетаЗадолженности");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СценарииТоварногоПланирования";
	ВидДоступа.Представление = НСтр("ru = 'Сценарии товарного планирования'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.СценарииТоварногоПланирования");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыПланов";
	ВидДоступа.Представление = НСтр("ru = 'Виды планов'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.ВидыПланов");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	// Переопределение ограничения списков подсистемы Свойства.
	Списки.Вставить(Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений, Ложь);
	
	// Переопределение ограничения списков подсистемы Взаимодействия.
	Списки.Вставить(Метаданные.Документы.Встреча, Ложь);
	Списки.Вставить(Метаданные.Документы.ЗапланированноеВзаимодействие, Ложь);
	Списки.Вставить(Метаданные.Документы.СообщениеSMS, Ложь);
	Списки.Вставить(Метаданные.Документы.ТелефонныйЗвонок, Ложь);
	Списки.Вставить(Метаданные.Документы.ЭлектронноеПисьмоВходящее, Ложь);
	Списки.Вставить(Метаданные.Документы.ЭлектронноеПисьмоИсходящее, Ложь);
	
	// Переопределение ограничения списков подсистемы КоммерческоеПредложениеКлиенту.
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЭлектронноеВзаимодействие.КоммерческиеПредложения.КоммерческиеПредложенияДокументы.КоммерческоеПредложениеКлиенту") Тогда
		
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("Документы.КоммерческоеПредложениеКлиенту");
		МодульПодсистемы.ПриЗаполненииСписковСОграничениемДоступа(Списки);
		
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа.
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	// Папка профилей "Продажи".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "Продажи";
	ОписаниеПапки.Идентификатор = "05de7c45-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Продажи'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);
	
	// Папка профилей "Финансы".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "Финансы";
	ОписаниеПапки.Идентификатор = "be8dcb8a-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Финансы'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);
	
	// Папка профилей "Планирование".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "Планирование";
	ОписаниеПапки.Идентификатор = "05de7c3d-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Планирование'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);
	
	// Папка профилей "Закупки и запасы".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "ЗакупкиИЗапасы";
	ОписаниеПапки.Идентификатор = "05de7c27-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Закупки и запасы'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);

	// Папка профилей "Администрирование и НСИ".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "АдминистрированиеИНСИ";
	ОписаниеПапки.Идентификатор = "05de7c19-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Администрирование и НСИ'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);
	
	// Папка профилей "Прочее".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "Прочее";
	ОписаниеПапки.Идентификатор = "be8dcb7f-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Прочее'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);
	
#Область Описание_профиля_СупервайзерТорговыхПредставителей
	
	// Профиль "Супервайзер торговых представителей".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "СупервайзерТорговыхПредставителей";
	ОписаниеПрофиля.Идентификатор = "ef2371ca-1f4a-4480-be8c-fcb685871343";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Супервайзер торговых представителей'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение. 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	// Добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеОтгрузкиПоРеализации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПриемкиПоВозвратуОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("СозданиеАктовВыполненныхРаботБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаДаннымиСКПК");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИндивидуальныхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("СозданиеРеализацииТоваровУслугБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("РеализацияСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорчиТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОСписанииТоваровУХранителя");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	// Согласование продажи.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации","Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "ВначалеВсеРазрешены");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиУправлениеТорговымиПредставителями");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиВедениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПродажиИВозвраты");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоДенежныеСредства");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиСупервайзераТорговыхПредставителей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВыполнениеУсловийСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиТорговогоПредставителя");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовОтчетыКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажиНакладные");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажиВозвраты");
	// ДополнительныеПрава
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахПродажи");
	
	// Х.О. для кассовых ордеров, безналичных дс. и договоров контрагентов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыкупТоваровХранителем");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуПоклажедателя");
	
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя");
	
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя");
	
	// Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПустаяСсылка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтХранителя");
	// Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Индивидуальные");
	
	УправлениеДоступомЛокализация.ДобавитьРолиСупервайзерТорговыхПредставителей(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется обмен данными с КПК, формируются
	                                      |задания торговым представителям, регистрируются условия
	                                      |обслуживания клиентов, анализируется работа торговых представителей,
	                                      |а также осуществляется синхронизация данных с мобильным приложением ""1С:Заказы"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ТорговыйПредставитель
	// Профиль "Торговый представитель".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ТорговыйПредставитель";
	ОписаниеПрофиля.Идентификатор = "3afd420c-f9e9-4a88-975e-2e31547ee74c";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Торговый представитель'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаДаннымиСКПК");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	
	
	// Добавление
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен","ВначалеВсеРазрешены");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиУправлениеТорговымиПредставителями");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиВедениеЗаказовКлиентов");
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиТорговогоПредставителя");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется доступ в ИБ торгового представителя,
	                                      |осуществляется обмен данными с мобильными устройствами,
	                                      |а также осуществляется синхронизация данных с мобильным приложением ""1С:Заказы"".'");
	
	УправлениеДоступомЛокализация.ДобавитьРолиТорговыйПредставитель(ОписаниеПрофиля);
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Маркетолог
	// Профиль "Маркетолог".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Маркетолог";
	ОписаниеПрофиля.Идентификатор = "806daef6-c289-49e0-9652-38dcf3fa7677";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Маркетолог'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРассылкамИОповещениямКлиентам");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСегментовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСегментовПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТиповыхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилЦенообразования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркетинговыхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПродажДляПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБонусныхПрограммЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовОповещенийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппРассылокИОповещений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодписокНаРассылкиИОповещенияКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновСообщений");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);

	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	//Анкетирование
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОпросов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");

	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеABCXYZКлассификацияКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеABCXYZКлассификацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛогистическихПараметров");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("УстановкаЦенНоменклатурыБезСогласования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокКлиентам");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСхемыОбеспечения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКомандыABCXYZКлассификацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКомандыABCXYZКлассификацияКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМаркетолога");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	// Согласование цен.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованияЦенНоменклатуры");
	
	// Согласование заказов на внутреннее потребление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеЗаказовНаВнутреннееПотребление");
	
	// Сезонные коэффициенты
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСезонныхКоэффициентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСезонныхКоэффициентов");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингСегментация");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингКонкурентнаяРазведка");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингПравилаПродаж");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингЦенообразование");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингМаркетинговыеМероприятия");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингАссортимент");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингАнкетирование");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиРетроБонусыПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	// Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Типовые");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМаркетолог(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация цен конкурентов,
	                                      |проводится анализ и классификация клиентов и номенклатуры,
	                                      |настраиваются правила продаж и происходит управление
	                                      |маркетинговыми мероприятиями.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_РуководительОтделаПродаж
	// ДЕЛАЕТ ВСЕ СОГЛАШЕНИЯ.
	// Профиль "Руководитель отдела продаж".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "РуководительОтделаПродаж";
	ОписаниеПрофиля.Идентификатор = "ae883b07-11cf-4bea-9bce-46473350db16";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Руководитель отдела продаж'");
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");
	
	
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхВозвратах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюИзлишковНедостач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМКоррекции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилВеденияСделок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТиповыхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИндивидуальныхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилОтработкиПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПродажДляПользователей");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");

	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеОтгрузкиПоРеализации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПриемкиПоВозвратуОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("СозданиеРеализацииТоваровУслугБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДополнительныеОперацииКорректировкиНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("СозданиеАктовВыполненныхРаботБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("РеализацияСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженностиЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорчиТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОСписанииТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПервичныхДокументов");
	
	// Согласование продажи.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийПродаж");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингПроведениеСделок");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиУправлениеТорговымиПредставителями");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиВедениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПродажиИВозвраты");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиКонтрольРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиКомиссионнаяТорговля");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингПравилаПродаж");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингЦенообразование");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингМаркетинговыеМероприятия");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиРетроБонусыПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	// Отчеты, обработки
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРуководителяОтделаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОценкаРентабельностиПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыПереданныеНаКомиссию");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВыполнениеУсловийСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиИДоступностьТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажиНакладные");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажиВозвраты");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	// Дополнительные права
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахПродажи");

	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Предустановленный");
	
	// Х.О. для кассовых ордеров, заявок, безналичных дс. и договоров контрагентов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыкупТоваровХранителем");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуПоклажедателя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера");
	
	// Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПустаяСсылка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратОтКомиссионера");
	// Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Типовые");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Индивидуальные");
	// Значения доступа по видам операций взаимозачета задолженности
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаКлиентаОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаПоставщикуОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуОрганизацияКонтрагент");
	
	УправлениеДоступомЛокализация.ДобавитьРолиРуководительОтделаПродаж(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем настраиваются правила ведения сделок на
	                                      |предприятии, анализируется эффективность сделок.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоПродажам
	// Профиль "Менеджер по продажам".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоПродажам";
	ОписаниеПрофиля.Идентификатор = "44d4fd93-99ca-40e7-be0a-3b0321a39d3b";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСезонныхКоэффициентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");
	
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхВозвратах");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМКоррекции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеОтгрузкиПоРеализации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПриемкиПоВозвратуОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("СозданиеРеализацииТоваровУслугБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомитентуОЗакупках");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИндивидуальныхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("СозданиеАктовВыполненныхРаботБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("РеализацияСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженностиЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорчиТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОСписанииТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкиТоваровНаХранение");
	
	// Согласование продажи.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазделаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМенеджераПоПродажам");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОценкаРентабельностиПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыПереданныеНаКомиссию");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВыполнениеУсловийСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоПереданнойВозвратнойТаре");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиИДоступностьТоваров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПомощникаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовОтчетыКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажиНакладные");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажиВозвраты");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПереданнойВозвратнойТарой");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналУчетаОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовОтчетыКомитентам");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастройкиПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеНастроекПечатиОбъектовПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахПродажи");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляИзмененияСостоянийОригиналовДокументов(ОписаниеПрофиля);

	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Предустановленный");
	
	// Х.О. для кассовых ордеров и договоров с контрагентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыкупТоваровХранителем");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуПоклажедателя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента");
	
	// Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПустаяСсылка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратОтКомиссионера");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ОтгрузкаТоваровСХранения");
	// Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Индивидуальные");
	// Значения доступа по видам операций взаимозачета задолженности
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаКлиентаОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаПоставщикуОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуОрганизацияКонтрагент");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиРетроБонусыПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингПроведениеСделок");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");

	УправлениеДоступомЛокализация.ДобавитьРолиМенеджерПоПродажам(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется управление сделками, реализация
	                                      |товаров и услуг, возвраты товара, контролируются комиссионеры,
	                                      |а также осуществляется синхронизация данных с мобильным приложением ""1С:Заказы"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Кассир
	// Профиль "Кассир".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кассир";
	ОписаниеПрофиля.Идентификатор = "1167e360-4f81-4114-968e-c4264a06baa0";
	ОписаниеПрофиля.Родитель      = "Финансы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кассир'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");//
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОЗакупках");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорчиТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОжидаемыхПоступленийДенежныхСредств");
	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаПеремещениеДенежныхСредств");
	//-- НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетыПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	
	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОперацийПоПлатежнымКартам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПоКассе");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	
	// Регистры чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);

	// Регистры расширенной аналитики денежных средств
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПлатежей");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоЭквайринг");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоДенежныеСредства");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоПланированиеИКонтрольДенежныхСредств");
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыКассира");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСерверЛояльности");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЭквайринговыеТерминалы", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиКассир(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит оформление кассовых операций.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Создать_профиль_ПродавецКассирККМ
	// Профиль "Продавец-кассир ККМ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПродавецКассирККМ";
	ОписаниеПрофиля.Идентификатор = "b93bb8a1-04fa-4c1a-ac3c-75fb05366782";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Продавец-кассир ККМ'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");

	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековККМКоррекции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхВозвратах");	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийВозвратовПодарочныхСертификатов");
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ОтчетыКассираККМ");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	//++ Локализация
	
	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЭквайринговыеТерминалы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ");
	
	//-- Локализация
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит работа с ККМ в течение дня и закрытие
	                                      |кассовой смены.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Создать_профиль_МенеджерПоРозничнойТорговле
	// Профиль "Менеджер по розничной торговле".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоРозничнойТорговле";
	ОписаниеПрофиля.Идентификатор = "4c72e308-ff96-40b3-b066-f2dfda73d323";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по розничной торговле'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	// Документы, чтение.

	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековККМКоррекции");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПродажиИВозвраты");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхВозвратах");	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхПродажах");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	

	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМенеджераПоРозничнойТорговле");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварныйКалендарь");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазделаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЭквайринговыеТерминалы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	// Значения доступа.
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджераПоРозничнойТорговле(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется регистрация продаж через ККМ,
	                                      |печатаются ценники и этикетки, формируется отчетность розничной торговли.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Бухгалтер
	// Профиль "Бухгалтер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Бухгалтер";
	ОписаниеПрофиля.Идентификатор = "84acd69c-4114-4d0a-82b2-226033948e12";
	ОписаниеПрофиля.Родитель      = "Финансы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Бухгалтер'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ДобавитьРолиБухгалтераРеглУчетаНаЧтение(ОписаниеПрофиля);
	ДобавитьРолиБухгалтераРеглУчетаНаИзменение(ОписаниеПрофиля);
		
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");

	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит формирование отчетности розничной
	                                      |торговли, отражается инвентаризация товаров, рассчитывается
	                                      |себестоимость, распределяется прибыль по направлениям
	                                      |деятельности, оформляются внутрифирменные продажи.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Казначей
	// Профиль "Казначей".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Казначей";
	ОписаниеПрофиля.Идентификатор = "9f46c8c7-1a0c-4ecb-aea8-0be64724b259";
	ОписаниеПрофиля.Родитель      = "Финансы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Казначей'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Нормативно-справочная информация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Отчеты и обработки
	
	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКазначея");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРеестрКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПланФактныйАнализФинансовыхИнструментов");
	//-- НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеАнализСтатейКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоДвижениюДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовЗакупки");
		
	//ЦеныСкидкиНаценки
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры"); 
	
	// Документы чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеОтгрузки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорчиТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхВозвратах");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовБанкаПоОперациямЭквайринга");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОжидаемыхПоступленийДенежныхСредств");
	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаПеремещениеДенежныхСредств");
	//-- НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересчетовТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеИзлишковНедостачПорчи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");

	// Добавление справочники.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДДС");
	// Добавление документы.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПоБанку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОжидаемыхПоступленийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспоряженийНаПеремещениеДенежныхСредств");
	//-- НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("СогласованиеЗаявокНаКомандировку");
	ОписаниеПрофиля.Роли.Добавить("СогласованиеЗаявокНаРасходованиеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("СогласованиеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеЗаявокНаРасходованиеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНачисленияКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ЗаписьВыданнойДоверенностиВОкончательномСтатусе");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРасхожденийПриИнкассацииДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийНаличныхДенежныхСредств");
	
	// Регистры
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетыПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Регистры расширенной аналитики взаиморасчетов
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийКонтрагентДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийКонтрагентКонтрагент");
	
	// Регистры расширенной аналитики себестоимости товаров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");

	// Обработки
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовЗакупки");

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовИнтеркампани");
	
	// Регистры расширенной аналитики денежных средств
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПлатежей");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "ВначалеВсеРазрешены");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоЭквайринг");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоДенежныеСредства");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоНастройкаАналитики");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоПланированиеИКонтрольДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоКорректировкаЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоКредитыИДепозиты");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиРетроБонусыПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	
	
	УправлениеДоступомЛокализация.ДобавитьРолиКазначей(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит управление платежным календарем,
	                                      |ведутся операций по банку, осуществляются расчеты с подотчетными лицами.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоОбеспечениюПотребностей
	// Профиль "Менеджер по обеспечению потребностей".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоОбеспечениюПотребностей";
	ОписаниеПрофиля.Идентификатор = "e5d97caa-7019-44d2-b36e-7b71f6133219";
	ОписаниеПрофиля.Родитель      = "ЗакупкиИЗапасы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по обеспечению потребностей'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Нормативно-справочная информация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекОбеспеченияПоСкладу");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписанийРасхожденийПоступлениеПриобретение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	// Соглашения
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	// Цены
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Расчеты с клиентами и поставщиками
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	// Заказы поставщикам
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщикам");
	// Заказы клиентов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	// Внутренние заказы
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ВнутреннееПотреблениеСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокНазначенияТоваров");
	
	// Согласование заказов на внутреннее потребление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеЗаказовНаВнутреннееПотребление");

	// Склад и доставка
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	
	// Планирование
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЗаказовПоставщикуПоПлану");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЗаказовНаСборкуРазборкуПоПлану");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	
	// Сезонные коэффициенты
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСезонныхКоэффициентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСезонныхКоэффициентов");
	
	// Корректировки обособленного учета товаров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСхемыОбеспечения");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКомандыABCXYZКлассификацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМенеджераПоОбеспечениюПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиИДоступностьТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварныйКалендарь");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеФормированиеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиДокументыВнутреннегоТовародвиженияКОформлению");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУправлениеПеремещениемОбособленныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрФормированияЗаказовПоПланамРаспределениеИПеренос");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЭтаповОплатыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	
	// Регистры
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);

	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджераПоОбеспечениюПотребностей(ОписаниеПрофиля);
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит определение правил управления и
	                                      |пополнения запасов, обрабатываются внутренние заказы.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ФинансовыйАналитик
	// Профиль "Финансовый аналитик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ФинансовыйАналитик";
	ОписаниеПрофиля.Идентификатор = "485d23db-673c-446b-adab-8fd27de6e0e5";
	ОписаниеПрофиля.Родитель      = "Финансы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Финансовый аналитик'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Прикладные роли
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеАнализСтатейКредитовИДепозитов");
	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРеестрКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПланФактныйАнализФинансовыхИнструментов");
	//-- НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФинансовыхРезультатов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетыПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Регистры расширенной аналитики взаиморасчетов
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийКонтрагентДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийКонтрагентКонтрагент");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДоходыРасходыПрочиеАктивыПассивы");
	
	// Регистры расширенной аналитики денежных средств
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПлатежей");
	
	// Документы, чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорчиТоваровУХранителя");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенияПрочихЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенийРасходовБудущихПериодов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхВозвратах");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовБанкаПоОперациямЭквайринга");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОжидаемыхПоступленийДенежныхСредств");
	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаПеремещениеДенежныхСредств");
	//-- НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ОтчетыФинансовогоАналитика");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовИнтеркампани");

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаФинансовыйРезультатИКонтроллинг");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоПланированиеИКонтрольДенежныхСредств");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиФинансовогоАналитика(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем формируется финансовая отчетность и выполняется финансовый анализ.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Кладовщик
	// Профиль "Кладовщик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кладовщик";
	ОписаниеПрофиля.Идентификатор = "28f1fe22-299d-4135-ac9f-fe338ce51571";
	ОписаниеПрофиля.Родитель      = "ЗакупкиИЗапасы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кладовщик'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");
	
	// Документы, чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорчиТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПриемкиПоПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхВозвратах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБлокировокСкладскихЯчеек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюИзлишковНедостач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюДокументовИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);

	
	// Настройка.
	ОписаниеПрофиля.Роли.Добавить("НастройкаТопологииСкладов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторыСкладскогоУчетаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУстановкиБлокировокЯчеек");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтборовРазмещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрдеровНаПеремещениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересчетовТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрдеровНаОтражениеИзлишковНедостачПорчи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтраженийРезультатовПроверкиОрдераНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокНазначенияТоваров");

	// Документы, проведение.
	ОписаниеПрофиля.Роли.Добавить("ВзятиеРасходногоОрдераВРаботу");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКладовщика");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроверкиКоличестваТоваровВДокументе");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиДокументыВнутреннегоТовародвиженияКОформлению");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиКладовщик(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит настройка топологии склада, выполнение
	                                      |распоряжений о приеме, выдаче и сборке товаров. Осуществляется
	                                      |регистрация информации о выполнении распоряжений, отражаются
	                                      |излишки и недостачи товара. Так же профиль позволяет редактировать
										  |складскую информацию по номенклатуре.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоЗакупкам
	// Профиль "Менеджер по закупкам".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоЗакупкам";
	ОписаниеПрофиля.Идентификатор = "12bb4321-60bb-4bbd-a1fc-4c84fb3c1133";
	ОписаниеПрофиля.Родитель      = "ЗакупкиИЗапасы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по закупкам'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНомеровГТД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПретензийКлиентов");
	
	// Документы, чтение.

	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенийРасходовБудущихПериодов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОЗакупках");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписанийРасхожденийПоступлениеПриобретение");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийУслугВПодразделение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийРасхожденийПоступлениеПриобретение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОСписанииПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеОтгрузкиПоВозврату");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПриемкиПоПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженностиЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявленийОВвозеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПервичныхДокументов");

	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюДокументовИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	
	// Согласование закупки
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийЗакупки");
	
	// Планирование
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЗаказовПоставщикуПоПлану");
	
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазделаСклад");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМенеджераПоЗакупкам");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварныйКалендарь");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиИДоступностьТоваров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовИнтеркампани");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПринятойВозвратнойТарой");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналУчетаОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовОтчетыКомитентам");

	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахЗакупки");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляИзмененияСостоянийОригиналовДокументов(ОписаниеПрофиля);
		
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиРетроБонусыПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации","Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Предустановленный");
	// Х.О. для кассовых ордеров, безналичных дс.
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПеречислениеТаможне");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаПоступлениеИзТоваровВПути");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПриемНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСПоступлениеИзТоваровВПути");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОтгрузкаПринятыхСПравомПродажиТоваровСХранения");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыкупПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеРасхожденийПоступлениеПриобретение");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеПринятыхТоваровЗаСчетПоклажедателя");
	
	// Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПриемкаТоваровНаХранение");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ОтгрузкаТоваровСХранения");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтХранителя");

	
	// Значения доступа по видам операций взаимозачета задолженности
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаКлиентаОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаПоставщикуОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуОрганизацияКонтрагент");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджераПоЗакупкам(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит заключение соглашений с поставщиками,
	                                      |управление заказами, регистрируются закупки и возвраты,
	                                      |контролируются расчеты с поставщиками.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_УчастникСогласованияУсловийЗакупок
	// Описание для заполнения профиля "Согласования условий закупок".
	// Профиль предназначен для обеспечения доступа к объектам согласования и отчетам.
	// Профиль "Участник согласования условий закупок (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникСогласованияУсловийЗакупок";
	ОписаниеПрофиля.Идентификатор = "19037231-7da0-406f-a223-28687ce22545";
	ОписаниеПрофиля.Родитель      = "ЗакупкиИЗапасы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник согласования условий закупок (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийЗакупки");
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены"); // Для заказов.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены"); // Для заказов.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены"); // Для заказов.
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит согласование заказов поставщикам.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Клиент
	// Описание для заполнения профиля "Клиент"
	// Профиль предназначен для обеспечения доступа клиента-внешнего пользователя к объектам подсистемы "Самообслуживание клиентов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Клиент";
	ОписаниеПрофиля.Идентификатор = "8ed11273-0914-4acb-8359-f95ff3e43bc6";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Назначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип);
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Клиент, имеющий доступ к подсистеме самообслуживания'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПечатьДокументовОтгрузки");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнихПользователейБСП"); 
	
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователяУТ");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательБазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательЧтениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательРедактированиеПодписокНаРассылкиИОповещения");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательИзменениеКонтактнойИнформацииКлиента");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеПретензий");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПросмотрДокументовУсловийПродажи");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеАктовПриемки");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПросмотрОтчетаСостояниеРасчетов");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательИзменениеБанковскихСчетов");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательЧтениеДанныхПоРасчетам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	// Просмотр реальных остатков
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПросмотрСостоянияОбеспеченияЗаказа");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПросмотрОтчетаСостояниеДоступностиТоваров");
	// Доступ к регистру Календарные графики для отображения плановой даты поставки в состоянии обеспечения.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВнешниеПользователи", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады",              "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",             "ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Профиль для доступа клиентов-покупателей к системе через веб-
	                                      |интерфейс. Под профилем происходит самостоятельное оформление 
	                                      |заказов клиентами, которые зарегистрированы в качестве внешних пользователей.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Респондент

	// Описание для заполнения профиля "Респондент"
	// Профиль предназначен для обеспечения доступа респондента внешнего пользователя к заполнению предназначенных для него анкет.
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Респондент";
	ОписаниеПрофиля.Идентификатор = "c86c8305-df47-4bb0-a51d-af325c38670f";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Назначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип);
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Респондент, участвующий в опросах'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнихПользователейБСП");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователяУТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПереходКСпискуАнкет");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВнешниеПользователи", "Предустановленный");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Профиль для доступа респондентов опросов к системе через веб-
	                                      |интерфейс. Под данным профилем респонденту доступен список, предназначенных 
	                                      |ему опросов и возможность заполнить анкеты.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_СогласованияУсловийПродаж
	// Профиль предназначен для обеспечения доступа к объектам согласования и отчетам.
	// Профиль "Участник согласования условий продаж (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникСогласованияУсловийПродаж";
	ОписаниеПрофиля.Идентификатор = "6c5ff2cf-6901-4412-a930-fa04bad5cf0b";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник согласования условий продаж (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены"); // Для заказов.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены"); // Для заказов.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены"); // Для заказов.
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит заключение соглашений с клиентами,
	                                      |формирование коммерческих предложений, регистрация и отработка
	                                      |заказов клиентов и заявок на возврат.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_УчастникСогласованияЦенНоменклатуры
	
	// Профиль "Участник согласования цен номенклатуры (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникСогласованияЦенНоменклатуры";
	ОписаниеПрофиля.Идентификатор = "9838ae68-ebd3-4e82-b62c-d39c379a928b";
	ОписаниеПрофиля.Родитель      = "Продажи";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник согласования цен номенклатуры (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованияЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит согласование цен номенклатуры
	                                      |в момент их установки.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВедениеПартнеров
	// Профиль "Ответственный за ведение партнеров (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеПартнеров";
	ОписаниеПрофиля.Идентификатор = "932c3320-f64e-4f35-a8a0-47e9727c0b2c";
	ОписаниеПрофиля.Родитель      = "АдминистрированиеИНСИ";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение партнеров (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРассылкамИОповещениямКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыОтветственногоЗаВедениеПартнеров");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, назначается пользователям, ведущим
	                                      |список партнеров, контрагентов, контактных лиц.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВедениеФизлиц
	// Профиль "Ответственный за ведение физлиц (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеФизлиц";
	ОписаниеПрофиля.Идентификатор = "6100e47d-25bf-4fe2-a7e5-9e357fd3bee9";
	ОписаниеПрофиля.Родитель      = "АдминистрированиеИНСИ";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение физлиц (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекФизическихЛиц");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, назначается пользователям, ведущим список физлиц.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВедениеНоменклатуры
	
	// Профиль "Ответственный за ведение номенклатуры (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеНоменклатуры";
	ОписаниеПрофиля.Идентификатор = "101d8475-84ef-4d02-b6d1-b026baba0ccc";
	ОписаниеПрофиля.Родитель      = "АдминистрированиеИНСИ";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение номенклатуры (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСертификатовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторыСкладскогоУчетаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппАналитическогоУчетаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, назначается пользователям, ведущим
	                                      |справочник ""Номенклатура"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВедениеВзаимодействий
	// Профиль "Ответственный за ведение взаимодействий (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеВзаимодействий";
	ОписаниеПрофиля.Идентификатор = "6797cdb5-c0f0-4814-8b18-3a6ef417dd52";
	ОписаниеПрофиля.Родитель      = "Прочее";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение взаимодействий (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрВзаимодействийПоРассылкеКлиентам");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется загрузка входящих и формирование
	                                      |исходящих писем электронной почты, регистрация входящих и
	                                      |исходящих звонков, планирование и обработка взаимодействий, 
	                                      |планирование и регистрация встреч.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_УчастникРасчетовМеждуОрганизациями
	// Профиль "Участник расчетов между организациями (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникРасчетовМеждуОрганизациями";
	ОписаниеПрофиля.Идентификатор = "4e46851a-0ff9-47dd-bfad-0ee5abf864f2";
	ОписаниеПрофиля.Родитель      = "Финансы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник расчетов между организациями (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет отдельно настраивать доступ к организациям
	                                      |и банковским счетам организаций по виду доступа ""Организации"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

//++ НЕ УХ
#Область Описание_профиля_УчастникКонтроляИАнализаПоказателей
	// Профиль "Участник управления по целям (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникУправленияПоЦелям";
	ОписаниеПрофиля.Идентификатор = "81868489-66a6-40bd-bf4d-243b38003e13";
	ОписаниеПрофиля.Родитель      = "Прочее";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник управления по целям (дополнительный)'");
	
	// Чтение.
	ОписаниеПрофиля.Роли.Добавить("РазделОтчетыИМониторингЦелевыеПоказатели");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит контроль целевых показателей
	                                      |с точки зрения выявления отклонений от целевых значений или диапазонов,
	                                      |а также анализ причин выявленных отклонений.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти
//-- НЕ УХ

#Область Описание_профиля_РаботникСклада
	// Профиль "Работник склада".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "РаботникСклада";
	ОписаниеПрофиля.Идентификатор = "d709cde6-925c-4497-997f-f3dd0870ffee";
	ОписаниеПрофиля.Родитель      = "ЗакупкиИЗапасы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Работник склада'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБлокировокСкладскихЯчеек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюИзлишковНедостач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	
	// Добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтборовРазмещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересчетовТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУстановкиБлокировокЯчеек");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтраженийРезультатовПроверкиОрдераНаТовары");
	
	// Документы, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПриемкиПоВозвратуОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеИзлишковНедостачПорчи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	
	// Чтение регистров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	
	// Документы, проведение.
	ОписаниеПрофиля.Роли.Добавить("ВзятиеРасходногоОрдераВРаботу");
	
	// Использование.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаРаботникаСклада");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроверкиКоличестваТоваровВДокументе");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаКладовщика");
	
	// Отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	//-- Локализация
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтносительныхКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрВалют");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	
	// Варианты отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	// Печать
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	// Файлы и папки файлов
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа мобильного рабочего 
	                                      |места работника склада'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ДиспетчерСборкиИКурьерскойДоставки
	// Профиль "Диспетчер сборки и курьерской доставки".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ДиспетчерСборкиИКурьерскойДоставки";
	ОписаниеПрофиля.Идентификатор = "730363cf-396d-11eb-8105-4cedfb412fb8";
	ОписаниеПрофиля.Родитель      = "ЗакупкиИЗапасы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Диспетчер сборки и курьерской доставки'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхВозвратах");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМКоррекции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПриобретений");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	
	// Использование.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаДиспетчераСборкиИКурьерскойДоставки");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("СозданиеРеализацииТоваровУслугБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИндивидуальныхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("СозданиеАктовВыполненныхРаботБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("РеализацияСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженностиЗачетОплаты");
	
	// Согласование продажи.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	
	// Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазделаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМенеджераПоПродажам");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОценкаРентабельностиПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыПереданныеНаКомиссию");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВыполнениеУсловийСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоПереданнойВозвратнойТаре");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПомощникаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажиНакладные");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажиВозвраты");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПереданнойВозвратнойТарой");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналУчетаОригиналовПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастройкиПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеНастроекПечатиОбъектовПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахПродажи");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляИзмененияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Предустановленный");
	// Х.О. для кассовых ордеров и договоров с контрагентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыкупТоваровХранителем");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтХранителя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуПоклажедателя");
	
	// Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПустаяСсылка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтХранителя");
	// Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Индивидуальные");
	// Значения доступа по видам операций взаимозачета задолженности
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаКлиентаОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаПоставщикуОрганизацияКонтрагент");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуОрганизацияКонтрагент");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаCRMИМаркетинг");
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджерПоПродажам(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа диспетчера сборки и курьерской доставки
	                                      |в специализированном рабочем месте'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ПользовательМобильногоРабочегоМестаСборкиИКурьерскойДоставки
	// Профиль "Пользователь мобильного рабочего места сборки и курьерской доставки".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПользовательМобильногоРабочегоМестаСборкиИКурьерскойДоставки";
	ОписаниеПрофиля.Идентификатор = "730363ce-396d-11eb-8105-4cedfb412fb8";
	ОписаниеПрофиля.Родитель      = "ЗакупкиИЗапасы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь мобильного рабочего места сборки и курьерской доставки'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	
	// Использование.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаСборкиИКурьерскойДоставки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийТоваровУслуг");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа из мобильного клиента 
										|диспетчера заказов, сборщика заказов и курьера'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоДоставке
	// Профиль "Менеджер по доставке".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоДоставке";
	ОписаниеПрофиля.Идентификатор = "d3e34937-0a73-4468-8105-8f9ab0e311ac";
	ОписаниеПрофиля.Родитель      = "Прочее";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по доставке'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	
	// Добавление.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаДоставки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗонДоставки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");

	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджераПоДоставке(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется создание и редактирование зон доставки,
										|создание и редактирование транспортных средств, типов транспортных средств,
										|создание и обработка Заданий на перевозку,
										|работа в обработке Рабочее место менеджера по доставке'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ИнициаторЗаявокНаКомандировку

	// Профиль "Инициатор заявок на командировку".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ИнициаторЗаявокНаКомандировку";
	ОписаниеПрофиля.Идентификатор = "222924b1-1d8a-4431-85d8-41c037100823";
	ОписаниеПрофиля.Родитель      = "Прочее";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Инициатор заявок на командировку'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
	
	// Добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаКомандировку");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	//-- НЕ УХ
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем вводятся и отслеживаются заявки на командировку'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ИнициаторЗаявокНаРасходованиеДенежныхСредств

	// Профиль "Инициатор заявок на расходование денежных средств".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ИнициаторЗаявокНаРасходованиеДенежныхСредств";
	ОписаниеПрофиля.Идентификатор = "66db1fed-b624-44eb-b74e-4884f543838d";
	ОписаниеПрофиля.Родитель      = "Финансы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Инициатор заявок на расходование денежных средств'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоПланированиеИКонтрольДенежныхСредств");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	
	// Добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	//-- НЕ УХ
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем вводятся и отслеживаются заявки на расходование денежных средств'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_УчастникПланированияПродаж
	// Профиль "Участник планирования продаж".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникПланированияПродаж";
	ОписаниеПрофиля.Идентификатор = "bccb7814-f58a-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник планирования продаж'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНормативовРаспределения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативовРаспределения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановПродаж");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");

	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПроцессомПланирования");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	// Дополнительные роли для чтения отчета исполнимости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	
	// Дополнительные права.
	
	// Сезонные коэффициенты
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСезонныхКоэффициентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСезонныхКоэффициентов");
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиУчастникПланированияПродаж(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит формирование планов продаж и контроль их исполнения.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_УчастникПланированияПродажПоКатегориям
	// Профиль "Участник планирования продаж по категориям".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникПланированияПродажПоКатегориям";
	ОписаниеПрофиля.Идентификатор = "bccb7813-f58a-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник планирования продаж по категориям'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНормативовРаспределения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативовРаспределения");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродажПоКатегориям");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродажПоКатегориям");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановПродажПоКатегориям");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	// Дополнительные права.

	// Сезонные коэффициенты
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСезонныхКоэффициентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСезонныхКоэффициентов");
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит формирование планов продаж по категориям.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_УчастникПрогнозированияПродажПриПомощиСервиса
	// Профиль "Участник прогнозирования продаж при помощи сервиса".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникПланированияПродажПриПомощиСервиса";
	ОписаниеПрофиля.Идентификатор = "b0cb7814-f58a-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник планирования продаж при помощи сервиса прогнозирования продаж'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродажПоКатегориям");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродажПоКатегориям");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");

	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	// Дополнительные роли для чтения отчета исполнимости
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановВнутреннихПотреблений");
	
	// Сезонные коэффициенты
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиУчастникПрогнозированияПродаж(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит запрос планов продаж у сервиса прогнозирования и их просмотр.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_АдминистраторПрогнозированияПродажПриПомощиСервиса
	// Профиль "Администратор прогнозирования продаж при помощи сервиса".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "АдминистраторСервисаПрогнозированияПродаж";
	ОписаниеПрофиля.Идентификатор = "b1cb7814-f58a-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администратор сервиса прогнозирования продаж'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативовРаспределения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродажПоКатегориям");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродажПоКатегориям");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановПродаж");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");

	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	
	// Дополнительные роли для чтения отчета исполнимости
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановВнутреннихПотреблений");
	
	// Сезонные коэффициенты
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиАдминистраторПрогнозированияПродаж(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит настройка сервиса прогнозирования продаж и его использование.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_УчастникПланированияЗакупок
	// Профиль "Участник планирования закупок".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникПланированияЗакупок";
	ОписаниеПрофиля.Идентификатор = "bccb7812-f58a-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник планирования закупок'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОстатков");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановОстатков");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановОстатков");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПроцессомПланирования");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	// Дополнительные роли для чтения отчета исполнимости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	
	// Дополнительные права.
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит формирование планов закупок и контроль их исполнения.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_УчастникПланированияСборокРазборок
	// Профиль "Участник планирования сборок (разборок)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникПланированияСборокРазборок";
	ОписаниеПрофиля.Идентификатор = "bccb7811-f58a-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник планирования сборок (разборок)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановСборкиРазборки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОстатков");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановСборкиРазборки");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановСборкиРазборки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановОстатков");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановОстатков");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПроцессомПланирования");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаСборкиРазборки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	// Дополнительные роли для чтения отчета исполнимости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	
	// Дополнительные права.
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит формирование планов сборки (разборки) и контроль их исполнения.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_УчастникПланированияВнутреннихПотреблений
	// Профиль "Участник планирования продаж".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникПланированияВнутреннихПотреблений";
	ОписаниеПрофиля.Идентификатор = "bccb7814-f58a-11e9-8805-1831bf523f06";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Участник планирования внутренних потреблений'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановВнутреннихПотреблений");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановВнутреннихПотреблений");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановВнутреннихПотреблений");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПроцессомПланирования");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаВнутреннихПотреблений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");
	// Дополнительные роли для чтения отчета исполнимости
	
	// Дополнительные права.
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит формирование планов внутренних потреблений и контроль их исполнения.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_АдминистраторПланирования
	
	// Профиль "Администратор планирования".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "АдминистраторПланирования";
	ОписаниеПрофиля.Идентификатор = "00437d66-f57b-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Родитель      = "Планирование";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администратор планирования'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
		
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорчиТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");

	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсточниковДанныхПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевПланирования");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПланов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	
	// Отчеты и обработки.
	
	// Дополнительные права.
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиАдминистраторПланирования(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит создание и настройка сценариев товарного планирования и правил его заполнения.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ОтправкаПечатныхФормИОтчетов
	
	// Профиль "Отправка печатных форм и отчетов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтправкаПечатныхФормИОтчетов";
	ОписаниеПрофиля.Идентификатор = "6297f216-b33f-4db0-b40d-08b80e8d4ca3";
	ОписаниеПрофиля.Родитель      = "Прочее";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Отправка печатных форм и отчетов (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Профиль дает права на отправку отчетов и писем без права добавления и изменения учетных записей электронной почты, а так же просмотра истории отправки писем.'",
		 ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти
	
	РетроБонусыСервер.ДополнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	УправлениеДоступомЛокализация.ДополнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);

КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииЗависимостейПравДоступа.
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов.
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриОпределенииИнтерфейсаНастройкиДоступа.
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
	//++ НЕ ГОСИС
	
	УпрощенныйИнтерфейс = ПолучитьФункциональнуюОпцию("БазоваяВерсия");
	
	//-- НЕ ГОСИС
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииИспользованияВидаДоступа.
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидДоступа = "ГруппыНоменклатуры" Тогда
		
		Использование = Константы.ИспользоватьГруппыДоступаНоменклатуры.Получить();
		
	ИначеЕсли ВидДоступа = "ГруппыПартнеров" Тогда
		
		Использование = Константы.ИспользоватьГруппыДоступаПартнеров.Получить();
		
	ИначеЕсли ВидДоступа = "ГруппыФизическихЛиц" Тогда
		
		Использование = Ложь;
		
	ИначеЕсли ВидДоступа = "ХозяйственныеОперации"
	 ИЛИ ВидДоступа = "СоглашенияСКлиентамиЧтение"
	  ИЛИ ВидДоступа = "СоглашенияСКлиентамиИзменение" Тогда
		
		Использование = Истина;
		
	КонецЕсли;
	
	УправлениеДоступомЛокализация.ЗаполнитьИспользованиеВидаДоступа(ВидДоступа, Использование);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	Если Список = Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений Тогда
		
		Ограничение.Текст =
		"ПрисоединитьДополнительныеТаблицы
		|ЭтотСписок КАК ЭтотСписок
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатурыНаборовСвойств 
		|ПО ВидыНоменклатурыНаборовСвойств.НаборСвойств = ЭтотСписок.Ссылка
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатурыНаборовСвойствХарактеристик
		|ПО ВидыНоменклатурыНаборовСвойствХарактеристик.НаборСвойствХарактеристик = ЭтотСписок.Ссылка
		|;
		|РазрешитьЧтение
		|ГДЕ ИСТИНА
		|;
		|РазрешитьИзменениеЕслиРазрешеноЧтение
		|ГДЕ
		|	ЭтоГруппа
		|	ИЛИ ЗначениеРазрешено(ВидыНоменклатурыНаборовСвойств.Ссылка)
		|	ИЛИ ЗначениеРазрешено(ВидыНоменклатурыНаборовСвойствХарактеристик.Ссылка)";
		
	ИначеЕсли Список = Метаданные.Документы.Встреча
	      Или Список = Метаданные.Документы.ЗапланированноеВзаимодействие Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Автор, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Участники.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(Участники.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)";
		
	ИначеЕсли Список = Метаданные.Документы.СообщениеSMS Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Автор, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Адресаты.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(Адресаты.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)";
		
	ИначеЕсли Список = Метаданные.Документы.ТелефонныйЗвонок Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Автор, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(АбонентКонтакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(АбонентКонтакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)";
		
	ИначеЕсли Список = Метаданные.Документы.ЭлектронноеПисьмоВходящее Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(УчетнаяЗапись, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ПолучателиПисьма.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(ПолучателиПисьма.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ПолучателиКопий.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(ПолучателиКопий.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ПолучателиОтвета.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(ПолучателиОтвета.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)";
		
	ИначеЕсли Список = Метаданные.Документы.ЭлектронноеПисьмоИсходящее Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Автор, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(УчетнаяЗапись, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ПолучателиПисьма.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(ПолучателиПисьма.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ПолучателиКопий.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(ПолучателиКопий.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ПолучателиОтвета.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(ПолучателиОтвета.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ПолучателиСкрытыхКопий.Контакт ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(ВЫРАЗИТЬ(ПолучателиСкрытыхКопий.Контакт КАК Справочник.КонтактныеЛицаПартнеров).Владелец, Отключено КАК Ложь)";
		
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриИзмененииНаборовЗначенийДоступа.
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

// См. РаботаВМоделиСервисаБТСПереопределяемый.УстановитьПраваПоУмолчанию
//
Процедура УстановитьПраваПоУмолчанию(Пользователь, ДоступРазрешен) Экспорт

	Если ДоступРазрешен Тогда
		СвойстваПрофиляПродажи = ПрофильМенеджерПоПродажам();
		ДобавитьПользователяВГруппуСУказаннымПрофилем(Пользователь, СвойстваПрофиляПродажи);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДоступКРеквизитамОбъектовМетаданных

// Проверяет допустимость изменения реквизитов существующего элемента справочника перед записью.
//
// Параметры:
//		Объект - СправочникОбъект - объект любого справочника
//		НепроверяемыеРеквизиты - Строка - перечень реквизитов, изменение которых не надо контролировать
//		Отказ - Булево - признак отказа от записи.
// 
// Возвращаемое значение:
//  Булево - Флаг допустимости изменения реквизитов справочника
Функция ПроверитьДопустимостьИзмененияРеквизитовСправочника(Объект, НепроверяемыеРеквизиты = "", Отказ = Ложь) Экспорт
	
	Если Объект.ЭтоНовый() Тогда
		Возврат Истина; // для новых элементов нет необходимости проверять
	КонецЕсли;
	
	ЭтоГруппа = (Объект.Метаданные().Иерархический И Объект.ЭтоГруппа);
	НедоступныеРеквизиты = ЗначениеНастроекПовтИсп.НедоступныеДляРедактированияРеквизитыСправочника(Объект.Метаданные().Имя, ЭтоГруппа, НепроверяемыеРеквизиты);
	
	Если ПустаяСтрока(НедоступныеРеквизиты) Тогда
		Возврат Истина; // нет недоступных для редактирования реквизитов
	КонецЕсли;
	
	ОшибочноИзмененныеРеквизиты = "";
	
	РеквизитыОбъекта = Новый Структура(НедоступныеРеквизиты);
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, Объект);
	
	РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, НедоступныеРеквизиты);
	
	Для Каждого КлючИЗначение Из РеквизитыОбъекта Цикл
		Если КлючИЗначение.Значение <> РеквизитыСсылки[КлючИЗначение.Ключ] Тогда
			ОшибочноИзмененныеРеквизиты =
				ОшибочноИзмененныеРеквизиты + ?(ПустаяСтрока(ОшибочноИзмененныеРеквизиты), "", ", ") + """" + КлючИЗначение.Ключ + """";
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ОшибочноИзмененныеРеквизиты) Тогда
		Возврат Истина; // на все измененные реквизиты есть права
	КонецЕсли;
	
	СообщениеОбОшибке = НСтр("ru = 'Недостаточно прав на изменение реквизит%1 %2'");
	СообщениеОбОшибке =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			СообщениеОбОшибке,
			?(Найти(ОшибочноИзмененныеРеквизиты, ",") > 0, "ов:", "а"),
			ОшибочноИзмененныеРеквизиты);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,, Отказ);
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Служебная функция. Сделана экспортной для удобства внедрения.
//
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт

	// Запуск 1С:Предприятия
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	
	// Задачи и задания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	
	// Заметки и напоминания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	//Инциденты
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнцидентов");
	
	// Электронная подпись
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования");
	ОписаниеПрофиля.Роли.Добавить("ШифрованиеИРасшифровкаДанных");
	
	// Файлы и папки файлов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	
	// Подсистема печать
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	
	// Подсистема органайзер
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	
	// Дополнительные сведения
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	
	// Редактирование реквизитов объектов
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	
	// Использование дополнительных отчетов и обработок
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДополнительныхОтчетовИОбработокУТ");
	
	// Варианты отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	// Подключаемое оборудование
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	
	// Текущие дела
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	
	// Базовая НСИ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтносительныхКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрВалют");
	
	// Проверки состояния системы
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроверокСостоянияСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовПроверкиУчета");
	
	// Сторнирование документов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСторно");
	
	// Описание процессов
	ДемонстрационныеСценарии.ДобавитьРолиЧтениеОбъектовПодсистемыОписаниеПроцессов(ОписаниеПрофиля);
	
	УправлениеДоступомЛокализация.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.


//
Процедура ДобавитьРолиБухгалтераРеглУчетаНаЧтение(ОписаниеПрофиля) Экспорт
	
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппАналитическогоУчетаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторовНастроекДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторовНастроекПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНомеровГТД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");

	
	// Документы чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеОтгрузки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПриемкиПоПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПриемкиПоВозвратуОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииКлиенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктПремииПоставщика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповТоваровХранителем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовИнвентаризацииНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоБанку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасхожденийПриИнкассацииДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНачисленияКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОжидаемыхПоступленийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеИзлишковНедостачПорчи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовБанкаПоОперациямЭквайринга");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОЗакупках");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхВозвратах");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересчетовТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорученийЭкспедиторам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугВПодразделение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенийРасходовБудущихПериодов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенияПрочихЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписанийРасхожденийПоступлениеПриобретение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОСписанииПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявленийОВвозеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	
	


	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаПеремещениеДенежныхСредств");
	//-- НЕ УХ
	
	// Чтение регистров.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроцентныхРасходовДисконтирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетыПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюИзлишковНедостач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФинансовыхРезультатов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");

	
	// Регистры расширенной аналитики взаиморасчетов
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийКонтрагентДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийКонтрагентКонтрагент");
	
	// Регистры расширенной аналитики себестоимости товаров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	
	
	// Регистры расширенной аналитики денежных средств
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПлатежей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");

	//
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеАнализСтатейКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиДокументыВнутреннегоТовародвиженияКОформлению");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовИнтеркампани");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиОперацииЗакрытияМесяца");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеПередачТоваровМеждуОрганизациямиИВыкупов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроблемыПроверкиКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиБухгалтера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыПереданныеНаКомиссию");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПоРасчетамМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаНДССАвансов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоДвижениюДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЗапросКоличестваИСерий");

	//++ НЕ УХ
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПланФактныйАнализФинансовыхИнструментов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРеестрКредитовИДепозитов");
	//-- НЕ УХ

	
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупкиРетроБонусыПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаКазначейство");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаФинансовыйРезультатИКонтроллинг");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	// Доступ на чтение к учету НДС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровНДС");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюДокументовИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоУчетуНДС");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
	УправлениеДоступомЛокализация.ДобавитьРолиБухгалтераРеглУчетаНаЧтение(ОписаниеПрофиля);
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.
//
Процедура ДобавитьРолиБухгалтераРеглУчетаНаИзменение(ОписаниеПрофиля) Экспорт
	
	
	ТМЦВЭксплуатацииСервер.ДобавитьРолиДляДоступаКПодсистемеНаИзменение(ОписаниеПрофиля);
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппАналитическогоУчетаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеФинансовойГруппыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНомеровГТД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ВнутреннееПотреблениеСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРасхожденийПриИнкассацииДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНачисленияКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенийРасходовБудущихПериодов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПрочихЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегламентныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийРасхожденийПоступлениеПриобретение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОСписанииПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПоУчетуНДС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявленийОВвозеТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНаАванс");
		
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахПродажи");

	УправлениеДоступомЛокализация.ДобавитьРолиБухгалтераРеглУчетаНаИзменение(ОписаниеПрофиля);
	
КонецПроцедуры


#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
Процедура УстановитьНаименованиеГруппПрофилейГруппДоступа(Элементы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрофилиГруппДоступа.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
		|ГДЕ
		|	ПрофилиГруппДоступа.ЭтоГруппа
		|	И ПрофилиГруппДоступа.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПредопределенныеГруппы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИмяПредопределенныхДанных");
	
	Если ПредопределенныеГруппы.Найти("АдминистрированиеИНСИ") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "АдминистрированиеИНСИ";
		Элемент.Наименование = НСтр("ru = 'Администрирование и НСИ'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("Бюджетирование") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "Бюджетирование";
		Элемент.Наименование = НСтр("ru = 'Бюджетирование'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("ГосударственныеИнформационныеСистемы") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ГосударственныеИнформационныеСистемы";
		Элемент.Наименование = НСтр("ru = 'Государственные информационные системы'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("ЗакупкиИЗапасы") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ЗакупкиИЗапасы";
		Элемент.Наименование = НСтр("ru = 'Закупки и запасы'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("ЗарплатаИКадры") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "ЗарплатаИКадры";
		Элемент.Наименование = НСтр("ru = 'Зарплата и кадры'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("МеждународныйФинансовыйУчет") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "МеждународныйФинансовыйУчет";
		Элемент.Наименование = НСтр("ru = 'Международный финансовый учет'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("Планирование") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "Планирование";
		Элемент.Наименование = НСтр("ru = 'Планирование'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("Продажи") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "Продажи";
		Элемент.Наименование = НСтр("ru = 'Продажи'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("Производство") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "Производство";
		Элемент.Наименование = НСтр("ru = 'Производство'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("Прочее") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "Прочее";
		Элемент.Наименование = НСтр("ru = 'Прочее'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("УправлениеРемонтами") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "УправлениеРемонтами";
		Элемент.Наименование = НСтр("ru = 'Управление ремонтами'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ПредопределенныеГруппы.Найти("Финансы") <> Неопределено Тогда
		Элемент = Элементы.Добавить();
		Элемент.ИмяПредопределенныхДанных = "Финансы";
		Элемент.Наименование = НСтр("ru = 'Финансы'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

// Возвращает свойства профиля "МенеджерПоПродажам"
// 
// Возвращаемое значение:
// 	Структура - описание:
// 	* УИД - УникальныйИдентификатор - уникальный идентификатор профиля
// 	* Наименование - Строка - наименование профиля групп доступа
// 	* Идентификатор - Строка - строковое представление идентификатора
// 	* Имя - Строка - имя профиля
//
Функция ПрофильМенеджерПоПродажам()
	
	МенеджерПоПродажам = Новый Структура;
	МенеджерПоПродажам.Вставить("Имя", "МенеджерПоПродажам");
	МенеджерПоПродажам.Вставить("Наименование", НСтр("ru = 'Менеджеры по продажам'"));
	МенеджерПоПродажам.Вставить("Идентификатор", "50ef1c86-a324-11ef-8cb7-3c7c3fc28e23");
	МенеджерПоПродажам.Вставить("УИД", Новый УникальныйИдентификатор("50ef1c86-a324-11ef-8cb7-3c7c3fc28e23"));

	Возврат МенеджерПоПродажам;
	
КонецФункции

// Добавляет пользователя в группу с указанным профилем с наибольшим количеством пользователей, при условии,
// что он не состоит больше ни в каких группах.
// 
// Параметры:
// 	Пользователь - СправочникСсылка.Пользователи - пользователь, которого следует добавить в группу,
// 	СвойстваПрофиля - см. ПрофильМенеджерПоПродажам.
//
Процедура ДобавитьПользователяВГруппуСУказаннымПрофилем(Пользователь, СвойстваПрофиля)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГруппыДоступаПользователи.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &Пользователь
	|	И НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГруппыДоступа.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	НЕ ГруппыДоступа.Ссылка.ПометкаУдаления
	|	И ГруппыДоступа.Ссылка.Профиль.ИдентификаторПоставляемыхДанных = &ИдентификаторПрофиляГруппы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГруппыДоступаПользователи.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
	|	И ГруппыДоступаПользователи.Ссылка.Профиль.ИдентификаторПоставляемыхДанных = &ИдентификаторПрофиляГруппы
	|УПОРЯДОЧИТЬ ПО
	|	ГруппыДоступаПользователи.НомерСтроки УБЫВ";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ИдентификаторПрофиляГруппы", СвойстваПрофиля.УИД);

	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатыЗапроса[0].Пустой() Тогда
		ПользовательУжеСостоитВГруппеДоступа = СтрШаблон(НСтр("ru = 'Пользователь %1 уже состоит в группе доступа.'"),
			Пользователь);
		ИмяФункции = "УправлениеДоступомУТ.ДобавитьПользователяВГруппуСУказаннымПрофилем";
		ЗаписьЖурналаРегистрации(СтрШаблон(НСтр("ru = '%1'",
			ОбщегоНазначения.КодОсновногоЯзыка()),ИмяФункции), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.Пользователи, , ПользовательУжеСостоитВГруппеДоступа);
		Возврат;
	КонецЕсли;

	Если РезультатыЗапроса[1].Пустой() Тогда
		
		НачатьТранзакцию();
		Попытка
			
			ГруппаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
			ГруппаОбъект.Наименование = СвойстваПрофиля.Наименование;
			ГруппаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПолучитьСсылку(СвойстваПрофиля.УИД);
			ГруппаОбъект.Пользователи.Добавить().Пользователь = Пользователь;
			
			ГруппаОбъект.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			СообщениеОбОшибке = СтрШаблон(
			НСтр("ru = 'Не удалось создать группу доступа по причине:
				 |%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ИмяФункции = "УправлениеДоступомУТ.ДобавитьПользователяВГруппуСУказаннымПрофилем";
			ЗаписьЖурналаРегистрации(СтрШаблон(НСтр(
					"ru = '%1'",
				ОбщегоНазначения.КодОсновногоЯзыка()),ИмяФункции), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.Пользователи, , СообщениеОбОшибке);
			
		КонецПопытки;
		
		Возврат;
		
	КонецЕсли;

	Если РезультатыЗапроса[2].Пустой() Тогда
		Выборка = РезультатыЗапроса[1].Выбрать();
	Иначе
		Выборка = РезультатыЗапроса[2].Выбрать();
	КонецЕсли;

	Если Выборка.Следующий() Тогда
		НачатьТранзакцию();
		Попытка
			ГруппаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ГруппаОбъект.Заблокировать();
			НоваяСтрокаПользователи = ГруппаОбъект.Пользователи.Добавить();
			НоваяСтрокаПользователи.Пользователь = Пользователь;
			ГруппаОбъект.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			СообщениеОбОшибке = СтрШаблон(
			НСтр("ru = 'Не удалось добавить пользователя ""%1"" в группу доступа ""%2"" по причине:
				 |%3'"), Пользователь, Выборка.Ссылка, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ИмяФункции = "УправлениеДоступомУТ.ДобавитьПользователяВГруппуСУказаннымПрофилем";
			ЗаписьЖурналаРегистрации(СтрШаблон(НСтр(
					"ru = '%1'",
				ОбщегоНазначения.КодОсновногоЯзыка()),ИмяФункции), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.Пользователи, , СообщениеОбОшибке);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
