#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
&Вместо("УстановитьБлокировкиДанныхДляРасчетаГрафика")
Процедура Док_УстановитьБлокировкиДанныхДляРасчетаГрафика(ТаблицаОбъектовОплаты, ИмяТаблицы, ИмяПоля, ИмяКолонки = "ОбъектОплаты") Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаОбъектовОплаты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ИмяПоля, ИмяКолонки);
	// ошибка после обновления
	//Блокировка.Заблокировать();
	
КонецПроцедуры
#КонецЕсли