&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Объект", Параметры.Партнер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Параметры.Партнер));
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбраннаяСтрока= Элементы.Список.ТекущиеДанные;
	ВыбратьОбработкаВыбора(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьОбработкаВыбора(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОбработкаВыбора(ВыбраннаяСтрока)
	ВыбраннаяСтрока1= Элементы.Список.ТекущиеДанные;
	
	Закрыть(ВыбраннаяСтрока1);
КонецПроцедуры


