#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СформироватьПечатнуюФормуШтрихкода(Штрихкод) Экспорт
	ТабДок= Новый ТабличныйДокумент;
	Макет= ПолучитьМакет("МакетШтрихкода");
	Шапка= Макет.ПолучитьОбласть("Шапка");
	
	мСсылкок= ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод);
	Если мСсылкок.Количество() > 0 Тогда
		Шапка.Параметры.Ссылка= мСсылкок[0];
	КонецЕсли;
	
	//Штрихкод
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Рисунок= Шапка.Рисунки[0];
	
	//ШтрихкодПечать= ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Штрихкод);
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(Штрихкод));
	ПараметрыШтрихкода.Вставить("ТипКода",         4);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    12);
	
	Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	//-	
	
	ТабДок.Вывести(Шапка);
	
	Возврат ТабДок;
КонецФункции

Функция ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Знач ДесятичноеЧисло)
	
	Результат = "";
	
	Пока ДесятичноеЧисло > 0 цикл
		ОстатокОтДеления = ДесятичноеЧисло % 16;
		ДесятичноеЧисло  = (ДесятичноеЧисло - ОстатокОтДеления) / 16;
		Результат        = Сред("0123456789abcdef", ОстатокОтДеления + 1, 1) + Результат;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
