
&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	ОбновитьПрисоеденненныеФайлы();
КонецПроцедуры      

//Обновляем дату редактирования у присоединенных файлов владельца для полного обмена с сайтом
Процедура ОбновитьПрисоеденненныеФайлы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Файл
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (НоменклатураПрисоединенныеФайлы.ВладелецФайла = Номенклатура.Ссылка)
	|ГДЕ
	|	Номенклатура.Ссылка = &ВладелецФайла";
	Запрос.УстановитьПараметр("ВладелецФайла", ЭтотОбъект.ВладелецФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	Изминений = 0;
	Пока Выборка.Следующий() Цикл
		ПрисоединенныйФайл = Выборка.Файл.ПолучитьОбъект();  
		Если ТекущаяДата() - ПрисоединенныйФайл.ДатаМодификацииУниверсальная > 604800 Тогда 
			ПрисоединенныйФайл.ДатаМодификацииУниверсальная = ТекущаяДата();
			ПрисоединенныйФайл.Записать();
			Изминений = Изминений + 1;
		КонецЕсли;
	КонецЦикла; 
	Если Изминений > 0 Тогда
		Номенклатура = ЭтотОбъект.ВладелецФайла.ПолучитьОбъект(); 
		//Без записи номенклатуры картинки на сайте пропадут
		Номенклатура.Записать(); 
	КонецЕсли;
КонецПроцедуры;