#Область ПрограммныйИнтерфейс

// Возвращает дату начала применения единого налогового счета
// 
// Возвращаемое значение:
//	Дата - Дата начала использования ЕНС
//
Функция ДатаНачалаПрименения() Экспорт
	
	Возврат '20230101';
	
КонецФункции

Функция РеквизитыМИДол(Знач ДатаСведений = '0001-01-01') Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСведений) Тогда
		ДатаСведений = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Реквизиты получателя единого налогового платежа едины для всех.
	// Поэтому зададим их в явном виде.
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка");
	Реквизиты.Вставить("Код", "9967");
	Реквизиты.Вставить("ИНН", "7727406020");
	
	Если ДатаСведений >= '2025-12-05' Тогда
		Реквизиты.Вставить("КПП", "770701001");
		Реквизиты.Вставить("Наименование",
			НСтр("ru = 'МИ ФНС России по управлению долгом'"));
		Реквизиты.Вставить("ПолноеНаименование",
			НСтр("ru = 'Межрегиональная инспекция Федеральной налоговой службы по управлению долгом'"));
	Иначе
		Реквизиты.Вставить("КПП", "770801001");
		Реквизиты.Вставить("Наименование",
			НСтр("ru = 'МИ ФНС России по управлению долгом'"));
		Реквизиты.Вставить("ПолноеНаименование",
			НСтр("ru = 'Межрегиональная инспекция Федеральной налоговой службы по управлению долгом'"));
	КонецЕсли;
	
	Реквизиты.Вставить("ПлатежныеРеквизиты", ЗначенияРеквизитовЕдиногоНалоговогоСчета());
	
	Реквизиты.ПлатежныеРеквизиты.Вставить("Банк");
	Реквизиты.ПлатежныеРеквизиты.Вставить("БанковскийСчет");
	Реквизиты.ПлатежныеРеквизиты.Вставить("ПолучательПлатежа",
		НСтр("ru = 'Казначейство России (ФНС России)'"));
	
	Возврат Реквизиты;
	
КонецФункции

Функция ЭтоРеквизитыЕдиногоНалоговогоСчета(ПлатежныеРеквизиты) Экспорт
	
	Если Не ЗначениеЗаполнено(ПлатежныеРеквизиты) Или ТипЗнч(ПлатежныеРеквизиты) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыЕНС = ЗначенияРеквизитовЕдиногоНалоговогоСчета();
	КлючиДляПроверки = Новый Структура("БИК, РасчетныйСчет, КоррСчет");
	
	Для Каждого КлючИЗначение Из КлючиДляПроверки Цикл
		Если Не ПлатежныеРеквизиты.Свойство(КлючИЗначение.Ключ)
			Или РеквизитыЕНС[КлючИЗначение.Ключ] <> ПлатежныеРеквизиты[КлючИЗначение.Ключ] Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначенияРеквизитовЕдиногоНалоговогоСчета() Экспорт
	
	// Реквизиты единого налогового счета едины для всех.
	// Поэтому зададим их в явном виде.
	
	Реквизиты = Новый Структура();
	
	Реквизиты.Вставить("БИК",           "017003983");
	Реквизиты.Вставить("РасчетныйСчет", "03100643000000018500");
	Реквизиты.Вставить("КоррСчет",      "40102810445370000059");
	Реквизиты.Вставить("НаименованиеБанка",
		НСтр("ru = 'ОТДЕЛЕНИЕ ТУЛА БАНКА РОССИИ//УФК по Тульской области г. Тула'"));
	Реквизиты.Вставить("ТекстКорреспондента", "");
	
	Возврат Реквизиты;
	
КонецФункции

Функция ВидыНалоговУплачиваемыеОтдельно(Знач Период = '00010101') Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	ИначеЕсли Период < ДатаНачалаПрименения() Тогда
		Период = ДатаНачалаПрименения();
	КонецЕсли;
	
	Период = НачалоМесяца(Период);
	
	Возврат ЕдиныйНалоговыйСчетПовтИсп.ВидыНалоговУплачиваемыеОтдельно(Период);
	
КонецФункции


Функция ДатаВыделенияДополнительныхВзносовЛетчиковИШахтеровИзСоставаЕНП() Экспорт
	Возврат '20250101'
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
