//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РеестрКредитовИДепозитов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Реквизиты договоров кредитов и депозитов.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РеестрДоговоровКредитовДепозитов");
	ОписаниеВарианта.Описание = НСтр("ru= 'Договоры указанного типа с реквизитами,
		|суммами плана оплат и начислений, фактом оплат и начислений,
		|отклонениями и остатком долга по договору.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
