#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Перед("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда
		
		Основание =ДанныеЗаполнения.Ссылка;
		Склад = ДанныеЗаполнения.СкладПолучатель;
				
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		
		Склад = ДанныеЗаполнения.Склад;
		Подразделение = ДанныеЗаполнения.Склад.Подразделение;
		АналитикаДоходов = ДанныеЗаполнения.Склад.Подразделение;
		АналитикаРасходов = ДанныеЗаполнения.Склад.Подразделение;
				
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(ЭтотОбъект.ПересчетТоваров) Тогда 
		ДопМодульСервер.КонтрольОстатковПоПересчетам(Ссылка,Отказ); 
	КонецЕсли ; 
КонецПроцедуры

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		
		Если Альтерра_СкладСервер.ПоАктуСуществуетОрдерНаОтражение(Ссылка) Тогда
			Сообщить("Документ нельзя пометить на удаление, так как по нему создан ордер на отражение!");
			Отказ = Истина;
		КонецЕсли;
				
	КонецЕсли;
КонецПроцедуры

#КонецЕсли

&Перед("ИнициализироватьДокумент")
Процедура Док_ИнициализироватьДокумент(ДанныеЗаполнения)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения1(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		
		Склад = ДанныеЗаполнения.Склад;
		Подразделение = ДанныеЗаполнения.Склад.Подразделение;
		АналитикаДоходов = ДанныеЗаполнения.Склад.Подразделение;
		АналитикаРасходов = ДанныеЗаполнения.Склад.Подразделение;
				
	КонецЕсли;
КонецПроцедуры
