#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// Записать регистр расчета
// ТаблицаТовары - таблица значений для записи
// Показатель - показатель расчета
//
Процедура ЗаписатьПоказателиРегистраТаблица(ТаблицаТовары,ПоказательРасчета) экспорт
	//тз=Новый таблицазначений();
	//тз.Колонки.Добавить(
	для каждого Измерение из Метаданные.РегистрыСведений.оп_РезультатРасчетаПоказателей.Измерения цикл
		если ТаблицаТовары.колонки.Найти(измерение.имя)=неопределено тогда
			ТаблицаТовары.колонки.Добавить(измерение.имя,измерение.тип);
		конецесли;	 
	конеццикла;	
	
	если ПоказательРасчета.ОчищатьПоказатель тогда
	НаборЗаписей = РегистрыСведений.оп_РезультатРасчетаПоказателей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Показатель.Установить(ПоказательРасчета);
	НаборЗаписей.Записать();
	конецесли;	
	для каждого стр из ТаблицаТовары цикл
	НаборЗаписей = РегистрыСведений.оп_РезультатРасчетаПоказателей.СоздатьНаборЗаписей();
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, стр);
		ЗаписьРегистра.Показатель= ПоказательРасчета;
		ЗаписьРегистра.ДатаРасчета= ТекущаяДата();
		ЗаписьРегистра.Пользователь=Пользователи.ТекущийПользователь();
		
		//если не ПоказательРасчета.ОчищатьПоказатель тогда
		НаборЗаписей.Отбор.Номенклатура.Установить(стр.Номенклатура);
		НаборЗаписей.Отбор.Характеристика.Установить(стр.Характеристика);
		НаборЗаписей.Отбор.Склад.Установить(стр.Склад);
		НаборЗаписей.Отбор.ДопПараметрДата.Установить(стр.ДопПараметрДата);
		НаборЗаписей.Отбор.Показатель.Установить(ПоказательРасчета);
		//конецесли;
//		попытка 
		НаборЗаписей.Записать();
	//исключение
	//	конецпопытки;
	конеццикла;
	
КонецПроцедуры

#КонецЕсли
