#Область HTTP

Функция ПолучитьHTTPСоединениеК1С(ПараметрыПодключения, Сервис) Экспорт

	Если ПараметрыПодключения.ИспользоватьSSL Тогда
		ssl = Новый ЗащищенноеСоединениеOpenSSL;
	Иначе
		ssl= Неопределено;
	КонецЕсли;
	
	СрокаСервиса= "hs/"+Сервис+"/";
	
	СтрокаПодключения= ПараметрыПодключения.АдресСервера+"/"+ПараметрыПодключения.ИмяБазы+"/"+СрокаСервиса;
	
	Соединение = Новый HTTPСоединение(
	СтрокаПодключения, // сервер (хост)
	ПараметрыПодключения.Порт, // порт, по умолчанию для http используется 80, для https 443
	ПараметрыПодключения.Логин, // пользователь для доступа к серверу (если он есть)
	ПараметрыПодключения.Пароль, // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	ssl  // защищенное соединение, если используется https
	);
	
	Возврат Соединение;
КонецФункции
Функция ПолучитьHTTPСоединение(ПараметрыПодключения) Экспорт
	Если ПараметрыПодключения.ИспользоватьSSL Тогда
		ssl = Новый ЗащищенноеСоединениеOpenSSL;
	Иначе
		ssl= Неопределено;
	КонецЕсли;
	
	//СтрокаПодключения = ПараметрыПодключения.АдресСервера +"/";

	Соединение = Новый HTTPСоединение(
	ПараметрыПодключения.АдресСервера, // сервер (хост)
	ПараметрыПодключения.Порт, // порт, по умолчанию для http используется 80, для https 443
	ПараметрыПодключения.Логин, // пользователь для доступа к серверу (если он есть)
	ПараметрыПодключения.Пароль, // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	ssl  // защищенное соединение, если используется https
	);
	
	Возврат Соединение;
КонецФункции

Функция ПослатьGETЗапрос(ПараметрыHTTPСоединения, АдресHTTPЗапроса) Экспорт
	Попытка
		Ответ = ПолучитьHTTPСоединение(ПараметрыHTTPСоединения).ВызватьHTTPМетод("GET", Новый HTTPЗапрос(АдресHTTPЗапроса));
	Исключение
		Сообщить("Ошибка при получении ответа!" + Символы.ПС + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Если Ответ.КодСостояния > 299 Тогда
		Если Ответ.КодСостояния = 404 Тогда
			Сообщить("Заказа нет на сайте. Убедитесь, что галочка Передать на сайт установлена и подождите несколько минут.");
			Возврат Неопределено;
		ИначеЕсли Ответ.КодСостояния = 410 Тогда
			Сообщить("Заказ закрыт или уже оплачен. Оплата не требуется.");
			Возврат Неопределено;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Необходимо обратиться в техническую поддержку.");
			Возврат Неопределено;
		Иначе	
			Сообщить("Ошибка при получении ответа! Код состояния: " + Ответ.КодСостояния);
			Возврат Неопределено;
		КонецЕсли;	
	Иначе
		Возврат ДесериализоватьИзJSON(Ответ.ПолучитьТелоКакСтроку());	
	КонецЕсли;
КонецФункции
Функция ПослатьPOSTЗапрос(АдресЗапроса, HTTPСоединение, Данные=Неопределено) Экспорт
	Попытка
		HTTPЗапрос= Новый HTTPЗапрос(АдресЗапроса);
		HTTPЗапрос.УстановитьТелоИзСтроки(Данные);
		
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ОтветТело= Ответ.ПолучитьТелоКакСтроку();
		
		ДанныеОтвета= ОбщийHTTPСервер.ДесериализоватьИзJSON(ОтветТело);
	Исключение
		Текст= СтрШаблон("Ошибка выполнение POST %1 запроса", АдресЗапроса);
		Ответ= ОбщийHTTPСервер.ПодготовитьОтвет(Истина, Текст, Данные);
		Возврат Ответ;
	КонецПопытки;
	
	Ответ= ОбщийHTTPСервер.ПодготовитьОтвет(Ложь, Текст, Данные);
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьПараметрыСоединения(АдресСервера, Порт=Неопределено, Логин=Неопределено, Пароль=Неопределено, ИспользоватьSSL=Ложь) Экспорт
	ПараметрыПодключения = Новый Структура;
	
	ПараметрыПодключения.Вставить("Логин", Логин);	
	ПараметрыПодключения.Вставить("Пароль",	Пароль);	
	ПараметрыПодключения.Вставить("АдресСервера", АдресСервера);	
	ПараметрыПодключения.Вставить("Порт", Порт);	
	ПараметрыПодключения.Вставить("ИспользоватьSSL", ИспользоватьSSL);	
	
	Возврат ПараметрыПодключения;
КонецФункции
Функция ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, ТипЗапроса="GET", Данные=Неопределено) Экспорт
	ЕстьОшибка= Ложь;
	
	Попытка
		HTTPЗапрос= Новый HTTPЗапрос(АдресЗапроса);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		
		HTTPЗапрос.УстановитьТелоИзСтроки(Данные);
		
		Если ТипЗапроса="GET" Тогда
			Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="POST" Тогда
			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="PUT" Тогда
			Ответ = HTTPСоединение.Записать(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="DELETE" Тогда
			Ответ = HTTPСоединение.Удалить(HTTPЗапрос);
		КонецЕсли;
		
		Если Ответ.КодСостояния > 299 Тогда
			ЕстьОшибка= Истина;
		КонецЕсли;
		
		ОтветТело= Ответ.ПолучитьТелоКакСтроку();
		
		ДанныеОтвета= ОбщийHTTPСервер.ДесериализоватьИзJSON(ОтветТело);
		
		Текст= ОтветТело;
	Исключение
		Текст= СтрШаблон("Ошибка выполнение POST - %1 запроса", АдресЗапроса);
		Ответ= ПодготовитьОтвет(Истина, Текст, Данные);
		Возврат Ответ;
	КонецПопытки;
	
	
	Если ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда
		Если ДанныеОтвета.Свойство("error") Тогда
			ЕстьОшибка= Истина;
			Текст= СтрШаблон("Ошибка: %1 ""%2""", ДанныеОтвета.error.code, ДанныеОтвета.error.description);
		КонецЕсли;
		Если ДанныеОтвета.Свойство("results") Тогда
			Если ТипЗнч(ДанныеОтвета.results) = Тип("Массив") И ДанныеОтвета.results.Количество() Тогда
				Результат= ДанныеОтвета.results[0]; 
				Если ТипЗнч(Результат) = Тип("Структура") Тогда
					Если Результат.Свойство("error") И Результат.error.code > 0 Тогда
						ЕстьОшибка= Истина;
						Текст= СтрШаблон("Ошибка: %1 ""%2""", Результат.error.code, Результат.error.description);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Ответ= ПодготовитьОтвет(ЕстьОшибка, Текст, ДанныеОтвета);
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область Служебные
Функция ПодготовитьHTTPОтвет(Ошибка, ТекстСообщения="", Данные=Неопределено)  Экспорт
	Ответ= ПодготовитьОтвет(Ошибка, ТекстСообщения, Данные);
	
	ДанныеОтправки= СериализоватьВJSON(Ответ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.УстановитьТелоИзСтроки(ДанныеОтправки, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат HTTPОтвет;
КонецФункции
Функция ПодготовитьОтвет(Ошибка, ТекстСообщения="", Данные=Неопределено)  Экспорт
	Если Данные = Неопределено Тогда
		Данные= Новый Структура();
	КонецЕсли;
	
	Ответ= Новый Структура("Ошибка, ТекстСообщения, Данные", Ошибка, ТекстСообщения, Данные);
	
	Возврат Ответ;
КонецФункции

#КонецОбласти 

#Область Сериализация                                                                 

Функция Сериализовать(ОбъектСериализации) Экспорт
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	ЗаписьXMLОбъект = Новый ЗаписьXML;
	ЗаписьXMLОбъект.УстановитьСтроку();
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь);
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXMLОбъект, ОбъектXDTO);
	Возврат ЗаписьXMLОбъект.Закрыть();
КонецФункции

Функция Десериализовать(ДанныеXML) Экспорт
	ЧтениеXMLОбъект = Новый ЧтениеXML;
	ЧтениеXMLОбъект.УстановитьСтроку(ДанныеXML);
	ДесериализованныйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLОбъект);
	ЧтениеXMLОбъект.Закрыть();
	Возврат ДесериализованныйОбъект;
КонецФункции

Функция СериализоватьВJSON(Данные, БезОтступов = Истина) Экспорт
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;        
		ПараметрыЗаписиJSON = ?(БезОтступов, Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, , Истина), Новый ПараметрыЗаписиJSON( , Символы.Таб)); 
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, Данные);
		ПараметрыJSON = ЗаписьJSON.Закрыть();
		Возврат ПараметрыJSON;
	Исключение
		Сообщить("Ошибка JSON");
		Возврат "{}";
	КонецПопытки;
КонецФункции

Функция ДесериализоватьИзJSON(СтрокаJSON) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);   
	Результат = Неопределено;
	Результат = ПрочитатьJSON(ЧтениеJSON,, "Период,Дата,Data,ДатаПрибытия,ВремяДоставкиПо", ФорматДатыJSON.ISO);	
	ЧтениеJSON.Закрыть();
	
    Возврат Результат;
КонецФункции

#КонецОбласти 

#Область Данные_FNS_API   

Функция ПолучитьДанныеССайтаFNS(ИНН, ВидКонтрагента) Экспорт
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("ИспользоватьSSL", Истина);
	ПараметрыПодключения.Вставить("АдресСервера", "api-fns.ru");
	ПараметрыПодключения.Вставить("Порт", 443);
	ПараметрыПодключения.Вставить("Логин", " ");
	ПараметрыПодключения.Вставить("Пароль", " ");
	
	Соединение = ОбщийHTTPСервер.ПолучитьHTTPСоединение(ПараметрыПодключения);
		
	ПолныеДанные = Новый ТаблицаЗначений;
	ПолныеДанные.Колонки.Добавить("Раздел");
	ПолныеДанные.Колонки.Добавить("Наименование");
	ПолныеДанные.Колонки.Добавить("Информация");
	
	ДополнительныеДанные = Новый Массив;
	
	Выручка = Новый ТаблицаЗначений;
	Выручка.Колонки.Добавить("Год");
	Выручка.Колонки.Добавить("Сумма");
	Выручка.Колонки.Добавить("НСтроки");

	                                               
	УстановитьПривилегированныйРежим(Истина);                                                    
	Ключ = Константы.КлючФНС.Получить();
	Результат1 = ПолучитьДанныеОКомпании(ИНН, Соединение, ПолныеДанные, ДополнительныеДанные, Ключ);
	
	Если ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ПолныеДанные.Добавить().Раздел = "БУХГАЛТЕРСКАЯ ОТЧЕТНОСТЬ";
		НоваяСтрока = ПолныеДанные.Добавить();
		НоваяСтрока.Раздел = "Год";
		НоваяСтрока.Наименование = "Код строки";
		НоваяСтрока.Информация = "Сумма по данной строке в бухгалтерской отчетности (в тыс.руб.)";
	
		Результат2 = ПолучитьБухгалтерскуюОтчетность(ИНН, Соединение, ПолныеДанные, ДополнительныеДанные, Ключ,Выручка);
	КонецЕсли; 

	ДопДанные = Новый ТаблицаЗначений;
	ДопДанные.Колонки.Добавить("Раздел");
	ДопДанные.Колонки.Добавить("Наименование");
	ДопДанные.Колонки.Добавить("Информация");
	
	Для Каждого мЭлементов Из ДополнительныеДанные Цикл
		Если мЭлементов.Ключ = "ДатаРег" Тогда
			НоваяСтрока = ДопДанные.Добавить();
			НоваяСтрока.Раздел = "Дата регистрации";
			НоваяСтрока.Информация = мЭлементов.Значение;
		Иначе 
			ВывестиЭлементДополнительно(мЭлементов, ДопДанные);
		КонецЕсли; 
	КонецЦикла; 

	Выручка.Сортировать("Год Убыв");
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(ПолныеДанные);
	МассивРезультатов.Добавить(ДопДанные);
	МассивРезультатов.Добавить(Выручка);
	
	Возврат МассивРезультатов;
	
КонецФункции

Функция ПолучитьДанныеОКомпании(ИНН, Соединение, ПолныеДанные, ДополнительныеДанные, Ключ)
	
	Запрос = Новый HTTPЗапрос("/api/egr?req=" + ИНН + "&key=" + Ключ);   
	
	Результат = Соединение.Получить(Запрос);
	СтрокаJ = Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);	    
	СтрокаJSON = СтрЗаменить(СтрокаJ,"0000-00-00","0001-01-01");
	
	Если Результат.КодСостояния > 299 Тогда
		Если Результат.КодСостояния = 403 Тогда
			Сообщить("Данные о компании не получены, доступ к ресурсу api-fns отсутствует (лимит запросов истрачен)");
			Возврат ПолныеДанные ;
		Иначе                           
			Сообщить("Данные не получены");
			Возврат ПолныеДанные ;
		КонецЕсли;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);   
	Результат = Неопределено;
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина, "ДатаОГРН,ДатаРег,РегДата,УчетДата,ДатаРегПФ,ДатаРегФСС,Дата", ФорматДатыJSON.ISO);	
	ЧтениеJSON.Закрыть();		
			
	Для Каждого мЭлементов Из Результат Цикл
		Для Каждого Элемент Из мЭлементов.Значение Цикл
			ВывестиЭлемент(Элемент, ПолныеДанные, ДополнительныеДанные);
		КонецЦикла; 
	КонецЦикла; 

	Возврат ПолныеДанные;
	                          
КонецФункции

Функция ПолучитьБухгалтерскуюОтчетность(ИНН, Соединение, ПолныеДанные, ДополнительныеДанные, Ключ, Выручка)
	
	Запрос = Новый HTTPЗапрос("/api/bo?req=" + ИНН + "&key=" + Ключ);   
	
	Результат = Соединение.Получить(Запрос);
	СтрокаJ = Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);	
	СтрокаJSON = СтрЗаменить(СтрокаJ,"0000-00-00","0001-01-01");
	
	Если Результат.КодСостояния > 299 Тогда
		Если Результат.КодСостояния = 403 Тогда
			Сообщить("Данные бухгалтерской отчетности не получены, доступ к ресурсу api-fns отсутствует (лимит запросов истрачен)");
			Возврат ПолныеДанные ;
		Иначе
			Сообщить("Данные не получены");
			Возврат ПолныеДанные ;
		КонецЕсли;
	КонецЕсли;
			
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);   
	Результат = Неопределено;
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина, "ДатаОГРН,ДатаРег,РегДата,УчетДата,ДатаРегПФ,ДатаРегФСС,Дата", ФорматДатыJSON.ISO);	
	ЧтениеJSON.Закрыть();	                                                                                                                                                                                                                                                                                                                                                                                                                            
	
	Для Каждого мЭлементов Из Результат Цикл
		Для Каждого Элемент Из мЭлементов.Значение Цикл
			ВывестиЭлемент(Элемент, ПолныеДанные, ДополнительныеДанные);
		КонецЦикла;
	КонецЦикла; 
	
	Для Каждого мЭлементов Из Результат Цикл
		Для Каждого Элемент Из мЭлементов.Значение Цикл
			ВывестиЭлементВыручка(Элемент, Выручка);
		КонецЦикла;
	КонецЦикла; 

	Возврат ПолныеДанные;	
	
КонецФункции

Функция ВывестиЭлемент(Элемент, ПолныеДанные, ДополнительныеДанные)Экспорт
		
	Если ТипЗнч(Элемент) = Тип("Соответствие") Тогда
		Для Каждого Элемент2 Из Элемент Цикл
			Если Элемент2.Ключ = "История" Тогда 
				Продолжить 
			Иначе 
				ВывестиЭлемент(Элемент2, ПолныеДанные, ДополнительныеДанные);
			КонецЕсли; 
			
			Если Элемент2.Ключ = "ДатаРег" Тогда
				ДополнительныеДанные.Добавить(Элемент2);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли  ТипЗнч(Элемент) = Тип("КлючИЗначение") Тогда
		Если ТипЗнч(Элемент.Значение) = Тип("Соответствие") Тогда 
			НоваяСтрока = ПолныеДанные.Добавить();
			НоваяСтрока.Раздел = Элемент.Ключ;
			
			Если Элемент.Ключ = "Руководитель" Тогда 
				ДополнительныеДанные.Добавить(Элемент);
			ИначеЕсли Элемент.Ключ = "ОткрСведения" Тогда
				  ДополнительныеДанные.Добавить(Элемент);
			КонецЕсли;
			
			ВывестиЭлемент(Элемент.Значение, ПолныеДанные, ДополнительныеДанные);
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда   
			НоваяСтрока = ПолныеДанные.Добавить();
			НоваяСтрока.Раздел = Элемент.Ключ;
			
			Если Элемент.Ключ = "Учредители" Тогда
				ДополнительныеДанные.Добавить(Элемент);
			КонецЕсли;	
			
			Массив = Элемент.Значение; 
			Для Индекс = 0 По Массив.ВГраница() Цикл
				ВывестиЭлемент(Массив[Индекс], ПолныеДанные, ДополнительныеДанные);
			КонецЦикла;
		Иначе
			НоваяСтрока = ПолныеДанные.Добавить();
			НоваяСтрока.Наименование = Элемент.Ключ;
			НоваяСтрока.Информация = Элемент.Значение;
		КонецЕсли;		
	КонецЕсли;

КонецФункции

Функция ВывестиЭлементДополнительно(Элемент, ДополнительныеДанные)Экспорт
		
	Если ТипЗнч(Элемент) = Тип("Соответствие") Тогда
		Для Каждого Элемент2 Из Элемент Цикл
			ВывестиЭлементДополнительно(Элемент2, ДополнительныеДанные);
		КонецЦикла; 		
	ИначеЕсли ТипЗнч(Элемент) = Тип("КлючИЗначение") Тогда
		Если ТипЗнч(Элемент.Значение)  = Тип("Соответствие") Тогда 			
			НоваяСтрока = ДополнительныеДанные.Добавить();
			НоваяСтрока.Раздел = Элемент.Ключ;
			ВывестиЭлементДополнительно(Элемент.Значение, ДополнительныеДанные);
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда   
			НоваяСтрока = ДополнительныеДанные.Добавить();
			НоваяСтрока.Раздел = Элемент.Ключ;
			Массив = Элемент.Значение; 
			Для Индекс = 0 По Массив.ВГраница() Цикл
				ВывестиЭлементДополнительно(Массив[Индекс], ДополнительныеДанные);
			КонецЦикла;
		Иначе
			НоваяСтрока = ДополнительныеДанные.Добавить();
			НоваяСтрока.Наименование = Элемент.Ключ;
			НоваяСтрока.Информация = Элемент.Значение;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
		МассивЭл = Элемент; 
		Для Индекс = 0 По МассивЭл.ВГраница() Цикл
			ВывестиЭлементДополнительно(МассивЭл[Индекс], ДополнительныеДанные);
		КонецЦикла;	
	КонецЕсли;

КонецФункции

Функция ВывестиЭлементВыручка(Элемент, Выручка)Экспорт
		
	Если ТипЗнч(Элемент) = Тип("Соответствие") Тогда
		Для Каждого Элемент2 Из Элемент Цикл
			ВывестиЭлементВыручка(Элемент2, Выручка);
		КонецЦикла;
	ИначеЕсли  ТипЗнч(Элемент) = Тип("КлючИЗначение") Тогда
		Если ТипЗнч(Элемент.Значение) = Тип("Соответствие") Тогда 
			НоваяСтрока = Выручка.Добавить();
			НоваяСтрока.Год = Элемент.Ключ;
			НоваяСтрока.НСтроки = Выручка.Количество();
	
			ВывестиЭлементВыручка(Элемент.Значение, Выручка);
		Иначе
			Если Элемент.Ключ = "2110" Тогда                             
				Стр = Выручка.Найти(Выручка.Количество() ,"НСтроки" );
				Стр.Сумма = Элемент.Значение;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

КонецФункции

#КонецОбласти 

