
Функция MobileEventPOST(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеJSON= Запрос.ПолучитьТелоКакСтроку("UTF-8");
	
	Метод= ПолучитьМетод(Запрос);
	
	//Маршрутизация
	Если Метод = "/Authentication" Тогда
		ОтветHTTP= Authentication(ДанныеJSON);
	ИначеЕсли Метод = "/ExchangeListRKO" Тогда
		ОтветHTTP= ExchangeСписокОтгрузка(ДанныеJSON); 
	ИначеЕсли Метод = "/ExchangeListPKO" Тогда
		ОтветHTTP= ExchangeСписокПриемка(ДанныеJSON);
	ИначеЕсли Метод = "/ExchangeListPR" Тогда
		ОтветHTTP= ExchangeСписокПересчет(ДанныеJSON);
	ИначеЕсли Метод = "/ExchangeRKO" Тогда
		ОтветHTTP= ExchangeОтгрузка(ДанныеJSON); 
    ИначеЕсли Метод = "/ExchangeStatus" Тогда
		ОтветHTTP= ExchangeStatus(ДанныеJSON)
	ИначеЕсли Метод = "/ExchangePKO" Тогда
		ОтветHTTP= ExchangeПриемка(ДанныеJSON);
	ИначеЕсли Метод = "/ExchangePR" Тогда
		ОтветHTTP= ExchangeПересчет(ДанныеJSON);
	ИначеЕсли Метод = "/ChangeStatus" Тогда
		ОтветHTTP= СозданиеИзменениеОрдера(ДанныеJSON);  
	ИначеЕсли Метод = "/DeleteDocument" Тогда
		ОтветHTTP= УдалениеОрдера(ДанныеJSON); 
    ИначеЕсли Метод = "/ChangeString" Тогда
		ОтветHTTP= СозданиеИзменениеСтроки(ДанныеJSON);
	ИначеЕсли Метод = "/Exchange2" Тогда
		ОтветHTTP= СозданиеИзменениеПКО(ДанныеJSON);
	ИначеЕсли Метод = "/Exchange3" Тогда
		ОтветHTTP= СозданиеИзменениеПересчета(ДанныеJSON);
	ИначеЕсли Метод = "/GetPicture" Тогда
		ОтветHTTP= ПолучитьКартинку(ДанныеJSON);
	ИначеЕсли Метод = "/GetCell" Тогда
		ОтветHTTP= ПолучитьЯчейки(ДанныеJSON);
	ИначеЕсли Метод = "/EditCell" Тогда
		ОтветHTTP= ИзменитьЯчейку(ДанныеJSON);
	ИначеЕсли Метод = "/AddBarcode" Тогда
		ОтветHTTP= ДобавитьШтрихкод(ДанныеJSON); 
	ИначеЕсли Метод = "/AddBlocking" Тогда
		ОтветHTTP= СозданиеБлокировки(ДанныеJSON); 
    ИначеЕсли Метод = "/GetBarcodeGoods" Тогда
		ОтветHTTP= ПолучитьШтрихкодыНоменклатуры(ДанныеJSON);
	ИначеЕсли Метод = "/GetBalance" Тогда
		ОтветHTTP= ПолучитьОстатокПоТовару(ДанныеJSON);
	ИначеЕсли Метод = "/GetProductList" Тогда
		ОтветHTTP= ПолучитьСписокТоваров(ДанныеJSON); 
	ИначеЕсли Метод = "/GetCharacteristicsList" Тогда
		ОтветHTTP= ПолучитьСписокХарактеристик(ДанныеJSON);
	ИначеЕсли Метод = "/GetNKList" Тогда
		ОтветHTTP= ПолучитьСписокНекондиции(ДанныеJSON); 
	ИначеЕсли Метод = "/AddNK" Тогда
		ОтветHTTP= СоздатьОграниченноГодный(ДанныеJSON);
	ИначеЕсли Метод = "/GetUnidentifiedGoods" Тогда
		ОтветHTTP= ПолучитьНеопознанныйТовар(ДанныеJSON);
	ИначеЕсли Метод = "/AddAttachedFile" Тогда
		ОтветHTTP= ДобавитьПрисоединенныйФайл(ДанныеJSON);	
	ИначеЕсли Метод = "/GetProduct" Тогда
		ОтветHTTP= ПолучитьТоварПоШтрихкоду(ДанныеJSON); 
	ИначеЕсли Метод = "/GetProductMark" Тогда
		ОтветHTTP= ПолучитьТоварПоШтрихкодуМаркировки(ДанныеJSON); 
	ИначеЕсли Метод = "/UploadFile" Тогда
		ОтветHTTP= ЗагрузитьФайлВПапку(ДанныеJSON);
	ИначеЕсли Метод = "/ExchangeCheck" Тогда
		ОтветHTTP= ПроверкаОбмена(ДанныеJSON);
	ИначеЕсли Метод = "/UpdateApplication" Тогда
		ОтветHTTP= ПолучитьАктуальнуюВерсиюПриложения(ДанныеJSON);
	ИначеЕсли Метод = "/GetAdditionalCell" Тогда
		ОтветHTTP= ПолучитьДополнительнуюЯчейкуНоменклатуры(ДанныеJSON);
	ИначеЕсли Метод = "/GetMainCell" Тогда
		ОтветHTTP= ЕстьОсновнаяЯчейка(ДанныеJSON);
	ИначеЕсли Метод = "/GetProductFromCell" Тогда
		ОтветHTTP= ПолучитьНоменклатуруИзЯчейки(ДанныеJSON);
	ИначеЕсли Метод = "/CheckInTestResult" Тогда
		ОтветHTTP= ЗаписатьРезультатПроверкиАХ(ДанныеJSON);
    ИначеЕсли Метод = "/CheckMarking" Тогда
		ОтветHTTP= ПроверитьМаркировку(ДанныеJSON);	
	ИначеЕсли Метод = "/EndOfSession" Тогда
		ОтветHTTP= ЗавершениеСессии(ДанныеJSON);
	Иначе
		ОтветHTTP= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Передан неверный метод");
	КонецЕсли;
	
	Возврат ОтветHTTP; 
	
КонецФункции

Функция ПолучитьМетод(Запрос)
	
	ОтносительныйURL= Запрос.ОтносительныйURL;
	Возврат ОтносительныйURL; 
	
КонецФункции

#Область ОбработкаМаршрутов

Функция Authentication(ДанныеJSON)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
		
		Если ТипЗнч(ВходящиеДанные) = Тип("Структура") Тогда
			
			Штрихкод = ВходящиеДанные.ШтрихкодСотрудника;
			ИдентификаторКлиента = Новый УникальныйИдентификатор(ВходящиеДанные.ИдентификаторКлиента);
			
			Если Лев(Штрихкод, 4) = "8888" Тогда
				
				Сотрудник = Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
								
				Если Сотрудник.Пустая() Тогда
					
					Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "По данному штрихкоду не удалось найти сотрудника!"); 
					
					Возврат Ответ;   
					
				Иначе     
					Если Сотрудник.РабочиеУчастки.Количество()>0 Тогда  
						
						СтруктураОтвета = Новый Структура;
						
						МассивСекций = Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
						ОграничениеОстатков = Ложь;
						Если АльтерраОбщегоНазначения.ПолучитьОграничениеДоступностиОстатков() Тогда
							Для каждого Секция Из МассивСекций Цикл
								Если Секция.СкрытьКоличествоПоУчету Тогда
									ОграничениеОстатков = Истина;
									Прервать;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						СтруктураОтвета.Вставить("ФИОСотрудника", СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Сотрудник.Наименование," ")[1]);
						СтруктураОтвета.Вставить("Местоположение",СтрСоединить(МассивСекций, ","));
						СтруктураОтвета.Вставить("ОграничениеОстатков", ОграничениеОстатков);
						СтруктураОтвета.Вставить("Склад",XMLСтрока(Сотрудник.Склад));
												
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СкладскиеЯчейки.Ссылка) КАК Ссылка,
						|	СкладскиеЯчейки.Наименование КАК Наименование,
						|	СкладскиеЯчейки.Штрихкод КАК Штрихкод
						|ИЗ
						|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
						|ГДЕ
						|	НЕ СкладскиеЯчейки.ПометкаУдаления
						|	И НЕ СкладскиеЯчейки.ЭтоГруппа
						|	И СкладскиеЯчейки.Родитель В ИЕРАРХИИ (&Родитель)";
						
						Запрос.УстановитьПараметр("Родитель", ПолучитьМассивГруппЯПХ(МассивСекций));
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						ЯПХ = Новый Массив();
	
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							СтруктураСтрока = Новый Структура();
							СтруктураСтрока.Вставить("Ячейка",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Наименование)));
							СтруктураСтрока.Вставить("ЯчейкаУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Ссылка));
							СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Штрихкод))); 
						 													
							ЯПХ.Добавить(СтруктураСтрока);
						КонецЦикла;
						
						Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(Перечисления.СобытияРаботыТСД.Вход,"Мобильное приложение",,Сотрудник,ИдентификаторКлиента);
						
						СтруктураОтвета.Вставить("ЯПХ", ЯПХ);
						
						Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
												
						Возврат Ответ;          
						
					Иначе
						
						Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "У сотрудника не настроены секции в карточке сотрудника!");
						
						Возврат Ответ;   
						
					КонецЕсли; 
					
				КонецЕсли;	
				
			Иначе
				
				Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Штрихкод сотрудника начинается на 8888!");    
				
				Возврат Ответ; 
				
			КонецЕсли;  
			
		Иначе
			
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получена пустая структура");   
			
			Возврат Ответ; 
			
		КонецЕсли;	
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не удалось аутентифицировать сотрудника!");
		ЗаписьЖурналаРегистрации("МобильноеПриложениеСклада", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось аутентифицировать сотрудника.  " + Ошибка.Описание); 
		
		Возврат Ответ;	
		
	КонецПопытки; 
			
КонецФункции

Функция ExchangeСписокОтгрузка(ДанныеJSON)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
		
		Если ТипЗнч(ВходящиеДанные) = Тип("Структура") Тогда
			
			Штрихкод = ВходящиеДанные.ШтрихкодСотрудника;
			ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;
			ДатаНачала = Дата(СтрЗаменить(Лев(ВходящиеДанные.ДатаНачала,10),"-",""));
			ДатаОкончания = Дата(СтрЗаменить(Лев(ВходящиеДанные.ДатаОкончания,10),"-",""));
			ТипСписка = ВходящиеДанные.ТипСписка;
			
			Если Лев(Штрихкод, 4) = "8888" Тогда
				
				Сотрудник = Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
								
				Если Сотрудник.Пустая() Тогда
					
					Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "По данному штрихкоду не удалось найти сотрудника!"); 
					
					Возврат Ответ;   
					
				Иначе     
					Если Сотрудник.РабочиеУчастки.Количество()>0 Тогда  
						
						//отгрузка
						СтруктураОтвета = Новый Структура;
						
						МассивСекций = Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
						
						Если ТипСписка = "Отгрузка" Тогда 						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	СостоянияОтгрузкиНакладных.РабочийУчасток КАК РабочийУчастокУИД,
						|	СостоянияОтгрузкиНакладных.Документ КАК Документ,
						|	СостоянияОтгрузкиНакладных.Заказ КАК Заказ,
						|	СостоянияОтгрузкиНакладных.РабочийУчасток КАК РабочийУчасток,
						|	ТИПЗНАЧЕНИЯ(СостоянияОтгрузкиНакладных.Документ) КАК ТипДокумента,
						|	СостоянияОтгрузкиНакладных.Документ.Дата КАК Дата,
						|	СостоянияОтгрузкиНакладных.Документ.Номер КАК Номер,
						|	СостоянияОтгрузкиНакладных.Получатель КАК Получатель,
						|	СостоянияОтгрузкиНакладных.ОжидаетсяОтбор КАК ОжидаетсяОтбор,
						|	СостоянияОтгрузкиНакладных.Набирается КАК Набирается,
						|	СостоянияОтгрузкиНакладных.Набран КАК Набран,
						|	СостоянияОтгрузкиНакладных.ЧастичноОтгружен КАК ЧастичноОтгружен,
						|	СостоянияОтгрузкиНакладных.Отгружен КАК Отгружен,
						|	СостоянияОтгрузкиНакладных.Ошибка КАК Ошибка,
						|	СостоянияОтгрузкиНакладных.ОтметкаКассы КАК ОтметкаКассы,
						|	ШтрихкодыПоСекциямДокумента.Штрихкод КАК Штрихкод
						|ПОМЕСТИТЬ Промежуточный
						|ИЗ
						|	РегистрСведений.СостоянияОтгрузкиНакладных КАК СостоянияОтгрузкиНакладных
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
						|		ПО (ШтрихкодыПоСекциямДокумента.Документ = СостоянияОтгрузкиНакладных.Документ)
						|		И (ШтрихкодыПоСекциямДокумента.Секция = СостоянияОтгрузкиНакладных.РабочийУчасток)
						|ГДЕ
						|	СостоянияОтгрузкиНакладных.РабочийУчасток В (&РабочийУчасток)
						|	И НЕ СостоянияОтгрузкиНакладных.Отгружен
						|	И СостоянияОтгрузкиНакладных.Документ.Дата МЕЖДУ &ДатаНачала и &ДатаОкончания
						|	И НЕ СостоянияОтгрузкиНакладных.Документ.Ссылка есть NULL
						|	И НЕ СостоянияОтгрузкиНакладных.Документ ССЫЛКА Документ.СборкаТоваров
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	РаспоряженияИСостояния.Документ КАК Документ,
						|	ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку,
						|	МАКСИМУМ(ЗаказыКДоставке.Рейс) КАК Рейс
						|ПОМЕСТИТЬ ЗаказыНаДоставку
						|ИЗ
						|	Промежуточный КАК РаспоряженияИСостояния
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКДоставке КАК ЗаказыКДоставке
						|		ПО РаспоряженияИСостояния.Заказ = ЗаказыКДоставке.ДокументПродажи
						|ГДЕ
						|   НЕ РаспоряженияИСостояния.Заказ = Неопределено
						|
						|СГРУППИРОВАТЬ ПО
						|	РаспоряженияИСостояния.Документ,
						|	ЗаказыКДоставке.ЗаказНаДоставку
						|
						|ОБЪЕДИНИТЬ
						|
						|ВЫБРАТЬ
						|	РаспоряженияИСостояния.Документ,
						|	ЗаказыКДоставке.ЗаказНаДоставку,
						|	МАКСИМУМ(ЗаказыКДоставке.Рейс)
						|ИЗ
						|	Промежуточный КАК РаспоряженияИСостояния
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКДоставке КАК ЗаказыКДоставке
						|		ПО РаспоряженияИСостояния.Документ = ЗаказыКДоставке.ДокументПродажи
						|СГРУППИРОВАТЬ ПО
						|	РаспоряженияИСостояния.Документ,
						|	ЗаказыКДоставке.ЗаказНаДоставку
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	РаспоряженияИСостояния.Документ КАК Документ,
						|	ДОБАВИТЬКДАТЕ(ЗаказыКДоставке.ЗаказНаДоставку.ПрибытиеНаОтгрузку, ЧАС,
						|		ЧАС(ЗаказыКДоставке.ЗаказНаДоставку.ВремяДоставкиС) - 2) КАК ДатаОтгрузки
						|ПОМЕСТИТЬ ДатаОтгрузки
						|ИЗ
						|	Промежуточный КАК РаспоряженияИСостояния
						|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыНаДоставку КАК ЗаказыКДоставке
						|		ПО РаспоряженияИСостояния.Документ = ЗаказыКДоставке.Документ
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ различные
						|	Промежуточный.РабочийУчастокУИД,
						|	Промежуточный.Документ,
						|	Промежуточный.Заказ,
						|	Промежуточный.РабочийУчасток,
						|	Промежуточный.ТипДокумента,
						|	ВЫБОР
						|		КОГДА Итоговый.ДатаОтгрузки ЕСТЬ NULL
						|			ТОГДА Итоговый.Документ.Дата
						|		ИНАЧЕ Итоговый.ДатаОтгрузки
						|	КОНЕЦ КАК Дата,
						|	Промежуточный.Номер,
						|	Промежуточный.Получатель,
						|	Промежуточный.ОжидаетсяОтбор,
						|	Промежуточный.Набирается,
						|	Промежуточный.Набран,
						|	Промежуточный.ЧастичноОтгружен,
						|	Промежуточный.Отгружен,
						|	Промежуточный.Ошибка,
						|	Промежуточный.ОтметкаКассы,
						|	Промежуточный.Штрихкод
						|ИЗ
						|	ДатаОтгрузки КАК Итоговый
						|		ПРАВОЕ СОЕДИНЕНИЕ Промежуточный КАК Промежуточный
						|		ПО Итоговый.Документ = Промежуточный.Документ";
						Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
						Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
						Запрос.УстановитьПараметр("РабочийУчасток", МассивСекций); 
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						ЖурналОтгрузки = Новый Массив();
						МассивДокументов = Новый Массив();
						//
						МассивШтрихкодов = Новый Массив();
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
							СтруктураСтрока = Новый Структура();
							СтруктураСтрока.Вставить("РабочийУчасток",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.РабочийУчасток))); 
							СтруктураСтрока.Вставить("РабочийУчастокУИД",XMLСтрока(ВыборкаДетальныеЗаписи.РабочийУчастокУИД));
							СтруктураСтрока.Вставить("Документ",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.ТипДокумента)));
							СтруктураСтрока.Вставить("ДокументУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Документ)); 
						    СтруктураСтрока.Вставить("Номер",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номер)));
							СтруктураСтрока.Вставить("Дата",XMLСтрока(ВыборкаДетальныеЗаписи.Дата));
							СтруктураСтрока.Вставить("Получатель",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Получатель))); 
						    СтруктураСтрока.Вставить("ОжидаетсяОтбор",XMLСтрока(ВыборкаДетальныеЗаписи.ОжидаетсяОтбор));
							СтруктураСтрока.Вставить("Набирается",XMLСтрока(ВыборкаДетальныеЗаписи.Набирается));
							СтруктураСтрока.Вставить("Набран",XMLСтрока(ВыборкаДетальныеЗаписи.Набран));
							СтруктураСтрока.Вставить("ЧастичноОтгружен",XMLСтрока(ВыборкаДетальныеЗаписи.ЧастичноОтгружен));
							СтруктураСтрока.Вставить("Ошибка",XMLСтрока(ВыборкаДетальныеЗаписи.Ошибка));
							СтруктураСтрока.Вставить("Отгружен",XMLСтрока(ВыборкаДетальныеЗаписи.Отгружен));
							СтруктураСтрока.Вставить("ОтметкаКассы",XMLСтрока(ВыборкаДетальныеЗаписи.ОтметкаКассы));
							
							//
							СтруктураШтрихкодов = Новый Структура();
							СтруктураШтрихкодов.Вставить("Документ",XMLСтрока(ВыборкаДетальныеЗаписи.Документ));
							СтруктураШтрихкодов.Вставить("Секция",XMLСтрока(ВыборкаДетальныеЗаписи.РабочийУчастокУИД));
							
							ШестнадцатиричноеЧисло = СтрЗаменить(XMLСтрока(ВыборкаДетальныеЗаписи.Документ),"-","");
							ШтрихкодДок = ПреобразоватьИзШестнадцатеричнойСистемыСчисленияВДесятичноеЧисло(ШестнадцатиричноеЧисло);
							СтруктураШтрихкодов.Вставить("Штрихкод",XMLСтрока(ШтрихкодДок));
							
							ФиксСтруктура = Новый ФиксированнаяСтруктура(СтруктураШтрихкодов);
						    МассивШтрихкодов.Добавить(ФиксСтруктура);
							
							
							//Штрихкод="";
							Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Штрихкод) Тогда
								//Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
								СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(ВыборкаДетальныеЗаписи.Штрихкод)); 
								СтруктураШтрихкодов.Штрихкод = XMLСтрока(ВыборкаДетальныеЗаписи.Штрихкод);
								МассивШтрихкодов.Добавить(СтруктураШтрихкодов);
							Иначе
								//ШестнадцатиричноеЧисло = СтрЗаменить(XMLСтрока(ВыборкаДетальныеЗаписи.Документ),"-","");
								//Штрихкод = ПреобразоватьИзШестнадцатеричнойСистемыСчисленияВДесятичноеЧисло(ШестнадцатиричноеЧисло); 
								СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(ШтрихкодДок));
							КонецЕсли;
							
							//СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Штрихкод));
							
							ЖурналОтгрузки.Добавить(СтруктураСтрока);
							МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Документ);
						КонецЦикла;
						
						СтруктураОтвета.Вставить("ЖурналОтгрузки", ЖурналОтгрузки);
						
						//МассивШтрихкодов = Новый Массив(); 
						//
						//Запрос = Новый Запрос;
						//Запрос.Текст = 
						//"ВЫБРАТЬ
						//|	ШтрихкодыПоСекциямДокумента.Документ КАК Документ,
						//|	ШтрихкодыПоСекциямДокумента.Секция КАК Секция,
						//|	ШтрихкодыПоСекциямДокумента.Штрихкод КАК Штрихкод
						//|ИЗ
						//|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
						//|ГДЕ
						//|	ШтрихкодыПоСекциямДокумента.Документ В(&Документ)
						//|	И ШтрихкодыПоСекциямДокумента.Секция В(&Секция)";
						//
						//Запрос.УстановитьПараметр("Документ", МассивДокументов);
						//Запрос.УстановитьПараметр("Секция", МассивСекций);
						//
						//РезультатЗапроса = Запрос.Выполнить();
						//
						//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						//
						//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						//	
						//	СтруктураСтрока = Новый Структура();	
						//	СтруктураСтрока.Вставить("Документ",XMLСтрока(ВыборкаДетальныеЗаписи.Документ));
						//	СтруктураСтрока.Вставить("Секция",XMLСтрока(ВыборкаДетальныеЗаписи.Секция));
						//	СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(ВыборкаДетальныеЗаписи.Штрихкод));
						//	ФиксСтруктура = Новый ФиксированнаяСтруктура(СтруктураСтрока);
						//    МассивШтрихкодов.Добавить(ФиксСтруктура);
						//	
						//	ШестнадцатиричноеЧисло = СтрЗаменить(XMLСтрока(ВыборкаДетальныеЗаписи.Документ),"-","");
						//	Штрихкод = ПреобразоватьИзШестнадцатеричнойСистемыСчисленияВДесятичноеЧисло(ШестнадцатиричноеЧисло);
						//	СтруктураСтрока.Штрихкод = Штрихкод;
						//	МассивШтрихкодов.Добавить(СтруктураСтрока); 
						//	
						//КонецЦикла;
						
						СтруктураОтвета.Вставить("МассивШтрихкодов", МассивШтрихкодов);
						
						Иначе
						Ордера = Новый Массив();
						МассивШтрихкодовОрдера = Новый Массив();
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	РасходныйОрдерНаТовары.Ссылка КАК ОрдерГУИД,
						|	РасходныйОрдерНаТовары.Накладная КАК ДокументУИД,
						|	РасходныйОрдерНаТовары.Дата КАК Дата,
						|	РасходныйОрдерНаТовары.Статус КАК Статус,
						|	РасходныйОрдерНаТовары.Номер КАК Номер,
						|	РасходныйОрдерНаТовары.Сотрудник КАК Сотрудник,
						|	РасходныйОрдерНаТовары.Накладная КАК Накладная,
						|	РасходныйОрдерНаТовары.Получатель КАК Получатель,
						|	РасходныйОрдерНаТовары.РабочийУчасток КАК РабочийУчасток,
						|	ЕСТЬNULL(ШтрихкодыПоСекциямДокумента.Штрихкод, """") КАК Штрихкод
						|ИЗ
						|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
						|		ПО РасходныйОрдерНаТовары.Накладная = ШтрихкодыПоСекциямДокумента.Документ
						|			И РасходныйОрдерНаТовары.РабочийУчасток = ШтрихкодыПоСекциямДокумента.Секция
						|ГДЕ
						|	РасходныйОрдерНаТовары.Проведен
						|	И НЕ РасходныйОрдерНаТовары.ПометкаУдаления
						|	И РасходныйОрдерНаТовары.Дата МЕЖДУ &Дата И &Дата2
						|	И РасходныйОрдерНаТовары.РабочийУчасток В(&РабочийУчасток)";
						
						Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаНачала));
						Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаОкончания));
						Запрос.УстановитьПараметр("РабочийУчасток", МассивСекций);  

						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							СтруктураСтрока = Новый Структура();
							СтруктураСтрока.Вставить("ОрдерГУИД",XMLСтрока(ВыборкаДетальныеЗаписи.ОрдерГУИД)); 
							СтруктураСтрока.Вставить("ДокументУИД",XMLСтрока(ВыборкаДетальныеЗаписи.ДокументУИД));
							СтруктураСтрока.Вставить("Дата",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Дата)));
							СтруктураСтрока.Вставить("Номер",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номер)));
							СтруктураСтрока.Вставить("Статус",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Статус)));
							СтруктураСтрока.Вставить("Сотрудник",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Сотрудник))); 
							СтруктураСтрока.Вставить("Накладная",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Накладная)));
							СтруктураСтрока.Вставить("Получатель",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Получатель)));
							Ордера.Добавить(СтруктураСтрока);
							
							СтруктураШтрихкода = Новый Структура();	
							СтруктураШтрихкода.Вставить("Документ",XMLСтрока(ВыборкаДетальныеЗаписи.ДокументУИД));
							СтруктураШтрихкода.Вставить("Секция",XMLСтрока(ВыборкаДетальныеЗаписи.РабочийУчасток));
							СтруктураШтрихкода.Вставить("Штрихкод",XMLСтрока(ВыборкаДетальныеЗаписи.Штрихкод));
							ФиксСтруктура = Новый ФиксированнаяСтруктура(СтруктураШтрихкода);
						    МассивШтрихкодовОрдера.Добавить(ФиксСтруктура);
							
							ШестнадцатиричноеЧисло = СтрЗаменить(XMLСтрока(ВыборкаДетальныеЗаписи.ДокументУИД),"-","");
							Штрихкод = ПреобразоватьИзШестнадцатеричнойСистемыСчисленияВДесятичноеЧисло(ШестнадцатиричноеЧисло);
							СтруктураШтрихкода.Штрихкод = Штрихкод;
							МассивШтрихкодовОрдера.Добавить(СтруктураШтрихкода);
						КонецЦикла;
						
						СтруктураОтвета.Вставить("МассивОрдеров", Ордера);
						СтруктураОтвета.Вставить("МассивШтрихкодов", МассивШтрихкодовОрдера); 
						КонецЕсли;
						
						Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
						
						Возврат Ответ;          
						
					Иначе
						
						Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "У сотрудника не настроены секции в карточке сотрудника!");
						
						Возврат Ответ;   
						
					КонецЕсли; 
					
				КонецЕсли;	
				
			Иначе
				
				Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Штрихкод сотрудника начинается на 8888!");    
				
				Возврат Ответ; 
				
			КонецЕсли;  
			
		Иначе
			
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получена пустая структура");   
			
			Возврат Ответ; 
			
		КонецЕсли;	
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не удалось аутентифицировать сотрудника!");
		ЗаписьЖурналаРегистрации("МобильноеПриложениеСклада", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось аутентифицировать сотрудника.  " + Ошибка.Описание);
		
		Возврат Ответ;	
		
	КонецПопытки; 
			
КонецФункции

Функция ExchangeСписокПриемка(ДанныеJSON)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
		
		Если ТипЗнч(ВходящиеДанные) = Тип("Структура") Тогда
			
			Штрихкод = ВходящиеДанные.ШтрихкодСотрудника;
			ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;
            ДатаНачала = Дата(СтрЗаменить(Лев(ВходящиеДанные.ДатаНачала,10),"-",""));
			ДатаОкончания = Дата(СтрЗаменить(Лев(ВходящиеДанные.ДатаОкончания,10),"-",""));

			Если Лев(Штрихкод, 4) = "8888" Тогда
				
				Сотрудник = Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
								
				Если Сотрудник.Пустая() Тогда
					
					Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "По данному штрихкоду не удалось найти сотрудника!"); 
					
					Возврат Ответ;   
					
				Иначе     
					Если Сотрудник.РабочиеУчастки.Количество()>0 Тогда  
						
						//отгрузка
						СтруктураОтвета = Новый Структура;
						
						МассивСекций = Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
												
						////приемка
						
						Запрос = Новый Запрос;
						Запрос.Текст =
						"ВЫБРАТЬ
						|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК РабочийУчасток,
						|	ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) КАК Документ,
						|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументУИД,
						|	ТоварыКПоступлениюОстатки.ДокументПоступления.Дата КАК Дата,
						|	ТоварыКПоступлениюОстатки.ДокументПоступления.Номер КАК Номер,
						|	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
						|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
						|	МАКСИМУМ(ВЫБОР
						|			КОГДА ТоварыКПоступлениюОстатки.КОформлениюОрдеровКонечныйОстаток - ТоварыКПоступлениюОстатки.ПринимаетсяКонечныйОстаток > 0
						|				ТОГДА ИСТИНА
						|			ИНАЧЕ ЛОЖЬ
						|		КОНЕЦ) КАК КПриемке,
						|	МАКСИМУМ(ВЫБОР
						|			КОГДА ТоварыКПоступлениюОстатки.ПринимаетсяКонечныйОстаток > 0
						|				ТОГДА ИСТИНА
						|			ИНАЧЕ ЛОЖЬ
						|		КОНЕЦ) КАК Принимается,
						|	МАКСИМУМ(ВЫБОР
						|			КОГДА ТоварыКПоступлениюОстатки.КОформлениюОрдеровРасход > 0
						|				ТОГДА ИСТИНА
						|			ИНАЧЕ ЛОЖЬ
						|		КОНЕЦ) КАК ПринятЧастично,
						|	МАКСИМУМ(ВЫБОР
						|			КОГДА ТоварыКПоступлениюОстатки.КОформлениюОрдеровРасход - ТоварыКПоступлениюОстатки.КОформлениюОрдеровПриход > 0
						|				ТОГДА ИСТИНА
						|			ИНАЧЕ ЛОЖЬ
						|		КОНЕЦ) КАК Перепоставка,
						//|	ВЫБОР
						//|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ВозвратТоваровОтКлиента)
						//|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.КорректировкаРеализации)
						//|			ТОГДА ВЫБОР
						//|					КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
						//|						ТОГДА ЛОЖЬ
						//|					ИНАЧЕ ИСТИНА
						//|				КОНЕЦ
						//|		ИНАЧЕ ВЫБОР
						//|				КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ЧекККМВозврат)
						//|					ТОГДА ВЫБОР
						//|							КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
						//|								ТОГДА ИСТИНА
						//|							ИНАЧЕ ЛОЖЬ
						//|						КОНЕЦ
						//|				ИНАЧЕ ИСТИНА
						//|			КОНЕЦ
						//|	КОНЕЦ КАК ОтметкаКассы 
						// временно убрала из-за зависаний
						|	Истина КАК ОтметкаКассы
						
						|ИЗ
						|	РегистрНакопления.ТоварыКПоступлению.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Авто, ДвиженияИГраницыПериода, ) КАК ТоварыКПоступлениюОстатки
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
						|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ТоварыКПоступлениюОстатки.Номенклатура)
						|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыКПоступлениюОстатки.Склад)
						|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&РабочийУчасток))
						|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
						|ГДЕ
						|	НЕ(ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ЗаказНаПеремещение
						|				ИЛИ ТоварыКПоступлениюОстатки.ДокументПоступления ССЫЛКА Документ.ЗаказНаСборку)
						|	И (ТоварыКПоступлениюОстатки.КОформлениюОрдеровКонечныйОстаток > 0
						|			ИЛИ ТоварыКПоступлениюОстатки.ПринимаетсяКонечныйОстаток > 0)
						|	И ТоварыКПоступлениюОстатки.ДокументПоступления.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
						|
						|СГРУППИРОВАТЬ ПО
						|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
						|	ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления),
						|	ТоварыКПоступлениюОстатки.ДокументПоступления,
						|	ТоварыКПоступлениюОстатки.ДокументПоступления.Дата,
						|	ТоварыКПоступлениюОстатки.ДокументПоступления.Номер,
						//|	ВЫБОР
						//|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ВозвратТоваровОтКлиента)
						//|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.КорректировкаРеализации)
						//|			ТОГДА ВЫБОР
						//|					КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
						//|						ТОГДА ЛОЖЬ
						//|					ИНАЧЕ ИСТИНА
						//|				КОНЕЦ
						//|		ИНАЧЕ ВЫБОР
						//|				КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстатки.ДокументПоступления) = ТИП(Документ.ЧекККМВозврат)
						//|					ТОГДА ВЫБОР
						//|							КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
						//|								ТОГДА ИСТИНА
						//|							ИНАЧЕ ЛОЖЬ
						//|						КОНЕЦ
						//|				ИНАЧЕ ИСТИНА
						//|			КОНЕЦ
						//|	КОНЕЦ,
						|	ТоварыКПоступлениюОстатки.Отправитель,
						|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация"; 
						
						Запрос.УстановитьПараметр("РабочийУчасток", МассивСекций);
						Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
						Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));

						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						ЖурналПриемки = Новый Массив();
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
							СтруктураСтрока = Новый Структура();
							СтруктураСтрока.Вставить("РабочийУчастокУИД",XMLСтрока(ВыборкаДетальныеЗаписи.РабочийУчасток)); 
							СтруктураСтрока.Вставить("РабочийУчасток",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.РабочийУчасток)));
							СтруктураСтрока.Вставить("Документ",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Документ)));
							СтруктураСтрока.Вставить("ДокументУИД",XMLСтрока(ВыборкаДетальныеЗаписи.ДокументУИД));
							СтруктураСтрока.Вставить("Номер",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номер)));
							СтруктураСтрока.Вставить("Дата",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Дата)));
							СтруктураСтрока.Вставить("Отправитель",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Отправитель))); 
							СтруктураСтрока.Вставить("ОтправительУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Отправитель));
							СтруктураСтрока.Вставить("ХозяйственнаяОперация",XMLСтрока(ОбщегоНазначения.ИмяЗначенияПеречисления(ВыборкаДетальныеЗаписи.ХозяйственнаяОперация)));
						    СтруктураСтрока.Вставить("КПриемке",XMLСтрока(ВыборкаДетальныеЗаписи.КПриемке));
							СтруктураСтрока.Вставить("ПринятЧастично",XMLСтрока(ВыборкаДетальныеЗаписи.ПринятЧастично));
							СтруктураСтрока.Вставить("Принимается",XMLСтрока(ВыборкаДетальныеЗаписи.Принимается));
							СтруктураСтрока.Вставить("Перепоставка",XMLСтрока(ВыборкаДетальныеЗаписи.Перепоставка)); 
							СтруктураСтрока.Вставить("ОтметкаКассы",XMLСтрока(ВыборкаДетальныеЗаписи.ОтметкаКассы));
							
							ШестнадцатиричноеЧисло = СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.ДокументУИД.УникальныйИдентификатор()),"-","");
							Штрихкод = ПреобразоватьИзШестнадцатеричнойСистемыСчисленияВДесятичноеЧисло(ШестнадцатиричноеЧисло);
							СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Штрихкод));

							ЖурналПриемки.Добавить(СтруктураСтрока);
						КонецЦикла;
						
						СтруктураОтвета.Вставить("ЖурналПриемки", ЖурналПриемки);
						
						Ордера = Новый Массив();
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ПриходныйОрдерНаТовары.Ссылка КАК Ордер,
						|	ПриходныйОрдерНаТовары.Дата КАК Дата,
						|	ПриходныйОрдерНаТовары.Статус КАК Статус,
						|	ПриходныйОрдерНаТовары.Номер КАК Номер,
						|	ПриходныйОрдерНаТовары.Сотрудник КАК Сотрудник,
						|	ПриходныйОрдерНаТовары.Распоряжение КАК Документ,
						|	ПриходныйОрдерНаТовары.Отправитель КАК Партнер
						|ИЗ
						|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
						|ГДЕ
						|	ПриходныйОрдерНаТовары.Проведен
						|	И ПриходныйОрдерНаТовары.Дата МЕЖДУ &Дата И &Дата2
						|	И ПриходныйОрдерНаТовары.РабочийУчасток В(&РабочийУчасток)";
						
						Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаНачала));
						Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаОкончания));
						Запрос.УстановитьПараметр("РабочийУчасток", МассивСекций);  

						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							СтруктураСтрока = Новый Структура();
							СтруктураСтрока.Вставить("ОрдерГУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Ордер)); 
							СтруктураСтрока.Вставить("ДокументУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Документ));
							СтруктураСтрока.Вставить("Дата",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Дата)));
							СтруктураСтрока.Вставить("Номер",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номер)));
							СтруктураСтрока.Вставить("Статус",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Статус)));
							СтруктураСтрока.Вставить("Сотрудник",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Сотрудник))); 
							СтруктураСтрока.Вставить("Документ",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Документ)));
							СтруктураСтрока.Вставить("Партнер",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Партнер)));
							
							ШестнадцатиричноеЧисло = СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.Документ.УникальныйИдентификатор()),"-","");
							Штрихкод = ПреобразоватьИзШестнадцатеричнойСистемыСчисленияВДесятичноеЧисло(ШестнадцатиричноеЧисло);
							СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Штрихкод));

							
							Ордера.Добавить(СтруктураСтрока);	
						КонецЦикла;
						
						СтруктураОтвета.Вставить("МассивОрдеров", Ордера);
						
						Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
						
						Возврат Ответ;          
						
					Иначе
						
						Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "У сотрудника не настроены секции в карточке сотрудника!");
						
						Возврат Ответ;   
						
					КонецЕсли; 
					
				КонецЕсли;	
				
			Иначе
				
				Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Штрихкод сотрудника начинается на 8888!");    
				
				Возврат Ответ; 
				
			КонецЕсли;  
			
		Иначе
			
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получена пустая структура");   
			
			Возврат Ответ; 
			
		КонецЕсли;	
		
	Исключение
		
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не удалось аутентифицировать сотрудника!");
		ЗаписьЖурналаРегистрации("МобильноеПриложениеСклада", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось аутентифицировать сотрудника"); 
		
		Возврат Ответ;	
		
	КонецПопытки; 
			
КонецФункции

Функция ExchangeСписокПересчет(ДанныеJSON)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
		
		Если ТипЗнч(ВходящиеДанные) = Тип("Структура") Тогда
			
			Штрихкод = ВходящиеДанные.ШтрихкодСотрудника;
			ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;
			ДатаНачала = Дата(СтрЗаменить(Лев(ВходящиеДанные.ДатаНачала,10),"-",""));
			ДатаОкончания = Дата(СтрЗаменить(Лев(ВходящиеДанные.ДатаОкончания,10),"-",""));

			Если Лев(Штрихкод, 4) = "8888" Тогда
				
				Сотрудник = Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
								
				Если Сотрудник.Пустая() Тогда
					
					Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "По данному штрихкоду не удалось найти сотрудника!"); 
					
					Возврат Ответ;   
					
				Иначе     
					Если Сотрудник.РабочиеУчастки.Количество()>0 Тогда  
						
						//отгрузка
						СтруктураОтвета = Новый Структура;
						
						МассивСекций = Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
						
						////пересчет
						Запрос = Новый Запрос;
						Запрос.Текст =" 
						|ВЫБРАТЬ  
						|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПересчетТоваров.Ссылка) КАК ДокументУИД,
						|	ТИПЗНАЧЕНИЯ(ПересчетТоваров.Ссылка) КАК Документ,
						|	ПересчетТоваров.Склад Как Склад, 
						|	ПересчетТоваров.ТипПересчета Как ТипПересчета,
						|	ПересчетТоваров.ТочкаПересчета Как ТочкаПересчета,
						|	ПересчетТоваров.Статус Как Статус,
						|	ПересчетТоваров.Ссылка Как Ссылка
						|ИЗ
						|	Документ.ПересчетТоваров КАК ПересчетТоваров
						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
						|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
						|			ПО ПересчетТоваровТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
						|				И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ПересчетТоваровТовары.Ссылка.Склад)
						|				И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
						|		ПО (ПересчетТоваровТовары.Ссылка = ПересчетТоваров.Ссылка)
						|ГДЕ
						|	 РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&РабочийУчасток)
						|	 И ПересчетТоваров.Дата Между &ДатаНачала и &ДатаОкончания 
						|    И НЕ ПересчетТоваров.ПометкаУдаления
						|    И ПересчетТоваров.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.Отменено)
						|    И ПересчетТоваров.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.Выполнено)";  
						
						Запрос.УстановитьПараметр("РабочийУчасток", МассивСекций);
						Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
						Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						ЖурналПересчета = Новый Массив();
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
							СтруктураСтрока = Новый Структура();
							СтруктураСтрока.Вставить("Документ",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Документ)));
							СтруктураСтрока.Вставить("ДокументУИД",XMLСтрока(ВыборкаДетальныеЗаписи.ДокументУИД));
							СтруктураСтрока.Вставить("Склад",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Склад))); 
						    СтруктураСтрока.Вставить("ТипПересчета",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.ТипПересчета)));
							СтруктураСтрока.Вставить("ТочкаПересчета",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.ТочкаПересчета)));
							СтруктураСтрока.Вставить("Статус",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Статус)));
							СтруктураСтрока.Вставить("Номер",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Ссылка.Номер)));
							СтруктураСтрока.Вставить("Дата",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Ссылка.Дата)));

							ШестнадцатиричноеЧисло = СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.ДокументУИД.УникальныйИдентификатор()),"-","");
							Штрихкод = ПреобразоватьИзШестнадцатеричнойСистемыСчисленияВДесятичноеЧисло(ШестнадцатиричноеЧисло);
							СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Штрихкод));
							
							ЖурналПересчета.Добавить(СтруктураСтрока);
						КонецЦикла;
						
						СтруктураОтвета.Вставить("ЖурналПересчета", ЖурналПересчета);
						
						Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
						
						Возврат Ответ;          
						
					Иначе
						
						Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "У сотрудника не настроены секции в карточке сотрудника!");
						
						Возврат Ответ;   
						
					КонецЕсли; 
					
				КонецЕсли;	
				
			Иначе
				
				Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Штрихкод сотрудника начинается на 8888!");    
				
				Возврат Ответ; 
				
			КонецЕсли;  
			
		Иначе
			
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получена пустая структура");   
			
			Возврат Ответ; 
			
		КонецЕсли;	
		
	Исключение
		
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не удалось аутентифицировать сотрудника!");
		ЗаписьЖурналаРегистрации("МобильноеПриложениеСклада", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось аутентифицировать сотрудника"); 
		
		Возврат Ответ;	
		
	КонецПопытки; 
			
КонецФункции

Функция ExchangeОтгрузка(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получена пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента; 
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
    Накладная = Новый УникальныйИдентификатор(ВходящиеДанные.Накладная);
	РабочийУчасток = Новый УникальныйИдентификатор(ВходящиеДанные.РабочийУчасток);
	
	СтруктураОтвета = Новый Структура;
	
	Запрос = Новый Запрос;
    
    Ордер = Неопределено;
    
	Если ВходящиеДанные.Свойство("Ордер") Тогда 
		
		Ордер = Документы.РасходныйОрдерНаТовары.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Ордер));
		
		Накладная = Ордер.Накладная;
		
		СтруктураОтвета.Вставить("Дата", XMLСтрока(Строка(Накладная.Дата)));
		СтруктураОтвета.Вставить("Номер", XMLСтрока(Строка(Накладная.Номер)));  
		СтруктураОтвета.Вставить("Документ", XMLСтрока(Строка(ТипЗнч(Накладная))));   
		СтруктураОтвета.Вставить("Получатель", XMLСтрока(Строка(Ордер.Получатель))); 
		СтруктураОтвета.Вставить("Статус", XMLСтрока(Строка(Ордер.Статус)));
		СтруктураОтвета.Вставить("НомерОрдера", XMLСтрока(Строка(Ордер.Номер))); 
		СтруктураОтвета.Вставить("ДатаОрдера", XMLСтрока(Строка(Ордер.Дата)));
		СтруктураОтвета.Вставить("РабочийУчастокУИД", XMLСтрока(Ордер.РабочийУчасток));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура) КАК НоменклатураУИД,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Склад) КАК СкладУИД,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка) КАК ЯчейкаУИД,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.ЯчейкаПромежуточногоХранения КАК ЯПХ,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Сотрудник КАК Сотрудник,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура КАК Номенклатура,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение КАК Назначение,
		|   ВидыНоменклатуры.ПродукцияМаркируемаяДляГИСМ КАК Маркировка,
		|	ВЫБОР
		|		КОГДА РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
		|				ИЛИ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
		|			ТОГДА ЕСТЬNULL(ТоварыКОтгрузкеПоНакладнымОстатки.КОтгрузкеОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеПоНакладнымОстатки.КСборкеОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеПоНакладнымОстатки.СобираетсяОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеПоНакладнымОстатки.СобраноОстаток, 0) + РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
		|					ТОГДА ЕСТЬNULL(ТоварыКОтгрузкеПоНакладнымОстатки.СобираетсяОстаток, 0)
		|				ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок
		|			КОНЕЦ
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлен)
		|			ТОГДА 0
		|		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок + ЕСТЬNULL(СостоянияТоваровОбменМП.Количество, 0)
		|	КОНЕЦ КАК КоличествоФакт,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ОстатокНаСкладе
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияТоваровОбменМП КАК СостоянияТоваровОбменМП
		|		ПО (СостоянияТоваровОбменМП.Номенклатура = РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура)
		|			И (СостоянияТоваровОбменМП.Характеристика = РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика)
		|			И (СостоянияТоваровОбменМП.Назначение = РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение)
		|			И (СостоянияТоваровОбменМП.ДокументОрдер = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка)
		|			И НЕ СостоянияТоваровОбменМП.Обработано
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузкеПоНакладным.Остатки КАК ТоварыКОтгрузкеПоНакладнымОстатки
		|		ПО (ТоварыКОтгрузкеПоНакладнымОстатки.Номенклатура = РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура)
		|			И (ТоварыКОтгрузкеПоНакладнымОстатки.Характеристика = РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика)
		|			И (ТоварыКОтгрузкеПоНакладнымОстатки.Назначение = РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение)
		|			И (ТоварыКОтгрузкеПоНакладнымОстатки.Накладная = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Накладная)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ПО РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|			И РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Склад = ТоварыНаСкладахОстатки.Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка = &Ордер
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование";
		
		Запрос.УстановитьПараметр("Ордер", Ордер);
		
	Иначе
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТоварыКОтгрузкеПоНакладнымОстатки.Номенклатура) КАК НоменклатураУИД,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТоварыКОтгрузкеПоНакладнымОстатки.Склад) КАК СкладУИД,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка) КАК ЯчейкаУИД,
		|	ТоварыКОтгрузкеПоНакладнымОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузкеПоНакладнымОстатки.Характеристика КАК Характеристика,
		|	ТоварыКОтгрузкеПоНакладнымОстатки.Назначение КАК Назначение,
		|   ВидыНоменклатуры.ПродукцияМаркируемаяДляГИСМ КАК Маркировка,
		|   РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|   """" КАК ЯПХ,
		|   """" КАК Сотрудник,		
		|	ТоварыКОтгрузкеПоНакладнымОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.КСборкеОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.СобираетсяОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.СобраноОстаток КАК Количество,
		|	ТоварыКОтгрузкеПоНакладнымОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.КСборкеОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.СобираетсяОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.СобраноОстаток КАК КоличествоУпаковок,
		|   0 КАК КоличествоФакт,
		|   ЕстьNull(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК ОстатокНаСкладе
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузкеПоНакладным.Остатки КАК ТоварыКОтгрузкеПоНакладнымОстатки 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ТоварыКОтгрузкеПоНакладнымОстатки.Номенклатура)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыКОтгрузкеПоНакладнымОстатки.Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ПО (ТоварыКОтгрузкеПоНакладнымОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|				И ТоварыКОтгрузкеПоНакладнымОстатки.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|				И ТоварыКОтгрузкеПоНакладнымОстатки.Склад = ТоварыНаСкладахОстатки.Склад)   
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО ТоварыКОтгрузкеПоНакладнымОстатки.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТоварыКОтгрузкеПоНакладнымОстатки.Накладная) = &Накладная
		|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТоварыКОтгрузкеПоНакладнымОстатки.РабочийУчасток) = &РабочийУчасток
		|	И ТоварыКОтгрузкеПоНакладнымОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.КСборкеОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.СобираетсяОстаток - ТоварыКОтгрузкеПоНакладнымОстатки.СобраноОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование";
		
		Запрос.УстановитьПараметр("Накладная", Накладная);	
		Запрос.УстановитьПараметр("РабочийУчасток", РабочийУчасток); 
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивОрдер = Новый Массив();
	МассивНоменклатура = Новый Массив(); 
	ЯПХ = "";
	Сотрудник = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.НоменклатураУИД));
		СтруктураСтрока.Вставить("СкладУИД",XMLСтрока(ВыборкаДетальныеЗаписи.СкладУИД));
		СтруктураСтрока.Вставить("ЯчейкаУИД",XMLСтрока(ВыборкаДетальныеЗаписи.ЯчейкаУИД));
		СтруктураСтрока.Вставить("Номенклатура",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номенклатура)));
		СтруктураСтрока.Вставить("ЕдиницаИзмерения",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номенклатура.ЕдиницаИзмерения)));	
		СтруктураСтрока.Вставить("Характеристика",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Характеристика)));
		СтруктураСтрока.Вставить("Назначение",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Назначение))); 
		СтруктураСтрока.Вставить("Ячейка",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Ячейка)));
		СтруктураСтрока.Вставить("Количество",XMLСтрока(ВыборкаДетальныеЗаписи.Количество));
		СтруктураСтрока.Вставить("КоличествоФакт",XMLСтрока(ВыборкаДетальныеЗаписи.КоличествоФакт));
		СтруктураСтрока.Вставить("ОстатокНаСкладе",XMLСтрока(ВыборкаДетальныеЗаписи.ОстатокНаСкладе)); 
		СтруктураСтрока.Вставить("Маркировка",XMLСтрока(ВыборкаДетальныеЗаписи.Маркировка)); 
		МассивОрдер.Добавить(СтруктураСтрока);
		
		ЯПХ = ВыборкаДетальныеЗаписи.ЯПХ;
		Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		
		МассивНоменклатура.Добавить(ВыборкаДетальныеЗаписи.Номенклатура);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ШтрихкодыНоменклатуры.Номенклатура) КАК Номенклатура,
		|   ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура В (&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ШтрихкодыНоменклатуры = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("Характеристика",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Характеристика)));
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура));
		СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Штрихкод))); 
		
		ШтрихкодыНоменклатуры.Добавить(СтруктураСтрока);
	КонецЦикла;

    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК Штрихкод,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура) КАК Номенклатура,
		|	1 КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ШтрихкодыУпаковок КАК РасходныйОрдерНаТоварыШтрихкодыУпаковок
		|ГДЕ
		|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.Ссылка = &Ордер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СостояниеМаркировкиОбменМП.ШтрихкодМаркировки.ЗначениеШтрихкода,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СостояниеМаркировкиОбменМП.ШтрихкодМаркировки.Номенклатура),
		|	1
		|ИЗ
		|	РегистрСведений.СостояниеМаркировкиОбменМП КАК СостояниеМаркировкиОбменМП
		|ГДЕ
		|	СостояниеМаркировкиОбменМП.ДокументОрдер = &Ордер
		|	И СостояниеМаркировкиОбменМП.Обработано = ЛОЖЬ
		|	И (СостояниеМаркировкиОбменМП.Действие = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданий.Создание)
		|			ИЛИ СостояниеМаркировкиОбменМП.Действие = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданий.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СостояниеМаркировкиОбменМП.ШтрихкодМаркировки.ЗначениеШтрихкода,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СостояниеМаркировкиОбменМП.ШтрихкодМаркировки.Номенклатура),
		|	-1
		|ИЗ
		|	РегистрСведений.СостояниеМаркировкиОбменМП КАК СостояниеМаркировкиОбменМП
		|ГДЕ
		|	СостояниеМаркировкиОбменМП.ДокументОрдер = &Ордер
		|	И СостояниеМаркировкиОбменМП.Обработано = ЛОЖЬ
		|	И СостояниеМаркировкиОбменМП.Действие = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданий.Удаление)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Штрихкод КАК Штрихкод,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ.Количество) КАК Количество
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Штрихкод,
		|	ВТ.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ.Количество) > 0";
	
	Запрос.УстановитьПараметр("Ордер", Ордер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ШтрихкодыУпаковокНакладной = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура));
		СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Штрихкод))); 
		
		ШтрихкодыУпаковокНакладной.Добавить(СтруктураСтрока);
	КонецЦикла;

	СтруктураОтвета.Вставить("ЯПХ", XMLСтрока(ЯПХ)); 
	СтруктураОтвета.Вставить("Сотрудник", XMLСтрока(Строка(Сотрудник)));
	СтруктураОтвета.Вставить("ШтрихкодыНоменклатуры", ШтрихкодыНоменклатуры);
	СтруктураОтвета.Вставить("ШтрихкодыУпаковокНакладной", ШтрихкодыУпаковокНакладной);
	СтруктураОтвета.Вставить("МассивОрдер", МассивОрдер); 
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ExchangeStatus(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получена пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
    Накладная = Новый УникальныйИдентификатор(ВходящиеДанные.Накладная);
	РабочийУчасток = Новый УникальныйИдентификатор(ВходящиеДанные.РабочийУчасток);
	ТипЖурнала = ВходящиеДанные.ТипЖурнала; 
	
	ТекстСообщения = "";  
	ОрдерВРаботе = Неопределено;
    МассивВариантовОтвета = Новый Массив();
	МассивОрдеров = Новый Массив();		
	
	СтатусДокумента = ПолучитьСтатусДокументаПоРегистру(Накладная,РабочийУчасток); 
	
	Если  СтатусДокумента.Статус = Перечисления.СостоянияДокументовТСД.ВРаботе Тогда
		
		Если СтатусДокумента.Сотрудник = Сотрудник Тогда
			
			Если ТипЖурнала = "Приемка" Тогда
				ТекстСообщения =  "Ордер создан, вернуться к приемке?"; 
			Иначе
				ТекстСообщения =  "Документ у вас в работе. Вернуться к сборке?";  
			КонецЕсли;
			
			ОрдерВРаботе = СтатусДокумента.Ордер;
			МассивВариантовОтвета.Добавить("ПерейтиКОрдеру"); 
			МассивВариантовОтвета.Добавить("Отмена");
		Иначе
			ТекстСообщения =  "Документ уже в работе у сотрудника - " + Строка(СтатусДокумента.Сотрудник);
			МассивВариантовОтвета.Добавить("Отмена");
		КонецЕсли;      
		
	Иначе
		
		Если ТипЖурнала = "Приемка" Тогда
			
			Если ПоРаспоряжениюИСекцииЕстьОрдера(Накладная,РабочийУчасток) Тогда
				 ТекстСообщения="Найдены созданные ордера. Создать новый?"; 
			 Иначе
				 ТекстСообщения=""; 
			КонецЕсли;
			
		Иначе
			
		СтруктураОрдераПоДокументу = ПолучитьРасходныеОрдераПоНакладной(Накладная,РабочийУчасток); 
		
		ОрдераПоДокументу = СтруктураОрдераПоДокументу.МассивОрдеров;
		ПодготовленныеОрдераПоДокументу = СтруктураОрдераПоДокументу.ПодготовленныеОрдера;
		
		ОжидаетсяОтбор = СтруктураОрдераПоДокументу.ОжидаетсяОтбор;
		Набирается =  СтруктураОрдераПоДокументу.Набирается;
		Набран =  СтруктураОрдераПоДокументу.Набран;
		Отгружен =  СтруктураОрдераПоДокументу.Отгружен;
		
		ОрдерОдин = Ложь;
		Если ОрдераПоДокументу.Количество()=1 Тогда
			ОрдерОдин = Истина;
			ОрдерВРаботе = ОрдераПоДокументу[0];  
		КонецЕсли;
		
		Если ОжидаетсяОтбор Тогда
			
			Если Набирается ИЛИ Набран ИЛИ Отгружен Тогда
				ТекстСообщения = "Документ не собран полностью. Можно посмотреть товары или перейти к ордерам.";  
				МассивВариантовОтвета.Добавить("ПерейтиКОрдерам");  
			Иначе
				ТекстСообщения = "Документ не собирался. Посмотреть товары?";
			КонецЕсли;
			
			Если ПодготовленныеОрдераПоДокументу.Количество()=0 Тогда
				
				МассивВариантовОтвета.Добавить("НачатьСборку"); 
				
			ИначеЕсли ПодготовленныеОрдераПоДокументу.Количество()=1 Тогда
				ТекстСообщения = ТекстСообщения + "(есть ордер в статусе Подготовлено)";
				ОрдерВРаботе = ПодготовленныеОрдераПоДокументу[0];
				МассивВариантовОтвета.Добавить("ПерейтиКОрдеру"); 
				
			КонецЕсли;
			
			МассивВариантовОтвета.Добавить("Отмена");
			
		ИначеЕсли Набирается Тогда
			
			Если Отгружен Тогда
				ТекстСообщения = "Товар частично отгружен, но не собран полностью.";
			ИначеЕсли Набран Тогда
				ТекстСообщения = "Товар частично собран, но не полностью.";   
			Иначе
				ТекстСообщения = "Товар набирается.";   
			КонецЕсли;
			
			Если ОрдерОдин Тогда  
				Если ОрдерВРаботе.Сотрудник = Сотрудник Тогда 
					ТекстСообщения = "Документ у вас в работе. Вернуться к сборке?"; 
					МассивВариантовОтвета.Добавить("ПерейтиКОрдеру"); 
			        МассивВариантовОтвета.Добавить("Отмена");
				Иначе    
					ТекстСообщения =  "Документ уже в работе у сотрудника - " + Строка(ОрдерВРаботе.Сотрудник);
					МассивВариантовОтвета.Добавить("Отмена");
				КонецЕсли;
			Иначе 
				ТекстСообщения = "По документу несколько ордеров перейдите в список и выберите.";
				МассивВариантовОтвета.Добавить("ПерейтиКОрдерам"); 
				МассивВариантовОтвета.Добавить("Отмена");
			КонецЕсли;
			
		ИначеЕсли Набран Тогда
			
			Если Отгружен Тогда
								
				Если ОрдерОдин Тогда 
					ТекстСообщения = "Товар частично отгружен и собран. Статус документа 'К отгрузке'. Ячейка промежуточного хранения - " + Строка(ОрдерВРаботе.ЯчейкаПромежуточногоХранения);   
					МассивВариантовОтвета.Добавить("ПерейтиКОрдеру");
				Иначе  
					ТекстСообщения = "Товар частично отгружен и собран. Перейдите в список расходных ордеров для продолжения работы.";   
					МассивВариантовОтвета.Добавить("ПерейтиКОрдерам");
				КонецЕсли;    
				
				МассивВариантовОтвета.Добавить("Отмена"); 
				
			Иначе  
						
				Если ОрдерОдин Тогда 
					ТекстСообщения = "Товар собран. Статус документа 'К отгрузке'. Ячейка промежуточного хранения - " + Строка(ОрдерВРаботе.ЯчейкаПромежуточногоХранения);   
					МассивВариантовОтвета.Добавить("ПерейтиКОрдеру");
				Иначе  
					ТекстСообщения = "Товар собран. Перейдите в список расходных ордеров для продолжения работы.";   
					МассивВариантовОтвета.Добавить("ПерейтиКОрдерам");
				КонецЕсли;    
				
				МассивВариантовОтвета.Добавить("Отмена");   
				
			КонецЕсли;  
			
		ИначеЕсли Отгружен Тогда 
			
			ТекстСообщения = "Документ отгружен.";
			Если ОрдерОдин Тогда
				МассивВариантовОтвета.Добавить("ПерейтиКОрдеру");
			Иначе
				МассивВариантовОтвета.Добавить("ПерейтиКОрдерам"); 
			КонецЕсли;    
			
			МассивВариантовОтвета.Добавить("Отмена"); 
			
		КонецЕсли;  
	КонецЕсли;	
	КонецЕсли;

	СтруктураОтвета = Новый Структура;
			
	СтруктураОтвета.Вставить("ТекстСообщения", XMLСтрока(ТекстСообщения));
	СтруктураОтвета.Вставить("ОрдерВРаботе", XMLСтрока(ОрдерВРаботе));
	СтруктураОтвета.Вставить("НомерОрдера", XMLСтрока(?(НЕ ОрдерВРаботе = Неопределено,ОрдерВРаботе.Номер,"")));
	СтруктураОтвета.Вставить("МассивВариантовОтвета", МассивВариантовОтвета);
	СтруктураОтвета.Вставить("СтатусОрдера", XMLСтрока(?(НЕ ОрдерВРаботе = Неопределено,ОрдерВРаботе.Статус,"")));   
	СтруктураОтвета.Вставить("ЯПХ", XMLСтрока(?(НЕ ОрдерВРаботе = Неопределено И ТипЖурнала = "Отгрузка",Строка(ОрдерВРаботе.ЯчейкаПромежуточногоХранения),"")));   
	СтруктураОтвета.Вставить("Сотрудник", XMLСтрока(?(НЕ ОрдерВРаботе = Неопределено,Строка(ОрдерВРаботе.Сотрудник),""))); 
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ExchangeПриемка(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;
    Накладная = Новый УникальныйИдентификатор(ВходящиеДанные.Накладная);
	РабочийУчасток = Новый УникальныйИдентификатор(ВходящиеДанные.РабочийУчасток);
	
	СтруктураОтвета = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Если ВходящиеДанные.Свойство("Ордер") Тогда 
		
		Ордер = Документы.ПриходныйОрдерНаТовары.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Ордер));
		
		Документ = Ордер.Распоряжение;
		
		СтруктураОтвета.Вставить("ДатаВХ", XMLСтрока(Строка(Ордер.ДатаВходящегоДокумента)));
		СтруктураОтвета.Вставить("НомерВХ", XMLСтрока(Строка(Ордер.НомерВходящегоДокумента))); 
		СтруктураОтвета.Вставить("Дата", XMLСтрока(Строка(Документ.Дата)));
		СтруктураОтвета.Вставить("Номер", XMLСтрока(Строка(Документ.Номер))); 
		СтруктураОтвета.Вставить("ДокументУИД", XMLСтрока(Документ));
	    СтруктураОтвета.Вставить("Документ", XMLСтрока(Строка(ТипЗнч(Документ))));   
		СтруктураОтвета.Вставить("Отправитель", XMLСтрока(Строка(Ордер.Отправитель))); 
		СтруктураОтвета.Вставить("ОтправительУИД", XMLСтрока(Ордер.Отправитель)); 
		СтруктураОтвета.Вставить("Статус", XMLСтрока(Строка(Ордер.Статус)));
		СтруктураОтвета.Вставить("НомерОрдера", XMLСтрока(Строка(Ордер.Номер))); 
		СтруктураОтвета.Вставить("ДатаОрдера", XMLСтрока(Строка(Ордер.Дата)));
		СтруктураОтвета.Вставить("РабочийУчастокУИД", XMLСтрока(Ордер.РабочийУчасток));
	    СтруктураОтвета.Вставить("Сотрудник", XMLСтрока(Ордер.Сотрудник));
		СтруктураОтвета.Вставить("Комментарий", XMLСтрока(Ордер.Комментарий));
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыТовары.Ссылка.Склад КАК Склад,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
		|	ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
		|	ПриходныйОрдерНаТоварыТовары.Назначение КАК Назначение,
		|	ВидыНоменклатуры.ПродукцияМаркируемаяДляГИСМ КАК Маркировка,
		|ВЫБОР
		|	КОГДА ПриходныйОрдерНаТоварыТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
		|		ТОГДА ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеровОстаток, 0) + ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок
		|	ИНАЧЕ ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеровОстаток, 0)
		|КОНЕЦ КАК КоличествоПлан,
		|	ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок + ЕСТЬNULL(СостоянияТоваровОбменМП.Количество, 0) КАК КоличествоФакт
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлению
		|		ПО (ТоварыКПоступлению.Номенклатура = ПриходныйОрдерНаТоварыТовары.Номенклатура)
		|			И (ТоварыКПоступлению.Склад = ПриходныйОрдерНаТоварыТовары.Ссылка.Склад)
		|			И (ТоварыКПоступлению.ДокументПоступления = &Документ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ПриходныйОрдерНаТоварыТовары.Номенклатура)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ПриходныйОрдерНаТоварыТовары.Ссылка.Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО ПриходныйОрдерНаТоварыТовары.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияТоваровОбменМП КАК СостоянияТоваровОбменМП
		|		ПО (СостоянияТоваровОбменМП.Номенклатура = ПриходныйОрдерНаТоварыТовары.Номенклатура)
		|			И (СостоянияТоваровОбменМП.Характеристика = ПриходныйОрдерНаТоварыТовары.Характеристика)
		|			И (СостоянияТоваровОбменМП.Назначение = ПриходныйОрдерНаТоварыТовары.Назначение)
		|			И (СостоянияТоваровОбменМП.ДокументОрдер = ПриходныйОрдерНаТоварыТовары.Ссылка)
		|			И НЕ СостоянияТоваровОбменМП.Обработано
		|ГДЕ
		|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ордер
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование";
		
		Запрос.УстановитьПараметр("Ордер", Ордер);
		Запрос.УстановитьПараметр("Документ", Документ);
		
	Иначе
		
		СтруктураОтвета.Вставить("Сотрудник", XMLСтрока(""));
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ТоварыКПоступлению.Склад КАК Склад,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлению.Характеристика КАК Характеристика,
		|	ТоварыКПоступлению.Назначение КАК Назначение,
		|	ВидыНоменклатуры.ПродукцияМаркируемаяДляГИСМ КАК Маркировка,
		|	ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеровОстаток, 0) - ЕСТЬNULL(ТоварыКПоступлению.ПринимаетсяОстаток, 0) КАК КоличествоПлан,
		|	0 КАК КоличествоФакт
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлению
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ТоварыКПоступлению.Номенклатура)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыКПоступлению.Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО ТоварыКПоступлению.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТоварыКПоступлению.ДокументПоступления) = &Накладная
		|	И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
		|			ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток) = &РабочийУчасток)
		|	И ТоварыКПоступлению.КОформлениюОрдеровОстаток - ТоварыКПоступлению.ПринимаетсяОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование";
		
		Запрос.УстановитьПараметр("Накладная", Накладная);
		Запрос.УстановитьПараметр("РабочийУчасток", РабочийУчасток);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивНоменклатура = Новый Массив();  
	
	ПКО = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("Номенклатура",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номенклатура)));
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура));
		СтруктураСтрока.Вставить("СкладУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Склад));
		СтруктураСтрока.Вставить("ЯчейкаУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Ячейка));
		СтруктураСтрока.Вставить("ЕдиницаИзмерения",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номенклатура.ЕдиницаИзмерения)));	
		СтруктураСтрока.Вставить("Характеристика",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Характеристика)));
		СтруктураСтрока.Вставить("Назначение",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Назначение))); 
		СтруктураСтрока.Вставить("Ячейка",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Ячейка)));
		СтруктураСтрока.Вставить("План",XMLСтрока(ВыборкаДетальныеЗаписи.КоличествоПлан));
		СтруктураСтрока.Вставить("Факт",XMLСтрока(ВыборкаДетальныеЗаписи.КоличествоФакт));
		СтруктураСтрока.Вставить("Маркировка",XMLСтрока(ВыборкаДетальныеЗаписи.Маркировка)); 

		МассивНоменклатура.Добавить(ВыборкаДетальныеЗаписи.Номенклатура);

		ПКО.Добавить(СтруктураСтрока);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("ПКО", ПКО);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ШтрихкодыНоменклатуры.Номенклатура) КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура В (&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ШтрихкодыНоменклатуры = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура));
		СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Штрихкод))); 
		
		ШтрихкодыНоменклатуры.Добавить(СтруктураСтрока);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("ШтрихкодыНоменклатуры", ШтрихкодыНоменклатуры);  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК Штрихкод,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПриходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура) КАК Номенклатура,
		|	1 КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.ШтрихкодыУпаковок КАК ПриходныйОрдерНаТоварыШтрихкодыУпаковок
		|ГДЕ
		|	ПриходныйОрдерНаТоварыШтрихкодыУпаковок.Ссылка = &Ордер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СостояниеМаркировкиОбменМП.ШтрихкодМаркировки.ЗначениеШтрихкода,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СостояниеМаркировкиОбменМП.ШтрихкодМаркировки.Номенклатура),
		|	1
		|ИЗ
		|	РегистрСведений.СостояниеМаркировкиОбменМП КАК СостояниеМаркировкиОбменМП
		|ГДЕ
		|	СостояниеМаркировкиОбменМП.ДокументОрдер = &Ордер
		|	И СостояниеМаркировкиОбменМП.Обработано = ЛОЖЬ
		|	И (СостояниеМаркировкиОбменМП.Действие = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданий.Создание)
		|			ИЛИ СостояниеМаркировкиОбменМП.Действие = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданий.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СостояниеМаркировкиОбменМП.ШтрихкодМаркировки.ЗначениеШтрихкода,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СостояниеМаркировкиОбменМП.ШтрихкодМаркировки.Номенклатура),
		|	-1
		|ИЗ
		|	РегистрСведений.СостояниеМаркировкиОбменМП КАК СостояниеМаркировкиОбменМП
		|ГДЕ
		|	СостояниеМаркировкиОбменМП.ДокументОрдер = &Ордер
		|	И СостояниеМаркировкиОбменМП.Обработано = ЛОЖЬ
		|	И СостояниеМаркировкиОбменМП.Действие = ЗНАЧЕНИЕ(Перечисление.ТипыЗаданий.Удаление)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Штрихкод КАК Штрихкод,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ.Количество) КАК Количество
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Штрихкод,
		|	ВТ.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ.Количество) > 0";
	
	Запрос.УстановитьПараметр("Ордер", Ордер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ШтрихкодыУпаковокНакладной = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура));
		СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Штрихкод))); 
		
		ШтрихкодыУпаковокНакладной.Добавить(СтруктураСтрока);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("ШтрихкодыУпаковокНакладной", ШтрихкодыУпаковокНакладной);

	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;  
КонецФункции

Функция ExchangeПересчет(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;
    Накладная = Новый УникальныйИдентификатор(ВходящиеДанные.Накладная);
	
	СтруктураОтвета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПересчетТоваровТовары.Номенклатура) КАК НоменклатураУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПересчетТоваровТовары.Ссылка.Склад) КАК СкладУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка) КАК ЯчейкаУИД,
	|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
	|	ПересчетТоваровТовары.Назначение КАК Назначение,
	|   РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|	ПересчетТоваровТовары.Количество КАК Количество,
	|	ПересчетТоваровТовары.КоличествоФакт КАК КоличествоФакт
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ПересчетТоваровТовары.Номенклатура)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ПересчетТоваровТовары.Ссылка.Склад)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПересчетТоваровТовары.Ссылка) = &Накладная";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивНоменклатура = Новый Массив();  
	
	РКО = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("Номенклатура",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номенклатура)));
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.НоменклатураУИД));
		СтруктураСтрока.Вставить("СкладУИД",XMLСтрока(ВыборкаДетальныеЗаписи.СкладУИД)); 
		СтруктураСтрока.Вставить("ЯчейкаУИД",XMLСтрока(ВыборкаДетальныеЗаписи.ЯчейкаУИД)); 
		СтруктураСтрока.Вставить("ЕдиницаИзмерения",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Номенклатура.ЕдиницаИзмерения)));	
		СтруктураСтрока.Вставить("Характеристика",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Характеристика)));
		СтруктураСтрока.Вставить("Назначение",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Назначение))); 
		СтруктураСтрока.Вставить("Ячейка",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Ячейка)));
		СтруктураСтрока.Вставить("Количество",XMLСтрока(ВыборкаДетальныеЗаписи.Количество));
		
		МассивНоменклатура.Добавить(ВыборкаДетальныеЗаписи.Номенклатура);    
		
		РКО.Добавить(СтруктураСтрока);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("Пересчет", РКО);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ШтрихкодыНоменклатуры.Номенклатура) КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура В (&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ШтрихкодыНоменклатуры = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура));
		СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Штрихкод))); 
		
		ШтрихкодыНоменклатуры.Добавить(СтруктураСтрока);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("ШтрихкодыНоменклатуры", ШтрихкодыНоменклатуры);

	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;  
КонецФункции

Функция СозданиеИзменениеОрдера(ДанныеJSON)
    Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;

	СтруктураОтвета = Новый Структура;

	ТипЖурнала = ВходящиеДанные.ТипЖурнала;

	ИдентификаторКлиента = Новый УникальныйИдентификатор(ВходящиеДанные.ИдентификаторКлиента); 
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
		
	Статус = ВходящиеДанные.Статус; 
	Действие = ВходящиеДанные.Действие;
	
	ТипОрдера = ?(ТипЖурнала="Отгрузка","РасходныйОрдерНаТовары","ПриходныйОрдерНаТовары");
	
	Ордер = Неопределено;
	Если ВходящиеДанные.Свойство("Ордер") Тогда
		Ордер = Документы[ТипОрдера].ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Ордер));
		Если Ордер.Пустая() Тогда
			ИмяДокумента = ПолучитьИмяДокумента(ВходящиеДанные.ТипДокумента);
			Накладная = Документы[ИмяДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Накладная));
			РабочийУчасток = Справочники.РабочиеУчастки.ПолучитьСсылку(
				Новый УникальныйИдентификатор(ВходящиеДанные.РабочийУчасток));
		Иначе
			Накладная = ?(ТипОрдера = "РасходныйОрдерНаТовары",Ордер.Накладная,Ордер.Распоряжение);
			РабочийУчасток = Ордер.РабочийУчасток;
		КонецЕсли;
	КонецЕсли;
	
	//Проверяем в работе ли документ
	СтатусДокумента = ПолучитьСтатусДокументаПоРегистру(Накладная.УникальныйИдентификатор(),РабочийУчасток.УникальныйИдентификатор()); 
	
	Если СтатусДокумента.Статус = Перечисления.СостоянияДокументовТСД.ВРаботе Тогда

		Если Не СтатусДокумента.Сотрудник = Сотрудник Тогда
			СтруктураОтвета.Вставить("ТекстОшибки", XMLСтрока("Документ уже в работе у сотрудника - " + Строка(
				СтатусДокумента.Сотрудник)));
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь, , СтруктураОтвета);
			Возврат Ответ;
		КонецЕсли;

	КонецЕсли; 
	
	//Проверяем созданные документы
	Если Ордер = Неопределено И ТипЖурнала="Отгрузка" Тогда
		
		СтруктураОрдераПоДокументу = ПолучитьРасходныеОрдераПоНакладной(Накладная.УникальныйИдентификатор(),РабочийУчасток.УникальныйИдентификатор()); 
		
		ОрдераПоДокументу = СтруктураОрдераПоДокументу.МассивОрдеров;
		КоличествоОрдеров = ОрдераПоДокументу.Количество();
		
		Если КоличествоОрдеров > 0 Тогда 
			
			Если КоличествоОрдеров = 1 Тогда
			
			ДокументОрдер = ОрдераПоДокументу[0];
				
			СтруктураОтвета.Вставить("ТекстОшибки", XMLСтрока("Документ уже в работе у сотрудника - " + Строка(
			ДокументОрдер.Сотрудник) + ". Статус документа - " + Строка(ДокументОрдер.Статус)));
				
			Иначе
				
			СтруктураОтвета.Вставить("ТекстОшибки", XMLСтрока("По документу уже есть несколько созданных ордеров, проверьте состояние документа на компьютере."));	
				
			КонецЕсли;
			
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь, , СтруктураОтвета);
			Возврат Ответ;
			
		КонецЕсли;
		
	КонецЕсли;
		     
	Склад = РабочийУчасток.Владелец;	

	ЯПХ = Справочники.СкладскиеЯчейки.ПустаяСсылка();	
	Если ВходящиеДанные.Свойство("ЯПХ") Тогда
		ЯПХ = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.ЯПХ));
	КонецЕсли; 
	
	ДатаВХ = Дата(1,1,1);
    Если ВходящиеДанные.Свойство("ДатаВХ") Тогда
		ДатаВХ = Дата(СтрЗаменить(Лев(ВходящиеДанные.ДатаВХ,10),"-",""));
	КонецЕсли;

	НомерВХ = "";
    Если ВходящиеДанные.Свойство("НомерВХ") Тогда
		НомерВХ = Строка(ВходящиеДанные.НомерВХ);;
	КонецЕсли;
	
	ХозяйственнаяОперация = "";
    Если ВходящиеДанные.Свойство("ХозяйственнаяОперация") Тогда
		ХозяйственнаяОперация = Строка(ВходящиеДанные.ХозяйственнаяОперация);;
	КонецЕсли;
	
	Отмена = Ложь;
    Если ВходящиеДанные.Свойство("Отмена") Тогда
		Отмена = Булево(ВходящиеДанные.Отмена);;
	КонецЕсли; 
	
	Комментарий = "";
	Если ВходящиеДанные.Свойство("Комментарий") Тогда
		Комментарий = Строка(ВходящиеДанные.Комментарий);;
	КонецЕсли;

	ОрдерСсылка = Неопределено;

	Если Действие = "СоздатьДокумент" И (Ордер = Неопределено ИЛИ Ордер.Пустая()) Тогда
		
		Если ТипЖурнала = "Отгрузка" Тогда
			ОрдерСсылка = СоздатьРасходныйОрдерНаТовары(Накладная,РабочийУчасток,Сотрудник); 				
		ИначеЕсли ТипЖурнала = "Приемка" Тогда
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("Склад",Склад); 
			ДанныеЗаполнения.Вставить("РабочийУчасток",РабочийУчасток);
			ДанныеЗаполнения.Вставить("Сотрудник",Сотрудник);
			ДанныеЗаполнения.Вставить("НомерВходящегоДокумента",НомерВХ);
			ДанныеЗаполнения.Вставить("ДатаВходящегоДокумента",ДатаВХ);
			ДанныеЗаполнения.Вставить("Распоряжение",Накладная);
			ДанныеЗаполнения.Вставить("Отправитель",?(ИмяДокумента="ПеремещениеТоваров",Накладная.СкладОтправитель,Накладная.Партнер)); 
			ДанныеЗаполнения.Вставить("ХозяйственнаяОперация",ПолучитьХозяйственнуюОперацию(ХозяйственнаяОперация));
			ДанныеЗаполнения.Вставить("Комментарий", Комментарий);
			
			
			ОрдерСсылка = СоздатьПриходныйОрдерНаТовары(ДанныеЗаполнения); 				

		Иначе
			
			ОрдерСсылка = Накладная;
			
		КонецЕсли;
		
	Иначе
		
		ОрдерСсылка = Ордер;

	КонецЕсли;
	
    ЗаписатьДанныеВРегистрСостоянияДокументовОбменМП(ОрдерСсылка,Накладная,Статус,Склад,РабочийУчасток,ЯПХ,Сотрудник,ИдентификаторКлиента);
	
	СтруктураДанныхФЗ = ПолучитьСтруктуруЗапускаФоновогоЗадания();
	СтруктураДанныхФЗ.ТипОбмена = "ОбменДокументами";
	СтруктураДанныхФЗ.Журнал = ТипЖурнала;
	СтруктураДанныхФЗ.Секция = РабочийУчасток;
	СтруктураДанныхФЗ.Накладная = Накладная;
	СтруктураДанныхФЗ.ДатаВХ = ДатаВХ;
	СтруктураДанныхФЗ.НомерВХ = НомерВХ;
	СтруктураДанныхФЗ.Отмена = Отмена; 
	СтруктураДанныхФЗ.Комментарий = Комментарий;
	
	ОбменУТМПСервер.ЗапуститьФоновоеВыполнение("",СтруктураДанныхФЗ);
	
	Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(Перечисления.СобытияРаботыТСД.Документ,"Мобильное приложение",ОрдерСсылка,Сотрудник,ИдентификаторКлиента);
	
	СтруктураОтвета.Вставить("ОрдерВРаботе", XMLСтрока(ОрдерСсылка)); 
	СтруктураОтвета.Вставить("НомерОрдера", XMLСтрока(ОрдерСсылка.Номер)); 
	СтруктураОтвета.Вставить("Статус", XMLСтрока(Строка(ОрдерСсылка.Статус)));
	СтруктураОтвета.Вставить("ДатаОрдера", XMLСтрока(Строка(ОрдерСсылка.Дата)));
	СтруктураОтвета.Вставить("ТекстОшибки",XMLСтрока(""));
	
	Ответ = ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
		
	Возврат Ответ;     
	
	
КонецФункции  

Функция УдалениеОрдера(ДанныеJSON)
    Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;

	СтруктураОтвета = Новый Структура;
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента; 
	КодСотрудника = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	ТипДокумента = ВходящиеДанные.ТипДокумента; 
	
	Ордер = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Ордер));
	
	ТекстОшибки = "";
	Попытка
		ОбъектДок = Ордер.ПолучитьОбъект();
		ОбъектДок.Заблокировать();
		ОбъектДок.ПометкаУдаления = Истина;
		ОбъектДок.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
	Исключение    
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	СтруктураОтвета.Вставить("ТекстОшибки",XMLСтрока(ТекстОшибки));
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
	
КонецФункции 

Функция СозданиеИзменениеСтроки(ДанныеJSON)
    Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;

	СтруктураОтвета = Новый Структура;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента; 
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	ТипОрдера = ВходящиеДанные.ТипОрдера;
	
	ДокументОрдер = Документы[ТипОрдера].ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.ОрдерГУИД)); 
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.НоменклатураУИД));
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Если Не ПустаяСтрока(ВходящиеДанные.Характеристика) Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(ВходящиеДанные.Характеристика, , ,
			Номенклатура);
	КонецЕсли;

	Назначение = Справочники.Назначения.ПустаяСсылка();
	Если Не ПустаяСтрока(ВходящиеДанные.Назначение) Тогда
		Назначение = Справочники.Назначения.НайтиПоНаименованию(ВходящиеДанные.Назначение, , , );
	КонецЕсли;
	
    Факт = Число(ВходящиеДанные.Факт);	
	
	ЗаписатьДанныеВРегистрСостоянияТоваровОбменМП(ДокументОрдер,Номенклатура,Характеристика,Назначение,Факт,Сотрудник);
	
	Если ВходящиеДанные.Свойство("ШтрихкодыКодовМаркировки") Тогда
		
		
		СтрокаЛогов = "";
		Для Каждого Элемент Из ВходящиеДанные.ШтрихкодыКодовМаркировки Цикл 
			 
			Действие = Перечисления.ТипыЗаданий.ПустаяСсылка();
			Если ТипЗнч(Элемент) = Тип("Структура") Тогда
				Штрихкод = Элемент.Штрихкод;
				Действие = ?(Элемент.Состояние = "Удалить", Перечисления.ТипыЗаданий.Удаление, Перечисления.ТипыЗаданий.Создание);
			Иначе
				Штрихкод = Элемент;
			КонецЕсли;	
			СтрокаЛогов = СтрокаЛогов + Строка(Действие) + " " + Строка(Штрихкод) + Символы.ПС;				
			CcылкаНаШтрихкод = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(Штрихкод);
			
			Если Не CcылкаНаШтрихкод = Неопределено Тогда
				ЗаписатьДанныеВРегистрСостояниеМаркировкиОбменМП(ДокументОрдер,CcылкаНаШтрихкод,Сотрудник, Действие);
			КонецЕсли;   
			
		КонецЦикла;
		ЗаписьЖурналаРегистрации("МобильноеПриложениеСклада.Маркировка", УровеньЖурналаРегистрации.Информация, , ,СтрокаЛогов);	
		
	КонецЕсли;
	
	//ОбменУТМПСервер.ЗапуститьФоновоеВыполнение("",Новый Структура("ТипОбмена,Документ,ИмяТЧ","ОбменТоварами",ДокументОрдер,?(ТипОрдера="РасходныйОрдерНаТовары","ОтгружаемыеТовары","Товары")));
		
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
		
КонецФункции

Функция СозданиеИзменениеПКО(ДанныеJSON) 
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента; 
	
	Статус = ВходящиеДанные.Статус; 
	Действие = ВходящиеДанные.Действие;
	ИмяДокумента = ПолучитьИмяДокумента(ВходящиеДанные.ТипДокумента);
	Накладная = Документы[ИмяДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Накладная));
	РабочийУчасток = Справочники.РабочиеУчастки.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.РабочийУчасток));

	Склад = РабочийУчасток.Владелец;	
	
	МенеджерЗаписи = РегистрыСведений.СтатусыДокументовОбменТСД.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.РабочийУчасток = РабочийУчасток;
	МенеджерЗаписи.Документ = Накладная;
	МенеджерЗаписи.Статус = Перечисления.СостоянияДокументовТСД[Статус]; 
	МенеджерЗаписи.Действие = Перечисления.ДействияСДокументамиТСД[Действие];
	
	МенеджерЗаписи.Записать();	
	
	ОбменУТМПСервер.ЗапуститьФоновоеВыполнение("",Новый Структура("Журнал,Секция,Накладная","Приемка",РабочийУчасток,Накладная));
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,Новый Структура());   
	
	Возврат Ответ;     
	
КонецФункции

Функция СозданиеИзменениеПересчета(ДанныеJSON) 

	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;

	СтруктураОтвета = Новый Структура;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента; 
	
	Статус = ВходящиеДанные.Статус; 
	Действие = ВходящиеДанные.Действие;
	Накладная = Документы.ПересчетТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Накладная));
	РабочийУчасток = Справочники.РабочиеУчастки.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.РабочийУчасток));

	Склад = РабочийУчасток.Владелец;	
	
	МенеджерЗаписи = РегистрыСведений.СтатусыДокументовОбменТСД.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.РабочийУчасток = РабочийУчасток;
	МенеджерЗаписи.Документ = Накладная;
	МенеджерЗаписи.Статус = Перечисления.СостоянияДокументовТСД[Статус]; 
	МенеджерЗаписи.Действие = Перечисления.ДействияСДокументамиТСД[Действие];
	
	МенеджерЗаписи.Записать();	
	
	ОбменУТМПСервер.ЗапуститьФоновоеВыполнение("",Новый Структура("Журнал,Секция,Накладная","Пересчет",РабочийУчасток,Накладная));
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ; 
	
КонецФункции

Функция СозданиеБлокировки(ДанныеJSON)
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	СтруктураОтвета = Новый Структура;
	
	ПричинаБлокировки = Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(ВходящиеДанные.ПричинаБлокировки);
	Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Склад));
	Комментарий = ?(ВходящиеДанные.Свойство("Комментарий"),"Создан на ТСД: " + Строка(ВходящиеДанные.Комментарий),"Создан на ТСД");
	МассивТоваров = ВходящиеДанные.МассивТоваров;
	
	ДокументБлокировки = ?(ВходящиеДанные.Свойство("ИдентификаторДокумента"),
	Документы.БлокировкаДвиженияТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.ИдентификаторДокумента)).ПолучитьОбъект(),
	Документы.БлокировкаДвиженияТоваров.СоздатьДокумент());

	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Склад",Склад);
	ПараметрыЗаполнения.Вставить("Статус",Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
	ПараметрыЗаполнения.Вставить("ПричинаБлокировки",ПричинаБлокировки);
	ПараметрыЗаполнения.Вставить("Комментарий",Комментарий); 
	ПараметрыЗаполнения.Вставить("ДокументОснование",Неопределено);
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура");
	Товары.Колонки.Добавить("Характеристика");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("КоличествоУпаковок");

	Для Каждого СтрокаЗначения Из МассивТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(
			Новый УникальныйИдентификатор(СтрокаЗначения.Номенклатура));
	    НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(
			СтрокаЗначения.Характеристика, Истина, , НоваяСтрока.Номенклатура);
		НоваяСтрока.Количество = Число(СтрокаЗначения.Количество);
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
	КонецЦикла;

	ПараметрыЗаполнения.Вставить("Товары",Товары);
	
	Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировки,ПараметрыЗаполнения,Истина);	
	
	СтруктураОтвета.Вставить("ИдентификаторДокумента",XMLСтрока(ДокументБлокировки.Ссылка));	
	СтруктураОтвета.Вставить("НомерДокумента",XMLСтрока(ДокументБлокировки.Номер));
	СтруктураОтвета.Вставить("НаименованиеСклада",XMLСтрока(Строка(ДокументБлокировки.Склад)));
	
	Ошибка = Ложь;	

	Если ДокументБлокировки.Ссылка.Пустая() Тогда
		Ошибка = Истина;	
	КонецЕсли;
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ошибка,,СтруктураОтвета);   
	
	Возврат Ответ;    
	
КонецФункции

Функция ПолучитьШтрихкодыНоменклатуры(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	СтруктураОтвета = Новый Структура;
	
	МассивНоменклатуры = Новый Массив();
	
	Для каждого Строка из ВходящиеДанные.МассивТоваров Цикл
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.НоменклатураУИД)); 
		МассивНоменклатуры.Добавить(Номенклатура);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ШтрихкодыНоменклатуры.Номенклатура) КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура В (&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ШтрихкодыНоменклатуры = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтруктураСтрока = Новый Структура();
		СтруктураСтрока.Вставить("НоменклатураУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура));
		СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(Строка(ВыборкаДетальныеЗаписи.Штрихкод))); 
		
		ШтрихкодыНоменклатуры.Добавить(СтруктураСтрока);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("ШтрихкодыНоменклатуры", ШтрихкодыНоменклатуры);
	
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьКартинку(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	СтруктураОтвета = Новый Структура;

	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.НоменклатураУИД));
	
	ДвоичныеДанные = "";
	
	ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ФайлКартинки");
	Если ЗначениеЗаполнено(ФайлКартинки) тогда
		ДвоичныеДанныеКартинки = РаботаСФайлами.ДвоичныеДанныеФайла(ФайлКартинки,); 
		ДвоичныеДанные = Base64Строка(ДвоичныеДанныеКартинки);
	Иначе
		ДвоичныеДанные = "Файл не найден";
	КонецЕсли;		
	
	СтруктураОтвета.Вставить("ДвоичныеДанныеКартинки", ДвоичныеДанные);
	
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ИзменитьЯчейку(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	СтруктураОтвета = Новый Структура;
	
	Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Склад));
	НоваяЯчейка = Справочники.СкладскиеЯчейки.НайтиПоРеквизиту("Штрихкод",ВходящиеДанные.Штрихкод);
    Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Ячейка));  
    Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Номенклатура));
	
	Если НоваяЯчейка.Пустая() Тогда
		НоваяЯчейка = "";	
	Иначе		
		ЯчейкаИзменена = Документы.ПриходныйОрдерНаТовары.ИзменитьЯчейку(Номенклатура, Склад, Ячейка, НоваяЯчейка);	
	КонецЕсли;
	
	СтруктураОтвета.Вставить("Ячейка", XMLСтрока(Строка(НоваяЯчейка)));
	СтруктураОтвета.Вставить("ЯчейкаУИД", XMLСтрока(НоваяЯчейка.УникальныйИдентификатор())); 
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьЯчейки(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	МассивРабочихУчастков = Новый Массив();
	
	Если ВходящиеДанные.Свойство("РабочийУчасток") Тогда
		РабочийУчасток = Справочники.РабочиеУчастки.ПолучитьСсылку(
			Новый УникальныйИдентификатор(ВходящиеДанные.РабочийУчасток));
		МассивРабочихУчастков.Добавить(РабочийУчасток);
	Иначе
		Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
		МассивРабочихУчастков = Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	Ячейки = Новый Массив();    
	
	Если МассивРабочихУчастков.Количество()>0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладскиеЯчейки.Ссылка КАК Ссылка,
		|	СкладскиеЯчейки.Наименование КАК Наименование,
		|	СкладскиеЯчейки.Штрихкод КАК Штрихкод
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|ГДЕ
		|	СкладскиеЯчейки.РабочийУчасток В (&Владелец)
		|	И НЕ СкладскиеЯчейки.ПометкаУдаления
		|	И СкладскиеЯчейки.Наименование <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование УБЫВ";
		
		Запрос.УстановитьПараметр("Владелец", МассивРабочихУчастков);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			СтруктураСтрока = Новый Структура();
			СтруктураСтрока.Вставить("ЯчейкаУИД",XMLСтрока(ВыборкаДетальныеЗаписи.Ссылка)); 
			СтруктураСтрока.Вставить("Ячейка",XMLСтрока(ВыборкаДетальныеЗаписи.Наименование));
			СтруктураСтрока.Вставить("Штрихкод",XMLСтрока(ВыборкаДетальныеЗаписи.Штрихкод)); 
			
			Ячейки.Добавить(СтруктураСтрока);
		КонецЦикла;
	КонецЕсли;
	
	СтруктураОтвета.Вставить("Ячейки", Ячейки);

	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;  
КонецФункции

Функция ДобавитьШтрихкод(ДанныеJSON)
	
	Отказ= Ложь; 
	СтруктураОтвета = Новый Структура; 
	СтруктураОтвета.Вставить("Ошибка", Ложь);
	СтруктураОтвета.Вставить("ТекстОшибки", ""); 
	//СтруктураОтвета.Вставить("Данные", Неопределено);
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда 
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ТекстОшибки = "Получена пустая структура";
		//Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		//Возврат Ответ;
	
	ИначеЕсли ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда 
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ТекстОшибки = "Не передан идентификатор клиента";
		//Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		//Возврат Ответ;
	
	Иначе
		ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
			
	    Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Номенклатура));

		СоздатьШК(ВходящиеДанные.Штрихкод,Номенклатура,,СтруктураОтвета);	
	КонецЕсли;		
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(СтруктураОтвета.Ошибка, СтруктураОтвета.ТекстОшибки);   
	
	Возврат Ответ;     
 
	
КонецФункции

Функция ПолучитьОстатокПоТовару(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	ШтрихкодНоменклатуры = ВходящиеДанные.Штрихкод;
	Склад = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника).Склад;
	
	СтруктураОтвета = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	|	ТочкиПересчетаОбучение.Наименование КАК ТочкаПересчета
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТочкиПересчетаОбучение КАК ТочкиПересчетаОбучение
	|			ПО ВидыНоменклатуры.ТочкаПересчетаОбучение = ТочкиПересчетаОбучение.Ссылка
	|		ПО ШтрихкодыНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.ТочкаПересчета КАК ТочкаПересчета,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ЕстьNull(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК ОстатокНаСкладе,
	|	&Склад КАК Склад
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Номенклатура.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		И ВТ_Номенклатура.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.ТочкаПересчета КАК ТочкаПересчета,
	|	ВТ.Упаковка КАК Упаковка,
	|	ВТ.ОстатокНаСкладе КАК ОстатокНаСкладе,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК
	|			РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ВТ.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|		И ВТ.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад";
	
	Запрос.УстановитьПараметр("Штрихкод", ШтрихкодНоменклатуры);
	Запрос.УстановитьПараметр("Склад", Склад);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураОтвета.Вставить("НоменклатураГУИД", XMLСтрока(Выборка.Номенклатура));
		СтруктураОтвета.Вставить("Номенклатура", XMLСтрока(Строка(Выборка.Номенклатура)));
		СтруктураОтвета.Вставить("Характеристика", XMLСтрока(Строка(Выборка.Характеристика)));
		СтруктураОтвета.Вставить("ТочкаПересчета", XMLСтрока(Строка(Выборка.ТочкаПересчета)));
		СтруктураОтвета.Вставить("ЕдиницаИзмерения", XMLСтрока(Строка(Выборка.Упаковка)));
		СтруктураОтвета.Вставить("ОстатокНаСкладе", XMLСтрока(Выборка.ОстатокНаСкладе));
		СтруктураОтвета.Вставить("Ячейка", XMLСтрока(Строка(Выборка.Ячейка)));
		СтруктураОтвета.Вставить("ЯчейкаГУИД", XMLСтрока(Выборка.Ячейка));
		СтруктураОтвета.Вставить("СкладГУИД", XMLСтрока(Склад));
		СтруктураОтвета.Вставить("РабочийУчастокГУИД", XMLСтрока(Выборка.Ячейка.РабочийУчасток));		
	КонецЕсли;	
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьДополнительнуюЯчейкуНоменклатуры(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.НоменклатураУИД));
	Склад = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника).Склад;
	
	ДопЯчейка = Неопределено;
	
	ОбъектОбработки = Обработки.ПроверкаАдресногоХранения.Создать();
	ДопЯчейка = ОбъектОбработки.ПолучитьЯчейкуНоменклатуры(Склад, Номенклатура, Ложь);
	
	СтруктураОтвета = Новый Структура;
		
	СтруктураОтвета.Вставить("ДопЯчейка", XMLСтрока(Строка(ДопЯчейка)));		

	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ЕстьОсновнаяЯчейка(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.НоменклатураУИД));
	Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.ЯчейкаУИД));
	Склад = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника).Склад;

	ЕстьОсновнаяЯчейкаУНоменклатуры = Ложь;
	
	ОбъектОбработки = Обработки.ПроверкаАдресногоХранения.Создать();
	ЕстьОсновнаяЯчейкаУНоменклатуры = ОбъектОбработки.ЕстьОсновнаяЯчейкаУНоменклатуры(Номенклатура, Склад, Ячейка);
	
	СтруктураОтвета = Новый Структура;
		
	СтруктураОтвета.Вставить("ЕстьОсновнаяЯчейкаУНоменклатуры", XMLСтрока(ЕстьОсновнаяЯчейкаУНоменклатуры));		

	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьНоменклатуруИзЯчейки(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.ЯчейкаУИД));
	Склад = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника).Склад;
	
	МассивНоменклатуры = Новый Массив();
	
	ОбъектОбработки = Обработки.ПроверкаАдресногоХранения.Создать();
	СписокНоменклатурыДляЗаполнения = ОбъектОбработки.ПолучитьНоменклатуруИзЯчейки(Склад, Ячейка, ТекущаяДата());

	Для Каждого СтрокаСписка Из СписокНоменклатурыДляЗаполнения Цикл
		МассивНоменклатуры.Добавить(Новый Структура("НоменклатураУИД,Номенклатура", XMLСтрока(
			СтрокаСписка.Номенклатура), XMLСтрока(Строка(СтрокаСписка.Номенклатура))));
	КонецЦикла;

	СтруктураОтвета = Новый Структура;

	СтруктураОтвета.Вставить("МассивНоменклатуры", МассивНоменклатуры);		

	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ЗаписатьРезультатПроверкиАХ(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.ЯчейкаУИД));
	Склад = Сотрудник.Склад;
	
	Если НЕ (ЗначениеЗаполнено(Сотрудник) И ЗначениеЗаполнено(Ячейка) И ЗначениеЗаполнено(Склад)) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не переданы критичные данные");
		Возврат Ответ;
	КонецЕсли;
	 
	 Если Сотрудник.Пустая() ИЛИ Ячейка.Пустая() ИЛИ Склад.Пустая() Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не переданы критичные данные");
		Возврат Ответ;
	 КонецЕсли;
	 	
	ОбъектОбработки = Обработки.ПроверкаАдресногоХранения.Создать();
	ОбъектОбработки.Склад = Склад;
	ОбъектОбработки.Ячейка = Ячейка;
	ОбъектОбработки.Сотрудник = Сотрудник;
	
	Для каждого Строка из ВходящиеДанные.Товары Цикл
	    Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.НоменклатураУИД));
		ИсходнаяЯчейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ИсходнаяЯчейкаУИД));
		ЦелеваяЯчейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ЦелеваяЯчейкаУИД));
		
		Если Номенклатура.Пустая() ИЛИ 	ЦелеваяЯчейка.Пустая() Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не переданы критичные данные");
		    Возврат Ответ;
		КонецЕсли;
		
		НоваяСтрока = ОбъектОбработки.Товары.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.ИсходнаяЯчейка = ИсходнаяЯчейка;
		НоваяСтрока.ЦелеваяЯчейка = ЦелеваяЯчейка;
		НоваяСтрока.НетЭтикетки = Булево(Строка.НетЭтикетки);
		НоваяСтрока.Проверено = Булево(Строка.Проверено);
		Если Не (Строка.Действие = "НетДействия" ИЛИ Строка.Действие = "")  Тогда
			НоваяСтрока.Действие = Перечисления.ДействияПриПроверкеАдресногоХранения[Строка(Строка.Действие)];
		КонецЕсли;
	КонецЦикла;
	
	ТекстСообщения = "";
	Результат = ОбъектОбработки.ЗаписатьРезультатыПроверкиАХ(ТекстСообщения,"");

	СтруктураОтвета = Новый Структура;

	СтруктураОтвета.Вставить("Результат", XMLСтрока(Результат));		
    СтруктураОтвета.Вставить("ТекстСообщения", XMLСтрока(ТекстСообщения));
    
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПроверитьМаркировку(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	    
    Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Номенклатура));
    Штрихкод = ВходящиеДанные.Штрихкод;
	Если ВходящиеДанные.Свойство("ТипОперации") и ВходящиеДанные.ТипОперации = "Приемка" Тогда
		Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.Приемка");
		ТекстДополнения = "
			|Товар будет добавлен без КМ!";

	Иначе
		Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтгрузкаПродажа");
		ТекстДополнения = "
			|Отложите товар!";
	КонецЕсли;	
    
    МассивКодовМаркировкиЧЗ = Новый Массив;
	МассивКодовМаркировкиЧЗ.Добавить(Штрихкод);
    МассивКодовМаркировкиЧЗ = МаркировкаАльтерра.ПодготовитьКодыМаркировкиДляПроверки(МассивКодовМаркировкиЧЗ);  	
     
    СтруктураКодаМаркировки = МаркировкаАльтерра.ПолучитьСтруктуруКодаМаркировки(Штрихкод);
    ВидПродукции = МаркировкаАльтерра.ОпределитьВидПродукции(Номенклатура,СтруктураКодаМаркировки.ВидыПродукции);
    
        РезультатПроверки = МаркировкаАльтерра.ПроверкаЧЗ(СтруктураКодаМаркировки.МассивКодовМаркировкиЧЗ,ВидПродукции,Операция);
    СообщениеОбОшибках = ?(ЗначениеЗаполнено(РезультатПроверки.СообщениеОбОшибках),РезультатПроверки.СообщениеОбОшибках + ТекстДополнения,""); 
						
	СтруктураОтвета = Новый Структура;

	СтруктураОтвета.Вставить("Результат", XMLСтрока(РезультатПроверки.КодВалидный));		
    СтруктураОтвета.Вставить("ТекстСообщения", XMLСтрока(СообщениеОбОшибках));
    
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьСписокТоваров(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Шаблон = ВходящиеДанные.Шаблон;
	Склад = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника).Склад;

	СтруктураОтвета = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	НоменклатураСпр.Ссылка КАК Ссылка,
	|	НоменклатураСпр.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИспользованиеХарактеристик,
	|	НоменклатураСпр.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
	|ИЗ
	|	Справочник.Номенклатура КАК НоменклатураСпр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = НоменклатураСпр.Ссылка
	|				И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
	|				И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	НЕ НоменклатураСпр.ПометкаУдаления
	|	И НоменклатураСпр.Наименование ПОДОБНО ""%"" + &Шаблон + ""%""";
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивТоваров = Новый Массив();
	Пока Выборка.Следующий() Цикл
		СтруктураТовара = Новый Структура;
		СтруктураТовара.Вставить("НоменклатураУИД", XMLСтрока(Выборка.Ссылка));
		СтруктураТовара.Вставить("Номенклатура", XMLСтрока(Строка(Выборка.Наименование)));
		СтруктураТовара.Вставить("ИспользованиеХарактеристик", XMLСтрока(Выборка.ИспользованиеХарактеристик));
		СтруктураТовара.Вставить("ЕдиницаИзмерения", XMLСтрока(Строка(Выборка.ЕдиницаИзмерения)));
		СтруктураТовара.Вставить("Склад", XMLСтрока(Строка(Склад)));
		СтруктураТовара.Вставить("СкладУИД", XMLСтрока(Склад));
		СтруктураТовара.Вставить("Ячейка", XMLСтрока(Строка(Выборка.Ячейка)));
		СтруктураТовара.Вставить("ЯчейкаУИД", XMLСтрока(Выборка.Ячейка));
		МассивТоваров.Добавить(СтруктураТовара);
	КонецЦикла;	
	
	СтруктураОтвета.Вставить("МассивТоваров",МассивТоваров);
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьСписокХарактеристик(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Владелец = Новый УникальныйИдентификатор(ВходящиеДанные.Владелец);
	
	СтруктураОтвета = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХарактеристикиНоменклатуры.Владелец) = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);

	Выборка = Запрос.Выполнить().Выбрать();
	МассивТоваров = Новый Массив();
	Если Выборка.Следующий() Тогда
		СтруктураТовара = Новый Структура;
		СтруктураТовара.Вставить("Характеристика", XMLСтрока(Выборка.Наименование));                   
		МассивТоваров.Добавить(СтруктураОтвета);
	КонецЕсли;	
	
	СтруктураОтвета.Вставить("МассивТоваров",МассивТоваров);
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции 

Функция ПолучитьСписокНекондиции(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
		
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	
	Если Сотрудник.Пустая() Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не найден сотрудник по коду");
		Возврат Ответ;
	КонецЕсли;
	
	Склад = Сотрудник.Склад;

	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Владелец = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Владелец));
	
	СтруктураОтвета = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыДругогоКачества.НоменклатураБрак КАК НоменклатураБрак,
	|	ТоварыДругогоКачества.ГрадацияКачества КАК ГрадацияКачества,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|	ТоварыДругогоКачества.НоменклатураБрак.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ТоварыДругогоКачества.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
	|ГДЕ
	|	ТоварыДругогоКачества.Номенклатура = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Склад", Склад); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивТоваров = Новый Массив();
	Если Выборка.Следующий() Тогда
		СтруктураТовара = Новый Структура;
		СтруктураТовара.Вставить("НоменклатураБрак", XMLСтрока(Строка(Выборка.НоменклатураБрак))); 
		СтруктураТовара.Вставить("НоменклатураБракГУИД", XMLСтрока(Выборка.НоменклатураБрак));   
		СтруктураТовара.Вставить("ЕдиницаИзмерения", XMLСтрока(Строка(Выборка.ЕдиницаИзмерения)));                   
		СтруктураТовара.Вставить("Ячейка", XMLСтрока(Строка(Выборка.Ячейка)));                   
		СтруктураТовара.Вставить("ЯчейкаУИД", XMLСтрока(Выборка.Ячейка));                   
		СтруктураТовара.Вставить("СкладУИД", XMLСтрока(Склад));                   
		СтруктураТовара.Вставить("ГрадацияКачества", XMLСтрока(Строка(Выборка.ГрадацияКачества)));                   
		МассивТоваров.Добавить(СтруктураТовара);
	КонецЕсли;	
	
	СтруктураОтвета.Вставить("МассивТоваров",МассивТоваров);
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьТоварПоШтрихкоду(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.КодСотрудника) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан код сотрудника");
		Возврат Ответ;
	КонецЕсли;

	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	
	Если Сотрудник.Пустая() Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не найден сотрудник по коду");
		Возврат Ответ;
	КонецЕсли;
	
	Склад = Сотрудник.Склад;

	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Штрихкод = ВходящиеДанные.Штрихкод;
	
	СтруктураОтвета = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (ШтрихкодыНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|				И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Склад", Склад); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураОтвета.Вставить("НоменклатураУИД", XMLСтрока(Выборка.Номенклатура));
		СтруктураОтвета.Вставить("Номенклатура", XMLСтрока(Строка(Выборка.НоменклатураНаименование)));
		СтруктураОтвета.Вставить("Характеристика", XMLСтрока(Строка(Выборка.Характеристика)));
		СтруктураОтвета.Вставить("ЕдиницаИзмерения", XMLСтрока(Строка(Выборка.ЕдиницаИзмерения)));
		СтруктураОтвета.Вставить("ЯчейкаУИД", XMLСтрока(Выборка.Ячейка));
		СтруктураОтвета.Вставить("Ячейка", XMLСтрока(Строка(Выборка.Ячейка)));
		СтруктураОтвета.Вставить("СкладУИД", XMLСтрока(Склад));
	КонецЦикла;	
		
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьТоварПоШтрихкодуМаркировки(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Штрихкод = ВходящиеДанные.Штрихкод;
	
	СтруктураКодаМаркировки = МаркировкаАльтерра.ПолучитьСтруктуруКодаМаркировки(Штрихкод);
	Штрихкод1 = СтруктураКодаМаркировки.СоставКодаМаркировки.EAN; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод1); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураНоменклатуры = Новый Структура("Номенклатура,Серия,Характеристика", Выборка.Номенклатура,Справочники.СерииНоменклатуры.ПустаяСсылка(),Выборка.Характеристика);
		СсылкаНаШтрихкодМаркировки = МаркировкаАльтерра.ПолучитьСсылкуНаШтрихкодМаркируемогоТовара(СтруктураКодаМаркировки,СтруктураНоменклатуры);
	КонецЕсли;
	
	 Если СсылкаНаШтрихкодМаркировки = Неопределено Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Номенклатура не найдена");
		Возврат Ответ;
    КонецЕсли;
    
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("НоменклатураУИД", XMLСтрока(Выборка.Номенклатура));
	СтруктураОтвета.Вставить("Характеристика", XMLСтрока(Строка(Выборка.Характеристика)));
	СтруктураОтвета.Вставить("ШКМаркировки", XMLСтрока(СтруктураКодаМаркировки.НормализованныйКодМаркировки));
		
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);  
	
	ШтрихкодМаркировки = СтрЗаменить(Штрихкод,
		МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1(), "");

	СтруктураКодаМаркировки1 = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ШтрихкодМаркировки, Неопределено,
		Неопределено, Неопределено, Неопределено);
	//НормализованныйКодМаркировки = СтруктураКодаМаркировки.НормализованныйКодМаркировки;

	//CcылкаНаШтрихкод = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(НормализованныйКодМаркировки);

	//Если CcылкаНаШтрихкод = Неопределено Тогда
	//	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Номенклатура не найдена");
	//	Возврат Ответ;
	//КонецЕсли;
	//
	//СтруктураОтвета = Новый Структура;
	//СтруктураОтвета.Вставить("НоменклатураУИД", XMLСтрока(CcылкаНаШтрихкод.Номенклатура));
	//СтруктураОтвета.Вставить("Характеристика", XMLСтрока(Строка(CcылкаНаШтрихкод.Характеристика)));
	//СтруктураОтвета.Вставить("ШКМаркировки", XMLСтрока(НормализованныйКодМаркировки));
		
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ЗагрузитьФайлВПапку(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	ИмяФайла = ВходящиеДанные.ИмяФайла; 
	Данные = Base64Значение(ВходящиеДанные.Данные);
	
	СтруктураОтвета = Новый Структура;
	
	НаименованиеСклада = Сотрудник.Склад.Наименование;
	
	Если НаименованиеСклада = "Центральный склад" Тогда
		ПапкаСклада = "СП ЦБ\";  		
	ИначеЕсли НаименованиеСклада = "Склад (Барнаул)" Тогда
		ПапкаСклада = "СП Барнаул\";
	ИначеЕсли НаименованиеСклада = "Склад (Выбор)" Тогда
		ПапкаСклада = "СП Выбор\";
	ИначеЕсли НаименованиеСклада = "Склад (Бийск)" Тогда	
		ПапкаСклада = "СП Бийск\"; 
	Иначе 
		ПапкаСклада	= "";
	КонецЕсли; 
	
	ИмяФайла = "\\TG-Storage01\Склад\Общие\Отдел качества\" + ПапкаСклада + "Фото брака\" + ИмяФайла + ".png";

	СтруктураОтвета.Вставить("Путь",ИмяФайла);
	ОшибкаЗаписи = Ложь;
    ТекстОшибки = "";
	
    Попытка 
        Данные.Записать(ИмяФайла);  
    Исключение 
		Ошибка = ИнформацияОбОшибке();
		ПодробнаяОшибка = ПодробноеПредставлениеОшибки(Ошибка);
		ТекстОшибки = ПодробнаяОшибка;
		ОшибкаЗаписи = Истина;
    КонецПопытки;
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(ОшибкаЗаписи,ТекстОшибки,СтруктураОтвета);   
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьНеопознанныйТовар(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	
	Если Сотрудник.Пустая() Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не найден сотрудник по коду");
		Возврат Ответ;
	КонецЕсли;
	
	Склад = Сотрудник.Склад;

	НеопознанныйТовар = Документы.ПриходныйОрдерНаТовары.ПолучитьНеопознанныйТовар(Склад, ВходящиеДанные.Номер);
		
	СтруктураОтвета = Новый Структура;
    СтруктураОтвета.Вставить("НоменклатураГУИД",XMLСтрока(НеопознанныйТовар));
    СтруктураОтвета.Вставить("Номенклатура",XMLСтрока(Строка(НеопознанныйТовар)));
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ДобавитьПрисоединенныйФайл(ДанныеJSON)
	
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	Данные = Base64Значение(ВходящиеДанные.Данные);
	
	ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.ОрдерУИД)); 
	ТипДокумента = ПолучитьИмяДокумента(ВходящиеДанные.Документ); 
	ТипСправочника = ТипДокумента+"ПрисоединенныеФайлы";
	Документ = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.ДокументУИД));
	Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Склад));
	Если ВходящиеДанные.Свойство("НоменклатураУИД") Тогда
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.НоменклатураУИД)); 
	Иначе	
		Номенклатура = "";
	КонецЕсли;
	
	Если ВходящиеДанные.Свойство("Отправитель") Тогда
		Отправитель = ВходящиеДанные.Отправитель;
	ИначеЕсли ЗначениеЗаполнено(ПриходныйОрдер) Тогда
		Отправитель = ПриходныйОрдер.Отправитель;
	Иначе
		Отправитель = "";
	КонецЕсли;
	Команда = ВходящиеДанные.Команда;
		
	
	//ИмяФайла = ВходящиеДанные.ИмяФайла; 
	Расширение = ВходящиеДанные.Расширение;
	
	//Команда = ВходящиеДанные.ИмяКоманды;
	ПапкаОрдера = "";  
	
		
	Если Команда = "ДобавитьСканДокумента" Тогда
		ИмяФайла = "Scan_" + СтрЗаменить(Строка(Склад), " ", "_") + "_" + СтрЗаменить(Строка(Отправитель), " ", "_") + "_" + СтрЗаменить(Строка(ТекущаяДата()), " ", "_"); 
	ИначеЕсли Команда = "ДобавитьФотоТовара" Тогда
		Наименование = СтрРазделить(Строка(Номенклатура), " ");
		ЭлементМассива = 0;
		НоваяСтрока = "";
		Пока ЭлементМассива < 4 Цикл
			НоваяСтрока = НоваяСтрока + Наименование[ЭлементМассива] + "_";
			ЭлементМассива = ЭлементМассива + 1;
		КонецЦикла;
		ИмяФайла = СтрЗаменить(Строка(Склад), " ", "_") + "_" + СтрЗаменить(Строка(Отправитель), " ", "_") + "_"
		+ СтрЗаменить(НоваяСтрока, ",", "")
		+ СтрЗаменить(Строка(ТекущаяДата()), " ", "_");
	ИначеЕсли Команда = "ДобавитьФотоТС" Тогда
		ИмяФайла  = "ФотоТС_" + СтрЗаменить(Строка(Склад), " ", "_") + "_" + СтрЗаменить(Строка(Отправитель), " ", "_") + "_" +  СтрЗаменить(Строка(ТекущаяДата()), " ", "_");
	Иначе
		ИмяФайла = "Неопознанный файл "+ СтрЗаменить(Строка(ТекущаяДата()), " ", "_");
	КонецЕсли;
	
	ОбработатьИмяФайла(ИмяФайла); 
	
	Если ЗначениеЗаполнено(ПриходныйОрдер) Тогда
		
		ИмяПапки =  СтрЗаменить(СтрЗаменить(Строка(ПриходныйОрдер), ":", "_"), " ", "_");
		
		Если Не ЗначениеЗаполнено(Справочники[ТипСправочника].НайтиПоНаименованию(ИмяПапки, Истина)) Тогда
			ГруппаОрдера = Справочники[ТипСправочника].СоздатьГруппу();
			ГруппаОрдера.ВладелецФайла = Документ;
			ГруппаОрдера.Наименование = ИмяПапки;
			ГруппаОрдера.Записать();
		КонецЕсли;  
		
		ПапкаОрдера = Справочники[ТипСправочника].НайтиПоНаименованию(ИмяПапки, Истина);		
	КонецЕсли;
	
	ОшибкаЗаписи = Ложь;
	ТекстОшибки = "";
	
	Попытка 
		
		АдресВХранилище = ПоместитьВоВременноеХранилище(Данные);
		ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыФайла.Автор = Сотрудник.Наименование;
		ПараметрыФайла.ВладелецФайлов = Документ;  
		
		Если ЗначениеЗаполнено(ПапкаОрдера) Тогда
			ПараметрыФайла.ГруппаФайлов = ПапкаОрдера;
		КонецЕсли;
		
		ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
		ПараметрыФайла.РасширениеБезТочки = Расширение;
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВХранилище);
		
	Исключение 
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		ЗаписьЖурналаРегистрации("МобильноеПриложениеСклада", УровеньЖурналаРегистрации.Ошибка, , ,ТекстОшибки);
		ОшибкаЗаписи = Истина;
		
	КонецПопытки;
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(ОшибкаЗаписи,ТекстОшибки,Новый Структура);   
	
	Возврат Ответ;
	
КонецФункции

Функция ПроверкаОбмена(ДанныеJSON)

    Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = ВходящиеДанные.ИдентификаторКлиента;   
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	
	СтруктураОтвета = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|   СтатусыДокументовОбменТСД.ДокументОрдер КАК Ордер
		|	СтатусыДокументовОбменТСД.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.СостоянияДокументовОбменМП КАК СтатусыДокументовОбменТСД
		|ГДЕ
		| СтатусыДокументовОбменТСД.Сотрудник = &Сотрудник
		| И СтатусыДокументовОбменТСД.ДокументОрдер.Дата >= &ТекущаяДата
		| И НЕ СтатусыДокументовОбменТСД.Обработано";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
    Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
    
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		СтруктураОтвета.Вставить("ЕстьОшибка",XMLСтрока(Истина));
		
	Иначе
		
		СтруктураОтвета.Вставить("ЕстьОшибка",XMLСтрока(Ложь));
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Если Выборка.Следующий() Тогда
		
		СтруктураОтвета.Вставить("ОрдерГУИД", XMLСтрока(Выборка.Ордер));
				
	КонецЕсли;	
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ПолучитьАктуальнуюВерсиюПриложения(ДанныеJSON)

    Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;

	Попытка
		АктуальнаяВерсия = ДопМодуль.ПолучитьНастройкиХранилища("НастройкиМобильногоПриложения").АктуальнаяВерсия; 
		СсылкаДляСкачиванияОбновления = ДопМодуль.ПолучитьНастройкиХранилища("НастройкиМобильногоПриложения").СсылкаДляСкачиванияОбновления;
	Исключение
		АктуальнаяВерсия = "0.01.03";
		СсылкаДляСкачиванияОбновления = "https://drive.usercontent.google.com/download?id=1tkhNhmf37eGIJ1wJP5gxmVjcizqNaLgb&export=download";
	КонецПопытки;
		
	СтруктураОтвета = Новый Структура;
    СтруктураОтвета.Вставить("АктуальнаяВерсия",АктуальнаяВерсия);
    СтруктураОтвета.Вставить("СсылкаДляСкачиванияОбновления",СсылкаДляСкачиванияОбновления);
	СтруктураОтвета.Вставить("ИмяУстановочногоФайла","com.alterra.testapp-arm");
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция ЗавершениеСессии(ДанныеJSON)

    Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = Новый УникальныйИдентификатор(ВходящиеДанные.ИдентификаторКлиента);   
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	
	Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(Перечисления.СобытияРаботыТСД.Выход,"Мобильное приложение",,Сотрудник,ИдентификаторКлиента);
	
	СтруктураОтвета = Новый Структура;
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь,,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

Функция СоздатьОграниченноГодный(ДанныеJSON)

    Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторКлиента = Новый УникальныйИдентификатор(ВходящиеДанные.ИдентификаторКлиента);   
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ВходящиеДанные.КодСотрудника);
	
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.НоменклатураУИД));  
	Склад = Неопределено;
	Если ВходящиеДанные.Свойство("Склад") Тогда
		Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные.Склад)); 
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	
	ТекстОшибки="";
	
	Попытка
	    Справочники.Номенклатура.СоздатьОграниченноГодныйТовар(Номенклатура, Склад);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("МобильноеПриложениеСклада", УровеньЖурналаРегистрации.Ошибка, , ,ТекстОшибки);
	КонецПопытки; 
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(?(ПустаяСтрока(ТекстОшибки),Ложь,Истина),ТекстОшибки,СтруктураОтвета);   
	
	Возврат Ответ;     
	
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыФункции 

Функция ПолучитьСтруктуруЗапускаФоновогоЗадания()
	
	СтруктураДанныхФЗ = Новый Структура();
	СтруктураДанныхФЗ.Вставить("ТипОбмена","");
	СтруктураДанныхФЗ.Вставить("Журнал","");
	СтруктураДанныхФЗ.Вставить("Секция","");
	СтруктураДанныхФЗ.Вставить("Накладная","");
	СтруктураДанныхФЗ.Вставить("ДатаВХ","");
	СтруктураДанныхФЗ.Вставить("НомерВХ","");
	СтруктураДанныхФЗ.Вставить("Отмена",""); 
	СтруктураДанныхФЗ.Вставить("Комментарий",""); 
	
	Возврат СтруктураДанныхФЗ;
	
КонецФункции

Функция СоздатьПриходныйОрдерНаТовары(ДанныеЗаполнения)

    ОбъектДок = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();	
	ОбъектДок.Заполнить(ДанныеЗаполнения); 
	//ОбъектДок.ЗаполнитьТоварыПоТоварамКПоступлению("НоменклатураКоличество",ТекущаяДата());
	ОбъектДок.ОбменДанными.Загрузка = Истина;
	ОбъектДок.Дата = ТекущаяДата();
	ОбъектДок.УстановитьНовыйНомер();
	ОбъектДок.Записать();

	Возврат ОбъектДок.Ссылка;

КонецФункции

Процедура ЗаписатьДанныеВРегистрСостояниеМаркировкиОбменМП(ДокументОрдер,ШтрихкодМаркировки,Сотрудник, Действие)
	
	//МенеджерЗаписи = РегистрыСведений.СостояниеМаркировкиОбменМП.СоздатьМенеджерЗаписи();
	//
	//МенеджерЗаписи.ДокументОрдер = ДокументОрдер;
	//МенеджерЗаписи.ШтрихкодМаркировки = ШтрихкодМаркировки;
	//МенеджерЗаписи.Сотрудник = Сотрудник;       
	//МенеджерЗаписи.Записать();
	Набор = РегистрыСведений.СостояниеМаркировкиОбменМП.СоздатьНаборЗаписей();
	Набор.Отбор.ДокументОрдер.Установить(ДокументОрдер);
	Набор.Отбор.ШтрихкодМаркировки.Установить(ШтрихкодМаркировки);
	Набор.Прочитать();
	Если Набор.Количество()>0 Тогда
		НаборЗапись = Набор[0];   
		НаборЗапись.Обработано = Не НаборЗапись.Обработано; 		
	Иначе
		НаборЗапись = Набор.Добавить();
		НаборЗапись.ДокументОрдер = ДокументОрдер;
		НаборЗапись.ШтрихкодМаркировки = ШтрихкодМаркировки;
		НаборЗапись.Обработано = Ложь;
	КонецЕсли;   
	
	НаборЗапись.Действие = Действие;
    НаборЗапись.Сотрудник = Сотрудник;
	Набор.Записать();

	
КонецПроцедуры

Процедура ЗаписатьДанныеВРегистрСостоянияТоваровОбменМП(ДокументОрдер,Номенклатура,Характеристика,Назначение,Факт,Сотрудник)
	
	МенеджерЗаписи = РегистрыСведений.СостоянияТоваровОбменМП.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.ДокументОрдер = ДокументОрдер;
	МенеджерЗаписи.Характеристика = Характеристика;
	МенеджерЗаписи.Назначение = Назначение;
	МенеджерЗаписи.Количество = Факт; 
	МенеджерЗаписи.Сотрудник = Сотрудник;       
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

Процедура ЗаписатьДанныеВРегистрСостоянияДокументовОбменМП(ДокументОрдер,Накладная,Статус,Склад,РабочийУчасток,ЯПХ,Сотрудник,ИдентификаторКлиента)
	
	МенеджерЗаписи = РегистрыСведений.СостоянияДокументовОбменМП.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ДокументНакладная = Накладная;  
	МенеджерЗаписи.ДокументОрдер = ДокументОрдер;  
	МенеджерЗаписи.Состояние = Перечисления.СостоянияДокументовТСД[Статус]; 
	МенеджерЗаписи.Склад = Склад;   
	МенеджерЗаписи.РабочийУчасток = РабочийУчасток;   
	МенеджерЗаписи.ЯПХ = ЯПХ;  
	МенеджерЗаписи.Сотрудник = Сотрудник;
	МенеджерЗаписи.ИДклиента = ИдентификаторКлиента;
	МенеджерЗаписи.Записать();		
	
КонецПроцедуры

Процедура СоздатьШК(Штрихкод,Номенклатура,Характеристика=Неопределено, СтруктураОтвета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК НоменклатураПредставление,
	|	ШтрихкодыНоменклатуры.Характеристика.Наименование КАК ХарактеристикаПредставление,
	|	ШтрихкодыНоменклатуры.Упаковка.Наименование КАК УпаковкаПредставление
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для номенклатуры %Номенклатура%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Номенклатура%", """" + Выборка.НоменклатураПредставление + """"
		+ ?(ЗначениеЗаполнено(Выборка.Характеристика), " " + НСтр("ru='с характеристикой'") + " """ + Выборка.ХарактеристикаПредставление + """", "")
		+ ?(ЗначениеЗаполнено(Выборка.Упаковка), " " + НСтр("ru='в упаковке'") + " """ + Выборка.УпаковкаПредставление + """", ""));
		
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = ОписаниеОшибки;
		//Сообщение.Сообщить();     
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ТекстОшибки = ОписаниеОшибки;
		
	Иначе
		МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Штрихкод = Штрихкод;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Характеристика = Характеристика;
		
		МенеджерЗаписи.Записать();
		
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = "Штрихкод записан!";
		//Сообщение.Сообщить();         
		СтруктураОтвета.Ошибка = Ложь;
		СтруктураОтвета.ТекстОшибки = "";
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПреобразоватьИзШестнадцатеричнойСистемыСчисленияВДесятичноеЧисло(Знач Значение)
	
	Значение = НРег(Значение);
	ДлинаСтроки = СтрДлина(Значение);
	
	Результат = 0;
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Результат = Результат * 16 + СтрНайти("0123456789abcdef", Сред(Значение, НомерСимвола, 1)) - 1;
	КонецЦикла;
	
	Возврат Формат(Результат, "ЧГ=0");
	
КонецФункции

Функция СоздатьОрдерПоНакладной(СтруктураДокумента) Экспорт
	
	РасходныйОрдер = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(РасходныйОрдер,СтруктураДокумента,"Накладная,Склад,РабочийУчасток,Статус");
	ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	РасходныйОрдер.Дата = ТекущаяДата(); 
	РасходныйОрдер.ДатаОтгрузки = ТекущаяДата();
	
	Если Не ЗначениеЗаполнено(РасходныйОрдер.Статус) Тогда
		РасходныйОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен;
	КонецЕсли; 
	
	РасходныйОрдер.Ответственный = ТекущийПользователь;
	РасходныйОрдер.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(РасходныйОрдер.Приоритет);
	РасходныйОрдер.Получатель = Документы.РасходныйОрдерНаТовары.ПолучательДляЗаполнения(РасходныйОрдер.Накладная); 
	РасходныйОрдер.Контролер = ТекущийПользователь;
	РасходныйОрдер.Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(ТекущийПользователь);
	РасходныйОрдер.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
	РасходныйОрдер.СкладскаяОперация = ПолучитьСкладскуюОперацию(РасходныйОрдер.Накладная);
	
	ТЧТовары = Документы.РасходныйОрдерНаТовары.ПолучитьТоварыДляЗаполнения(РасходныйОрдер.Накладная,РасходныйОрдер.РабочийУчасток,РасходныйОрдер.Склад);
	РасходныйОрдер.ТоварыПоРаспоряжениям.Загрузить(ТЧТовары);				
	
	РасходныйОрдер.ОтгружаемыеТовары.Загрузить(ТЧТовары); 
	РасходныйОрдер.ОтгружаемыеТовары.Свернуть("Действие,Номенклатура,Характеристика,Назначение,Серия,Упаковка","Количество,КоличествоУпаковок");
		
	Попытка
		РасходныйОрдер.Записать();    
	Исключение 
		ЗаписьЖурналаРегистрации("МобильноеПриложениеСклада", УровеньЖурналаРегистрации.Ошибка, , ,ОписаниеОшибки());
	КонецПопытки;   
	
	Возврат РасходныйОрдер.Ссылка;	
	
КонецФункции

Функция ПолучитьСкладскуюОперацию(Накладная) Экспорт 
	
	СкладскаяОперация = Перечисления.СкладскиеОперации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СкладыСервер.ТекстЗапросаСкладскаяОперацияТипДокумента()+ " 
	|ВЫБРАТЬ
	|	СкладскаяОперацияТипДокумента.СкладскаяОперация КАК СкладскаяОперация
	|ИЗ
	|	СкладскаяОперацияТипДокумента КАК СкладскаяОперацияТипДокумента
	|ГДЕ
	|	СкладскаяОперацияТипДокумента.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип",ТипЗнч(Накладная));
	
	Результат = Запрос.Выполнить().Выбрать();  
	Результат.Следующий();
	
	СкладскаяОперация = Результат.СкладскаяОперация;
	
	Возврат  СкладскаяОперация;
	
КонецФункции 

Функция ПолучитьХозяйственнуюОперацию(ХозяйственнаяОперацияИмя) Экспорт 
	
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПустаяСсылка();
	
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации[ХозяйственнаяОперацияИмя]; 
	
	Возврат  ХозяйственнаяОперация;
	
КонецФункции 

Функция ПолучитьИмяДокумента(ТипДокумента) 

	Если ТипДокумента = "Перемещение товаров" Тогда
		Возврат "ПеремещениеТоваров";
	ИначеЕсли ТипДокумента = "Реализация товаров и услуг" Тогда
		Возврат "РеализацияТоваровУслуг";
	ИначеЕсли ТипДокумента = "Чек ККМ" Тогда
		Возврат "ЧекККМ";
	ИначеЕсли ТипДокумента = "Сборка товаров" Тогда
		Возврат "СборкаТоваров";
	ИначеЕсли ТипДокумента = "Корректировка реализации" Тогда
		Возврат "КорректировкаРеализации";
	ИначеЕсли ТипДокумента = "Заказ поставщику" Тогда
		Возврат "ЗаказПоставщику";
	ИначеЕсли ТипДокумента = "Возврат товаров от клиента" Тогда
		Возврат "ВозвратТоваровОтКлиента";   
	ИначеЕсли ТипДокумента = "Чек ККМ на возврат" Тогда
		Возврат "ЧекККМВозврат";
	ИначеЕсли ТипДокумента = "Приобретение товаров и услуг" Тогда
		Возврат "ПриобретениеТоваровУслуг";
	ИначеЕсли ТипДокумента = "Акт о расхождениях после приемки" Тогда
		Возврат "АктОРасхожденияхПослеПриемки";
	Иначе
		Возврат "";
	КонецЕсли;
		
КонецФункции

Функция ПолучитьРасходныеОрдераПоНакладной(Документ,Секция)
	
	СтруктураВозврата = Новый Структура;

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияОтгрузкиНакладных.ОжидаетсяОтбор КАК ОжидаетсяОтбор,
	|	СостоянияОтгрузкиНакладных.Набирается КАК Набирается,
	|	СостоянияОтгрузкиНакладных.Набран КАК Набран,
	|	СостоянияОтгрузкиНакладных.Отгружен ИЛИ СостоянияОтгрузкиНакладных.ЧастичноОтгружен КАК Отгружен
	|ИЗ
	|	РегистрСведений.СостоянияОтгрузкиНакладных КАК СостоянияОтгрузкиНакладных
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СостоянияОтгрузкиНакладных.РабочийУчасток) = &РабочийУчасток
	|   И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СостоянияОтгрузкиНакладных.Документ) = &Накладная";
	
	Запрос.УстановитьПараметр("Накладная", Документ);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОжидаетсяОтбор = Ложь;
	Набирается = Ложь; 
	Набран = Ложь; 
	Отгружен = Ложь;
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ОжидаетсяОтбор = ВыборкаДетальныеЗаписи.ОжидаетсяОтбор;
		Набирается = ВыборкаДетальныеЗаписи.Набирается; 
		Набран = ВыборкаДетальныеЗаписи.Набран; 
		Отгружен = ВыборкаДетальныеЗаписи.Отгружен; 
	КонецЦикла;
	
	МассивОрдеров = Новый Массив();
	ПодготовленныеОрдера = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Проведен = ИСТИНА
		|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РасходныйОрдерНаТовары.Накладная) = &Накладная
		|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РасходныйОрдерНаТовары.РабочийУчасток) = &РабочийУчасток";
	
	Запрос.УстановитьПараметр("Накладная", Документ);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		 МассивОрдеров.Добавить(ВыборкаДетальныеЗаписи.Ссылка); 
		 Если ВыборкаДетальныеЗаписи.Ссылка.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен Тогда  
		 ПодготовленныеОрдера.Добавить(ВыборкаДетальныеЗаписи.Ссылка); 
		 КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата.Вставить("МассивОрдеров",МассивОрдеров); 
	СтруктураВозврата.Вставить("ПодготовленныеОрдера",ПодготовленныеОрдера);
	СтруктураВозврата.Вставить("ОжидаетсяОтбор",ОжидаетсяОтбор);
    СтруктураВозврата.Вставить("Набирается",Набирается);
    СтруктураВозврата.Вставить("Набран",Набран);
    СтруктураВозврата.Вставить("Отгружен",Отгружен);
 	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтатусДокументаПоРегистру(Документ,Секция) 
	
	СтруктураОтвета = Новый Структура("Статус,Сотрудник,Ордер",);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|   СтатусыДокументовОбменТСД.ДокументОрдер КАК Ордер,
		|	СтатусыДокументовОбменТСД.Состояние КАК Статус,
		|	СтатусыДокументовОбменТСД.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.СостоянияДокументовОбменМП КАК СтатусыДокументовОбменТСД
		|ГДЕ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СтатусыДокументовОбменТСД.ДокументНакладная) = &Документ
		|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СтатусыДокументовОбменТСД.РабочийУчасток) = &РабочийУчасток";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	     ЗаполнитьЗначенияСвойств(СтруктураОтвета,ВыборкаДетальныеЗаписи);	
	КонецЦикла;

	Возврат СтруктураОтвета;
	
КонецФункции

Функция СоздатьРасходныйОрдерНаТовары(Документ,Секция,Сотрудник)   
	
	ОбъектДок = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();      
	ОбъектДок.ОбменДанными.Загрузка = Истина;   
	ОбъектДок.Дата = ТекущаяДата();
	ОбъектДок.УстановитьНовыйНомер();  
	ОбъектДок.Проведен = Ложь;
	
	ОбъектДок.ДатаОтгрузки = ТекущаяДата(); 
	ОбъектДок.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен;		
	ОбъектДок.Ответственный = Пользователи.ТекущийПользователь(); 
	ОбъектДок.Сотрудник = Сотрудник; 
	ОбъектДок.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию();
	ОбъектДок.Склад = Секция.Владелец;
	ОбъектДок.Получатель = Документы.РасходныйОрдерНаТовары.ПолучательДляЗаполнения(Документ); 
	ОбъектДок.РабочийУчасток = Секция;
	ОбъектДок.Накладная = Документ;
	ОбъектДок.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
	ОбъектДок.СкладскаяОперация = ПолучитьСкладскуюОперацию(Документ);
	
	ТЧТовары = Документы.РасходныйОрдерНаТовары.ПолучитьТоварыДляЗаполнения(Документ,Секция,Секция.Владелец);
	ОбъектДок.ТоварыПоРаспоряжениям.Загрузить(ТЧТовары);				
	
	ОбъектДок.ОтгружаемыеТовары.Загрузить(ТЧТовары); 
	ОбъектДок.ОтгружаемыеТовары.Свернуть("Действие,Номенклатура,Характеристика,Назначение,Серия,Упаковка","Количество,КоличествоУпаковок");
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектДок,Истина);
	
	Возврат ОбъектДок.Ссылка;
	
КонецФункции

Функция ПолучитьМассивГруппЯПХ(МассивСекций)
	
	МассивГрупп = Новый Массив();
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РабочиеУчастки.ГруппаСкладскихЯчеекХраненияПриОтгрузке КАК Группа
		|ИЗ
		|	Справочник.РабочиеУчастки КАК РабочиеУчастки
		|ГДЕ
		|	РабочиеУчастки.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСекций);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивГрупп.Добавить(ВыборкаДетальныеЗаписи.Группа);
	КонецЦикла;
	
	Возврат МассивГрупп;
		
КонецФункции

Функция ПоРаспоряжениюИСекцииЕстьОрдера(Распоряжение, Секция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Проведен = ИСТИНА
		|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПриходныйОрдерНаТовары.Распоряжение) = &Распоряжение
		|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПриходныйОрдерНаТовары.РабочийУчасток) = &РабочийУчасток";
	
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

Процедура ОбработатьИмяФайла(Имя)	
	
	ЗапрещенныеСимволы = "/\[]:;|=?*<>" + Символ(34);
	Для Сч=1 По СтрДлина(Имя) Цикл
		Символ = Сред(Имя, Сч, 1);
		Если СтрНайти(ЗапрещенныеСимволы, Символ) Тогда 
			Имя = СтрЗаменить(Имя,Символ,"");
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
