#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция получения коэффициента пересчета валюты документа в валюту регл. учета.
//
// Параметры:
//	ДанныеПечати - ВыборкаИзРезультатаЗапроса - Данные шапки документа
//	ВалютаРегламентированногоУчета - СпрвочникСсылка.Валюты - Валюта регл. учета
//
// Возвращаемое значение:
//	Число - Коэффициент пересчета
//
Функция КоэффициентПересчетаВалюты(ДанныеПечати, ТаблицаКурсовВалют, ВалютаРегламентированногоУчета)
	
	КоэффициентПересчета = 1;
	Если ДанныеПечати.Валюта <> ВалютаРегламентированногоУчета Тогда
		
		СтруктураПоиска = Новый Структура("Валюта, Дата", ДанныеПечати.Валюта, НачалоДня(ДанныеПечати.Дата));
		Массив = ТаблицаКурсовВалют.НайтиСтроки(СтруктураПоиска);
		Если Массив.Количество() > 0 Тогда
			КоэффициентПересчета = ?(Массив[0].Кратность <> 0, Массив[0].Курс / Массив[0].Кратность, 1);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КоэффициентПересчета;
	
КонецФункции

// Функция формирования структуры хранения итоговых суммы.
//
// Возвращаемое значение:
//	Структура - Структура хранения итоговых сумм
//
Функция СтруктураИтоговыеСуммы()
	
	Структура = Новый Структура;
	
	СтруктураРесурсовДляИтогов = СтруктураРесурсовДляИтогов();
	
	Для Каждого Элемент Из СтруктураРесурсовДляИтогов Цикл
		Структура.Вставить("Итого"+Элемент.Ключ+"НаСтранице", 0);
		Структура.Вставить("Итого"+Элемент.Ключ, 0);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Функция формирования структуры хранения данных строки.
//
// Параметры:
//	КоэффициентПересчета - Число - Коэффициент пересчета в валюту регл. учета
//
// Возвращаемое значение:
//	Структура - Структура данных строки товаров
//
Функция СтруктураДанныеСтроки(КоэффициентПересчета)
	
	Структура = Новый Структура;
	Структура.Вставить("Номер", 0);
	Структура.Вставить("Мест", 0);
	Структура.Вставить("Количество", 0);
	Структура.Вставить("Цена", 0);
	Структура.Вставить("СуммаБезНДС", 0);
	Структура.Вставить("СуммаНДС", 0);
	Структура.Вставить("СуммаСНДС", 0);
	Структура.Вставить("КоэффициентПересчета", КоэффициентПересчета);
	Структура.Вставить("МассаБрутто", 0);
	Структура.Вставить("МассаНетто", 0);
	
	Возврат Структура;
	
КонецФункции

// Процедура обнуления итоговых сумм по странице
Процедура ОбнулитьИтогиПоСтранице(ИтоговыеСуммы)
	
	СтруктураРесурсовДляИтогов = СтруктураРесурсовДляИтогов();
	
	Для Каждого Элемент Из СтруктураРесурсовДляИтогов Цикл
		ИтоговыеСуммы.Вставить("Итого"+Элемент.Ключ+"НаСтранице", 0);
	КонецЦикла;
	
КонецПроцедуры

// Процедура рассчитывает итоговые суммы с учетом строки товаров.
//
// Параметры:
//	ИтоговыеСуммы - Структура - Структура итоговых сумм документа
//	ДанныеСтроки - Структура - Структура данных строки товаров
//
Процедура РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары)
	
	СтруктураСуммПоСтроке = СтруктураРесурсовДляИтогов();
	
	ЗаполнитьЗначенияСвойств(СтруктураСуммПоСтроке, СтрокаТовары);
	
	Для Каждого Элемент Из СтруктураСуммПоСтроке Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] = ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] + Элемент.Значение;
			ИтоговыеСуммы["Итого"+Элемент.Ключ] = ИтоговыеСуммы["Итого"+Элемент.Ключ] + Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура формирует итоговые данные для вывода в подвал
Процедура ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, ВсегоНомеров, ВалютаРегламентированногоУчета)
	
	ИтоговыеСуммы.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ЧислоПрописью(ВсегоНомеров, ,",,,,,,,,0"));
	ИтоговыеСуммы.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтоговыеСуммы.ИтогоСуммаСНДС, ВалютаРегламентированногоУчета));
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьМакета, КорректировочныйСчетФактура = Ложь)
	
	ОбластьМакета.Параметры.Заполнить(СтрокаТовары);
	
	ОбластьМакета.Параметры.ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
	СтрокаТовары.НоменклатураНаименование,
	СтрокаТовары.ХарактеристикаНаименование,
	,
	,
	,
	СтрокаТовары.ЭтоВозвратнаяТара);
	
КонецПроцедуры

Функция РазложитьМассивПоТипамОбъектов(МассивОбъектов)
	СтруктураТипов 	= Новый Структура;
	
	Для Каждого Объект Из МассивОбъектов Цикл
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Если НЕ СтруктураТипов.Свойство("ПеремещениеТоваров") Тогда
				ПеремещениеТоваров 	= Новый Массив;
				СтруктураТипов.Вставить("ПеремещениеТоваров", ПеремещениеТоваров);
			КонецЕсли;
			СтруктураТипов.ПеремещениеТоваров.Добавить(Объект);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураТипов
	
КонецФункции

Процедура РазобратьФИО(Знач ФИО, Фамилия, Имя, Отчество)
	ФИО 		= СокрЛП(ФИО);
	Фамилия		= "";
	Имя 		= "";
	Отчество 	= "";
	ПозПроб = Найти(ФИО," ");
	Если ПозПроб>0 Тогда
		Фамилия = Сред(ФИО,1,ПозПроб-1);
		ИмяОтч = Сред(ФИО,ПозПроб+1);
		ПозПроб = Найти(ИмяОтч," ");
		Если ПозПроб>0 Тогда
			Имя 		= Сред(ИмяОтч,1,ПозПроб-1);
			Отчество 	= Сред(ИмяОтч,ПозПроб+1);
		Иначе
			Имя = ИмяОтч;		
		КонецЕсли;
	Иначе
		Фамилия = ФИО;
	КонецЕсли;	
КонецПроцедуры	

Функция ТаблицаКурсовВалют(ТаблицаВалют)
	
	ТаблицаКурсовВалют = Новый ТаблицаЗначений;
	ТаблицаКурсовВалют.Колонки.Добавить("Валюта",    Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаКурсовВалют.Колонки.Добавить("Дата",      Новый ОписаниеТипов("Дата"));
	ТаблицаКурсовВалют.Колонки.Добавить("Курс",      Новый ОписаниеТипов("Число"));
	ТаблицаКурсовВалют.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число"));
	
	Для Каждого ДанныеВалюты Из ТаблицаВалют Цикл
		
		НоваяСтрока = ТаблицаКурсовВалют.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеВалюты, , "Дата");
		НоваяСтрока.Дата = НачалоДня(ДанныеВалюты.Дата);
		
		КурсыВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеВалюты.Валюта, НачалоДня(ДанныеВалюты.Дата));
		НоваяСтрока.Курс = КурсыВалюты.Курс;
		НоваяСтрока.Кратность = КурсыВалюты.Кратность;
		
	КонецЦикла;
	
	Возврат ТаблицаКурсовВалют;
	
КонецФункции

Процедура ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ВключаяНомераГТД, ПересчитыватьВВалютуРегл = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ПересчитыватьВВалютуРегл",       ПересчитыватьВВалютуРегл);
	Запрос.УстановитьПараметр("ВключаяНомераГТД",               ВключаяНомераГТД);
	
	Если ПересчитыватьВВалютуРегл Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ТаблицаДанныхДокументов КАК ДанныеДокументов
		|	ПО
		|		РасчетыСКлиентами.Регистратор = ДанныеДокументов.Ссылка
		|
		|ГДЕ
		|	ДанныеДокументов.Валюта <> &ВалютаРегламентированногоУчета
		|	И РасчетыСКлиентами.Активность
		|";
		ТаблицаАналитик = Запрос.Выполнить().Выгрузить();
		МассивАналитикУчетаПоПартнерам = ТаблицаАналитик.ВыгрузитьКолонку("АналитикаУчетаПоПартнерам");
		
		ВзаиморасчетыСервер.ВыполнитьПроведениеДокументовПоРасчетамСКлиентами(МассивАналитикУчетаПоПартнерам);
		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаТоваров.Ссылка КАК Ссылка,
	               |	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	               |	ТаблицаТоваров.Характеристика КАК Характеристика,
	               |	ТаблицаТоваров.Упаковка КАК Упаковка,
	               |	ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	               |	ТаблицаТоваров.Распределять
	               |ПОМЕСТИТЬ СтрокиТоваров
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	               |		ПО ТаблицаТоваров.Ссылка = ДанныеДокументов.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаТоваров.Ссылка,
	               |	ТаблицаТоваров.Номенклатура,
	               |	ТаблицаТоваров.АналитикаУчетаНоменклатуры,
	               |	ТаблицаТоваров.Характеристика,
	               |	ТаблицаТоваров.Упаковка,
	               |	ТаблицаТоваров.Распределять
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ТаблицаТоваров.Ссылка,
	               |	ТаблицаТоваров.Номенклатура,
	               |	ТаблицаТоваров.Характеристика,
	               |	ТаблицаТоваров.Упаковка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Ссылка КАК Ссылка,
	               |	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаДокумента.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	               |	ТаблицаДокумента.Характеристика КАК Характеристика,
	               |	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	               |	ТаблицаДокумента.Количество КАК Количество,
	               |	ТаблицаДокумента.Количество КАК КоличествоУпаковок,
	               |	ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаБезНДСРегл, ТаблицаДокумента.СуммаСНДС - ТаблицаДокумента.СуммаНДС) КАК СуммаБезНДС,
	               |	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	               |	ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаНДСРегл, ТаблицаДокумента.СуммаНДС) КАК СуммаНДС,
	               |	ЛОЖЬ КАК ЭтоТовар,
	               |	ЛОЖЬ КАК ЭтоНеВозвратнаяТара,
	               |	ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) КАК Упаковка,
	               |	ТаблицаДокумента.Распределять
	               |ПОМЕСТИТЬ ТаблицаТоваров
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	               |		ПО ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютахУчета
	               |		ПО ТаблицаДокумента.Ссылка = СуммыДокументовВВалютахУчета.Регистратор
	               |			И ТаблицаДокумента.ИдентификаторСтроки = СуммыДокументовВВалютахУчета.ИдентификаторСтроки
	               |			И (СуммыДокументовВВалютахУчета.Активность)
	               |			И (&ПересчитыватьВВалютуРегл)
	               |ГДЕ
	               |	ТаблицаДокумента.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Ссылка,
	               |	СтрокиТоваров.НомерСтроки,
	               |	ТаблицаДокумента.АналитикаУчетаНоменклатуры,
	               |	ТаблицаДокумента.АналитикаУчетаНоменклатуры.Номенклатура,
	               |	ТаблицаДокумента.АналитикаУчетаНоменклатуры.Характеристика,
	               |	ВЫБОР
	               |		КОГДА &ВключаяНомераГТД
	               |			ТОГДА ТаблицаДокумента.НомерГТД
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ,
	               |	СУММА(ТаблицаДокумента.Количество),
	               |	СУММА(ТаблицаДокумента.КоличествоУпаковок),
	               |	СУММА(ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаБезНДСРегл, ТаблицаДокумента.СуммаСНДС - ТаблицаДокумента.СуммаНДС)),
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	СУММА(ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаНДСРегл, ТаблицаДокумента.СуммаНДС)),
	               |	ИСТИНА,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	               |				И ТаблицаДокумента.Ссылка.ВернутьМногооборотнуюТару
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.Упаковка,
	               |	СтрокиТоваров.Распределять
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	               |		ПО ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютахУчета
	               |		ПО ТаблицаДокумента.Ссылка = СуммыДокументовВВалютахУчета.Регистратор
	               |			И ТаблицаДокумента.ИдентификаторСтроки = СуммыДокументовВВалютахУчета.ИдентификаторСтроки
	               |			И (СуммыДокументовВВалютахУчета.Активность)
	               |			И (&ПересчитыватьВВалютуРегл)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СтрокиТоваров КАК СтрокиТоваров
	               |		ПО ТаблицаДокумента.Ссылка = СтрокиТоваров.Ссылка
	               |			И ТаблицаДокумента.АналитикаУчетаНоменклатуры = СтрокиТоваров.АналитикаУчетаНоменклатуры
	               |			И ТаблицаДокумента.Упаковка = СтрокиТоваров.Упаковка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаДокумента.Ссылка,
	               |	СтрокиТоваров.НомерСтроки,
	               |	ТаблицаДокумента.АналитикаУчетаНоменклатуры,
	               |	ТаблицаДокумента.АналитикаУчетаНоменклатуры.Номенклатура,
	               |	ТаблицаДокумента.АналитикаУчетаНоменклатуры.Характеристика,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Упаковка,
	               |	ВЫБОР
	               |		КОГДА &ВключаяНомераГТД
	               |			ТОГДА ТаблицаДокумента.НомерГТД
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	               |				И ТаблицаДокумента.Ссылка.ВернутьМногооборотнуюТару
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ,
	               |	СтрокиТоваров.Распределять
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СтрокиТоваров";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПараметрыМассыПрописью(Масса, КоэффициентПересчетаВТонны)
	
	МассаТонны = Масса * КоэффициентПересчетаВТонны;
	Если МассаТонны > 1 Тогда
		Коэффициент = 1;
		СтрокаФормат = "т, т, т, ж, кг, кг, кг, м, " + ?(Окр(МассаТонны) = МассаТонны, "0", "3");
	ИначеЕсли МассаТонны * 1000 > 1 Тогда
		Коэффициент = 1000;
		СтрокаФормат = "кг, кг, кг, м, г, г, г, м, " + ?(Окр(МассаТонны * Коэффициент) = МассаТонны * Коэффициент, "0", "3");
	Иначе
		Коэффициент = 1000000;
		СтрокаФормат = "г, г, г, м, г, г, г, м, 0";
	КонецЕсли;
	
	Возврат Новый Структура("Формат, Коэффициент", СтрокаФормат, Коэффициент*КоэффициентПересчетаВТонны);
	
КонецФункции

Функция СтруктураРесурсовДляИтогов()
	
	Структура = Новый Структура;
	
	Структура.Вставить("СуммаБезНДС",       0);
	Структура.Вставить("СуммаНДС",          0);
	Структура.Вставить("СуммаСНДС",         0);
	Структура.Вставить("Количество",        0);
	Структура.Вставить("КоличествоМест",    0);
	Структура.Вставить("КоличествоПринято", 0);
	Структура.Вставить("МассаБрутто",       0);
	Структура.Вставить("МассаНетто",        0);
	
	Структура.Вставить("РазницаБезНДСУвеличение", 0);
	Структура.Вставить("РазницаБезНДСУменьшение", 0);
	Структура.Вставить("РазницаНДСУвеличение",    0);
	Структура.Вставить("РазницаНДСУменьшение",    0);
	Структура.Вставить("РазницаСНДСУвеличение",   0);
	Структура.Вставить("РазницаСНДСУменьшение",   0);
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьСтруктуруСтроки()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВидУпаковки");
	СтруктураДанных.Вставить("ЕдиницаИзмерения");
	СтруктураДанных.Вставить("ЕдиницаИзмеренияКод");
	СтруктураДанных.Вставить("ЕдиницаИзмеренияНаименование");
	СтруктураДанных.Вставить("Количество");
	СтруктураДанных.Вставить("КоличествоВОдномМесте");
	СтруктураДанных.Вставить("КоличествоМест");
	СтруктураДанных.Вставить("МассаБрутто");
	СтруктураДанных.Вставить("МассаНетто");
	СтруктураДанных.Вставить("Номенклатура");
	СтруктураДанных.Вставить("НоменклатураКод");
	СтруктураДанных.Вставить("НомерГТД");
	СтруктураДанных.Вставить("НомерСтроки");
	СтруктураДанных.Вставить("СтавкаНДС");
	СтруктураДанных.Вставить("СтранаПроисхождения");
	СтруктураДанных.Вставить("Упаковка");
	СтруктураДанных.Вставить("УпаковкаНаименование");
	СтруктураДанных.Вставить("Характеристика");
	СтруктураДанных.Вставить("СуммаСНДС");
	СтруктураДанных.Вставить("СуммаНДС");
	СтруктураДанных.Вставить("СуммаБезНДС");
	СтруктураДанных.Вставить("Цена");
	СтруктураДанных.Вставить("НоменклатураНаименование");
	СтруктураДанных.Вставить("ХарактеристикаНаименование");
	СтруктураДанных.Вставить("ЭтоВозвратнаяТара");
	
	
	возврат СтруктураДанных;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	если ТИПЗНЧ(МассивОбъектов)<>ТИП("СправочникСсылка.КартыЛояльности") тогда
		СтруктураТипов = РазложитьМассивПоТипамОбъектов(МассивОбъектов);
	конецесли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М15") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М15", "М-15 (Накладная)", СформироватьПечатнуюФормуМ15(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетКлиента") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетКлиента", "Счет клиента", СформироватьПечатнуюФормуСчетаКлиента(МассивОбъектов, ОбъектыПечати,ПараметрыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаПеремещение") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НакладнаяНаПеремещение", "Накладная на перемещение ", СформироватьПечатнуюФормуНакладнаяНаПеремещение(МассивОбъектов, ОбъектыПечати,ПараметрыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Спецификация") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Спецификация", "Спецификация", СформироватьПечатнуюФормуСпецификации(МассивОбъектов, ОбъектыПечати,ПараметрыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьЗаявкаНаСборку") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьЗаявкаНаСборку", "Печать заявки на сборку", СформироватьПечатнуюФормуЗаявкаНаСборку(МассивОбъектов, ОбъектыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьТНСекцииРеализация") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьТНСекцииРеализация", "Печать по секциям", СформироватьПечатнуюФормуПечатьТНСекцииРеализация(МассивОбъектов, ОбъектыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьТНСекцииРеализацияНов") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьТНСекцииРеализацияНов", "Печать по секциям", СформироватьПечатнуюФормуПечатьТНСекцииРеализацияНов(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьТоварногоЧека") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьТоварногоЧека", "Печать товарного чека"+?(ПараметрыПечати["ВыводитьСкидки"],""," без скидки"), СформироватьПечатнуюФормуТоварногоЧека(МассивОбъектов, ОбъектыПечати,ПараметрыПечати));
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПересортицыТоваров") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПересортицыТоваров",
		"Акт о пересортице товаров",
		ПечатьАктаПересортицыТоваров(МассивОбъектов, ОбъектыПечати));
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВнутреннееПотреблениеТоваровСумма") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВнутреннееПотреблениеТоваровСумма",
		"Внутреннее потребление товаров (сумма)",
		ПечатьВнутреннееПотреблениеТоваровСумма(МассивОбъектов, ОбъектыПечати)
		);
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемаПередачиНаХранение") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"АктПриемаПередачиНаХранение",
		"Акт приема-передачи материальных ценностей",
		ПечатьАктаПриемаПередачи(МассивОбъектов, ОбъектыПечати)
		);
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОВозвратеТМЦ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"АктОВозвратеТМЦ",
		"Акт о возврате ТМЦ на хранение",
		ПечатьАктаОВозвратеТМЦ(МассивОбъектов, ОбъектыПечати)
		);
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоставкаТовара") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ДоставкаТовара",
		"Печать доставки товаров",
		ПечатьДоставкаТоваров(МассивОбъектов, ОбъектыПечати)
		);
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛистСогласования") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЛистСогласования",
		"Печать листа согласования",
		ПечатьЛистаСогласования(МассивОбъектов, ОбъектыПечати)
		);
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АнкетаКарты") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АнкетаКарты", "Анкета карты",
		ПечатьАнкеты(МассивОбъектов, ОбъектыПечати,ПараметрыПечати));
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаВыдачуДенег") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЗаявлениеНаВыдачуДенег",
		"Печать заявление на выдачу денег",
		ПечатьЗаявленияНаВыдачуДС(МассивОбъектов, ОбъектыПечати)
		);
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", "Реализация товаров", СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати));
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт оприходования") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акт оприходования", "Акт оприходования", ПечатьАктаОприходования(МассивОбъектов,ОбъектыПечати));
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаВозврат") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаявлениеНаВозврат", "Печать заявления на возврат", ПечатьЗаявленияНаВозврат(МассивОбъектов,ОбъектыПечати));
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаВозвратЮрЛицо") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаявлениеНаВозвратЮрЛицо", "Печать заявления на возврат юр. лицо", ПечатьЗаявленияНаВозвратЮрЛицо(МассивОбъектов,ОбъектыПечати));
		
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ12") Тогда
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ12", "ТОРГ-12 (Товарная накладная" + ?(ПараметрыПечати["ВыводитьУслуги"], "", " без услуг") + ")", СформироватьПечатнуюФормуТОРГ12СУслугами(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СборкаТоваров") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СборкаТоваров", "Сборка товаров (сумма)", ПечатьСборкаТоваров(МассивОбъектов, ОбъектыПечати));
	иначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВозвратПоставщику") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВозвратПоставщику", "Возврат поставщику", СформироватьПечатнуюФормуВозвратПоставщику(МассивОбъектов, ОбъектыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СлужебнаяЗапискаЗаявкаНаСборку") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СлужебнаяЗапискаЗаявкаНаСборку", "Служебная записка заявки на сборку", СформироватьСлужебнаяЗапискаЗаявкаНаСборку(МассивОбъектов, ОбъектыПечати));
	иначеесли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МаршрутныйЛист") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МаршрутныйЛист", "Маршрутный лист", СформироватьМаршрутныйЛист(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ3") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ3", "Инветаризационная опись", СформироватьПечатнуюФормуИНВ3(МассивОбъектов[0], ОбъектыПечати,ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БюджетнаяЗаявка") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БюджетнаяЗаявка", "Бюджетная заявка", ПечатьБюджетнаяЗаявка(МассивОбъектов,ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АнализНаценки") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АнализНаценки", "Анализ наценки", ПечатьАнализаНаценки(МассивОбъектов,ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйКорректировочныйДокумент") Тогда 	
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УниверсальныйКорректировочныйДокумент", "Универсальный корректировочный документ (УКД)", СформироватьПечатнуюФормуУКД(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КорректировкаРеализации") Тогда 	
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КорректировкаРеализации", "Корректировка реализации", СформироватьПечатнуюФормуКорректировкаРеализации(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьНарядЗаказНаДоставку") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьНарядЗаказНаДоставку", "Наряд-заказ на доставку", СформироватьПечатнуюФормуНарядЗаказНаДоставку(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаданиеНаОтбор") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаданиеНаОтбор", "Задание На Отбор", СформироватьПечатнуюФормуЗаданиеНаОтбор(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаданиеНаРазмещение") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаданиеНаРазмещение", "Задание на размещение", СформироватьПечатнуюФормуЗаданиеНаРазмещение(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ19") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ19", "Сличительная ведомость", СформироватьПечатнуюФормуИНВ19(МассивОбъектов[0], ОбъектыПечати,ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "MXL_АнкетаПостоянногоПокупателя") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "MXL_АнкетаПостоянногоПокупателя", "Анкета постоянного покупателя",
		ПечатьАнкетыПостоянногоПокупателя(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "MXL_АнкетаКрупнойПокупки") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "MXL_АнкетаКрупнойПокупки", "Анкета крупной покупки",
		ПечатьАнкетыКрупнойПокупки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорКуплиПродажи") Тогда 	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорКуплиПродажи", "Договор купли-продажи",
		СформироватьДоговорКуплиПродажи(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациями.Ссылка КАК Ссылка,
	|	ПередачаТоваровМеждуОрганизациями.Номер КАК Номер,
	|	ПередачаТоваровМеждуОрганизациями.Дата КАК Дата,
	|	ПередачаТоваровМеждуОрганизациями.Партнер КАК Партнер,
	|	ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель КАК Получатель,
	|	ПередачаТоваровМеждуОрганизациями.Организация КАК Организация,
	|	ПередачаТоваровМеждуОрганизациями.Организация.Префикс КАК Префикс,
	|	ПередачаТоваровМеждуОрганизациями.Валюта КАК Валюта,
	|	ПередачаТоваровМеждуОрганизациями.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациями.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ ПередачаТоваровМеждуОрганизациями.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	ПередачаТоваровМеждуОрганизациями.Склад.ТекущийОтветственный.Наименование КАК ОтпускПроизвел
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациями.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК ТоварНаименованиеПолное,
	|	ВложенныйЗапрос.Номенклатура.Код КАК Код,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Наименование КАК ЕдиницаЦены,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Упаковка.Коэффициент, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.СуммаСкидки КАК СуммаСкидки,
	|	ВложенныйЗапрос.СуммаБезСкидки КАК СуммаБезСкидки,
	|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	|	ВложенныйЗапрос.Ячейка,
	|	ВложенныйЗапрос.ЯчейкаРабочийУчасток КАК Секция
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка КАК Ссылка,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура КАК Номенклатура,
	|		ВЫБОР
	|			КОГДА ПередачаТоваровМеждуОрганизациямиТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ ПередачаТоваровМеждуОрганизациямиТовары.Упаковка.Коэффициент
	|		КОНЕЦ КАК Коэффициент,
	|		ВЫБОР
	|			КОГДА ПередачаТоваровМеждуОрганизациямиТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ПередачаТоваровМеждуОрганизациямиТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		ПередачаТоваровМеждуОрганизациямиТовары.ПроцентРучнойСкидки + ПередачаТоваровМеждуОрганизациямиТовары.ПроцентАвтоматическойСкидки КАК ПроцентСкидки,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Характеристика КАК Характеристика,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Упаковка КАК Упаковка,
	|		ПередачаТоваровМеждуОрганизациямиТовары.СтавкаНДС КАК СтавкаНДС,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Цена КАК Цена,
	|		ПередачаТоваровМеждуОрганизациямиТовары.КоличествоУпаковок КАК Количество,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Сумма КАК Сумма,
	|		ПередачаТоваровМеждуОрганизациямиТовары.СуммаРучнойСкидки + ПередачаТоваровМеждуОрганизациямиТовары.СуммаАвтоматическойСкидки КАК СуммаСкидки,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Сумма + ПередачаТоваровМеждуОрганизациямиТовары.СуммаРучнойСкидки + ПередачаТоваровМеждуОрганизациямиТовары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|		ПередачаТоваровМеждуОрганизациямиТовары.СуммаНДС КАК СуммаНДС,
	|		ПередачаТоваровМеждуОрганизациямиТовары.НомерСтроки КАК НомерСтроки,
	|		РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|		РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК ЯчейкаРабочийУчасток
	|	ИЗ
	|		Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|			ПО ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|				И ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.СкладПолучатель = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|				И (ИСТИНА = РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|	ГДЕ
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка В(&МассивДокументов)
	|		И ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(СуммаСкидки)
	|ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Накладная";
	
	МассивРезультатов 		= Запрос.ВыполнитьПакет();
	ДанныеПечати			= МассивРезультатов[0].Выбрать();
	ВыборкаПоДокументам 	= МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		НайденСледующий = ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		// Если в накладной только услуги - перейдем к следующему документу	
		Если НайденСледующий Тогда
			ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
			ЕстьСкидки = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ВыборкаПоТоварам, ИспользоватьРучныеСкидки Или ИспользоватьАвтоматическиеСкидки);
			ЕстьНДС = ДанныеПечати.УчитыватьНДС;
			ВыборкаПоТоварам.Сбросить();
		Иначе
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе %1 отсутствуют товары. Печать накладной не требуется'"),
			ДанныеПечати.Ссылка
			);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка
			);
			Продолжить;
		КонецЕсли;
		
		// Макет необходимо получать для каждого документа, т.к. размеры колонок изменяются динамически
		Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьФормДополнительно.ПФ_MXL_РеализацияТоваров");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
		
		ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр("ru='Реализация товаров'"));
		
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Поставщик");
		ПредставлениеПоставщика                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		ОбластьМакета.Параметры.Поставщик               = ДанныеПечати.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		ПредставлениеПолучателя                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Получатель, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель              = ДанныеПечати.Получатель;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы Товары
		ЕстьСкидки=ЛОЖЬ;
		ЕстьНДС=ИСТИНА;
		ВыводитьЯчейки= Истина;
		
		
		СуффиксОбластиСтроки = ?(ЕстьСкидки, "СоСкидкой", "") + ?(ЕстьНДС, "СНДС", "");
		СуффиксОбластиКолонки = ?(ЕстьСкидки И ЕстьНДС, "СоСкидкойСНДС", ?(ЕстьСкидки Или ЕстьНДС, "СоСкидкойИлиСНДС", ""));
		
		ОбластьКолонкаТовар = Макет.Область("ПерваяКолонкаТовара");
		ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки
		+ ?(ВыводитьКоды, 0, Макет.Область("КолонкаКодов").ШиринаКолонки)
		;
		
		ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
		ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
		ОбластьЯчейки  = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбластиСтроки + "|Ячейки");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ОбластьКодов.Параметры.ИмяКолонкиКодов = КолонкаКодов;
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		Если ВыводитьЯчейки Тогда
			ТабличныйДокумент.Присоединить(ОбластьЯчейки);
		КонецЕсли;
		
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		ОбластьНомера  = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
		ОбластьДанных  = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
		ОбластьЯчейки  = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбластиСтроки + "|Ячейки");
		
		Сумма          = 0;
		СуммаНДС       = 0;
		ВсегоСкидок    = 0;
		НомерСтроки    = 0;
		ВсегоБезСкидок = 0;
		
		// Выводим строки таблицы Товары
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				ОбластьКодов.Параметры.Артикул = ВыборкаПоТоварам[КолонкаКодов];
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			Если ВыводитьЯчейки Тогда
				ОбластьЯчейки.Параметры.Ячейка = ВыборкаПоТоварам.Ячейка;
				ТабличныйДокумент.Присоединить(ОбластьЯчейки);
			КонецЕсли;
			
			
			ОбластьТовар.Параметры.Заполнить(ВыборкаПоТоварам);
			ОбластьТовар.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоТоварам.ТоварНаименованиеПолное,
			ВыборкаПоТоварам.Характеристика,
			ВыборкаПоТоварам.Упаковка
			) + ?(ВыборкаПоТоварам.ЭтоВозвратнаяТара, НСтр("ru=' (возвратная тара)'"), "");
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			ОбластьДанных.Параметры.Заполнить(ВыборкаПоТоварам);
			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Сумма          = Сумма          + ВыборкаПоТоварам.Сумма;
			СуммаНДС       = СуммаНДС       + ВыборкаПоТоварам.СуммаНДС;
			
			Если ЕстьСкидки Тогда
				ВсегоСкидок    = ВсегоСкидок    + ВыборкаПоТоварам.СуммаСкидки;
				ВсегоБезСкидок = ВсегоБезСкидок + ВыборкаПоТоварам.СуммаБезСкидки;
			КонецЕсли;
			
		КонецЦикла;
		
		// Выводим подвал
		ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Товар" + СуффиксОбластиКолонки);
		ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Данные" + СуффиксОбластиКолонки);
		ОбластьЯчейки  = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбластиСтроки + "|Ячейки");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		Если ВыводитьЯчейки Тогда
			ТабличныйДокумент.Присоединить(ОбластьЯчейки);
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		Если ЕстьСкидки Тогда
			
			ОбластьДанных.Параметры.ВсегоСкидок    = ВсегоСкидок;
			ОбластьДанных.Параметры.ВсегоБезСкидок = ВсегоБезСкидок;
			
		КонецЕсли;
		
		ОбластьДанных.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		// Выводим ИтогоНДС
		Область = Макет.ПолучитьОбласть("ПодвалНДС");
		
		Область.Параметры.ВсегоНДС = СуммаНДС;
		Если ЕстьНДС Тогда
			Область.Параметры.НДС = ?(ДанныеПечати.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'"));
		Иначе
			Область.Параметры.НДС = НСтр("ru='Без налога (НДС)'");
		КонецЕсли;
		ТабличныйДокумент.Присоединить(Область);
		
		// Выводим Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = НСтр("ru='Всего наименований %КоличествоНаименований%, на сумму %СуммаДокумента% '");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоНаименований%", ВыборкаПоТоварам.Количество());
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%СуммаДокумента%", ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
		ОбластьМакета.Параметры.СуммаПрописью  = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		Если ЗначениеЗаполнено(ДанныеПечати.ОтпускПроизвел) Тогда
			ОбластьМакета.Параметры.ОтпускПроизвел = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.ОтпускПроизвел);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыМ15(ПараметрыПечати, МассивОбъектов)
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ПеремещениеТоваров.ДатаРаспоряжения КАК ДатаСоставления,
	|	ПеремещениеТоваров.Организация.Префикс КАК Префикс,
	|	ПеремещениеТоваров.ДокументОснование КАК Основание,
	|	ПеремещениеТоваров.СкладОтправитель.Наименование КАК СкладНаименование,
	|	ПеремещениеТоваров.Подразделение КАК СтруктурноеПодразделение,
	|	ИСТИНА КАК ЦенаВключаетНДС,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущийОтветственный.Наименование КАК Кладовщик,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	ЛОЖЬ КАК ЭтоПередачаНаКомиссию,
	|	ПеремещениеТоваров.СкладПолучатель.Наименование КАК КонтрагентНаименование,
	|	&Валюта КАК Валюта
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ПеремещениеТоваров.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ПеремещениеТоваровТовары.Номенклатура.Код КАК НоменклатураКод,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ПеремещениеТоваровТовары.Упаковка КАК Упаковка,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК КоличествоМест,
	|	ПеремещениеТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеТоваровТовары.Количество КАК Количество,
	|	МАКСИМУМ(0) КАК СуммаНДС,
	|	МАКСИМУМ(ЛОЖЬ) КАК ЭтоВозвратнаяТара,
	|	СУММА(СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.ДопРасходы) КАК СуммаСНДС,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.КоличествоУпаковок <> 0
	|			ТОГДА СУММА(СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.ДопРасходы) / ПеремещениеТоваровТовары.КоличествоУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ПеремещениеТоваровТовары.Упаковка.Наименование КАК УпаковкаНаименование,
	|	СУММА(СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.ДопРасходы) КАК СуммаБезНДС
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО ПеремещениеТоваровТовары.Ссылка = СебестоимостьТоваров.Регистратор
	|			И ПеремещениеТоваровТовары.Номенклатура = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ПеремещениеТоваровТовары.Характеристика = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика
	|			И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Склад
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Номенклатура.НаименованиеПолное,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения.Представление,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения.Код,
	|	ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное,
	|	ПеремещениеТоваровТовары.Упаковка,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок,
	|	ПеремещениеТоваровТовары.НомерСтроки,
	|	ПеремещениеТоваровТовары.Количество,
	|	ПеремещениеТоваровТовары.Упаковка.Наименование,
	|	ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Номенклатура
	|ИТОГИ ПО
	|	Ссылка";
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Запрос.УстановитьПараметр("Валюта", ВалютаРегламентированногоУчета);
	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатПоШапке = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати = Новый Структура(
	"РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке,
	РезультатПоТабличнойЧасти
	);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);	
	КонецЕсли;
	
	Возврат СтруктураДанныхДляПечати;
	
конецФункции	

Функция СформироватьПечатнуюФормуМ15(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_М15";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыМ15(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументМ15(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, КомплектыПечати);
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура заполнения реквизитов шапки М-15.
//
// Параметры:
//	ДанныеПечати - ВыборкаИзРезультатаЗапроса - Данные шапки документа
//	Макет - Макет ТОРГ-12
//	ТабличныйДокумент - Табличный документ
//
Процедура ЗаполнитьРеквизитыШапкиМ15(ДанныеПечати, Макет, ТабличныйДокумент)
	
	// Выводим общие реквизиты шапки
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
	ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
	ОбластьМакета.Параметры.НомерДокумента           = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеПечати.Номер, Ложь, Истина);
	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПодвалаМ15(ОбластьПодвала, ДанныеПечати, ИтоговыеСуммы)
	
	ОбластьПодвала.Параметры.Заполнить(ДанныеПечати);
	
	// Главный бухгалтер
	ОбластьПодвала.Параметры.ФИОГлавБухгалтера       = ДанныеПечати.ГлавныйБухгалтер;
	
	ОбластьПодвала.Параметры.ФИОРуководителя         = ДанныеПечати.Руководитель;
	ОбластьПодвала.Параметры.ДолжностьРуководителя   = ДанныеПечати.ДолжностьРуководителя;
	
	ОбластьПодвала.Параметры.ФИОКладовщика           = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Кладовщик);
	ОбластьПодвала.Параметры.ДолжностьКладовщика     = ДанныеПечати.ДолжностьКладовщика;
	
	ОбластьПодвала.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписейПрописью;
	ОбластьПодвала.Параметры.СуммаПрописью = ИтоговыеСуммы.СуммаПрописью;
	Если ЗначениеЗаполнено(ИтоговыеСуммы.ИтогоСуммаНДС) Тогда
		ОбластьПодвала.Параметры.ИтогНДС = ФормированиеПечатныхФорм.СуммаРубКоп(ИтоговыеСуммы.ИтогоСуммаНДС, Неопределено, Неопределено);
	Иначе
		ОбластьПодвала.Параметры.ИтогНДС = "______ руб. ______ коп.";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныйДокументМ15(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, КомплектыПечати)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьФормДополнительно.ПФ_MXL_М15");
	
	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		// Для печати комплектов
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
			КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеПечати.Ссылка,"Ссылка");
			Если КомплектПечатиПоСсылке = Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати[0];
			КонецЕсли;
			Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
				Продолжить
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоДокументам.Сбросить();
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска) Тогда
			Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 печать М-15 не требуется'"),
				ДанныеПечати.Ссылка
				);
			Иначе
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В документе %1 отсутствуют товары. Печать накладной не требуется'"),
				ДанныеПечати.Ссылка
				);
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка
			);
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим общие реквизиты шапки
		ЗаполнитьРеквизитыШапкиМ15(ДанныеПечати, Макет, ТабличныйДокумент);
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
		
		НомерСтраницы   = 1;
		
		// Инициализация итогов в документе
		ИтоговыеСуммы = СтруктураИтоговыеСуммы();
		
		// Создаем массив для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		// Выводим многострочную часть документа
		ОбластьМакета  = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
		
		НомерСтроки = 0;
		ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
		ИтоговыеСуммы.Вставить("СуммаСНДС",0);
		ИтоговыеСуммы.Вставить("СуммаНДС",0);
		ЗаполнитьРеквизитыПодвалаМ15(ОбластьПодвала, ДанныеПечати, ИтоговыеСуммы);
		
		СтрокаТовары = ВыборкаПоДокументам.Выбрать();
		КоличествоСтрок = СтрокаТовары.Количество();
		Пока СтрокаТовары.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьМакета);
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьМакета);
			
			Если НомерСтроки = КоличествоСтрок Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
			КонецЕсли;
			
			Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);
			
		КонецЦикла;
		
		// Выводим итоги по документу
		ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
		ЗаполнитьРеквизитыПодвалаМ15(ОбластьПодвала, ДанныеПечати, ИтоговыеСуммы);
		ОбластьПодвала.Параметры.ИтогоСуммаНДС = ИтоговыеСуммы.ИтогоСуммаНДС;
		ОбластьПодвала.Параметры.ИтогоСуммаСНДС = ИтоговыеСуммы.ИтогоСуммаСНДС;
		ТабличныйДокумент.Вывести(ОбластьПодвала);
		
		// Выведем нужное количество экземпляров (при печати комплектов)
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
			ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
			Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьКопирования);
			КонецЦикла;
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполнения реквизитов шапки счета на оплату клиенту
//
// Параметры:
// 		ДанныеПечати - ВыборкаИзРезультатаЗапроса - Данные шапки документа
// 		Макет - ТабличныйДокумент
// 		ТабличныйДокумент - ТабличныйДокумент
// 		ТаблицаЭтапыОплаты - Массив
//
Процедура ЗаполнитьРеквизитыШапкиСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты)
	
	СведенияОПоставщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	
	Если ТаблицаЭтапыОплаты.Количество() = 0 Тогда
		ДатаПлатежа = '00010101';
	ИначеЕсли ТаблицаЭтапыОплаты.Количество() = 1 Тогда
		ДатаПлатежа = ТаблицаЭтапыОплаты[0].ДатаПлатежа;
	Иначе
		ДатаПлатежа = ТаблицаЭтапыОплаты[ТаблицаЭтапыОплаты.Количество()-1].ДатаПлатежа;
	КонецЕсли;
	ДатаПлатежа=ДанныеПечати.Дата+3*60*60*24;
	Если ЗначениеЗаполнено(ДатаПлатежа) Тогда
		
		НадписьСрокДействия = НСтр("ru='Счет действителен до %СрокДействия%. '");
		НадписьСрокДействия = СтрЗаменить(НадписьСрокДействия, "%СрокДействия%", Формат(ДатаПлатежа, "ДЛФ=D"));
		ОбластьМакета.Параметры.СрокДействия = НадписьСрокДействия;
		
	КонецЕсли;
	
	ОбластьМакета.Параметры.ИНН             = СведенияОПоставщике.ИНН;
	ОбластьМакета.Параметры.КПП             = СведенияОПоставщике.КПП;
	ПредставлениеПоставщикаДляПлатПоручения = "";
	
	Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
		
		Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет.БанкДляРасчетов) Тогда
			Если ДанныеПечати.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов Тогда
				Банк       = ДанныеПечати.БанковскийСчет.НаименованиеБанкаДляРасчетов;
				БИК        = ДанныеПечати.ДанныеПечати.БанковскийСчет.БИКБанкаДляРасчетов;
				КоррСчет   = ДанныеПечати.БанковскийСчет.КоррСчетБанкаДляРасчетов;
				ГородБанка = ДанныеПечати.БанковскийСчет.ГородБанкаДляРасчетов;
			Иначе
				Банк       = ДанныеПечати.БанковскийСчет.БанкДляРасчетов;
				БИК        = ДанныеПечати.БанковскийСчет.БанкДляРасчетов.Код;
				КоррСчет   = ДанныеПечати.БанковскийСчет.БанкДляРасчетов.КоррСчет;
				ГородБанка = ДанныеПечати.БанковскийСчет.БанкДляРасчетов.Город;
			КонецЕсли;
			Если ДанныеПечати.БанковскийСчет.РучноеИзменениеРеквизитовБанка Тогда
				НомерСчета = ДанныеПечати.БанковскийСчет.КоррСчетБанка;
			Иначе
				НомерСчета = ДанныеПечати.БанковскийСчет.Банк.КоррСчет;
			КонецЕсли;
		Иначе
			Если ДанныеПечати.БанковскийСчет.РучноеИзменениеРеквизитовБанка Тогда
				Банк       = ДанныеПечати.БанковскийСчет.НаименованиеБанка;
				БИК        = ДанныеПечати.БанковскийСчет.БИКБанка;
				КоррСчет   = ДанныеПечати.БанковскийСчет.КоррСчетБанка;
				ГородБанка = ДанныеПечати.БанковскийСчет.ГородБанка;
			Иначе
				Банк       = ДанныеПечати.БанковскийСчет.Банк;
				БИК        = ДанныеПечати.БанковскийСчет.Банк.Код;
				КоррСчет   = ДанныеПечати.БанковскийСчет.Банк.КоррСчет;
				ГородБанка = ДанныеПечати.БанковскийСчет.Банк.Город;
			КонецЕсли;
			НомерСчета = ДанныеПечати.БанковскийСчет.НомерСчета;
		КонецЕсли;
		
		ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
		ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
		ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
		ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
		ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
		ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
		ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
		ПредставлениеПоставщикаДляПлатПоручения                  = ДанныеПечати.БанковскийСчетТекстКорреспондента;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
		ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения = ПредставлениеПоставщикаДляПлатПоручения;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр("ru='Счет на оплату'"));
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если ЗначениеЗаполнено(ДанныеПечати.НазначениеПлатежа) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НазначениеПлатежа");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполнения реквизитов подвала счета на оплату клиенту
//
// Параметры:
// 		ДанныеПечати - ВыборкаИзРезультатаЗапроса - Данные шапки документа
// 		Макет - Макет СчетЗаказ
// 		ТабличныйДокумент - Табличный документ
// 		ТаблицаЭтапыОплаты - Массив
// 		СоответствиеСтавокНДС - Соответствие
//
Процедура ЗаполнитьРеквизитыПодвалаСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС, ПараметрыПечати)
	
	// Вывести этапы графика оплаты
	Если ТаблицаЭтапыОплаты.Количество() > 1 Тогда
		
		ИмяКолонкиДатыОплаты = ?(ДанныеПечати.СчетКВозврату, НСтр("ru='Дата оплаты или возврата'"), НСтр("ru='Дата оплаты'"));
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыЭтапыОплаты");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ИтогоЭтапыОплаты");
		ОбластьШапкаТаблицы.Параметры.ИмяКолонкиДатыОплаты = ИмяКолонкиДатыОплаты;
		МассивПроверкиВывода = Новый Массив;
		МассивПроверкиВывода.Добавить(ОбластьШапкаТаблицы);
		МассивПроверкиВывода.Добавить(ОбластьПодвалТаблицы);
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыЭтапыОплаты");
		
		Для Каждого ТекЭтап Из ТаблицаЭтапыОплаты Цикл
			
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ТекЭтап);
			ОбластьСтрокаТаблицы.Параметры.ТекстНДС = ФормированиеПечатныхФорм.СформироватьТекстНДСЭтапаОплаты(СоответствиеСтавокНДС, ТекЭтап.ПроцентПлатежа);
			МассивПроверкиВывода.Добавить(ОбластьСтрокаТаблицы);
			
			Если ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
				Если ТекЭтап.НомерСтроки = 1 Тогда
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
					МассивПроверкиВывода.Удалить(0);
				КонецЕслИ;
			Иначе
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			МассивПроверкиВывода.Удалить(МассивПроверкиВывода.ВГраница());
			
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
		
	КонецЕсли;
	
	// Вывести дополнительную информацию
	Если ЗначениеЗаполнено(ДанныеПечати.ДополнительнаяИнформация) Тогда
		
		Область = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
		Область.Параметры.ДополнительнаяИнформация = ДанныеПечати.ДополнительнаяИнформация;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЕсли;
	
	// Вывести подписи
	Область = Макет.ПолучитьОбласть("ПодвалСчета");
	
	Область.Параметры.ФИОРуководителя = ДанныеПечати.Руководитель;
	Область.Параметры.ФИОБухгалтера = ДанныеПечати.ГлавныйБухгалтер;
	
	Область.Параметры.ФИОМенеджер = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер);
	
	ФормированиеПечатныхФорм.ВывестиФаксимилеВТабличныйДокумент(Макет, Область, ДанныеПечати.Организация, ПараметрыПечати);
	
	ТабличныйДокумент.Вывести(Область);
	
КонецПроцедуры

// Процедура заполняет табличный документ "Счет на оплату"
Процедура ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати)
	
	ШаблонОшибкиТовары = НСтр("ru = 'В документе %1 отсутствуют товары. Печать счета на оплату не требуется'");
	ШаблонОшибкиЭтапы = НСтр("ru = 'В документе %1 отсутствуют этапы оплаты. Печать счета на оплату не требуется'");
	
	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	
	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ЭтапыОплаты = ДанныеДляПечати.РезультатПоЭтапамОплаты.Выгрузить();
	Товары = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
	
	Если Товары.Колонки.Найти("Содержание")=Неопределено Тогда
		ЕстьСодержание = Ложь;
	Иначе
		ЕстьСодержание = Истина;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	КолонкаКодов   = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	Макет = ПолучитьМакет("ПФ_MXL_СчетКлиента");
	
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	ОбластьПервойКолонкиТоваров = Макет.Область("ПерваяКолонкаТовара");
	Если КолонкаКодов <> "Артикул" Тогда
		ОбластьПервойКолонкиТоваров.ШиринаКолонки = ОбластьПервойКолонкиТоваров.ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Макет.УдалитьОбласть(Макет.Область("Артикул"), Смещать);
	КонецЕсли;
	Если КолонкаКодов<>"Код" Тогда
		ОбластьПервойКолонкиТоваров.ШиринаКолонки = ОбластьПервойКолонкиТоваров.ШиринаКолонки + Макет.Область("Код").ШиринаКолонки;
		Макет.УдалитьОбласть(Макет.Область("Код"), Смещать);
	КонецЕсли;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		
		ТаблицаТовары = Товары.НайтиСтроки(СтруктураПоиска);
		Если НЕ (ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуКлиенту")
			И ТипЗнч(ДанныеПечати.ДокументОснование) = Тип("СправочникСсылка.ДоговорыКонтрагентов")) 
			И ТаблицаТовары.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибкиТовары, ДанныеПечати.Ссылка), ДанныеПечати.Ссылка);
			Продолжить;
		КонецЕсли;
		ТаблицаЭтапыОплаты = ЭтапыОплаты.НайтиСтроки(СтруктураПоиска);
		Если ТаблицаЭтапыОплаты.Количество() = 0  И ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибкиЭтапы, ДанныеПечати.Ссылка), ДанныеПечати.Ссылка);
			Продолжить;
		КонецЕсли;
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидки = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ТаблицаТовары, ИспользоватьРучныеСкидки Или ИспользоватьАвтоматическиеСкидки);
		ЕстьСкидки=Ложь;
		СуффиксОбласти = ?(ДанныеПечати.УчитыватьНДС, "СНДС", "") + ?(ЕстьСкидки, "СоСкидкой", "");
		
		ЗаполнитьРеквизитыШапкиСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты);
		
		Если ДанныеПечати.ЧастичнаяОплата Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицыЧастичнаяОплата"));
			
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыЧастичнаяОплата");
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			
			ОбластьИтого = Макет.ПолучитьОбласть("ПодвалТаблицыЧастичнаяОплата");
			ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьИтого);
			
			// Вывести ИтогоНДС
			СоответствиеСтавокНДС = Новый Соответствие;
			Если ДанныеПечати.УчитыватьНДС Тогда
				ОбластьИтогоНДС = Макет.ПолучитьОбласть("ПодвалТаблицыНДС");
				Для Каждого СтрокаТовара Из ТаблицаТовары Цикл
					СуммаНДС = СоответствиеСтавокНДС[СтрокаТовара.СтавкаНДС];
					Если СуммаНДС = Неопределено Тогда
						СуммаНДС = СтрокаТовара.СуммаНДС;
					Иначе
						СуммаНДС = СуммаНДС + СтрокаТовара.СуммаНДС;
					КонецЕсли;
					СоответствиеСтавокНДС.Вставить(СтрокаТовара.СтавкаНДС, СуммаНДС);
				КонецЦикла;
				Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
					ОбластьИтогоНДС.Параметры.НДС = ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС);
					ОбластьИтогоНДС.Параметры.ВсегоНДС = ФормированиеПечатныхФорм.ФорматСумм(ТекСтавкаНДС.Значение /100 * ДанныеПечати.ПроцентОплаты);
					ТабличныйДокумент.Вывести(ОбластьИтогоНДС);
				КонецЦикла;
				ОбластьПодвалСНДС = Макет.ПолучитьОбласть("ПодвалТаблицыВсего");
				ОбластьПодвалСНДС.Параметры.ВсегоСНДС = ФормированиеПечатныхФорм.ФорматСумм(ДанныеПечати.СуммаДокумента);
				ТабличныйДокумент.Вывести(ОбластьПодвалСНДС);
			КонецЕсли;
			
			// Вывести Сумму прописью
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописьюЧастичныйСчет");
			СуммаПрописью = НСтр("ru='Всего на сумму %СуммаПрописью%'");
			СуммаПрописью = СтрЗаменить(СуммаПрописью, "%СуммаПрописью%", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДанныеПечати.СуммаДокумента, ДанныеПечати.Валюта));
			ОбластьМакета.Параметры.СуммаПрописью = СуммаПрописью;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		Иначе
			
			// Таблица "Товары"
			ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбласти);
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбласти);
			ОбластьПодвалТаблицы =Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбласти);
			ОбластьПодвалНДС = Макет.ПолучитьОбласть("ПодвалТаблицыНДС");
			
			Если ДанныеПечати.УчитыватьНДС Тогда
				ОбластьПодвалСНДС = Макет.ПолучитьОбласть("ПодвалТаблицыВсего" + СуффиксОбласти);
			КонецЕсли;
			
			ОбластьСуммаПрописью = Макет.ПолучитьОбласть(?(ДанныеПечати.СчетКВозврату, "СуммаПрописьюКВозврату", "СуммаПрописью"));
			
			МассивПроверкиВывода = Новый Массив;
			МассивПроверкиВывода.Добавить(ОбластьШапкаТаблицы);
			МассивПроверкиВывода.Добавить(ОбластьПодвалТаблицы);
			МассивПроверкиВывода.Добавить(ОбластьПодвалНДС);
			МассивПроверкиВывода.Добавить(ОбластьСуммаПрописью);
			
			Сумма = 0;
			СуммаНДС = 0;
			ВсегоСкидок = 0;
			ВсегоБезСкидок = 0;
			НомерСтроки = 0;
			СоответствиеСтавокНДС = Новый Соответствие;
			
			если ТИПЗНЧ(ДанныеПечати.Ссылка)=ТИП("ДокументСсылка.ЗаказКлиента") тогда
				РаспределитьТранспортные=ДанныеПечати.Ссылка.РаспределитьТранспортные;
			иначе
				РаспределитьТранспортные=Ложь;
			конецесли;	
			ИтогСумма=0;
			ИтогСуммаНДС=0;
			
			ИтогоВес=0;
			Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
				
				НомерСтроки = НомерСтроки + 1;
				
				если (ТаблицаТовары.Количество()=НомерСтроки) и РаспределитьТранспортные тогда
					СтрокаТовары.Сумма=ДанныеПечати.Ссылка.Товары.ИТОГ("Сумма")-ИтогСумма;
					СтрокаТовары.СуммаНДС=ДанныеПечати.Ссылка.Товары.ИТОГ("СуммаНДС")-ИтогСуммаНДС;
					СтрокаТовары.Цена=?(СтрокаТовары.Количество<>0,СтрокаТовары.Сумма/СтрокаТовары.Количество,0);
				конецесли;	
				ИтогСумма=ИтогСумма+ОКР(СтрокаТовары.Сумма,2);
				ИтогСуммаНДС=ИтогСуммаНДС+ОКР(СтрокаТовары.СуммаНДС,2);
				
				ИтогоВес=ИтогоВес+СтрокаТовары.Вес;
				Если ЕстьСодержание Тогда
					ОбластьСтрокаТаблицы.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
					СтрокаТовары.НаименованиеПолное,
					СтрокаТовары.Характеристика,
					СтрокаТовары.Упаковка,
					, // Серия
					СтрокаТовары.Содержание
					);
				Иначе
					ОбластьСтрокаТаблицы.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
					СтрокаТовары.НаименованиеПолное,
					СтрокаТовары.Характеристика,
					СтрокаТовары.Упаковка
					);
				КонецЕсли;
				
				ОбластьСтрокаТаблицы.Параметры.Заполнить(СтрокаТовары);
				ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
				
				ОбластьСтрокаТаблицы.Параметры.Цена = СтрокаТовары.Сумма/СтрокаТовары.Количество;
				
				МассивПроверкиВывода.Добавить(ОбластьСтрокаТаблицы);
				
				Если ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
					Если НомерСтроки = 1 Тогда
						ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
						МассивПроверкиВывода.Удалить(0);
					КонецЕслИ;
				Иначе
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
				МассивПроверкиВывода.Удалить(МассивПроверкиВывода.ВГраница());
				
				Сумма = Сумма + СтрокаТовары.Сумма;
				СуммаНДС = СуммаНДС + СтрокаТовары.СуммаНДС;
				
				Если ЕстьСкидки Тогда
					ВсегоСкидок = ВсегоСкидок + СтрокаТовары.СуммаСкидки;
					ВсегоБезСкидок = ВсегоБезСкидок + СтрокаТовары.СуммаБезСкидки;
				КонецЕсли;
				
				Если ДанныеПечати.УчитыватьНДС Тогда
					СуммаНДСПоСтавке = СоответствиеСтавокНДС[СтрокаТовары.СтавкаНДС];
					Если СуммаНДСПоСтавке = Неопределено Тогда
						СуммаНДСПоСтавке = 0;
					КонецЕсли;
					СоответствиеСтавокНДС.Вставить(СтрокаТовары.СтавкаНДС, СуммаНДСПоСтавке + СтрокаТовары.СуммаНДС);
				КонецЕсли;
				
			КонецЦикла;
			
			// Подвал таблицы "Товары"
			Если ЕстьСкидки Тогда
				
				ОбластьПодвалТаблицы.Параметры.ВсегоСкидок = ВсегоСкидок;
				ОбластьПодвалТаблицы.Параметры.ВсегоБезСкидок = ВсегоБезСкидок;
				
				Если ДанныеПечати.УчитыватьНДС Тогда
					ОбластьПодвалТаблицы.Параметры.ВсегоСуммаНДС = СуммаНДС;
				КонецЕсли;
				
			КонецЕсли;
			ОбластьПодвалТаблицы.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
			
			// Область "ПодвалТаблицыНДС"
			Если ДанныеПечати.УчитыватьНДС Тогда
				
				Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
					
					ОбластьПодвалНДС.Параметры.НДС = ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС);
					ОбластьПодвалНДС.Параметры.ВсегоНДС = ФормированиеПечатныхФорм.ФорматСумм(ТекСтавкаНДС.Значение, ,"-");
					ТабличныйДокумент.Вывести(ОбластьПодвалНДС);
					
				КонецЦикла;
				
				ОбластьПодвалСНДС.Параметры.ВсегоСНДС = ФормированиеПечатныхФорм.ФорматСумм(Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС));
				ТабличныйДокумент.Вывести(ОбластьПодвалСНДС);
				
			Иначе
				ОбластьПодвалНДС.Параметры.НДС = НСтр("ru='Без налога (НДС)'");
				ОбластьПодвалНДС.Параметры.ВсегоНДС = "-";
				ТабличныйДокумент.Вывести(ОбластьПодвалНДС);
			КонецЕсли;
			
			ОбластьИтогоВес=Макет.ПолучитьОбласть("ИтогоВес");
			
			ОбластьИтогоВес.Параметры.ВсегоВес=ИтогоВес;
			ТабличныйДокумент.Вывести(ОбластьИтогоВес);
			
			
			// Вывести Сумму прописью
			СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
			ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%",      ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
			
			Если ДанныеПечати.СчетКВозврату Тогда
				
				СуммаКВозврату = ДанныеПечати.СуммаКВозврату;
				СуммаИтого = СуммаКПрописи-СуммаКВозврату;
				Если СуммаИтого < 0 Тогда
					СуммаИтого = 0;
				КонецЕсли;
				ОбластьСуммаПрописью.Параметры.СуммаВозврата = ФормированиеПечатныхФорм.ФорматСумм(СуммаКВозврату, ДанныеПечати.Валюта);
				ОбластьСуммаПрописью.Параметры.СуммаИтогоКОплате = ФормированиеПечатныхФорм.ФорматСумм(СуммаИтого, ДанныеПечати.Валюта, "0");
				ОбластьСуммаПрописью.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаИтого, ДанныеПечати.Валюта);
			Иначе
				
				ОбластьСуммаПрописью.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
			КонецЕсли;
			
			ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
			
			ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
		КонецЕсли;
		ЗаполнитьРеквизитыПодвалаСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС, ПараметрыПечати);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалНижний");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуСчетаКлиента(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СЧЕТНАОПЛАТУ";
	
	НомерТипаДокумента = 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыСчетаНаОплату(ПараметрыПечати, СтруктураОбъектов);
		ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыСчетаНаОплату(ПараметрыПечати, МассивОбъектов) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.Организация КАК Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Контрагент КАК Контрагент,
	|	Документы.БанковскийСчет КАК БанковскийСчет,
	|	Документы.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	Документы.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Документы.Валюта КАК Валюта,
	|	Документы.Менеджер.ФизическоеЛицо.Наименование КАК Менеджер,
	|	Документы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	Документы.СуммаДокумента КАК СуммаКВозврату,
	|	ЛОЖЬ КАК ЧастичнаяОплата,
	|	"""" КАК НазначениеПлатежа,
	|	100 КАК ПроцентОплаты,
	|	Документы.СуммаДокумента КАК СуммаДокумента,
	|	ЛОЖЬ КАК СчетКВозврату
	|ИЗ
	|	Документ.ЗаказКлиента КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование,
	|	ТаблицаОтветственныеЛица.РуководительДолжность,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ РеализацияТоваровУслуг.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Организация.Префикс,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации.ТекстКорреспондента,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.Валюта,
	|	РеализацияТоваровУслуг.Менеджер.ФизическоеЛицо.Наименование,
	|	РеализацияТоваровУслуг.Комментарий,
	|	РеализацияТоваровУслуг.СуммаДокумента,
	|	ЛОЖЬ,
	|	"""",
	|	100,
	|	РеализацияТоваровУслуг.СуммаДокумента,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО РеализацияТоваровУслуг.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	|	ЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа
	|ИЗ
	|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Результат.Ссылка,
	|	Результат.Номенклатура,
	|	Результат.Код,
	|	Результат.Артикул,
	|	Результат.НаименованиеПолное,
	|	Результат.ЕдиницаИзмерения,
	|	СУММА(Результат.Количество) КАК Количество,
	|	ВЫРАЗИТЬ(Результат.Цена КАК ЧИСЛО(10, 2)) КАК Цена,
	|	СУММА(Результат.Сумма) КАК Сумма,
	|	Результат.СтавкаНДС,
	|	СУММА(Результат.СуммаНДС) КАК СуммаНДС,
	|	Результат.Характеристика,
	|	Результат.Упаковка,
	|	СУММА(Результат.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(Результат.СуммаБезСкидки) КАК СуммаБезСкидки,
	|	СУММА(Результат.Вес) КАК Вес,
	|	МАКСИМУМ(Результат.Цена) КАК Цена1,
	|	МАКСИМУМ(Результат.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Ссылка КАК Ссылка,
	|		Товары.НомерСтроки КАК НомерСтроки,
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.Номенклатура.Код КАК Код,
	|		Товары.Номенклатура.Артикул КАК Артикул,
	|		Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка.ЕдиницаИзмерения)
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		Товары.КоличествоУпаковок КАК Количество,
	|		ВЫРАЗИТЬ(Товары.Сумма + Товары.Сумма * Товары.Распределять * ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|				ИНАЧЕ 0
	|			КОНЕЦ / Товары.КоличествоУпаковок КАК ЧИСЛО(15, 2)) КАК Цена,
	|		ВЫРАЗИТЬ(Товары.Сумма + Товары.Сумма * Товары.Распределять * ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|		Товары.СтавкаНДС КАК СтавкаНДС,
	|		ВЫРАЗИТЬ(Товары.СуммаНДС + Товары.СуммаНДС * Товары.Распределять * ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|		Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|		Товары.Характеристика.НаименованиеПолное КАК Характеристика,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Товары.Упаковка.Коэффициент, 1) = 1
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Товары.Упаковка.Наименование
	|		КОНЕЦ КАК Упаковка,
	|		Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаСкидки,
	|		Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|		ВЫБОР
	|			КОГДА НЕ Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА Товары.КоличествоУпаковок * Товары.Упаковка.Вес
	|			ИНАЧЕ Товары.Номенклатура.Вес * Товары.КоличествоУпаковок
	|		КОНЕЦ КАК Вес
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СУММА(ВЫБОР
	|						КОГДА ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|							ТОГДА ЗаказКлиентаТовары.Сумма
	|						ИНАЧЕ 0
	|					КОНЕЦ) КАК СуммаУслуг,
	|				СУММА(ВЫБОР
	|						КОГДА ЗаказКлиентаТовары.Распределять = 1
	|							ТОГДА ЗаказКлиентаТовары.Сумма
	|						ИНАЧЕ 0
	|					КОНЕЦ) КАК СуммаТоваров,
	|				ЗаказКлиентаТовары.Ссылка КАК Ссылка
	|			ИЗ
	|				Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|			ГДЕ
	|				ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ЗаказКлиентаТовары.Ссылка) КАК РаспределениеУслуг
	|			ПО Товары.Ссылка = РаспределениеУслуг.Ссылка
	|	ГДЕ
	|		Товары.Ссылка В(&МассивОбъектов)
	|		И Товары.Отменено = ЛОЖЬ
	|		И ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Товары.Ссылка,
	|		Товары.НомерСтроки,
	|		Товары.Номенклатура,
	|		Товары.Номенклатура.Код,
	|		Товары.Номенклатура.Артикул,
	|		Товары.Номенклатура.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка.ЕдиницаИзмерения)
	|		КОНЕЦ,
	|		Товары.КоличествоУпаковок,
	|		ВЫРАЗИТЬ(Товары.Сумма + Товары.Сумма * Товары.Распределять * ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|				ИНАЧЕ 0
	|			КОНЕЦ / Товары.КоличествоУпаковок КАК ЧИСЛО(15, 2)),
	|		ВЫРАЗИТЬ(Товары.Сумма + Товары.Сумма * Товары.Распределять * ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2)),
	|		Товары.СтавкаНДС,
	|		ВЫРАЗИТЬ(Товары.СуммаНДС + Товары.СуммаНДС * Товары.Распределять * ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2)),
	|		NULL,
	|		Товары.Характеристика.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Товары.Упаковка.Коэффициент, 1) = 1
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Товары.Упаковка.Наименование
	|		КОНЕЦ,
	|		Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки,
	|		Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки,
	|		ВЫБОР
	|			КОГДА НЕ Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА Товары.КоличествоУпаковок * Товары.Упаковка.Вес
	|			ИНАЧЕ Товары.Номенклатура.Вес * Товары.КоличествоУпаковок
	|		КОНЕЦ
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СУММА(ВЫБОР
	|						КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|							ТОГДА РеализацияТоваровУслугТовары.Сумма
	|						ИНАЧЕ 0
	|					КОНЕЦ) КАК СуммаУслуг,
	|				СУММА(ВЫБОР
	|						КОГДА РеализацияТоваровУслугТовары.Распределять = 1
	|							ТОГДА РеализацияТоваровУслугТовары.Сумма
	|						ИНАЧЕ 0
	|					КОНЕЦ) КАК СуммаТоваров,
	|				РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
	|			ИЗ
	|				Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			
	|			СГРУППИРОВАТЬ ПО
	|				РеализацияТоваровУслугТовары.Ссылка) КАК РаспределениеУслуг
	|			ПО Товары.Ссылка = РаспределениеУслуг.Ссылка
	|	ГДЕ
	|		Товары.Ссылка В(&МассивОбъектов)
	|		И ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК Результат
	|
	|СГРУППИРОВАТЬ ПО
	|	Результат.Характеристика,
	|	Результат.СтавкаНДС,
	|	Результат.Упаковка,
	|	Результат.Ссылка,
	|	Результат.Код,
	|	Результат.Артикул,
	|	Результат.Номенклатура,
	|	Результат.НаименованиеПолное,
	|	Результат.ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(Результат.Цена КАК ЧИСЛО(10, 2))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[0]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[1]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[2]);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Функция СформироватьПечатнуюФормуЗаявкаНаСборку(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество,
	|	ЗаказКлиентаТовары.Сумма,
	|	ЗаказКлиентаТовары.Номенклатура.Вес,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес * ЗаказКлиентаТовары.КоличествоУпаковок
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.Вес * ЗаказКлиентаТовары.КоличествоУпаковок
	|	КОНЕЦ КАК Вес,
	|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Помещение,
	|	ЗаказКлиентаТовары.Ссылка.Организация,
	|	ЗаказКлиентаТовары.Ссылка.Дата,
	|	ЗаказКлиентаТовары.Ссылка.Номер,
	|	ЗаказКлиентаТовары.Ссылка.Партнер,
	|	ЗаказКлиентаТовары.Ссылка.Контрагент,
	|	ЗаказКлиентаТовары.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаЦены,
	|	ЗаказКлиентаТовары.Склад КАК Склад
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ЗаказКлиентаТовары.Номенклатура)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ЗаказКлиентаТовары.Ссылка.Склад)
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.КоличествоУпаковок,
	|	ЗаказКлиентаТовары.Сумма,
	|	ЗаказКлиентаТовары.Номенклатура.Вес,
	|	ЗаказКлиентаТовары.Ссылка.Организация,
	|	ЗаказКлиентаТовары.Ссылка.Дата,
	|	ЗаказКлиентаТовары.Ссылка.Номер,
	|	ЗаказКлиентаТовары.Ссылка.Партнер,
	|	ЗаказКлиентаТовары.Ссылка.Контрагент,
	|	ЗаказКлиентаТовары.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес * ЗаказКлиентаТовары.КоличествоУпаковок
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.Вес * ЗаказКлиентаТовары.КоличествоУпаковок
	|	КОНЕЦ,
	|	ЗаказКлиентаТовары.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Помещение,
	|	ЗаказКлиентаТовары.Номенклатура.Наименование
	|ИТОГИ ПО
	|	Ссылка,
	|	Склад,
	|	Помещение";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Накладная";
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаСсылка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	
	Пока ВыборкаСсылка.Следующий() Цикл
		ВыборкаСклад=ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			ВыборкаПомещение = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПомещение.Следующий() Цикл
				// Вставить обработку выборки ВыборкаПомещение
				СуммаИтог=0; Веситог=0;
				Секция=ВыборкаПомещение.Помещение;
				если не ЗначениеЗаполнено(ВыборкаПомещение.Помещение) тогда
					Секция="";
					//продолжить;
				конецесли;	
				Макет = ПолучитьМакет("ПФ_MXL_ПечатьЗаявкаНаСборку");
				Если Не ПервыйДокумент Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ПервыйДокумент    = Ложь;
				НомерСтроки=0;
				ОбластьПолоса=Макет.ПолучитьОбласть("Полоса");
				если Найти(СТРОКА(ВыборкаСклад.Склад),"Торг")>0 тогда
					ТабличныйДокумент.Вывести(ОбластьПолоса);
				конецесли;	
				
				Область                                  = Макет.ПолучитьОбласть("Заголовок");
				Область.Параметры.ПредставлениеДокумента ="Заявка на сборку товара "+ВыборкаСсылка.Номер+" от "+Формат(ВыборкаСсылка.Дата,"ДФ=""дд ММММ гггг 'г.' """); 
				Область.Параметры.ПредставлениеПокупателя = "Покупатель: "+ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаСсылка.Контрагент, ВыборкаСсылка.Дата), "ПолноеНаименование,ФактическийАдрес");
				Область.Параметры.Секция = Секция;		
				
				ТабличныйДокумент.Вывести(Область);
				Область                                  = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ТабличныйДокумент.Вывести(Область);
				
				ВыборкаПоТоварам = ВыборкаПомещение.Выбрать();
				Сумма=0;СчетСтрок=1;
				ИтогНДС=0;
				Пока ВыборкаПоТоварам.Следующий() Цикл
					СчетСтрок = СчетСтрок + 1;
					
					Область                                  = Макет.ПолучитьОбласть("Строка");
					НомерСтроки = НомерСтроки + 1;
					
					Область.Параметры.НомерСтроки = НомерСтроки;
					
					Область.Параметры.Заполнить(ВыборкаПоТоварам);
					Область.Параметры.Товар = СОКРЛП(ВыборкаПоТоварам.Номенклатура);
					Область.Параметры.Количество = ВыборкаПоТоварам.Количество;
					Область.Параметры.ЕдиницаЦены = ВыборкаПоТоварам.ЕдиницаЦены;
					если  ВыборкаПоТоварам.Вес<>Null тогда
						ВесИтог          = ВесИтог          + ЧИСЛО(ВыборкаПоТоварам.Вес);
					конецесли;
					ТабличныйДокумент.Вывести(Область);	
					ИтогНДС=ИтогНДС+ВыборкаПоТоварам.СуммаНДС;
				КонецЦикла;
				ОбластьПодвал                                  = Макет.ПолучитьОбласть("Подвал");
				Областьподвал.Параметры.ВесИтог=Веситог;
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				Область                                  = Макет.ПолучитьОбласть("Подписи");
				
				ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
				ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
				
				Область.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки+", весом "+ВесИтог+" кг.";;
				
				Область.параметры.ВремяПечати=ТекущаяДата();
				ТабличныйДокумент.Вывести(Область);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция	СформироватьПечатнуюФормуСпецификации(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СПЕЦИФИКАЦИИ";
	
	НомерТипаДокумента = 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыСпецификации(ПараметрыПечати, СтруктураОбъектов);
		ЗаполнитьТабличныйДокументСпецификация(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыСпецификации(ПараметрыПечати, МассивОбъектов) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.Организация КАК Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Контрагент КАК Контрагент,
	|	Документы.БанковскийСчет КАК БанковскийСчетОрганизации,
	|	Документы.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	Документы.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Документы.Валюта КАК Валюта,
	|	Документы.Менеджер.ФизическоеЛицо.Наименование КАК Менеджер,
	|	Документы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	Документы.СуммаДокумента КАК СуммаКВозврату,
	|	ЛОЖЬ КАК ЧастичнаяОплата,
	|	"""" КАК НазначениеПлатежа,
	|	100 КАК ПроцентОплаты,
	|	Документы.СуммаДокумента КАК СуммаДокумента,
	|	ЛОЖЬ КАК СчетКВозврату,
	|	Документы.Договор,
	|	Документы.НалогообложениеНДС КАК ПрочиеУсловия,
	|	ВЫБОР
	|		КОГДА Документы.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Документы.Контрагент
	|		ИНАЧЕ Документы.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Документы.Договор.КонтактноеЛицо КАК КонтактноеЛицо
	|ИЗ
	|	Документ.ЗаказКлиента КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	|	ЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа
	|ИЗ
	|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка.ЕдиницаИзмерения)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	Товары.КоличествоУпаковок КАК Количество,
	|	(Товары.Сумма + Товары.Сумма * Товары.Распределять * ВЫБОР
	|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|		ИНАЧЕ 0
	|	КОНЕЦ) / Товары.КоличествоУпаковок КАК Цена,
	|	Товары.Сумма + Товары.Сумма * Товары.Распределять * ВЫБОР
	|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС + Товары.СуммаНДС * Товары.Распределять * ВЫБОР
	|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС,
	|	Товары.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Товары.Упаковка.Коэффициент, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Товары.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА ЗаказКлиентаТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаУслуг,
	|			СУММА(ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Распределять = 1
	|						ТОГДА ЗаказКлиентаТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаТоваров,
	|			ЗаказКлиентаТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ГДЕ
	|			ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказКлиентаТовары.Ссылка) КАК РаспределениеУслуг
	|		ПО Товары.Ссылка = РаспределениеУслуг.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|	И Товары.Отменено = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[0]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[1]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[2]);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументСпецификация(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ШаблонОшибкиТовары = НСтр("ru = 'В документе %1 отсутствуют товары. Печать заказа клиента не требуется'");
	ШаблонОшибкиЭтапы = НСтр("ru = 'В документе %1 отсутствуют этапы оплаты. Печать заказа клиента не требуется'");
	
	
	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ЭтапыОплаты = ДанныеДляПечати.РезультатПоЭтапамОплаты.Выгрузить();
	Товары = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
	
	ПервыйДокумент = Истина;
	
	Макет = ПолучитьМакет("ПФ_MXL_Спецификация");
	
	Пока ДанныеПечати.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ТаблицаТовары = Товары.НайтиСтроки(СтруктураПоиска);
		Если ТаблицаТовары.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибкиТовары, ДанныеПечати.Ссылка), ДанныеПечати.Ссылка);
			Продолжить;
		КонецЕсли;
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		// Вывод шапки документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата, ,ДанныеПечати.БанковскийСчетОрганизации), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата,  ,ДанныеПечати.БанковскийСчетКонтрагента), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель, ДанныеПечати.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета");
		ОбластьМакета.Параметры.ПредставлениеДокумента="Спецификация № 1 от "+Формат(ДанныеПечати.Дата,"ДФ=""дд ММММ гггг 'г.' """);
		Областьмакета.Параметры.ДоговорДокумента=ДанныеПечати.Договор;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Таблица "Товары"
		ОбластьШапкиТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьПодвалаТаблицы =Макет.ПолучитьОбласть("ПодвалТаблицы");
		
		МассивПроверкиВывода = Новый Массив;
		МассивПроверкиВывода.Добавить(ОбластьШапкиТаблицы);
		МассивПроверкиВывода.Добавить(ОбластьПодвалаТаблицы);
		Сумма = 0;
		СуммаНДС = 0;
		ИтогоКоличество = 0;
		НомерСтроки = 0;
		ОбластьСтрокиТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		СоответствиеСтавокНДС = Новый Соответствие;
		
		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
			
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтрокиТаблицы.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			СтрокаТовары.НаименованиеПолное, 
			СтрокаТовары.Характеристика,
			СтрокаТовары.Упаковка,
			,
			);
			ОбластьСтрокиТаблицы.Параметры.Заполнить(СтрокаТовары);
			ОбластьСтрокиТаблицы.Параметры.НомерСтроки = НомерСтроки;
			ОбластьСтрокиТаблицы.Параметры.СуммаБезНДС = СтрокаТовары.Сумма-СтрокаТовары.СуммаНДС;
			ОбластьСтрокиТаблицы.Параметры.Цена=(СтрокаТовары.Сумма-СтрокаТовары.СуммаНДС)/СтрокаТовары.Количество;
			МассивПроверкиВывода.Добавить(ОбластьСтрокиТаблицы);
			
			Если ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
				Если НомерСтроки = 1 Тогда
					ТабличныйДокумент.Вывести(ОбластьШапкиТаблицы);
					МассивПроверкиВывода.Удалить(0);
				КонецЕслИ;
			Иначе
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапкиТаблицы);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокиТаблицы);
			МассивПроверкиВывода.Удалить(МассивПроверкиВывода.ВГраница());
			
			Сумма = Сумма + СтрокаТовары.Сумма;
			СуммаНДС = СуммаНДС + СтрокаТовары.СуммаНДС;
			ИтогоКоличество=ИтогоКоличество+СтрокаТовары.Количество;
			
		КонецЦикла;
		
		// Подвал таблицы "Товары"
		ОбластьПодвалаТаблицы.Параметры.НомерСтроки=НомерСтроки;
		ОбластьПодвалаТаблицы.Параметры.ИтогоСуммаНДС=СуммаНДС;
		ОбластьПодвалаТаблицы.Параметры.ИтогоСумма=Сумма;
		ОбластьПодвалаТаблицы.Параметры.ИтогоСуммаБезНДС=Сумма-СуммаНДС;
		ОбластьПодвалаТаблицы.Параметры.ИтогоКоличество=ИтогоКоличество;
		
		// Вывести Сумму прописью
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%",      ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		если СуммаНДС=0 тогда
			СуммаНДСРуб="";
		иначе
			СуммаНДСРуб=" , в т.ч. НДС - "+ФормированиеПечатныхФорм.ФорматСумм(СуммаНДС, Константы.ВалютаРегламентированногоУчета.Получить());
		конецесли;
		
		ОбластьПодвалаТаблицы.Параметры.СуммаПрописью  = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи,Константы.ВалютаРегламентированногоУчета.Получить())+СуммаНДСРуб;
		ОбластьПодвалаТаблицы.Параметры.Листов=1;
		ТабличныйДокумент.Вывести(ОбластьПодвалаТаблицы);
		
		// Вывести подписи
		Область = Макет.ПолучитьОбласть("ПодвалСпецификации");
		
		Область.Параметры.Поставщик = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "СокращенноеНаименование");
		Область.Параметры.Покупатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата), "СокращенноеНаименование");
		Область.Параметры.Руководитель = ДанныеПечати.Руководитель;
		Область.Параметры.КонтактноеЛицо = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Строка(ДанныеПечати.КонтактноеЛицо));
		
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр=Истина;
КонецПроцедуры

Функция ПечатьАктаПересортицыТоваров(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДопКолонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьДопКолонку = ЗначениеЗаполнено(ДопКолонка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Склад КАК Склад,
	|	Документ.Подразделение КАК Подразделение,
	|	Документ.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Склад) КАК СкладПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Подразделение) КАК ПодразделениеПредставление,
	|	Документ.Организация.НаименованиеСокращенное КАК ОрганизацияПредставление,
	|	Документ.Организация.Префикс КАК Префикс,
	|	Документ.Склад.ТекущийОтветственный КАК Кладовщик,
	|	Документ.Ответственный.ФизическоеЛицо КАК Ответственный,
	|	Документ.ВидЦены КАК ВидЦены
	|ИЗ
	|	Документ.ПересортицаТоваров КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|	И Документ.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК НоменклатураСписание,
	|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК НоменклатураСписаниеПредставление,
	|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаСписаниеПредставление,
	|	ТаблицаТовары.НоменклатураОприходование КАК НоменклатураОприходование,
	|	ТаблицаТовары.НоменклатураОприходование.НаименованиеПолное КАК НоменклатураОприходованиеПредставление,
	|	ТаблицаТовары.ХарактеристикаОприходование.НаименованиеПолное КАК ХарактеристикаОприходованиеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияСписаниеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.НоменклатураОприходование.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияОприходованиеПредставление,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ТаблицаТовары.Цена КАК ЦенаОприходования,
	|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Дата,
	|	ТаблицаТовары.Ссылка.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ТаблицаТовары2
	|ИЗ
	|	Документ.ПересортицаТоваров.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТаблицаТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ТаблицаТовары.Ссылка.ВидЦены = ЦеныНоменклатуры.ВидЦены
	|			И ТаблицаТовары.Характеристика = ЦеныНоменклатуры.Характеристика
	|			И ТаблицаТовары.Ссылка.Дата >= ЦеныНоменклатуры.Период
	|ГДЕ
	|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
	|	И ТаблицаТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Номенклатура.НаименованиеПолное,
	|	ТаблицаТовары.Характеристика.НаименованиеПолное,
	|	ТаблицаТовары.НоменклатураОприходование,
	|	ТаблицаТовары.НоменклатураОприходование.НаименованиеПолное,
	|	ТаблицаТовары.ХарактеристикаОприходование.НаименованиеПолное,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Ссылка,
	|	ТаблицаТовары.Цена,
	|	ТаблицаТовары.Ссылка.ВидЦены,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.НоменклатураОприходование.ЕдиницаИзмерения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары2.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары2.НоменклатураСписание КАК НоменклатураСписание,
	|	ТаблицаТовары2.НоменклатураСписаниеПредставление КАК НоменклатураСписаниеПредставление,
	|	ТаблицаТовары2.ХарактеристикаСписаниеПредставление КАК ХарактеристикаСписаниеПредставление,
	|	ТаблицаТовары2.НоменклатураОприходование КАК НоменклатураОприходование,
	|	ТаблицаТовары2.НоменклатураОприходование.НаименованиеПолное КАК НоменклатураОприходованиеПредставление,
	|	ТаблицаТовары2.ХарактеристикаОприходованиеПредставление КАК ХарактеристикаОприходованиеПредставление,
	|	ТаблицаТовары2.ЕдиницаИзмеренияСписаниеПредставление КАК ЕдиницаИзмеренияСписаниеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары2.НоменклатураОприходование.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияОприходованиеПредставление,
	|	ТаблицаТовары2.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОприходование.КоличествоПриход <> 0
	|			ТОГДА ТаблицаТовары2.Количество * (СебестоимостьТоваровОприходование.СтоимостьПриход + СебестоимостьТоваровОприходование.ДопРасходыПриход) / СебестоимостьТоваровОприходование.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаОприходования,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровСписание.КоличествоРасход <> 0
	|			ТОГДА ТаблицаТовары2.Количество * (СебестоимостьТоваровСписание.СтоимостьРасход + СебестоимостьТоваровСписание.ДопРасходыРасход) / СебестоимостьТоваровСписание.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСписания,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровСписание.КоличествоРасход <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) <> 0
	|						ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ТаблицаТовары2.Количество
	|					ИНАЧЕ ТаблицаТовары2.Количество * (СебестоимостьТоваровСписание.СтоимостьРасход + СебестоимостьТоваровСписание.ДопРасходыРасход) / СебестоимостьТоваровСписание.КоличествоРасход
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ - ТаблицаТовары2.ЦенаОприходования * ТаблицаТовары2.Количество КАК Разница,
	|	СебестоимостьТоваровОприходование.КоличествоРасход КАК КоличествоРасход,
	|	СебестоимостьТоваровСписание.КоличествоПриход КАК КоличествоПриход,
	|	ТаблицаТовары2.Ссылка КАК Ссылка,
	|	ТаблицаТовары2.ЦенаОприходования КАК ЦенаОприходования,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ТаблицаТовары2.Количество КАК СуммаПоВидуЦены,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена
	|ИЗ
	|	ТаблицаТовары2 КАК ТаблицаТовары2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Обороты(, , Регистратор, ) КАК СебестоимостьТоваровОприходование
	|		ПО (СебестоимостьТоваровОприходование.Регистратор = ТаблицаТовары2.Ссылка)
	|			И (СебестоимостьТоваровОприходование.АналитикаУчетаНоменклатуры.Номенклатура = ТаблицаТовары2.НоменклатураОприходование)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Обороты(, , Регистратор, ) КАК СебестоимостьТоваровСписание
	|		ПО (СебестоимостьТоваровСписание.Регистратор = ТаблицаТовары2.Ссылка)
	|			И (СебестоимостьТоваровСписание.АналитикаУчетаНоменклатуры.Номенклатура = ТаблицаТовары2.НоменклатураСписание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТаблицаТовары2.НоменклатураСписание = ЦеныНоменклатуры.Номенклатура
	|			И ТаблицаТовары2.ВидЦены = ЦеныНоменклатуры.ВидЦены
	|			И ТаблицаТовары2.Дата = ЦеныНоменклатуры.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(СуммаОприходования),
	|	СУММА(СуммаСписания),
	|	СУММА(Разница),
	|	СУММА(СуммаПоВидуЦены)
	|ПО
	|	Ссылка";
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	СинонимДокумента = НСтр("ru='Акт о пересортице товаров'");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПересортицаТоваров_АктОПересортицеТоваров";
	
	Макет = ПолучитьМакет("ПФ_MXL_АктОПересортицеТоваровСумма");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьОснование  = Макет.ПолучитьОбласть("Основание");

	ОбластьДанныеШапка              = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ОбластьДанныхСтрока              = Макет.ПолучитьОбласть("Строка");
	
	ОбластьПодвалТаблицы  = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьПодписи        = Макет.ПолучитьОбласть("Подписи");
	ОбластьСуммаПрописью  = Макет.ПолучитьОбласть("СуммаПрописью");
	Областьитог=           Макет.ПолучитьОбласть("Итог");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаПоТабличнымЧастям = РезультатыЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументы.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной.
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаДокументы);
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, СинонимДокумента);
		ОбластьЗаголовок.Параметры.СкладПредставление = СкладыСервер.ПолучитьПредставлениеСклада(ВыборкаДокументы.СкладПредставление);
		ОбластьЗаголовок.Параметры.ОрганизацияПредставление="";
		ОбластьЗаголовок.Параметры.ПодразделениеПредставление="";
		
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		// Вывод шапки.
		ТабДокумент.Вывести(ОбластьДанныеШапка);
		
		СуммаВсего = 0;
		ВсегоНаименований = 0;
		
		// Вывод строк.
		ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаДокументы.Ссылка));
		
		ВыборкаПоСтрокам = ВыборкаПоТабличнымЧастям.Выбрать();
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ОбластьДанныхСтрока .Параметры.Заполнить(ВыборкаПоСтрокам);
			ОбластьДанныхСтрока .Параметры.НоменклатураСписание = ВыборкаПоСтрокам.НоменклатураСписание;
			ОбластьДанныхСтрока .Параметры.НоменклатураСписаниеПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоСтрокам.НоменклатураСписаниеПредставление,
			ВыборкаПоСтрокам.ХарактеристикаСписаниеПредставление);
			ОбластьДанныхСтрока.Параметры.НоменклатураОприходование = ВыборкаПоСтрокам.НоменклатураОприходование;
			ОбластьДанныхСтрока.Параметры.НоменклатураОприходованиеПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоСтрокам.НоменклатураОприходованиеПредставление,
			ВыборкаПоСтрокам.ХарактеристикаОприходованиеПредставление);
			ТабДокумент.Вывести(ОбластьДанныхСтрока);
			ВсегоНаименований = ВсегоНаименований + 1;
			
		КонецЦикла;
		ОбластьИтог.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
		ТабДокумент.Вывести(ОбластьИтог);
		
		// Вывод подвала.
		ТабДокумент.Вывести(ОбластьПодвалТаблицы);
		
		// Вывод Суммы прописью.
		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
		
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", ВсегоНаименований);
		
		ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
		
		ТабДокумент.Вывести(ОбластьСуммаПрописью);
		
		// Вывод подписей.
		ОбластьПодписи.Параметры.Ответственный = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаДокументы.Ответственный);
		ОбластьПодписи.Параметры.Кладовщик = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаДокументы.Кладовщик);		
		ТабДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуПечатьТНСекцииРеализация(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина); 
	ТекстЗапросаПоСвободнымОстаткам =
		"ВЫБРАТЬ
		|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
		|	ЗапасыИПотребностиОстатки.Склад КАК Склад,
		|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК ВНаличииОстаток
		|ПОМЕСТИТЬ ВтСвободныеОстатки
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ЗапасыИПотребностиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыИПотребностиОстатки.Номенклатура,
		|	ЗапасыИПотребностиОстатки.Характеристика,
		|	ЗапасыИПотребностиОстатки.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстатокНаСкладе.Номенклатура КАК Номенклатура,
		|	ОстатокНаСкладе.Характеристика КАК Характеристика,
		|	СУММА(ОстатокНаСкладе.ВНаличииОстаток) КАК ВНаличииОстаток
		|ПОМЕСТИТЬ ВтСвободныеОстаткиПоСкладу
		|ИЗ
		|	ВтСвободныеОстатки КАК ОстатокНаСкладе
		|ГДЕ
		|	ОстатокНаСкладе.Склад = &Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстатокНаСкладе.Номенклатура,
		|	ОстатокНаСкладе.Характеристика" + " ; ";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоСвободнымОстаткам + 
	"ВЫБРАТЬ
	|	Результат.Ссылка КАК Ссылка,
	|	Результат.Дата,
	|	Результат.Номер,
	|	Результат.Организация,
	|	Результат.Партнер,
	|	Результат.Контрагент,
	|	Результат.Номенклатура КАК Номенклатура,
	|	Результат.НоменклатураВес,
	|	Результат.Количество КАК Количество,
	|	Результат.СуммаНДС КАК СуммаНДС,
	|	Результат.Сумма КАК Сумма,
	|	Результат.ЕдиницаЦены,
	|	Результат.Вес КАК Вес,
	|	Результат.Склад КАК Склад,
	|	Результат.Помещение КАК Помещение,
	|	Результат.ПорядокОбходаОсновной,
	|	Результат.ЯчейкаОсновная КАК ЯчейкаОсновная,
	|	Результат.ПорядокОбходаДополнительной,
	|	Результат.ЯчейкаДополнительная,
	|	Результат.ЯчейкаГруппировка,
	|	Результат.НоменклатураСсылка КАК НоменклатураСсылка,
	|	Результат.ВМинус,
	|	Результат.ОсновнаяЯчейкаСортировка КАК ОсновнаяЯчейкаСортировка,
	|	Результат.Характеристика,
	|	Результат.ХарактеристикаСсылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|		РеализацияТоваровУслугТовары.Ссылка.Дата КАК Дата,
	|		РеализацияТоваровУслугТовары.Ссылка.Номер КАК Номер,
	|		РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
	|		РеализацияТоваровУслугТовары.Ссылка.Партнер КАК Партнер,
	|		РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	|		РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК Номенклатура,
	|		СУММА(ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура.Вес, 0)) КАК НоменклатураВес,
	|		СУММА(РеализацияТоваровУслугТовары.КоличествоУпаковок) КАК Количество,
	|		СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
	|		СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|					ИЛИ ЕСТЬNULL(РеализацияТоваровУслугТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|				ТОГДА РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаЦены,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|							ИЛИ ЕСТЬNULL(РеализацияТоваровУслугТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|						ТОГДА РеализацияТоваровУслугТовары.Номенклатура.Вес * РеализацияТоваровУслугТовары.КоличествоУпаковок
	|					ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка.Вес * РеализацияТоваровУслугТовары.КоличествоУпаковок
	|				КОНЕЦ, 0)) КАК Вес,
	|		РеализацияТоваровУслугТовары.Склад КАК Склад,
	|		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток КАК Помещение,
	|		РазмещениеОсновнаяЯчейка.Ячейка.ПорядокОбхода КАК ПорядокОбходаОсновной,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление КАК ЯчейкаОсновная,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.ПорядокОбхода КАК ПорядокОбходаДополнительной,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.Представление КАК ЯчейкаДополнительная,
	|		РазмещениеДополнительнаяЯчейка.Ячейка КАК ЯчейкаГруппировка,
	|		РеализацияТоваровУслугТовары.Номенклатура КАК НоменклатураСсылка,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) <= 0
	|				ТОГДА ""V""
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК ВМинус,
	|		ЕСТЬNULL(РазмещениеОсновнаяЯчейка.Ячейка, ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)) КАК ОсновнаяЯчейкаСортировка,
	|		РеализацияТоваровУслугТовары.Характеристика.НаименованиеПолное КАК Характеристика,
	|		РеализацияТоваровУслугТовары.Характеристика КАК ХарактеристикаСсылка
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	|			ПО (РазмещениеОсновнаяЯчейка.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура)
	|				И РеализацияТоваровУслугТовары.Склад = РазмещениеОсновнаяЯчейка.Склад
	|				И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеДополнительнаяЯчейка
	|			ПО РеализацияТоваровУслугТовары.Номенклатура = РазмещениеДополнительнаяЯчейка.Номенклатура
	|				И РеализацияТоваровУслугТовары.Склад = РазмещениеДополнительнаяЯчейка.Склад
	|				И (РазмещениеДополнительнаяЯчейка.ОсновнаяЯчейка = ЛОЖЬ)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтСвободныеОстатки КАК Остатки
	|			ПО РеализацияТоваровУслугТовары.Номенклатура = Остатки.Номенклатура
	|				И РеализацияТоваровУслугТовары.Характеристика = Остатки.Характеристика
	|				И РеализацияТоваровУслугТовары.Склад = Остатки.Склад
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслугТовары.Ссылка,
	|		РеализацияТоваровУслугТовары.Ссылка.Дата,
	|		РеализацияТоваровУслугТовары.Ссылка.Номер,
	|		РеализацияТоваровУслугТовары.Ссылка.Организация,
	|		РеализацияТоваровУслугТовары.Ссылка.Партнер,
	|		РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	|		РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное,
	|		РеализацияТоваровУслугТовары.Склад,
	|		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток,
	|		РазмещениеОсновнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка,
	|		РеализацияТоваровУслугТовары.Номенклатура,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) <= 0
	|				ТОГДА ""V""
	|			ИНАЧЕ """"
	|		КОНЕЦ,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.Представление,
	|		ЕСТЬNULL(РазмещениеОсновнаяЯчейка.Ячейка, ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)),
	|		РеализацияТоваровУслугТовары.Характеристика,
	|		РеализацияТоваровУслугТовары.Характеристика.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|					ИЛИ ЕСТЬNULL(РеализацияТоваровУслугТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|				ТОГДА РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Дата,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Номер,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Организация,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Партнер,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Контрагент,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.НаименованиеПолное,
	|		ЕСТЬNULL(ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.Вес, 0),
	|		ПередачаТоваровМеждуОрганизациямиТовары.КоличествоУпаковок,
	|		ПередачаТоваровМеждуОрганизациямиТовары.СуммаНДС,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Сумма,
	|		ВЫБОР
	|			КОГДА ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|					ИЛИ ЕСТЬNULL(ПередачаТоваровМеждуОрганизациямиТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|				ТОГДА ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ПередачаТоваровМеждуОрганизациямиТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|							ИЛИ ЕСТЬNULL(ПередачаТоваровМеждуОрганизациямиТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|						ТОГДА ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.Вес * ПередачаТоваровМеждуОрганизациямиТовары.КоличествоУпаковок
	|					ИНАЧЕ ПередачаТоваровМеждуОрганизациямиТовары.Упаковка.Вес * ПередачаТоваровМеждуОрганизациямиТовары.КоличествоУпаковок
	|				КОНЕЦ, 0)),
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Склад,
	|		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток,
	|		РазмещениеОсновнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) <= 0
	|				ТОГДА ""V""
	|			ИНАЧЕ """"
	|		КОНЕЦ,
	|		ЕСТЬNULL(РазмещениеОсновнаяЯчейка.Ячейка, ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)),
	|		ПередачаТоваровМеждуОрганизациямиТовары.Характеристика.НаименованиеПолное,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Характеристика
	|	ИЗ
	|		Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	|			ПО (РазмещениеОсновнаяЯчейка.Номенклатура = ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура)
	|				И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	|				И ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Склад = РазмещениеОсновнаяЯчейка.Склад
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеДополнительнаяЯчейка
	|			ПО ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура = РазмещениеДополнительнаяЯчейка.Номенклатура
	|				И (РазмещениеДополнительнаяЯчейка.ОсновнаяЯчейка = ЛОЖЬ)
	|				И ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Склад = РазмещениеДополнительнаяЯчейка.Склад 
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтСвободныеОстаткиПоСкладу КАК Остатки
	|			ПО ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура = Остатки.Номенклатура
	|				И ПередачаТоваровМеждуОрганизациямиТовары.Характеристика = Остатки.Характеристика
	|	ГДЕ
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка В(&МассивДокументов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Дата,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Номер,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Организация,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Партнер,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Контрагент,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.НаименованиеПолное,
	|		ПередачаТоваровМеждуОрганизациямиТовары.КоличествоУпаковок,
	|		ПередачаТоваровМеждуОрганизациямиТовары.СуммаНДС,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Сумма,
	|		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток,
	|		РазмещениеОсновнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка,
	|		ЕСТЬNULL(ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.Вес, 0),
	|		ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Склад,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) <= 0
	|				ТОГДА ""V""
	|			ИНАЧЕ """"
	|		КОНЕЦ,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление,
	|		ЕСТЬNULL(РазмещениеОсновнаяЯчейка.Ячейка, ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)),
	|		ПередачаТоваровМеждуОрганизациямиТовары.Характеристика,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Характеристика.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|					ИЛИ ЕСТЬNULL(ПередачаТоваровМеждуОрганизациямиТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|				ТОГДА ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ПередачаТоваровМеждуОрганизациямиТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВозвратТоваровОтКлиентаТовары.Ссылка,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Дата,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Номер,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Организация,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Партнер,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Контрагент,
	|		ВозвратТоваровОтКлиентаТовары.Номенклатура.НаименованиеПолное,
	|		СУММА(ЕСТЬNULL(ВозвратТоваровОтКлиентаТовары.Номенклатура.Вес, 0)),
	|		СУММА(ВозвратТоваровОтКлиентаТовары.КоличествоУпаковок),
	|		СУММА(ВозвратТоваровОтКлиентаТовары.СуммаНДС),
	|		СУММА(ВозвратТоваровОтКлиентаТовары.Сумма),
	|		ВЫБОР
	|			КОГДА ВозвратТоваровОтКлиентаТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|					ИЛИ ЕСТЬNULL(ВозвратТоваровОтКлиентаТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|				ТОГДА ВозвратТоваровОтКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ВозвратТоваровОтКлиентаТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВозвратТоваровОтКлиентаТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|							ИЛИ ЕСТЬNULL(ВозвратТоваровОтКлиентаТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|						ТОГДА ВозвратТоваровОтКлиентаТовары.Номенклатура.Вес * ВозвратТоваровОтКлиентаТовары.КоличествоУпаковок
	|					ИНАЧЕ ВозвратТоваровОтКлиентаТовары.Упаковка.Вес * ВозвратТоваровОтКлиентаТовары.КоличествоУпаковок
	|				КОНЕЦ, 0)),
	|		NULL,
	|		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток,
	|		РазмещениеОсновнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка,
	|		ВозвратТоваровОтКлиентаТовары.Номенклатура,
	|		"""",
	|		ЕСТЬNULL(РазмещениеОсновнаяЯчейка.Ячейка, ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)),
	|		ВозвратТоваровОтКлиентаТовары.Характеристика.НаименованиеПолное,
	|		ВозвратТоваровОтКлиентаТовары.Характеристика
	|	ИЗ
	|		Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	|			ПО (РазмещениеОсновнаяЯчейка.Номенклатура = ВозвратТоваровОтКлиентаТовары.Номенклатура)
	|				И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	|				И ВозвратТоваровОтКлиентаТовары.Ссылка.Склад = РазмещениеОсновнаяЯчейка.Склад
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеДополнительнаяЯчейка
	|			ПО ВозвратТоваровОтКлиентаТовары.Номенклатура = РазмещениеДополнительнаяЯчейка.Номенклатура
	|				И (РазмещениеДополнительнаяЯчейка.ОсновнаяЯчейка = ЛОЖЬ)
	|				И ВозвратТоваровОтКлиентаТовары.Ссылка.Склад = РазмещениеДополнительнаяЯчейка.Склад
	|	ГДЕ
	|		ВозвратТоваровОтКлиентаТовары.Ссылка В(&МассивДокументов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозвратТоваровОтКлиентаТовары.Ссылка,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Дата,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Номер,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Организация,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Партнер,
	|		ВозвратТоваровОтКлиентаТовары.Ссылка.Контрагент,
	|		ВозвратТоваровОтКлиентаТовары.Номенклатура.НаименованиеПолное,
	|		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток,
	|		РазмещениеОсновнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка,
	|		ВозвратТоваровОтКлиентаТовары.Номенклатура,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление,
	|		ЕСТЬNULL(РазмещениеОсновнаяЯчейка.Ячейка, ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)),
	|		ВозвратТоваровОтКлиентаТовары.Характеристика,
	|		ВозвратТоваровОтКлиентаТовары.Характеристика.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА ВозвратТоваровОтКлиентаТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|					ИЛИ ЕСТЬNULL(ВозвратТоваровОтКлиентаТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|				ТОГДА ВозвратТоваровОтКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ВозвратТоваровОтКлиентаТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПеремещениеТоваровТовары.Ссылка,
	|		ПеремещениеТоваровТовары.Ссылка.Дата,
	|		ПеремещениеТоваровТовары.Ссылка.Номер,
	|		ПеремещениеТоваровТовары.Ссылка.Организация,
	|		NULL,
	|		NULL,
	|		ПеремещениеТоваровТовары.Номенклатура.НаименованиеПолное,
	|		ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.Вес, 0),
	|		ПеремещениеТоваровТовары.КоличествоУпаковок,
	|		СУММА(0),
	|		СУММА(0),
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваровТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|					ИЛИ ЕСТЬNULL(ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|				ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА ПеремещениеТоваровТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|							ИЛИ ЕСТЬNULL(ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|						ТОГДА ПеремещениеТоваровТовары.Номенклатура.Вес * ПеремещениеТоваровТовары.КоличествоУпаковок
	|					ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.Вес * ПеремещениеТоваровТовары.КоличествоУпаковок
	|				КОНЕЦ, 0)),
	|		ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток,
	|		РазмещениеОсновнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка,
	|		ПеремещениеТоваровТовары.Номенклатура,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) <= 0
	|				ТОГДА ""V""
	|			ИНАЧЕ """"
	|		КОНЕЦ,
	|		ЕСТЬNULL(РазмещениеОсновнаяЯчейка.Ячейка, ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)),
	|		ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное,
	|		ПеремещениеТоваровТовары.Характеристика
	|	ИЗ
	|		Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	|			ПО (РазмещениеОсновнаяЯчейка.Номенклатура = ПеремещениеТоваровТовары.Номенклатура)
	|				И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	|				И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель = РазмещениеОсновнаяЯчейка.Склад
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеДополнительнаяЯчейка
	|			ПО ПеремещениеТоваровТовары.Номенклатура = РазмещениеДополнительнаяЯчейка.Номенклатура
	|				И (РазмещениеДополнительнаяЯчейка.ОсновнаяЯчейка = ЛОЖЬ)
	|				И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель = РазмещениеДополнительнаяЯчейка.Склад   
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтСвободныеОстаткиПоСкладу КАК Остатки
	|			ПО ПеремещениеТоваровТовары.Номенклатура = Остатки.Номенклатура
	|				И ПеремещениеТоваровТовары.Характеристика = Остатки.Характеристика
	|				И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель = Остатки.Склад
	|	ГДЕ
	|		ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПеремещениеТоваровТовары.Ссылка,
	|		ПеремещениеТоваровТовары.Ссылка.Дата,
	|		ПеремещениеТоваровТовары.Ссылка.Номер,
	|		ПеремещениеТоваровТовары.Ссылка.Организация,
	|		ПеремещениеТоваровТовары.Номенклатура.НаименованиеПолное,
	|		ПеремещениеТоваровТовары.КоличествоУпаковок,
	|		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток,
	|		РазмещениеОсновнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление,
	|		РазмещениеДополнительнаяЯчейка.Ячейка.ПорядокОбхода,
	|		РазмещениеДополнительнаяЯчейка.Ячейка,
	|		ПеремещениеТоваровТовары.Номенклатура,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) <= 0
	|				ТОГДА ""V""
	|			ИНАЧЕ """"
	|		КОНЕЦ,
	|		ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.Вес, 0),
	|		ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|		ЕСТЬNULL(РазмещениеОсновнаяЯчейка.Ячейка, ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)),
	|		ПеремещениеТоваровТовары.Характеристика,
	|		ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваровТовары.Номенклатура.ИспользоватьУпаковки = ЛОЖЬ
	|					ИЛИ ЕСТЬNULL(ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения, ИСТИНА) = ИСТИНА
	|				ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		РазмещениеОсновнаяЯчейка.Ячейка.Представление) КАК Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Результат.ОсновнаяЯчейкаСортировка.Код,
	|	Номенклатура,
	|	Склад,
	|	Помещение
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма),
	|	СУММА(Вес)
	|ПО
	|	Ссылка,
	|	Склад,
	|	Помещение,
	|	НоменклатураСсылка";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Запрос.УстановитьПараметр("Период", МассивОбъектов[0].Дата+1);
	Ссылка= МассивОбъектов[0];
	Если ТипЗнч(Ссылка)  = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Склад= Ссылка.СкладОтправитель;
	Иначе 
		Склад= Ссылка.Склад;
	КонецЕсли;
	Запрос.УстановитьПараметр("Склад", Склад);
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Накладная";
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	
	Результат = Запрос.Выполнить();
	Макет = ПолучитьМакет("ПФ_MXL_ПечатьТНСекции");
	ОбластьПолоса=		Макет.ПолучитьОбласть("Полоса");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапки  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвал  = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ОбластьШтрихкода= Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ОбластьШтрихкода.Параметры.Автор= Ссылка.Менеджер;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ЗначениеЗаполнено(Ссылка.Очередь) Тогда
			ОбластьШтрихкода.Параметры.Отдел= Ссылка.Очередь;
		Иначе
			ОбластьШтрихкода.Параметры.Отдел= АльтерраОбщегоНазначения.РассчитатьОчередь(Ссылка);
		КонецЕсли;
	Иначе
		ОбластьШтрихкода.Параметры.Отдел= АльтерраОбщегоНазначения.РассчитатьОчередь(Ссылка);
	КонецЕсли;
	
	Секция7 = Справочники.РабочиеУчастки.НайтиПоНаименованию("Д:Склад № 7");
	ВыдачаВОкно= Ложь;
	ВыдачаВОкно= ПроверитьУсловиявыдачиВОкно(МассивОбъектов[0], Результат, Секция7);
	
	ВыборкаДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() Цикл
		СчетФактура=ПродажиСервер.ПараметрыПредставленияСчетаФактуры(ВыборкаДокумент.Ссылка,ВыборкаДокумент.Ссылка.организация);
		ВыборкаСклад = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			ВыборкаПомещение = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПомещение.Следующий() Цикл
				СуммаИтог=0; Веситог=0;
				
				СекцияДляШК = "";
				Если ЗначениеЗаполнено(ВыборкаПомещение.Помещение) Тогда
					СекцияДляШК = ВыборкаПомещение.Помещение;
				КонецЕсли;
				
				Если ВыдачаВОкно И ВыборкаПомещение.Помещение = Секция7 Тогда
					Секция= "ОКНО";
				Иначе 
					Секция=ВыборкаПомещение.Помещение;
					если не ЗначениеЗаполнено(ВыборкаПомещение.Помещение) тогда
						Секция="";
					конецесли;	
				КонецЕсли;
				Если Не ПервыйДокумент Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ПервыйДокумент    = Ложь;
				НомерСтроки=0;
				если Найти(СТРОКА(ВыборкаСклад.Склад),"Торг")>0 тогда
					ТабличныйДокумент.Вывести(ОбластьПолоса);
				конецесли;	
				
				Если Строка(ВыборкаДокумент.Ссылка.Организация) <> "АСК и ИП" Тогда
					
					ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокумент.Ссылка.Организация, ВыборкаДокумент.Ссылка.Дата), "ПолноеНаименование");
					
				КонецЕсли;
				
				ОбластьЗаголовок.Параметры.ПредставлениеАдреса = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокумент.Ссылка.Организация, ВыборкаДокумент.Ссылка.Дата), "ФактическийАдрес");
				ОбластьЗаголовок.Параметры.ПредставлениеДокумента ="Расходная накладная "+ВыборкаДокумент.Ссылка.Номер+" от "+Формат(ВыборкаДокумент.Ссылка.Дата,"ДФ=""дд ММММ гггг 'г.' """); 
				Если СчетФактура.ТекстСчетФактура<>"Оформить счет-фактуру" Тогда
					ОбластьЗаголовок.Параметры.ПредставлениеПокупателя = "Покупатель: "+ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокумент.Ссылка.Контрагент, ВыборкаДокумент.Ссылка.Дата), "ПолноеНаименование,ФактическийАдрес");
				иначе
					ОбластьЗаголовок.Параметры.ПредставлениеПокупателя = "Покупатель: ___________________________";
				конецесли;
				ОбластьЗаголовок.Параметры.Секция = Секция;
				ВывестиШтрихкодПоСекциям(ТабличныйДокумент, Макет, ОбластьШтрихкода, ВыборкаДокумент.Ссылка, СекцияДляШК);
				ТабличныйДокумент.Вывести(ОбластьЗаголовок);
				
				ТабличныйДокумент.Вывести(ОбластьШапки);
				ВыборкаТовары = ВыборкаПомещение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Сумма=0;СчетСтрок=1;
				ИтогНДС=0;
				КоличествоИтог= 0;
				
				Пока ВыборкаТовары.Следующий() Цикл
					ВыборкаДетали=ВыборкаТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					ВыборкаДетали.Следующий();
					СчетСтрок = СчетСтрок + 1;
					НомерСтроки = НомерСтроки + 1;
					если ВыборкаДетали.ВМинус="" тогда
						ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
					иначе
						ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаМинус");
					конецесли;
					ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
					ОбластьСтрока.Параметры.Заполнить(ВыборкаДетали);
					ОбластьСтрока.Параметры.Товар = СОКРЛП(ВыборкаДетали.Номенклатура);
					ОбластьСтрока.Параметры.Характеристика = СОКРЛП(ВыборкаДетали.Характеристика);
					ОбластьСтрока.Параметры.Цена = ?(ВыборкаДетали.Количество,ВыборкаДетали.Сумма/ВыборкаДетали.Количество,0);
					ОбластьСтрока.Параметры.Количество = ВыборкаДетали.Количество;
					ОбластьСтрока.Параметры.Сумма = ВыборкаДетали.Сумма;
					ОбластьСтрока.Параметры.ЕдиницаЦены = ВыборкаДетали.ЕдиницаЦены;
					ВесИтог = ВесИтог + ЧИСЛО(ВыборкаДетали.Вес);
					СуммаИтог = СуммаИтог+ ВыборкаДетали.Сумма;
					ИтогНДС=ИтогНДС+ВыборкаДетали.СуммаНДС;
					КоличествоИтог= КоличествоИтог+ВыборкаДетали.Количество;
					ДопЯчейки    = "";
					ВыборкаДетали.Сбросить();
					Пока ВыборкаДетали.Следующий() Цикл
						ДопЯчейки = ДопЯчейки + ВыборкаДетали.ЯчейкаДополнительная + Символы.ПС;
					КонецЦикла;
					ОбластьСтрока.Параметры.ДопЯчейки=ДопЯчейки;
					
					ТабличныйДокумент.Вывести(ОбластьСтрока);	
				КонецЦикла;
				Областьподвал.Параметры.Сумма=Суммаитог;
				Областьподвал.Параметры.Вес=Веситог;
				Областьподвал.Параметры.Количество=КоличествоИтог;
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				
				ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
				ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
				
				СуммаНДСРуб=" , в т.ч. НДС - "+ФормированиеПечатныхФорм.ФорматСумм(итогНДС, Константы.ВалютаРегламентированногоУчета.Получить());
				ОбластьПодписи.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки+", на сумму "+ФормированиеПечатныхФорм.ФорматСумм(СуммаИтог, Константы.ВалютаРегламентированногоУчета.Получить())+суммаНДСруб;
				
				ОбластьПодписи.параметры.ВремяПечати=ТекущаяДата();
				ОбластьПодписи.Параметры.СуммаПрописью  = "Сумма: "+РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаИтог,Константы.ВалютаРегламентированногоУчета.Получить());
				ТабличныйДокумент.Вывести(ОбластьПодписи);
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
Функция ПроверитьУсловиявыдачиВОкно(Знач Ссылка, Знач Результат, Секция7)//замена названия секции
	Рез= Истина;
	СекцияТоргзал = Справочники.РабочиеУчастки.НайтиПоНаименованию("Торговый зал (ЦО)");
	СегментОкно= Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Окно ТЗ ЦО");
	
	ТЗТовара= Ссылка.Товары.Выгрузить();
	ТЗТовара.Свернуть("Номенклатура");
	
	//Условия
	//1. Номенклатура 7 секции не в сегменте. 
	//2. В Реализации только одна 7я секция (рабочий участок). 
	//3. Общий вес документа по 7ой секции <= 20 кг. 
	
	//1.
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Товар.Номенклатура
	|ПОМЕСТИТЬ ВТ_Товар
	|ИЗ
	|	&ТЗТовара КАК Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураСегмента.Сегмент,
	|	НоменклатураСегмента.Номенклатура,
	|	НоменклатураСегмента.Характеристика
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|ГДЕ
	|	НоменклатураСегмента.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТ_Товар.Номенклатура
	|			ИЗ
	|				ВТ_Товар)
	|	И НоменклатураСегмента.Сегмент = &Сегмент";
	Запрос.УстановитьПараметр("Сегмент", СегментОкно);
	Запрос.УстановитьПараметр("ТЗТовара", ТЗТовара);
	ВыборкаСекции= Запрос.Выполнить().Выбрать();
	Если ВыборкаСекции.Следующий() Тогда
		Возврат Ложь
	Иначе
		Рез= Рез И Истина;
	КонецЕсли;
	
	//2. 3.
	ВесИтог= 0;
	КолПозиций= 0;
	мСекций= Новый Массив;
	//2.
	ВыборкаПомещение= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Помещение");
	Пока ВыборкаПомещение.Следующий() Цикл
		мСекций.Добавить(ВыборкаПомещение.Помещение);
		ВыборкаДетали= ВыборкаПомещение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаПомещение.Помещение = Секция7 Тогда
			Пока ВыборкаДетали.Следующий() Цикл
				ВесИтог = ВесИтог + ЧИСЛО(ВыборкаДетали.Вес);
				КолПозиций= КолПозиций+1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	ВыборкаДетали.Сбросить();
	ВыборкаПомещение.Сбросить();
	
	Если ВесИтог <= 20 Тогда
		Рез= Рез И Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	//3.
	Если мСекций.Количество() = 1 Тогда
		Если мСекций[0] = Секция7 Тогда
			Рез= Рез И Истина;	
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли мСекций.Количество() = 2 Тогда 
		Если мСекций.Найти(Секция7) <> Неопределено И мСекций.Найти(СекцияТоргзал) <> Неопределено Тогда
			Рез= Рез И Истина;	
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
	Возврат Рез;
КонецФункции

// Функция формирует печатную форму Расходная Накладная документа.
Функция СформироватьПечатнуюФормуТоварногоЧека(МассивОбъектов, ОбъектыПечати,ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ссылка= МассивОбъектов[0];
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_РасходнаяНакладная";
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	ИспользоватьУпаковки             = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	
	ЗапросПоСкладам = Новый Запрос;
	ЭтоРеализация = ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.РеализацияТоваровУслуг");
		ЗапросПоСкладам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                        |	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		                        |	РеализацияТоваровУслугТовары.Склад КАК Склад,
		                        |	РеализацияТоваровУслугТовары.Склад.ИспользоватьСерииНоменклатуры КАК ИспользоватьСерииНоменклатуры
		                        |ИЗ
		                        |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		                        |ГДЕ
		                        |	РеализацияТоваровУслугТовары.Ссылка В(&МассивОбъектов)
		                        |	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		                        |
		                        |ОБЪЕДИНИТЬ ВСЕ
		                        |
		                        |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                        |	ЧекККМТовары.Ссылка,
		                        |	ЧекККМТовары.Ссылка.Склад,
		                        |	ЧекККМТовары.Ссылка.Склад.ИспользоватьСерииНоменклатуры
		                        |ИЗ
		                        |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		                        |ГДЕ
		                        |	ЧекККМТовары.Ссылка В(&МассивОбъектов)
		                        |	И ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		                        |
		                        |УПОРЯДОЧИТЬ ПО
		                        |	Ссылка
		                        |ИТОГИ ПО
		                        |	ИспользоватьСерииНоменклатуры";
	ЗапросПоСкладам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	// Создание массива для проверки: какие из докуметов не попали в выборку
	МассивПроверки = Новый Массив;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		МассивПроверки.Добавить(Ссылка);
	КонецЦикла;
	
	ДеревоОбъектов = ЗапросПоСкладам.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого ИспользованиеСерий Из ДеревоОбъектов.Строки Цикл
		
				//-
				ТекстЗапросаПоТоварам = 
				"ВЫБРАТЬ
				|	Товары.Ссылка КАК Ссылка,
				|	Товары.Ссылка.Организация КАК Организация,
				|	Товары.Ссылка.Контрагент КАК Контрагент,
				|	Товары.Ссылка.Номер КАК Номер,
				|	Товары.Ссылка.Дата КАК Дата,
				|	Товары.Ссылка.Организация.Префикс КАК Префикс,
				|	Товары.Склад КАК Склад,
				|	ВЫБОР
				|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|			ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
				|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка.ЕдиницаИзмерения)
				|	КОНЕЦ КАК ПредставлениеЕдининицыИзмеренияУпаковки,
				|	ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
				|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
				|	Товары.Количество КАК Количество,
				|	Товары.Номенклатура.Код КАК Код,
				|	Товары.Номенклатура.Артикул КАК Артикул,
				|	Товары.Номенклатура.НаименованиеПолное КАК Номенклатура,
				|	Товары.Характеристика.НаименованиеПолное КАК Характеристика,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(Товары.Упаковка.Коэффициент, 1) = 1
				|			ТОГДА НЕОПРЕДЕЛЕНО
				|		ИНАЧЕ Товары.Упаковка.Наименование
				|	КОНЕЦ КАК Упаковка,
				|	"""" КАК Серия,
				|	Товары.СуммаСНДС + Товары.СуммаСНДС * Товары.Распределять * ВЫБОР
				|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
				|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК Сумма,
				|	Товары.СуммаНДС + Товары.СуммаНДС * Товары.Распределять * ВЫБОР
				|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
				|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК СуммаНДС,
				|	Товары.СуммаАвтоматическойСкидки + Товары.СуммаРучнойСкидки КАК СуммаСкидки
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СУММА(ВЫБОР
				|					КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
				|						ТОГДА РеализацияТоваровУслугТовары.Сумма
				|					ИНАЧЕ 0
				|				КОНЕЦ) КАК СуммаУслуг,
				|			СУММА(ВЫБОР
				|					КОГДА РеализацияТоваровУслугТовары.Распределять = 1
				|						ТОГДА РеализацияТоваровУслугТовары.Сумма
				|					ИНАЧЕ 0
				|				КОНЕЦ) КАК СуммаТоваров,
				|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
				|		ИЗ
				|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|		
				|		СГРУППИРОВАТЬ ПО
				|			РеализацияТоваровУслугТовары.Ссылка) КАК РаспределениеУслуг
				|		ПО Товары.Ссылка = РаспределениеУслуг.Ссылка
				|ГДЕ
				|	Товары.Ссылка В(&МассивОбъектов)
				|	И Товары.Склад В(&МассивСкладов)
				|	И ВЫБОР
				|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
				|				ТОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	Товары.Ссылка,
				|	Товары.Ссылка.Организация,
				|	Товары.Ссылка.Партнер,
				|	Товары.Ссылка.Номер,
				|	Товары.Ссылка.Дата,
				|	Товары.Ссылка.Организация.Префикс,
				|	Товары.Ссылка.Склад,
				|	ВЫБОР
				|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
				|			ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
				|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка.ЕдиницаИзмерения)
				|	КОНЕЦ,
				|	ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения),
				|	Товары.КоличествоУпаковок,
				|	Товары.Количество,
				|	Товары.Номенклатура.Код,
				|	Товары.Номенклатура.Артикул,
				|	Товары.Номенклатура.НаименованиеПолное,
				|	Товары.Характеристика.НаименованиеПолное,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(Товары.Упаковка.Коэффициент, 1) = 1
				|			ТОГДА НЕОПРЕДЕЛЕНО
				|		ИНАЧЕ Товары.Упаковка.Наименование
				|	КОНЕЦ,
				|	"""",
				|	Товары.Сумма + Товары.Сумма * Товары.Распределять * ВЫБОР
				|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
				|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
				|		ИНАЧЕ 0
				|	КОНЕЦ,
				|	Товары.СуммаНДС + Товары.СуммаНДС * Товары.Распределять * ВЫБОР
				|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
				|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
				|		ИНАЧЕ 0
				|	КОНЕЦ,
				|	Товары.СуммаАвтоматическойСкидки + Товары.СуммаРучнойСкидки
				|ИЗ
				|	Документ.ЧекККМ.Товары КАК Товары
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СУММА(ВЫБОР
				|					КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
				|						ТОГДА ЧекККМТовары.Сумма
				|					ИНАЧЕ 0
				|				КОНЕЦ) КАК СуммаУслуг,
				|			СУММА(ВЫБОР
				|					КОГДА ЧекККМТовары.Распределять = 1
				|						ТОГДА ЧекККМТовары.Сумма
				|					ИНАЧЕ 0
				|				КОНЕЦ) КАК СуммаТоваров,
				|			ЧекККМТовары.Ссылка КАК Ссылка
				|		ИЗ
				|			Документ.ЧекККМ.Товары КАК ЧекККМТовары
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ЧекККМТовары.Ссылка) КАК РаспределениеУслуг
				|		ПО Товары.Ссылка = РаспределениеУслуг.Ссылка
				|ГДЕ
				|	Товары.Ссылка В(&МассивОбъектов)
				|	И ВЫБОР
				|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
				|				ТОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|
				|УПОРЯДОЧИТЬ ПО
				|	Ссылка,
				|	Склад
				|ИТОГИ ПО
				|	Ссылка";
		
		ЗапросПоТоварам = Новый Запрос;
		ЗапросПоТоварам.Текст = ТекстЗапросаПоТоварам;
		ЗапросПоТоварам.УстановитьПараметр("МассивОбъектов", ИспользованиеСерий.Строки.ВыгрузитьКолонку("Ссылка"));
		ЗапросПоТоварам.УстановитьПараметр("МассивСкладов",  ИспользованиеСерий.Строки.ВыгрузитьКолонку("Склад"));
		
		ПервыйДокумент = Истина;
		
		Макет = ПолучитьМакет("ПФ_MXL_ТоварныйЧек");
		
		
		РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс, Представление");
		
		ДанныеПечати = ЗапросПоТоварам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ДанныеПечати.Следующий() Цикл
			
			МассивПроверки.Удалить(МассивПроверки.Найти(ДанныеПечати.Ссылка));
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ДанныеПечати);
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			
			ТелефонСклада="";
			Если ЭтоРеализация Тогда
				если  значениезаполнено(ДанныеПечати.Ссылка.Склад) тогда
					складДокумента=ДанныеПечати.Ссылка.Склад;
					если не складДокумента.ЭтоГруппа тогда 
						для каждого стр из складДокумента.КонтактнаяИнформация цикл
							если значениезаполнено(стр.НомерТелефона) тогда
								телефонСклада=стр.НомерТелефона;
								прервать;
							конецесли;
						конеццикла;	
					конецесли;
				конецесли;
			конецесли;

			Область = Макет.ПолучитьОбласть("Поставщик");
			Область.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование")+?(не пустаяСтрока(ТелефонСклада)," ,тел."+ТелефонСклада,"");
			Область.Параметры.ПредставлениеАдреса = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ФактическийАдрес");
			
			Область.Параметры.ПредставлениеДокумента="к накладной "+РеквизитыДокумента.Номер+" от "+Формат(РеквизитыДокумента.Дата,"ДФ=""дд ММММ гггг 'г.' """);
			БезНалогаТекст=?(ДанныеПечати.Ссылка.НалогообложениеНДС=Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС,"Без налога НДС","");
			Область.Параметры.Безналога=БезНалогаТекст;
			
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, Область, ДанныеПечати.Ссылка);
			Область.Параметры.НомерОчереди = ""+Ссылка.Очередь+Прав(СокрЛП(ДанныеПечати.Ссылка.Номер),3);
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(Область);
			СчетСтрок = 1;
			ВыборкаПоТоварам = ДанныеПечати.Выбрать();
			КоличествоСтрок = ВыборкаПоТоварам.Количество();
			Сумма=0;
			ИтогНДС=0;
			СуммаСкидки=0;
			СуммаБезСкидки=0;
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Пока ВыборкаПоТоварам.Следующий() Цикл
				Область.Параметры.НомерСтроки = СчетСтрок;
				РаспределитьТранспортные = Ложь;
				Если ЭтоРеализация Тогда
					РаспределитьТранспортные = ДанныеПечати.Ссылка.РаспределитьТранспортные
				КонецЕсли;
				Если  КоличествоСтрок = СчетСтрок И РаспределитьТранспортные Тогда
					ПоследняяСумма=ДанныеПечати.Ссылка.Товары.ИТОГ("Сумма")-Сумма;
					Область.Параметры.Сумма=ПоследняяСумма;
					ИтогНДС=ДанныеПечати.Ссылка.Товары.ИТОГ("СуммаНДС");
					Сумма=ДанныеПечати.Ссылка.Товары.ИТОГ("Сумма");
					Область.Параметры.Цена = ?(ВыборкаПоТоварам.Количество,ПоследняяСумма/ВыборкаПоТоварам.Количество,0);
					
				иначе	
					Область.Параметры.Сумма = ВыборкаПоТоварам.Сумма;
					Сумма          = Сумма          + ВыборкаПоТоварам.Сумма;
					ИтогНДС          = ИтогНДС          + ВыборкаПоТоварам.СуммаНДС;
					Область.Параметры.Цена = ?(ВыборкаПоТоварам.Количество,ВыборкаПоТоварам.Сумма/ВыборкаПоТоварам.Количество,0);
				конецесли;
				СчетСтрок = СчетСтрок + 1;
				СуммаСкидки          = СуммаСкидки          + ВыборкаПоТоварам.СуммаСкидки;
				
				стрТовар= СокрЛП(ВыборкаПоТоварам.Номенклатура);
				Если ЗначениеЗаполнено(ВыборкаПоТоварам.Характеристика) Тогда
					стрТовар= стрТовар+", "+ СокрЛП(ВыборкаПоТоварам.Характеристика);
				КонецЕсли;
				
				Область.Параметры.Товар = стрТовар;
				
				Область.Параметры.Количество = ВыборкаПоТоварам.КоличествоУпаковок;
				Область.Параметры.ЕдиницаЦены = ВыборкаПоТоварам.ПредставлениеЕдининицыИзмеренияУпаковки;
				
				ТабличныйДокумент.Вывести(Область);	
				
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Линия");
			ТабличныйДокумент.Вывести(Область);	

			// Бонусные баллы
			Если Ссылка.ОплатаБаллами Тогда
				Область = Макет.ПолучитьОбласть("ПодвалБонусы");	
				Область.Параметры.СуммаОплатыБаллами= Ссылка.СуммаОплатыБаллами; 
				Область.Параметры.СуммаСкидки = СуммаСкидки;
				СуммаБезСкидки= Сумма+СуммаСкидки;
				Область.Параметры.СуммаБезСкидки = СуммаБезСкидки;
				ТабличныйДокумент.Вывести(Область);
			КонецЕсли;
			
			//Подвал Итого
			Область = Макет.ПолучитьОбласть("ПодвалТаблицы");
			Область.Параметры.Всего = Сумма;
			ТабличныйДокумент.Вывести(Область);
			ВыводитьСкидки = ?(ПараметрыПечати.Свойство("ВыводитьСкидки"), ПараметрыПечати.ВыводитьСкидки, Ложь);
			если ВыводитьСкидки И Не Ссылка.ОплатаБаллами тогда
				если СуммаСкидки<>0 тогда
					Область = Макет.ПолучитьОбласть("ПодвалСкидки");	
					Область.Параметры.СуммаСкидки = СуммаСкидки;
					ТабличныйДокумент.Вывести(Область);
				конецесли;
			конецесли;
			
			СуммаКПрописи = Сумма;
			Область = Макет.ПолучитьОбласть("СуммаПрописью");
			ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
			ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
			Область.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
			
			если ИтогНДС=0 тогда
				СуммаНДСРуб="";
			иначе
				СуммаНДСРуб=" , в т.ч. НДС - "+ФормированиеПечатныхФорм.ФорматСумм(итогНДС, Константы.ВалютаРегламентированногоУчета.Получить());
			конецесли;
			Область.Параметры.СуммаПрописью  = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи,Константы.ВалютаРегламентированногоУчета.Получить())+СуммаНДСРуб;
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Подписи");
			ТабличныйДокумент.Вывести(Область);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Ссылка Из МассивПроверки Цикл
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'В документе %1 отсутствуют товары. Печать расходной накладной не требуется.'"),
		Ссылка
		);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		Текст,
		Ссылка
		);
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ПараметрыПечати.Свойство("ИмяПринтера") Тогда
		ТабличныйДокумент.ИмяПринтера= ПараметрыПечати.ИмяПринтера;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьВнутреннееПотреблениеТоваровСумма(МассивОбъектов, ОбъектыПечати)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка КАК Ссылка,
	|	ВнутреннееПотреблениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ВнутреннееПотреблениеТоваровТовары.Характеристика КАК Характеристика,
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка.Дата,
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка.Номер,
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка.Склад,
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка.Организация,
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка.Подразделение,
	|	ВнутреннееПотреблениеТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ВнутреннееПотреблениеТоваровТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ВнутреннееПотреблениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ВнутреннееПотреблениеТоваровТовары.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ВнутреннееПотреблениеТоваровТовары.Упаковка)
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОбороты.КоличествоРасход <> 0
	|			ТОГДА ВнутреннееПотреблениеТоваровТовары.КоличествоУпаковок * (СебестоимостьТоваровОбороты.СуммаДопРасходовПриход + СебестоимостьТоваровОбороты.СтоимостьРасход) / СебестоимостьТоваровОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка.Комментарий
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(, , Регистратор, ) КАК СебестоимостьТоваровОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|		ПО СебестоимостьТоваровОбороты.Регистратор = ВнутреннееПотреблениеТоваровТовары.Ссылка
	|			И СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура = ВнутреннееПотреблениеТоваровТовары.Номенклатура
	|ГДЕ
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВнутреннееПотреблениеТоваров";
	
	Результат = Запрос.Выполнить();
	
	Макет = ПолучитьМакет("ПФ_MXL_ВнутреннееПотреблениеТоваровСумма");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
	
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	СинонимДокумента = Метаданные.Документы.ВнутреннееПотреблениеТоваров.Синоним;
	
	ПервыйДокумент = Истина;
	
	ВыборкаДокументы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаДокументы);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, СинонимДокумента);
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		ТабДокумент.Вывести(ОбластьЗаголовок);
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ВыборкаНоменклатура = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ИтогоСумма=0;
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ВыборкаСтроки = ВыборкаНоменклатура.Выбрать();
			
			Пока ВыборкаСтроки.Следующий() Цикл
				ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
				ИтогоСумма=ИтогоСумма+ВыборкаСтроки.Сумма;
				ОбластьСтрока.Параметры.Номенклатура = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				ВыборкаСтроки.Номенклатура,
				ВыборкаСтроки.Характеристика
				);
				
				ТабДокумент.Вывести(ОбластьСтрока);
				
			КонецЦикла;
		КонецЦикла;  
		
		// Вывод подвала.
		ОбластьИтогоСумма       = Макет.ПолучитьОбласть("ИтогоСумма");
		ОбластьИтогоСумма.Параметры.ИтогоСумма=ИтогоСумма;
		ТабДокумент.Вывести(ОбластьИтогоСумма);
		
		ТабДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПечатьАктаПриемаПередачи(МассивОбъектов, ОбъектыПечати)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.Дата КАК ДатаСоставления,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.Номер КАК НомерДокумента,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.Организация КАК Организация,
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ВозвратТоваровОтКлиентаТовары.КоличествоУпаковок КАК Количество,
	|	ВозвратТоваровОтКлиентаТовары.Цена КАК Цена,
	|	ВозвратТоваровОтКлиентаТовары.СуммаСНДС КАК Сумма,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка КАК Ссылка,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.Контрагент,
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдИзм,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.СуммаДокумента,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.ДокументРеализации,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.ДокументРеализации.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.ДокументРеализации.Номер КАК ДоговорНомер,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.ДокументРеализации.Дата КАК ДоговорДата,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.НомерПретензии КАК ПретензияНомер,
	|	ВозвратТоваровОтКлиентаТовары.Ссылка.ДатаПретензии КАК ПретензияДата
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
	|ГДЕ
	|	ВозвратТоваровОтКлиентаТовары.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка,
	|	Цена";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВнутреннееПотреблениеТоваров";
	
	Результат = Запрос.Выполнить();
	
	Макет = ПолучитьМакет("ПФ_MXL_АктПриемаПередачиТМЦНаХранение");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодписи   = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	
	ПервыйДокумент = Истина;
	
	ВыборкаДокументы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		если ЗначениеЗаполнено(ВыборкаДокументы.ДокументРеализации) тогда
			ОбластьЗаголовок.Параметры.ПредставлениеПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.ДатаСоставления,,ВыборкаДокументы.БанковскийСчетОрганизации), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
		иначе
			ОбластьЗаголовок.Параметры.ПредставлениеПокупателя = "ООО ""Альтерра"", ИНН 2208015955, 658083, Алтайский край, Новоалтайск г, Дорожная ул, дом № 42/1, р/с 40702810702630003300, в банке ОТДЕЛЕНИЕ N 8644 СБЕРБАНКА РОССИИ, БИК 040173604, к/с 30101810200000000604";
		конецесли;
		ОбластьЗаголовок.Параметры.РеквизитыДоговора="Документ основание № "+?(ЗначениеЗаполнено(ВыборкаДокументы.ДоговорНомер),СОКРЛП(ВыборкаДокументы.ДоговорНомер),"_______")+" от "+?(ЗначениеЗаполнено(ВыборкаДокументы.ДоговорДата),ФОРМАТ(ВыборкаДокументы.ДоговорДата,"ДЛФ=ДД"),"""___"" ___________ 20___г.");
		ОбластьЗаголовок.Параметры.РеквизитыПретензии="Претензия № "+?(ЗначениеЗаполнено(ВыборкаДокументы.ПретензияНомер),СОКРЛП(ВыборкаДокументы.ПретензияНомер),"_______")+" от "+?(ЗначениеЗаполнено(ВыборкаДокументы.ПретензияДата),ФОРМАТ(ВыборкаДокументы.ПретензияДата,"ДЛФ=ДД"),"""___"" ___________ 20___г.");
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Контрагент, ВыборкаДокументы.ДатаСоставления), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		ОбластьЗаголовок.Параметры.ДатаСоставления=Формат(ВыборкаДокументы.ДатаСоставления, "ДЛФ=D");
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		НомерПП=0;
		ВыборкаНоменклатура = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ВыборкаСтроки = ВыборкаНоменклатура.Выбрать();
			Пока ВыборкаСтроки.Следующий() Цикл
				НомерПП=НомерПП+1;
				ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
				ОбластьСтрока.Параметры.НомерПП=НомерПП;
				ТабДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
		КонецЦикла;

		ОбластьПодписи.Параметры.Заполнить(ВыборкаДокументы);
		
		ТабДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПечатьАктаОВозвратеТМЦ(МассивОбъектов, ОбъектыПечати)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка.Дата КАК ДатаСоставления,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер КАК НомерДокумента,
	|	РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.КоличествоУпаковок КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.СуммаСНДС КАК Сумма,
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдИзм,
	|	РеализацияТоваровУслугТовары.Ссылка.СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка,
	|	Цена";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВнутреннееПотреблениеТоваров";
	
	Результат = Запрос.Выполнить();
	
	Макет = ПолучитьМакет("ПФ_MXL_АктОВозвратеТМЦПереданныхНаХранение");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодписи   = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	
	ПервыйДокумент = Истина;
	
	ВыборкаДокументы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Контрагент, ВыборкаДокументы.ДатаСоставления), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		ОбластьЗаголовок.Параметры.ДатаСоставления=Формат(ВыборкаДокументы.ДатаСоставления, "ДЛФ=D");
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		НомерПП=0;
		ВыборкаНоменклатура = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ВыборкаСтроки = ВыборкаНоменклатура.Выбрать();
			Пока ВыборкаСтроки.Следующий() Цикл
				НомерПП=НомерПП+1;
				ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
				ОбластьСтрока.Параметры.НомерПП=НомерПП;
				ТабДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
		КонецЦикла;
		
		ОбластьПодписи.Параметры.Заполнить(ВыборкаДокументы);
		
		ТабДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПечатьДоставкаТоваров(МассивОбъектов, ОбъектыПечати)
	
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("ПФ_MXL_ДоставкаТоваров");
	ТабДок = Новый ТабличныйДокумент;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка.Контрагент КАК Контрагент,
	|	Товары.Ссылка.ТелефонКлиента КАК ТелефонКлиента,
	|	Товары.Ссылка.ПрибытиеНаОтгрузку КАК ПрибытиеНаОтгрузку,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдИзм,
	|	Товары.Цена,
	|	СУММА(Товары.СуммаСНДС + Товары.СуммаСНДС * Товары.Распределять * ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	Товары.Ссылка.Партнер,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА Товары.Номенклатура.Вес * Товары.КоличествоУпаковок
	|			ИНАЧЕ Товары.КоличествоУпаковок * Товары.Упаковка.Вес
	|		КОНЕЦ) КАК Вес,
	|	СУММА(Товары.СуммаНДС + Товары.СуммаНДС * Товары.Распределять * ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДС,
	|	Товары.Ссылка.Дата КАК Дата,
	|	Товары.Ссылка.АдресДоставки,
	|	Товары.Ссылка.Водитель КАК Перевозчик,
	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаСкидки
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА РеализацияТоваровУслугТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаУслуг,
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Распределять = 1
	|						ТОГДА РеализацияТоваровУслугТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаТоваров,
	|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугТовары.Ссылка) КАК РаспределениеУслуг
	|		ПО Товары.Ссылка = РаспределениеУслуг.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	Товары.Ссылка.Контрагент,
	|	Товары.НомерСтроки,
	|	Товары.Номенклатура,
	|	Товары.КоличествоУпаковок,
	|	Товары.Цена,
	|	Товары.Ссылка.Партнер,
	|	Товары.Ссылка.Дата,
	|	Товары.Ссылка.АдресДоставки,
	|	Товары.Ссылка.ТелефонКлиента,
	|	Товары.Ссылка.ПрибытиеНаОтгрузку,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	Товары.Ссылка.Водитель,
	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Документ КАК Документ,
	|	ВТ_Товары.Контрагент,
	|	ВТ_Товары.ТелефонКлиента,
	|	ВТ_Товары.ПрибытиеНаОтгрузку,
	|	ВТ_Товары.НомерСтроки,
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.КоличествоУпаковок,
	|	ВТ_Товары.ЕдИзм,
	|	ВТ_Товары.Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Товары.Партнер,
	|	ВТ_Товары.Вес КАК Вес,
	|	ВТ_Товары.СуммаНДС КАК СуммаНДС,
	|	ВТ_Товары.Дата,
	|	ВТ_Товары.АдресДоставки,
	|	ВТ_Товары.Перевозчик,
	|	0 КАК ДоляУслуг,
	|	ВТ_Товары.СуммаСкидки
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(Вес),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ,
	|	Документ";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("Подвал");
	ОбластьСсылка = Макет.ПолучитьОбласть("Заголовок");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();	
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	ПервыйДокумент = Истина;
	
	ВыборкаСсылка = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		ОбластьСсылка.Параметры.Заполнить(ВыборкаСсылка);
		
		Ссылка= ВыборкаСсылка.Документ;
		ОбластьСсылка.Параметры.Контрагент= Ссылка.ФИОКлиента;
		ОбластьСсылка.Параметры.АдресДоставки= Ссылка.АдресДоставки;
		ОбластьСсылка.Параметры.Перевозчик= Ссылка.Перевозчик;
		ОбластьСсылка.Параметры.ПрибытиеНаОтгрузку= Ссылка.ПрибытиеНаОтгрузку;
		ОбластьСсылка.Параметры.ТелефонКлиента= Ссылка.ТелефонКлиента;
		
		ТабДок.Вывести(ОбластьСсылка, ВыборкаСсылка.Уровень());
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		СчетСтрок=1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СчетСтрок=СчетСтрок+1;
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
		
		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
		ОбластьОбщийИтог.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
		
		если ВыборкаСсылка.СуммаНДС=0 тогда
			СуммаНДСРуб="";
		иначе
			СуммаНДСРуб=" , в т.ч. НДС - "+ФормированиеПечатныхФорм.ФорматСумм(ВыборкаСсылка.СуммаНДС, Константы.ВалютаРегламентированногоУчета.Получить());
		конецесли;
		ОбластьОбщийИтог.Параметры.СуммаПрописью  = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ВыборкаСсылка.Сумма,Константы.ВалютаРегламентированногоУчета.Получить())+СуммаНДСРуб;
		ОбластьОбщийИтог.Параметры.ВремяДоставки=ТекущаяДата();
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());
		
		
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	возврат ТабДок;
КонецФункции

Функция ПервичныйИнтерес(Партнер, ТолькоПартнер = Ложь)
	
	Интерес = Новый Структура("ИсточникПервичногоИнтереса, Сделка");
	Интерес.Вставить(
	"КаналПервичногоИнтереса",
	ПланыВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка()
	);
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса,
	|	ИсточникиПервичногоИнтереса.ИсточникПервичногоИнтереса,
	|	ИсточникиПервичногоИнтереса.Сделка
	|ИЗ
	|	РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
	|ГДЕ
	|	ИсточникиПервичногоИнтереса.Партнер = &Партнер";
	
	Если ТолькоПартнер Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ИсточникиПервичногоИнтереса.Сделка = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)";
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникиПервичногоИнтереса.Сделка.ДатаНачала";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Партнер", Партнер.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Интерес.КаналПервичногоИнтереса		= Выборка.КаналПервичногоИнтереса;
		Интерес.ИсточникПервичногоИнтереса	= Выборка.ИсточникПервичногоИнтереса;
		Интерес.Сделка						= Выборка.Сделка;
	КонецЕсли;
	
	Возврат Интерес;
	
КонецФункции

Функция ПечатьЛистаСогласования(МассивОбъектов,ОбъектыПечати)
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("ПФ_MXL_ЛистСогласования");
	ТабДок = Новый ТабличныйДокумент;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Партнер,
	|	РеализацияТоваровУслуг.Менеджер,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Договор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|ИТОГИ ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ОбластьСсылка = Макет.ПолучитьОбласть("Заголовок");
	
	ТабДок.Очистить();
	ТабДок.НачатьАвтогруппировкуСтрок();
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();		
	ПервыйДокумент = Истина;
	
	ВыборкаСсылка = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		ОбластьСсылка.Параметры.Покупатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаСсылка.Контрагент, ВыборкаСсылка.Дата), "ПолноеНаименование,ИНН");
		ОбластьСсылка.Параметры.Заголовок="Лист согласования на отпуск товара покупателю № ___________ от "+ФОРМАТ(ВыборкаСсылка.Дата,"ДЛФ=D");
		СчетФактура=ПродажиСервер.ПараметрыПредставленияСчетаФактуры(ВыборкаСсылка.Ссылка,);
		Если СчетФактура.ТекстСчетФактура<>"Создать счет-фактуру" Тогда
			ОбластьСсылка.Параметры.ТекстСчетФактуры=СчетФактура.ТекстСчетФактура;
		конецесли;
		ОбластьСсылка.Параметры.ТекстАвтора="Автор документа: "+ВыборкаСсылка.Менеджер;
		
		ОбластьСсылка.Параметры.Задолженность=Задолженность(ВыборкаСсылка.Договор,ВыборкаСсылка.Ссылка);
		ОбластьСсылка.Параметры.СуммаДокумента=ВыборкаСсылка.Ссылка.СуммаДокумента;
		
		ТабДок.Вывести(ОбластьСсылка, ВыборкаСсылка.Уровень());
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	возврат ТабДок;
КонецФункции

Функция Задолженность(Договор,Ссылка)
	Суммадолга=0;
	
	СоставРеквизитов = "
	|ОграничиватьСуммуЗадолженности,
	|ДопустимаяСуммаЗадолженности,
	|ВалютаВзаиморасчетов,
	|ЗапрещаетсяПросроченнаяЗадолженность";
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, СоставРеквизитов);
	Иначе
		ДанныеДоговора = Новый Структура(СоставРеквизитов, Ложь, 0, Неопределено, Ложь);
		
	КонецЕсли;
	
	Если ДанныеДоговора.ОграничиватьСуммуЗадолженности Тогда
		СуммаДолга =- ОстатокДопустимогоКредита(Договор, ДанныеДоговора.ДопустимаяСуммаЗадолженности);
	иначе
		СостояниеРасчетов=Новый Структура("СуммаДолга");
		Документы.РеализацияТоваровУслуг.РассчитатьСостояние(
		Ссылка,
		Договор,СостояниеРасчетов);
		СуммаДолга=СостояниеРасчетов.СуммаДолга;
		
	КонецЕсли;  
	
	возврат СуммаДолга;
КонецФункции
Функция ОстатокДопустимогоКредита(Договор, ДопустимыйКредит)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(ТекстЗапросаОбъектыРасчетов() + "
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.СуммаОстаток КАК ОстатокДолга
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|		,
	|		ЗаказКлиента В (ВЫБРАТЬ ОбъектРасчетов ИЗ ОбъектыРасчетов)
	|	) КАК РасчетыСКлиентамиОстатки
	|");
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОстатокДопустимогоКредита = ДопустимыйКредит - Выборка.ОстатокДолга;
	Иначе
		ОстатокДопустимогоКредита = ДопустимыйКредит;
	КонецЕсли;
	
	Возврат ОстатокДопустимогоКредита;
	
КонецФункции
Функция ТекстЗапросаОбъектыРасчетов()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДоговора.Ссылка КАК ОбъектРасчетов
	|
	|ПОМЕСТИТЬ ОбъектыРасчетов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
	|ГДЕ
	|	ДанныеДоговора.Ссылка = &Договор
	|	И ДанныеДоговора.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|	И ДанныеДокумента.Договор = &Договор
	|	И ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Документ.ЗаказКлиента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
	|	И ДанныеДокумента.Договор = &Договор
	|	И ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
	|	И ДанныеДокумента.Договор = &Договор
	|	И ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|	И ДанныеДокумента.Договор = &Договор
	|	И ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Документ.ОтчетКомиссионераОСписании КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|	И ДанныеДокумента.Договор = &Договор
	|	И ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|	И ДанныеДокумента.Договор = &Договор
	|	И ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|	И ДанныеДокумента.Договор = &Договор
	|	И ДанныеДокумента.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	|	И ДанныеДокумента.Договор = &Договор
	|	И ДанныеДокумента.Проведен
	|;
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПечатьЗаявленияНаВыдачуДС(МассивОбъектов,ОбъектыПечати)
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("ПФ_MXL_ЗаявлениеНаВыдачуДенег");
	ТабДок = Новый ТабличныйДокумент;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Дата КАК ДатаСоставления,
	|	РасходныйКассовыйОрдер.Контрагент,
	|	РасходныйКассовыйОрдер.Ссылка,
	|	РасходныйКассовыйОрдер.Организация.НаименованиеПолное КАК Организация,
	|	РасходныйКассовыйОрдер.Валюта,
	|	РасходныйКассовыйОрдер.СуммаДокумента КАК Сумма,
	|	РасходныйКассовыйОрдер.ПодотчетноеЛицо.Наименование КАК ПодотчетноеЛицо,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК Должность,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО РасходныйКассовыйОрдер.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	ТабДок.Очистить();
	ТабДок.НачатьАвтогруппировкуСтрок();
	ПервыйДокумент = Истина;
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		ОбластьМакета.Параметры.Заполнить(Выборка);
		
		ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(
		Выборка.Сумма, 
		Выборка.Валюта, 
		Ложь // ВыводитьСуммуБезКопеек
		);
		ОбластьМакета.Параметры.ФИОРуководителя = Выборка.Руководитель;
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = Выборка.ГлавныйБухгалтер;
		ОбластьМакета.Параметры.ДолжностьРуководителя = Выборка.Должность;
		
		
		ТабДок.Вывести(ОбластьМакета, Выборка.Уровень());
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();           
	
	возврат ТабДок;
КонецФункции

Функция ПечатьАктаОприходования(МассивОбъектов,ОбъектыПечати)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК ДатаДокумента,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Номер КАК Номер,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Организация КАК Организация,
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.КоличествоУпаковок КАК Количество,
	|	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	|	ПоступлениеТоваровУслугТовары.СуммаСНДС КАК Сумма,
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдИзм,
	|	ПоступлениеТоваровУслугТовары.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеИзлишковТоваровТовары.Ссылка.Дата,
	|	ОприходованиеИзлишковТоваровТовары.Ссылка.Номер,
	|	ОприходованиеИзлишковТоваровТовары.Ссылка.Организация,
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура,
	|	ОприходованиеИзлишковТоваровТовары.Количество,
	|	ОприходованиеИзлишковТоваровТовары.Цена,
	|	0,
	|	ОприходованиеИзлишковТоваровТовары.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура.Код,
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура.ЕдиницаИзмерения,
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура.ЕдиницаИзмерения.Код,
	|	0
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
	|ГДЕ
	|	ОприходованиеИзлишковТоваровТовары.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	Ссылка,
	|	Цена";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктОприходования";
	
	Результат = Запрос.Выполнить();
	
	Макет = ПолучитьМакет("ПФ_MXL_АктОприходования");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодписи   = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	
	ПервыйДокумент = Истина;
	
	ВыборкаДокументы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Контрагент, ВыборкаДокументы.ДатаДокумента), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		ОбластьЗаголовок.Параметры.ПредставлениеОрганизации=ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.ДатаДокумента), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		ВыборкаНоменклатура = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ВыборкаСтроки = ВыборкаНоменклатура.Выбрать();
			Пока ВыборкаСтроки.Следующий() Цикл
				ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
				ТабДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
		КонецЦикла;

		ОбластьПодписи.Параметры.Заполнить(ВыборкаДокументы);
		
		ТабДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
		
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

// Печать ТОРГ-12
Функция СформироватьПечатнуюФормуТОРГ12СУслугами(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТОРГ12";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТОРГ12(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументТОРГ12(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати, КомплектыПечати);
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции
Функция ПолучитьДанныеДляПечатнойФормыТОРГ12(ПараметрыПечати, МассивОбъектов) Экспорт 
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Выполнить();
	
	ВыводитьГТД = ?(ПараметрыПечати.Свойство("ВыводитьГТД"), ПараметрыПечати.ВыводитьГТД, Ложь);
	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ВыводитьГТД);
	ПродажиСервер.ПоместитьВременнуюТаблицуКоэффициентыУпаковок(МенеджерВременныхТаблиц);
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Отпустил.Наименование КАК Кладовщик,
	|	РеализацияТоваровУслуг.ОтпустилДолжность КАК ДолжностьКладовщика,
	|	РеализацияТоваровУслуг.Организация.Префикс КАК Префикс,
	|	РеализацияТоваровУслуг.Основание КАК Основание,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
	|	РеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	РеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	&ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	РеализацияТоваровУслуг.РаспределитьТранспортные
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО РеализацияТоваровУслуг.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО РеализацияТоваровУслуг.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаТоваров.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаТоваров.Номенклатура.Код
	|	КОНЕЦ КАК НоменклатураКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТоваров.Упаковка.Коэффициент, 1) = 1
	|			ТОГДА """"
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ КАК УпаковкаНаименование,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|					ТОГДА ТаблицаТоваров.Упаковка.ЕдиницаИзмерения.Представление
	|				ИНАЧЕ КоэффициентыУпаковок.ВидУпаковки.ЕдиницаИзмерения.Представление
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидУпаковки,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
	|	ТаблицаТоваров.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|	КОНЕЦ КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|					КОГДА КоэффициентыУпаковок.Количество < КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|						ТОГДА КоэффициентыУпаковок.Количество
	|					ИНАЧЕ КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|					ТОГДА 1
	|				ИНАЧЕ ТаблицаТоваров.Упаковка.Коэффициент
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА (ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаБезНДС * ТаблицаТоваров.Распределять * ВЫБОР
	|					КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|						ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|					ИНАЧЕ 0
	|				КОНЕЦ) / ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ (ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаБезНДС * ТаблицаТоваров.Распределять * ВЫБОР
	|				КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|					ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|				ИНАЧЕ 0
	|			КОНЕЦ) / ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Цена,
	|	ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаБезНДС * ТаблицаТоваров.Распределять * ВЫБОР
	|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ТаблицаТоваров.СуммаНДС + ТаблицаТоваров.СуммаНДС * ТаблицаТоваров.Распределять * ВЫБОР
	|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС + (ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС) * ТаблицаТоваров.Распределять * ВЫБОР
	|		КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|			ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСНДС,
	|	ТаблицаТоваров.Количество * ТаблицаТоваров.Номенклатура.Вес КАК МассаНетто,
	|	ВЫБОР
	|		КОГДА &ЗаполненаЕдиницаИзмеренияВеса
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
	|						ТОГДА ТаблицаТоваров.Количество * ТаблицаТоваров.Номенклатура.Вес
	|					ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок * ТаблицаТоваров.Упаковка.Вес
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МассаБрутто,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
	|				И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаУслуг,
	|			СУММА(ВЫБОР
	|					КОГДА ТаблицаТоваров.Распределять = 1
	|						ТОГДА ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаТоваров,
	|			ТаблицаТоваров.Ссылка КАК Ссылка
	|		ИЗ
	|			ТаблицаТоваров КАК ТаблицаТоваров
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаТоваров.Ссылка) КАК РаспределениеУслуг
	|		ПО ТаблицаТоваров.Ссылка = РаспределениеУслуг.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ВыводитьУслуги",                  ПараметрыПечати.ВыводитьУслуги);
	Запрос.УстановитьПараметр("КолонкаКодов",                    КолонкаКодов);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияВеса",            Константы.ЕдиницаИзмеренияВеса.Получить());
	Запрос.УстановитьПараметр("ЗаполненаЕдиницаИзмеренияВеса",   ЗначениеЗаполнено(Константы.ЕдиницаИзмеренияВеса.Получить()));
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить() ИЛИ ВыводитьГТД);
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции
Функция ИнициализироватьТаблицуКорректировок()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	Таблица.Колонки.Добавить("НомерСтроки",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,0)));
	Таблица.Колонки.Добавить("Сумма",          Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СуммаНДС",       Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ВидыЗапасов",    Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
	
КонецФункции
Функция ПолучитьТабличнуюЧастьВВалютеРеглУчета(МассивОбъектов, ПоВидамЗапасов = Ложь)
	
	ТаблицаКорректировок = ИнициализироватьТаблицуКорректировок();
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	КэшКурсовВалют = РаботаСКурсамивалютУТ.ИнициализироватьКэшКурсовВалют();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|ГДЕ
	|	РасчетыСКлиентами.Регистратор В(&МассивДокументов)
	|	И РасчетыСКлиентами.Активность
	|");
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	ТаблицаАналитик = Запрос.Выполнить().Выгрузить();
	МассивАналитикУчетаПоПартнерам = ТаблицаАналитик.ВыгрузитьКолонку("АналитикаУчетаПоПартнерам");
	
	ВзаиморасчетыСервер.ВыполнитьПроведениеДокументовПоРасчетамСКлиентами(МассивАналитикУчетаПоПартнерам);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка				   				КАК ДокументСсылка,
	|	ДанныеДокумента.Дата				   				КАК Дата,
	|	ДанныеДокумента.Валюта				   				КАК Валюта,
	|	ДанныеДокумента.ВалютаВзаиморасчетов   				КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.ЦенаВключаетНДС		   				КАК ЦенаВключаетНДС,
	|	ЕСТЬNULL(ТаблицаПредоплаты.ПредоплатаПриход, 0)	    КАК Предоплата,
	|	ЕСТЬNULL(ТаблицаПредоплаты.ПредоплатаРеглПриход, 0) КАК ПредоплатаРегл
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам.Обороты(	       
	|				,
	|				,
	|				Регистратор,
	|				АналитикаУчетаПоПартнерам В (&АналитикаУчетаПоПартнерам)
	|		) КАК ТаблицаПредоплаты
	|		ПО ДанныеДокумента.Ссылка = ТаблицаПредоплаты.Регистратор
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивДокументов)
	|	И ДанныеДокумента.Валюта <> &ВалютаРегламентированногоУчета
	|	И ДанныеДокумента.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета
	|	И ДанныеДокумента.ХозяйственнаяОперация <> &ПередачаНаКомиссию
	|	И ЕСТЬNULL(ТаблицаПредоплаты.ПредоплатаРеглПриход, 0) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВидыЗапасов.Ссылка								   КАК ДокументСсылка,
	|	ТаблицаВидыЗапасов.НомерСтроки							   КАК НомерСтроки,
	|	ТаблицаВидыЗапасов.СтавкаНДС							   КАК СтавкаНДС,
	|
	|	ВЫБОР КОГДА ТаблицаВидыЗапасов.Ссылка.ЦенаВключаетНДС ТОГДА
	|		ТаблицаВидыЗапасов.СуммаСНДС
	|	ИНАЧЕ
	|		ТаблицаВидыЗапасов.СуммаСНДС - ТаблицаВидыЗапасов.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|
	|	ТаблицаВидыЗапасов.СуммаНДС								   КАК СуммаНДС,
	|	ИСТИНА													   КАК ВидыЗапасов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТаблицаВидыЗапасов
	|ГДЕ
	|	ТаблицаВидыЗапасов.Ссылка В (&МассивДокументов)
	|	И &ПоВидамЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка 	  КАК ДокументСсылка,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.СтавкаНДС	  КАК СтавкаНДС,
	|	ТаблицаТовары.Сумма		  КАК Сумма,
	|	ТаблицаТовары.СуммаНДС	  КАК СуммаНДС,
	|	ЛОЖЬ					  КАК ВидыЗапасов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка В(&МассивДокументов)
	|	И (ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		ИЛИ НЕ &ПоВидамЗапасов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументСсылка
	|
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ДокументСсылка
	|
	|;";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПоВидамЗапасов",					ПоВидамЗапасов);
	Запрос.УстановитьПараметр("МассивДокументов",				МассивОбъектов);
	Запрос.УстановитьПараметр("ПередачаНаКомиссию",				Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);	
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам",		МассивАналитикУчетаПоПартнерам);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	МассивРезультатов		  = Запрос.ВыполнитьПакет();
	ДанныеДокументов		  = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	
	ДанныеДокумента = ДанныеДокументов.Выбрать();
	ВыборкаПоДокументам = РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ДанныеДокумента.Следующий() Цикл
		
		КурсВалютыДокумента		 = РаботаСКурсамиВалютУт.ПолучитьКурсВалютыИзКэша(ДанныеДокумента.Валюта, ДанныеДокумента.Дата, КэшКурсовВалют);
		КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютУт.ПолучитьКурсВалютыИзКэша(ДанныеДокумента.ВалютаВзаиморасчетов, ДанныеДокумента.Дата, КэшКурсовВалют);
		
		ОтборПоДокументу = Новый Структура("ДокументСсылка", ДанныеДокумента.ДокументСсылка);
		Пока ВыборкаПоДокументам.НайтиСледующий(ОтборПоДокументу) Цикл
			
			СуммаДокумента = ?(ДанныеДокумента.ЦенаВключаетНДС,
			ВыборкаПоДокументам.Сумма,
			ВыборкаПоДокументам.Сумма + ВыборкаПоДокументам.СуммаНДС);
			
			СуммаВзаиморасчетов = СуммаДокумента * КурсВалютыДокумента / КурсВалютыВзаиморасчетов;
			
			Если СуммаВзаиморасчетов > ДанныеДокумента.Предоплата Тогда
				СуммаДокументаРегл = ДанныеДокумента.ПредоплатаРегл
				+ (СуммаВзаиморасчетов - ДанныеДокумента.Предоплата) * КурсВалютыВзаиморасчетов;
			Иначе
				СуммаДокументаРегл = ДанныеДокумента.ПредоплатаРегл;
			КонецЕсли;
			
			МассивСумм = Новый Массив;
			
			Выборка = ВыборкаПоДокументам.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивСумм.Добавить(?(ДанныеДокумента.ЦенаВключаетНДС,
				Выборка.Сумма,
				Выборка.Сумма + Выборка.СуммаНДС));
			КонецЦикла;
			
			МассивНовыхСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаДокументаРегл, МассивСумм);
			
			Выборка.Сбросить();
			Индекс = 0;
			Пока Выборка.Следующий() Цикл
				
				Если НЕ МассивНовыхСумм = Неопределено Тогда
					СуммаСНДС = МассивНовыхСумм[Индекс]
				Иначе
					СуммаСНДС = ?(ДанныеДокумента.ЦенаВключаетНДС,
					Выборка.Сумма,
					Выборка.Сумма + Выборка.СуммаНДС) * КурсВалютыДокумента;
				КонецЕсли;
				
				СтрокаРезультата = ТаблицаКорректировок.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРезультата, Выборка);
				
				СтавкаНДСЧислом = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(Выборка.СтавкаНДС);
				СтрокаРезультата.СуммаНДС = Окр(
				СуммаСНДС / (1 + СтавкаНДСЧислом) * СтавкаНДСЧислом
				,2);
				
				СтрокаРезультата.Сумма = ?(ДанныеДокумента.ЦенаВключаетНДС,
				СуммаСНДС,
				СуммаСНДС - СтрокаРезультата.СуммаНДС);
				
				Индекс = Индекс + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаКорректировок;
	
КонецФункции
Процедура ЗаполнитьРеквизитыШапкиТОРГ12(ДанныеПечати, Макет, ТабличныйДокумент)
	
	// Выводим общие реквизиты шапки
	СведенияОПоставщике       = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация,      ДанныеПечати.Дата,, ДанныеПечати.БанковскийСчетОрганизации);
	СведенияОПокупателе       = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент,       ДанныеПечати.Дата,, ДанныеПечати.БанковскийСчетКонтрагента);
	СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата,, ДанныеПечати.БанковскийСчетГрузополучателя);
	СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата,, ДанныеПечати.БанковскийСчетГрузоотправителя);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	ОбластьМакета.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеПечати.Номер, Ложь, Истина);
	ОбластьМакета.Параметры.ДатаДокумента  = ДанныеПечати.Дата;
	
	Если ДанныеПечати.Организация = ДанныеПечати.Грузоотправитель Тогда
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике,
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
		
	Иначе
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПредставлениеПодразделения = ДанныеПечати.Подразделение;
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
	"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	
	ОбластьМакета.Параметры.ПредставлениеПоставщика  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике,
	"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	
	ОбластьМакета.Параметры.ПредставлениеПлательщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе);
	
	// Выводим всевозможные коды
	ОбластьМакета.Параметры.ОрганизацияПоОКПО          = СведенияОГрузоотправитель.КодПоОКПО;
	ОбластьМакета.Параметры.ВидДеятельностиПоОКДП      = "";
	ОбластьМакета.Параметры.ГрузополучательПоОКПО      = СведенияОГрузополучателе.КодПоОКПО;
	ОбластьМакета.Параметры.ПоставщикПоОКПО            = СведенияОПоставщике.КодПоОКПО;
	ОбластьМакета.Параметры.ПлательщикПоОКПО           = СведенияОПокупателе.КодПоОКПО;
	ОбластьМакета.Параметры.ОснованиеНомер             = "";
	ОбластьМакета.Параметры.ОснованиеДата              = "";
	ОбластьМакета.Параметры.ТранспортнаяНакладнаяНомер = "";
	ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата  = "";
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
КонецПроцедуры
Процедура ЗаполнитьРеквизитыПодвалаТОРГ12(ДанныеПечати, ИтоговыеСуммы, Макет, ТабличныйДокумент, КоэффициентПересчетаВТонны)
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ПолнаяДатаДокумента = Формат(ДанныеПечати.Дата, "ДФ=""дд ММММ гггг """"года""""""");
	ДлинаСтроки = СтрДлина(ПолнаяДатаДокумента);
	ПервыйРазделитель = Найти(ПолнаяДатаДокумента, " ");
	ВторойРазделитель = Найти(Прав(ПолнаяДатаДокумента, ДлинаСтроки - ПервыйРазделитель), " ") + ПервыйРазделитель;
	ОбластьМакета.Параметры.ДатаДокументаДень = """" + Лев(ПолнаяДатаДокумента, ПервыйРазделитель -1 ) + """";
	ОбластьМакета.Параметры.ДатаДокументаМесяц = Сред(ПолнаяДатаДокумента, ПервыйРазделитель + 1, ВторойРазделитель - ПервыйРазделитель - 1);
	ОбластьМакета.Параметры.ДатаДокументаГод = Прав(ПолнаяДатаДокумента, ДлинаСтроки - ВторойРазделитель);
	
	// Главный бухгалтер
	ОбластьМакета.Параметры.ФИОГлавБухгалтера = ДанныеПечати.ГлавныйБухгалтер;
	
	// Отпуск товара разрешил
	ОбластьМакета.Параметры.ФИОРуководителя = ДанныеПечати.Руководитель;
	ОбластьМакета.Параметры.ДолжностьРуководителя = ДанныеПечати.ДолжностьРуководителя;
	
	ОбластьМакета.Параметры.ФИОКладовщика = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Кладовщик);
	ОбластьМакета.Параметры.ДолжностьКладовщика = ДанныеПечати.ДолжностьКладовщика;
	
	// Доверенность
	ОбластьМакета.Параметры.ДоверенностьНомер     = ДанныеПечати.ДоверенностьНомер;
	ОбластьМакета.Параметры.ДоверенностьДата      = Формат(ДанныеПечати.ДоверенностьДата, "ДФ='дд ММММ гггг'");
	ОбластьМакета.Параметры.ДоверенностьВыдана    = ДанныеПечати.ДоверенностьВыдана;
	ОбластьМакета.Параметры.ДоверенностьЧерезКого = ДанныеПечати.ДоверенностьЛицо;
	
	Если ИтоговыеСуммы.ИтогоКоличествоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтоговыеСуммы.ИтогоКоличествоМест, ,",,,,,,,,0");
	КонецЕсли;
	
	Если ИтоговыеСуммы.ИтогоМассаНетто > 0 Тогда
		ПараметрыМассыПрописью = ПараметрыМассыПрописью(ИтоговыеСуммы.ИтогоМассаНетто, КоэффициентПересчетаВТонны);
		ОбластьМакета.Параметры.МассаНеттоПрописью = ЧислоПрописью(
		ИтоговыеСуммы.ИтогоМассаНетто * ПараметрыМассыПрописью.Коэффициент,
		"ДП=Истина",
		ПараметрыМассыПрописью.Формат
		);
	КонецЕсли;
	
	Если ИтоговыеСуммы.ИтогоМассаБрутто > 0 Тогда
		ПараметрыМассыПрописью = ПараметрыМассыПрописью(ИтоговыеСуммы.ИтогоМассаБрутто, КоэффициентПересчетаВТонны);
		ОбластьМакета.Параметры.МассаБруттоПрописью = ЧислоПрописью(
		ИтоговыеСуммы.ИтогоМассаБрутто * ПараметрыМассыПрописью.Коэффициент,
		"ДП=Истина",
		ПараметрыМассыПрописью.Формат
		);
	КонецЕсли;
	
	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписейПрописью;
	ОбластьМакета.Параметры.СуммаПрописью = ИтоговыеСуммы.СуммаПрописью;
	
	МассивВыводимыхОбластей = Новый Массив;
	МассивВыводимыхОбластей.Добавить(ОбластьМакета);
	Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры
Процедура ЗаполнитьТабличныйДокументТОРГ12(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати, КомплектыПечати)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	КоэффициентПересчетаВТонны     = Константы.КоэффициентПересчетаВТонны.Получить();
	
	ДанныеПечати      	= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыводитьГТД = ?(ПараметрыПечати.Свойство("ВыводитьГТД"), ПараметрыПечати.ВыводитьГТД, Ложь);
	
	Если ВыводитьГТД Тогда
		Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьОбщихФорм.ПФ_MXL_ТОРГ12_ГТД");
	Иначе
		Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьОбщихФорм.ПФ_MXL_ТОРГ12");
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		// Для печати комплектов
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
			КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеПечати.Ссылка,"Ссылка");
			Если КомплектПечатиПоСсылке = Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати[0];
			КонецЕсли;
			Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
				Продолжить
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоДокументам.Сбросить();
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска) Тогда
			Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 печать ТОРГ-12 не требуется'"),
				ДанныеПечати.Ссылка
				);
			Иначе
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В документе %1 отсутствуют товары. Печать товарной накладной без услуг не требуется'"),
				ДанныеПечати.Ссылка
				);
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка
			);
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЗаполнитьРеквизитыШапкиТОРГ12(ДанныеПечати, Макет, ТабличныйДокумент);
		
		НомерСтраницы = 1;
		ИтоговыеСуммы = СтруктураИтоговыеСуммы();
		
		// Создаем массив для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		// Выводим многострочную часть докмента
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб");
		ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
		
		СтрокаТовары = ВыборкаПоДокументам.Выбрать();
		КоличествоСтрок = СтрокаТовары.Количество();
		НомерСтроки = 0;
		ИтогоВес=0;
		СтрокаТоваров=ПолучитьСтруктуруСтроки();	
		Пока СтрокаТовары.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			если (КоличествоСтрок=НомерСтроки) и ДанныеПечати.РаспределитьТранспортные тогда
				
				ЗаполнитьЗначенияСвойств(СтрокаТоваров,СтрокаТовары);
				СтрокаТоваров.СуммаСНДС=ДанныеПечати.Ссылка.Товары.ИТОГ("Сумма")-ИтоговыеСуммы.ИтогоСуммаСНДС;
				СтрокаТоваров.СуммаНДС=ДанныеПечати.Ссылка.Товары.ИТОГ("СуммаНДС")-ИтоговыеСуммы.ИтогоСуммаНДС;
				СтрокаТоваров.СуммаБезНДС=ДанныеПечати.Ссылка.Товары.ИТОГ("Сумма")-ДанныеПечати.Ссылка.Товары.ИТОГ("СуммаНДС")-ИтоговыеСуммы.ИтогоСуммаБезНДС;
				СтрокаТоваров.Цена=?(СтрокаТовары.Количество<>0,СтрокаТоваров.СуммаСНДС/СтрокаТовары.Количество,0);
				ЗаполнитьРеквизитыСтрокиТовара(СтрокаТоваров, ОбластьМакета);	
			иначе
				ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьМакета);	
			конецесли;	
			
			Если НомерСтроки = 1 Тогда
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			КонецЕсли;
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьМакета);
			МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);
			Если НомерСтроки = КоличествоСтрок Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьВсего);
			КонецЕсли;
			
			Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				
				ОбластьИтоговПоСтранице.Параметры.Заполнить(ИтоговыеСуммы);
				ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				ОбнулитьИтогиПоСтранице(ИтоговыеСуммы);
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			если (КоличествоСтрок=НомерСтроки) и ДанныеПечати.РаспределитьТранспортные тогда
				РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТоваров);	
			иначе
				РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);
			конецесли;
			
		КонецЦикла;
		
		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьИтоговПоСтранице.Параметры.Заполнить(ИтоговыеСуммы);
		
		ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
		
		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		ОбластьМакета.Параметры.Заполнить(ИтоговыеСуммы);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подвал документа
		ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
		ЗаполнитьРеквизитыПодвалаТОРГ12(ДанныеПечати, ИтоговыеСуммы, Макет, ТабличныйДокумент, КоэффициентПересчетаВТонны);
		
		// Выведем нужное количество экземпляров (при печати комплектов)
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
			ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
			Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьКопирования);
			КонецЦикла;
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
КонецПроцедуры
Процедура ЗаполнитьРеквизитыСтрокиТовараГТД(СтрокаТовары, ОбластьМакета, ДействующиеПостановления = Неопределено)
	
	НомерГТД = СтрЗаменить(СтрокаТовары.НомерГТД, "/", "");
	Если Не ПустаяСтрока(НомерГТД) Тогда
		ОбластьМакета.Параметры.ПредставлениеГТД = Строка(СтрокаТовары.НомерГТД);
		ОбластьМакета.Параметры.ПредставлениеСтраны = СокрЛП(СтрокаТовары.СтранаПроисхождения);
	ИначеЕсли ДействующиеПостановления <> Неопределено И ДействующиеПостановления.Постановление1137 Тогда
		ОбластьМакета.Параметры.СтранаПроисхожденияКод = "";
		ОбластьМакета.Параметры.ПредставлениеГТД = "";
		ОбластьМакета.Параметры.ПредставлениеСтраны = "";
	Иначе
		ОбластьМакета.Параметры.ПредставлениеГТД = "--";
		ОбластьМакета.Параметры.ПредставлениеСтраны = "--";
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьЗаявленияНаВозврат(МассивОбъектов,ОбъектыПечати)
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка.Дата КАК ДатаДокумента,
	|	ДанныеДокумента.Ссылка.Номер КАК Номер,
	|	ДанныеДокумента.Организация.НаименованиеСокращенное КАК Организация,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ДанныеДокумента.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.ПричинаВозврата,
	|	ДанныеДокумента.Валюта,
	|	ДанныеДокумента.СерияДокументаПокупателя КАК ПаспСерия,
	|	ДанныеДокумента.НомерДокументаПокупателя КАК ПаспНомер,
	|	ДанныеДокумента.ДатаВыдачиДокументаПокупателя КАК ПаспДата,
	|	ДанныеДокумента.КемВыданДокументПокупателя КАК ПаспВыдан,
	|	ДанныеДокумента.ДокументРеализации.Номер,
	|	ДанныеДокумента.ДокументРеализации.Дата,
	|	ДанныеДокумента.Менеджер,
	|	ТаблицаОтветственныеЛица.Руководитель КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК Должность,
	|	ДанныеДокумента.Покупатель КАК Покупатель,
	|	ДанныеДокумента.Организация КАК ОрганизацияСсылка,
	|	ДанныеДокумента.ХозяйственнаяОперация,
	|	ДанныеДокумента.ЧекККМ
	//-
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ДанныеДокумента.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаВозврат";
	Результат = Запрос.Выполнить();
	Макет = ПолучитьМакет("ПФ_MXL_ЗаявлениеНаВозврат");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	ПервыйДокумент = Истина;
	ВыборкаДокументы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		если не значениезаполнено(ВыборкаДокументы.Покупатель) тогда
			ОбластьЗаголовок.Параметры.Покупатель=ВыборкаДокументы.Контрагент;
		конецесли;	
		
		ОбластьЗаголовок.Параметры.Должность = ВыборкаДокументы.Должность;
		ОбластьЗаголовок.Параметры.Организация= ВыборкаДокументы.Организация;
		СуммаПрописью=РаботаСКурсамиВалют.СформироватьСуммуПрописью(ВыборкаДокументы.СуммаДокумента, ВыборкаДокументы.Валюта, ИСТИНА);
		ОбластьЗаголовок.Параметры.СуммаПрописью= СуммаПрописью;
		Если ВыборкаДокументы.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя Тогда
			ОбластьЗаголовок.Параметры.НомерДокРеализации = "№ " + ВыборкаДокументы.ЧекККМ.Номер + " от " + Формат(ВыборкаДокументы.ЧекККМ.Дата, "ДЛФ=ДД");
		Иначе
			ОбластьЗаголовок.Параметры.НомерДокРеализации="№ "+ВыборкаДокументы.ДокументРеализацииНомер+" от "+ФОРМАТ(ВыборкаДокументы.ДокументРеализацииДата,"ДЛФ=ДД");
		КонецЕсли;
		ОбластьЗаголовок.Параметры.Менеджер=ВыборкаДокументы.Менеджер;
		ОбластьЗаголовок.Параметры.ДатаДок=ВыборкаДокументы.ДатаДокумента;
		ОбластьЗаголовок.Параметры.ПаспДата=ФОРМАТ(ВыборкаДокументы.ПаспДата,"ДЛФ=ДД");
		
		ОрганизацияФактическийАдрес= ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.ОрганизацияСсылка, ВыборкаДокументы.ДатаДокумента), "ФактическийАдрес");
		ОбластьЗаголовок.Параметры.ОрганизацияАдрес= ОрганизацияФактическийАдрес;
		ТабДокумент.Вывести(ОбластьЗаголовок);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
	КонецЦикла;
	Возврат ТабДокумент;
КонецФункции 
Функция ПечатьЗаявленияНаВозвратЮрЛицо(МассивОбъектов,ОбъектыПечати)
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеДокумента.Дата КАК ДатаДокумента,
		|	ДанныеДокумента.Номер КАК Номер,
		|	ДанныеДокумента.Организация.НаименованиеСокращенное КАК Организация,
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Контрагент КАК Контрагент,
		|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
		|	ДанныеДокумента.ПричинаВозврата,
		|	ДанныеДокумента.Валюта,
		|	ДанныеДокумента.СерияДокументаПокупателя КАК ПаспСерия,
		|	ДанныеДокумента.НомерДокументаПокупателя КАК ПаспНомер,
		|	ДанныеДокумента.ДатаВыдачиДокументаПокупателя КАК ПаспДата,
		|	ДанныеДокумента.КемВыданДокументПокупателя КАК ПаспВыдан,
		|	ДанныеДокумента.ДокументРеализации.Номер,
		|	ДанныеДокумента.ДокументРеализации.Дата,
		|	ДанныеДокумента.Менеджер,
		|	ТаблицаОтветственныеЛица.Руководитель КАК Руководитель,
		|	ТаблицаОтветственныеЛица.РуководительДолжность КАК Должность,
		|	ДанныеДокумента.Покупатель КАК Покупатель,
		|	ДанныеДокумента.Организация КАК ОрганизацияСсылка,
		|	СчетФактураВыданный.Номер КАК НомерСчФактуры,
		|	СчетФактураВыданный.Дата КАК ДатаСчФактуры,
		|	ДанныеДокумента.Контрагент.ИНН
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
		|		ПО ДанныеДокумента.Ссылка = ТаблицаОтветственныеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ДанныеДокумента.ДокументРеализации = СчетФактураВыданный.ДокументОснование
		|ГДЕ
		|	ДанныеДокумента.Ссылка В(&МассивОбъектов)";
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КорректировкаРеализации.Дата КАК ДатаДокумента,
		|	КорректировкаРеализации.Номер КАК Номер,
		|	КорректировкаРеализации.Организация.НаименованиеСокращенное КАК Организация,
		|	КорректировкаРеализации.Ссылка КАК Ссылка,
		|	КорректировкаРеализации.Контрагент КАК Контрагент,
		|	КорректировкаРеализации.СуммаДокумента КАК СуммаДокумента,
		|	КорректировкаРеализации.Валюта,
		|	КорректировкаРеализации.Менеджер,
		|	ТаблицаОтветственныеЛица.Руководитель КАК Руководитель,
		|	ТаблицаОтветственныеЛица.РуководительДолжность КАК Должность,
		|	КорректировкаРеализации.Организация КАК ОрганизацияСсылка,
		|	СчетФактураВыданный.Номер КАК НомерСчФактуры,
		|	СчетФактураВыданный.Дата КАК ДатаСчФактуры,
		|	КорректировкаРеализации.Контрагент.ИНН
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
		|		ПО КорректировкаРеализации.Ссылка = ТаблицаОтветственныеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО КорректировкаРеализации.ДокументОснование = СчетФактураВыданный.ДокументОснование
		|ГДЕ
		|	КорректировкаРеализации.Ссылка В(&МассивОбъектов)";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаВозвратЮрЛицо";
	Результат = Запрос.Выполнить();
	Макет = ПолучитьМакет("ПФ_MXL_ЗаявлениеНаВозвратЮрЛицо");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	ПервыйДокумент = Истина;
	ВыборкаДокументы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		ОбластьЗаголовок.Параметры.Организация= ВыборкаДокументы.Организация;
		ОбластьЗаголовок.Параметры.ДатаСчФактуры=ФОРМАТ(ВыборкаДокументы.ДатаСчФактуры,"ДЛФ=ДД");
		ОрганизацияФактическийАдрес= ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.ОрганизацияСсылка, ВыборкаДокументы.ДатаДокумента), "ФактическийАдрес");
		ОбластьЗаголовок.Параметры.ОрганизацияАдрес= ОрганизацияФактическийАдрес;
		КонтрагентФактическийАдрес= ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Контрагент, ВыборкаДокументы.ДатаДокумента), "ФактическийАдрес");
		ОбластьЗаголовок.Параметры.КонтрагентАдрес= КонтрагентФактическийАдрес;
		
		Если ТипЗнч(ВыборкаДокументы.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			СуммаДокумента= ВыборкаДокументы.Ссылка.Расхождения.Итог("СуммаСНДС");
			ОбластьЗаголовок.Параметры.СуммаДокумента= ?(СуммаДокумента >= 0, СуммаДокумента, -СуммаДокумента);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьЗаголовок);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
	КонецЦикла;
	Возврат ТабДокумент;
КонецФункции 

Функция ПечатьСборкаТоваров(МассивОбъектов, ОбъектыПечати)
	
	ДопКолонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьДопКолонку= Ложь;
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	СборкаТоваровТовары.Ссылка КАК Ссылка,
	|	СборкаТоваровТовары.Номенклатура КАК Номенклатура,
	|	СборкаТоваровТовары.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	СборкаТоваровТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	|	ВЫБОР
	|		КОГДА СборкаТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(СборкаТоваровТовары.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(СборкаТоваровТовары.Упаковка)
	|	КОНЕЦ КАК Упаковка,
	|	СборкаТоваровТовары.КоличествоУпаковок КАК Количество,
	|	СУММА(СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СуммаДопРасходов) КАК Сумма,
	|	СборкаТоваровТовары.Ссылка.ТипОперации,
	|	СборкаТоваровТовары.Ссылка.Ответственный.Представление,
	|	СборкаТоваровТовары.Ссылка.Организация,
	|	СборкаТоваровТовары.Ссылка.Склад,
	|	СборкаТоваровТовары.Ссылка.Организация.Представление,
	|	СборкаТоваровТовары.Ссылка.Склад.Представление,
	|	СборкаТоваровТовары.Ссылка.Номенклатура КАК НоменклатураК,
	|	СборкаТоваровТовары.Ссылка.Номенклатура.Представление КАК НоменклатураПредставлениеК,
	|	СборкаТоваровТовары.Ссылка.Характеристика КАК ХарактеристикаК,
	|	СборкаТоваровТовары.Ссылка.Характеристика.Представление КАК ХарактеристикаПредставлениеК,
	|	СборкаТоваровТовары.Ссылка.Количество КАК КоличествоК,
	|	СборкаТоваровТовары.Ссылка.КоличествоУпаковок КАК КоличествоУпаковокК,
	|	ВЫБОР
	|		КОГДА СборкаТоваровТовары.Ссылка.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(СборкаТоваровТовары.Ссылка.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(СборкаТоваровТовары.Ссылка.Упаковка)
	|	КОНЕЦ КАК УпаковкаК,
	|	СборкаТоваровТовары.Ссылка.Номер,
	|	СборкаТоваровТовары.Ссылка.Дата
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО СборкаТоваровТовары.Ссылка = СебестоимостьТоваров.Регистратор
	|			И СборкаТоваровТовары.Номенклатура = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура
	|ГДЕ
	|	СборкаТоваровТовары.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаТоваровТовары.Ссылка,
	|	СборкаТоваровТовары.Номенклатура,
	|	СборкаТоваровТовары.Номенклатура.НаименованиеПолное,
	|	СборкаТоваровТовары.Характеристика.НаименованиеПолное,
	|	СборкаТоваровТовары.КоличествоУпаковок,
	|	СборкаТоваровТовары.Ссылка.ТипОперации,
	|	СборкаТоваровТовары.Ссылка.Ответственный.Представление,
	|	СборкаТоваровТовары.Ссылка.Организация,
	|	СборкаТоваровТовары.Ссылка.Склад,
	|	СборкаТоваровТовары.Ссылка.Организация.Представление,
	|	СборкаТоваровТовары.Ссылка.Склад.Представление,
	|	СборкаТоваровТовары.Ссылка.Номенклатура,
	|	СборкаТоваровТовары.Ссылка.Номенклатура.Представление,
	|	СборкаТоваровТовары.Ссылка.Характеристика,
	|	СборкаТоваровТовары.Ссылка.Характеристика.Представление,
	|	СборкаТоваровТовары.Ссылка.Количество,
	|	СборкаТоваровТовары.Ссылка.КоличествоУпаковок,
	|	СборкаТоваровТовары.Ссылка.Номер,
	|	СборкаТоваровТовары.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА СборкаТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(СборкаТоваровТовары.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(СборкаТоваровТовары.Упаковка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СборкаТоваровТовары.Ссылка.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(СборкаТоваровТовары.Ссылка.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(СборкаТоваровТовары.Ссылка.Упаковка)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	Ссылка";
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СборкаТоваров";
	
	Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьФормДополнительно.ПФ_MXL_СборкаТоваров");
	
	ОбластьШапки  = "ШапкаТаблицы";
	ОбластьСтроки = "Строка";
	
	ПервыйДокумент = Истина;
	ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Вывод заголовка.
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаДокументы);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, Строка(ВыборкаДокументы.ТипОперации));
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьМакета, ВыборкаДокументы.Ссылка);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывод комплекта.
		Если ВыводитьДопКолонку Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("КомплектКод");
			ОбластьМакета.Параметры.ДопКолонка = ДопКолонка + ":";
			ОбластьМакета.Параметры.ЗначениеДопКолонки = ВыборкаДокументы.НоменклатураК.Код;
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Комплект");
		ОбластьМакета.Параметры.Комплект = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
		ВыборкаДокументы.НоменклатураПредставлениеК,
		ВыборкаДокументы.ХарактеристикаПредставлениеК
		);
		ОбластьМакета.Параметры.Количество = Строка(ВыборкаДокументы.КоличествоК) + " " + ВыборкаДокументы.УпаковкаК;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывод шапки отчета.
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		Если ВыводитьДопКолонку Тогда
			ОбластьМакета.Параметры.ДопКолонка = ДопКолонка;
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывод строк документа.
		ВыборкаПоСтрокам = ВыборкаДокументы.Выбрать();
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоСтрокам);
			
			ОбластьМакета.Параметры.НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоСтрокам.НоменклатураПредставление,
			ВыборкаПоСтрокам.ХарактеристикаПредставление
			);
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.СуммаИтого = ВыборкаДокументы.Сумма;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывод подписей.
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.ОтветственныйПредставление = "/"+ ВыборкаДокументы.ОтветственныйПредставление + "/";
		ТабДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция СформироватьПечатнуюФормуВозвратПоставщику(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВозвратТоваров.Ссылка КАК Ссылка,
	|	ВозвратТоваров.Организация.Префикс КАК Префикс,
	|	ВозвратТоваров.Номер КАК Номер,
	|	ВозвратТоваров.Дата КАК Дата,
	|	ВозвратТоваров.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие) КАК Партнер,
	|	ВозвратТоваров.ОрганизацияПолучатель КАК Получатель,
	|	ВозвратТоваров.Валюта КАК Валюта,
	|	ВозвратТоваров.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВозвратТоваров.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ВозвратТоваров.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьНДС,
	|	ВозвратТоваров.Склад.ТекущийОтветственный.Наименование КАК ОтпускПроизвел,
	|	ВЫБОР
	|		КОГДА ВозвратТоваров.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПередачаНаКомиссию
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратТоваров
	|ГДЕ
	|	ВозвратТоваров.Ссылка В(&МассивДокументов)
	|	И ВозвратТоваров.Проведен
	|	И НЕ ВозвратТоваров.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваров.Ссылка,
	|	ВозвратТоваров.Организация.Префикс,
	|	ВозвратТоваров.Номер,
	|	ВозвратТоваров.Дата,
	|	ВозвратТоваров.Организация,
	|	ВозвратТоваров.Партнер,
	|	ВозвратТоваров.Контрагент,
	|	ВозвратТоваров.Валюта,
	|	ВозвратТоваров.ЦенаВключаетНДС,
	|	ВозвратТоваров.ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ВозвратТоваров.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВозвратТоваров.Склад.ТекущийОтветственный.Наименование,
	|	ВЫБОР
	|		КОГДА ВозвратТоваров.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратТоваров
	|ГДЕ
	|	ВозвратТоваров.Ссылка В(&МассивДокументов)
	|	И ВозвратТоваров.Проведен
	|	И ВозвратТоваров.РасчетыЧерезОтдельногоКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваров.Ссылка,
	|	ВозвратТоваров.Организация.Префикс,
	|	ВозвратТоваров.Номер,
	|	ВозвратТоваров.Дата,
	|	ВозвратТоваров.Контрагент,
	|	ВозвратТоваров.Партнер,
	|	ВозвратТоваров.ОрганизацияПолучатель,
	|	ВозвратТоваров.Валюта,
	|	ВозвратТоваров.ЦенаВключаетНДС,
	|	ВозвратТоваров.ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ВозвратТоваров.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВозвратТоваров.Склад.ТекущийОтветственный.Наименование,
	|	ВЫБОР
	|		КОГДА ВозвратТоваров.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратТоваров
	|ГДЕ
	|	ВозвратТоваров.Ссылка В(&МассивДокументов)
	|	И ВозвратТоваров.Проведен
	|	И ВозвратТоваров.РасчетыЧерезОтдельногоКонтрагента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК ТоварНаименованиеПолное,
	|	ВложенныйЗапрос.Номенклатура.Код КАК Код,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Наименование КАК ЕдиницаЦены,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Упаковка.Коэффициент, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	|	ВложенныйЗапрос.Номенклатура.Вес * ВложенныйЗапрос.Количество КАК Вес
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВозвратТоваров.Ссылка КАК Ссылка,
	|		ВозвратТоваров.Номенклатура КАК Номенклатура,
	|		ВЫБОР
	|			КОГДА ВозвратТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ ВозвратТоваров.Упаковка.Коэффициент
	|		КОНЕЦ КАК Коэффициент,
	|		ВЫБОР
	|			КОГДА ВозвратТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ВозвратТоваров.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ВозвратТоваров.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		ВозвратТоваров.Характеристика КАК Характеристика,
	|		ВозвратТоваров.Упаковка КАК Упаковка,
	|		ВозвратТоваров.СтавкаНДС КАК СтавкаНДС,
	|		ВозвратТоваров.Цена КАК Цена,
	|		ВозвратТоваров.КоличествоУпаковок КАК Количество,
	|		ВозвратТоваров.Сумма КАК Сумма,
	|		ВозвратТоваров.СуммаНДС КАК СуммаНДС,
	|		ВозвратТоваров.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		Документ.ВозвратТоваровМеждуОрганизациями.Товары КАК ВозвратТоваров
	|	ГДЕ
	|		ВозвратТоваров.Ссылка В(&МассивДокументов)
	|		И ВозвратТоваров.Ссылка.Проведен) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВозвратТоваровМеждуОрганизациями_Накладная";
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МассивРезультатов   = Запрос.ВыполнитьПакет();
	ДанныеПечати        = МассивРезультатов[0].Выбрать();
	ВыборкаПоДокументам = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		НайденСледующий = ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		// Макет необходимо получать для каждого документа, т.к. размеры колонок изменяются динамически
		Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьФормДополнительно.ПФ_MXL_ВозвратПоставщику");
		
		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		
		Если Не ДанныеПечати.ЭтоПередачаНаКомиссию Тогда
			
			ОбластьКолонкаТовар = Макет.Область("Товар");
			
		Иначе
			
			ОбластьКолонкаТовар = Макет.Область("ТоварБезСумм");
			Если Не ВыводитьКоды Тогда
				ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.125;
			КонецЕсли;
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр("ru='Возврат поставщику'"));
		
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Поставщик");
		ПредставлениеПоставщика                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		ОбластьМакета.Параметры.Поставщик               = ДанныеПечати.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		ПредставлениеПолучателя                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Получатель, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель              = ДанныеПечати.Получатель;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы Товары
		
		Если Не ДанныеПечати.ЭтоПередачаНаКомиссию Тогда
			
			ОбластьНомера     = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьТовар      = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
			ОбластьДанных     = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			
		Иначе
			
			ОбластьНомера     = Макет.ПолучитьОбласть("ШапкаТаблицыБезСумм|НомерСтрокиБезСумм");
			ОбластьКодов      = Макет.ПолучитьОбласть("ШапкаТаблицыБезСумм|КолонкаКодовБезСумм");
			ОбластьТовар      = Макет.ПолучитьОбласть("ШапкаТаблицыБезСумм|ТоварБезСумм");
			ОбластьДанных     = Макет.ПолучитьОбласть("ШапкаТаблицыБезСумм|ДанныеБезСумм");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		Если Не ДанныеПечати.ЭтоПередачаНаКомиссию Тогда
			
			ОбластьНомера  = Макет.ПолучитьОбласть("СтрокаТаблицы|НомерСтроки");
			ОбластьТовар   = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
			ОбластьДанных  = Макет.ПолучитьОбласть("СтрокаТаблицы|Данные");
			
		Иначе
			
			ОбластьНомера  = Макет.ПолучитьОбласть("СтрокаТаблицыБезСумм|НомерСтрокиБезСумм");
			ОбластьКодов   = Макет.ПолучитьОбласть("СтрокаТаблицыБезСумм|КолонкаКодовБезСумм");
			ОбластьТовар   = Макет.ПолучитьОбласть("СтрокаТаблицыБезСумм|ТоварБезСумм");
			ОбластьДанных  = Макет.ПолучитьОбласть("СтрокаТаблицыБезСумм|ДанныеБезСумм");
			
		КонецЕсли;
		
		Сумма          = 0;
		СуммаНДС       = 0;
		НомерСтроки    = 0;
		ВсегоВес       = 0;        
		
		// Выводим строки таблицы Товары
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
						
			ОбластьТовар.Параметры.Заполнить(ВыборкаПоТоварам);
			ОбластьТовар.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоТоварам.ТоварНаименованиеПолное,
			ВыборкаПоТоварам.Характеристика
			) + ?(ВыборкаПоТоварам.ЭтоВозвратнаяТара, НСтр("ru=' (возвратная тара)'"), "");
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			ОбластьДанных.Параметры.Заполнить(ВыборкаПоТоварам);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Если ДанныеПечати.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВозвратТоваровКомитенту Тогда
				
				Сумма    = Сумма    + ВыборкаПоТоварам.Сумма;
				СуммаНДС = СуммаНДС + ВыборкаПоТоварам.СуммаНДС;
				ВсегоВес=ВсегоВес+ ВыборкаПоТоварам.Вес;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Выводим подвал
		Если Не ДанныеПечати.ЭтоПередачаНаКомиссию Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			ОбластьДанных.Параметры.ВсегоВес = ВсегоВес;	
			ОбластьДанных.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
		КонецЕсли;
		
		// Выводим ИтогоНДС
		Если ДанныеПечати.УчитыватьНДС И Не ДанныеПечати.ЭтоПередачаНаКомиссию Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Данные");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			ОбластьДанных.Параметры.НДС = ?(ДанныеПечати.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'"));
			ОбластьДанных.Параметры.ВсегоНДС = ФормированиеПечатныхФорм.ФорматСумм(СуммаНДС);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
		КонецЕсли;
		
		Если Не ДанныеПечати.ЭтоПередачаНаКомиссию Тогда
			
			// Выводим Сумму прописью
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
			СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
			
			ИтоговаяСтрока = НСтр("ru='Всего наименований %КоличествоНаименований%, на сумму %СуммаДокумента% '");
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоНаименований%", ВыборкаПоТоварам.Количество());
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%СуммаДокумента%", ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
			
			ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
			ОбластьМакета.Параметры.СуммаПрописью  = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		Иначе
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицыБезСумм");
			ИтоговаяСтрока = НСтр("ru='Всего наименований %КоличествоНаименований%'");
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоНаименований%", ВыборкаПоТоварам.Количество());
			ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		// Выводим подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		Если ЗначениеЗаполнено(ДанныеПечати.ОтпускПроизвел) Тогда
			ОбластьМакета.Параметры.ОтпускПроизвел = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.ОтпускПроизвел);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьСлужебнаяЗапискаЗаявкаНаСборку(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество,
	|	ЗаказКлиентаТовары.Сумма,
	|	ЗаказКлиентаТовары.Номенклатура.Вес,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес * ЗаказКлиентаТовары.КоличествоУпаковок
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.Вес * ЗаказКлиентаТовары.КоличествоУпаковок
	|	КОНЕЦ КАК Вес,
	|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Помещение,
	|	ЗаказКлиентаТовары.Ссылка.Организация,
	|	ЗаказКлиентаТовары.Ссылка.Дата,
	|	ЗаказКлиентаТовары.Ссылка.Номер,
	|	ЗаказКлиентаТовары.Ссылка.Партнер,
	|	ЗаказКлиентаТовары.Ссылка.Контрагент,
	|	ЗаказКлиентаТовары.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаЦены,
	|	ЗаказКлиентаТовары.Склад КАК Склад,
	|	ЗаказКлиентаТовары.Ссылка.Автомобиль,
	|	ЗаказКлиентаТовары.Ссылка.ПрибытиеНаОтгрузку КАК ДатаОтгрузкиТовара,
	|	ЗаказКлиентаТовары.Ссылка.Водитель
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ЗаказКлиентаТовары.Номенклатура)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ЗаказКлиентаТовары.Ссылка.Склад)
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.КоличествоУпаковок,
	|	ЗаказКлиентаТовары.Сумма,
	|	ЗаказКлиентаТовары.Номенклатура.Вес,
	|	ЗаказКлиентаТовары.Ссылка.Организация,
	|	ЗаказКлиентаТовары.Ссылка.Дата,
	|	ЗаказКлиентаТовары.Ссылка.Номер,
	|	ЗаказКлиентаТовары.Ссылка.Партнер,
	|	ЗаказКлиентаТовары.Ссылка.Контрагент,
	|	ЗаказКлиентаТовары.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес * ЗаказКлиентаТовары.КоличествоУпаковок
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.Вес * ЗаказКлиентаТовары.КоличествоУпаковок
	|	КОНЕЦ,
	|	ЗаказКлиентаТовары.Склад,
	|	ЗаказКлиентаТовары.Ссылка.Автомобиль,
	|	ЗаказКлиентаТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ЗаказКлиентаТовары.Ссылка.Водитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Помещение,
	|	ЗаказКлиентаТовары.Номенклатура.Наименование
	|ИТОГИ ПО
	|	Ссылка,
	|	Склад,
	|	Помещение";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СлужебнаяЗапискаЗаявкаНаСборку";
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаСсылка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	
	Пока ВыборкаСсылка.Следующий() Цикл
		ВыборкаСклад=ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			ВыборкаПомещение = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПомещение.Следующий() Цикл
				СуммаИтог=0; 
				Веситог=0;
				Секция=ВыборкаПомещение.Помещение;
				если не ЗначениеЗаполнено(ВыборкаПомещение.Помещение) тогда
					Секция="";
				конецесли;	
				Макет = ПолучитьМакет("ПФ_MXL_СлужебнаяЗапискаЗаявкаНаСборку");
				Если Не ПервыйДокумент Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ПервыйДокумент    = Ложь;
				НомерСтроки=0;
				
				Область                                  = Макет.ПолучитьОбласть("Заголовок");
				Область.Параметры.ПредставлениеДокумента ="Заявка на сборку товара "+ВыборкаСсылка.Номер+" от "+Формат(ВыборкаСсылка.Дата,"ДФ=""дд ММММ гггг 'г.' """); 
				Область.Параметры.ПредставлениеПокупателя = "Покупатель: "+ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаСсылка.Контрагент, ВыборкаСсылка.Дата), "ПолноеНаименование,ФактическийАдрес");
				Область.Параметры.ПредставлениеДатаОтгрузки = "Прошу произвести отгрузку товара "+Формат(ВыборкаСсылка.ДатаОтгрузкиТовара,"ДФ=""дд ММММ гггг 'г.' """);		
				Область.Параметры.ПредставлениеМаркаАвтомобиля="Марка автомобиля: "+ВыборкаСсылка.Автомобиль.Марка; 
				Область.Параметры.ПредставлениеГосНомер="Гос номер: "+ВыборкаСсылка.Автомобиль.Код; 
				Область.Параметры.ПредставлениеФИОВодителя="ФИО водителя (или экспедитора): "+ ВыборкаСсылка.Водитель;
				ТабличныйДокумент.Вывести(Область);
				Область                                  = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ТабличныйДокумент.Вывести(Область);
				
				ВыборкаПоТоварам = ВыборкаПомещение.Выбрать();
				Сумма=0;СчетСтрок=1;
				ИтогНДС=0;
				Пока ВыборкаПоТоварам.Следующий() Цикл
					СчетСтрок = СчетСтрок + 1;
					
					Область                                  = Макет.ПолучитьОбласть("Строка");
					НомерСтроки = НомерСтроки + 1;
					
					Область.Параметры.НомерСтроки = НомерСтроки;
					
					Область.Параметры.Заполнить(ВыборкаПоТоварам);
					Область.Параметры.Товар = СОКРЛП(ВыборкаПоТоварам.Номенклатура);
					Область.Параметры.Количество = ВыборкаПоТоварам.Количество;
					Область.Параметры.ЕдиницаЦены = ВыборкаПоТоварам.ЕдиницаЦены;
					если  ВыборкаПоТоварам.Вес<>Null тогда
						ВесИтог          = ВесИтог          + ЧИСЛО(ВыборкаПоТоварам.Вес);
					конецесли;
					ТабличныйДокумент.Вывести(Область);	
					ИтогНДС=ИтогНДС+ВыборкаПоТоварам.СуммаНДС;
				КонецЦикла;
				ОбластьПодвал                                  = Макет.ПолучитьОбласть("Подвал");
				Областьподвал.Параметры.ВесИтог=Веситог;
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				Область                                  = Макет.ПолучитьОбласть("Подписи");
				
				ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
				ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
				
				Область.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки+", весом "+ВесИтог+" кг.";;
				
				Область.параметры.ВремяПечати=ТекущаяДата();
				ТабличныйДокумент.Вывести(Область);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
Функция СформироватьМаршрутныйЛист(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка.Номер КАК Номер,
	|	ЗаказКлиентаТовары.Ссылка.Дата КАК Дата,
	|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Партнер,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Партнер.ОсновнойМенеджер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Партнер.ОсновнойМенеджер
	|		ИНАЧЕ ЗаказКлиентаТовары.Ссылка.Менеджер
	|	КОНЕЦ КАК Менеджер,
	|	ЗаказКлиентаТовары.Ссылка.Автомобиль КАК Автомобиль,
	|	ЗаказКлиентаТовары.Ссылка.Водитель КАК Водитель,
	|	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	СУММА(ЗаказКлиентаТовары.Номенклатура.Вес * ЗаказКлиентаТовары.КоличествоУпаковок) КАК Вес,
	|	СУММА(ЗаказКлиентаТовары.Номенклатура.Объем * ЗаказКлиентаТовары.КоличествоУпаковок) КАК Объем,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Номенклатура) КАК КоличествоПозиций,
	|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	|	ЗаказКлиентаТовары.Ссылка.ПрибытиеНаОтгрузку КАК НачалоРейсаПлан,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК КоличествоСкладов
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ЗаказКлиентаТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ЗаказКлиентаТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка.Номер,
	|	ЗаказКлиентаТовары.Ссылка.Дата,
	|	ЗаказКлиентаТовары.Ссылка.Автомобиль,
	|	ЗаказКлиентаТовары.Ссылка.Водитель,
	|	ЗаказКлиентаТовары.Ссылка.Склад,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ЗаказКлиентаТовары.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Ссылка.Партнер.ОсновнойМенеджер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Партнер.ОсновнойМенеджер
	|		ИНАЧЕ ЗаказКлиентаТовары.Ссылка.Менеджер
	|	КОНЕЦ,
	|	ЗаказКлиентаТовары.Ссылка.Партнер,
	|	ЗаказКлиентаТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка.Номер,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата,
	|	РеализацияТоваровУслугТовары.Ссылка.Партнер,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.Партнер.ОсновнойМенеджер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Ссылка.Партнер.ОсновнойМенеджер
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.Менеджер
	|	КОНЕЦ,
	|	РеализацияТоваровУслугТовары.Ссылка.Автомобиль,
	|	РеализацияТоваровУслугТовары.Ссылка.Водитель,
	|	РеализацияТоваровУслугТовары.Ссылка.Склад,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	СУММА(РеализацияТоваровУслугТовары.Номенклатура.Вес * РеализацияТоваровУслугТовары.КоличествоУпаковок),
	|	СУММА(РеализацияТоваровУслугТовары.Номенклатура.Объем * РеализацияТоваровУслугТовары.КоличествоУпаковок),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугТовары.Номенклатура),
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И РеализацияТоваровУслугТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка.Номер,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата,
	|	РеализацияТоваровУслугТовары.Ссылка.Автомобиль,
	|	РеализацияТоваровУслугТовары.Ссылка.Водитель,
	|	РеализацияТоваровУслугТовары.Ссылка.Склад,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.Партнер.ОсновнойМенеджер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Ссылка.Партнер.ОсновнойМенеджер
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.Менеджер
	|	КОНЕЦ,
	|	РеализацияТоваровУслугТовары.Ссылка.Партнер,
	|	РеализацияТоваровУслугТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Номер,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Дата,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.ПодразделениеПолучатель,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Менеджер,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Автомобиль,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Водитель,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.СкладПолучатель,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	СУММА(ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.Вес * ПередачаТоваровМеждуОрганизациямиТовары.КоличествоУпаковок),
	|	СУММА(ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.Объем * ПередачаТоваровМеждуОрганизациямиТовары.КоличествоУпаковок),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура),
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.СкладПолучатель = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка В(&МассивДокументов)
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Номер,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Дата,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Автомобиль,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Водитель,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.СкладПолучатель,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.ПодразделениеПолучатель,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка.Менеджер,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток
	|ИТОГИ
	|	СУММА(Вес),
	|	СУММА(Объем),
	|	СУММА(КоличествоПозиций),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоСкладов)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МаршрутныйЛист";
	ПервыйДокумент = Истина;
	Результат = Запрос.Выполнить();
	ВыборкаСсылка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылка.Следующий() Цикл
		Макет = ПолучитьМакет("ПФ_MXL_МаршрутныйЛист");
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент    = Ложь;       
		
		// 1 экземпляр
		Область = Макет.ПолучитьОбласть("ЗаголовокДокумента");
		Область.Параметры.ЗаголовокДокумента ="Маршрутный лист по складу "+ВыборкаСсылка.Номер+" от "+Формат(ВыборкаСсылка.Дата,"ДФ=""дд ММММ гггг 'г.' """); 
		ТабличныйДокумент.Вывести(Область);	
		ОбластьШапки = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьШапки.Параметры.ПредставлениеКлиента = СОКРЛП(ВыборкаСсылка.Партнер);
		ОбластьШапки.Параметры.Менеджер = ""+ВыборкаСсылка.менеджер+Телефон(ВыборкаСсылка.Менеджер);
		ОбластьШапки.Параметры.НачалоРейсаПлан = ВыборкаСсылка.НачалоРейсаПлан;
		если значениезаполнено(выборкаСсылка.Автомобиль) тогда
			СтрокаАвто= ""+ВыборкаСсылка.Автомобиль.Код+ " "+ВыборкаСсылка.Автомобиль.Марка+" ("+ВыборкаСсылка.Автомобиль.ГрузоподъемностьВТоннах+"т.,"+ВыборкаСсылка.Автомобиль.ВместимостьВКубическихМетрах+"м3)";
		иначе
			СтрокаАвто="";
		конецесли;
		ОбластьШапки.Параметры.ОкончаниеРейсаПлан=ВозвратитьВремяОкончанияРейса(ВыборкаСсылка.КоличествоСкладов,ВыборкаСсылка.НачалоРейсаПлан,ВыборкаСсылка.Автомобиль);
		ОбластьШапки.Параметры.ТранспортноеСредство=СтрокаАвто;
		ОбластьШапки.Параметры.Водитель =""+ВыборкаСсылка.Водитель+Телефон(ВыборкаСсылка.Водитель);
		ОбластьШапки.Параметры.Склад =ВыборкаСсылка.Склад;
		ТабличныйДокумент.Вывести(ОбластьШапки);	
		НомерСтроки=0;
		ОбластьШапкиТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьШапкиТаблицы);	
		ВыборкаСекции=ВыборкаСсылка.Выбрать();
		Пока ВыборкаСекции.Следующий() Цикл
			ОбластьСтрока                    = Макет.ПолучитьОбласть("СтрокаТаблицы");
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтрока.Параметры.НомерПП = НомерСтроки;
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСекции);
			ТабличныйДокумент.Вывести(ОбластьСтрока);	
		КонецЦикла;
		ОбластьИтоги  = Макет.ПолучитьОбласть("Итоги");
		ОбластьИтоги.Параметры.Заполнить(ВыборкаСсылка);
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		ОбластьРазделитель  = Макет.ПолучитьОбласть("Разделитель");
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
		
		// 2 экземпляр
		Область = Макет.ПолучитьОбласть("ЗаголовокДокумента");
		Область.Параметры.ЗаголовокДокумента ="Маршрутный лист по складу "+ВыборкаСсылка.Номер+" от "+Формат(ВыборкаСсылка.Дата,"ДФ=""дд ММММ гггг 'г.' """); 
		ТабличныйДокумент.Вывести(Область);	
		ОбластьШапки = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьШапки.Параметры.ПредставлениеКлиента = СОКРЛП(ВыборкаСсылка.Партнер);
		ОбластьШапки.Параметры.Менеджер = ""+ВыборкаСсылка.менеджер+Телефон(ВыборкаСсылка.Менеджер);
		ОбластьШапки.Параметры.НачалоРейсаПлан = ВыборкаСсылка.НачалоРейсаПлан;
		если значениезаполнено(выборкаСсылка.Автомобиль) тогда
			СтрокаАвто= ""+ВыборкаСсылка.Автомобиль.Код+ " "+ВыборкаСсылка.Автомобиль.Марка+" ("+ВыборкаСсылка.Автомобиль.ГрузоподъемностьВТоннах+"т.,"+ВыборкаСсылка.Автомобиль.ВместимостьВКубическихМетрах+"м3)";
		иначе
			СтрокаАвто="";
		конецесли;
		ОбластьШапки.Параметры.ОкончаниеРейсаПлан=ВозвратитьВремяОкончанияРейса(ВыборкаСсылка.КоличествоСкладов,ВыборкаСсылка.НачалоРейсаПлан,ВыборкаСсылка.Автомобиль);
		ОбластьШапки.Параметры.ТранспортноеСредство=СтрокаАвто;
		ОбластьШапки.Параметры.Водитель =""+ВыборкаСсылка.Водитель+Телефон(ВыборкаСсылка.Водитель);
		ОбластьШапки.Параметры.Склад =ВыборкаСсылка.Склад;
		ТабличныйДокумент.Вывести(ОбластьШапки);	
		НомерСтроки=0;
		ОбластьШапкиТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьШапкиТаблицы);	
		ВыборкаСекции=ВыборкаСсылка.Выбрать();
		Пока ВыборкаСекции.Следующий() Цикл
			ОбластьСтрока                    = Макет.ПолучитьОбласть("СтрокаТаблицы");
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтрока.Параметры.НомерПП = НомерСтроки;
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСекции);
			ТабличныйДокумент.Вывести(ОбластьСтрока);	
		КонецЦикла;
		ОбластьИтоги  = Макет.ПолучитьОбласть("Итоги");
		ОбластьИтоги.Параметры.Заполнить(ВыборкаСсылка);
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ВозвратитьВремяОкончанияРейса(КоличествоСкладов,НачалоРейса,Автомобиль)
	если количествоСкладов=0 тогда
		возврат НачалоРейса;
	Конецесли;
	если не ЗначениеЗаполнено(Автомобиль) тогда
		возврат НачалоРейса;
	конецесли;
	если не ЗначениеЗаполнено(НачалоРейса) тогда
		возврат НачалоРейса;
	конецесли;
	
	тоннаж=Автомобиль.ГрузоподъемностьВТоннах;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВремяОтгрузкиТоваровСоСклада.ВремяПогрузки
	|ИЗ
	|	РегистрСведений.ВремяОтгрузкиТоваровСоСклада КАК ВремяОтгрузкиТоваровСоСклада
	|ГДЕ
	|	ВремяОтгрузкиТоваровСоСклада.ТоннажАвтомобиля >= &Тоннаж
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяОтгрузкиТоваровСоСклада.ТоннажАвтомобиля";
	
	Запрос.УстановитьПараметр("Тоннаж", Тоннаж);
	
	Результат = Запрос.Выполнить();
	если не Результат.Пустой() тогда
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		возврат НачалоРейса+ВыборкаДетальныеЗаписи.ВремяПогрузки*КоличествоСкладов*60;
	иначе
		Возврат НачалоРейса;
	конецесли;
КонецФункции

Функция Телефон(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Объект
	|	И ФизическиеЛицаКонтактнаяИнформация.НомерТелефона <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПользователиКонтактнаяИнформация.НомерТелефона
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Ссылка = &Объект
	|	И ПользователиКонтактнаяИнформация.НомерТелефона <> """"";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Результат = Запрос.Выполнить();
	
	если не Результат.Пустой() тогда
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ", тел."+ВыборкаДетальныеЗаписи.НомерТелефона;
		КонецЦикла;
	иначе
		возврат "";
	конецесли;	
КонецФункции

// Печать ИНВ-3 по складам
Функция СформироватьПечатнуюФормуИНВ3(ДокументОснование, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНВ3";
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыИНВ3(ДокументОснование);
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляПечати) Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	ЗаполнитьТабличныйДокументИНВ3(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументИНВ3(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСлева = 10;
	ТабличныйДокумент.ПолеСнизу = 10;
	ТабличныйДокумент.ПолеСправа = 10;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Шапка = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ТабличнаяЧасть = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать();
	
	Шапка.Следующий();
	СтруктураРеквизитов = Новый Структура("Дата, Склад");
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шапка.Ссылка, СтруктураРеквизитов);
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ТабличнаяЧасть.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно напечатать форму ИНВ-3. Не оформлены складские акты,
		|и на %ДатаОстатков% на складе %Склад% нет остатков товаров, по которым оформлены пересчеты товаров.'");

		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ДатаОстатков%", Формат(КонецДня(СтруктураРеквизитов.Дата),"ДЛФ=D"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Склад%", СтруктураРеквизитов.Склад);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьИНВ3.ПФ_MXL_ИНВ3");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапки = Макет.ПолучитьОбласть("ШапкаТаблицы");     
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвалСтраницы = Макет.ПолучитьОбласть("ПодвалСтраницы");
	ОбластьПодвалОписи = Макет.ПолучитьОбласть("ПодвалОписи");
	
	ОбластьЗаголовок.Параметры.Заполнить(Шапка);
	ОбластьЗаголовок.Параметры.ФормаСобственностиЦенностей = НСтр("ru='в собственности организации'");
	ОбластьЗаголовок.Параметры.ДолжностьМОЛ1  = Шапка.ДолжностьКладовщика;
	ОбластьЗаголовок.Параметры.ФИОМОЛ1        = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Шапка.Кладовщик);
	ОбластьЗаголовок.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерДокумента, Ложь, Истина);
	ОбластьЗаголовок.Параметры.ОснованиеНомер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.ОснованиеНомер, Ложь, Истина);
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, Шапка.Ссылка);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ИтоговыеСуммы = Новый Структура;
	
	ИтоговыеСуммы.Вставить("ИтогоПоСтраницеФактКоличество",0);
	ИтоговыеСуммы.Вставить("ИтогоПоСтраницеФактСумма",0);
	ИтоговыеСуммы.Вставить("ИтогоПоСтраницеБухКоличество",0);
	ИтоговыеСуммы.Вставить("ИтогоПоСтраницеБухСумма",0);
	
	ИтоговыеСуммы.Вставить("ИтогоФактКоличество",0);
	ИтоговыеСуммы.Вставить("ИтогоФактСумма",0);
	ИтоговыеСуммы.Вставить("ИтогоБухКоличество",0);
	ИтоговыеСуммы.Вставить("ИтогоБухСумма",0);
	
	
	НомерСтроки = 0;
	НомерСтраницы = 2;
	ПервыйНомерСтроки = 1;    
	
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;
	
	КоличествоСтрок = ТабличнаяЧасть.Количество();
	
	Пока ТабличнаяЧасть.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтроки.Параметры.Заполнить(ТабличнаяЧасть);
		
		ОбластьСтроки.Параметры.ТоварНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
		ТабличнаяЧасть.ТоварНаименование);
		
		ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
		
		Если НомерСтроки = 1 Тогда // первая строка
			
			ТекстСтраница = НСтр("ru='Страница %НомерСтраницы%'");
			ТекстСтраница = СтрЗаменить(ТекстСтраница,"%НомерСтраницы%",2);
			ОбластьШапки.Параметры.НомерСтраницы = ТекстСтраница;
			
			ТабличныйДокумент.Вывести(ОбластьШапки);
			
		Иначе
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьСтроки);
			МассивВыводимыхОбластей.Добавить(ОбластьПодвалСтраницы);
			
			Если НомерСтроки <> 1 И Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				
				ОбластьПодвалСтраницы.Параметры.Заполнить(ИтоговыеСуммы);
				ОбластьПодвалСтраницы.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью = ЧислоПрописью(НомерСтроки - ПервыйНомерСтроки, ,",,,,,,,,0");
				ОбластьПодвалСтраницы.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ЧислоПрописью(ИтоговыеСуммы.ИтогоПоСтраницеФактКоличество, ,",,,,,,,,0");
				ОбластьПодвалСтраницы.Параметры.СуммаФактическиНаСтраницеПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(
					ИтоговыеСуммы.ИтогоПоСтраницеФактСумма,
					ВалютаРеглУчета,
					Ложь);
				
				ПервыйНомерСтроки = НомерСтроки;
				
				ТабличныйДокумент.Вывести(ОбластьПодвалСтраницы);
				
				// Очистим итоги по странице.
				ИтоговыеСуммы.ИтогоПоСтраницеФактКоличество = 0;
				ИтоговыеСуммы.ИтогоПоСтраницеБухКоличество = 0;
				// врез
				ИтоговыеСуммы.ИтогоПоСтраницеФактСумма = 0;
				ИтоговыеСуммы.ИтогоПоСтраницеБухСумма = 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				ТекстСтраница = НСтр("ru='Страница %НомерСтраницы%'");
				ТекстСтраница = СтрЗаменить(ТекстСтраница,"%НомерСтраницы%",НомерСтраницы);
				ОбластьШапки.Параметры.НомерСтраницы = ТекстСтраница;
				ТабличныйДокумент.Вывести(ОбластьШапки);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьСтроки);
		
		ИтоговыеСуммы.ИтогоПоСтраницеФактКоличество = ИтоговыеСуммы.ИтогоПоСтраницеФактКоличество + ТабличнаяЧасть.КоличествоФактическое;
		ИтоговыеСуммы.ИтогоПоСтраницеБухКоличество = ИтоговыеСуммы.ИтогоПоСтраницеБухКоличество + ТабличнаяЧасть.КоличествоПоУчету;
		
		ИтоговыеСуммы.ИтогоФактКоличество = ИтоговыеСуммы.ИтогоФактКоличество + ТабличнаяЧасть.КоличествоФактическое;
		ИтоговыеСуммы.ИтогоБухКоличество = ИтоговыеСуммы.ИтогоБухКоличество + ТабличнаяЧасть.КоличествоПоУчету;
		
		ИтоговыеСуммы.ИтогоПоСтраницеФактСумма = ИтоговыеСуммы.ИтогоПоСтраницеФактСумма + ТабличнаяЧасть.СуммаФактическая;
		ИтоговыеСуммы.ИтогоПоСтраницеБухСумма = ИтоговыеСуммы.ИтогоПоСтраницеБухСумма + ТабличнаяЧасть.СуммаПоУчету;
		
		ИтоговыеСуммы.ИтогоФактСумма = ИтоговыеСуммы.ИтогоФактСумма + ТабличнаяЧасть.СуммаФактическая;
		ИтоговыеСуммы.ИтогоБухСумма = ИтоговыеСуммы.ИтогоБухСумма + ТабличнаяЧасть.СуммаПоУчету;
		
	КонецЦикла;
	
	Если ПервыйНомерСтроки <> НомерСтроки ИЛИ ПервыйНомерСтроки = ТабличнаяЧасть.Количество() Тогда
		ОбластьПодвалСтраницы.Параметры.Заполнить(ИтоговыеСуммы);
		ОбластьПодвалСтраницы.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью = ЧислоПрописью(НомерСтроки - ПервыйНомерСтроки + 1, ,",,,,,,,,0");
		ОбластьПодвалСтраницы.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ЧислоПрописью(ИтоговыеСуммы.ИтогоПоСтраницеФактКоличество, ,",,,,,,,,0");
				ОбластьПодвалСтраницы.Параметры.СуммаФактическиНаСтраницеПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(
					ИтоговыеСуммы.ИтогоПоСтраницеФактСумма,
					ВалютаРеглУчета,
					Ложь);
		
		ТабличныйДокумент.Вывести(ОбластьПодвалСтраницы);
	КонецЕсли;
	
	ОбластьПодвалОписи.Параметры.КоличествоПорядковыхНомеровПрописью     = ЧислоПрописью(НомерСтроки, ,",,,,,,,,0");
	ОбластьПодвалОписи.Параметры.ОбщееКоличествоЕдиницФактическиПрописью = ЧислоПрописью(ИтоговыеСуммы.ИтогоФактКоличество, ,",,,,,,,,0");
	ОбластьПодвалОписи.Параметры.СуммаФактическиПрописью     			 = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтоговыеСуммы.ИтогоФактСумма,
		                                                                                                           			  ВалютаРеглУчета,
		                                                                                                                      Ложь);
	
	ОбластьПодвалОписи.Параметры.НачальныйНомерПоПорядку = 1;
	ОбластьПодвалОписи.Параметры.КонечныйНомерПоПорядку	 = НомерСтроки;
	
	ОбластьПодвалОписи.Параметры.ДолжностьПредседателя	 = НСтр("ru='Генеральный директор'");
	
	ОбластьПодвалОписи.Параметры.ДолжностьЧленаКомиссии2 = НСтр("ru='Главный бухгалтер'");
	
	ОбластьПодвалОписи.Параметры.ДолжностьМОЛ1           = Шапка.ДолжностьКладовщика;
	
	
	ОбластьПодвалОписи.Параметры.ДолжностьРасчетчика	 = НСтр("ru='Главный бухгалтер'");
	
	ТекстСтраница = НСтр("ru='Страница %НомерСтраницы%'");
	ТекстСтраница = СтрЗаменить(ТекстСтраница,"%НомерСтраницы%",НомерСтраницы + 1);
	ОбластьПодвалОписи.Параметры.НомерСтраницы = ТекстСтраница;
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.Вывести(ОбластьПодвалОписи);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатнойФормыИНВ3(ДокументОснование) 
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	ЗапросПредварительныхДанных = Новый Запрос;
	ЗапросПредварительныхДанных.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатыДокументов.Дата КАК Дата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПересортицаТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.ПересортицаТоваров КАК ПересортицаТоваров
	|	ГДЕ
	|		ПересортицаТоваров.Проведен = ИСТИНА
	|		И ПересортицаТоваров.Основание = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОприходованиеИзлишковТоваров.Дата
	|	ИЗ
	|		Документ.ОприходованиеИзлишковТоваров КАК ОприходованиеИзлишковТоваров
	|	ГДЕ
	|		ОприходованиеИзлишковТоваров.Проведен = ИСТИНА
	|		И ОприходованиеИзлишковТоваров.Основание = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписаниеНедостачТоваров.Дата
	|	ИЗ
	|		Документ.СписаниеНедостачТоваров КАК СписаниеНедостачТоваров
	|	ГДЕ
	|		СписаниеНедостачТоваров.Проведен = ИСТИНА
	|		И СписаниеНедостачТоваров.Основание = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПересчетТоваров.Дата
	|	ИЗ
	|		Документ.ПересчетТоваров КАК ПересчетТоваров
	|	ГДЕ
	|		ПересчетТоваров.Проведен = ИСТИНА
	|		И ПересчетТоваров.Ссылка = &ДокументОснование) КАК ДатыДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	ЗапросПредварительныхДанных.УстановитьПараметр("ДокументОснование", ДокументОснование);	
	ПредварительныеДанныеРезультат = ЗапросПредварительныхДанных.Выполнить().Выбрать();
	
	Если НЕ ПредварительныеДанныеРезультат.Следующий() Тогда
		ТекстСообщения = НСтр("ru = 'Печать %Документ% не выполнена: в указанный инвентаризационный период не найдены складские документы.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Строка(ДокументОснование));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ДокументОснование);
		Возврат Неопределено
	КонецЕсли;
	
	ДатаНачала 						  = НачалоДня(ПредварительныеДанныеРезультат.Дата);
	ДатаОкончания 					  = КонецДня(ПредварительныеДанныеРезультат.Дата);
	Склад							  = ДокументОснование.Склад;
	ВидЦены 						  = Справочники.ВидыЦен.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", 	   ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	   ДатаОкончания);
	Запрос.УстановитьПараметр("Склад", 			   Склад);
	Запрос.УстановитьПараметр("ДатаОстатков", 	   ДатаОкончания);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВидЦены", 		   ДокументОснование.ВидЦены);
	Запрос.УстановитьПараметр("ДатаНачалаИнвентаризации", ДокументОснование.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончанияИнвентаризации", ДокументОснование.ДатаОкончания);
	
	УчитыватьСебестоимостьТоваровПоВидамЗапасов = ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьТоваровПоВидамЗапасов");
	Запрос.УстановитьПараметр("УчитыватьСебестоимостьТоваровПоВидамЗапасов", УчитыватьСебестоимостьТоваровПоВидамЗапасов);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Аналитика.КлючАналитики КАК АналитикаУчетаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО ПересчетТоваровТовары.Номенклатура = Аналитика.Номенклатура
	|			И ПересчетТоваровТовары.Характеристика = Аналитика.Характеристика
	|			И (ПересчетТоваровТовары.Серия = Аналитика.Серия
	|				ИЛИ НЕ ПересчетТоваровТовары.СтатусУказанияСерий = 14)
	|			И ПересчетТоваровТовары.Ссылка.Склад = Аналитика.Склад
	|ГДЕ
	|	ПересчетТоваровТовары.Ссылка.Проведен
	|	И ПересчетТоваровТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.Выполнено)
	|	И ПересчетТоваровТовары.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписаниеНедостачТоваровТовары.АналитикаУчетаНоменклатуры
	|ИЗ
	|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
	|ГДЕ
	|	СписаниеНедостачТоваровТовары.Ссылка.Проведен
	|	И СписаниеНедостачТоваровТовары.Ссылка.Основание = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОприходованиеИзлишковТоваровТовары.АналитикаУчетаНоменклатуры
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
	|ГДЕ
	|	ОприходованиеИзлишковТоваровТовары.Ссылка.Проведен
	|	И ОприходованиеИзлишковТоваровТовары.Ссылка.Основание = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПересортицаТоваровТовары.АналитикаУчетаНоменклатуры
	|ИЗ
	|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	|ГДЕ
	|	ПересортицаТоваровТовары.Ссылка.Проведен
	|	И ПересортицаТоваровТовары.Ссылка.Основание = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПересчетТоваровТовары.Номенклатура,
	|	ПересчетТоваровТовары.Характеристика,
	|	ПересчетТоваровТовары.Серия,
	|	СУММА(ПересчетТоваровТовары.КоличествоФакт) КАК КоличествоФактическое,
	|	СУММА(ПересчетТоваровТовары.Количество) КАК КоличествоПоУчету
	|ПОМЕСТИТЬ ТаблицаИнвентаризации
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|ГДЕ
	|	ПересчетТоваровТовары.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	ПересчетТоваровТовары.Номенклатура,
	|	ПересчетТоваровТовары.Характеристика,
	|	ПересчетТоваровТовары.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.Характеристика,
	|	ЦеныНоменклатуры.Упаковка,
	|	ЦеныНоменклатуры.Цена
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ),
	|			(ВидЦены, Номенклатура, Характеристика) В
	|				(ВЫБРАТЬ
	|					&ВидЦены,
	|					Таблица.Номенклатура,
	|					Таблица.Характеристика
	|				ИЗ
	|					ТаблицаИнвентаризации КАК Таблица)) КАК ЦеныНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПересчетТоваров.Склад.ТекущийОтветственный КАК Кладовщик,
	|	ПересчетТоваров.Склад.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	ПересчетТоваров.Склад.Наименование КАК ПодразделениеПредставление,
	|	&ДатаНачалаИнвентаризации КАК ДатаНачала,
	|	&ДатаОкончанияИнвентаризации КАК ДатаОкончания,
	|	ПересчетТоваров.Дата КАК ОснованиеДата,
	|	ПересчетТоваров.Номер КАК ОснованиеНомер,
	|	ПересчетТоваров.Номер КАК НомерДокумента,
	|	&ДатаОкончания КАК ДатаДокумента,
	|	ПересчетТоваров.Ссылка,
	|	&ДатаОстатков КАК ДатаСнятияОстатков
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|ГДЕ
	|	ПересчетТоваров.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.АналитикаУчетаНоменклатуры.Наименование КАК Номенклатура,
	|	ТаблицаИнвентаризации.Характеристика,
	|	ТаблицаИнвентаризации.Серия,
	|	ТаблицаИнвентаризации.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ТаблицаИнвентаризации.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ТаблицаИнвентаризации.Серия.Наименование,
	|	ТаблицаИнвентаризации.КоличествоПоУчету,
	|	ТаблицаИнвентаризации.КоличествоФактическое,
	|	ВЫБОР
	|		КОГДА НЕ ЦеныНоменклатуры.Упаковка.Коэффициент ЕСТЬ NULL 
	|				И ЦеныНоменклатуры.Упаковка.Коэффициент <> 0
	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / ЦеныНоменклатуры.Упаковка.Коэффициент
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ТаблицаИнвентаризации.КоличествоПоУчету * ВЫБОР
	|		КОГДА НЕ ЦеныНоменклатуры.Упаковка.Коэффициент ЕСТЬ NULL 
	|				И ЦеныНоменклатуры.Упаковка.Коэффициент <> 0
	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / ЦеныНоменклатуры.Упаковка.Коэффициент
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ КАК СуммаПоУчету,
	|	ТаблицаИнвентаризации.КоличествоФактическое * ВЫБОР
	|		КОГДА НЕ ЦеныНоменклатуры.Упаковка.Коэффициент ЕСТЬ NULL 
	|				И ЦеныНоменклатуры.Упаковка.Коэффициент <> 0
	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / ЦеныНоменклатуры.Упаковка.Коэффициент
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ КАК СуммаФактическая,
	|	ТаблицаИнвентаризации.Номенклатура.Код КАК ТоварКод,
	|	ТаблицаИнвентаризации.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ТаблицаИнвентаризации.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИнвентаризации КАК ТаблицаИнвентаризации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|			ПО ТаблицаИнвентаризации.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|				И ТаблицаИнвентаризации.Характеристика = ЦеныНоменклатуры.Характеристика
	|		ПО ТаблицаНоменклатуры.АналитикаУчетаНоменклатуры.Номенклатура = ТаблицаИнвентаризации.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварНаименование";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Номенклатура.Код", "Номенклатура." + КолонкаКодов);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результаты = Запрос.ВыполнитьПакет();
	РезультатПоШапке = Результаты[3];
	РезультатПоТабличнойЧасти = Результаты[4];
	
	Возврат Новый Структура(
	"РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке,
	РезультатПоТабличнойЧасти);
	
КонецФункции

// Печать Накладная на перемещение
Функция СформироватьПечатнуюФормуНакладнаяНаПеремещение(МассивОбъектов, ОбъектыПечати,ПараметрыПечати)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка.Дата КАК Дата,
	|	ПеремещениеТоваровТовары.Ссылка.Номер КАК Номер,
	|	ПеремещениеТоваровТовары.Ссылка.Организация КАК ОрганизацияПредставление,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Товар,
	|	СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок) КАК Количество,
	|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	МАКСИМУМ(СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СуммаДопРасходов) КАК Сумма,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.Представление КАК ОтправительПредставление,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.Представление КАК ПолучательПредставление,
	|	ПеремещениеТоваровТовары.Номенклатура.Код КАК Код,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|	ПеремещениеТоваровТовары.Ссылка.ПеремещениеНаФилиал
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО ПеремещениеТоваровТовары.Ссылка = СебестоимостьТоваров.Регистратор
	|			И ПеремещениеТоваровТовары.Номенклатура = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель = СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ПеремещениеТоваровТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ПеремещениеТоваровТовары.Ссылка.СкладПолучатель = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (ИСТИНА = РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Ссылка.Номер,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.Представление,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.Представление,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Код
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НакладнаяНаПеремещение";
	
	Результат = Запрос.Выполнить();
	
	Макет = ПолучитьМакет("ПФ_MXL_НакладнаяНаПеремещение");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкатаблицы = Макет.ПолучитьОбласть("Шапкатаблицы");
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
	
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	
	ПервыйДокумент = Истина;
	
	ВыборкаДокументы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ОбластьШтрихкода = Макет.ПолучитьОбласть("ОбластьШтрихкода");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьШтрихкода, ВыборкаДокументы.Ссылка);
		ТабДокумент.Вывести(ОбластьШтрихкода);
		
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ВыборкаДокументы, "Накладная на перемещение");
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		если ВыборкаДокументы.ПеремещениеНаФилиал тогда
		ОбластьЗаголовок.Параметры.ОрганизацияПредставление="ООО Альтерра";
		конецесли;
		ТабДокумент.Вывести(ОбластьЗаголовок);
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// Вывод строк документа.
		
		НомерПП=0;
		
		ВыборкаСтроки = ВыборкаДокументы.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			НомерПП=НомерПП+1;
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			ОбластьСтрока.Параметры.НомерСтроки=НомерПП;
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;

		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокументы);
		ТабДокумент.Вывести(ОбластьПодвал);
		
		ТабДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
		
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, МассивОбъектов) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка               КАК Ссылка,
	|	ДанныеДокументов.Валюта               КАК Валюта,
	|	ДанныеДокументов.Организация          КАК Организация,
	|	ДанныеДокументов.Подразделение        КАК Подразделение,
	|	ДанныеДокументов.Склад                КАК Склад
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
	|
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Выполнить();
	
	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Истина, НЕ ПараметрыПечати.ПечатьВВалюте);
	ПродажиСервер.ПоместитьВременнуюТаблицуСчетовФактур(МенеджерВременныхТаблиц);
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	&ПредставлениеСчетФактура КАК ПредставлениеДокумента,
	|	ЕСТЬNULL(СчетаФактуры.Номер, НЕОПРЕДЕЛЕНО) КАК Номер,
	|	ЕСТЬNULL(СчетаФактуры.Дата, НЕОПРЕДЕЛЕНО) КАК Дата,
	|	ЕСТЬNULL(СчетаФактуры.НомерИсправления, НЕОПРЕДЕЛЕНО) КАК НомерИсправления,
	|	ЕСТЬNULL(СчетаФактуры.ДатаИсправления, НЕОПРЕДЕЛЕНО) КАК ДатаИсправления,
	|	ЕСТЬNULL(СчетаФактуры.Исправление, ЛОЖЬ) КАК Исправление,
	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправленияСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправленияСчетаФактуры,
	|	ЛОЖЬ КАК КорректировочныйСчетФактура,
	|	ЕСТЬNULL(СчетаФактуры.СтрокаПлатежноРасчетныеДокументы, """") КАК СтрокаПоДокументу,
	|	ЕСТЬNULL(СчетаФактуры.Валюта, НЕОПРЕДЕЛЕНО) КАК ВалютаСчетаФактуры,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СчетаФактуры.ГоловнаяОрганизация, РеализацияТоваровУслуг.Организация) КАК Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс КАК Префикс,
	|	ЕСТЬNULL(СчетаФактуры.ИндексПодразделения, 0) КАК ИндексПодразделения,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СчетаФактуры.Грузоотправитель, РеализацияТоваровУслуг.Организация)
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ЕСТЬNULL(СчетаФактуры.ВыводитьКППГрузоотправителя, ЛОЖЬ) КАК ВыводитьКППГрузоотправителя,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	РеализацияТоваровУслуг.Валюта.Код КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА НоменклатураДокументов.ЕстьУслуги
	|				И НЕ НоменклатураДокументов.ЕстьТовары
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоУслуги,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПередачаНаКомиссию,
	|	СчетаФактуры.КПППокупателя
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО РеализацияТоваровУслуг.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО РеализацияТоваровУслуг.Ссылка = СчетаФактуры.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТаблицаТоваров.Ссылка КАК Ссылка,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА НЕ ТаблицаТоваров.ЭтоТовар
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК ЕстьУслуги,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ТаблицаТоваров.ЭтоНеВозвратнаяТара
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК ЕстьТовары
	|		ИЗ
	|			ТаблицаТоваров КАК ТаблицаТоваров
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаТоваров.Ссылка) КАК НоменклатураДокументов
	|		ПО РеализацияТоваровУслуг.Ссылка = НоменклатураДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО РеализацияТоваровУслуг.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.Количество
	|		ИНАЧЕ ТаблицаДокумента.КоличествоУпаковок
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫРАЗИТЬ((ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаБезНДС * ТаблицаДокумента.Распределять * ВЫБОР
	|						КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|							ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|						ИНАЧЕ 0
	|					КОНЕЦ) / ТаблицаДокумента.Количество КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ((ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаБезНДС * ТаблицаДокумента.Распределять * ВЫБОР
	|					КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|						ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|					ИНАЧЕ 0
	|				КОНЕЦ) / ТаблицаДокумента.КоличествоУпаковок КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Цена,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаБезНДС * ТаблицаДокумента.Распределять * ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаБезНДС,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДС + ТаблицаДокумента.СуммаНДС * ТаблицаДокумента.Распределять * ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС + (ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС) * ТаблицаДокумента.Распределять * ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаСНДС,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА РеализацияТоваровУслугТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаУслуг,
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Распределять = 1
	|						ТОГДА РеализацияТоваровУслугТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаТоваров,
	|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугТовары.Ссылка) КАК РаспределениеУслуг
	|		ПО ТаблицаДокумента.Ссылка = РаспределениеУслуг.Ссылка
	|ГДЕ
	|	(ТаблицаДокумента.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ТаблицаДокумента.Ссылка.ВернутьМногооборотнуюТару)
	|	И ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	Запрос.УстановитьПараметр("ПредставлениеСчетФактура", НСтр("ru='счет-фактура'"));
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыУПД(ПараметрыПечати, МассивОбъектов) Экспорт
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка               КАК Ссылка,
	|	ДанныеДокументов.Валюта               КАК Валюта,
	|	ДанныеДокументов.Организация          КАК Организация,
	|	ДанныеДокументов.Подразделение        КАК Подразделение,
	|	ДанныеДокументов.Склад                КАК Склад
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
	|
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Выполнить();
	
	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Истина);
	ПродажиСервер.ПоместитьВременнуюТаблицуСчетовФактур(МенеджерВременныхТаблиц);
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ТаблицаТоваров.ЭтоТовар
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьУслуги,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТаблицаТоваров.ЭтоТовар
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьТовары
	|ПОМЕСТИТЬ НоменклатураДокументов
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	&ПредставлениеСчетФактура КАК ПредставлениеДокумента,
	|	1 КАК СтатусУПД,
	|	ЕСТЬNULL(СчетаФактуры.Номер, НЕОПРЕДЕЛЕНО) КАК Номер,
	|	ЕСТЬNULL(СчетаФактуры.Дата, НЕОПРЕДЕЛЕНО) КАК Дата,
	|	ЕСТЬNULL(СчетаФактуры.НомерИсправления, НЕОПРЕДЕЛЕНО) КАК НомерИсправления,
	|	ЕСТЬNULL(СчетаФактуры.ДатаИсправления, НЕОПРЕДЕЛЕНО) КАК ДатаИсправления,
	|	ЕСТЬNULL(СчетаФактуры.Исправление, ЛОЖЬ) КАК Исправление,
	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправленияСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправленияСчетаФактуры,
	|	ЛОЖЬ КАК КорректировочныйСчетФактура,
	|	ЕСТЬNULL(СчетаФактуры.СтрокаПлатежноРасчетныеДокументы, """") КАК СтрокаПоДокументу,
	|	ЕСТЬNULL(СчетаФактуры.Валюта, НЕОПРЕДЕЛЕНО) КАК ВалютаСчетаФактуры,
	|	ДанныеДокумента.Партнер КАК Партнер,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СчетаФактуры.ГоловнаяОрганизация, ДанныеДокумента.Организация) КАК Организация,
	|	ДанныеДокумента.Организация.Префикс КАК Префикс,
	|	ЕСТЬNULL(СчетаФактуры.ИндексПодразделения, 0) КАК ИндексПодразделения,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Контрагент
	|		ИНАЧЕ ДанныеДокумента.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СчетаФактуры.Грузоотправитель, ДанныеДокумента.Организация)
	|		ИНАЧЕ ДанныеДокумента.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ЕСТЬNULL(СчетаФактуры.ВыводитьКППГрузоотправителя, ЛОЖЬ) КАК ВыводитьКППГрузоотправителя,
	|	ДанныеДокумента.АдресДоставки КАК АдресДоставки,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ДанныеДокумента.Валюта.Код КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА НоменклатураДокументов.ЕстьУслуги
	|				И НЕ НоменклатураДокументов.ЕстьТовары
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоУслуги,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПередачаНаКомиссию,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.ДоверенностьНомер КАК ДоверенностьНомер,
	|	ДанныеДокумента.ДоверенностьДата КАК ДоверенностьДата,
	|	ДанныеДокумента.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	ДанныеДокумента.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	ДанныеДокумента.Отпустил.Наименование КАК Кладовщик,
	|	ДанныеДокумента.ОтпустилДолжность КАК ДолжностьКладовщика,
	|	ЕСТЬNULL(СчетаФактуры.КПППокупателя, ДанныеДокумента.Контрагент.КПП) КАК КПППокупателя
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ДанныеДокумента.Ссылка = СчетаФактуры.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураДокументов КАК НоменклатураДокументов
	|		ПО ДанныеДокумента.Ссылка = НоменклатураДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ДанныеДокумента.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаДокумента.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаДокумента.Номенклатура.Код
	|	КОНЕЦ КАК НоменклатураКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.Количество
	|		ИНАЧЕ ТаблицаДокумента.КоличествоУпаковок
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫРАЗИТЬ((ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаБезНДС * ТаблицаДокумента.Распределять * ВЫБОР
	|						КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|							ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|						ИНАЧЕ 0
	|					КОНЕЦ) / ТаблицаДокумента.Количество КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ((ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаБезНДС * ТаблицаДокумента.Распределять * ВЫБОР
	|					КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|						ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|					ИНАЧЕ 0
	|				КОНЕЦ) / ТаблицаДокумента.КоличествоУпаковок КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Цена,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаБезНДС * ТаблицаДокумента.Распределять * ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаБезНДС,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДС + ТаблицаДокумента.СуммаНДС * ТаблицаДокумента.Распределять * ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС + (ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС) * ТаблицаДокумента.Распределять * ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА РаспределениеУслуг.СуммаУслуг / РаспределениеУслуг.СуммаТоваров
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаСНДС,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА РеализацияТоваровУслугТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаУслуг,
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Распределять = 1
	|						ТОГДА РеализацияТоваровУслугТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК СуммаТоваров,
	|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугТовары.Ссылка) КАК РаспределениеУслуг
	|		ПО ТаблицаДокумента.Ссылка = РаспределениеУслуг.Ссылка
	|ГДЕ
	|	(ТаблицаДокумента.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ТаблицаДокумента.Ссылка.ВернутьМногооборотнуюТару)
	|	И ВЫБОР
	|			КОГДА РаспределениеУслуг.СуммаТоваров <> 0
	|				ТОГДА ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	Запрос.УстановитьПараметр("ПредставлениеСчетФактура", НСтр("ru='счет-фактура'"));
	Запрос.УстановитьПараметр("КолонкаКодов", КолонкаКодов);
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[1];
	РезультатПоТабличнойЧасти = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Функция ПечатьБюджетнаяЗаявка(МассивОбъектов,ОбъектыПечати)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка.Дата КАК Дата,
	|	ЗаказПоставщику.Ссылка.Номер КАК Номер,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ЗаказПоставщику.Ссылка КАК Ссылка,
	|	ЗаказПоставщику.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПоставщику.Валюта,
	|	ЗаказПоставщику.Менеджер.Наименование КАК Менеджер,
	|	ЗаказПоставщику.БанковскийСчет,
	|	ЗаказПоставщику.ДополнительнаяИнформация,
	|	ЗаказПоставщику.Договор.Дата,
	|	ЗаказПоставщику.Договор.Номер,
	|	ЗаказПоставщику.Договор
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_БюджетнаяЗаявка";
	Результат = Запрос.Выполнить();
	Макет = ПолучитьМакет("ПФ_MXL_БюджетнаяЗаявка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	ПервыйДокумент = Истина;
	ДанныеПечати = Результат.Выбрать();
	Пока ДанныеПечати.Следующий() Цикл
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);
		СведенияОПлательщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
		ОбластьЗаголовок.Параметры.Плательщик = СведенияОПлательщике.СокращенноеНаименование;
		если значениезаполнено(Данныепечати.договор) тогда
			БанковскийСчет=Данныепечати.договор.БанковскийСчетКонтрагента;
		иначе
			БанковскийСчет=Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		конецесли;
		СведенияОПолучателе=ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата,,БанковскийСчет);
		ОбластьЗаголовок.Параметры.Заполнить(СведенияОполучателе);
		ОбластьЗаголовок.Параметры.СтрокаЗаявки="	Прошу перечислить денежные средства в сумме "+ДанныеПечати.СуммаДокумента+" рублей по следующим реквизитам:";       
		если  значениеЗаполнено(ДанныеПечати.ДоговорНомер) тогда
			ОбластьЗаголовок.Параметры.Договор= "по договору №"+ДанныеПечати.ДоговорНомер+" от "+ФОРМАТ(ДанныеПечати.ДоговорДата,"ДЛФ=DD");
		конецесли;
		ОбластьЗаголовок.Параметры.Менеджер=ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер);
		
		ТабДокумент.Вывести(ОбластьЗаголовок);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	Возврат ТабДокумент;
КонецФункции

Функция ПечатьАнализаНаценки(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Дата
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КоммерческоеПредложениеКлиенту.Ссылка,
	|	КоммерческоеПредложениеКлиенту.Дата
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
	|ГДЕ
	|	КоммерческоеПредложениеКлиенту.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Дата
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
	
	ЗапросДокументов.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = ЗапросДокументов.Выполнить();
	
	ВыборкаПоДокументам = РезультатЗапроса.Выбрать();
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнализТорговойНаценки";
	Макет = ПолучитьМакет("ПФ_MXL_АнализНаценки");
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		ПервыйДокумент = Истина;
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка=Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьТовар=Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьПодвал=Макет.ПолучитьОбласть("Подвал");
		ТипДокумента=?(Типзнч(ВыборкаПоДокументам.Ссылка)=тип("ДокументСсылка.РеализацияТоваровУслуг"),"Реализация товаров ","Заказ клиента");
		ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ВыборкаПоДокументам.Ссылка,ТипДокумента);
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура,
		|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК Количество,
		|	СУММА(ЗаказКлиентаТовары.СуммаСНДС) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказКлиентаТовары.КоличествоУпаковок <> 0
		|				ТОГДА ЗаказКлиентаТовары.СуммаСНДС / ЗаказКлиентаТовары.КоличествоУпаковок
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|				ТОГДА (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ * ЗаказКлиентаТовары.КоличествоУпаковок) КАК Себестоимость,
		|	СУММА(ЗаказКлиентаТовары.СуммаСНДС - ВЫБОР
		|			КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|				ТОГДА (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * ЗаказКлиентаТовары.КоличествоУпаковок
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НаценкаСумма,
		|	ВЫБОР
		|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|			ТОГДА СУММА(ЗаказКлиентаТовары.СуммаСНДС - (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * ЗаказКлиентаТовары.КоличествоУпаковок) / СУММА((СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * ЗаказКлиентаТовары.КоличествоУпаковок)
		|		ИНАЧЕ 1
		|	КОНЕЦ * 100 КАК НаценкаПроцент,
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗаказКлиентаТовары.Номенклатура.Код КАК Код
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&ДатаДокумента, ) КАК СебестоимостьТоваровОстатки
		|		ПО ЗаказКлиентаТовары.Номенклатура = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура
		|			И ЗаказКлиентаТовары.Склад = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.МестоХранения
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения,
		|	СебестоимостьТоваровОстатки.КоличествоОстаток,
		|	ЗаказКлиентаТовары.Номенклатура.Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КоммерческоеПредложениеКлиентуТовары.Ссылка,
		|	КоммерческоеПредложениеКлиентуТовары.Номенклатура,
		|	СУММА(КоммерческоеПредложениеКлиентуТовары.КоличествоУпаковок),
		|	СУММА(КоммерческоеПредложениеКлиентуТовары.СуммаСНДС),
		|	СУММА(ВЫБОР
		|			КОГДА КоммерческоеПредложениеКлиентуТовары.КоличествоУпаковок <> 0
		|				ТОГДА КоммерческоеПредложениеКлиентуТовары.СуммаСНДС / КоммерческоеПредложениеКлиентуТовары.КоличествоУпаковок
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|				ТОГДА (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ * КоммерческоеПредложениеКлиентуТовары.КоличествоУпаковок),
		|	СУММА(КоммерческоеПредложениеКлиентуТовары.СуммаСНДС - ВЫБОР
		|			КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|				ТОГДА (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * КоммерческоеПредложениеКлиентуТовары.КоличествоУпаковок
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	ВЫБОР
		|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|			ТОГДА СУММА(КоммерческоеПредложениеКлиентуТовары.СуммаСНДС - (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * КоммерческоеПредложениеКлиентуТовары.КоличествоУпаковок) / СУММА((СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * КоммерческоеПредложениеКлиентуТовары.КоличествоУпаковок)
		|		ИНАЧЕ 1
		|	КОНЕЦ * 100,
		|	КоммерческоеПредложениеКлиентуТовары.Номенклатура.ЕдиницаИзмерения,
		|	КоммерческоеПредложениеКлиентуТовары.Номенклатура.Код
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиентуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&ДатаДокумента, ) КАК СебестоимостьТоваровОстатки
		|		ПО КоммерческоеПредложениеКлиентуТовары.Номенклатура = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура
		|			И КоммерческоеПредложениеКлиентуТовары.Ссылка.Склад = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Склад
		|ГДЕ
		|	КоммерческоеПредложениеКлиентуТовары.Ссылка = &Ссылка
		|	И КоммерческоеПредложениеКлиентуТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|
		|СГРУППИРОВАТЬ ПО
		|	КоммерческоеПредложениеКлиентуТовары.Ссылка,
		|	КоммерческоеПредложениеКлиентуТовары.Номенклатура,
		|	КоммерческоеПредложениеКлиентуТовары.Номенклатура.ЕдиницаИзмерения,
		|	СебестоимостьТоваровОстатки.КоличествоОстаток,
		|	КоммерческоеПредложениеКлиентуТовары.Номенклатура.Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	СУММА(РеализацияТоваровУслугТовары.КоличествоУпаковок),
		|	СУММА(РеализацияТоваровУслугТовары.СуммаСНДС),
		|	СУММА(ВЫБОР
		|			КОГДА РеализацияТоваровУслугТовары.КоличествоУпаковок <> 0
		|				ТОГДА РеализацияТоваровУслугТовары.СуммаСНДС / РеализацияТоваровУслугТовары.КоличествоУпаковок
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|				ТОГДА (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ * РеализацияТоваровУслугТовары.КоличествоУпаковок),
		|	СУММА(РеализацияТоваровУслугТовары.СуммаСНДС - ВЫБОР
		|			КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|				ТОГДА (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * РеализацияТоваровУслугТовары.КоличествоУпаковок
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	ВЫБОР
		|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток <> 0
		|			ТОГДА СУММА(РеализацияТоваровУслугТовары.СуммаСНДС - (СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * РеализацияТоваровУслугТовары.КоличествоУпаковок) / СУММА((СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.СуммаДопРасходовОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток * РеализацияТоваровУслугТовары.КоличествоУпаковок)
		|		ИНАЧЕ 1
		|	КОНЕЦ * 100,
		|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.Номенклатура.Код
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&ДатаДокумента, ) КАК СебестоимостьТоваровОстатки
		|		ПО РеализацияТоваровУслугТовары.Номенклатура = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура
		|			И РеализацияТоваровУслугТовары.Ссылка.Склад = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.МестоХранения
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения,
		|	СебестоимостьТоваровОстатки.КоличествоОстаток,
		|	РеализацияТоваровУслугТовары.Номенклатура.Код
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(НаценкаСумма),
		|	СРЕДНЕЕ(НаценкаПроцент)
		|ПО
		|	ОБЩИЕ");
		
		Запрос.УстановитьПараметр("Ссылка", ВыборкаПоДокументам.Ссылка );
		Запрос.УстановитьПараметр("ДатаДокумента", ВыборкаПоДокументам.Дата );
		
		Результат 		= Запрос.Выполнить();
		ВыборкаИтоги=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		пока ВыборкаИтоги.Следующий() цикл
			ВыборкаПоТоварам=ВыборкаИтоги.Выбрать();
			НомерСтроки=0;
			Пока ВыборкаПоТоварам.Следующий() Цикл
				НомерСтроки = НомерСтроки + 1;
				ОбластьТовар.Параметры.НомерСтроки = НомерСтроки;
				ОбластьТовар.Параметры.Заполнить(ВыборкаПоТоварам);
				ТабличныйДокумент.Вывести(ОбластьТовар);
			КонецЦикла;	
			
			ОбластьПодвал.Параметры.Заполнить(ВыборкаИтоги);
			ОбластьПодвал.Параметры.НаценкаПроцент=?((ВыборкаИтоги.Сумма-ВыборкаИтоги.НаценкаСумма)<>0,ВыборкаИтоги.НаценкаСумма/(ВыборкаИтоги.Сумма-ВыборкаИтоги.НаценкаСумма)*100,100);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		конеццикла;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
Процедура ВывестиШтрихкодПоСекциям(ТабличныйДокумент, Макет, Знач ОбластьМакета, Документ, Секция)
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	// поиск ШК по секции документа реализации
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Документ = &Документ
	|	И ШтрихкодыПоСекциямДокумента.Секция = &Секция";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Секция", Секция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Штрихкод = Выборка.Штрихкод;
		
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(ОбластьМакета.Рисунки.КартинкаШтрихкода.Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(ОбластьМакета.Рисунки.КартинкаШтрихкода.Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        Штрихкод);
		ПараметрыШтрихкода.Вставить("ТипКода",         4); // Code128
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    6);
		
		ОбластьМакета.Рисунки.КартинкаШтрихкода.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
КонецПроцедуры

#Область Печать_УКД

Функция СформироватьПечатнуюФормуУКД(СтруктураТипов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УКД";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыУКД(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументУКД(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
		
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументУКД(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьФормДополнительно.ПФ_MXL_УниверсальныйКорректировочныйДокумент");
	
	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		Если ДанныеПечати.ПечатьНеТребуется Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 универсальный корректировочный документ не применяется.'"),
			ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка);
			
		Иначе
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Выводим общие реквизиты шапки
			СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
			СведенияОКонтрагенте = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата);
			ЗаполнитьРеквизитыШапкиУКД(ДанныеПечати, СведенияОбОрганизации, СведенияОКонтрагенте, Макет, ТабличныйДокумент);
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			НомерСтраницы = 1;
			
			// Инициализация итогов в документе
			ИтоговыеСуммы = СтруктураИтоговыеСуммы();
			
			// Создаем массив для проверки вывода
			МассивВыводимыхОбластей = Новый Массив;
			
			// Выводим многострочную часть документа
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			
			ЗаполнитьРеквизитыПодвалаУКД(ОбластьПодвал, ДанныеПечати, СведенияОбОрганизации, СведенияОКонтрагенте);
			
			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
			
			СтрокаТовары = ВыборкаПоДокументам.Выбрать();
			КоличествоСтрок = СтрокаТовары.Количество();
			ТолькоСтавкаБезНДС = Истина;
			НомерСтроки = 0;
			Пока СтрокаТовары.Следующий() Цикл
				
				НомерСтроки = НомерСтроки + 1;
				ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьСтрока, НомерСтроки);
				ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьСтрока);
				
				СтруктураПараметров = Новый Структура;
				Если СтрокаТовары.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru='без НДС'"));
					СтруктураПараметров.Вставить("СуммаНДС", НСтр("ru='без НДС'"));
				ИначеЕсли СтрокаТовары.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
					СтруктураПараметров.Вставить("СуммаНДС", 0);
					ТолькоСтавкаБезНДС = Ложь;
				Иначе
					ТолькоСтавкаБезНДС = Ложь;
				КонецЕсли;
				СтруктураПараметров.Вставить("Акциз", НСтр("ru='без акциза'"));
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
				
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
				
				Если НомерСтроки = КоличествоСтрок Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьИтого);
					МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
				КонецЕсли;
				
				Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
					ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактурыНаПечать(ДанныеПечати.Номер, ДанныеПечати.ИндексПодразделения);
					ОбластьНумерацияЛистов.Параметры.Дата = Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
					ОбластьНумерацияЛистов.Параметры.НомерСтраницы = НомерСтраницы;
					
					ТабличныйДокумент.Вывести(ОбластьНумерацияЛистов);
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);
				
			КонецЦикла;
			
			// Выводим итоги по документу
			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
			
			Если ТолькоСтавкаБезНДС Тогда
				ИтоговыеСуммы.ИтогоСуммаНДС = НСтр("ru='без НДС'");
			КонецЕсли;
			ОбластьИтого.Параметры.Заполнить(ИтоговыеСуммы);
			ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьИтого);
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			КоличествоСтраниц = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ составлен на %1 %2'"),
			НомерСтраницы,
			ОбщегоНазначенияУТКлиентСервер.ФормаМножественногоЧисла(
			НСтр("ru = 'листе'"), НСтр("ru = 'листах'"), НСтр("ru = 'листах'"), НомерСтраницы));
			СтруктураПараметров = Новый Структура("КоличествоСтраниц", КоличествоСтраниц);
			ОбластьПодвал.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Ссылка);
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьРеквизитыШапкиУКД(ДанныеПечати, СведенияОПоставщике, СведенияОПокупателе, Макет, ТабличныйДокумент)
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета,
	ДанныеПечати.Ссылка);
	
	НомераДаты = Новый Структура("Номер, Дата, НомерИсправления, ДатаИсправления, НомерСчетаФактуры, ДатаСчетаФактуры, НомерИсправленияСчетаФактуры, ДатаИсправленияСчетаФактуры");
	
	НомераДаты.Номер = НомерСчетаФактурыНаПечать(ДанныеПечати.Номер, ДанныеПечати.ИндексПодразделения);
	НомераДаты.Дата  = Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
	Если ДанныеПечати.Исправление Тогда
		НомераДаты.НомерИсправления = ДанныеПечати.НомерИсправления;
		НомераДаты.ДатаИсправления  = Формат(ДанныеПечати.ДатаИсправления, "ДЛФ=ДД; ДП=--");
	Иначе
		НомераДаты.НомерИсправления = "--";
		НомераДаты.ДатаИсправления  = "--";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПечати.НомерСчетаФактуры) Тогда
		
		НомераДаты.НомерСчетаФактуры = НомерСчетаФактурыНаПечать(ДанныеПечати.НомерСчетаФактуры, ДанныеПечати.ИндексПодразделения, Истина);
		НомераДаты.ДатаСчетаФактуры = Формат(ДанныеПечати.ДатаСчетаФактуры,"ДЛФ=ДД; ДП=--");
		НомераДаты.НомерИсправленияСчетаФактуры = ?(ЗначениеЗаполнено(ДанныеПечати.НомерИсправленияСчетаФактуры),
		ДанныеПечати.НомерИсправленияСчетаФактуры, "--");
		НомераДаты.ДатаИсправленияСчетаФактуры = Формат(ДанныеПечати.ДатаИсправленияСчетаФактуры, "ДЛФ=ДД; ДП=--");
		
	Иначе
		НомераДаты.НомерСчетаФактуры            = "--";
		НомераДаты.ДатаСчетаФактуры             = "--";
		НомераДаты.НомерИсправленияСчетаФактуры = "--";
		НомераДаты.ДатаИсправленияСчетаФактуры  = "--";
	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(НомераДаты);
	
	ПараметрыШапки = Новый Структура;
	ПараметрыШапки.Вставить("СтатусУКД", ДанныеПечати.СтатусУКД);
	
	// Выводим данные о поставщике.
	ПараметрыШапки.Вставить("ПредставлениеПоставщика", СведенияОПоставщике.ОфициальноеНаименование);
	ПараметрыШапки.Вставить("АдресПоставщика",
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес"));
	
	Если ДанныеПечати.ВыводитьКППГрузоотправителя Тогда
		СведенияОГрузоотправителе = СведенияОГрузоотправителе(ДанныеПечати);
		КПП = СведенияОГрузоотправителе.КПП;
	Иначе
		КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
	КонецЕсли;
	ПараметрыШапки.Вставить("ИННПоставщика",
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН", Ложь)
	+ ?(Не ПустаяСтрока(КПП), "/" + КПП, ""));
	
	ПараметрыШапки.Вставить("ПредставлениеПокупателя",
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование", Ложь));
	ПараметрыШапки.Вставить("АдресПокупателя",
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес", Ложь));
	
	ПараметрыШапки.Вставить("ИННПокупателя",
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь)
	+ ?(Не ПустаяСтрока(ДанныеПечати.КПППокупателя), "/" + ДанныеПечати.КПППокупателя, ""));
	
	
	ПараметрыШапки.Вставить("Валюта", НСтр("ru='Российский рубль, 643'"));
	
	ОбластьМакета.Параметры.Заполнить(ПараметрыШапки);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПодвалаУКД(ОбластьПодвала, ДанныеПечати, СведенияОбОрганизации, СведенияОКонтрагенте)
	
	ОбластьПодвала.Параметры.Заполнить(ДанныеПечати);
	
	СтруктураПараметров = Новый Структура;
	
	Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураПараметров.Вставить("ФИОРуководителя", ДанныеПечати.Руководитель);
		СтруктураПараметров.Вставить("ФИОГлавногоБухгалтера", ДанныеПечати.ГлавныйБухгалтер);
	Иначе
		СтруктураПараметров.Вставить("ФИОПБОЮЛ", ДанныеПечати.Руководитель);
		СтруктураПараметров.Вставить("Свидетельство", СведенияОбОрганизации.Свидетельство);
	КонецЕсли;
	
	ИННПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ИНН,", Ложь);
	КПППоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПППоставщика) Тогда
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
		СведенияОбОрганизации.ОфициальноеНаименование,
		ИННПоставщика,
		КПППоставщика);
	ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
		СведенияОбОрганизации.ОфициальноеНаименование,
		ИННПоставщика);
	Иначе
		ПредставлениеОрганизации = СведенияОбОрганизации.ОфициальноеНаименование;
	КонецЕсли;
	СтруктураПараметров.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
	
	ИННПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ИНН,", Ложь);
	КПППокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПППокупателя) Тогда
		ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
		ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ПолноеНаименование", Ложь),
		ИННПокупателя,
		КПППокупателя);
	ИначеЕсли ЗначениеЗаполнено(ИННПокупателя) Тогда
		ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
		ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ПолноеНаименование", Ложь),
		ИННПокупателя);
	Иначе
		ПредставлениеКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "ПолноеНаименование", Ложь);
	КонецЕсли;
	СтруктураПараметров.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
	
	СтруктураПараметров.Вставить("РеквизитыПередаточныхДокументов",
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Универсальный передаточный документ № %1 от %2'"),
	НомерСчетаФактурыНаПечать(ДанныеПечати.НомерУПД, 0, Ложь),
	Формат(ДанныеПечати.ДатаУПД, "ДЛФ=D")));
	
	ОбластьПодвала.Параметры.Заполнить(СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее
Функция СведенияОГрузоотправителе(ДанныеПечати)
	
	Если ТипЗнч(ДанныеПечати.Грузоотправитель) = Тип("СправочникСсылка.РегистрацииВНалоговомОргане") Тогда
		СведенияОГрузоотправителе = Справочники.РегистрацииВНалоговомОргане.СведенияОПодразделении(ДанныеПечати.Грузоотправитель);
	Иначе
		СведенияОГрузоотправителе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
	КонецЕсли;
	
	Возврат СведенияОГрузоотправителе;
	
КонецФункции

Процедура ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьМакета)
	
	Для т = 0 По ОбластьМакета.Параметры.Количество() - 1 Цикл
		
		ТекПараметр = ОбластьМакета.Параметры.Получить(т);
		
		Если НЕ ЗначениеЗаполнено(ТекПараметр) Тогда
			ОбластьМакета.Параметры.Установить(т, "--");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОкруглитьДоЦелого(ОкругляемоеЧисло)
	Если ЗначениеЗаполнено(ОкругляемоеЧисло) Тогда
		Если ОкругляемоеЧисло <> Цел(ОкругляемоеЧисло) Тогда
			ОкругляемоеЧисло = Цел(ОкругляемоеЧисло) + 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция НомерСчетаФактурыНаПечать(Номер, ИндексПодразделения, УдалитьПользовательскийПрефикс = Ложь)
	
	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Номер, Ложь, УдалитьПользовательскийПрефикс);
	Если Лев(НомерНаПечать, 1) = "И" Тогда
		НомерНаПечать = Прав(НомерНаПечать, СтрДлина(НомерНаПечать)-1);
	КонецЕсли;
	Если ЗначениеЗаполнено(ИндексПодразделения) Тогда
		НомерНаПечать = НомерНаПечать + "/" + ИндексПодразделения;
	КонецЕсли;
	
	Возврат НомерНаПечать;
	
КонецФункции

#КонецОбласти

#Область КорректировкаРеализации

Функция ПолучитьДанныеДляПечатнойФормыУКД_Релиз(ПараметрыПечати, МассивОбъектов) 
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка               КАК Ссылка,
	|	ДанныеДокументов.Валюта               КАК Валюта,
	|	ДанныеДокументов.Организация          КАК Организация,
	|	ДанныеДокументов.Подразделение        КАК Подразделение,
	|	ДанныеДокументов.Склад                КАК Склад,
	|	ДанныеДокументов.ДокументОснование    КАК ДокументОснование,
	|
	|	ВЫБОР КОГДА ДанныеДокументов.ХозяйственнаяОперация В(
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК РеализацияВозвратРасхождений
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокументов
	|
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Выполнить();
	
	ПродажиСервер.ПоместитьВременнуюТаблицуСчетовФактур(МенеджерВременныхТаблиц);
	Документы.КорректировкаРеализации.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Истина, Истина);
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанныхДокументов.Ссылка КАК Ссылка,
	|	ДанныеОснования.Номер КАК Номер,
	|	ДанныеОснования.Дата КАК Дата
	|ПОМЕСТИТЬ ТаблицаОснований
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ТаблицаДанныхДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеОснования
	|		ПО ТаблицаДанныхДокументов.ДокументОснование = ДанныеОснования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокументов.Ссылка,
	|	ДанныеОснования.Номер,
	|	ДанныеОснования.Дата
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ТаблицаДанныхДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПрочихАктивов КАК ДанныеОснования
	|		ПО ТаблицаДанныхДокументов.ДокументОснование = ДанныеОснования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокументов.Ссылка,
	|	ДанныеОснования.Номер,
	|	ДанныеОснования.Дата
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ТаблицаДанныхДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК ДанныеОснования
	|		ПО ТаблицаДанныхДокументов.ДокументОснование = ДанныеОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СчетаФактуры.Номер ЕСТЬ NULL 
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СтатусУКД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ЕСТЬNULL(СчетаФактуры.НомерИсправления, НЕОПРЕДЕЛЕНО) КАК НомерИсправления,
	|	ЕСТЬNULL(СчетаФактуры.ДатаИсправления, НЕОПРЕДЕЛЕНО) КАК ДатаИсправления,
	|	ЕСТЬNULL(СчетаФактуры.Исправление, ЛОЖЬ) КАК Исправление,
	|	ЕСТЬNULL(СчетаФактуры.НомерСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.ДатаСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.НомерИсправленияСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК НомерИсправленияСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.ДатаИсправленияСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК ДатаИсправленияСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.Валюта, НЕОПРЕДЕЛЕНО) КАК ВалютаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.НомерСчетаФактуры, ДанныеОснования.Номер) КАК НомерУПД,
	|	ЕСТЬNULL(СчетаФактуры.ДатаСчетаФактуры, ДанныеОснования.Дата) КАК ДатаУПД,
	|	ДанныеДокумента.Партнер КАК Партнер,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СчетаФактуры.ГоловнаяОрганизация, ДанныеДокумента.Организация) КАК Организация,
	|	ДанныеДокумента.Организация.Префикс КАК Префикс,
	|	ЕСТЬNULL(СчетаФактуры.ИндексПодразделения, 0) КАК ИндексПодразделения,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СчетаФактуры.Грузоотправитель, ДанныеДокумента.Организация)
	|		ИНАЧЕ ДанныеДокумента.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ЕСТЬNULL(СчетаФактуры.ВыводитьКППГрузоотправителя, ЛОЖЬ) КАК ВыводитьКППГрузоотправителя,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ДанныеДокумента.Валюта.Код КАК ВалютаКод,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.РеализацияВозвратРасхождений
	|				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок)
	|					И НЕ ЕСТЬNULL(СчетаФактуры.Корректировочный, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПечатьНеТребуется,
	|	ЕСТЬNULL(СчетаФактуры.КПППокупателя, ДанныеДокумента.Контрагент.КПП) КАК КПППокупателя
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ДанныеДокумента.Ссылка = СчетаФактуры.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОснований КАК ДанныеОснования
	|		ПО ДанныеДокумента.Ссылка = ДанныеОснования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ДанныеДокумента.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТаблицаДокумента.Номенклатура.НаименованиеПолное, ТаблицаДокумента.Содержание) КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаДокумента.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаДокумента.Номенклатура.Код
	|	КОНЕЦ КАК НоменклатураКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.Количество
	|		ИНАЧЕ ТаблицаДокумента.КоличествоУпаковок
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ТаблицаТоваровПредыдущие.Количество, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровПредыдущие.КоличествоУпаковок, 0)
	|	КОНЕЦ КАК КоличествоДо,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Количество <> 0
	|						ТОГДА ТаблицаДокумента.СуммаБезНДС / ТаблицаДокумента.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.КоличествоУпаковок <> 0
	|					ТОГДА ТаблицаДокумента.СуммаБезНДС / ТаблицаДокумента.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаТоваровПредыдущие.Количество, 0) <> 0
	|						ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ТаблицаТоваровПредыдущие.КоличествоУпаковок, 0) <> 0
	|					ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДо,
	|	ТаблицаДокумента.СуммаБезНДС КАК СуммаБезНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) КАК СуммаБезНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаБезНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаБезНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаБезНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаБезНДСУменьшение,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0) КАК СуммаНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУменьшение,
	|	ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС КАК СуммаСНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0) КАК СуммаСНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС - (ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаСНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС - (ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаСНДСУменьшение,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	|	1 КАК Порядок
	|ИЗ
	|	КорректировкаРеализацииТаблицаТоваров КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПредыдущие
	|		ПО (ТаблицаТоваровПредыдущие.ДоКорректировки)
	|			И ТаблицаДокумента.Ссылка = ТаблицаТоваровПредыдущие.Ссылка
	|			И ТаблицаДокумента.Номенклатура = ТаблицаТоваровПредыдущие.Номенклатура
	|			И ТаблицаДокумента.Характеристика = ТаблицаТоваровПредыдущие.Характеристика
	|			И ТаблицаДокумента.Упаковка = ТаблицаТоваровПредыдущие.Упаковка
	|			И ТаблицаДокумента.НомерГТД = ТаблицаТоваровПредыдущие.НомерГТД
	|			И ТаблицаДокумента.СтавкаНДС = ТаблицаТоваровПредыдущие.СтавкаНДС
	|			И ТаблицаДокумента.Содержание = ТаблицаТоваровПредыдущие.Содержание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ТаблицаДокумента.Ссылка = СчетаФактуры.ДокументОснование
	|ГДЕ
	|	НЕ ТаблицаДокумента.ДоКорректировки
	|	И (ТаблицаДокумента.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ТаблицаДокумента.ВернутьМногооборотнуюТару
	|			ИЛИ ТаблицаДокумента.Номенклатура.ТипНоменклатуры ЕСТЬ NULL )
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваровПредыдущие.Ссылка,
	|	ТаблицаТоваровПредыдущие.Номенклатура,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.Номенклатура.НаименованиеПолное, ТаблицаТоваровПредыдущие.Содержание),
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Номенклатура.Код
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ,
	|	ТаблицаТоваровПредыдущие.Характеристика,
	|	ТаблицаТоваровПредыдущие.Характеристика.НаименованиеПолное,
	|	ТаблицаТоваровПредыдущие.СтавкаНДС,
	|	ТаблицаТоваровПредыдущие.НомерГТД,
	|	ТаблицаТоваровПредыдущие.НомерГТД.СтранаПроисхождения,
	|	ТаблицаТоваровПредыдущие.НомерГТД.СтранаПроисхождения.Код,
	|	0,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваровПредыдущие.Количество
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.КоличествоУпаковок
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТоваровПредыдущие.Количество <> 0
	|						ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаТоваровПредыдущие.КоличествоУпаковок <> 0
	|					ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС + ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС + ТаблицаТоваровПредыдущие.СуммаНДС,
	|	ТаблицаТоваровПредыдущие.НомерСтроки,
	|	ЛОЖЬ,
	|	2
	|ИЗ
	|	КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПредыдущие
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПослеКорректировки
	|		ПО (НЕ ТаблицаТоваровПослеКорректировки.ДоКорректировки)
	|			И ТаблицаТоваровПредыдущие.Ссылка = ТаблицаТоваровПослеКорректировки.Ссылка
	|			И ТаблицаТоваровПредыдущие.Номенклатура = ТаблицаТоваровПослеКорректировки.Номенклатура
	|			И ТаблицаТоваровПредыдущие.Характеристика = ТаблицаТоваровПослеКорректировки.Характеристика
	|			И ТаблицаТоваровПредыдущие.Упаковка = ТаблицаТоваровПослеКорректировки.Упаковка
	|			И ТаблицаТоваровПредыдущие.НомерГТД = ТаблицаТоваровПослеКорректировки.НомерГТД
	|			И ТаблицаТоваровПредыдущие.СтавкаНДС = ТаблицаТоваровПослеКорректировки.СтавкаНДС
	|			И ТаблицаТоваровПредыдущие.Содержание = ТаблицаТоваровПослеКорректировки.Содержание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ТаблицаТоваровПредыдущие.Ссылка = СчетаФактуры.ДокументОснование
	|ГДЕ
	|	ТаблицаТоваровПредыдущие.ДоКорректировки
	|	И ТаблицаТоваровПослеКорректировки.Ссылка ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	Запрос.УстановитьПараметр("КолонкаКодов", КолонкаКодов);
	Запрос.УстановитьПараметр("ПустаяУпаковкаНоменклатуры", Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[1];
	РезультатПоТабличнойЧасти = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати  = Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыУКД(ПараметрыПечати, МассивОбъектов) 
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка               КАК Ссылка,
	|	ДанныеДокументов.Валюта               КАК Валюта,
	|	ДанныеДокументов.Организация          КАК Организация,
	|	ДанныеДокументов.Подразделение        КАК Подразделение,
	|	ДанныеДокументов.Склад                КАК Склад,
	|	ДанныеДокументов.ДокументОснование    КАК ДокументОснование,
	|
	|	ВЫБОР КОГДА ДанныеДокументов.ХозяйственнаяОперация В(
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК РеализацияВозвратРасхождений
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокументов
	|
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Выполнить();
	
	ПродажиСервер.ПоместитьВременнуюТаблицуСчетовФактур(МенеджерВременныхТаблиц);
	Документы.КорректировкаРеализации.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Истина, Истина);
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанныхДокументов.Ссылка КАК Ссылка,
	|	ДанныеОснования.Номер КАК Номер,
	|	ДанныеОснования.Дата КАК Дата
	|ПОМЕСТИТЬ ТаблицаОснований
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ТаблицаДанныхДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеОснования
	|		ПО ТаблицаДанныхДокументов.ДокументОснование = ДанныеОснования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокументов.Ссылка,
	|	ДанныеОснования.Номер,
	|	ДанныеОснования.Дата
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ТаблицаДанныхДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПрочихАктивов КАК ДанныеОснования
	|		ПО ТаблицаДанныхДокументов.ДокументОснование = ДанныеОснования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокументов.Ссылка,
	|	ДанныеОснования.Номер,
	|	ДанныеОснования.Дата
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ТаблицаДанныхДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК ДанныеОснования
	|		ПО ТаблицаДанныхДокументов.ДокументОснование = ДанныеОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СчетаФактуры.Номер ЕСТЬ NULL 
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СтатусУКД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ЕСТЬNULL(СчетаФактуры.НомерИсправления, НЕОПРЕДЕЛЕНО) КАК НомерИсправления,
	|	ЕСТЬNULL(СчетаФактуры.ДатаИсправления, НЕОПРЕДЕЛЕНО) КАК ДатаИсправления,
	|	ЕСТЬNULL(СчетаФактуры.Исправление, ЛОЖЬ) КАК Исправление,
	|	ЕСТЬNULL(СчетаФактуры.НомерСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.ДатаСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.НомерИсправленияСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК НомерИсправленияСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.ДатаИсправленияСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК ДатаИсправленияСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.Валюта, НЕОПРЕДЕЛЕНО) КАК ВалютаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.НомерСчетаФактуры, ДанныеОснования.Номер) КАК НомерУПД,
	|	ЕСТЬNULL(СчетаФактуры.ДатаСчетаФактуры, ДанныеОснования.Дата) КАК ДатаУПД,
	|	ДанныеДокумента.Партнер КАК Партнер,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СчетаФактуры.ГоловнаяОрганизация, ДанныеДокумента.Организация) КАК Организация,
	|	ДанныеДокумента.Организация.Префикс КАК Префикс,
	|	ЕСТЬNULL(СчетаФактуры.ИндексПодразделения, 0) КАК ИндексПодразделения,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СчетаФактуры.Грузоотправитель, ДанныеДокумента.Организация)
	|		ИНАЧЕ ДанныеДокумента.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ЕСТЬNULL(СчетаФактуры.ВыводитьКППГрузоотправителя, ЛОЖЬ) КАК ВыводитьКППГрузоотправителя,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ДанныеДокумента.Валюта.Код КАК ВалютаКод,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.РеализацияВозвратРасхождений
	|				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок)
	|					И НЕ ЕСТЬNULL(СчетаФактуры.Корректировочный, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПечатьНеТребуется,
	|	ЕСТЬNULL(СчетаФактуры.КПППокупателя, ДанныеДокумента.Контрагент.КПП) КАК КПППокупателя
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ДанныеДокумента.Ссылка = СчетаФактуры.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОснований КАК ДанныеОснования
	|		ПО ДанныеДокумента.Ссылка = ДанныеОснования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ДанныеДокумента.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТаблицаДокумента.Номенклатура.НаименованиеПолное, ТаблицаДокумента.Содержание) КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаДокумента.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаДокумента.Номенклатура.Код
	|	КОНЕЦ КАК НоменклатураКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.Количество
	|		ИНАЧЕ ТаблицаДокумента.КоличествоУпаковок
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ТаблицаТоваровПредыдущие.Количество, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровПредыдущие.КоличествоУпаковок, 0)
	|	КОНЕЦ КАК КоличествоДо,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Количество <> 0
	|						ТОГДА ТаблицаДокумента.СуммаБезНДС / ТаблицаДокумента.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.КоличествоУпаковок <> 0
	|					ТОГДА ТаблицаДокумента.СуммаБезНДС / ТаблицаДокумента.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаТоваровПредыдущие.Количество, 0) <> 0
	|						ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ТаблицаТоваровПредыдущие.КоличествоУпаковок, 0) <> 0
	|					ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаДо,
	|	ТаблицаДокумента.СуммаБезНДС КАК СуммаБезНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) КАК СуммаБезНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаБезНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаБезНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаБезНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаБезНДСУменьшение,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0) КАК СуммаНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУменьшение,
	|	ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС КАК СуммаСНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0) КАК СуммаСНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС - (ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаСНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС - (ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаСНДСУменьшение,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	|	1 КАК Порядок
	|ИЗ
	|	КорректировкаРеализацииТаблицаТоваров КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПредыдущие
	|		ПО (ТаблицаТоваровПредыдущие.ДоКорректировки)
	|			И ТаблицаДокумента.Ссылка = ТаблицаТоваровПредыдущие.Ссылка
	|			И ТаблицаДокумента.Номенклатура = ТаблицаТоваровПредыдущие.Номенклатура
	|			И ТаблицаДокумента.Характеристика = ТаблицаТоваровПредыдущие.Характеристика
	|			И ТаблицаДокумента.Упаковка = ТаблицаТоваровПредыдущие.Упаковка
	|			И ТаблицаДокумента.НомерГТД = ТаблицаТоваровПредыдущие.НомерГТД
	|			И ТаблицаДокумента.СтавкаНДС = ТаблицаТоваровПредыдущие.СтавкаНДС
	|			И ТаблицаДокумента.Содержание = ТаблицаТоваровПредыдущие.Содержание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ТаблицаДокумента.Ссылка = СчетаФактуры.ДокументОснование
	|ГДЕ
	|	НЕ ТаблицаДокумента.ДоКорректировки
	|	И (ТаблицаДокумента.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ТаблицаДокумента.ВернутьМногооборотнуюТару
	|			ИЛИ ТаблицаДокумента.Номенклатура.ТипНоменклатуры ЕСТЬ NULL )
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваровПредыдущие.Ссылка,
	|	ТаблицаТоваровПредыдущие.Номенклатура,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.Номенклатура.НаименованиеПолное, ТаблицаТоваровПредыдущие.Содержание),
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Номенклатура.Код
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = &ПустаяУпаковкаНоменклатуры
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ,
	|	ТаблицаТоваровПредыдущие.Характеристика,
	|	ТаблицаТоваровПредыдущие.Характеристика.НаименованиеПолное,
	|	ТаблицаТоваровПредыдущие.СтавкаНДС,
	|	ТаблицаТоваровПредыдущие.НомерГТД,
	|	ТаблицаТоваровПредыдущие.НомерГТД.СтранаПроисхождения,
	|	ТаблицаТоваровПредыдущие.НомерГТД.СтранаПроисхождения.Код,
	|	0,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваровПредыдущие.Количество
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.КоличествоУпаковок
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТоваровПредыдущие.Количество <> 0
	|						ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаТоваровПредыдущие.КоличествоУпаковок <> 0
	|					ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС + ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС + ТаблицаТоваровПредыдущие.СуммаНДС,
	|	ТаблицаТоваровПредыдущие.НомерСтроки,
	|	ЛОЖЬ,
	|	2
	|ИЗ
	|	КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПредыдущие
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПослеКорректировки
	|		ПО (НЕ ТаблицаТоваровПослеКорректировки.ДоКорректировки)
	|			И ТаблицаТоваровПредыдущие.Ссылка = ТаблицаТоваровПослеКорректировки.Ссылка
	|			И ТаблицаТоваровПредыдущие.Номенклатура = ТаблицаТоваровПослеКорректировки.Номенклатура
	|			И ТаблицаТоваровПредыдущие.Характеристика = ТаблицаТоваровПослеКорректировки.Характеристика
	|			И ТаблицаТоваровПредыдущие.Упаковка = ТаблицаТоваровПослеКорректировки.Упаковка
	|			И ТаблицаТоваровПредыдущие.НомерГТД = ТаблицаТоваровПослеКорректировки.НомерГТД
	|			И ТаблицаТоваровПредыдущие.СтавкаНДС = ТаблицаТоваровПослеКорректировки.СтавкаНДС
	|			И ТаблицаТоваровПредыдущие.Содержание = ТаблицаТоваровПослеКорректировки.Содержание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ТаблицаТоваровПредыдущие.Ссылка = СчетаФактуры.ДокументОснование
	|ГДЕ
	|	ТаблицаТоваровПредыдущие.ДоКорректировки
	|	И ТаблицаТоваровПослеКорректировки.Ссылка ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	Запрос.УстановитьПараметр("КолонкаКодов", КолонкаКодов);
	Запрос.УстановитьПараметр("ПустаяУпаковкаНоменклатуры", Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[1];
	РезультатПоТабличнойЧасти = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати  = Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
КонецФункции

Функция СформироватьПечатнуюФормуКорректировкаРеализации(СтруктураТипов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УКД";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		
		ДанныеДляПечати = Документы.КорректировкаРеализации.ПолучитьДанныеДляПечатнойФормыУКД(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументКорректировкаРеализации(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
		
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументКорректировкаРеализации(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьФормДополнительно.ПФ_MXL_КорректировкаРеализации");
	
	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		Если ДанныеПечати.ПечатьНеТребуется Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 универсальный корректировочный документ не применяется.'"),
			ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка);
			
		Иначе
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Выводим общие реквизиты шапки
			СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
			СведенияОКонтрагенте = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата);
			ЗаполнитьРеквизитыШапкиУКД(ДанныеПечати, СведенияОбОрганизации, СведенияОКонтрагенте, Макет, ТабличныйДокумент);
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			НомерСтраницы = 1;
			
			// Инициализация итогов в документе
			ИтоговыеСуммы = СтруктураИтоговыеСуммы();
			
			// Создаем массив для проверки вывода
			МассивВыводимыхОбластей = Новый Массив;
			
			// Выводим многострочную часть документа
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			
			ЗаполнитьРеквизитыПодвалаУКД(ОбластьПодвал, ДанныеПечати, СведенияОбОрганизации, СведенияОКонтрагенте);
			
			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
			
			СтрокаТовары = ВыборкаПоДокументам.Выбрать();
			КоличествоСтрок = СтрокаТовары.Количество();
			ТолькоСтавкаБезНДС = Истина;
			НомерСтроки = 0;
			Пока СтрокаТовары.Следующий() Цикл
				
				НомерСтроки = НомерСтроки + 1;
				ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьСтрока, НомерСтроки);
				ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьСтрока);
				
				СтруктураПараметров = Новый Структура;
				Если СтрокаТовары.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru='без НДС'"));
					СтруктураПараметров.Вставить("СуммаНДС", НСтр("ru='без НДС'"));
				ИначеЕсли СтрокаТовары.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
					СтруктураПараметров.Вставить("СуммаНДС", 0);
					ТолькоСтавкаБезНДС = Ложь;
				Иначе
					ТолькоСтавкаБезНДС = Ложь;
				КонецЕсли;
				СтруктураПараметров.Вставить("Акциз", НСтр("ru='без акциза'"));
				ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
				
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
				
				Если НомерСтроки = КоличествоСтрок Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьИтого);
					МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
				КонецЕсли;
				
				Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
					ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактурыНаПечать(ДанныеПечати.Номер, ДанныеПечати.ИндексПодразделения);
					ОбластьНумерацияЛистов.Параметры.Дата = Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
					ОбластьНумерацияЛистов.Параметры.НомерСтраницы = НомерСтраницы;
					
					ТабличныйДокумент.Вывести(ОбластьНумерацияЛистов);
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);
				
			КонецЦикла;
			
			// Выводим итоги по документу
			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
			
			Если ТолькоСтавкаБезНДС Тогда
				ИтоговыеСуммы.ИтогоСуммаНДС = НСтр("ru='без НДС'");
			КонецЕсли;
			ОбластьИтого.Параметры.Заполнить(ИтоговыеСуммы);
			ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьИтого);
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			КоличествоСтраниц = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ составлен на %1 %2'"),
			НомерСтраницы,
			ОбщегоНазначенияУТКлиентСервер.ФормаМножественногоЧисла(
			НСтр("ru = 'листе'"), НСтр("ru = 'листах'"), НСтр("ru = 'листах'"), НомерСтраницы));
			СтруктураПараметров = Новый Структура("КоличествоСтраниц", КоличествоСтраниц);
			ОбластьПодвал.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Ссылка);
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Функция формирует печатную форму Счета-фактуры
Функция ПолучитьДанныеДляПечатнойФормыСчетФактура_СРаспределениемУслуг(ПараметрыПечати, МассивОбъектов) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.Подразделение КАК Подразделение,
	|	ДанныеДокументов.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РеализацияВозвратРасхождений
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Выполнить();
	
	ПродажиСервер.ПоместитьВременнуюТаблицуСчетовФактур(МенеджерВременныхТаблиц);
	Документы.КорректировкаРеализации.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Истина, Истина, НЕ ПараметрыПечати.ПечатьВВалюте);
	
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ТаблицаТоваров.ЭтоТовар
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьУслуги,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТаблицаТоваров.ЭтоТовар
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьТовары
	|ПОМЕСТИТЬ НоменклатураДокументов
	|ИЗ
	|	КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК Ссылка,
	|	&ПредставлениеСчетФактура КАК ПредставлениеДокумента,
	|	ЕСТЬNULL(СчетаФактуры.Номер, НЕОПРЕДЕЛЕНО) КАК Номер,
	|	ЕСТЬNULL(СчетаФактуры.Дата, НЕОПРЕДЕЛЕНО) КАК Дата,
	|	ЕСТЬNULL(СчетаФактуры.НомерИсправления, НЕОПРЕДЕЛЕНО) КАК НомерИсправления,
	|	ЕСТЬNULL(СчетаФактуры.ДатаИсправления, НЕОПРЕДЕЛЕНО) КАК ДатаИсправления,
	|	ЕСТЬNULL(СчетаФактуры.Исправление, ЛОЖЬ) КАК Исправление,
	|	ЕСТЬNULL(СчетаФактуры.НомерСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.ДатаСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.НомерИсправленияСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК НомерИсправленияСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.ДатаИсправленияСчетаФактуры, НЕОПРЕДЕЛЕНО) КАК ДатаИсправленияСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактуры.Корректировочный, ЛОЖЬ) КАК КорректировочныйСчетФактура,
	|	ЕСТЬNULL(СчетаФактуры.СтрокаПлатежноРасчетныеДокументы, """") КАК СтрокаПоДокументу,
	|	ЕСТЬNULL(СчетаФактуры.Валюта, НЕОПРЕДЕЛЕНО) КАК ВалютаСчетаФактуры,
	|	КорректировкаРеализации.Партнер КАК Партнер,
	|	КорректировкаРеализации.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СчетаФактуры.ГоловнаяОрганизация, КорректировкаРеализации.Организация) КАК Организация,
	|	КорректировкаРеализации.Организация.Префикс КАК Префикс,
	|	ЕСТЬNULL(СчетаФактуры.ИндексПодразделения, 0) КАК ИндексПодразделения,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализации.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА КорректировкаРеализации.Контрагент
	|		ИНАЧЕ КорректировкаРеализации.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализации.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СчетаФактуры.Грузоотправитель, КорректировкаРеализации.Организация)
	|		ИНАЧЕ КорректировкаРеализации.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ЕСТЬNULL(СчетаФактуры.ВыводитьКППГрузоотправителя, ЛОЖЬ) КАК ВыводитьКППГрузоотправителя,
	|	КорректировкаРеализации.АдресДоставки КАК АдресДоставки,
	|	КорректировкаРеализации.Валюта КАК Валюта,
	|	КорректировкаРеализации.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	КорректировкаРеализации.Валюта.Код КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА НоменклатураДокументов.ЕстьУслуги
	|				И НЕ НоменклатураДокументов.ЕстьТовары
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоУслуги,
	|	ЛОЖЬ КАК ЭтоПередачаНаКомиссию,
	|	СчетаФактуры.КПППокупателя
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО КорректировкаРеализации.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО КорректировкаРеализации.Ссылка = СчетаФактуры.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураДокументов КАК НоменклатураДокументов
	|		ПО КорректировкаРеализации.Ссылка = НоменклатураДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО КорректировкаРеализации.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТаблицаДокумента.Номенклатура.НаименованиеПолное, ТаблицаДокумента.Содержание) КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаДокумента.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.НомерГТД.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.Количество
	|		ИНАЧЕ ТаблицаДокумента.КоличествоУпаковок
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ТаблицаТоваровПредыдущие.Количество, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровПредыдущие.КоличествоУпаковок, 0)
	|	КОНЕЦ КАК КоличествоДо,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.СуммаБезНДС / ТаблицаДокумента.Количество
	|		ИНАЧЕ ТаблицаДокумента.СуммаБезНДС / ТаблицаДокумента.КоличествоУпаковок
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) / ЕСТЬNULL(ТаблицаТоваровПредыдущие.Количество, 1)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) / ЕСТЬNULL(ТаблицаТоваровПредыдущие.КоличествоУпаковок, 1)
	|	КОНЕЦ КАК ЦенаДо,
	|	ТаблицаДокумента.СуммаБезНДС КАК СуммаБезНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) КАК СуммаБезНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаБезНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаБезНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаБезНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаБезНДСУменьшение,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0) КАК СуммаНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаНДС - ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУменьшение,
	|	ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС КАК СуммаСНДС,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0) КАК СуммаСНДСДо,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС >= ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС - (ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаСНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС < ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ТОГДА -(ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС - (ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0) + ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаСНДСУменьшение,
	|	NULL КАК НомерСтроки,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	|	3 КАК Порядок,
	|	УслугиВложение.ДоляУслуг,
	|	УслугиВложениеДо.ДоляУслугДо КАК ДоляУслугДо,
	|	ТаблицаДокумента.Ссылка.ДокументОснование.СуммаДокумента КАК ДокументОснованиеСуммаДокумента,
	|	NULL КАК ДокументОснование
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	КорректировкаРеализацииТаблицаТоваров КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПредыдущие
	|		ПО ТаблицаДокумента.Ссылка = ТаблицаТоваровПредыдущие.Ссылка
	|			И ТаблицаДокумента.Номенклатура = ТаблицаТоваровПредыдущие.Номенклатура
	|			И ТаблицаДокумента.Характеристика = ТаблицаТоваровПредыдущие.Характеристика
	|			И ТаблицаДокумента.Упаковка = ТаблицаТоваровПредыдущие.Упаковка
	|			И ТаблицаДокумента.НомерГТД = ТаблицаТоваровПредыдущие.НомерГТД
	|			И ТаблицаДокумента.СтавкаНДС = ТаблицаТоваровПредыдущие.СтавкаНДС
	|			И ТаблицаДокумента.Содержание = ТаблицаТоваровПредыдущие.Содержание
	|			И (ТаблицаТоваровПредыдущие.ДоКорректировки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ТаблицаДокумента.Ссылка = СчетаФактуры.ДокументОснование,
	|	(ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.СуммаДокумента - ТаблицаДокумента.СуммаБезНДС - ТаблицаДокумента.СуммаНДС <> 0
	|					ТОГДА (ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС) / (ТаблицаДокумента.Ссылка.СуммаДокумента - ТаблицаДокумента.СуммаБезНДС - ТаблицаДокумента.СуммаНДС)
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ДоляУслуг
	|	ИЗ
	|		КорректировкаРеализацииТаблицаТоваров КАК ТаблицаДокумента
	|	ГДЕ
	|		НЕ ТаблицаДокумента.ДоКорректировки
	|		И ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК УслугиВложение,
	|	(ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ДокументОснование.СуммаДокумента - ТаблицаДокумента.СуммаБезНДС - ТаблицаДокумента.СуммаНДС <> 0
	|					ТОГДА (ТаблицаДокумента.СуммаБезНДС + ТаблицаДокумента.СуммаНДС) / (ТаблицаДокумента.Ссылка.ДокументОснование.СуммаДокумента - ТаблицаДокумента.СуммаБезНДС - ТаблицаДокумента.СуммаНДС)
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ДоляУслугДо
	|	ИЗ
	|		КорректировкаРеализацииТаблицаТоваров КАК ТаблицаДокумента
	|	ГДЕ
	|		ТаблицаДокумента.ДоКорректировки
	|		И ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК УслугиВложениеДо
	|ГДЕ
	|	НЕ ТаблицаДокумента.ДоКорректировки
	|	И (НЕ СчетаФактуры.Корректировочный
	|			ИЛИ ТаблицаДокумента.СуммаНДС <> ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаНДС, 0)
	|			ИЛИ ТаблицаДокумента.СуммаБезНДС <> ЕСТЬNULL(ТаблицаТоваровПредыдущие.СуммаБезНДС, 0))
	|	И (ТаблицаДокумента.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ТаблицаДокумента.ВернутьМногооборотнуюТару
	|			ИЛИ ТаблицаДокумента.Номенклатура.ТипНоменклатуры ЕСТЬ NULL )
	|	И ТаблицаДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваровПредыдущие.Ссылка,
	|	ТаблицаТоваровПредыдущие.Номенклатура,
	|	ЕСТЬNULL(ТаблицаТоваровПредыдущие.Номенклатура.НаименованиеПолное, ТаблицаТоваровПредыдущие.Содержание),
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения.Представление
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ТаблицаТоваровПредыдущие.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваровПредыдущие.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.Упаковка.ЕдиницаИзмерения.Код
	|	КОНЕЦ,
	|	ТаблицаТоваровПредыдущие.Характеристика,
	|	ТаблицаТоваровПредыдущие.Характеристика.НаименованиеПолное,
	|	ТаблицаТоваровПредыдущие.СтавкаНДС,
	|	ТаблицаТоваровПредыдущие.НомерГТД,
	|	ТаблицаТоваровПредыдущие.НомерГТД.СтранаПроисхождения,
	|	ТаблицаТоваровПредыдущие.НомерГТД.СтранаПроисхождения.Код,
	|	0,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваровПредыдущие.Количество
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.КоличествоУпаковок
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.Количество
	|		ИНАЧЕ ТаблицаТоваровПредыдущие.СуммаБезНДС / ТаблицаТоваровПредыдущие.КоличествоУпаковок
	|	КОНЕЦ,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС + ТаблицаТоваровПредыдущие.СуммаНДС,
	|	0,
	|	ТаблицаТоваровПредыдущие.СуммаБезНДС + ТаблицаТоваровПредыдущие.СуммаНДС,
	|	ТаблицаТоваровПредыдущие.НомерСтроки,
	|	ЛОЖЬ,
	|	4,
	|	0,
	|	УслугиВложение.ДоляУслуг,
	|	ТаблицаТоваровПредыдущие.Ссылка.ДокументОснование.СуммаДокумента,
	|	ТаблицаТоваровПредыдущие.Ссылка.ДокументОснование
	|ИЗ
	|	КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПредыдущие
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПослеКорректировки
	|		ПО (НЕ ТаблицаТоваровПослеКорректировки.ДоКорректировки)
	|			И ТаблицаТоваровПредыдущие.Ссылка = ТаблицаТоваровПослеКорректировки.Ссылка
	|			И ТаблицаТоваровПредыдущие.Номенклатура = ТаблицаТоваровПослеКорректировки.Номенклатура
	|			И ТаблицаТоваровПредыдущие.Характеристика = ТаблицаТоваровПослеКорректировки.Характеристика
	|			И ТаблицаТоваровПредыдущие.Упаковка = ТаблицаТоваровПослеКорректировки.Упаковка
	|			И ТаблицаТоваровПредыдущие.НомерГТД = ТаблицаТоваровПослеКорректировки.НомерГТД
	|			И ТаблицаТоваровПредыдущие.СтавкаНДС = ТаблицаТоваровПослеКорректировки.СтавкаНДС
	|			И ТаблицаТоваровПредыдущие.Содержание = ТаблицаТоваровПослеКорректировки.Содержание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК СчетаФактуры
	|		ПО ТаблицаТоваровПредыдущие.Ссылка = СчетаФактуры.ДокументОснование,
	|	(ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаТоваровПредыдущие.Ссылка.ДокументОснование.СуммаДокумента - ТаблицаТоваровПредыдущие.СуммаБезНДС - ТаблицаТоваровПредыдущие.СуммаНДС <> 0
	|					ТОГДА (ТаблицаТоваровПредыдущие.СуммаБезНДС + ТаблицаТоваровПредыдущие.СуммаНДС) / (ТаблицаТоваровПредыдущие.Ссылка.ДокументОснование.СуммаДокумента - ТаблицаТоваровПредыдущие.СуммаБезНДС - ТаблицаТоваровПредыдущие.СуммаНДС)
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ДоляУслуг
	|	ИЗ
	|		КорректировкаРеализацииТаблицаТоваров КАК ТаблицаТоваровПредыдущие
	|	ГДЕ
	|		ТаблицаТоваровПредыдущие.ДоКорректировки
	|		И ТаблицаТоваровПредыдущие.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК УслугиВложение
	|ГДЕ
	|	ТаблицаТоваровПредыдущие.ДоКорректировки
	|	И СчетаФактуры.Корректировочный
	|	И ТаблицаТоваровПредыдущие.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|	И ТаблицаТоваровПослеКорректировки.Ссылка ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Результат.Ссылка КАК Ссылка,
	|	Результат.Номенклатура,
	|	Результат.НоменклатураНаименование,
	|	Результат.ЕдиницаИзмерения,
	|	Результат.ЕдиницаИзмеренияНаименование,
	|	Результат.ЕдиницаИзмеренияКод,
	|	Результат.Характеристика,
	|	Результат.ХарактеристикаНаименование,
	|	Результат.СтавкаНДС,
	|	Результат.НомерГТД,
	|	Результат.СтранаПроисхождения,
	|	Результат.СтранаПроисхожденияКод,
	|	Результат.Количество,
	|	Результат.КоличествоДо,
	|	Результат.Цена,
	|	Результат.ЦенаДо,
	|	Результат.СуммаБезНДС,
	|	Результат.СуммаБезНДСДо,
	|	ВЫБОР
	|		КОГДА Результат.СуммаБезНДС > Результат.СуммаБезНДСДо
	|			ТОГДА Результат.СуммаБезНДС - Результат.СуммаБезНДСДо
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаБезНДСУвеличение,
	|	ВЫБОР
	|		КОГДА Результат.СуммаБезНДСДо > Результат.СуммаБезНДС
	|			ТОГДА Результат.СуммаБезНДСДо - Результат.СуммаБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаБезНДСУменьшение,
	|	Результат.СуммаНДС,
	|	Результат.СуммаНДСДо,
	|	ВЫБОР
	|		КОГДА Результат.СуммаНДС > Результат.СуммаНДСДо
	|			ТОГДА Результат.СуммаНДС - Результат.СуммаНДСДо
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУвеличение,
	|	ВЫБОР
	|		КОГДА Результат.СуммаНДСДо > Результат.СуммаНДС
	|			ТОГДА Результат.СуммаНДСДо - Результат.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУменьшение,
	|	Результат.СуммаБезНДС + Результат.СуммаНДС КАК СуммаСНДС,
	|	Результат.СуммаБезНДСДо + Результат.СуммаНДСДо КАК СуммаСНДСДо,
	|	ВЫБОР
	|		КОГДА Результат.СуммаБезНДС + Результат.СуммаНДС > Результат.СуммаБезНДСДо + Результат.СуммаНДСДо
	|			ТОГДА Результат.СуммаБезНДС + Результат.СуммаНДС - (Результат.СуммаБезНДСДо + Результат.СуммаНДСДо)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаСНДСУвеличение,
	|	ВЫБОР
	|		КОГДА Результат.СуммаБезНДСДо + Результат.СуммаНДСДо > Результат.СуммаБезНДС + Результат.СуммаНДС
	|			ТОГДА Результат.СуммаБезНДСДо + Результат.СуммаНДСДо - (Результат.СуммаБезНДС + Результат.СуммаНДС)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаСНДСУменьшение,
	|	Результат.НомерСтроки,
	|	Результат.ЭтоВозвратнаяТара,
	|	Результат.Порядок,
	|	Результат.ДоляУслуг,
	|	Результат.ДоляУслугДо
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТоваров.Ссылка КАК Ссылка,
	|		ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|		ТаблицаТоваров.НоменклатураНаименование КАК НоменклатураНаименование,
	|		ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ТаблицаТоваров.ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
	|		ТаблицаТоваров.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|		ТаблицаТоваров.Характеристика КАК Характеристика,
	|		ТаблицаТоваров.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
	|		ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|		ТаблицаТоваров.НомерГТД КАК НомерГТД,
	|		ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения,
	|		ТаблицаТоваров.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|		ТаблицаТоваров.Количество КАК Количество,
	|		ТаблицаТоваров.КоличествоДо КАК КоличествоДо,
	|		ВЫБОР
	|			КОГДА ТаблицаТоваров.Количество <> 0
	|				ТОГДА (ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаБезНДС * ТаблицаТоваров.ДоляУслуг) / ТаблицаТоваров.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Цена,
	|		ВЫБОР
	|			КОГДА ТаблицаТоваров.КоличествоДо <> 0
	|				ТОГДА (ТаблицаТоваров.СуммаБезНДСДо + ТаблицаТоваров.СуммаБезНДСДо * ТаблицаТоваров.ДоляУслугДо) / ТаблицаТоваров.КоличествоДо
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЦенаДо,
	|		ВЫРАЗИТЬ(ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаБезНДС * ТаблицаТоваров.ДоляУслуг КАК ЧИСЛО(15, 2)) КАК СуммаБезНДС,
	|		ВЫРАЗИТЬ(ТаблицаТоваров.СуммаБезНДСДо + ТаблицаТоваров.СуммаБезНДСДо * ТаблицаТоваров.ДоляУслугДо КАК ЧИСЛО(15, 2)) КАК СуммаБезНДСДо,
	|		ВЫРАЗИТЬ(ТаблицаТоваров.СуммаНДС + ТаблицаТоваров.СуммаНДС * ТаблицаТоваров.ДоляУслуг КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|		ВЫРАЗИТЬ(ТаблицаТоваров.СуммаНДСДо + ТаблицаТоваров.СуммаНДСДо * ТаблицаТоваров.ДоляУслугДо КАК ЧИСЛО(15, 2)) КАК СуммаНДСДо,
	|		ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|		ТаблицаТоваров.ЭтоВозвратнаяТара КАК ЭтоВозвратнаяТара,
	|		ТаблицаТоваров.Порядок КАК Порядок,
	|		ТаблицаТоваров.ДоляУслуг КАК ДоляУслуг,
	|		ТаблицаТоваров.ДоляУслугДо КАК ДоляУслугДо
	|	ИЗ
	|		ТаблицаТоваров КАК ТаблицаТоваров) КАК Результат
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	Запрос.УстановитьПараметр("ПредставлениеСчетФактура", НСтр("ru='счет-фактура'"));
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[1];
	РезультатПоТабличнойЧасти = МассивРезультатов[3];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

#КонецОбласти

#Область НарядЗаказНаДоставку
Функция СформироватьПечатнуюФормуНарядЗаказНаДоставку(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("ПФ_MXL_НарядЗаказНаДоставку");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб= Истина;
	
	Если  МассивОбъектов.Количество() > 0 Тогда
		Ссылка= МассивОбъектов[0];		
	Иначе
		Возврат ТабДок;
	КонецЕсли;
	
	//Выводим наряд заказ
	ОбластьШтрихкода= Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьУсловия= Макет.ПолучитьОбласть("Условия");
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьШтрихкода, Ссылка);
	ТабДок.Вывести(ОбластьШтрихкода);
	
	ОбластьШапка.Параметры.Номер= Ссылка.Номер;
	ОбластьШапка.Параметры.Дата= Формат(Ссылка.Дата,"ДФ=dd.MM.yyyy") ;
	ОбластьШапка.Параметры.Время= Формат(Ссылка.Дата, "ДЛФ=T");
	
	СведеньяОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
	СведеньяОКлиента = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Контрагент, Ссылка.Дата);
	СведеньяОПеревозчике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Перевозчик, Ссылка.Дата);
	
	//информация об Агенте:
	ОбластьШапка.Параметры.ОрганизацияНаименование= СведеньяОбОрганизации.ПолноеНаименование;
	ОбластьШапка.Параметры.ОрганизацияИНН= СведеньяОбОрганизации.ИНН;
	ОбластьШапка.Параметры.ОрганизацияЮридическийАдрес= СведеньяОбОрганизации.ЮридическийАдрес;
	ОбластьШапка.Параметры.ОрганизацияФизическийАдрес= СведеньяОбОрганизации.ФактическийАдрес;
	ОбластьШапка.Параметры.Менеджер= Ссылка.Автор;
	ОбластьШапка.Параметры.ТелефонДиспетчера= АльтерраОбщегоНазначения.ПолучитьТелефонПоВиду(Ссылка.Организация, "Телефон диспетчера по доставке");
	//информация о Клиенте: 
	ОбластьШапка.Параметры.ФИОКлиента= Ссылка.ФИОКлиента;
	ОбластьШапка.Параметры.КлиентЮридическийАдрес= СведеньяОКлиента.ЮридическийАдрес;
	ОбластьШапка.Параметры.КлиентФактическийАдрес= СведеньяОКлиента.ФактическийАдрес;
	ОбластьШапка.Параметры.КлиентТелефон= Ссылка.ТелефонКлиента;
	ОбластьШапка.Параметры.ТелефонНаВыгрузке= Ссылка.ТелефонКлиентаНаВыгрузке;
	//информация о доставке:
	ОбластьШапка.Параметры.ДатаДоставки=Формат(Ссылка.ПрибытиеНаОтгрузку, "ДЛФ=DD");
	ОбластьШапка.Параметры.АдресДоставки= Ссылка.АдресДоставки;
	ОбластьШапка.Параметры.ВремяДоставкиС= Лев(Формат(Ссылка.ВремяДоставкиС, "ДЛФ=T"), 5) ;
	ОбластьШапка.Параметры.ВремяДоставкиПо= Лев(Формат(Ссылка.ВремяДоставкиПо, "ДЛФ=T"), 5);
	ОбластьШапка.Параметры.СуммаДоставки= ПолучитьУслугуДоставки(Ссылка);
	
	//информация об Исполнителе:
	ОбластьШапка.Параметры.Перевозчик= СведеньяОПеревозчике.ПолноеНаименование;
	Если ЗначениеЗаполнено(Ссылка.Автомобиль) Тогда
		ОбластьШапка.Параметры.Автомобиль= ""+Ссылка.Автомобиль.Марка+", "+Ссылка.Автомобиль.ГрузоподъемностьВТоннах+" т.";
		ОбластьШапка.Параметры.АвтомобильГосНомер= Ссылка.Автомобиль.Код;
	КонецЕсли;
	ТабДок.Вывести(ОбластьШапка);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//Условия
	ТабДок.Вывести(ОбластьУсловия);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//Выводим товар в приложение 1
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка.Контрагент КАК Контрагент,
	|	Товары.Ссылка.ТелефонКлиента КАК ТелефонКлиента,
	|	Товары.Ссылка.ПрибытиеНаОтгрузку КАК ПрибытиеНаОтгрузку,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдИзм,
	|	Товары.Цена,
	|	СУММА(Товары.СуммаСНДС) КАК Сумма,
	|	Товары.Ссылка.Партнер,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА Товары.Номенклатура.Вес * Товары.КоличествоУпаковок
	|			ИНАЧЕ Товары.КоличествоУпаковок * Товары.Упаковка.Вес
	|		КОНЕЦ) КАК Вес,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	Товары.Ссылка.Дата КАК Дата,
	|	Товары.Ссылка.АдресДоставки,
	|	Товары.Ссылка.Водитель КАК Перевозчик,
	|	Товары.Ссылка.РаспределитьТранспортные,
	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.Объем * Товары.КоличествоУпаковок
	|		ИНАЧЕ Товары.КоличествоУпаковок * Товары.Упаковка.Объем
	|	КОНЕЦ КАК Объем,
	|	Товары.Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	Товары.Ссылка.Контрагент,
	|	Товары.НомерСтроки,
	|	Товары.Номенклатура,
	|	Товары.КоличествоУпаковок,
	|	Товары.Цена,
	|	Товары.Ссылка.Партнер,
	|	Товары.Ссылка.Дата,
	|	Товары.Ссылка.АдресДоставки,
	|	Товары.Ссылка.ТелефонКлиента,
	|	Товары.Ссылка.ПрибытиеНаОтгрузку,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	Товары.Ссылка.Водитель,
	|	Товары.Ссылка.РаспределитьТранспортные,
	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.Объем * Товары.КоличествоУпаковок
	|		ИНАЧЕ Товары.КоличествоУпаковок * Товары.Упаковка.Объем
	|	КОНЕЦ,
	|	Товары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Документ КАК Документ,
	|	ВТ_Товары.Контрагент,
	|	ВТ_Товары.ТелефонКлиента,
	|	ВТ_Товары.ПрибытиеНаОтгрузку,
	|	ВТ_Товары.НомерСтроки,
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.КоличествоУпаковок,
	|	ВТ_Товары.ЕдИзм,
	|	ВТ_Товары.Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Товары.Партнер,
	|	ВТ_Товары.Вес КАК Вес,
	|	ВТ_Товары.СуммаНДС КАК СуммаНДС,
	|	ВТ_Товары.Дата,
	|	ВТ_Товары.АдресДоставки,
	|	ВТ_Товары.Перевозчик,
	|	0 КАК ДоляУслуг,
	|	ВТ_Товары.СуммаСкидки,
	|	ВТ_Товары.Объем КАК Объем,
	|	ВТ_Товары.Характеристика
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|ГДЕ
	|	НЕ ВТ_Товары.РаспределитьТранспортные
	|	И ВТ_Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Товары.Документ,
	|	ВТ_Товары.Контрагент,
	|	ВТ_Товары.ТелефонКлиента,
	|	ВТ_Товары.ПрибытиеНаОтгрузку,
	|	ВТ_Товары.НомерСтроки,
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.КоличествоУпаковок,
	|	ВТ_Товары.ЕдИзм,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.КоличествоУпаковок <> 0
	|			ТОГДА ВЫРАЗИТЬ((ВТ_Товары.Сумма + ВТ_Товары.Сумма * УслугиВложение.ДоляУслуг - (ВТ_Товары.СуммаНДС + ВТ_Товары.СуммаНДС * УслугиВложение.ДоляУслуг) + ВТ_Товары.СуммаСкидки) / ВТ_Товары.КоличествоУпаковок КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ВТ_Товары.Сумма + ВТ_Товары.Сумма * УслугиВложение.ДоляУслуг КАК ЧИСЛО(15, 2)),
	|	ВТ_Товары.Партнер,
	|	ВТ_Товары.Вес,
	|	ВЫРАЗИТЬ(ВТ_Товары.СуммаНДС + ВТ_Товары.СуммаНДС * УслугиВложение.ДоляУслуг КАК ЧИСЛО(15, 2)),
	|	ВТ_Товары.Дата,
	|	ВТ_Товары.АдресДоставки,
	|	ВТ_Товары.Перевозчик,
	|	УслугиВложение.ДоляУслуг,
	|	ВТ_Товары.СуммаСкидки,
	|	ВТ_Товары.Объем,
	|	NULL
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА ВТ_Товары.Документ.СуммаДокумента - ВТ_Товары.Сумма <> 0
	|						ТОГДА ВТ_Товары.Сумма / (ВТ_Товары.Документ.СуммаДокумента - ВТ_Товары.Сумма)
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ДоляУслуг,
	|			ВТ_Товары.Документ КАК Документ
	|		ИЗ
	|			ВТ_Товары КАК ВТ_Товары
	|		ГДЕ
	|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_Товары.Документ) КАК УслугиВложение
	|		ПО ВТ_Товары.Документ = УслугиВложение.Документ
	|ГДЕ
	|	ВТ_Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И ВТ_Товары.РаспределитьТранспортные
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(Вес),
	|	СУММА(СуммаНДС),
	|	СУММА(Объем)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("МассивДокументов", Ссылка);
	Результат = Запрос.Выполнить();
	
	ОбластьТоварыЗаголовок = Макет.ПолучитьОбласть("ТоварЗаголовок");
	ОбластьТоварыЗаголовок.Параметры.Номер= Ссылка.Номер;
	ОбластьТоварыЗаголовок.Параметры.Дата= Формат(Ссылка.Дата,"ДФ=dd.MM.yyyy") ;
	СчетСтраниц=1;
	ОбластьТоварыЗаголовок.Параметры.СчетСтраниц= СчетСтраниц;
	ТабДок.Вывести(ОбластьТоварыЗаголовок);
	
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварШапка");
	ТабДок.Вывести(ОбластьТоварыШапка);
	
	ОбластьТоварыСтрока = Макет.ПолучитьОбласть("ТоварСтрока");
	ОбластьТоварыИтог = Макет.ПолучитьОбласть("ТоварИтог");
	
	// Общий итог
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();		
	ОбластьТоварыИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	ПервыйДокумент = Истина;
	
	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
	СчетСтрок=1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СчетСтрок=СчетСтрок+1;
		ОбластьТоварыСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьТоварыСтрока.Параметры.Номенклатура= НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Характеристика);
		//Проверка вывода 
		мОблостей= Новый Массив;
		мОблостей.Добавить(ОбластьТоварыСтрока);
		мОблостей.Добавить(ОбластьТоварыИтог);
		Если ТабДок.ПроверитьВывод(мОблостей) Тогда
			ТабДок.Вывести(ОбластьТоварыСтрока);
		Иначе
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			СчетСтраниц= СчетСтраниц+1;
			ОбластьТоварыЗаголовок.Параметры.СчетСтраниц= СчетСтраниц;
			ТабДок.Вывести(ОбластьТоварыЗаголовок);
			ТабДок.Вывести(ОбластьТоварыШапка);
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьТоварыИтог);
	
	Возврат ТабДок;
КонецФункции
Функция ПолучитьУслугуДоставки(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РеализацияТоваровУслугТовары.Цена * РеализацияТоваровУслугТовары.КоличествоУпаковок) КАК Цена
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И РеализацияТоваровУслугТовары.Ссылка = &Ссылка" ;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ЗаданиеНаОтбор
Функция СформироватьПечатнуюФормуЗаданиеНаОтбор(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("ПФ_MXL_ЗаданиеНаОтбор");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб= Истина;
	
	Если  МассивОбъектов.Количество() > 0 Тогда
		Ссылка= МассивОбъектов[0];		
	Иначе
		Возврат ТабДок;
	КонецЕсли;
	
	//Выводим наряд заказ
	ОбластьШтрихкода= Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьСекция= Макет.ПолучитьОбласть("Секция");
	ОбластьСтрока= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал= Макет.ПолучитьОбласть("Подвал");
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьШтрихкода, Ссылка);
	ТабДок.Вывести(ОбластьШтрихкода);
	
	
	СведеньяОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
	ОбластьЗаголовок.Параметры.Организация= СведеньяОбОрганизации.ПолноеНаименование;
	ОбластьЗаголовок.Параметры.АдресОрганизации= СведеньяОбОрганизации.ФактическийАдрес;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ОбластьЗаголовок.Параметры.Автор= Ссылка.Автор;
		Очередь= Ссылка.Очередь;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ОбластьЗаголовок.Параметры.Автор= Ссылка.Ответственный;
		Очередь= Перечисления.Очередь.Очередь1;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		ОбластьЗаголовок.Параметры.Автор= Ссылка.Менеджер;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.НомерОчереди= ""+Очередь+Прав(СокрЛП(Ссылка.Номер), 3);
	ОбластьЗаголовок.Параметры.РасходнаяНакладная= Ссылка;
	ОбластьЗаголовок.Параметры.ДатаОтгрузки= Ссылка.ПрибытиеНаОтгрузку;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка.Контрагент КАК Контрагент,
	|	Товары.Ссылка.ПрибытиеНаОтгрузку КАК ПрибытиеНаОтгрузку,
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдИзм,
	|	СУММА(Товары.Цена) КАК Цена,
	|	СУММА(Товары.СуммаСНДС) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА Товары.Номенклатура.Вес * Товары.КоличествоУпаковок
	|			ИНАЧЕ Товары.КоличествоУпаковок * Товары.Упаковка.Вес
	|		КОНЕЦ) КАК Вес,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	Товары.Ссылка.Дата КАК Дата,
	|	СУММА(Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки) КАК СуммаСкидки,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА Товары.Номенклатура.Объем * Товары.КоличествоУпаковок
	|			ИНАЧЕ Товары.КоличествоУпаковок * Товары.Упаковка.Объем
	|		КОНЕЦ) КАК Объем,
	|	Товары.Номенклатура.Код КАК Код,
	|	Товары.Склад,
	|	Товары.Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	Товары.Номенклатура,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	Товары.Ссылка.ПрибытиеНаОтгрузку,
	|	Товары.Ссылка.Дата,
	|	Товары.Ссылка.Контрагент,
	|	Товары.Номенклатура.Код,
	|	Товары.Склад,
	|	Товары.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПеремещениеТоваровТовары.Номенклатура.Вес * ПеремещениеТоваровТовары.КоличествоУпаковок
	|			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоУпаковок * ПеремещениеТоваровТовары.Упаковка.Вес
	|		КОНЕЦ),
	|	0,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	NULL,
	|	СУММА(ВЫБОР
	|			КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПеремещениеТоваровТовары.Номенклатура.Объем * ПеремещениеТоваровТовары.КоличествоУпаковок
	|			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоУпаковок * ПеремещениеТоваровТовары.Упаковка.Объем
	|		КОНЕЦ),
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Характеристика
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|	И ПеремещениеТоваровТовары.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Ссылка.ПрибытиеНаОтгрузку
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Ссылка,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура,
	|	СУММА(ВозвратТоваровПоставщикуТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	СУММА(ВозвратТоваровПоставщикуТовары.Цена),
	|	СУММА(ВозвратТоваровПоставщикуТовары.СуммаСНДС),
	|	СУММА(ВЫБОР
	|			КОГДА ВозвратТоваровПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.Вес * ВозвратТоваровПоставщикуТовары.КоличествоУпаковок
	|			ИНАЧЕ ВозвратТоваровПоставщикуТовары.КоличествоУпаковок * ВозвратТоваровПоставщикуТовары.Упаковка.Вес
	|		КОНЕЦ),
	|	СУММА(ВозвратТоваровПоставщикуТовары.СуммаНДС),
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Дата,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВозвратТоваровПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.Объем * ВозвратТоваровПоставщикуТовары.КоличествоУпаковок
	|			ИНАЧЕ ВозвратТоваровПоставщикуТовары.КоличествоУпаковок * ВозвратТоваровПоставщикуТовары.Упаковка.Объем
	|		КОНЕЦ),
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Код,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Склад,
	|	ВозвратТоваровПоставщикуТовары.Характеристика
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка В(&МассивДокументов)
	|	И ВозвратТоваровПоставщикуТовары.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровПоставщикуТовары.Ссылка,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Дата,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Код,
	|	ВозвратТоваровПоставщикуТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	ВТ_Товары.Документ,
	|	ВТ_Товары.Контрагент,
	|	ВТ_Товары.ПрибытиеНаОтгрузку,
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.Характеристика,
	|	ВТ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВТ_Товары.ЕдИзм,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Товары.Вес КАК Вес,
	|	ВТ_Товары.СуммаНДС КАК СуммаНДС,
	|	ВТ_Товары.Дата,
	|	ВТ_Товары.СуммаСкидки КАК СуммаСкидки,
	|	ВТ_Товары.Объем КАК Объем,
	|	ВТ_Товары.Код
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ВТ_Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (ИСТИНА = РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ИТОГИ
	|	СУММА(КоличествоУпаковок),
	|	СУММА(Цена),
	|	СУММА(Сумма),
	|	СУММА(Вес),
	|	СУММА(СуммаНДС),
	|	СУММА(СуммаСкидки),
	|	СУММА(Объем)
	|ПО
	|	Секция";
	
	Запрос.УстановитьПараметр("МассивДокументов", Ссылка);
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);
	Результат = Запрос.Выполнить();
	
	СчетСтраниц=1;
	ОбластьШапка.Параметры.СчетСтраниц= СчетСтраниц;	
	ТабДок.Вывести(ОбластьШапка);
	
	Секция7= Справочники.РабочиеУчастки.НайтиПоНаименованию("Д:Склад № 7", Истина);
	Ном= 0;
	ВыборкаСеция = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Секция");
	Пока	ВыборкаСеция.Следующий() Цикл 
		Если Ссылка.Метаданные().Реквизиты.Найти("РеализацияВОкно") <> Неопределено Тогда
			Если Ссылка.РеализацияВОкно И ВыборкаСеция.Секция = Секция7 Тогда
				ОбластьСекция.Параметры.Секция= "ОКНО";
			Иначе
				ОбластьСекция.Параметры.Секция= ВыборкаСеция.Секция;
			КонецЕсли;
		Иначе
			ОбластьСекция.Параметры.Секция= ВыборкаСеция.Секция;
		КонецЕсли;
		ОбластьСекция.Параметры.Вес= ВыборкаСеция.Вес;
		ТабДок.Вывести(ОбластьСекция);
		
		ПервыйДокумент = Истина;
		
		ВыборкаДетальныеЗаписи = ВыборкаСеция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Ном= Ном+1;
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьСтрока.Параметры.Номенклатура= НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Характеристика);
			
			ОбластьСтрока.Параметры.Ном= Ном;
			
			//Проверка вывода 
			мОблостей= Новый Массив;
			мОблостей.Добавить(ОбластьСтрока);
			мОблостей.Добавить(ОбластьПодвал);
			Если ТабДок.ПроверитьВывод(мОблостей) Тогда
				ТабДок.Вывести(ОбластьСтрока);
			Иначе
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				СчетСтраниц= СчетСтраниц+1;
				ОбластьШапка.Параметры.СчетСтраниц= СчетСтраниц;
				ТабДок.Вывести(ОбластьШапка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОбластьПодвал.Параметры.ДатаВремя= ТекущаяДата(); 
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
КонецФункции

#КонецОбласти

#Область ТНСекции
Функция СформироватьПечатнуюФормуПечатьТНСекцииРеализацияНов(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	Макет = ПолучитьМакет("ПФ_MXL_ПечатьТНСекции");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если  МассивОбъектов.Количество() > 0 Тогда
		Ссылка= МассивОбъектов[0];		
	Иначе
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	Если ТипЗнч(Ссылка)  = Тип("ДокументСсылка.ЗаявкиНаДоставку") Тогда
		Ссылка= Ссылка.Основание;
	КонецЕсли;
	
	
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	
	ПакетРезультат= ПолучитьДанныеДляПечатиТНСекции(Ссылка);
	Результат= ПакетРезультат[1];
	РезультатДопЯчейки= ПакетРезультат[2];
	ВыборкаПоДопЯчейкам= РезультатДопЯчейки.Выбрать();
	
	ВыборкаПоСекциям= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Секция");
	Пока ВыборкаПоСекциям.Следующий() Цикл
		
		ВывестиШапку(Ссылка, Макет, ВыборкаПоСекциям, ТабличныйДокумент);
		
		СчетСтрок=1;
		НомерСтроки= 0;
		СуммаИтог=0;
		ИтогНДС= 0;
		
		ВыборкаТовары = ВыборкаПоСекциям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока ВыборкаТовары.Следующий() Цикл
			СчетСтрок = СчетСтрок + 1;
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТовары);
			ОбластьСтрока.Параметры.Цена = ?(ВыборкаТовары.Количество, ВыборкаТовары.Сумма/ВыборкаТовары.Количество,0);
			
			СуммаИтог = СуммаИтог+ ВыборкаТовары.Сумма;
			ИтогНДС = ИтогНДС+ ВыборкаТовары.СуммаНДС;
			
			стрДопЯчейки= "";
			СтуктураПоиска = Новый Структура("Номенклатура", ВыборкаТовары.Номенклатура);
			Пока ВыборкаПоДопЯчейкам.НайтиСледующий(СтуктураПоиска) Цикл
				стрДопЯчейки= стрДопЯчейки+ВыборкаПоДопЯчейкам.ЯчейкаДополнительная+Символы.ПС;
			КонецЦикла;
			ОбластьСтрока.Параметры.ДопЯчейки= стрДопЯчейки;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);	
		КонецЦикла;
		
		ОбластьИтого.Параметры.Заполнить(ВыборкаПоСекциям);		
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'");
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
		
		СуммаНДСРуб=" , в т.ч. НДС - "+ФормированиеПечатныхФорм.ФорматСумм(итогНДС, Константы.ВалютаРегламентированногоУчета.Получить());
		ОбластьПодписи.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки+", на сумму "+ФормированиеПечатныхФорм.ФорматСумм(СуммаИтог, Константы.ВалютаРегламентированногоУчета.Получить())+суммаНДСруб;
		
		ОбластьПодписи.параметры.ВремяПечати=ТекущаяДата();
		ОбластьПодписи.Параметры.СуммаПрописью  = "Сумма: "+РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаИтог,Константы.ВалютаРегламентированногоУчета.Получить());
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		ОбластьШтрихкодДокумента= Макет.ПолучитьОбласть("ОбластьШтрихкодДокумента");
		АльтерраОбщегоНазначения.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШтрихкодДокумента, "КартинкаШтрихкодаДокумента", Ссылка);

		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции

Процедура ВывестиШапку(Ссылка, Макет, ВыборкаПоСекциям, ТабличныйДокумент)
	ОбластьПолоса=		Макет.ПолучитьОбласть("Полоса");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапки  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШтрихкода= Макет.ПолучитьОбласть("ОбластьШтрихкода");
	
	//Шапка заголовок
	СчетФактура=ПродажиСервер.ПредставлениеСчетаФактурыВДокументеПродажи(Ссылка, Ссылка.организация);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ОбластьШтрихкода.Параметры.Автор= Ссылка.Менеджер;
		Очередь= Ссылка.Очередь;
		Если ЗначениеЗаполнено(ВыборкаПоСекциям.Секция) Тогда
				СекцияНадпись=  ВыборкаПоСекциям.Секция;
		Иначе
			СекцияНадпись= "";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ОбластьШтрихкода.Параметры.Автор= Ссылка.Ответственный;
		Очередь= Перечисления.Очередь.Очередь1;
		СекцияНадпись=  ВыборкаПоСекциям.Секция;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		ОбластьШтрихкода.Параметры.Автор= Ссылка.Менеджер;
		СекцияНадпись=  ВыборкаПоСекциям.Секция;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		ОбластьШтрихкода.Параметры.Автор= Ссылка.Кассир;
		СекцияНадпись=  ВыборкаПоСекциям.Секция;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.НомерОчереди= ""+Очередь+Прав(СокрЛП(Ссылка.Номер), 3);
	Если Найти(СТРОКА(ВыборкаПоСекциям.Склад),"Торг")>0 Тогда
		ТабличныйДокумент.Вывести(ОбластьПолоса);
	КонецЕсли;	
	
	Если Строка(Ссылка.Организация.Наименование) <> "АСК и ИП" Тогда
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата), "ПолноеНаименование");
	КонецЕсли;
	ОбластьЗаголовок.Параметры.ПредставлениеАдреса = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата), "ФактическийАдрес");
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		если ссылка.перемещениенафилиал тогда
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = "ООО Альтерра";
		ОбластьЗаголовок.Параметры.ПредставлениеАдреса = "658083, Алтайский край, Новоалтайск г, Дорожная ул, дом № 42/1";
		конецесли;	
	КонецЕсли;

	Попытка
		ЦентральныйСклад = Справочники.Склады.НайтиПоНаименованию("Центральный склад", Истина);
		ТорговыйЗал = Справочники.Склады.НайтиПоНаименованию("Торговый зал", Истина);
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") И ((Ссылка.СкладОтправитель = ЦентральныйСклад И Ссылка.СкладПолучатель = ТорговыйЗал) Или (Ссылка.СкладПолучатель = ЦентральныйСклад И Ссылка.СкладОтправитель = ТорговыйЗал)) Тогда
			ОбластьЗаголовок.Параметры.ПредставлениеДокумента ="Перемещение товаров "+Ссылка.Номер+" от "+Формат(Ссылка.Дата,"ДФ=""дд ММММ гггг 'г.' """); 
			ОбластьЗаголовок.Параметры.Отправитель = "Отправитель: ";
			ОбластьЗаголовок.Параметры.Получатель = Символы.ПС + "Получатель: " + Ссылка.СкладПолучатель;
		Иначе
			ОбластьЗаголовок.Параметры.ПредставлениеДокумента ="Расходная накладная "+Ссылка.Номер+" от "+Формат(Ссылка.Дата,"ДФ=""дд ММММ гггг 'г.' """); 
		КонецЕсли;
	Исключение
		ОбластьЗаголовок.Параметры.ПредставлениеДокумента ="Расходная накладная "+Ссылка.Номер+" от "+Формат(Ссылка.Дата,"ДФ=""дд ММММ гггг 'г.' """); 
	КонецПопытки;

	Если СчетФактура<>"" И ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ОбластьЗаголовок.Параметры.ПредставлениеПокупателя = "Покупатель: "+ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Контрагент, Ссылка.Дата), "ПолноеНаименование,ФактическийАдрес");
	Иначе 
		ОбластьЗаголовок.Параметры.ПредставлениеПокупателя = "Покупатель: ___________________________";
	КонецЕсли;

	ОбластьЗаголовок.Параметры.Секция = СекцияНадпись;
	ОбластьЗаголовок.Параметры.Склад = ВыборкаПоСекциям.Склад;
	
	ВывестиШтрихкодПоСекциям(ТабличныйДокумент, Макет, ОбластьШтрихкода, Ссылка, ?(ВыборкаПоСекциям.Секция= Null, "", ВыборкаПоСекциям.Секция));
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
КонецПроцедуры

Функция  ПолучитьДанныеДляПечатиТНСекции(Ссылка)
	//Выводим товар в приложение 1
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка.Контрагент КАК Контрагент,
	|	Товары.Ссылка.ПрибытиеНаОтгрузку КАК ПрибытиеНаОтгрузку,
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.КоличествоУпаковок) КАК Количество,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдИзм,
	|	СУММА(Товары.Цена) КАК Цена,
	|	СУММА(Товары.СуммаСНДС) КАК Сумма,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	Товары.Ссылка.Дата КАК Дата,
	|	СУММА(Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки) КАК СуммаСкидки,
	|	Товары.Номенклатура.Код КАК Код,
	|	Товары.Склад,
	|	Товары.Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	Товары.Номенклатура,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	Товары.Ссылка.ПрибытиеНаОтгрузку,
	|	Товары.Ссылка.Дата,
	|	Товары.Ссылка.Контрагент,
	|	Товары.Номенклатура.Код,
	|	Товары.Склад,
	|	Товары.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	0,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Характеристика
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Ссылка.ПрибытиеНаОтгрузку
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Ссылка,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура,
	|	СУММА(ВозвратТоваровПоставщикуТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	СУММА(ВозвратТоваровПоставщикуТовары.Цена),
	|	СУММА(ВозвратТоваровПоставщикуТовары.СуммаСНДС),
	|	СУММА(ВозвратТоваровПоставщикуТовары.СуммаНДС),
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Дата,
	|	0,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Код,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Склад,
	|	ВозвратТоваровПоставщикуТовары.Характеристика
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровПоставщикуТовары.Ссылка,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Дата,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Код,
	|	ВозвратТоваровПоставщикуТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.Склад,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ПрибытиеНаОтгрузку
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМТовары.Ссылка,
	|	NULL,
	|	NULL,
	|	ЧекККМТовары.Номенклатура,
	|	СУММА(ЧекККМТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЧекККМТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЧекККМТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	СУММА(ЧекККМТовары.Цена),
	|	СУММА(ЧекККМТовары.Сумма),
	|	СУММА(ЧекККМТовары.СуммаНДС),
	|	ЧекККМТовары.Ссылка.Дата,
	|	СУММА(ЧекККМТовары.СуммаРучнойСкидки + ЧекККМТовары.СуммаАвтоматическойСкидки),
	|	ЧекККМТовары.Номенклатура.Код,
	|	ЧекККМТовары.Ссылка.Склад,
	|	ЧекККМТовары.Характеристика
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|ГДЕ
	|	ЧекККМТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМТовары.Ссылка,
	|	ЧекККМТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЧекККМТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЧекККМТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ЧекККМТовары.Ссылка.Дата,
	|	ЧекККМТовары.Номенклатура.Код,
	|	ЧекККМТовары.Ссылка.Склад,
	|	ЧекККМТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК ЯчейкаОсновная,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	Товары.Документ,
	|	Товары.Контрагент,
	|	Товары.ПрибытиеНаОтгрузку,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика,
	|	Товары.ЕдИзм КАК ЕдиницаЦены,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Дата,
	|	Товары.СуммаСкидки КАК СуммаСкидки,
	|	Товары.Код,
	|	Товары.Количество КАК Количество,
	|	Товары.Склад КАК Склад,
	|	Товары.Количество * &ТекстЗапросаВесНоменклатуры КАК Вес,
	|	Товары.Количество * &ТекстЗапросаОбъемНоменклатуры КАК Объем
	|ИЗ
	|	ВТ_Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (ИСТИНА = РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Код,
	|	Номенклатура,
	|	Склад
	|ИТОГИ
	|	СУММА(Цена),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(СуммаСкидки),
	|	СУММА(Количество),
	|	МАКСИМУМ(Склад),
	|	СУММА(Вес),
	|	СУММА(Объем)
	|ПО
	|	Секция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК ЯчейкаДополнительная
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ВТ_Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (ЛОЖЬ = РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
		Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ТекстЗапросаВесНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
			"Товары.Номенклатура.ЕдиницаИзмерения",
			"Товары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ТекстЗапросаОбъемНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
			"Товары.Номенклатура.ЕдиницаИзмерения",
			"Товары.Номенклатура"));
	
	Запрос.УстановитьПараметр("МассивДокументов", Ссылка);
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
КонецФункции
#КонецОбласти

#Область ЗаданиеНаРазмещение
Функция ЗапросЗаданиеНаРазмещение(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдИзм,
	|	СУММА(ЗаказПоставщикуТовары.Цена) КАК Цена,
	|	СУММА(ЗаказПоставщикуТовары.СуммаСНДС) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА &ТекстЗапросаВесНоменклатурыЗ * ЗаказПоставщикуТовары.КоличествоУпаковок
	|			ИНАЧЕ ЗаказПоставщикуТовары.КоличествоУпаковок * ЗаказПоставщикуТовары.Упаковка.Вес
	|		КОНЕЦ) КАК Вес,
	|	СУММА(ЗаказПоставщикуТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА &ТекстЗапросаОбъемНоменклатурыЗ * ЗаказПоставщикуТовары.КоличествоУпаковок
	|			ИНАЧЕ ЗаказПоставщикуТовары.КоличествоУпаковок * ЗаказПоставщикуТовары.Упаковка.Объем
	|		КОНЕЦ) КАК Объем,
	|	ЗаказПоставщикуТовары.Номенклатура.Код КАК Код,
	|	ЗаказПоставщикуТовары.Ссылка.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.Код,
	|	ЗаказПоставщикуТовары.Ссылка.Склад,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА &ТекстЗапросаВесНоменклатурыП * ПеремещениеТоваровТовары.КоличествоУпаковок
	|			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоУпаковок * ПеремещениеТоваровТовары.Упаковка.Вес
	|		КОНЕЦ),
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА &ТекстЗапросаОбъемНоменклатурыП * ПеремещениеТоваровТовары.КоличествоУпаковок
	|			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоУпаковок * ПеремещениеТоваровТовары.Упаковка.Объем
	|		КОНЕЦ),
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК ОснЯчейка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВТ_Товары.ЕдИзм КАК ЕдИзм,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Товары.Вес КАК Вес,
	|	ВТ_Товары.СуммаНДС КАК СуммаНДС,
	|	ВТ_Товары.Объем КАК Объем,
	|	ВТ_Товары.Код КАК Код,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкамДоп.Ячейка КАК ДопЯчейка
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ВТ_Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (ИСТИНА = РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкамДоп
	|		ПО ВТ_Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкамДоп.Номенклатура
	|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкамДоп.Склад
	|			И (ЛОЖЬ = РазмещениеНоменклатурыПоСкладскимЯчейкамДоп.ОсновнаяЯчейка)
	|ИТОГИ
	|	МАКСИМУМ(ОснЯчейка),
	|	СУММА(КоличествоУпаковок),
	|	МАКСИМУМ(ЕдИзм),
	|	СУММА(Цена),
	|	СУММА(Сумма),
	|	СУММА(Вес),
	|	СУММА(СуммаНДС),
	|	СУММА(Объем),
	|	МАКСИМУМ(Код),
	|	МАКСИМУМ(ДопЯчейка)
	|ПО
	|	Секция,
	|	Номенклатура";
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ТекстЗапросаВесНоменклатурыЗ",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
			"ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения",
			"ЗаказПоставщикуТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ТекстЗапросаОбъемНоменклатурыЗ",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
			"ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения",
			"ЗаказПоставщикуТовары.Номенклатура"));
		
		Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ТекстЗапросаВесНоменклатурыП",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
			"ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения",
			"ПеремещениеТоваровТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ТекстЗапросаОбъемНоменклатурыП",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
			"ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения",
			"ПеремещениеТоваровТовары.Номенклатура"));

	Запрос.УстановитьПараметр("Ссылка", Документы.ЗаказПоставщику.ПустаяСсылка());
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Иначе
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Иначе	
			Если Ссылка.Основание <> Неопределено Тогда
				Если ТипЗнч(Ссылка.Основание) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
					Запрос.УстановитьПараметр("Ссылка", Ссылка.Основание);
				Иначе
					Если ТипЗнч(Ссылка.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						Запрос.УстановитьПараметр("Ссылка", Ссылка.Основание);
					Иначе
						Если Ссылка.Основание <> Неопределено Тогда
							Если ТипЗнч(Ссылка.Основание.Основание) = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
								Запрос.УстановитьПараметр("Ссылка", Ссылка.Основание.Основание);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

Функция СформироватьПечатнуюФормуЗаданиеНаРазмещение(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("ПФ_MXL_ЗаданиеНаРазмещение");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб= Истина;
	
	Если  МассивОбъектов.Количество() > 0 Тогда
		Ссылка= МассивОбъектов[0];		
	КонецЕсли;
	
	ОбластьШтрихкода= Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ОбластьЗаголовок= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьСекция= Макет.ПолучитьОбласть("Секция");
	ОбластьСтрока= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал= Макет.ПолучитьОбласть("Подвал");
	ОбластьОтрыва= Макет.ПолучитьОбласть("ЛистОтрыва");
	ОбластьПоставка = Макет.ПолучитьОбласть("ОбластьСекция");
	
	ОбластьПодвал.Параметры.Комментарий= Ссылка.Комментарий;	
	
	СведеньяОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
	ОбластьЗаголовок.Параметры.Организация= СведеньяОбОрганизации.ПолноеНаименование;
	ОбластьЗаголовок.Параметры.Поставщик= Ссылка.Контрагент;
	ОбластьЗаголовок.Параметры.Склад= Ссылка.Склад;
	Если ЗначениеЗаполнено(Ссылка.Основание) Тогда
		ОбластьЗаголовок.Параметры.НомерЗаказа= Ссылка.Основание.Номер;
		ОбластьЗаголовок.Параметры.ДатаЗаказа= Ссылка.Основание.Дата;
	КонецЕсли;
	ОбластьЗаголовок.Параметры.ТекущаяДата= Формат(ТекущаяДата(), "");
		
	ОбластьОтрыва.Параметры.Организация= ОбластьЗаголовок.Параметры.Организация;
	ОбластьОтрыва.Параметры.Поставщик= ОбластьЗаголовок.Параметры.Поставщик;
	ОбластьОтрыва.Параметры.Склад= ОбластьЗаголовок.Параметры.Склад;
	ОбластьОтрыва.Параметры.НомерЗаказа= ОбластьЗаголовок.Параметры.НомерЗаказа;
	ОбластьОтрыва.Параметры.ДатаЗаказа= ОбластьЗаголовок.Параметры.ДатаЗаказа;
	ОбластьОтрыва.Параметры.ТекущаяДата= Формат(ТекущаяДата(), "");
	
	Результат= ЗапросЗаданиеНаРазмещение(Ссылка);

	СчетСтраниц=1;
	ОбластьШапка.Параметры.СчетСтраниц= СчетСтраниц;	
	
	Ном= 0;
	ВыборкаСекция = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Секция");
	
	КоличествоСекций = ВыборкаСекция.Количество();
	ТекущийНомерСекции = 0;
	
	Если КоличествоСекций = 0 Тогда
		 ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьОтрыва, Ссылка);
		 ТабДок.Вывести(ОбластьОтрыва);
	КонецЕсли;
	
	Пока	ВыборкаСекция.Следующий() Цикл 

	ТекущийНомерСекции = ТекущийНомерСекции +1;
	
	ОбластьПоставка.Параметры.Заполнить(ВыборкаСекция);
    ТабДок.Вывести(ОбластьПоставка);

	ТабДок.Вывести(ОбластьЗаголовок);

    ТабДок.Вывести(ОбластьШапка);

	ВыборкаНоменклатура = ВыборкаСекция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	Пока	ВыборкаНоменклатура.Следующий() Цикл 
		// В цикле получаем строку доп. ячеек
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		ДопЯчейки= "";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДопЯчейки= ДопЯчейки+ ВыборкаДетальныеЗаписи.ДопЯчейка+";";
		КонецЦикла;
		
		ДопЯчейки= Лев(ДопЯчейки, СтрДлина(ДопЯчейки)-1);
		Ном= Ном+1;
		
		ОбластьСтрока.Параметры.Заполнить(ВыборкаНоменклатура);
		
		ОбластьСтрока.Параметры.Ном= Ном;
		ОбластьСтрока.Параметры.ДопЯчейки= ДопЯчейки;
		
		//Проверка вывода 
		мОблостей= Новый Массив;
		мОблостей.Добавить(ОбластьСтрока);
		мОблостей.Добавить(ОбластьПодвал);
		Если ТекущийНомерСекции = КоличествоСекций Тогда
		мОблостей.Добавить(ОбластьОтрыва);
		КонецЕсли;
		Если ТабДок.ПроверитьВывод(мОблостей) Тогда
			ТабДок.Вывести(ОбластьСтрока);
		Иначе
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			СчетСтраниц= СчетСтраниц+1;
			ОбластьШапка.Параметры.СчетСтраниц= СчетСтраниц;
			ТабДок.Вывести(ОбластьШапка);
			ТабДок.Вывести(ОбластьСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Если ТекущийНомерСекции = КоличествоСекций Тогда
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьОтрыва, Ссылка);
		ТабДок.Вывести(ОбластьОтрыва);
	Иначе
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
    
КонецЦикла;

	Возврат ТабДок;
КонецФункции

#КонецОбласти

Функция СформироватьПечатнуюФормуИНВ19(ДокументОснование, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНВ19";
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыИНВ19(ДокументОснование);
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляПечати) Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	ЗаполнитьТабличныйДокументИНВ19(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументИНВ19(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСлева = 10;
	ТабличныйДокумент.ПолеСнизу = 10;
	ТабличныйДокумент.ПолеСправа = 10;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Ложь;
	ТабличныйДокумент.МасштабПечати = 89;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Шапка = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	Шапка.Следующий();
	ТаблицаТоваров = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
	
	Если ДанныеДляПечати.РезультатКурсВалюты <> Неопределено И ДанныеДляПечати.РезультатСвязанныеТовары = Неопределено Тогда
		ПечатьПоВидуЦен = Истина;
		КурсВалюты = ДанныеДляПечати.РезультатКурсВалюты.Выбрать();
		Если КурсВалюты.Следующий() Тогда
			КоэффициентПересчета = КурсВалюты.КоэффициентПересчета;
		Иначе
			КоэффициентПересчета = 1;
		КонецЕсли;
	ИначеЕсли ДанныеДляПечати.РезультатКурсВалюты = Неопределено И ДанныеДляПечати.РезультатСвязанныеТовары <> Неопределено Тогда
		ПечатьПоВидуЦен = Ложь;
		КоэффициентПересчета = 1;
	Иначе       		
		ТекстСообщения = НСтр("ru='Неверные данные для печати.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;		
	КонецЕсли;
	
	Если ТаблицаТоваров.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В рамках периода документа ""%Опись%"" не были оформлены складские акты. Нет данных для формирования печатной формы ""ИНВ-19""'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Опись%", Шапка.Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьИНВ19.ПФ_MXL_ИНВ19");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапки = Макет.ПолучитьОбласть("ШапкаТаблицы");     
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапки_Лист2 = Макет.ПолучитьОбласть("ШапкаТаблицы_Лист2");     
	МассивСтрок_Лист2 = Новый ТабличныйДокумент;
	ОбластьСтроки_Лист2 = Макет.ПолучитьОбласть("Строка_Лист2");
	ОбластьПодвал_Лист2 = Макет.ПолучитьОбласть("Подвал_Лист2");
	
	ОбластьЗаголовок.Параметры.Заполнить(Шапка);
	ОбластьЗаголовок.Параметры.ДолжностьМОЛ1  = Шапка.ДолжностьКладовщика;
	ОбластьЗаголовок.Параметры.ФИОМОЛ1        = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Шапка.Кладовщик);
	ОбластьЗаголовок.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерДокумента);
	ОбластьЗаголовок.Параметры.ОснованиеНомер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.ОснованиеНомер);
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, Шапка.Ссылка);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ИтоговыеСуммы = Новый Структура;
	
	ИтоговыеСуммы.Вставить("ИтогоРезультатИзлишекКолво",0);
	ИтоговыеСуммы.Вставить("ИтогоРезультатИзлишекСумма",0);
	ИтоговыеСуммы.Вставить("ИтогоРезультатНедостачаКолво",0);
	ИтоговыеСуммы.Вставить("ИтогоРезультатНедостачаСумма",0);
	
	ИтоговыеСуммы.Вставить("ИтогоПересортИзлишкиКолво",0);
	ИтоговыеСуммы.Вставить("ИтогоПересортИзлишкиСумма",0);
	ИтоговыеСуммы.Вставить("ИтогоПересортНедостачиКолво",0);
	ИтоговыеСуммы.Вставить("ИтогоПересортНедостачиСумма",0);
	
	ИтоговыеСуммы.Вставить("ИтогоПриходИзлишковКолво",0);
	ИтоговыеСуммы.Вставить("ИтогоПриходИзлишковСумма",0);
	ИтоговыеСуммы.Вставить("ИтогоСписаниеНедостачКолонкаКолво",0);
	ИтоговыеСуммы.Вставить("ИтогоСписаниеНедостачКолонкаСумма",0);
	
	НомерСтроки = 0;
	НомерСтраницы = 1;
	ПервыйНомерСтроки = 1;
	
	КоличествоСтрок = ТаблицаТоваров.Количество();
	
	ТаблицаТоваровРезультат = Новый ТаблицаЗначений;
	ТаблицаТоваровРезультат.Колонки.Добавить("НомерСтроки");
	ТаблицаТоваровРезультат.Колонки.Добавить("НомерСвязаннойСтроки");
	ТаблицаТоваровРезультат.Колонки.Добавить("Номенклатура");
	ТаблицаТоваровРезультат.Колонки.Добавить("Характеристика");
	ТаблицаТоваровРезультат.Колонки.Добавить("Серия");
	ТаблицаТоваровРезультат.Колонки.Добавить("ТоварНаименование");
	ТаблицаТоваровРезультат.Колонки.Добавить("ТоварКод");
	ТаблицаТоваровРезультат.Колонки.Добавить("ЕдиницаИзмеренияКод");
	ТаблицаТоваровРезультат.Колонки.Добавить("ЕдиницаИзмеренияНаименование");
	ТаблицаТоваровРезультат.Колонки.Добавить("КоличествоИзлишков");
	ТаблицаТоваровРезультат.Колонки.Добавить("СуммаИзлишков");
	ТаблицаТоваровРезультат.Колонки.Добавить("КоличествоНедостачи");
	ТаблицаТоваровРезультат.Колонки.Добавить("СуммаНедостачи");
	ТаблицаТоваровРезультат.Колонки.Добавить("ПересортИзлишкиКолво");
	ТаблицаТоваровРезультат.Колонки.Добавить("ПересортИзлишкиСумма");
	ТаблицаТоваровРезультат.Колонки.Добавить("ПересортИзлишкиНомер");
	ТаблицаТоваровРезультат.Колонки.Добавить("ПересортНедостачиКолво");
	ТаблицаТоваровРезультат.Колонки.Добавить("ПересортНедостачиСумма");
	ТаблицаТоваровРезультат.Колонки.Добавить("ПересортНедостачиНомер");
	ТаблицаТоваровРезультат.Колонки.Добавить("ПриходИзлишковКолво");
	ТаблицаТоваровРезультат.Колонки.Добавить("ПриходИзлишковСумма");
	ТаблицаТоваровРезультат.Колонки.Добавить("СписаниеНедостачКолонкаКолво");
	ТаблицаТоваровРезультат.Колонки.Добавить("СписаниеНедостачКолонкаСумма");
	
	Если Не ПечатьПоВидуЦен Тогда
		ТаблицаСвязанныхТоваров = ДанныеДляПечати.РезультатСвязанныеТовары.Выгрузить();
	КонецЕсли;	
	
	//Организовываем таблицу значений с товарами, организуя при этом связанные строки
	Для каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		Если СтрокаТоваров.Операция = "1_Списание" Тогда
			НоваяСтрока = НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СтрокаТоваров, НомерСтроки);
			
			НоваяСтрока.КоличествоИзлишков = 0;	
			НоваяСтрока.СуммаИзлишков = 0;	
			
			НоваяСтрока.КоличествоНедостачи = СтрокаТоваров.Количество;	
			НоваяСтрока.СуммаНедостачи = СтрокаТоваров.Стоимость * КоэффициентПересчета;	
			
			НоваяСтрока.ПересортИзлишкиКолво = 0;	
			НоваяСтрока.ПересортИзлишкиСумма = 0;	
			НоваяСтрока.ПересортИзлишкиНомер = 0;	
			
			НоваяСтрока.ПересортНедостачиКолво = 0;	
			НоваяСтрока.ПересортНедостачиСумма = 0;	
			НоваяСтрока.ПересортНедостачиНомер = 0;	
			
			НоваяСтрока.ПриходИзлишковКолво = 0;	
			НоваяСтрока.ПриходИзлишковСумма = 0;	
			
			НоваяСтрока.СписаниеНедостачКолонкаКолво = СтрокаТоваров.Количество;	
			НоваяСтрока.СписаниеНедостачКолонкаСумма = СтрокаТоваров.Стоимость * КоэффициентПересчета;	
			
			ИтоговыеСуммы.ИтогоРезультатНедостачаКолво = 
			ИтоговыеСуммы.ИтогоРезультатНедостачаКолво + СтрокаТоваров.Количество;
			
			ИтоговыеСуммы.ИтогоРезультатНедостачаСумма = 
			ИтоговыеСуммы.ИтогоРезультатНедостачаСумма + СтрокаТоваров.Стоимость * КоэффициентПересчета;
			
			ИтоговыеСуммы.ИтогоСписаниеНедостачКолонкаКолво = 
			ИтоговыеСуммы.ИтогоСписаниеНедостачКолонкаКолво + СтрокаТоваров.Количество;
			
			ИтоговыеСуммы.ИтогоСписаниеНедостачКолонкаСумма = 
			ИтоговыеСуммы.ИтогоСписаниеНедостачКолонкаСумма + СтрокаТоваров.Стоимость * КоэффициентПересчета;
			
		ИначеЕсли СтрокаТоваров.Операция = "2_Оприходование" Тогда
			НоваяСтрока = НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СтрокаТоваров, НомерСтроки);
			
			НоваяСтрока.КоличествоИзлишков = СтрокаТоваров.Количество;	
			НоваяСтрока.СуммаИзлишков = СтрокаТоваров.Стоимость;	
			
			НоваяСтрока.КоличествоНедостачи = 0;	
			НоваяСтрока.СуммаНедостачи = 0;	
			
			НоваяСтрока.ПересортИзлишкиКолво = 0;	
			НоваяСтрока.ПересортИзлишкиСумма = 0;	
			НоваяСтрока.ПересортИзлишкиНомер = 0;	
			
			НоваяСтрока.ПересортНедостачиКолво = 0;	
			НоваяСтрока.ПересортНедостачиСумма = 0;	
			НоваяСтрока.ПересортНедостачиНомер = 0;	
			
			НоваяСтрока.ПриходИзлишковКолво = СтрокаТоваров.Количество;	
			НоваяСтрока.ПриходИзлишковСумма = СтрокаТоваров.Стоимость * КоэффициентПересчета;	
			
			НоваяСтрока.СписаниеНедостачКолонкаКолво = 0;	
			НоваяСтрока.СписаниеНедостачКолонкаСумма = 0;
			
			ИтоговыеСуммы.ИтогоРезультатИзлишекКолво = 
			ИтоговыеСуммы.ИтогоРезультатИзлишекКолво + СтрокаТоваров.Количество;
			
			ИтоговыеСуммы.ИтогоРезультатИзлишекСумма = 
			ИтоговыеСуммы.ИтогоРезультатИзлишекСумма + СтрокаТоваров.Стоимость * КоэффициентПересчета;
			
			ИтоговыеСуммы.ИтогоПриходИзлишковКолво = 
			ИтоговыеСуммы.ИтогоПриходИзлишковКолво + СтрокаТоваров.Количество;
			
			ИтоговыеСуммы.ИтогоПриходИзлишковСумма = 
			ИтоговыеСуммы.ИтогоПриходИзлишковСумма + СтрокаТоваров.Стоимость * КоэффициентПересчета;
			
		ИначеЕсли СтрокаТоваров.Операция = "3_ПересортицаСписание" Тогда
			Если ПечатьПоВидуЦен Тогда
				НоваяСтрока = НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СтрокаТоваров, НомерСтроки);
				
				НоваяСтрока.КоличествоИзлишков = 0;	
				НоваяСтрока.СуммаИзлишков = 0;	
				
				НоваяСтрока.КоличествоНедостачи = СтрокаТоваров.Количество;	
				НоваяСтрока.СуммаНедостачи = СтрокаТоваров.Стоимость * КоэффициентПересчета;	
				
				НоваяСтрока.ПересортНедостачиКолво = СтрокаТоваров.Количество;	
				НоваяСтрока.ПересортНедостачиСумма = СтрокаТоваров.Стоимость * КоэффициентПересчета;
				
				НоваяСтрока.ПересортИзлишкиКолво = 0;	
				НоваяСтрока.ПересортИзлишкиСумма = 0;	
				НоваяСтрока.ПересортИзлишкиНомер = 0;	
				
				НоваяСтрока.ПриходИзлишковКолво = 0;	
				НоваяСтрока.ПриходИзлишковСумма = 0;	
				
				НоваяСтрока.СписаниеНедостачКолонкаКолво = 0;	
				НоваяСтрока.СписаниеНедостачКолонкаСумма = 0;
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура", СтрокаТоваров.СвязаннаяНоменклатура);
				СтруктураПоиска.Вставить("Характеристика", СтрокаТоваров.СвязаннаяХарактеристика);
				СтруктураПоиска.Вставить("Серия", СтрокаТоваров.СвязаннаяСерия);
				СтруктураПоиска.Вставить("Операция", "4_ПересортицаОприходование");
				
				СтрокаПересортицы = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска)[0];
				
				НоваяСтрока.НомерСвязаннойСтроки = ТаблицаТоваров.Индекс(СтрокаПересортицы)+1;
				
				ИтоговыеСуммы.ИтогоРезультатНедостачаКолво      = ИтоговыеСуммы.ИтогоРезультатНедостачаКолво + СтрокаТоваров.Количество;
				ИтоговыеСуммы.ИтогоРезультатНедостачаСумма      = ИтоговыеСуммы.ИтогоРезультатНедостачаСумма + СтрокаТоваров.Стоимость * КоэффициентПересчета;
				ИтоговыеСуммы.ИтогоПересортНедостачиКолво       = ИтоговыеСуммы.ИтогоПересортНедостачиКолво + СтрокаТоваров.Количество;
				ИтоговыеСуммы.ИтогоПересортНедостачиСумма       = ИтоговыеСуммы.ИтогоПересортНедостачиСумма + СтрокаТоваров.Стоимость * КоэффициентПересчета;
			Иначе
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("НоменклатураСписание", СтрокаТоваров.Номенклатура);
				СтруктураПоиска.Вставить("ХарактеристикаСписание", СтрокаТоваров.Характеристика);
				СтруктураПоиска.Вставить("СерияСписание", СтрокаТоваров.Серия);
				
				МассивСвязанныхТоваров = ТаблицаСвязанныхТоваров.НайтиСтроки(СтруктураПоиска);
				
				Индекс = 0;
				
				Пока СтрокаТоваров.Количество <> 0 Цикл
					
					ТекущийСвязанныйТовар = МассивСвязанныхТоваров[Индекс];
					
					Если ТекущийСвязанныйТовар.Количество = 0 Тогда
						Индекс = Индекс + 1;
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СтрокаТоваров, НомерСтроки);
					НоваяСтрока.НомерСвязаннойСтроки = НомерСтроки + 1;
					
					Если СтрокаТоваров.Количество - ТекущийСвязанныйТовар.Количество >= 0 Тогда
						
						КоличествоНедостачи = ТекущийСвязанныйТовар.Количество;	
						СуммаНедостачи = СтрокаТоваров.Стоимость * КоличествоНедостачи * КоэффициентПересчета;
						
						СтрокаТоваров.Количество = СтрокаТоваров.Количество - КоличествоНедостачи;
						ТекущийСвязанныйТовар.Количество = 0;						
						
					Иначе
						
						КоличествоНедостачи = СтрокаТоваров.Количество;	
						СуммаНедостачи = СтрокаТоваров.Стоимость * КоличествоНедостачи * КоэффициентПересчета;
						
						ТекущийСвязанныйТовар.Количество = ТекущийСвязанныйТовар.Количество - КоличествоНедостачи;
						СтрокаТоваров.Количество = 0;
						
					КонецЕсли;
					
					НоваяСтрока.КоличествоНедостачи = КоличествоНедостачи;	
					НоваяСтрока.СуммаНедостачи = СуммаНедостачи;
					
					НоваяСтрока.КоличествоИзлишков = 0;	
					НоваяСтрока.СуммаИзлишков = 0;
					
					НоваяСтрока.ПересортНедостачиКолво = КоличествоНедостачи;	
					НоваяСтрока.ПересортНедостачиСумма = СуммаНедостачи;
					
					НоваяСтрока.ПересортИзлишкиКолво = 0;	
					НоваяСтрока.ПересортИзлишкиСумма = 0;	
					НоваяСтрока.ПересортИзлишкиНомер = 0;	
					
					НоваяСтрока.ПриходИзлишковКолво = 0;	
					НоваяСтрока.ПриходИзлишковСумма = 0;
					
					НоваяСтрока.СписаниеНедостачКолонкаКолво = 0;	
					НоваяСтрока.СписаниеНедостачКолонкаСумма = 0;
					
					//Найдем и добавим оприходованный товар в таблицу результата
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Номенклатура", ТекущийСвязанныйТовар.НоменклатураОприходование);
					СтруктураПоиска.Вставить("Характеристика", ТекущийСвязанныйТовар.ХарактеристикаОприходование);
					СтруктураПоиска.Вставить("Серия", ТекущийСвязанныйТовар.СерияОприходование);
					СтруктураПоиска.Вставить("Операция", "4_ПересортицаОприходование");
					
					МассивОприходованныхТоваров = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
					
					Для Каждого ОприходованныйТовар Из МассивОприходованныхТоваров Цикл
						Если ОприходованныйТовар.Количество <> 0
							И ОприходованныйТовар.Количество >= КоличествоНедостачи Тогда
							СвободныйОприходованныйТовар = ОприходованныйТовар;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					НоваяСтрока = НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СвободныйОприходованныйТовар, НомерСтроки);
					НоваяСтрока.НомерСвязаннойСтроки = НомерСтроки - 1;
					
					КоличествоИзлишков = КоличествоНедостачи;	
					СуммаИзлишков = СвободныйОприходованныйТовар.Стоимость * КоличествоИзлишков;
					
					СвободныйОприходованныйТовар.Количество = СвободныйОприходованныйТовар.Количество - КоличествоИзлишков;
					
					НоваяСтрока.КоличествоИзлишков = КоличествоИзлишков;	
					НоваяСтрока.СуммаИзлишков = СуммаИзлишков;	
					
					НоваяСтрока.КоличествоНедостачи = 0;	
					НоваяСтрока.СуммаНедостачи = 0;
					
					НоваяСтрока.ПересортИзлишкиКолво = КоличествоИзлишков;	
					НоваяСтрока.ПересортИзлишкиСумма = СуммаИзлишков;
					
					НоваяСтрока.ПриходИзлишковКолво = 0;	
					НоваяСтрока.ПриходИзлишковСумма = 0;	
					
					НоваяСтрока.СписаниеНедостачКолонкаКолво = 0;	
					НоваяСтрока.СписаниеНедостачКолонкаСумма = 0;
					
					НоваяСтрока.ПересортНедостачиКолво = 0;	
					НоваяСтрока.ПересортНедостачиСумма = 0;	
					НоваяСтрока.ПересортНедостачиНомер = 0;
					
					ИтоговыеСуммы.ИтогоРезультатИзлишекКолво      = ИтоговыеСуммы.ИтогоРезультатИзлишекКолво + КоличествоИзлишков;
					ИтоговыеСуммы.ИтогоРезультатИзлишекСумма      = ИтоговыеСуммы.ИтогоРезультатИзлишекСумма + СуммаИзлишков;
					ИтоговыеСуммы.ИтогоПересортИзлишкиКолво       = ИтоговыеСуммы.ИтогоПересортИзлишкиКолво + КоличествоИзлишков;
					ИтоговыеСуммы.ИтогоПересортИзлишкиСумма       = ИтоговыеСуммы.ИтогоПересортИзлишкиСумма + СуммаИзлишков;
					
					ИтоговыеСуммы.ИтогоРезультатНедостачаКолво      = ИтоговыеСуммы.ИтогоРезультатНедостачаКолво + КоличествоНедостачи;
					ИтоговыеСуммы.ИтогоРезультатНедостачаСумма      = ИтоговыеСуммы.ИтогоРезультатНедостачаСумма + СуммаНедостачи;
					ИтоговыеСуммы.ИтогоПересортНедостачиКолво       = ИтоговыеСуммы.ИтогоПересортНедостачиКолво + КоличествоНедостачи;
					ИтоговыеСуммы.ИтогоПересортНедостачиСумма       = ИтоговыеСуммы.ИтогоПересортНедостачиСумма + СуммаНедостачи;
					
					Индекс = Индекс + 1;
					
				КонецЦикла;
			КонецЕсли;				
		ИначеЕсли СтрокаТоваров.Операция = "4_ПересортицаОприходование" Тогда	
			Если ПечатьПоВидуЦен Тогда
				НоваяСтрока = НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СтрокаТоваров, НомерСтроки);
				
				НоваяСтрока.КоличествоИзлишков = СтрокаТоваров.Количество;	
				НоваяСтрока.СуммаИзлишков = СтрокаТоваров.Стоимость * КоэффициентПересчета;	
				
				НоваяСтрока.КоличествоНедостачи = 0;	
				НоваяСтрока.СуммаНедостачи = 0;	
				
				НоваяСтрока.ПересортНедостачиКолво = 0;	
				НоваяСтрока.ПересортНедостачиСумма = 0;	
				НоваяСтрока.ПересортНедостачиНомер = 0;	
				
				НоваяСтрока.ПересортИзлишкиКолво = СтрокаТоваров.Количество;	
				НоваяСтрока.ПересортИзлишкиСумма = СтрокаТоваров.Стоимость * КоэффициентПересчета;	
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура",СтрокаТоваров.СвязаннаяНоменклатура);
				СтруктураПоиска.Вставить("Характеристика",СтрокаТоваров.СвязаннаяХарактеристика);
				СтруктураПоиска.Вставить("Серия",СтрокаТоваров.СвязаннаяСерия);
				СтруктураПоиска.Вставить("Операция","3_ПересортицаСписание");
				
				СтрокаПересортицы = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска)[0];
				
				НоваяСтрока.НомерСвязаннойСтроки = ТаблицаТоваров.Индекс(СтрокаПересортицы)+1;	
				
				НоваяСтрока.ПриходИзлишковКолво = 0;	
				НоваяСтрока.ПриходИзлишковСумма = 0;	
				
				НоваяСтрока.СписаниеНедостачКолонкаКолво = 0;	
				НоваяСтрока.СписаниеНедостачКолонкаСумма = 0;
				
				ИтоговыеСуммы.ИтогоРезультатИзлишекКолво      = ИтоговыеСуммы.ИтогоРезультатИзлишекКолво + СтрокаТоваров.Количество;
				ИтоговыеСуммы.ИтогоРезультатИзлишекСумма      = ИтоговыеСуммы.ИтогоРезультатИзлишекСумма + СтрокаТоваров.Стоимость * КоэффициентПересчета;
				ИтоговыеСуммы.ИтогоПересортИзлишкиКолво       = ИтоговыеСуммы.ИтогоПересортИзлишкиКолво + СтрокаТоваров.Количество;
				ИтоговыеСуммы.ИтогоПересортИзлишкиСумма       = ИтоговыеСуммы.ИтогоПересортИзлишкиСумма + СтрокаТоваров.Стоимость * КоэффициентПересчета;
			Иначе
				МассивСвязанныхТоваров = Новый Массив;
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("НоменклатураОприходование", СтрокаТоваров.Номенклатура);
				СтруктураПоиска.Вставить("ХарактеристикаОприходование", СтрокаТоваров.Характеристика);
				СтруктураПоиска.Вставить("СерияОприходование", СтрокаТоваров.Серия);
				
				МассивСвязанныхТоваров = ТаблицаСвязанныхТоваров.НайтиСтроки(СтруктураПоиска);
				
				Индекс = 0;
				
				Пока СтрокаТоваров.Количество <> 0 Цикл
					
					ТекущийСвязанныйТовар = МассивСвязанныхТоваров[Индекс];
					
					Если ТекущийСвязанныйТовар.Количество = 0 Тогда
						Индекс = Индекс + 1;
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СтрокаТоваров, НомерСтроки);
					НоваяСтрока.НомерСвязаннойСтроки = НомерСтроки + 1;
					
					Если СтрокаТоваров.Количество - ТекущийСвязанныйТовар.Количество >= 0 Тогда
						
						КоличествоИзлишков = ТекущийСвязанныйТовар.Количество;	
						СуммаИзлишков = СтрокаТоваров.Стоимость * КоличествоИзлишков;
						
						СтрокаТоваров.Количество = СтрокаТоваров.Количество - КоличествоИзлишков;
						ТекущийСвязанныйТовар.Количество = 0;
						
					Иначе 
						
						КоличествоИзлишков = СтрокаТоваров.Количество;	
						СуммаИзлишков = СтрокаТоваров.Стоимость * КоличествоИзлишков;
						
						СтрокаТоваров.Количество = 0;
						ТекущийСвязанныйТовар.Количество = ТекущийСвязанныйТовар.Количество - КоличествоИзлишков;
						
					КонецЕсли;
					
					НоваяСтрока.КоличествоИзлишков = КоличествоИзлишков;	
					НоваяСтрока.СуммаИзлишков = СуммаИзлишков;	
					
					НоваяСтрока.КоличествоНедостачи = 0;	
					НоваяСтрока.СуммаНедостачи = 0;
					
					НоваяСтрока.ПересортИзлишкиКолво = КоличествоИзлишков;	
					НоваяСтрока.ПересортИзлишкиСумма = СуммаИзлишков;
					
					НоваяСтрока.ПриходИзлишковКолво = 0;	
					НоваяСтрока.ПриходИзлишковСумма = 0;	
					
					НоваяСтрока.СписаниеНедостачКолонкаКолво = 0;	
					НоваяСтрока.СписаниеНедостачКолонкаСумма = 0;
					
					НоваяСтрока.ПересортНедостачиКолво = 0;	
					НоваяСтрока.ПересортНедостачиСумма = 0;	
					НоваяСтрока.ПересортНедостачиНомер = 0;
					
					//Найдем и добавим списанный товар в таблицу результата
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Номенклатура", ТекущийСвязанныйТовар.НоменклатураСписание);
					СтруктураПоиска.Вставить("Характеристика", ТекущийСвязанныйТовар.ХарактеристикаСписание);
					СтруктураПоиска.Вставить("Серия", ТекущийСвязанныйТовар.СерияСписание);
					
					СтруктураПоиска.Вставить("Операция", "3_ПересортицаСписание");
					
					МассивСписанныхТоваров = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
					
					Для Каждого СписанныйТовар Из МассивСписанныхТоваров Цикл
						Если СписанныйТовар.Количество <> 0 И СписанныйТовар.Количество >= КоличествоИзлишков Тогда
							СвободныйСписанныйТовар = СписанныйТовар;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					НоваяСтрока = НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СвободныйСписанныйТовар, НомерСтроки);
					НоваяСтрока.НомерСтроки = НомерСтроки;
					НоваяСтрока.НомерСвязаннойСтроки = НомерСтроки - 1;
					
					КоличествоНедостачи = КоличествоИзлишков;	
					СуммаНедостачи = СвободныйСписанныйТовар.Стоимость * КоличествоНедостачи;
					
					СвободныйСписанныйТовар.Количество = СвободныйСписанныйТовар.Количество - КоличествоНедостачи;
					
					НоваяСтрока.КоличествоНедостачи = КоличествоНедостачи;	
					НоваяСтрока.СуммаНедостачи = СуммаНедостачи;
					
					НоваяСтрока.КоличествоИзлишков = 0;	
					НоваяСтрока.СуммаИзлишков = 0;
					
					НоваяСтрока.ПересортНедостачиКолво = КоличествоНедостачи;	
					НоваяСтрока.ПересортНедостачиСумма = СуммаНедостачи;
					
					НоваяСтрока.ПересортИзлишкиКолво = 0;	
					НоваяСтрока.ПересортИзлишкиСумма = 0;	
					НоваяСтрока.ПересортИзлишкиНомер = 0;	
					
					НоваяСтрока.ПриходИзлишковКолво = 0;	
					НоваяСтрока.ПриходИзлишковСумма = 0;
					
					НоваяСтрока.СписаниеНедостачКолонкаКолво = 0;	
					НоваяСтрока.СписаниеНедостачКолонкаСумма = 0;
					
					ИтоговыеСуммы.ИтогоРезультатИзлишекКолво      = ИтоговыеСуммы.ИтогоРезультатИзлишекКолво + КоличествоИзлишков;
					ИтоговыеСуммы.ИтогоРезультатИзлишекСумма      = ИтоговыеСуммы.ИтогоРезультатИзлишекСумма + СуммаИзлишков;
					ИтоговыеСуммы.ИтогоПересортИзлишкиКолво       = ИтоговыеСуммы.ИтогоПересортИзлишкиКолво + КоличествоИзлишков;
					ИтоговыеСуммы.ИтогоПересортИзлишкиСумма       = ИтоговыеСуммы.ИтогоПересортИзлишкиСумма + СуммаИзлишков;
					
					ИтоговыеСуммы.ИтогоРезультатНедостачаКолво      = ИтоговыеСуммы.ИтогоРезультатНедостачаКолво + КоличествоНедостачи;
					ИтоговыеСуммы.ИтогоРезультатНедостачаСумма      = ИтоговыеСуммы.ИтогоРезультатНедостачаСумма + СуммаНедостачи;
					ИтоговыеСуммы.ИтогоПересортНедостачиКолво       = ИтоговыеСуммы.ИтогоПересортНедостачиКолво + КоличествоНедостачи;
					ИтоговыеСуммы.ИтогоПересортНедостачиСумма       = ИтоговыеСуммы.ИтогоПересортНедостачиСумма + СуммаНедостачи;
					
					Индекс = Индекс + 1;
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	НомерСтроки = 0;
	
	//Вывод на макет
	Для Каждого СтрокаТовар Из ТаблицаТоваровРезультат Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовар.НомерСвязаннойСтроки) Тогда
			
			Если СтрокаТовар.ПересортНедостачиКолво <> 0 Тогда
				СтрокаТовар.ПересортНедостачиНомер = СтрокаТовар.НомерСвязаннойСтроки;
			ИначеЕсли СтрокаТовар.ПересортИзлишкиКолво <> 0 Тогда
				СтрокаТовар.ПересортИзлишкиНомер = СтрокаТовар.НомерСвязаннойСтроки; 
			КонецЕсли;
		КонецЕсли;
		
		ОбластьСтроки.Параметры.Заполнить(СтрокаТовар);
		ОбластьСтроки_Лист2.Параметры.Заполнить(СтрокаТовар);
		
		Если НомерСтроки = 0 Тогда // первая строка
			
			ТекстСтраница = НСтр("ru='Страница %НомерСтраницы%'");
			ТекстСтраница = СтрЗаменить(ТекстСтраница,"%НомерСтраницы%",2);
			ОбластьШапки.Параметры.НомерСтраницы = ТекстСтраница;
			ТабличныйДокумент.Вывести(ОбластьШапки);
			
			ТекстСтраница = НСтр("ru='Страница %НомерСтраницы% (продолжение)'");
			ТекстСтраница = СтрЗаменить(ТекстСтраница,"%НомерСтраницы%",2);
			ОбластьШапки_Лист2.Параметры.НомерСтраницы = ТекстСтраница;
			МассивСтрок_Лист2.Присоединить(ОбластьШапки_Лист2);
			
		Иначе
			
			Если НомерСтроки <> 0 И Не ТабличныйДокумент.ПроверитьВывод(ОбластьСтроки) Тогда
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				ТекстСтраница = НСтр("ru='Страница %НомерСтраницы%'");
				ТекстСтраница = СтрЗаменить(ТекстСтраница,"%НомерСтраницы%",НомерСтраницы);
				ОбластьШапки.Параметры.НомерСтраницы = ТекстСтраница;
				ТабличныйДокумент.Вывести(ОбластьШапки);
				
				МассивСтрок_Лист2.ВывестиГоризонтальныйРазделительСтраниц();
				МассивСтрок_Лист2.Присоединить(ОбластьШапки_Лист2);
			КонецЕсли;
			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
		ТабличныйДокумент.Вывести(ОбластьСтроки);
		МассивСтрок_Лист2.Присоединить(ОбластьСтроки_Лист2);
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Заполнить(ИтоговыеСуммы);
	ОбластьПодвал_Лист2.Параметры.Заполнить(ИтоговыеСуммы);
	
	ОбластьПодвал_Лист2.Параметры.ДолжностьМОЛ1      = Шапка.ДолжностьКладовщика;
	ОбластьПодвал_Лист2.Параметры.ФИОМОЛ1            = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Шапка.Кладовщик);
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабличныйДокумент.Вывести(МассивСтрок_Лист2);
	
	ТабличныйДокумент.Вывести(ОбластьПодвал_Лист2);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	
КонецПроцедуры

Функция НоваяСтрокаТаблицыРезультатов(ТаблицаТоваровРезультат, СтрокаТоваров, НомерСтроки)
	НоваяСтрока = ТаблицаТоваровРезультат.Добавить();
	
	НоваяСтрока.Номенклатура = СтрокаТоваров.Номенклатура;
	НоваяСтрока.Характеристика = СтрокаТоваров.Характеристика;
	НоваяСтрока.Серия = СтрокаТоваров.Серия;
	НоваяСтрока.ТоварНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
	СтрокаТоваров.ТоварНаименование,
	СтрокаТоваров.ХарактеристикаПредставление,
	СтрокаТоваров.СерияПредставление)
	+ ?(СтрокаТоваров.ЭтоВозвратнаяТара, НСтр("ru=' (возвратная тара)'"), "");
	НоваяСтрока.ТоварКод = СтрокаТоваров.ТоварКод;
	НоваяСтрока.ЕдиницаИзмеренияКод = СтрокаТоваров.ЕдиницаИзмеренияКод;
	НоваяСтрока.ЕдиницаИзмеренияНаименование = СтрокаТоваров.ЕдиницаИзмеренияНаименование;
	
	НомерСтроки = НомерСтроки + 1;
	НоваяСтрока.НомерСтроки = НомерСтроки;
	
	Возврат НоваяСтрока;
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыИНВ19(ДокументОснование) 
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	ЗапросПредварительныхДанных = Новый Запрос;
	ЗапросПредварительныхДанных.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатыДокументов.Дата КАК Дата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПересортицаТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.ПересортицаТоваров КАК ПересортицаТоваров
	|	ГДЕ
	|		ПересортицаТоваров.Проведен = ИСТИНА
	|		И ПересортицаТоваров.Основание = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОприходованиеИзлишковТоваров.Дата
	|	ИЗ
	|		Документ.ОприходованиеИзлишковТоваров КАК ОприходованиеИзлишковТоваров
	|	ГДЕ
	|		ОприходованиеИзлишковТоваров.Проведен = ИСТИНА
	|		И ОприходованиеИзлишковТоваров.Основание = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписаниеНедостачТоваров.Дата
	|	ИЗ
	|		Документ.СписаниеНедостачТоваров КАК СписаниеНедостачТоваров
	|	ГДЕ
	|		СписаниеНедостачТоваров.Проведен = ИСТИНА
	|		И СписаниеНедостачТоваров.Основание = &ДокументОснование) КАК ДатыДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	ЗапросПредварительныхДанных.УстановитьПараметр("ДокументОснование", ДокументОснование);	
	ПредварительныеДанныеРезультат = ЗапросПредварительныхДанных.Выполнить().Выбрать();
	
	Если НЕ ПредварительныеДанныеРезультат.Следующий() Тогда
		ТекстСообщения = НСтр("ru = 'Печать %Документ% не выполнена: в указанный инвентаризационный период не найдены складские документы товаров.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Строка(ДокументОснование));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОснование);
		Возврат Неопределено
	КонецЕсли;
	
	ДатаНачала 						  = НачалоДня(ПредварительныеДанныеРезультат.Дата);
	ДатаОкончания 					  = КонецДня(ПредварительныеДанныеРезультат.Дата);
	Склад							  = ДокументОснование.Склад;	
	ВидЦены 						  = Справочники.ВидыЦен.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", 	   ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	   ДатаОкончания);
	Запрос.УстановитьПараметр("Склад", 			   Склад);
	Запрос.УстановитьПараметр("ДатаОстатков", 	   ДатаОкончания);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВидЦены", 		   ДокументОснование.ВидЦены);
	Запрос.УстановитьПараметр("ДатаНачалаИнвентаризации", ДокументОснование.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончанияИнвентаризации", ДокументОснование.ДатаОкончания);    
	Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());
	
	УчитыватьСебестоимостьТоваровПоВидамЗапасов = ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьТоваровПоВидамЗапасов");
	Запрос.УстановитьПараметр("УчитыватьСебестоимостьТоваровПоВидамЗапасов", УчитыватьСебестоимостьТоваровПоВидамЗапасов);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписаниеНедостачТоваровВидЗапасов.Номенклатура КАК Номенклатура,
	|	СписаниеНедостачТоваровВидЗапасов.Характеристика КАК Характеристика,
	|	СписаниеНедостачТоваровВидЗапасов.Серия КАК Серия,
	|	СписаниеНедостачТоваровВидЗапасов.Количество КАК Количество,
	|	""1_Списание"" КАК Операция,
	|	NULL КАК СвязаннаяНоменклатура,
	|	NULL КАК СвязаннаяХарактеристика,
	|	NULL КАК СвязаннаяСерия
	|ПОМЕСТИТЬ ВложенныйЗапрос
	|ИЗ
	|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровВидЗапасов
	|ГДЕ
	|	СписаниеНедостачТоваровВидЗапасов.Ссылка.Проведен
	|	И СписаниеНедостачТоваровВидЗапасов.Ссылка.Основание = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура,
	|	ОприходованиеИзлишковТоваровТовары.Характеристика,
	|	ОприходованиеИзлишковТоваровТовары.Серия,
	|	ОприходованиеИзлишковТоваровТовары.Количество,
	|	""2_Оприходование"",
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
	|ГДЕ
	|	ОприходованиеИзлишковТоваровТовары.Ссылка.Проведен
	|	И ОприходованиеИзлишковТоваровТовары.Ссылка.Основание = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПересортицаТоваровТовары.Номенклатура,
	|	ПересортицаТоваровТовары.Характеристика,
	|	ПересортицаТоваровТовары.Серия,
	|	ПересортицаТоваровТовары.Количество,
	|	""3_ПересортицаСписание"",
	|	ПересортицаТоваровТовары.НоменклатураОприходование,
	|	ПересортицаТоваровТовары.ХарактеристикаОприходование,
	|	ПересортицаТоваровТовары.СерияОприходование
	|ИЗ
	|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	|ГДЕ
	|	ПересортицаТоваровТовары.Ссылка.Проведен
	|	И ПересортицаТоваровТовары.Ссылка.Основание = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПересортицаТоваровТовары.НоменклатураОприходование,
	|	ПересортицаТоваровТовары.ХарактеристикаОприходование,
	|	ПересортицаТоваровТовары.СерияОприходование,
	|	ПересортицаТоваровТовары.Количество,
	|	""4_ПересортицаОприходование"",
	|	ПересортицаТоваровТовары.Номенклатура,
	|	ПересортицаТоваровТовары.Характеристика,
	|	ПересортицаТоваровТовары.Серия
	|ИЗ
	|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	|ГДЕ
	|	ПересортицаТоваровТовары.Ссылка.Проведен
	|	И ПересортицаТоваровТовары.Ссылка.Основание = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Серия,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	ВложенныйЗапрос.Операция,
	|	ВложенныйЗапрос.СвязаннаяНоменклатура,
	|	ВложенныйЗапрос.СвязаннаяХарактеристика,
	|	ВложенныйЗапрос.СвязаннаяСерия,
	|	&ВидЦены КАК ВидЦен
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	ВложенныйЗапрос КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Операция,
	|	ВложенныйЗапрос.СвязаннаяНоменклатура,
	|	ВложенныйЗапрос.СвязаннаяХарактеристика,
	|	ВложенныйЗапрос.СвязаннаяСерия,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
	|	ЦеныНоменклатуры.Упаковка,
	|	ЦеныНоменклатуры.Цена
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ),
	|			(ВидЦены, Номенклатура, Характеристика) В
	|				(ВЫБРАТЬ
	|					Таблица.ВидЦен,
	|					Таблица.Номенклатура,
	|					Таблица.Характеристика
	|				ИЗ
	|					ТаблицаТовары КАК Таблица)) КАК ЦеныНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПересчетТоваров.Склад.ТекущийОтветственный КАК Кладовщик,
	|	ПересчетТоваров.Склад.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	ПересчетТоваров.Склад.Наименование КАК ПодразделениеПредставление,
	|	&ДатаНачалаИнвентаризации КАК ДатаНачала,
	|	&ДатаОкончанияИнвентаризации КАК ДатаОкончания,
	|	ПересчетТоваров.Дата КАК ОснованиеДата,
	|	ПересчетТоваров.Номер КАК ОснованиеНомер,
	|	ПересчетТоваров.Номер КАК НомерДокумента,
	|	&ДатаОкончания КАК ДатаДокумента,
	|	ПересчетТоваров.Ссылка КАК Ссылка,
	|	&ДатаОстатков КАК ДатаСнятияОстатков
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|ГДЕ
	|	ПересчетТоваров.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	|	ТаблицаТовары.Серия.Наименование КАК СерияПредставление,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Количество * ВЫБОР
	|		КОГДА НЕ ЦеныНоменклатуры.Упаковка.Коэффициент ЕСТЬ NULL 
	|				И ЦеныНоменклатуры.Упаковка.Коэффициент <> 0
	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) / ЦеныНоменклатуры.Упаковка.Коэффициент
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ КАК Стоимость,
	|	ТаблицаТовары.Операция,
	|	ТаблицаТовары.СвязаннаяНоменклатура,
	|	ТаблицаТовары.СвязаннаяХарактеристика,
	|	ТаблицаТовары.СвязаннаяСерия,
	|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ТаблицаТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ТаблицаТовары.Номенклатура.Код КАК ТоварКод,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТаблицаТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ТаблицаТовары.Характеристика = ЦеныНоменклатуры.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварНаименование,
	|	ХарактеристикаПредставление,
	|	СерияПредставление,
	|	ТаблицаТовары.Операция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КурсыВалютСрезПоследних.КурсЧислитель / КурсыВалютСрезПоследних.КурсЗнаменатель КАК КоэффициентПересчета
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|			&ДатаОстатков,
	|			Валюта В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ВЫРАЗИТЬ(Таблица.ВидЦен КАК Справочник.ВидыЦен).ВалютаЦены
	|				ИЗ
	|					ТаблицаТовары КАК Таблица)
	|				И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютСрезПоследних";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Номенклатура.Код", "Номенклатура." + КолонкаКодов);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результаты = Запрос.ВыполнитьПакет();
	РезультатПоШапке = Результаты[3];
	РезультатПоТабличнойЧасти = Результаты[4];
	РезультатКурсВалюты = Результаты[5];
	РезультатСвязанныеТовары = Неопределено;
	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РезультатПоШапке",			РезультатПоШапке);
	СтруктураВозврата.Вставить("РезультатПоТабличнойЧасти", РезультатПоТабличнойЧасти);
	СтруктураВозврата.Вставить("РезультатКурсВалюты", 		РезультатКурсВалюты);
	СтруктураВозврата.Вставить("РезультатСвязанныеТовары",  РезультатСвязанныеТовары);
	
	Возврат СтруктураВозврата
	
КонецФункции

// Анкеты покупателей
Функция ПечатьАнкеты(МассивОбъектов,ОбъектыПечати,ПараметрыПечати)
	Объект=МассивОбъектов[0];
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("ПФ_MXL_АнкетаПолученияКарты");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаПолучениеКарты";	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заполнить(Объект);
	Область.Параметры.Заполнить(Объект.Партнер);
	Фамилия = "";
	Имя = "";
	Отчество = "";
	РазобратьФИО(Объект.Партнер, Фамилия, Имя, Отчество);
	Область.Параметры.Фамилия = Фамилия;
	Область.Параметры.Имя = Имя;
	Область.Параметры.Отчество = Отчество;
	Область.Параметры.Телефон = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Объект.Партнер, Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	Область.Параметры.Адрес = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Объект.Партнер, Справочники.ВидыКонтактнойИнформации.АдресПартнера);
	Область.Параметры.ТекущаяДата = ТекущаяДата();
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.Вывести(Область);	
	Возврат ТабДок;
КонецФункции

Функция ПечатьАнкетыПостоянногоПокупателя(МассивОбъектов,ОбъектыПечати,ПараметрыПечати)
	ТабДок= Новый ТабличныйДокумент;
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("MXL_АнкетаПостоянногоПокупателя");
	Область= Макет.ПолучитьОбласть("Анкета");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.КартыЛояльности") Тогда
			Клиент= Ссылка.Партнер;
			НомерКарты= Ссылка.Штрихкод;
		ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда					
			Клиент= Ссылка;
			НомерКарты= "";
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ  ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда					
			Клиент= Ссылка.Партнер;
			НомерКарты= Ссылка.КартаЛояльности.Штрихкод;
		КонецЕсли;
		
		Выборка= ПолучитьДанныеДляАнкеты(Клиент);
		Если Выборка.Следующий() Тогда
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.НомерКарты= НомерКарты;
			Область.Параметры.Дата= ТекущаяДата();
		КонецЕсли;
		
		ТабДок.Вывести(Область);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	ТабДок.АвтоМасштаб= Истина;
	
	Возврат ТабДок;
КонецФункции

Функция ПечатьАнкетыКрупнойПокупки(МассивОбъектов,ОбъектыПечати,ПараметрыПечати)
	ТабДок= Новый ТабличныйДокумент;
	Макет = Обработки.ПечатьФормДополнительно.ПолучитьМакет("MXL_АнкетаКрупнойПокупки");
	Область= Макет.ПолучитьОбласть("Анкета");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.КартыЛояльности") Тогда
			Клиент= Ссылка.Партнер;
			НомерКарты= Ссылка.Штрихкод;
		ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда					
			Клиент= Ссылка;
			НомерКарты= "";
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ  ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда					
			Клиент= Ссылка.Партнер;
			НомерКарты= Ссылка.КартаЛояльности.Штрихкод;
		КонецЕсли;
		
		Выборка= ПолучитьДанныеДляАнкеты(Клиент);
		Если Выборка.Следующий() Тогда
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.НомерКарты= НомерКарты;
			Область.Параметры.Дата= ТекущаяДата();
		КонецЕсли;
		
		ТабДок.Вывести(Область);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	ТабДок.АвтоМасштаб= Истина;
	
	Возврат ТабДок;
КонецФункции

Функция ПолучитьДанныеДляАнкеты(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партнеры.Ссылка,
	|	Партнеры.ЮрФизЛицо,
	|	Партнеры.Пол,
	|	Партнеры.ДатаРождения,
	|	Партнеры.Представление КАК ФИО,
	|	ПартнерыКонтактнаяИнформацияПочта.Представление КАК Почта,
	|	ПартнерыКонтактнаяИнформацияТелефон.Представление КАК Телефон
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияТелефон
	|		ПО Партнеры.Ссылка = ПартнерыКонтактнаяИнформацияТелефон.Ссылка
	|			И (&ВидТелефон = ПартнерыКонтактнаяИнформацияТелефон.Вид)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияПочта
	|		ПО Партнеры.Ссылка = ПартнерыКонтактнаяИнформацияПочта.Ссылка
	|			И (&ВидПочта = ПартнерыКонтактнаяИнформацияПочта.Вид)
	|ГДЕ
	|	Партнеры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидПочта", Справочники.ВидыКонтактнойИнформации.EmailПартнера);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

Функция СформироватьДоговорКуплиПродажи(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	ТабДок= Новый ТабличныйДокумент;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		   ЗаполнитьДоговорКуплиРодажи(Ссылка, ТабДок);
	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции

Процедура ЗаполнитьДоговорКуплиРодажи(Ссылка, ТабДок)
	Макет= ПолучитьМакет("ПФ_MXL_ДоговорКуплиПродажи");
	Шапка= Макет.ПолучитьОбласть("Шапка");
	
	ТаблицаСчФактур= Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(Ссылка);
	Если ТаблицаСчФактур.Количество() > 0 Тогда
		Счф= ТаблицаСчФактур[0];
		Шапка.Параметры.Номер= Счф.Номер;
		Шапка.Параметры.Дата= Формат(Счф.Дата,"ДЛФ=DD") ;
	Иначе
		Сообщить("Нет счет-фактуры!");
		Возврат;
	КонецЕсли;
	
	СведеньяОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата,, Ссылка.БанковскийСчетОрганизации);
	СведеньяОКлиента = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Контрагент, Ссылка.Дата, Истина, Ссылка.БанковскийСчетКонтрагента);
	
	Список = "ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	ОписаниеОрганизации= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведеньяОбОрганизации, Список, Ложь);
	ОписаниеКлиента= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведеньяОКлиента, Список, Ложь);
	
	Шапка.Параметры.НаименованиеОрганизации= СведеньяОбОрганизации.ПолноеНаименование;
	Шапка.Параметры.НаименованиеКлиента= СведеньяОКлиента.ПолноеНаименование;
	
	Шапка.Параметры.ОписаниеОрганизации= ОписаниеОрганизации;
	Шапка.Параметры.ОписаниеКлиента= ОписаниеКлиента;
	
	Шапка.Параметры.СуммаДокумента= Ссылка.СуммаДокумента;
	Шапка.Параметры.СуммаДокументаПрописью= РаботаСКурсамиВалют.СформироватьСуммуПрописью(Ссылка.СуммаДокумента, Константы.ВалютаРегламентированногоУчета.Получить());
	
	ТабДок.АвтоМасштаб= Истина;
	ТабДок.Защита= Ложь;
	ТабДок.ТолькоПросмотр= Ложь;
	
	ТабДок.Вывести(Шапка);
КонецПроцедуры

#КонецЕсли