#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтотОбъект, "");
	
	ЗаполнитьНастройкиХранилища();

	УстановитьПараметрыДинамическихСписков();
	
	Если Не ЗначениеЗаполнено(Касса) Тогда
		Сообщить("На рабочем месте не настроена касса, обратитесь в техническую поддержку!");
		Отказ = Истина;
	КонецЕсли;
	
	Если ОшибкаПроверкиКассы() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ОборудованиеПодключено = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(
	"ЭквайринговыйТерминал",
	Неопределено,
	МенеджерОборудованияВызовСервера.РабочееМестоКлиента()).Количество() > 0;
	Элементы.ГруппаКомандПодключаемый.Видимость = ОборудованиеПодключено;
	//Вставка сбп
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) и ЗначениеЗаполнено(КассаККМ) Тогда
		ДанныеКС = ИнтеграцияСБПГазпромбанк.ПолучитьКассовуюСсылкуДляТерминалаКассы(КассаККМ, ЭквайринговыйТерминал);
		Если ДанныеКС <> Неопределено Тогда
			ИдентификаторКС = ДанныеКС.grcId; 
			Элементы.ОплатитьВернутьСБП.Доступность = Истина; 
		КонецЕсли;
	КонецЕсли;
    //КонецВставки сбп
	Если Параметры.Свойство("ДокументПродажи") Тогда
		
		ДокументОснование = Параметры.ДокументПродажи;
			
		ЗаполнитьДанныеПоДокументуОплаты(ДокументОснование);
		
		ОбновитьВариантОтправкиЧека();  
		
		ОбновитьКонтактнуюИнформациюПартнера();
		
		УстановитьУсловноеОформлениеЭлементовФормы();

	КонецЕсли; 

	Если Не РольДоступна("ПолныеПрава") Тогда
		 Элементы.ДанныеБезналичныхОплат.Видимость = Ложь;
	 КонецЕсли;
	 БылиОшибки = Ложь;
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "ЭквайринговыйТерминал");
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтправкаНаСмсПриИзменении(Элемент)
	
	ОтправкаНаПочту = Не ОтправкаНаСМС; 
	
	ВариантЧека = ?(ОтправкаНаСмс,"Смс","Почта"); 
	   
	ОбновитьУсловноеОформлениеВариантаОтправкиЧека();  

КонецПроцедуры

&НаКлиенте
Процедура ОтправкаНаПочтуПриИзменении(Элемент)
	
	ОтправкаНаСМС = Не ОтправкаНаПочту;
	
	ВариантЧека = ?(ОтправкаНаПочту,"Почта","Смс"); 

	ОбновитьУсловноеОформлениеВариантаОтправкиЧека();  
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы  

  &НаКлиенте
Процедура Док_НапечататьЧекВместо(Команда)
	
    ВариантЧека = "Бумажный"; 
	ОбновитьУсловноеОформлениеВариантаОтправкиЧека();
	
КонецПроцедуры                     

&НаКлиенте
Процедура Док_ЭлектронныйЧекНеТребуетсяПосле(Команда)

  ВариантЧека = "Фиктивный"; 
  ОбновитьУсловноеОформлениеВариантаОтправкиЧека();
  
КонецПроцедуры   

 &НаКлиенте
Процедура ПодтвердитьОплату(Команда)  

	//Если ПустаяСтрока(НомерПлатежнойКарты) Тогда
	//	Сообщить("Введите номер платежной карты!");
	//Иначе
	//	ОплатаВыполнена = Истина;
	//	Элементы.ГруппаОплата.Доступность = Не ОплатаВыполнена;
	//КонецЕсли;
	Если ПустаяСтрока(НомерПлатежнойКарты) и НЕ БылаОплатаПоСБП Тогда
		ОчиститьСообщения();
		Сообщить("Введите номер платежной карты!");
	ИначеЕсли БылиОшибки И НЕ ОплатаВыполнена Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодтвердитьОплатуЗавершение", ЭтаФорма);
		ОчиститьСообщения();
		ОткрытьФорму("Обработка.БезналичнаяОплатаБезПодключенияОборудования.Форма.ФормаСканированияШКСотрудника",,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе
		ОплатаВыполнена = Истина;
		Элементы.ГруппаОплата.Доступность = Не ОплатаВыполнена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОплатуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	КтоПодтвердилОплату = Результат;
	Если ПустаяСтрока(НомерПлатежнойКарты) Тогда
		ОчиститьСообщения();
		Сообщить("Введите номер платежной карты!");
	Иначе
		Если НЕ КтоПодтвердилОплату = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
			ОплатаВыполнена = Истина;
		Иначе
			ОчиститьСообщения();
			Сообщить("Оплата не подтверждена");
		КонецЕсли;
		Элементы.ГруппаОплата.Доступность = Не ОплатаВыполнена;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Команда)
	
	Закрыть(Новый Структура("ЭквайринговыйТерминал,НомерПлатежнойКарты,ОплатаВыполнена",ЭквайринговыйТерминал,НомерПлатежнойКарты,ОплатаВыполнена)); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧек(Команда)
	
	Если Не ОплатаВыполнена Тогда
		Сообщить("Подтвердите успешную оплату!");
		Возврат;
	КонецЕсли;
	
	Если ВариантЧека = "Почта" Тогда
		
		Если Email <> "" Тогда 
			СтрокаВопроса = "Чек будет отправлен на почту: " + Email + ". Все верно?";
		Иначе
			Сообщить("Введите EMAIL!"); 
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ВариантЧека = "Смс" Тогда	
		
		Если (СтрДлина(Телефон) = 12) Тогда 
			СтрокаВопроса = "Чек будет отправлен на телефон: " + Прав(Телефон, 4) + ". Все верно?";
		Иначе
			Сообщить("Введите Телефон!");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ВариантЧека = "Бумажный" Тогда 	 
		
		СтрокаВопроса = "Чек будет напечатан. Все верно?";	
		
	ИначеЕсли ВариантЧека = "Фиктивный" Тогда 
		
		СтрокаВопроса = "Покупатель отказался от чека. Все верно?"; 
		
	Иначе
		
		Сообщить("Выберите вариант отправки чека!");
		Возврат;  
		
	КонецЕсли; 	
		
	Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект);    
	ПоказатьВопрос(Оповещение,СтрокаВопроса,РежимДиалогаВопрос.ОКОтмена,0);  
		
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьПлатежнойКартой(Команда)

	Если ОшибкаПроверкиКассы() Тогда
		Возврат;
	КонецЕсли;

	ВыполнитьОперациюПоПлатежнойКарте("AuthorizeSales");
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьПлатежПоКарте(Команда)
	
	ВыполнитьОперациюПоПлатежнойКарте("AuthorizeRefund");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПлатежПоКарте(Команда)
	
	ВыполнитьОперациюПоПлатежнойКарте("AuthorizeVoid");
	
КонецПроцедуры

 &НаКлиенте
Процедура ВыполнитьСверкуИтогов(Команда)
	
	ОчиститьСообщения();
	Доступность = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор)
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтчетБанкаПоОперациямЭквайринга(Команда)
	
	Отчет = СоздатьОтчетБанкаПоОперациямЭквайрингаНаСервере();
	ОткрытьЗначение(Отчет);      
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиХранилища() 
	
	Структура = ДопМодуль.ПолучитьНастройкиХранилища("НастройкиЭкваринговыхТерминаловДляТЗ");
	РабочееМесто = Справочники.РабочиеМеста.НайтиПоКоду(ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ИдентификаторКлиента"));
	НайденнаяСтрока = Структура["Настройки"].Найти(РабочееМесто,"РабочееМесто");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,НайденнаяСтрока); 
	Иначе
		
		НайденнаяСтрока = Структура["Настройки"].Найти(РабочееМесто.ИмяКомпьютера,"ИмяКомпьютера");
		
		Если НайденнаяСтрока <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,НайденнаяСтрока);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
   
&НаСервере 
Функция ПолучитьПочту() 
	
	Возврат Константы.ПочтаОтправкиЧеков.Получить(); 
	
КонецФУнкции 

&НаКлиенте
Процедура ОбновитьУсловноеОформлениеВариантаОтправкиЧека() 
	Если ВариантЧека = "Почта" Тогда
		
		АдресУведомленияКлиента = Email;
		ПечататьЧек = Ложь;
		
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Истина;  
		ОтправкаНаСмс = Ложь; 
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Оранжевый;
		
	ИначеЕсли ВариантЧека = "Смс" Тогда   
		
		АдресУведомленияКлиента = Телефон;
		ПечататьЧек = Ложь;   
		
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Истина;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Телефон.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	ИначеЕсли ВариантЧека = "Бумажный" Тогда 
		
		АдресУведомленияКлиента = "";
	    ПечататьЧек = Истина;
		
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Ложь;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	ИначеЕсли ВариантЧека = "Фиктивный" Тогда 
		
		АдресУведомленияКлиента = ПолучитьПочту();
		ПечататьЧек = Ложь;

		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Оранжевый; 
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Ложь;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВариантОтправкиЧека()
	
	ВариантОтправки = Партнер.ВариантОтправкиЭлектронногоЧека;
	ВариантЧека =?(ВариантОтправки = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail,"Почта", ?(ВариантОтправки = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS,"Смс","Бумажный"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧекЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ЗаписатьКомментарий();
		
		ПробитьДокументОплаты();
		
		Попытка
			АльтерраОбщегоНазначенияКлиент.ИзвлечьIDТранзакции(ДокументОплаты,ТекущаяДата(),СуммаДокумента);
			ОплатаВыполнена = Истина;
		Исключение 			
			ЗарегистрироватьОшибкуВЖурнале(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ПробитьДокументОплаты()
		
	Обработки.БезналичнаяОплатаБезПодключенияОборудования.ДобавитьОплатуИПробитьДокумент(ДокументОплаты,Касса,КассаККМ,ЭквайринговыйТерминал,СуммаДокумента,НомерПлатежнойКарты,КодАвторизации,НомерЧекаЭТ,АдресУведомленияКлиента,ПечататьЧек,ДокументОснование);
	
	Если ДокументПробит() Тогда
		
		КодАвторизации = "";
		НомерПлатежнойКарты = "";
		НомерЧекаЭТ = "";
		
		Элементы.ГруппаЧек.Доступность = Ложь;
		СостояниеДокумента = Строка(ДокументОплаты) + " - Пробит, оплата принята.";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтактнуюИнформациюПартнера()

	МассивСсылок = Новый Массив();  
	МассивСсылок.Добавить(Партнер);
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивСсылок,,, ТекущаяДатаСеанса());
	
	Для Каждого ЭлементКонтактнойИнформации Из КонтактнаяИнформацияОбъекта Цикл
		
		Если ЭлементКонтактнойИнформации.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера Тогда
			Телефон10Знаков = РозничныеПродажиКлиентСервер.НомерТелефонаВФормате10Знаков(ЭлементКонтактнойИнформации.Представление);
			Телефон = "+7" + Телефон10Знаков;
		КонецЕсли;
		
		Если ЭлементКонтактнойИнформации.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера Тогда
			Email = ЭлементКонтактнойИнформации.Представление;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоДокументуОплаты(ДокументОснование) 
	
	УстановитьВидимостьВозвратаДинамическиеСсылки(Ложь, Ложь);
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМ") ИЛИ
		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		ДокументОплаты = ДокументОснование; 
	Иначе       
		ВозможностьВозврата = ПроверитьВозможностьВозвратаДинамическиеСсылки();
		
		Если ВозможностьВозврата.ТребуетсяВозврат Тогда 
			СуществующаяЭОВозврата = ДопМодульСервер.ПолучитьСуществующуюЭОВозврата(ДокументОснование);    
			
			Если ЗначениеЗаполнено(СуществующаяЭОВозврата.ЭквайринговаяОперация) Тогда
				ДокументОплаты = СуществующаяЭОВозврата.ЭквайринговаяОперация;
				СуммаВозвратаДС = СуществующаяЭОВозврата.СуммаДокумента;
				Элементы.НоваяЭОВозврат.Видимость = Ложь;
			Иначе                                           
				СуммаВозвратаДС = ВозможностьВозврата.СуммаДокументаВозврата;
				Элементы.НоваяЭОВозврат.Видимость = Истина;
			КонецЕсли; 
			
			Возврат;
		КонецЕсли;		
		
		ДокументОплаты = ПолучитьЭквайринговуюОперацию(ДокументОснование);
		
		Если ДокументОплаты = Неопределено Тогда
			Сообщить("Эквайринговых операций больше 1, удалите не корректные документы и откройте форму заново!"); 
			ДокументОплаты = Неопределено;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;   
	
	Если ДокументПробит() Тогда 
		Сообщить("Документ уже пробит!"); 
		ДокументОплаты = Неопределено;
		Возврат;
	КонецЕсли;
	
	Партнер = ДокументОплаты.Партнер;
	СуммаДокумента = ДокументОплаты.СуммаДокумента;
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
		ОплатаВыполнена = ДокументОплаты.ОплатаВыполнена;
	Иначе 
		Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМ") Тогда 
			ОплатаВыполнена = ДокументОплаты.ОплатаПлатежнымиКартами.Количество()>0;	
		КонецЕсли;
	КонецЕсли;
	//Вставка сбп 
	ДанныеОперацииОплаты = ИнтеграцияСБПГазпромбанк.ПолучитьДанныеТранзакции(ДокументОплаты);
	Если ТипЗнч(ДанныеОперацииОплаты) = Тип("Структура") и ДанныеОперацииОплаты.СБП Тогда
		БылаОплатаПоСБП = Истина; 
		Элементы.ПробитьЧек.Доступность = Не БылаОплатаПоСБП;
		Элементы.ПробитьЧекСБП.Доступность = БылаОплатаПоСБП;
	КонецЕсли;
	//конецвставки сбп
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		Этовозврат = Истина;	
		Если ДокументОснование.ЧекККМ.КассоваяСмена<>ДокументОснование.КассоваяСмена Тогда
			Сообщить("Кассовая смена чека ккм на возврат не соотвествует терминалу чека ккм!"); 
			ОтменаПробития = Истина;
			Возврат;
		КонецЕсли;

		Если (ДокументОснование.КассоваяСмена.НачалоКассовойСмены-ТекущаяДата()>=86400 И ДокументОснование.КассоваяСмена.ОкончаниеКассовойСмены = Дата(1,1,1)) ИЛИ
			ДокументОснование.КассоваяСмена.Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
			
			Сообщить("Кассовая смена истекла, нужно создать возврат товаров от клиента!"); 
			ОтменаПробития = Истина;
			Возврат;
		КонецЕсли;
		
		Если ДокументОснование.ЧекККМ.ОплатаПлатежнымиКартами.Количество()=1 Тогда
			НомерЧекаЭТОтмена = ДокументОснование.ЧекККМ.ОплатаПлатежнымиКартами[0].НомерЧекаЭТ;
			ЭТДокументаПродажи = ДокументОснование.ЧекККМ.ОплатаПлатежнымиКартами[0].ЭквайринговыйТерминал;
		КонецЕсли;
		//Вставка СБП 
		ДанныеОперацииОснования = ИнтеграцияСБПГазпромбанк.ПолучитьДанныеТранзакции(ДокументОснование.ЧекККМ);
		Если ТипЗнч(ДанныеОперацииОснования) = Тип("Структура") и ДанныеОперацииОснования.СБП Тогда
			Элементы.ГруппаКомандПодключаемый.Доступность = Ложь;
		Иначе
		//КонецВставки СБП	
		Если ЭквайринговыйТерминал<>ЭТДокументаПродажи Тогда
			Сообщить("Эквайринговый терминал чека ккм на возврат не соотвествует терминалу чека ккм!"); 
			ОтменаПробития = Истина;
			Возврат;
		КонецЕсли; 
		//Вставка СБП
		КонецЕсли;
		//КонецВставки СБП
		
		IDТранзакции = АльтерраОбщегоНазначения.ПолучитьIDТранзакцииИзРегистра(ДокументОснование.ЧекККМ);  
		
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Если ЗначениеЗаполнено(ДокументОснование.ЧекККМ) Тогда
			IDТранзакции = АльтерраОбщегоНазначения.ПолучитьIDТранзакцииИзРегистра(ДокументОснование.ЧекККМ);
			//Вставка СБП
			БылаОплатаПоСБП = ИнтеграцияСБПГазпромбанк.БылаОперацияСБП(IDТранзакции);
			Элементы.ГруппаКомандПодключаемый.Доступность = НЕ БылаОплатаПоСБП;
			//КонецВставки СБП
		Иначе 
			Сообщить("ID транзакции нужно смотреть в связанной Эквайринговой операции документа продажи");
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#Область ДинамическиеСсылки

&НаСервере
Функция ПроверитьВозможностьВозвратаДинамическиеСсылки()
	
	УстановитьВидимостьВозвратаДинамическиеСсылки(Ложь, Ложь);  
	
	ВозможностьВозврата = Новый Структура("ТребуетсяВозврат", Ложь);
	
	//Если ЗначениеЗаполнено(ДокументОснование) И  ЗначениеЗаполнено(ДокументОплаты) Тогда
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
	
		// Проверка на возврат товаров от клиента
		ВозможностьВозврата = ИнтеграцияБанки.ПолучитьОплатуДинамическойСсылки(ДокументОснование, ДокументОплаты, ДатаВозвратаВОчереди);	
		
		Если ВозможностьВозврата.ТребуетсяВозврат Тогда
			
			// Оплата по Альфабанку, возврат не выполнен
			Если ВозможностьВозврата.ВозвратОбработан = Null Тогда
				УстановитьВидимостьВозвратаДинамическиеСсылки(Истина, Истина);		
				
			// Оплата по Альфабанку, возврат в очереди к пробитию, но не пробит 		
			ИначеЕсли Не ВозможностьВозврата.ВозвратОбработан тогда
				УстановитьВидимостьВозвратаДинамическиеСсылки(Истина, Ложь);
			
			// Оплата по Альфабанку, возврат пробит
			Иначе 
				УстановитьВидимостьВозвратаДинамическиеСсылки(Ложь, Ложь);
			КонецЕсли;
		
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат ВозможностьВозврата;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьВозвратаДинамическиеСсылки(Видимость, Доступность)
	
	Элементы.ГруппаВозвратДС.Видимость 		= Видимость;
	Элементы.ВозвратДС.Доступность			= Доступность;
	Элементы.СуммаВозвратаДС.Доступность	= Доступность;   
	Элементы.ДекорацияОжидание.Видимость 	= Не Доступность;
	
	Элементы.ГруппаОплата.Видимость 		= Не Видимость;
	Элементы.ГруппаЧек.Видимость 			= Не Видимость;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВозвратДС(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьВозвратДС", ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение, СтрШаблон("Выполнить возврат Альфа-Банка на сумму %1 руб.?", Формат(СуммаВозвратаДС, "ЧДЦ=2")),
    	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Возврат");
    	    
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВозвратДС(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда      
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ВозвратПоДинамическойСсылке = ИнтеграцияБанки.ПолучитьОплатуДинамическойСсылки(ДокументОснование, ДокументОплаты, ДатаВозвратаВОчереди);
			
			Если ВозвратПоДинамическойСсылке.ТребуетсяВозврат Тогда	
				Элементы.ВозвратДС.Доступность = Ложь;	
				Элементы.СуммаВозвратаДС.Доступность = Ложь;	
				Элементы.ДекорацияОжидание.Видимость = Истина;
				
				ВыполнениеВозврата = ИнтеграцияБанки.ВыполнитьВозвратДинамическойСсылки(ВозвратПоДинамическойСсылке.ДокументОснование,
					ДокументОснование, СуммаВозвратаДС, ДокументОплаты, ВозвратПоДинамическойСсылке.ЭквайринговыйТерминал);  
				ДатаВозвратаВОчереди = ВыполнениеВозврата.ДатаОперации;
				
				ПоказатьОповещениеПользователя(ВыполнениеВозврата.Сообщение);
				
				Если ВыполнениеВозврата.Результат Тогда
					ПодключитьОбработчикОжидания("ПроверкаПробитияВозвратаДинамическиеСсылки", 5, Ложь);
				Иначе
					Элементы.ВозвратДС.Доступность = Истина;
					Элементы.СуммаВозвратаДС.Доступность = Истина;
					Элементы.ДекорацияОжидание.Видимость = Ложь;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли; 
		
    КонецЕсли;	
  
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПробитияВозвратаДинамическиеСсылки()

	ВозвратПоДинамическойСсылке = ИнтеграцияБанки.ПолучитьОплатуДинамическойСсылки(ДокументОснование, ДокументОплаты, ДатаВозвратаВОчереди);
		
	Если ВозвратПоДинамическойСсылке.ВозвратОбработан <> Null И ВозвратПоДинамическойСсылке.ВозвратОбработан Тогда
		ОтключитьОбработчикОжидания("ПроверкаПробитияВозвратаДинамическиеСсылки"); 
		
		ДокументОснование = Неопределено;
		ДокументОплаты = Неопределено;
		
		ПроверитьВозможностьВозвратаДинамическиеСсылки();
		
		ПоказатьОповещениеПользователя("Кассовый чек на возврат пробит");
		//Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере 
Функция ДокументПробит()

	Возврат Обработки.БезналичнаяОплатаБезПодключенияОборудования.ПоДокументуОплатыПробитЧек(ДокументОплаты); 
	
КонецФУнкции

&НаКлиенте
Процедура ДокументПродажиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	
	Если ОшибкаПроверкиКассы() Тогда
		Возврат;
	КонецЕсли;    
	
 	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораДокумента",ЭтотОбъект);
	ОткрытьФорму("Обработка.БезналичнаяОплатаБезПодключенияОборудования.Форма.ФормаВыбораДокументаОплаты",Новый Структура("ЭквайринговыйТерминал",ЭквайринговыйТерминал),ЭтотОбъект,,,,Оповещение,);
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершениеВыбораДокумента(Результат,ДопПараметры) Экспорт	
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		ДокументОснование = Результат;  
		
		ЗаполнитьДанныеПоДокументуОплаты(ДокументОснование);
		
		ОбновитьВариантОтправкиЧека();  
		
		ОбновитьКонтактнуюИнформациюПартнера();  
		
		УстановитьУсловноеОформлениеЭлементовФормы();
		
	КонецЕсли;      
	
КонецПроцедуры  

&НаКлиенте
Процедура СостояниеДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(ДокументОплаты);
КонецПроцедуры

&НаСервере
Функция СоздатьОтчетБанкаПоОперациямЭквайрингаНаСервере()

	УстановитьПривилегированныйРежим(Истина); 
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ДокументОбъект = Документы.ОтчетБанкаПоОперациямЭквайринга.СоздатьДокумент(); 
	ДокументОбъект.Дата = КонецДня(ДатаОкончанияСмены);
	ДокументОбъект.ДоговорЭквайринга  = ЭквайринговыйТерминал.Владелец;
    ДокументОбъект.ДетальнаяСверкаТранзакций = Истина;	
	ДокументОбъект.ОтражатьКомиссию = Истина;	
    ДокументОбъект.Автор=ТекущийПользователь;
    ДокументОбъект.Ответственный=ТекущийПользователь;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ДоговорЭквайринга) Тогда
		СтруктураРеквизитов = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(ДокументОбъект.ДоговорЭквайринга.БанковскийСчет);
		ДокументОбъект.Организация = СтруктураРеквизитов.Организация;
		ДокументОбъект.Валюта = СтруктураРеквизитов.Валюта;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 		
		"ВЫБРАТЬ
		|	РасчетыПоЭквайрингу.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	РасчетыПоЭквайрингу.Валюта КАК Валюта,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыПоЭквайрингу.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РасчетыПоЭквайрингу.Сумма
		|			ИНАЧЕ -РасчетыПоЭквайрингу.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	РасчетыПоЭквайрингу.ДатаПлатежа КАК ДатаПлатежа,
		|	РасчетыПоЭквайрингу.КодАвторизации КАК КодАвторизации,
		|	РасчетыПоЭквайрингу.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
		|ИЗ
		|	РегистрНакопления.РасчетыПоЭквайрингу КАК РасчетыПоЭквайрингу
		|ГДЕ
		|	РасчетыПоЭквайрингу.ЭквайринговыйТерминал = &ЭквайринговыйТерминал
		|	И РасчетыПоЭквайрингу.ДатаПлатежа = &ДатаПлатежа
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЭквайрингу.ТипДенежныхСредств,
		|	РасчетыПоЭквайрингу.Валюта,
		|	РасчетыПоЭквайрингу.ДатаПлатежа,
		|	РасчетыПоЭквайрингу.КодАвторизации,
		|	РасчетыПоЭквайрингу.ЭквайринговыйТерминал
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыПоЭквайрингу.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РасчетыПоЭквайрингу.Сумма
		|			ИНАЧЕ -РасчетыПоЭквайрингу.Сумма
		|		КОНЕЦ) <> 0
		|ИТОГИ ПО
		|	ТипДенежныхСредств";
		
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаОкончанияСмены);
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТипДенежныхСредств = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТипДенежныхСредств.Следующий() Цикл
		
		Если ВыборкаТипДенежныхСредств.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредствПоЭквайрингу.ПоступлениеПоПлатежнойКарте Тогда
			
			ВыборкаДетальныеЗаписи = ВыборкаТипДенежныхСредств.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрока = ДокументОбъект.Покупки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			КонецЦикла;
			
		ИначеЕсли ВыборкаТипДенежныхСредств.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредствПоЭквайрингу.СписаниеПоПлатежнойКарте Тогда
			
			ВыборкаДетальныеЗаписи = ВыборкаТипДенежныхСредств.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				 НоваяСтрока = ДокументОбъект.Возвраты.Добавить();
				 ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
				 НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма*(-1); 
			КонецЦикла;
						
		КонецЕсли; 
		
	КонецЦикла;
	
   ДокументОбъект.СуммаПокупок = ДокументОбъект.Покупки.Итог("Сумма");	
   ДокументОбъект.СуммаВозвратов = ДокументОбъект.Возвраты.Итог("Сумма");
	
   ДокументОбъект.СуммаДокумента = ДокументОбъект.СуммаПокупок - ДокументОбъект.СуммаВозвратов;
   
   ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
   
   Возврат ДокументОбъект.Ссылка;
  
КонецФункции

&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()  

	ДанныеБезналичныхОплат.Параметры.УстановитьЗначениеПараметра("ЭквайринговыйТерминал",ЭквайринговыйТерминал);

КонецПроцедуры	

&НаСервере
Функция ПолучитьЭквайринговуюОперацию(ДокументПродажи)
	
	Если КтоПодтвердилОплату = Справочники.Пользователи.ПустаяСсылка() Тогда
		КтоПодтвердилОплату = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка КАК Ссылка
//		|ИЗ
//		|	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
//		|				ТОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа = &ДокументПродажи
//		|			ИНАЧЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа = &ДокументПродажи
//		|		КОНЕЦ
//		|	И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ПометкаУдаления
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка";
	
		Запрос.Текст =
	  	"ВЫБРАТЬ
	  	|	ОбъектыРасчетов.Ссылка КАК Ссылка
	  	|ПОМЕСТИТЬ ВТ_ОбъектыРасчетов
	  	|ИЗ
	  	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	  	|ГДЕ
	  	|	ОбъектыРасчетов.Объект = &ДокументПродажи
	  	|;
	  	|
	  	|////////////////////////////////////////////////////////////////////////////////
	  	|ВЫБРАТЬ
	  	|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка КАК Ссылка
	  	|ИЗ
	  	|	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа,
	  	|	ВТ_ОбъектыРасчетов КАК ВТ_ОбъектыРасчетов
	  	|ГДЕ
	  	|	ВЫБОР
	  	|		КОГДА
	  	|			ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	  	|			ТОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОбъектРасчетов = ВТ_ОбъектыРасчетов.Ссылка
	  	|		ИНАЧЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа = &ДокументПродажи
	  	|	КОНЕЦ
	  	|	И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ПометкаУдаления
	  	|СГРУППИРОВАТЬ ПО
	  	|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка";
			
	
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		Док = Документы.ОперацияПоПлатежнойКарте.СоздатьДокумент();
		Док.Заполнить(ДокументПродажи);
		Док.Дата = ТекущаяДата();
		Док.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
		Док.ДоговорЭквайринга = ЭквайринговыйТерминал.Владелец; 
		Док.Комментарий = "Создана автоматически по документу продажи.";
		Док.Записать(РежимЗаписиДокумента.Запись);
		
		ДокументОплаты = Док.Ссылка;
		
	ИначеЕсли Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		ДокументОплаты = Выборка.Ссылка;  
		
	Иначе                                   
		
		ДокументОплаты = Неопределено;    
		
	КонецЕсли;
		
	Возврат ДокументОплаты;
	
КонецФункции  

&НаКлиенте
Процедура ДанныеБезналичныхОплатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	IDТранзакцииВвод = ""; 
	
	ВыбранныйДокументОплаты = Элементы.ДанныеБезналичныхОплат.ТекущиеДанные.ДокументОплаты;
	ВвестиЗначение(IDТранзакцииВвод,"Введите значение ID транзакции"); 
    ЗаписьIDТранзакцииВРегистр(ВыбранныйДокументОплаты,IDТранзакцииВвод);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьIDТранзакцииВРегистр(ВыбранныйДокументОплаты,IDТранзакцииВвод)	

	АльтерраОбщегоНазначения.ЗаписьIDТранзакцииВРегистр(ВыбранныйДокументОплаты, IDТранзакцииВвод); 
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьУсловноеОформлениеЭлементовФормы()
	
	Элементы.ГруппаОплата.Доступность = Не ОплатаВыполнена;
	Элементы.ГруппаСтраницы.Доступность = Не ОтменаПробития;
	
	Если Не ОборудованиеПодключено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		
		Элементы.ПринятьОплату.Видимость = Ложь;
		Элементы.ОтменитьОплату.Видимость = Истина;
		Элементы.ВернутьОплату.Видимость = Истина;
		//вставка сбп
		Элементы.ОплатитьВернутьСБП.Заголовок = "Вернуть СБП";
		//конец вставки сбп
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		
		IDТранзакции = АльтерраОбщегоНазначения.ПолучитьIDТранзакцииИзРегистра(ДокументОснование.ЧекККМ);
		Элементы.ПринятьОплату.Видимость = Ложь;
		Элементы.ОтменитьОплату.Видимость = Ложь;
		Элементы.ВернутьОплату.Видимость = Истина; 
		//вставка сбп
		Элементы.ОплатитьВернутьСБП.Заголовок = "Вернуть СБП";
		//конец вставки сбп

	Иначе
		
		Элементы.ПринятьОплату.Видимость = Истина;
		Элементы.ОтменитьОплату.Видимость = Истина;
		Элементы.ВернутьОплату.Видимость = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюЗавершение(РезультатВыполнения, Параметры) Экспорт

	Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗакрытьДень Тогда
		    ТекстСообщения = НСтр("ru = 'Сверка итогов выполнена успешно.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		КодАвторизации = РезультатВыполнения.КодАвторизации;
		НомерПлатежнойКарты = РезультатВыполнения.НомерКарты;
		НомерЧекаЭТ = РезультатВыполнения.НомерЧекаЭТ;
		НомерЧекаЭТОтмена = НомерЧекаЭТ;
		ОплатаВыполнена = Истина; 
		Элементы.ОплатитьВернутьСБП.Доступность = Не ОплатаВыполнена;

		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		БылиОшибки = Ложь;
			
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		БылиОшибки = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюПоПлатежнойКарте(ТипТранзакции)
	
	ОчиститьСообщения();
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ТипТранзакции"               , ТипТранзакции);
	ПараметрыОперации.Вставить("Сумма"               		 , СуммаДокумента);
	ПараметрыОперации.Вставить("УказатьДополнительныеДанные" , Ложь);
	ПараметрыОперации.Вставить("ЗапретРедактированияСуммы"   , Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюПоПлатежнойКартеЗавершение", ЭтотОбъект, ПараметрыОперации);
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ", ПараметрыОперации,,,  ,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюПоПлатежнойКартеЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если НЕ Параметры.Свойство("ТипТранзакции") Тогда
			ТекстСообщения = НСтр("ru = 'Не указан тип транзакции.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		ПараметрыОперации.ТипТранзакции  = Параметры.ТипТранзакции;
		ПараметрыОперации.СуммаОперации  = Результат.Сумма;
		ПараметрыОперации.НомерЧека      = ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, "");
		ПараметрыОперации.НомерЧекаЭТ    = ?(Результат.Свойство("НомерЧекаЭТ"), Результат.НомерЧекаЭТ, "");

		ПараметрыОперации.СсылочныйНомер = Результат.СсылочныйНомер;
		
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект);
		ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьОшибкуВЖурнале(ОписаниеОшибки)
	ЗаписьЖурналаРегистрации("Регистрация ID-транзакции", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
КонецПроцедуры

&НаСервере
Функция ОшибкаПроверкиКассы()

	ДействияСКассовойСменойАТОЛ = Обработки.БезналичнаяОплатаБезПодключенияОборудования.ПроверитьАктуальностьСменыАТОЛ(Касса);
	
	Если ДействияСКассовойСменойАТОЛ.ТекстОшибки <> "" Тогда
		Сообщить(ДействияСКассовойСменойАТОЛ.ТекстОшибки);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;   
	
КонецФункции

&НаКлиенте
Процедура ТЕСТПодтвердитьОплату(Команда)
	Если ПустаяСтрока(НомерПлатежнойКарты) Тогда
		ОчиститьСообщения();
		Сообщить("Введите номер платежной карты!");
	ИначеЕсли БылиОшибки И НЕ ОплатаВыполнена Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодтвердитьОплатуЗавершение", ЭтаФорма);
		ОчиститьСообщения();
		ОткрытьФорму("Обработка.БезналичнаяОплатаБезПодключенияОборудования.Форма.ФормаСканированияШКСотрудника",,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе
		ОплатаВыполнена = Истина;
		Элементы.ГруппаОплата.Доступность = Не ОплатаВыполнена;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарий()
	УстановитьПривилегированныйРежим(Истина);
	ДокументОбъект = ДокументОплаты.ПолучитьОбъект();
	ДокументОбъект.Комментарий = ДокументОплаты.Комментарий+". Оплату подтвердил сотрудник: "+Строка(КтоПодтвердилОплату); 
	ДокументОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры 

#КонецОбласти 

#Область СБП

&НаКлиенте
Процедура ОплатитьВернутьСБП(Команда)
	
	Если ЗначениеЗаполнено(IDТранзакции) Тогда        
	    ОткрытьФормуСБПГазпромбанк(IDТранзакции);
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		Сообщить("Не заполнен IDТранзакции - возврат по СБП Газпромбанк сделать нельзя");
		Возврат;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
	    ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводИДТранзакцииЗавершение", ЭтотОбъект), "", "ID транзакции оплаты");
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда 
		ОткрытьФормуСБПГазпромбанк(ИдентификаторКС);
	КонецЕсли;	
	
	
	//Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
	//	Если ЗначениеЗаполнено(IDТранзакции) Тогда
	//		БылаОплатаПоСБП = ИнтеграцияСБПГазпромбанк.БылаОперацияСБП(IDТранзакции);
	//		Если БылаОплатаПоСБП Тогда
	//			ОткрытьФормуСБПГазпромбанк(IDТранзакции); 
	//		Иначе
	//			Сообщить("С таким IDТранзакции не было операций по СБП Газпромбанк - возврат по СБП Газпромбанк сделать нельзя");
	//		 	Возврат; 
	//		КонецЕсли;
	//	Иначе
	//		 Сообщить("Не заполнен IDТранзакции - возврат по СБП Газпромбанк сделать нельзя");
	//		 Возврат;
	//	КонецЕсли;
	//ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ТОгда
	//	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводИДТранзакцииЗавершение", ЭтотОбъект), "", "ID транзакции оплаты");
	//ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
	//	ОткрытьФормуСБПГазпромбанк(ИдентификаторКС);
	//КонецЕсли;
	
	//Если СуммаДокумента <> 0 Тогда
	//	ПараметрыОткрытияФормы = Новый Структура;
	//	ПараметрыОткрытияФормы.Вставить("КОплате", СуммаДокумента);
	//	ПараметрыОткрытияФормы.Вставить("Идентификатор", ИдентификаторКС);
	//	ПараметрыОткрытияФормы.Вставить("Документ", ДокументОплаты);
	//	
	//	ОткрытьФорму("ОбщаяФорма.СБПГазпромбанк", ПараметрыОткрытияФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("Док_ЗавершениеОплатыСБП", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	//Иначе
	//	Сообщить("Сумма оплаты равна 0");
	//КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВводИДТранзакцииЗавершение(Результат, ДополнительныеПараметры)  Экспорт 
	Если Результат <> "" и ИнтеграцияСБПГазпромбанк.БылаОперацияСБП(Результат) Тогда
		ОткрытьФормуСБПГазпромбанк(Результат);
	Иначе	
		ОбщегоНазначенияКлиент.СообщитьПользователю("По такому ID транзакции не было оплаты по СБП");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСБПГазпромбанк(Идентификатор)
	
	Если СуммаДокумента <> 0 Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("КОплате", СуммаДокумента);
		ПараметрыОткрытияФормы.Вставить("Идентификатор", Идентификатор);
		ПараметрыОткрытияФормы.Вставить("Документ", ДокументОплаты);
		
		ОткрытьФорму("ОбщаяФорма.СБПГазпромбанк", ПараметрыОткрытияФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("Док_ЗавершениеОплатыСБП", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		Сообщить("Сумма оплаты равна 0");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗавершениеОплатыСБП(Результат, ДополнительныеПараметры)   Экспорт
	Если Результат = Неопределено
		ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ОплатаВыполнена = Истина; 
	БылаОплатаПоСБП = Истина;
	Элементы.ПринятьОплату.Доступность = Не БылаОплатаПоСБП;
	Элементы.ГруппаКомандПодключаемый.Доступность = Не БылаОплатаПоСБП;
	Элементы.ПробитьЧек.Доступность = Не БылаОплатаПоСБП;
	Элементы.ПробитьЧекСБП.Доступность = БылаОплатаПоСБП;
	Док_ОбработкаОплатыСБП(Результат);
	Сообщить("Оплата выполнена, можно подтвержать оплату и пробивать чек");
КонецПроцедуры 

&НаСервере
Процедура Док_ОбработкаОплатыСБП(Результат) 
	УстановитьПривилегированныйРежим(Истина);
	
	ДокОбъект = ДокументОплаты.ПолучитьОбъект();
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМ") Тогда
		ИнтеграцияСБПГазпромбанк.ОбработатьОплатуВЧекККМ(Результат, ДокОбъект);	
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		ИнтеграцияСБПГазпромбанк.ОбработатьОплатуВЧекККМНаВозврат(Результат, ДокОбъект);
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
		ИнтеграцияСБПГазпромбанк.ОбработатьОплатуВЭквайринге(Результат, ДокОбъект);	
	КонецЕсли;
	
	ДокОбъект.Записать(); 
	УстановитьПривилегированныйРежим(Ложь);
	//	
КонецПроцедуры 

&НаКлиенте
Процедура ПробитьЧекСБП(Команда)
	
	Если Не ОплатаВыполнена Тогда
		Сообщить("Подтвердите успешную оплату!");
		Возврат;
	КонецЕсли;
	
	Если ВариантЧека = "Почта" Тогда
		
		Если Email <> "" Тогда 
			СтрокаВопроса = "Чек будет отправлен на почту: " + Email + ". Все верно?";
		Иначе
			Сообщить("Введите EMAIL!"); 
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ВариантЧека = "Смс" Тогда	
		
		Если (СтрДлина(Телефон) = 12) Тогда 
			СтрокаВопроса = "Чек будет отправлен на телефон: " + Прав(Телефон, 4) + ". Все верно?";
		Иначе
			Сообщить("Введите Телефон!");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ВариантЧека = "Бумажный" Тогда 	 
		
		СтрокаВопроса = "Чек будет напечатан. Все верно?";	
		
	ИначеЕсли ВариантЧека = "Фиктивный" Тогда 
		
		СтрокаВопроса = "Покупатель отказался от чека. Все верно?"; 
		
	Иначе
		
		Сообщить("Выберите вариант отправки чека!");
		Возврат;  
		
	КонецЕсли; 	
		
	Оповещение = Новый ОписаниеОповещения("ПробитьЧекСБПЗавершение", ЭтотОбъект);    
	ПоказатьВопрос(Оповещение,СтрокаВопроса,РежимДиалогаВопрос.ОКОтмена,0);  
		
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧекСБПЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ЗаписатьКомментарий();
		//Сообщить("Была оплата по СБП "+БылаОплатаПоСБП);
		ПробитьДокументОплатыСБП();
		
		//Попытка
		//	АльтерраОбщегоНазначенияКлиент.ИзвлечьIDТранзакции(ДокументОплаты,ТекущаяДата(),СуммаДокумента);
		//	ОплатаВыполнена = Истина;
		//Исключение 			
		//	ЗарегистрироватьОшибкуВЖурнале(ОписаниеОшибки());
		//КонецПопытки;
		
	КонецЕсли;   
	
КонецПроцедуры 

Процедура ПробитьДокументОплатыСБП()
		
	Обработки.БезналичнаяОплатаБезПодключенияОборудования.ДобавитьОплатуИПробитьДокументСБП(ДокументОплаты,Касса,КассаККМ,ЭквайринговыйТерминал,СуммаДокумента,НомерПлатежнойКарты,КодАвторизации,НомерЧекаЭТ,АдресУведомленияКлиента,ПечататьЧек,ДокументОснование);
	
	Если ДокументПробит() Тогда
		
		КодАвторизации = "";
		НомерПлатежнойКарты = "";
		НомерЧекаЭТ = "";
		БылаОплатаПоСБП = Ложь;
		
		Элементы.ГруппаЧек.Доступность = Ложь;
		СостояниеДокумента = Строка(ДокументОплаты) + " - Пробит, оплата принята.";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПроблемыДеактивацииКСФормаСБП" Тогда
		Сообщить(Параметр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
