&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СтруктураБыстрогоОтбора = Неопределено;
//	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	Водитель =   ДопМодуль.ВодительТС(Пользователи.ТекущийПользователь());
	
	//Если СтруктураБыстрогоОтбора <> Неопределено Тогда
	//	СтруктураБыстрогоОтбора.Свойство("Водитель", Водитель);
	//КонецЕсли;
   	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Водитель", Водитель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Водитель));
//	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "Водитель", Водитель, СтруктураБыстрогоОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ВодительОтборПриИзменении(Элемент)
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Водитель", Водитель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Водитель));
КонецПроцедуры
