
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьПоТоварнойГруппе(Команда)
	
	ОткрытьФорму("РегистрСведений.ПорогиФорматовМД.ФормаЗаписи",Новый Структура("ТипЗаписи",1));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_ТоварнаяКатегория(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_ТоварнаяКатегория", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_ТоварнаяКатегория());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_Номенклатура(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_Номенклатура", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_Номенклатура());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПоНоменклатуре(Команда)
	ОткрытьФорму("РегистрСведений.ПорогиФорматовМД.ФормаЗаписи",Новый Структура("ТипЗаписи",0));
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаКлиенте
Функция СтруктураТаблицы_ТоварнаяКатегория()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
	"СправочникСсылка.ЦеновыеГруппыМД#Ценовая группа#30#1#Справочники.ЦеновыеГруппыМД.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("Формат", "СправочникСсылка.ФорматыПодразделений#Формат#20#1#Справочники.ФорматыПодразделений.НайтиПоНаименованию(""&Ячейка&"")#Формат");
	СтруктураТаблицы.Вставить("Порог1", "число#Порог 1#8");
	СтруктураТаблицы.Вставить("Порог2", "число#Порог 2#8");
	СтруктураТаблицы.Вставить("Порог3", "число#Порог 3#8");
	СтруктураТаблицы.Вставить("Процент1", "число#% наценки 1#10");
	СтруктураТаблицы.Вставить("Процент2", "число#% наценки 2#10");
	СтруктураТаблицы.Вставить("Процент3", "число#% наценки 3#10");
	СтруктураТаблицы.Вставить("Процент4", "число#% наценки 4#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Функция СтруктураТаблицы_Номенклатура()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
		"СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("Формат", "СправочникСсылка.ФорматыПодразделений#Формат#20#1#Справочники.ФорматыПодразделений.НайтиПоНаименованию(""&Ячейка&"")#Формат");
	СтруктураТаблицы.Вставить("ПроцентНоменклатура", "число#% наценки 1#5");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_Номенклатура(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры);

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_ТоварнаяКатегория(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_ТоварнаяКатегория(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_ТоварнаяКатегория(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПорогиФорматовМД.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.ТипЗаписи=1;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокТоварнаяКатегория.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПорогиФорматовМД.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокНоменклатура.Обновить();
КонецПроцедуры

#КонецОбласти