&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Документ <> Неопределено Тогда
		Документ = Параметры.Документ;
		Пропуск = Документ;
		Автор = Документ.Автор;
		Если ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.Пропуск")Тогда
			ЦельПосещения = Документ.ЦельПосещения;
			Расшифровка = Документ.Расшифровка;
			ФИО = Документ.ФИО;
			ВидТранспортногоСредства = Документ.ВидТранспортногоСредства;
			НаименованиеОрганизации = Документ.НаименованиеОрганизации;
			Комментарий = Документ.Комментарий;
		КонецЕсли;		
	КонецЕсли;
	Датчик = Параметры.Датчик;
	ДатаСобытия = Параметры.ДатаСобытия;  
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)

	ОбработатьПодтверждение(ПредопределенноеЗначение("Перечисление.СобытиеСКУД.Вход")); 
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	Элементы.Причина.Видимость = Истина;
	Если НЕ ЗначениеЗаполнено(Причина) Тогда
		Сообщить("Укажите причину");
		Возврат;
	КонецЕсли;
	
	ОбработатьПодтверждение(ПредопределенноеЗначение("Перечисление.СобытиеСКУД.Отказ"));
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодтверждение(Событие)
	УстановитьПривилегированныйРежим(Истина);	
	НаборЗаписей = РегистрыСведений.ИсторияДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Пропуск);
	НаборЗаписей.Отбор.Датчик.Установить(Датчик);
	НаборЗаписей.Отбор.ДатаСобытия.Установить(ДатаСобытия);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Событие = Событие;
		Запись.Причина = Причина;
		Запись.ТребуетсяПодтверждение = Ложь; 
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры 