#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр НормыРабочегоВремени
	Движения.НормыРабочегоВремени.Записывать = Истина;
	Для Каждого ТекСтрокаНормыВремени Из НормыВремени Цикл
		Движение = Движения.НормыРабочегоВремени.Добавить();
		Движение.Период = Дата;
		Движение.Отдел = Отдел;
		Движение.ГрафикРаботы = ГрафикРаботы;
		Движение.ДеньНедели = ТекСтрокаНормыВремени.ДеньНедели;
		Движение.НормаЧасовРаботыНаЧеловекаВДень = ТекСтрокаНормыВремени.НормаЧасовРаботыНаЧеловекаВДень;
		Движение.ДеньНеделиСтрокой = ТекСтрокаНормыВремени.ДеньНеделиСтрокой;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НормыВремени.Количество() <> 7 Тогда
		Сообщить("В таблице норм должны быть заполнены все семь дней недели!");
		Отказ= Истина;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли