
&Вместо("ЗафиксироватьРезультатВыполненияРассылки")
Процедура Док_ЗафиксироватьРезультатВыполненияРассылки(Рассылка, РезультатВыполнения)
	УстановитьПривилегированныйРежим(Истина);

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияРассылокОтчетов");
		ЭлементБлокировки.УстановитьЗначение("Рассылка", Рассылка);
		Блокировка.Заблокировать();

		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Рассылка = Рассылка;
		МенеджерЗаписи.Прочитать();

		МенеджерЗаписи.Рассылка = Рассылка;
		МенеджерЗаписи.СОшибками = РезультатВыполнения.БылиОшибки ИЛИ РезультатВыполнения.БылиПредупреждения;
		Если РезультатВыполнения.БылиОшибки ИЛИ РезультатВыполнения.БылиПредупреждения Тогда 
			МенеджерЗаписи.Выполнена = Ложь; 
		Иначе
			МенеджерЗаписи.Выполнена = РезультатВыполнения.ВыполненаВПапку
										Или РезультатВыполнения.ВыполненаВСетевойКаталог
										Или РезультатВыполнения.ВыполненаНаFTP
										Или РезультатВыполнения.ВыполненаПоЭлектроннойПочте;
		КонецЕсли; 
		Если МенеджерЗаписи.Выполнена Тогда
			МенеджерЗаписи.УспешныйЗапуск = МенеджерЗаписи.ПоследнийЗапускНачало;
		КонецЕсли;
		МенеджерЗаписи.ПоследнийЗапускЗавершение = ТекущаяДатаСеанса();

		МенеджерЗаписи.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры
