
&ИзменениеИКонтроль("ОбработатьСобытиеОтУстройства")
Функция Док_ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки = "") Экспорт
	
	Результат = Истина;
	// Поиск обработчика события
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	Для Каждого Подключение Из ПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
		Если Подключение.ИДУстройства = ОписаниеСобытия.Источник
		 Или (ПустаяСтрока(Подключение.ИДУстройства) И Подключение.ИменаСобытий.Количество() > 0) Тогда
			Если Не Подключение.Несертифицированное Тогда
				// Ищем среди подключенного оборудования устройство с полученным событием.
				Событие = Подключение.ИменаСобытий.Найти(ОписаниеСобытия.Событие);
				Если Событие <> Неопределено Тогда
					ОбъектДрайвера = Подключение.ОбъектДрайвера;
					// Обрабатываем сообщение
					РезультатОбработки = Подключение.ОбработчикДрайвера.ОбработатьСобытие(ОбъектДрайвера, Подключение, ОписаниеСобытия.Событие, ОписаниеСобытия.Данные);
					// Оповещаем 
					Если РезультатОбработки.Результат Тогда 
					#Вставка 
					Если Подключение.Наименование = "Сканер шлагбаума въезд" Тогда
						Оповестить("Въезд", РезультатОбработки.Данные, "Шлагбаум");
						Прервать; 
					КонецЕсли; 
					
					Если Подключение.Наименование = "Сканер шлагбаума выезд" Тогда 
						Оповестить("Выезд", РезультатОбработки.Данные, "Шлагбаум");
						Прервать; 
					КонецЕсли;
					
					Если Подключение.Наименование = "Сканер сотрудники" Тогда 
						Оповестить(РезультатОбработки.Событие, РезультатОбработки.Данные, "СканерСотрудники");
						Прервать; 
					КонецЕсли;
					
					Если Подключение.Наименование = "Сканер ручной"  Тогда 
						Оповестить(РезультатОбработки.Событие, РезультатОбработки.Данные, "ПодключаемоеОборудование");
						Прервать; 
					КонецЕсли;
					#КонецВставки				
						Оповестить(РезультатОбработки.Событие, РезультатОбработки.Данные, "ПодключаемоеОборудование");
					#Вставка 
					Прервать;
					#КонецВставки	
					Иначе
						Результат = Ложь;
						ОписаниеОшибки = ОписаниеСобытия.Событие;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ОбработатьСобытиеОтНесертифицираванногоДрайвера(Подключение, ОписаниеСобытия, ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&ИзменениеИКонтроль("НачатьВыполнениеКоманды_Завершение")
Процедура Док_НачатьВыполнениеКоманды_Завершение(РезультатВыполнения, ПараметрыВыполнениеКоманды) Экспорт
	
	// Обработка данный на сервере после выполнение команды
	Если (РезультатВыполнения.Результат И ПараметрыВыполнениеКоманды.ОбработатьДанные)
		Или (ПараметрыВыполнениеКоманды.Свойство("ОбработатьДанныеПриОшибке") И ПараметрыВыполнениеКоманды.ОбработатьДанныеПриОшибке) Тогда
		
		ПараметрыПодключенияСервер = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПараметрыВыполнениеКоманды.ПодключенноеУстройство);   
		ПараметрыПодключенияСервер.Вставить("ИдентификаторУстройства", ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
		ПроцессорДанных = ПараметрыВыполнениеКоманды.ПроцессорДанных;
		Команда = ПараметрыВыполнениеКоманды.Команда;
		// Вызываем модуль  отвечающий за обработку данных после выполнение команды на оборудовании.
		МенеджерОборудованияВызовСервера.ОбработатьДанныеОперации(ПараметрыПодключенияСервер, ПроцессорДанных, Команда, РезультатВыполнения, ПараметрыВыполнениеКоманды.ДанныеОперации); 
	КонецЕсли;
	
	Если (РезультатВыполнения.Результат И ПараметрыВыполнениеКоманды.ОбработатьДанныеКлиент) Тогда
		ПараметрыПодключенияСервер = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПараметрыВыполнениеКоманды.ПодключенноеУстройство);   
		ПараметрыПодключенияСервер.Вставить("ИдентификаторУстройства", ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
		ПроцессорДанных = ПараметрыВыполнениеКоманды.ПроцессорДанных + "Клиент";
		Команда = ПараметрыВыполнениеКоманды.Команда;
		// Вызываем модуль  отвечающий за обработку данных после выполнение команды на оборудовании.
		МенеджерОборудованияКлиент.ОбработатьДанныеОперации(ПараметрыПодключенияСервер, ПроцессорДанных, Команда, РезультатВыполнения, ПараметрыВыполнениеКоманды.ДанныеОперации); 
	КонецЕсли;
	
	Если РезультатВыполнения.Свойство("ИдентификаторУстройства") И НЕ ЗначениеЗаполнено(РезультатВыполнения.ИдентификаторУстройства) Тогда 
		РезультатВыполнения.ИдентификаторУстройства = ПараметрыВыполнениеКоманды.ИдентификаторУстройства;
	КонецЕсли;
	
	Если РезультатВыполнения.Результат Тогда
		Если ПараметрыВыполнениеКоманды.Свойство("ПараметрыОперации") 
			И ПараметрыВыполнениеКоманды.ПараметрыОперации <> Неопределено
			И ПараметрыВыполнениеКоманды.ПараметрыОперации.Свойство("ДополнительныеПараметры") Тогда
			РезультатВыполнения.Вставить("ДополнительныеПараметры", ПараметрыВыполнениеКоманды.ПараметрыОперации.ДополнительныеПараметры);
		КонецЕсли;
		Если ПараметрыВыполнениеКоманды.Команда = "CheckFiscalization" 
			И ОбщегоНазначенияБПОКлиент.ИспользуетсяДисплеиПокупателя() 
			И ВыводQRКодаЧекаНаДисплейПокупателяПослеФискализации() Тогда
				СообщениеНаДисплее = СтрШаблон(НСтр("ru = 'Электронный чек%1Проверьте чек в ФНС'"), Символы.ПС);
				МодульОборудованиеДисплеиПокупателяКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеДисплеиПокупателяКлиент");
				ПараметрыОперацииQR = МодульОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя(СообщениеНаДисплее, РезультатВыполнения.QRКодЧекаККТ);
				ПараметрыОперацииQR.ВнутренняяОперация = Истина;
				МодульОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(Неопределено, Неопределено, Неопределено, ПараметрыОперацииQR); 
		КонецЕсли;
	Иначе          
		ДополнительнаяОбработкаОшибки(РезультатВыполнения);
		Если ПараметрыВыполнениеКоманды.Команда = "CheckFiscalization"
			И ПараметрыВыполнениеКоманды.Свойство("ОповещениеПриОшибкеПечатиЧека")
			И ПараметрыВыполнениеКоманды.ОповещениеПриОшибкеПечатиЧека <> Неопределено Тогда
				ДанныеОперации = ПараметрыВыполнениеКоманды.ДанныеОперации;
				ПараметрыВыполнения = Новый Структура();
				ПараметрыВыполнения.Вставить("ВходныеПараметры", ПараметрыВыполнениеКоманды.ДанныеОперации);
				ПараметрыВыполнения.Вставить("ОписаниеОшибки"  , Неопределено); 
				ПараметрыВыполнения.Вставить("ПродолжитьПечать", Истина);
				ПараметрыВыполнения.Вставить("ОповещениеПродолжения", Неопределено);
				ЗаполнитьПараметрыОперацииПодписиЧека(ПараметрыВыполнения, ДанныеОперации.НомерСменыККТ, ДанныеОперации.НомерЧекаККТ, ДанныеОперации.ЗаводскойНомерФН); 
				ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПриОшибкеПечатиЧека, ПараметрыВыполнения);
		КонецЕсли;
	КонецЕсли;                        
	
	Если ПараметрыВыполнениеКоманды.ИспользоватьПечатающееУстройство 
		И ПараметрыВыполнениеКоманды.ПечатающееУстройствоПодключено И РезультатВыполнения.Свойство("ТестовыеЧеки") Тогда
		// Поиск подключенного устройства.
		ПечатающееУстройство = ПолучитьПодключенноеУстройство(ПараметрыВыполнениеКоманды.ПечатающееУстройство);                                                
		Если ПечатающееУстройство = Неопределено Тогда
			ТекстОшибки = НСтр("ru='Ошибка печати слип чека. Операция отменена.'");
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
			// Отключение оборудования.
			ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
		Иначе
			Если РезультатВыполнения.Свойство("ТекстСлипЧека") И Не ПустаяСтрока(РезультатВыполнения.ТекстСлипЧека) Тогда
				ПодключаемоеОборудование = ПодключаемоеОборудование();
				ПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", РезультатВыполнения.ТекстСлипЧека);
			КонецЕсли;
			// Результат выполнения исходной операции
			ПараметрыВыполнениеКоманды.Вставить("РезультатВыполнения", РезультатВыполнения);
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПечатьЗавершение", ЭтотОбъект, ПараметрыВыполнениеКоманды);
			#Вставка  
			Если ПараметрыВыполнениеКоманды.Команда = "Settlement" Тогда
			#КонецВставки
			ПечатающееУстройство.ОбработчикДрайвера.НачатьВыполнениеКоманды(ОписаниеОповещения, ПечатающееУстройство, "PrintText", РезультатВыполнения);
			#Вставка
			Иначе	
				ПоказатьОповещениеПользователя ("Слип чек сформирован!",, РезультатВыполнения.ТекстСлипЧека,);  
			    ВыполнитьОбработкуОповещения(ОписаниеОповещения, РезультатВыполнения); 
			КонецЕсли; 
			#КонецВставки
		КонецЕсли;
	ИначеЕсли ПараметрыВыполнениеКоманды.Свойство("ПараметрыОперации")
		И ПараметрыВыполнениеКоманды.ПараметрыОперации <> Неопределено
		И ПараметрыВыполнениеКоманды.ПараметрыОперации.Свойство("УстройствоПечати")
		И ПараметрыВыполнениеКоманды.ПараметрыОперации.Свойство("ПакетДокументов") 
		И (ЗначениеЗаполнено(ПараметрыВыполнениеКоманды.ПараметрыОперации.УстройствоПечати) 
		ИЛИ ЗначениеЗаполнено(ПараметрыВыполнениеКоманды.ПараметрыОперации.ПакетДокументов)) Тогда
			НачатьПодключениеУстройстваПечатиДополнительныхДокументов(РезультатВыполнения, ПараметрыВыполнениеКоманды);
	Иначе
		// Отключение оборудования.
		ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры







