
&ИзменениеИКонтроль("УстановитьРасширение")
Функция Док_УстановитьРасширение(ПараметрыБазы) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("КодВозврата", 200);
	Результат.Вставить("СообщениеОбОшибке", "");
	
	#Вставка
		Возврат Результат;
	#КонецВставки
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат Результат;
	КонецЕсли;

	Попытка
		УстановитьПривилегированныйРежим(Истина);
		ТокенАвторизацииМенеджераВитрин = ПолучитьТокенАвторизацииМенеджераВитрин(ПараметрыБазы);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		ИнформацияОбОшибке          = ИнформацияОбОшибке();

		Результат.КодВозврата       = 401;
		Результат.СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииОбновлениеРасширения(),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		Возврат Результат;
	КонецПопытки;

	Если ТокенАвторизацииМенеджераВитрин.КодВозврата <> 200 Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииОбновлениеРасширения(),
			УровеньЖурналаРегистрации.Ошибка,,, ТокенАвторизацииМенеджераВитрин.СообщениеОбОшибке);

		ЗаполнитьЗначенияСвойств(Результат, ТокенАвторизацииМенеджераВитрин);
		Возврат Результат;
	КонецЕсли;

	Попытка
		ДанныеРасширения = ПолучитьОбновлениеРасширения(ТокенАвторизацииМенеджераВитрин, ПараметрыБазы);
	Исключение
		ИнформацияОбОшибке          = ИнформацияОбОшибке();

		Результат.КодВозврата       = 500;
		Результат.СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииОбновлениеРасширения(),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		Возврат Результат;
	КонецПопытки;

	Если ПараметрыБазы.РазделениеВключено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДанныеРасширения);
		Возврат Результат;
	КонецЕсли;

	Если ДанныеРасширения.ДвоичныеДанные = Неопределено Тогда

		Если ДанныеРасширения.КодВозврата <> 204 Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииОбновлениеРасширения(),
				УровеньЖурналаРегистрации.Ошибка,,, ДанныеРасширения.СообщениеОбОшибке);
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(Результат, ДанныеРасширения);
		Возврат Результат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	ТекущееРасширение = Неопределено;

	Расширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", Маг1СКлиентСерверПереопределяемый.ИдентификаторРасширения()));
	Если Расширения.Количество() > 0 Тогда
		ТекущееРасширение = Расширения[0];
	Иначе
		// АПК:554-выкл расширение получено безопасным способом.
		ТекущееРасширение = РасширенияКонфигурации.Создать();
		// АПК:554-вкл
	КонецЕсли;

	ТекущееРасширение.БезопасныйРежим         = Ложь;
	ТекущееРасширение.Активно                 = Истина;
	ТекущееРасширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	Попытка
		ТекущееРасширение.Записать(ДанныеРасширения.ДвоичныеДанные);
		Константы.ПоказыватьКомандуУстановитьРасширениеМаг1с.Установить(Ложь);
		Возврат Результат;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииОбновлениеРасширения(),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

		Результат.КодВозврата       = 418;
		Результат.СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Возврат Результат;
	КонецПопытки;

КонецФункции
