#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ)
	ПроверкаУникальностиПриоритета(Отказ);
КонецПроцедуры

Процедура ПроверкаУникальностиПриоритета(Отказ)
	Если Не Отказ И ЗначениеЗаполнено(Приоритет) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Истина КАК Ссылка
			|ИЗ
			|	Справочник.ТипыТранспортныхСредств КАК ТипыТранспортныхСредств
			|ГДЕ
			|	ТипыТранспортныхСредств.Ссылка <> &Ссылка
			|	И ТипыТранспортныхСредств.Приоритет = &Приоритет";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Приоритет", Приоритет);	
		Если Запрос.Выполнить().Выбрать().Следующий() Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Значение приоритета должно быть уникальным!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
