&НаСервере
Функция ПолучитьСсылкуНаОтчет(ИмяОбработки) 
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяОбработки);     
	
КонецФункции

&НаКлиенте
Процедура Док_РеестрПКОПосле(Команда)
	ПараметрыКоманды = Новый Структура("Ссылка,Идентификатор,этоОтчет");
	//ПараметрыКоманды.Идентификатор = Объект.Ссылка;	
	ПараметрыКоманды.Ссылка = ПолучитьСсылкуНаОтчет("Реестр Приходно-кассовых ордеров");
	ПараметрыКоманды.ЭтоОтчет = Ложь;	
	ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(ПараметрыКоманды,ЭтаФорма,Новый Массив());
	//Закрыть();
	//ДополнительныеОтчетыИОбработкиКлиент.ОткрытьФормуДополнительногоОтчетаОбработки(ПолучитьСсылкуНаОтчет("Реестр Приходно-кассовых ордеров"), ложь, ПараметрыФормы, ФормаВладелец)
	//ДополнительныеОтчетыИОбработкиКлиент.ОткрытьВариантДополнительногоОтчета(ПолучитьСсылкуНаОтчет("Реестр Приходно-кассовых ордеров"),"РеестрПриходноКассовыхОрдеров"); 
КонецПроцедуры
