
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Заголовок = Заголовок + ": "+ Параметры.Номенклатура;  
	Список.ТекстЗапроса=ТекстЗапросаСписка();

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Дата", Параметры.Дата);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Номенклатура",
		Параметры.Номенклатура,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры    
	
Функция ТекстЗапросаСписка()

	возврат
	  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Упаковка) КАК Упаковка,
|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Валюта) КАК Валюта
|ИЗ
|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), {(Номенклатура).* КАК Номенклатура}) КАК ЦеныНоменклатурыСрезПоследних
|
|СГРУППИРОВАТЬ ПО
|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
|	ЦеныНоменклатурыСрезПоследних.Характеристика";

КонецФункции // ТекстЗапросаСписка()
	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти