&НаКлиенте
Процедура ВРаботу(Команда)
	
	Если Объект.Статус = 0 тогда
		ПринятьВРаботу();
		ЭтаФорма.Модифицированность = Истина;
	Иначе
		Сообщить("Не возможно принять в работу заявку!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПринятьВРаботу()
	
	Объект.ДатаРаботы = ТекущаяДата();
	Объект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	Объект.Статус = 1;   
	
КОнецПроцедуры

&НаКлиенте
Процедура Выполнена(Команда)
	
	Если Объект.Статус = 1 тогда
		ВыполнитьЗаявку();
		ЭтаФорма.Модифицированность = Истина;
	Иначе
		Сообщить("Не возможно выполнить заявку!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаявку()
	Объект.ДатаВыполнения = ТекущаяДата();
	Объект.Статус = 2;
КОнецПроцедуры

&НаКлиенте
Процедура Отменена(Команда)
	
	Если Объект.Статус = 1 тогда
		ОтменитьЗаявку();
		ЭтаФорма.Модифицированность = Истина;
	Иначе
		Сообщить("Не возможно отменить заявку!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаявку()
	Объект.ДатаВыполнения = ТекущаяДата();
	Объект.Статус = 3;
КОнецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//При копировании очистим лишнее, заполним правильно реквизиты
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования.Автор) тогда
		Объект.Автор=ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата=ТекущаяДата();
		//Очищаем
		Объект.Основание="";
		Объект.ДатаРаботы="";
		Объект.ДатаВыполнения="";
		Объект.ДатаПрибытия="";
		Объект.ДатаПрибытияНаСкладПлан="";
		Объект.Менеджер="";
		Объект.ТранспортнаяКомпания="";
		Объект.Статус=0;
		Объект.ФактическаяСтоимостьДоставки=0;
		Объект.КомментарийМенеджера="";
	КонецЕсли;
	//
	Если Не ЗначениеЗаполнено(Объект.Автор) тогда
		Объект.Автор=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Дата) тогда
		Объект.Дата=ТекущаяДата()
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОснованиеДокумента = Объект.Основание;
	
	ВидимостьПоставкиНаСклад = Истина;
	
	Если ЗначениеЗаполнено(ОснованиеДокумента) И ТипЗнч(ОснованиеДокумента) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ВидимостьПоставкиНаСклад = Не (Альтерра_СкладСервер.ИспользуетсяНоваяСхемаРаботыСПоставками(ОснованиеДокумента.Дата) ИЛИ Параметры.Ключ.Пустая());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПроверитьРоль() Тогда
		ЭтаФОрма.Элементы.ФормаВРаботу.Доступность = Ложь;
		ЭтаФОрма.Элементы.ФормаВыполнена.Доступность = Ложь;
		ЭтаФОрма.Элементы.ФормаОтменена.Доступность =  Ложь;
		ЭтаФОрма.Элементы.ТранспортнаяКомпания.Доступность = Ложь;
		ЭтаФОрма.Элементы.ФактическаяСтоимостьДоставки.Доступность = Ложь;
		ЭтаФОрма.Элементы.КомментарийМенеджера.Доступность = Ложь;
		ЭтаФОрма.Элементы.ДатаПрибытия.Доступность = Ложь;
		ЭтаФОрма.Элементы.ДатаПоступления.Доступность = Ложь;
	КонецЕсли;
	Если ПроверитьАдминистратора() Тогда
		ЭтаФОрма.Элементы.Статус.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды Не работает
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Функция ПроверитьРоль()
	
	Если РольДоступна("ОтделЛогистики") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьАдминистратора()
	
	Если (ПараметрыСеанса.ТекущийПользователь.Наименование = "Администратор") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;  
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Объект.Поставщик = "";
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ГрузоотправительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГрузоотправительПриИзмененииНаСервере()
	Объект.БанковскийСчетГрузоотправителя = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Объект.Грузоотправитель);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоОснованию(Команда)
	ОбновитьПоОснованиюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоОснованиюНаСервере()
	Документы.ЗаявкиНаТранспорт.ЗаполнитьДанныеПоОснованию(Объект.Основание, Объект);
КонецПроцедуры




