#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("ПриКомпоновкеРезультата")
Процедура Док_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	
	// Сформируем отчет
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	#Удаление 
	ТекстЗапроса = ТекстЗапроса();
	#КонецУдаления
	
	#Вставка
	ТекстЗапроса = ТекстЗапросаМодификация(НастройкиОтчета);
	#КонецВставки 
	ВзаиморасчетыСервер.ДобавитьОтборыВыбранныхПолейВЗапрос(ТекстЗапроса, НастройкиОтчета, СхемаКомпоновкиДанных.ВычисляемыеПоля, "Расчеты");
	
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос = ТекстЗапроса;
	
	#Вставка
	ИзменитьВычисляемоеПоле(СхемаКомпоновкиДанных,НастройкиОтчета);
    #КонецВставки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	//Предупреждение о невыполенном распределении взаиморасчетов.
	ВзаиморасчетыСервер.ВывестиПредупреждениеОбОбновлении(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаМодификация(вариант)
	
	если типзнч(вариант.ДополнительныеСвойства)=тип("Структура") и вариант.ДополнительныеСвойства.КлючВарианта="ЗадолженностьКлиентовПричиныЗапретаОтгрузки"  тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Расчеты.Организация КАК Организация,
		               |	Расчеты.Партнер КАК Партнер,
		               |	Расчеты.Контрагент КАК Контрагент,
		               |	Расчеты.Договор КАК Договор,
		               |	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		               |	Расчеты.Валюта КАК Валюта,
		               |	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
		               |	Расчеты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		               |	Расчеты.ДатаВозникновения КАК ДатаВозникновения,
		               |	СУММА(Расчеты.НашДолг) КАК НашДолг,
		               |	СУММА(Расчеты.ДолгКлиента) КАК ДолгКлиента,
		               |	СУММА(Расчеты.ДолгКлиентаПросрочено) КАК ДолгКлиентаПросрочено,
		               |	СУММА(Расчеты.ПлановаяОплатаАванс) КАК ПлановаяОплатаАванс,
		               |	СУММА(Расчеты.ПлановаяОплатаПредоплата) КАК ПлановаяОплатаПредоплата,
		               |	СУММА(Расчеты.ПлановаяОплатаКредит) КАК ПлановаяОплатаКредит,
		               |	СУММА(Расчеты.ПлановаяОплатаПросрочено) КАК ПлановаяОплатаПросрочено,
		               |	СУММА(Расчеты.Оплачивается) КАК Оплачивается,
		               |	СУММА(Расчеты.ПлановаяОтгрузка) КАК ПлановаяОтгрузка,
		               |	СУММА(Расчеты.ПлановаяОтгрузкаПросрочено) КАК ПлановаяОтгрузкаПросрочено,
		               |	СУММА(Расчеты.Отгружается) КАК Отгружается
		               |ПОМЕСТИТЬ ВтРасчеты
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		АналитикаУчета.Организация КАК Организация,
		               |		АналитикаУчета.Партнер КАК Партнер,
		               |		АналитикаУчета.Контрагент КАК Контрагент,
		               |		АналитикаУчета.Договор КАК Договор,
		               |		АналитикаУчета.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |		РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
		               |		РасчетыПоСрокам.Валюта КАК Валюта,
		               |		РасчетыПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
		               |		РасчетыПоСрокам.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		               |		РасчетыПоСрокам.ДатаВозникновения КАК ДатаВозникновения,
		               |		РасчетыПоСрокам.ПредоплатаОстаток КАК НашДолг,
		               |		РасчетыПоСрокам.ДолгОстаток КАК ДолгКлиента,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоСрокам.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕНЬ)
		               |				ТОГДА РасчетыПоСрокам.ДолгОстаток
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК ДолгКлиентаПросрочено,
		               |		0 КАК ПлановаяОплатаАванс,
		               |		0 КАК ПлановаяОплатаПредоплата,
		               |		0 КАК ПлановаяОплатаКредит,
		               |		0 КАК ПлановаяОплатаПросрочено,
		               |		0 КАК Оплачивается,
		               |		0 КАК ПлановаяОтгрузка,
		               |		0 КАК ПлановаяОтгрузкаПросрочено,
		               |		0 КАК Отгружается
		               |	ИЗ
		               |		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&ДатаОтчетаГраница, ) КАК РасчетыПоСрокам
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		               |			ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		               |	ГДЕ
		               |		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		               |	{ГДЕ
		               |		АналитикаУчета.Организация.* КАК Организация,
		               |		АналитикаУчета.Партнер.* КАК Партнер,
		               |		АналитикаУчета.Контрагент.* КАК Контрагент,
		               |		АналитикаУчета.Договор.* КАК Договор,
		               |		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		               |		(АналитикаУчета.Партнер В
		               |				(ВЫБРАТЬ
		               |					ОтборПоСегментуПартнеров.Партнер
		               |				ИЗ
		               |					ОтборПоСегментуПартнеров
		               |				ГДЕ
		               |					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)) КАК Поле2}
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		АналитикаУчета.Организация,
		               |		АналитикаУчета.Партнер,
		               |		АналитикаУчета.Контрагент,
		               |		АналитикаУчета.Договор,
		               |		АналитикаУчета.НаправлениеДеятельности,
		               |		РасчетыСКлиентами.ОбъектРасчетов,
		               |		РасчетыСКлиентами.Валюта,
		               |		ВЫБОР
		               |			КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |				ТОГДА РасчетыСКлиентами.Регистратор
		               |			ИНАЧЕ РасчетыСКлиентами.ПродажаПоЗаказу
		               |		КОНЕЦ,
		               |		ДАТАВРЕМЯ(1, 1, 1),
		               |		ДАТАВРЕМЯ(1, 1, 1),
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		СУММА(ВЫБОР
		               |				КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |					ТОГДА РасчетыСКлиентами.Отгружается
		               |				ИНАЧЕ -РасчетыСКлиентами.Отгружается
		               |			КОНЕЦ)
		               |	ИЗ
		               |		РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		               |			ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		               |	ГДЕ
		               |		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		               |		И РасчетыСКлиентами.Отгружается <> 0
		               |	{ГДЕ
		               |		АналитикаУчета.Организация.* КАК Организация,
		               |		АналитикаУчета.Партнер.* КАК Партнер,
		               |		АналитикаУчета.Контрагент.* КАК Контрагент,
		               |		АналитикаУчета.Договор.* КАК Договор,
		               |		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		               |		(АналитикаУчета.Партнер В
		               |				(ВЫБРАТЬ
		               |					ОтборПоСегментуПартнеров.Партнер
		               |				ИЗ
		               |					ОтборПоСегментуПартнеров
		               |				ГДЕ
		               |					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)) КАК Поле2}
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		АналитикаУчета.Организация,
		               |		АналитикаУчета.Партнер,
		               |		АналитикаУчета.Контрагент,
		               |		АналитикаУчета.Договор,
		               |		АналитикаУчета.НаправлениеДеятельности,
		               |		РасчетыСКлиентами.ОбъектРасчетов,
		               |		РасчетыСКлиентами.Валюта,
		               |		ВЫБОР
		               |			КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |				ТОГДА РасчетыСКлиентами.Регистратор
		               |			ИНАЧЕ РасчетыСКлиентами.ПродажаПоЗаказу
		               |		КОНЕЦ
		               |	
		               |	ИМЕЮЩИЕ
		               |		СУММА(ВЫБОР
		               |				КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |					ТОГДА РасчетыСКлиентами.Отгружается
		               |				ИНАЧЕ -РасчетыСКлиентами.Отгружается
		               |			КОНЕЦ) <> 0) КАК Расчеты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Расчеты.Организация,
		               |	Расчеты.Партнер,
		               |	Расчеты.Контрагент,
		               |	Расчеты.Договор,
		               |	Расчеты.НаправлениеДеятельности,
		               |	Расчеты.ОбъектРасчетов,
		               |	Расчеты.Валюта,
		               |	Расчеты.РасчетныйДокумент,
		               |	Расчеты.ДатаПлановогоПогашения,
		               |	Расчеты.ДатаВозникновения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Расчеты.Организация КАК Организация,
		               |	Расчеты.Партнер КАК Партнер,
		               |	Расчеты.Контрагент КАК Контрагент,
		               |	Расчеты.Договор КАК Договор,
		               |	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		               |	Расчеты.Валюта КАК Валюта,
		               |	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
		               |	Расчеты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		               |	Расчеты.ДатаВозникновения КАК ДатаВозникновения,
		               |	Расчеты.НашДолг КАК НашДолг,
		               |	Расчеты.ДолгКлиента КАК ДолгКлиента,
		               |	Расчеты.ДолгКлиентаПросрочено КАК ДолгКлиентаПросрочено,
		               |	Расчеты.ПлановаяОплатаАванс КАК ПлановаяОплатаАванс,
		               |	Расчеты.ПлановаяОплатаПредоплата КАК ПлановаяОплатаПредоплата,
		               |	Расчеты.ПлановаяОплатаКредит КАК ПлановаяОплатаКредит,
		               |	Расчеты.ПлановаяОплатаПросрочено КАК ПлановаяОплатаПросрочено,
		               |	Расчеты.Оплачивается КАК Оплачивается,
		               |	Расчеты.ПлановаяОтгрузка КАК ПлановаяОтгрузка,
		               |	Расчеты.ПлановаяОтгрузкаПросрочено КАК ПлановаяОтгрузкаПросрочено,
		               |	ВЫБОР
		               |		КОГДА Расчеты.НашДолг + Расчеты.ДолгКлиента = 0
		               |			ТОГДА Расчеты.Отгружается
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Отгружается,
		               |	ЕСТЬNULL(Договоры.ЗапрещаетсяПросроченнаяЗадолженность, ЛОЖЬ) КАК ЗапрещаетсяПросроченнаяЗадолженность,
		               |	ЕСТЬNULL(Договоры.ОграничиватьСуммуЗадолженности, ЛОЖЬ) КАК ОграничиватьСуммуЗадолженности,
		               |	ЕСТЬNULL(Договоры.ДопустимаяСуммаЗадолженности, 0) КАК ДопустимаяСуммаЗадолженности
		               |ИЗ
		               |	ВтРасчеты КАК Расчеты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		               |		ПО (Договоры.Ссылка = Расчеты.Договор)";
		
	иначе
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Сегменты.Партнер КАК Партнер,
		|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
		|ПОМЕСТИТЬ ОтборПоСегментуПартнеров
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК Сегменты
		|{ГДЕ
		|	Сегменты.Сегмент.* КАК СегментПартнеров,
		|	Сегменты.Партнер.* КАК Партнер}
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер,
		|	ИспользуетсяОтборПоСегментуПартнеров
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.Организация                       КАК Организация,
		|	Расчеты.Партнер                           КАК Партнер,
		|	Расчеты.Контрагент                        КАК Контрагент,
		|	Расчеты.Договор                           КАК Договор,
		|	Расчеты.НаправлениеДеятельности           КАК НаправлениеДеятельности,
		|	Расчеты.ОбъектРасчетов                    КАК ОбъектРасчетов,
		|	Расчеты.Валюта                            КАК Валюта,
		|	Расчеты.РасчетныйДокумент                 КАК РасчетныйДокумент,
		|	Расчеты.ДатаПлановогоПогашения            КАК ДатаПлановогоПогашения,
		|	Расчеты.ДатаВозникновения                 КАК ДатаВозникновения,
		|	СУММА(Расчеты.НашДолг)                    КАК НашДолг,
		|	СУММА(Расчеты.ДолгКлиента)                КАК ДолгКлиента,
		|	СУММА(Расчеты.ДолгКлиентаПросрочено)      КАК ДолгКлиентаПросрочено,
		|	
		|	СУММА(Расчеты.ПлановаяОплатаАванс)        КАК ПлановаяОплатаАванс,
		|	СУММА(Расчеты.ПлановаяОплатаПредоплата)   КАК ПлановаяОплатаПредоплата,
		|	СУММА(Расчеты.ПлановаяОплатаКредит)       КАК ПлановаяОплатаКредит,
		|	СУММА(Расчеты.ПлановаяОплатаПросрочено)   КАК ПлановаяОплатаПросрочено,
		|	СУММА(Расчеты.Оплачивается)               КАК Оплачивается,
		|	
		|	СУММА(Расчеты.ПлановаяОтгрузка)           КАК ПлановаяОтгрузка,
		|	СУММА(Расчеты.ПлановаяОтгрузкаПросрочено) КАК ПлановаяОтгрузкаПросрочено,
		|	СУММА(Расчеты.Отгружается)                КАК Отгружается
		|ПОМЕСТИТЬ ВтРасчеты
		|ИЗ (
		|	ВЫБРАТЬ
		|		АналитикаУчета.Организация                                     КАК Организация,
		|		АналитикаУчета.Партнер                                         КАК Партнер,
		|		АналитикаУчета.Контрагент                                      КАК Контрагент,
		|		АналитикаУчета.Договор                                         КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
		|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
		|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
		|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
		|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
		|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
		|		РасчетыПоСрокам.ПредоплатаОстаток                              КАК НашДолг,
		|		РасчетыПоСрокам.ДолгОстаток                                    КАК ДолгКлиента,
		|		ВЫБОР 
		|			КОГДА РасчетыПоСрокам.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОтчета,ДЕНЬ)
		|				ТОГДА РасчетыПоСрокам.ДолгОстаток
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                          КАК ДолгКлиентаПросрочено,
		|		
		|		0                                                              КАК ПлановаяОплатаАванс,
		|		0                                                              КАК ПлановаяОплатаПредоплата,
		|		0                                                              КАК ПлановаяОплатаКредит,
		|		0                                                              КАК ПлановаяОплатаПросрочено,
		|		0                                                              КАК Оплачивается,
		|		
		|		0                                                              КАК ПлановаяОтгрузка,
		|		0                                                              КАК ПлановаяОтгрузкаПросрочено,
		|		0                                                              КАК Отгружается
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&ДатаОтчетаГраница) КАК РасчетыПоСрокам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		|	ГДЕ
		|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	{ГДЕ
		|		АналитикаУчета.Организация.* КАК Организация,
		|		АналитикаУчета.Партнер.* КАК Партнер,
		|		АналитикаУчета.Контрагент.* КАК Контрагент,
		|		АналитикаУчета.Договор.* КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		|		(АналитикаУчета.Партнер В
		|				(ВЫБРАТЬ
		|					ОтборПоСегментуПартнеров.Партнер
		|				ИЗ
		|					ОтборПоСегментуПартнеров
		|				ГДЕ
		|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АналитикаУчета.Организация                                    КАК Организация,
		|		АналитикаУчета.Партнер                                        КАК Партнер,
		|		АналитикаУчета.Контрагент                                     КАК Контрагент,
		|		АналитикаУчета.Договор                                        КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности                        КАК НаправлениеДеятельности,
		|		РасчетыПланОплат.ОбъектРасчетов                               КАК ОбъектРасчетов,
		|		РасчетыПланОплат.Валюта                                       КАК Валюта,
		|		РасчетыПланОплат.ДокументПлан                                 КАК ДокументПлан,
		|		РасчетыПланОплат.ДатаПлановогоПогашения                       КАК ДатаПлановогоПогашения,
		|		РасчетыПланОплат.ДатаВозникновения                            КАК ДатаВозникновения,
		|		0                                                             КАК НашДолг,
		|		0                                                             КАК ДолгКлиента,
		|		0                                                             КАК ДолгКлиентаПросрочено,
		|		
		|		ВЫБОР
		|			КОГДА РасчетыПланОплат.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения)
		|				ТОГДА РасчетыПланОплат.КОплатеОстаток 
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                         КАК ПлановаяОплатаАванс,
		|		ВЫБОР
		|			КОГДА РасчетыПланОплат.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки)
		|				ТОГДА РасчетыПланОплат.КОплатеОстаток 
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                         КАК ПлановаяОплатаПредоплата,
		|		ВЫБОР
		|			КОГДА РасчетыПланОплат.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки)
		|				ИЛИ РасчетыПланОплат.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.КредитСдвиг)
		|				ТОГДА РасчетыПланОплат.КОплатеОстаток 
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                          КАК ПлановаяОплатаКредит,
		|		ВЫБОР 
		|			КОГДА РасчетыПланОплат.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОтчета,ДЕНЬ)
		|				ТОГДА РасчетыПланОплат.КОплатеОстаток
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                          КАК ПлановаяОплатаПросрочено,
		|		0                                                              КАК Оплачивается,
		|		
		|		0                                                              КАК ПлановаяОтгрузка,
		|		0                                                              КАК ПлановаяОтгрузкаПросрочено,
		|		0                                                              КАК Отгружается
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(&ДатаОтчетаГраница) КАК РасчетыПланОплат
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		|	ГДЕ
		|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	{ГДЕ
		|		АналитикаУчета.Организация.* КАК Организация,
		|		АналитикаУчета.Партнер.* КАК Партнер,
		|		АналитикаУчета.Контрагент.* КАК Контрагент,
		|		АналитикаУчета.Договор.* КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		|		(АналитикаУчета.Партнер В
		|				(ВЫБРАТЬ
		|					ОтборПоСегментуПартнеров.Партнер
		|				ИЗ
		|					ОтборПоСегментуПартнеров
		|				ГДЕ
		|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АналитикаУчета.Организация                  КАК Организация,
		|		АналитикаУчета.Партнер                      КАК Партнер,
		|		АналитикаУчета.Контрагент                   КАК Контрагент,
		|		АналитикаУчета.Договор                      КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности      КАК НаправлениеДеятельности,
		|		РасчетыПланОтгрузок.ОбъектРасчетов          КАК ОбъектРасчетов,
		|		РасчетыПланОтгрузок.Валюта                  КАК Валюта,
		|		РасчетыПланОтгрузок.ДокументПлан            КАК ДокументПлан,
		|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
		|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
		|		0                                           КАК НашДолг,
		|		0                                           КАК ДолгКлиента,
		|		0                                           КАК ДолгКлиентаПросрочено,
		|		
		|		0                                           КАК ПлановаяОплатаАванс,
		|		0                                           КАК ПлановаяОплатаПредоплата,
		|		0                                           КАК ПлановаяОплатаКредит,
		|		0                                           КАК ПлановаяОплатаПросрочено,
		|		0                                           КАК Оплачивается,
		|		
		|		РасчетыПланОтгрузок.СуммаОстаток            КАК ПлановаяОтгрузка,
		|		ВЫБОР 
		|			КОГДА РасчетыПланОтгрузок.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОтчета,ДЕНЬ)
		|				ТОГДА РасчетыПланОтгрузок.СуммаОстаток
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                       КАК ПлановаяОтгрузкаПросрочено,
		|		0                                           КАК Отгружается
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Остатки(&ДатаОтчетаГраница) КАК РасчетыПланОтгрузок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		|	ГДЕ
		|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	{ГДЕ
		|		АналитикаУчета.Организация.* КАК Организация,
		|		АналитикаУчета.Партнер.* КАК Партнер,
		|		АналитикаУчета.Контрагент.* КАК Контрагент,
		|		АналитикаУчета.Договор.* КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		|		(АналитикаУчета.Партнер В
		|				(ВЫБРАТЬ
		|					ОтборПоСегментуПартнеров.Партнер
		|				ИЗ
		|					ОтборПоСегментуПартнеров
		|				ГДЕ
		|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АналитикаУчета.Организация             КАК Организация,
		|		АналитикаУчета.Партнер                 КАК Партнер,
		|		АналитикаУчета.Контрагент              КАК Контрагент,
		|		АналитикаУчета.Договор                 КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|		РасчетыСКлиентами.ОбъектРасчетов       КАК ОбъектРасчетов,
		|		РасчетыСКлиентами.Валюта               КАК Валюта,
		|		Неопределено                           КАК ДокументПлан,
		|		ДАТАВРЕМЯ(1,1,1)                       КАК ДатаПлановогоПогашения,
		|		ДАТАВРЕМЯ(1,1,1)                       КАК ДатаВозникновения,
		|		0                                      КАК НашДолг,
		|		0                                      КАК ДолгКлиента,
		|		0                                      КАК ДолгКлиентаПросрочено,
		|		
		|		0                                      КАК ПлановаяОплатаАванс,
		|		0                                      КАК ПлановаяОплатаПредоплата,
		|		0                                      КАК ПлановаяОплатаКредит,
		|		0                                      КАК ПлановаяОплатаПросрочено,
		|		РасчетыСКлиентами.ОплачиваетсяОстаток  КАК Оплачивается,
		|		
		|		0                                      КАК ПлановаяОтгрузка,
		|		0                                      КАК ПлановаяОтгрузкаПросрочено,
		|		РасчетыСКлиентами.ОтгружаетсяОстаток   КАК Отгружается
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентами.Остатки(&ДатаОтчетаГраница) КАК РасчетыСКлиентами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|			ПО АналитикаУчета.КлючАналитики = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
		|	ГДЕ
		|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	{ГДЕ
		|		АналитикаУчета.Организация.* КАК Организация,
		|		АналитикаУчета.Партнер.* КАК Партнер,
		|		АналитикаУчета.Контрагент.* КАК Контрагент,
		|		АналитикаУчета.Договор.* КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		|		(АналитикаУчета.Партнер В
		|				(ВЫБРАТЬ
		|					ОтборПоСегментуПартнеров.Партнер
		|				ИЗ
		|					ОтборПоСегментуПартнеров
		|				ГДЕ
		|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}) КАК Расчеты
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.Организация,
		|	Расчеты.Партнер,
		|	Расчеты.Контрагент,
		|	Расчеты.Договор,
		|	Расчеты.НаправлениеДеятельности,
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.Валюта,
		|	Расчеты.РасчетныйДокумент,
		|	Расчеты.ДатаПлановогоПогашения,
		|	Расчеты.ДатаВозникновения
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.Организация                КАК Организация,
		|	Расчеты.Партнер                    КАК Партнер,
		|	Расчеты.Контрагент                 КАК Контрагент,
		|	Расчеты.Договор                    КАК Договор,
		|	Расчеты.НаправлениеДеятельности    КАК НаправлениеДеятельности,
		|	Расчеты.ОбъектРасчетов             КАК ОбъектРасчетов,
		|	Расчеты.Валюта                     КАК Валюта,
		|	Расчеты.РасчетныйДокумент          КАК РасчетныйДокумент,
		|	Расчеты.ДатаПлановогоПогашения     КАК ДатаПлановогоПогашения,
		|	Расчеты.ДатаВозникновения          КАК ДатаВозникновения,
		|	Расчеты.НашДолг                    КАК НашДолг,
		|	Расчеты.ДолгКлиента                КАК ДолгКлиента,
		|	Расчеты.ДолгКлиентаПросрочено      КАК ДолгКлиентаПросрочено,
		|	
		|	Расчеты.ПлановаяОплатаАванс        КАК ПлановаяОплатаАванс,
		|	Расчеты.ПлановаяОплатаПредоплата   КАК ПлановаяОплатаПредоплата,
		|	Расчеты.ПлановаяОплатаКредит       КАК ПлановаяОплатаКредит,
		|	Расчеты.ПлановаяОплатаПросрочено   КАК ПлановаяОплатаПросрочено,
		|	Расчеты.Оплачивается               КАК Оплачивается,
		|	
		|	Расчеты.ПлановаяОтгрузка           КАК ПлановаяОтгрузка,
		|	Расчеты.ПлановаяОтгрузкаПросрочено КАК ПлановаяОтгрузкаПросрочено,
		|	Расчеты.Отгружается                КАК Отгружается,
		|
		|	ЕСТЬNULL(Договоры.ЗапрещаетсяПросроченнаяЗадолженность, ЛОЖЬ) КАК ЗапрещаетсяПросроченнаяЗадолженность,
		|	ЕСТЬNULL(Договоры.ОграничиватьСуммуЗадолженности, ЛОЖЬ)       КАК ОграничиватьСуммуЗадолженности,
		|	ЕСТЬNULL(Договоры.ДопустимаяСуммаЗадолженности, 0)            КАК ДопустимаяСуммаЗадолженности
		|
		|ИЗ ВтРасчеты КАК Расчеты
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ПО Договоры.Ссылка = Расчеты.Договор
		|";
		
	конецесли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НаДату","&ДатаОтчета");
	
	Возврат ТекстЗапроса;
КонецФункции

Процедура ИзменитьВычисляемоеПоле(СхемаКомпоновкиДанных,вариант)
	если типзнч(вариант.ДополнительныеСвойства)=тип("Структура") и вариант.ДополнительныеСвойства.КлючВарианта="ЗадолженностьКлиентовПричиныЗапретаОтгрузки"  тогда
		СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ОстатокДопустимойЗадолженности").Выражение="ВЫЧИСЛИТЬВЫРАЖЕНИЕ(""ДопустимаяСуммаЗадолженности -СУММА(ДолгКлиента - НашДолг+Отгружается)"",,,""Первая"",""Текущая"")";
	иначе
		СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ОстатокДопустимойЗадолженности").Выражение="ДопустимаяСуммаЗадолженности - (ДолгКлиента - НашДолг)";
		СхемаКомпоновкиДанных.ПоляИтога.Удалить(СхемаКомпоновкиДанных.ПоляИтога.Найти("ОстатокДопустимойЗадолженности"));
	конецесли;


КонецПроцедуры

#КонецЕсли
