
&ИзменениеИКонтроль("ДобавитьОплатуКартойЗавершение")
Процедура Док_ДобавитьОплатуКартойЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Неопределено);
		Возврат;
	КонецЕсли;

	Если ДополнительныеПараметры.Свойство("ТолькоЗаполнитьРезультатОплатыКартой")
		И ДополнительныеПараметры.ТолькоЗаполнитьРезультатОплатыКартой = Истина Тогда

		Если НЕ (ТипЗнч(Результат) = Тип("Структура")
			И Результат.Свойство("Сумма")
			И Результат.Свойство("НомерЧека")
			И Результат.Свойство("НомерКарты")
			И Результат.Свойство("СсылочныйНомер")) Тогда

			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Неопределено);
			Возврат;
		КонецЕсли;

		РезультатОплатыКартой = СтруктураРезультатаОплатыКартой();
		РезультатОплатыКартой.ЭквайринговыйТерминал = ДополнительныеПараметры.СтруктураЭквайринговыйТерминал.Ссылка;
		РезультатОплатыКартой.НомерКарты            = Результат.НомерКарты;
		РезультатОплатыКартой.СуммаОперации         = Результат.Сумма;
		РезультатОплатыКартой.НомерЧека             = Результат.НомерЧека;
		РезультатОплатыКартой.СсылочныйНомер        = Результат.СсылочныйНомер;
		РезультатОплатыКартой.КодАвторизации        = Неопределено;
		#Вставка
		ДанныеОплатЧекаККМ = ДополнительныеПараметры.Форма.ЭтотОбъект.ДанныепоЧекуККМ.ДанныеПервойНеотмененнойОплатыПлатежнымиКартами;		
		Если РезультатОплатыКартой.КодАвторизации = Неопределено и Не ДанныеОплатЧекаККМ = Неопределено Тогда
			РезультатОплатыКартой.НомерКарты     = ДанныеОплатЧекаККМ.НомерПлатежнойКарты;
			РезультатОплатыКартой.СсылочныйНомер = ДанныеОплатЧекаККМ.СсылочныйНомер;
			РезультатОплатыКартой.КодАвторизации = ДанныеОплатЧекаККМ.КодАвторизации;
		ИначеЕсли ДанныеОплатЧекаККМ = Неопределено Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Нет данных для возврата безналичной оплаты.'"));
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Неопределено);
			Возврат;
		КонецЕсли;	
		#КонецВставки	
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, РезультатОплатыКартой);

	ИначеЕсли Не ДополнительныеПараметры.СтруктураЭквайринговыйТерминал.ИспользоватьБезПодключенияОборудования Тогда

		Если НЕ (ТипЗнч(Результат) = Тип("Структура")
			И Результат.Свойство("Сумма")
			И Результат.Свойство("НомерЧека")
			И Результат.Свойство("СсылочныйНомер")) Тогда

			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Неопределено);
			Возврат;
		КонецЕсли;

		ОценкаПроизводительностиКлиент.ЗамерВремени("РозничныеПродажиКлиент.ДобавитьОплатуКартойЗавершение");

		ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		ПараметрыОперации.ТипТранзакции  = "AuthorizeSales";
		ПараметрыОперации.СуммаОперации  = Результат.Сумма;
		ПараметрыОперации.НомерЧека      = Результат.НомерЧека;
		ПараметрыОперации.СсылочныйНомер = Результат.СсылочныйНомер; 
		
		Если ДополнительныеПараметры.Свойство("ДокументОснование") Тогда
			ПараметрыОперации.ДокументОснование = ДополнительныеПараметры.ДокументОснование;
		КонецЕсли;

		Оповещение = Новый ОписаниеОповещения("ПослеВыполненияОперацииОплатыКартойНаЭквайринговомТерминале", ЭтотОбъект, ДополнительныеПараметры);
		ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(
			Оповещение,
			ДополнительныеПараметры.Форма.УникальныйИдентификатор,
			ДополнительныеПараметры.ИдентификаторУстройстваЭТ,
			ПараметрыОперации,
			,
			ДополнительныеПараметры.ПараметрыКассыККМ.ИдентификаторУстройства);

	Иначе

		Если НЕ (ТипЗнч(Результат) = Тип("Структура")
			И Результат.Свойство("Сумма")
			И Результат.Свойство("НомерЧека")
			И Результат.Свойство("НомерКарты")
			И Результат.Свойство("СсылочныйНомер")) Тогда

			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Неопределено);
			Возврат;
		КонецЕсли;

		ТекстВопроса = НСтр("ru = 'Требуется выполнить операцию оплаты на эквайринговом терминале.'") + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Сумма операции:'") + " "+ Результат.Сумма + Символы.ПС;
		ТекстВопроса = ТекстВопроса + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Операция оплаты на эквайринговом терминале прошла успешно?'");

		РезультатОплатыКартой = СтруктураРезультатаОплатыКартой();
		РезультатОплатыКартой.ЭквайринговыйТерминал = ДополнительныеПараметры.СтруктураЭквайринговыйТерминал.Ссылка;
		РезультатОплатыКартой.НомерКарты            = Результат.НомерКарты;
		РезультатОплатыКартой.СуммаОперации         = Результат.Сумма;
		РезультатОплатыКартой.НомерЧека             = Результат.НомерЧека;
		РезультатОплатыКартой.СсылочныйНомер        = Результат.СсылочныйНомер;
		РезультатОплатыКартой.КодАвторизации        = Неопределено;

		РезультатОплатыКартой.ОповещениеОЗавершении = ДополнительныеПараметры.ОповещениеОЗавершении;

		ПоказатьВопрос(
			Новый ОписаниеОповещения(
				"ОплатаКартойПослеВопросаОЗавершенииАвторизации",
				РозничныеПродажиКлиент,
				РезультатОплатыКартой),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет);

	КонецЕсли;

КонецПроцедуры
&ИзменениеИКонтроль("ОбработатьСостояниеСмены")
Процедура Док_ОбработатьСостояниеСмены(Форма, ОписаниеОповещенияЗавершение)
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ПараметрыККТ") Тогда
		ПараметрыКассыККМ = Форма.ПараметрыККТ.ИдентификаторУстройства;
		Форма.СтруктураСостояниеКассовойСмены = РозничныеПродажиВызовСервера.СостояниеКассовойСмены(Форма.ПараметрыККТ.ИдентификаторУстройства);
	Иначе
		ПараметрыКассыККМ = Форма.ПараметрыКассыККМ;
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "Объект")
			И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма.Объект, "КассаККМ") Тогда
			КассаККМ = Форма.Объект.КассаККМ;
		Иначе
			КассаККМ = Форма.КассаККМ;
		КонецЕсли;
		Форма.СтруктураСостояниеКассовойСмены = РозничныеПродажиВызовСервера.СостояниеКассовойСмены(КассаККМ);
	КонецЕсли;
	
       #Удаление   
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "Объект")
		И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма.Объект, "Кассир") Тогда
		ЗаполнитьЗначенияСвойств(Форма.Объект, Форма.СтруктураСостояниеКассовойСмены,,"Кассир");
	ИначеЕсли ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "Объект") Тогда
		ЗаполнитьЗначенияСвойств(Форма.Объект, Форма.СтруктураСостояниеКассовойСмены);
	КонецЕсли;
	
	   #КонецУдаления
	   #Вставка
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "Объект") Тогда
		если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма.Объект, "Склад") тогда
			Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма.Объект, "Кассир") Тогда
				если значениезаполнено(Форма.Объект.склад) тогда 
					Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
						ЗаполнитьЗначенияСвойств(Форма.Объект, Форма.СтруктураСостояниеКассовойСмены,,"Кассир, Склад");
					Иначе
						ЗаполнитьЗначенияСвойств(Форма.Объект, Форма.СтруктураСостояниеКассовойСмены,,"Кассир, Склад, Подразделение"); 
					КонецЕсли;
				иначе
					ЗаполнитьЗначенияСвойств(Форма.Объект, Форма.СтруктураСостояниеКассовойСмены,,"Кассир");
				конецесли;
			Иначе
				ЗаполнитьЗначенияСвойств(Форма.Объект, Форма.СтруктураСостояниеКассовойСмены,,"Склад");
			конецесли;
		Иначе
			ЗаполнитьЗначенияСвойств(Форма.Объект, Форма.СтруктураСостояниеКассовойСмены);
		конецесли;
	КонецЕсли;
	   #КонецВставки
	Если Не Форма.СтруктураСостояниеКассовойСмены.СменаОткрыта
		И Форма.ПраваДоступа.ОткрытьСмену Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ОткрытьКассовуюСмену", НСтр("ru = 'Открыть смену'"));
		Кнопки.Добавить("Отмена",               НСтр("ru = 'Отмена'"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОбработкаОповещения", ОписаниеОповещенияЗавершение);
		ДополнительныеПараметры.Вставить("ПараметрыКассыККМ", ПараметрыКассыККМ);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("УправлениеСостояниемСменыОбработкаКоманды", РозничныеПродажиКлиент, ДополнительныеПараметры),
			НСтр("ru = 'Перед выполнением операции требуется открыть новую кассовую смену.'"), Кнопки);
		Возврат;
		
	ИначеЕсли Не Форма.СтруктураСостояниеКассовойСмены.СменаОткрыта
		И Не Форма.ПраваДоступа.ОткрытьСмену Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Кассовая смена не открыта.'"));
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершение, Ложь);
		Возврат;
		
	КонецЕсли;
	
	Если Форма.СтруктураСостояниеКассовойСмены.Ошибка24Часа
		И Форма.ПраваДоступа.ОткрытьСмену
		И Форма.ПраваДоступа.ЗакрытьСмену Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ЗакрытьИОткрытьКассовуюСмену", НСтр("ru = 'Открыть смену'"));
		Кнопки.Добавить("Отмена",                       НСтр("ru = 'Отмена'"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОбработкаОповещения", ОписаниеОповещенияЗавершение);
		ДополнительныеПараметры.Вставить("ПараметрыКассыККМ", ПараметрыКассыККМ);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("УправлениеСостояниемСменыОбработкаКоманды", РозничныеПродажиКлиент, ДополнительныеПараметры),
			НСтр("ru = 'С момента открытия смены прошло более 24 часов. Перед выполнением операции требуется открыть новую кассовую смену.'"), Кнопки);
		Возврат;
		
	ИначеЕсли Не Форма.СтруктураСостояниеКассовойСмены.СменаОткрыта
		И (Не Форма.ПраваДоступа.ОткрытьСмену ИЛИ Не Форма.ПраваДоступа.ЗакрытьСмену) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'С момента открытия смены прошло более 24 часов. Перед выполнением операции требуется открыть новую кассовую смену.'"));
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершение, Ложь);
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершение, Истина);
	
КонецПроцедуры

&Вместо("УправлениеСостояниемСменыПослеОткрытияКассовойСмены")
Процедура Док_УправлениеСостояниемСменыПослеОткрытияКассовойСмены(Результат, ДополнительныеПараметры)
		Если Результат Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.ПараметрыКассыККМ) = Тип("Структура")
			Или ТипЗнч(ДополнительныеПараметры.ПараметрыКассыККМ) = Тип("ФиксированнаяСтруктура") Тогда
			КассаККМФискальноеУстройство = ДополнительныеПараметры.ПараметрыКассыККМ.КассаККМ;
		Иначе
			КассаККМФискальноеУстройство = ДополнительныеПараметры.ПараметрыКассыККМ;
		КонецЕсли;
		
		ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены = РозничныеПродажиВызовСервера.СостояниеКассовойСмены(КассаККМФискальноеУстройство);
		
		//-Альтерра ПроектЧеки, чтобы не очищались видцены и склад
		//Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект")
		//	И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма.Объект, "Кассир") Тогда
		//	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Кассир");
		//ИначеЕсли ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект") Тогда
		//	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены);
		//КонецЕсли;
		//+Альтерра
		
//		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект")
//			И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма.Объект, "Кассир") Тогда
//			ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Кассир, Склад, Подразделение");
//		ИначеЕсли ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект") Тогда
//			ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Кассир, Склад, Подразделение");
//		КонецЕсли;
		
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма, "Объект") Тогда
			если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма.Объект, "Склад") тогда
				Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДополнительныеПараметры.Форма.Объект, "Кассир") Тогда
					если значениезаполнено(ДополнительныеПараметры.Форма.Объект.склад) тогда 
						Если ТипЗнч(ДополнительныеПараметры.Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
							ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Кассир, Склад");
						Иначе
							ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Кассир, Склад, Подразделение"); 
						КонецЕсли;
					иначе
						ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Кассир");
					конецесли;
				Иначе
					ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены,,"Склад");
				конецесли;
			Иначе
				ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.Объект, ДополнительныеПараметры.Форма.СтруктураСостояниеКассовойСмены);
			конецесли;
		КонецЕсли;
		//-		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаОповещения, Истина);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаОповещения, Ложь);
		
	КонецЕсли;
КонецПроцедуры


&ИзменениеИКонтроль("ОткрытьКассовуюСмену")
Процедура Док_ОткрытьКассовуюСмену(ПараметрыКассыККМ, ОписаниеОповещенияЗавершение)
	#Вставка
		НаличиеПодключенногоОборудования = ДопМодуль.ПолучитьКассуККМ();
		Если НЕ НаличиеПодключенногоОборудования Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подключаемое оборудование удалено или не используется. Обратитесь в техническую поддержку.");
			Возврат;
		КонецЕсли; 
	
	#КонецВставки
		
	ПараметрыОповещенияЗавершенияОперации = Новый Структура;

	КассаККМ = Неопределено;
	КассаККМДляРазъезднойТорговли = Ложь;
	КассаККМБезПодключенияОборудования = Ложь;
	
	Если (ТипЗнч(ПараметрыКассыККМ) = Тип("фиксированнаяСтруктура")
		Или ТипЗнч(ПараметрыКассыККМ) = Тип("Структура"))
		И ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования Тогда
		
		КассаККМБезПодключенияОборудования = Истина;
		КассаККМ = ПараметрыКассыККМ.КассаККМ;
		КассаККМДляРазъезднойТорговли = ПараметрыКассыККМ.РазъезднаяТорговля;
		
	Иначе
		
		КассаККМБезПодключенияОборудования = Ложь;
		Если ТипЗнч(ПараметрыКассыККМ) = Тип("фиксированнаяСтруктура")
			Или ТипЗнч(ПараметрыКассыККМ) = Тип("Структура") Тогда
			ФискальноеУстройство = ПараметрыКассыККМ.ИдентификаторУстройства;
		Иначе
			ФискальноеУстройство = ПараметрыКассыККМ;
		КонецЕсли;
		
		ПараметрыОповещенияЗавершенияОперации.Вставить("ФискальноеУстройство", ФискальноеУстройство);
		ПараметрыОповещенияЗавершенияОперации.Вставить("РеквизитыКассира", РозничныеПродажиВызовСервера.РеквизитыКассира());
		ПараметрыОповещенияЗавершенияОперации.Вставить("РеквизитыАдресаМестаРасчетов", РозничныеПродажиВызовСервера.РеквизитыАдресаМестаРасчетов(ФискальноеУстройство));

		КассаККМ = РозничныеПродажиВызовСервера.КассаККМПоПодключаемомуОборудованияДляРМК(ФискальноеУстройство);
		Если ЗначениеЗаполнено(КассаККМ) Тогда
			ПараметрыКассыККМФискальногоУстройства = РозничныеПродажиВызовСервера.ПараметрыКассыККМ(КассаККМ);
			КассаККМДляРазъезднойТорговли = ПараметрыКассыККМФискальногоУстройства.РазъезднаяТорговля;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыОповещенияЗавершенияОперации.Вставить("КассаККМБезПодключенияОборудования", КассаККМБезПодключенияОборудования);
	ПараметрыОповещенияЗавершенияОперации.Вставить("КассаККМ", КассаККМ);	
	ПараметрыОповещенияЗавершенияОперации.Вставить("ПараметрыКассыККМ", ПараметрыКассыККМ);
	ПараметрыОповещенияЗавершенияОперации.Вставить("ОписаниеОповещенияЗавершение", ОписаниеОповещенияЗавершение);
	
	ОповещениеЗавершенияОперации = Новый ОписаниеОповещения("ОткрытьКассовуюСменуЗавершение", ЭтотОбъект, ПараметрыОповещенияЗавершенияОперации);
	Если КассаККМДляРазъезднойТорговли Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаЗапросаМестаРасчетов",
					ПараметрыОткрытияФормы,
					,
					,
					,
					,
					ОповещениеЗавершенияОперации,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеЗавершенияОперации, Неопределено);
	КонецЕсли;

КонецПроцедуры

