

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И  Не Ссылка.Проведен	Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИспользованиеИнтерваловДоставки.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ИспользованиеИнтерваловДоставки КАК ИспользованиеИнтерваловДоставки
		|ГДЕ 
		|    ИспользованиеИнтерваловДоставки.Интервал = &Интервал	
		|	И ИспользованиеИнтерваловДоставки.ДатаИспользования МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаИспользования, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаИспользования, ДЕНЬ)
		|	И ИспользованиеИнтерваловДоставки.Регистратор ССЫЛКА Документ.КорректировкаДоставокВИнтервалах
		|	И ИспользованиеИнтерваловДоставки.ДляРазгрузки = &ДляРазгрузки";
		Запрос.УстановитьПараметр("Интервал", Интервал);
		Запрос.УстановитьПараметр("ДатаИспользования",ДатаДействия);
		Запрос.УстановитьПараметр("ДляРазгрузки", ДляРазгрузки);
		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Следующий()Тогда   
			Отказ = Истина;                           
			ОбщегоНазначения.СообщитьПользователю("По данному инервалу на дату действия " + ДатаДействия + " уже создан документ " + Выборка.Регистратор,Выборка.Регистратор);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
		
		Движения.ИспользованиеИнтерваловДоставки.Записывать = Истина;
		Движение = Движения.ИспользованиеИнтерваловДоставки.Добавить(); 
		
		Движение.Период = ТекущаяДата();
	    Движение.ДатаИспользования = ДатаДействия;
		Движение.Интервал = Интервал;	
		Движение.ВидДоставки = Интервал.ВидДоставки;
		Движение.Подразделение = Интервал.Подразделение;
		
	  //Если ДляРазгрузки  Тогда 
	  //  	Движение.КоличествоСРазгрузкой = Интервал.МксКолДоставокСРазгрузкой - КоличествоДоставок; 
	  //  Иначе
	  //  	Движение.Количество = Интервал.КоличествоДоставок - КоличествоДоставок;
	  //  КонецЕсли;		
			
		Если ДляРазгрузки  Тогда 
			Движение.КоличествоСРазгрузкой = КоличествоДоставок; 
			Движение.ДляРазгрузки = Истина;
		Иначе
			Движение.Количество = КоличествоДоставок; 
		    Движение.ДляРазгрузки = Ложь;
		КонецЕсли;
			
	
КонецПроцедуры
