#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	УстановитьОграничениеДополнительногоСведения()
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеДополнительногоСведения()
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ(Свойство) КАК Свойство
					|ИЗ РегистрСведений.ДополнительныеСведения
					|ГДЕ ТипЗначения(Объект) = ТИП(Справочник.Номенклатура)";
    Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыВыбораДополнительногоСведения = Новый Массив();	
	
	ДоступныеДополнительныеСведения = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеДополнительныеСведения.Добавить(Выборка.Свойство);	
	КонецЦикла;
	
	Параметр = Новый ПараметрВыбора(
				"Отбор.Ссылка",
		    	    	Новый ФиксированныйМассив(ДоступныеДополнительныеСведения)
			);	
	
	ПараметрыВыбораДополнительногоСведения.Добавить(Параметр);
	
	Элементы.ДополнительноеСведениеКолонки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДополнительногоСведения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
    ИнициализироватьСканер();
	Если Объект.ВидПроверки = ПредопределенноеЗначение("Перечисление.ВидПроверкиЦенников.Попереоценке") Тогда
		Элементы.ТоварыНетЦенника.Заголовок = "Акт. Цен.";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
	ОтключитьСканер();

КонецПроцедуры

#КонецОбласти



#Область РаботаСоСканеромИШтрихкодами

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				МассивПараметров =  Параметр;
			иначе
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(Параметр);
				МассивПараметров.Добавить(Неопределено);
			конецесли;

			ДанныеШтрихкодов= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВМассив(МассивПараметров);
			Если ДанныеШтрихкодов.Количество() > 0 Тогда
			Штрихкод = ДанныеШтрихкодов[0].Штрихкод;
			
			ОбработатьШтрихкоды(Штрихкод);
		Иначе
			ПоказатьПредупреждение(, "Штрихкод неверного формата!", 5);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрихкодКамера(Команда)
			#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкодаКамера",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			ПоказатьПредупреждение(, "Сканирование не поддерживается!", 5);
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкодаКамера(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
		    СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		Если ПустаяСтрока(Штрихкод) Тогда
			ПоказатьПредупреждение(, "Не удалось прочитать штрихкод! Считайте штрихкод еще раз", 5);
			Возврат;
		КонецЕсли;
			
		
		ОбработатьШтрихкоды(Штрихкод);		

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(Штрихкод);
	
	
	Номенклатура = "";
	ДополнительноеСведение = "";
	ЦенаТекущая = 0;
	ПолучитьДанныеПоШтрихкоду(Штрихкод, Номенклатура, ДополнительноеСведение, ЦенаТекущая);
	
	ЕстьТовар = Ложь;
	НайденнаяСтрока = Неопределено;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура");
	СтруктураПоиска.Номенклатура = Номенклатура;
	МассивСтрок = Объект.Товары.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() > 0 Тогда
		ЕстьТовар = Истина;		
		НайденнаяСтрока = МассивСтрок[0];
		
		Если НайденнаяСтрока.Штрихкод = "" Тогда
			 НайденнаяСтрока.Штрихкод = Штрихкод;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ЕстьТовар Тогда
		                      
		Если Не НайденнаяСтрока.Проверено Тогда
		
			Текст = Строка(НайденнаяСтрока.Номенклатура) + Символы.ПС + "Текущая цена: "+ Формат(НайденнаяСтрока.ЦенаТекущая, "ЧДЦ=2");
			Если Строка(НайденнаяСтрока.ДополнительноеСведение) <> "" Тогда
				Текст = Текст + Символы.ПС + "Доп. сведение: " + Строка(НайденнаяСтрока.ДополнительноеСведение) 
			КонецЕсли;
			Текст = Текст + Символы.ПС + "Правильная цена на ценнике?";
		
			ДопПараметры = Новый Структура("НомерСтроки", НайденнаяСтрока.НомерСтроки);
			ОповещениеПослеЗакрытияВопроса = Новый ОписаниеОповещения("ПослеПроверкиСтроки", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеЗакрытияВопроса, Текст, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да);
		Иначе
			Текст = Строка(НайденнаяСтрока.Номенклатура) + Символы.ПС + "Текущая цена: "+ Формат(НайденнаяСтрока.ЦенаТекущая, "ЧДЦ=2");
			Если Строка(НайденнаяСтрока.ДополнительноеСведение) <> "" Тогда
				Текст = Текст + Символы.ПС + "Доп. сведение: " + Строка(НайденнаяСтрока.ДополнительноеСведение) 
			КонецЕсли;
			Текст = Текст + Символы.ПС + "Внести в список с расхождениями?";
		    Текст = "Номенклатура уже была проверена в документе!" + Символы.ПС + Текст; 
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Штрихкод", Штрихкод);
			ДопПараметры.Вставить("Номенклатура", Номенклатура);
			ДопПараметры.Вставить("ЦенаТекущая", ЦенаТекущая);
			ДопПараметры.Вставить("ДополнительноеСведение", ДополнительноеСведение);
			ОповещениеПослеЗакрытияВопроса = Новый ОписаниеОповещения("ВопросДобавлениеСтроки", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеЗакрытияВопроса, Текст, РежимДиалогаВопрос.ДаНетОтмена, 10, КодВозвратаДиалога.Да);

		КонецЕсли;	
		
	Иначе
		
		Если Номенклатура <> "" Тогда
			Если ЦенаТекущая <> 0 Тогда
				
			Текст = Строка(Номенклатура) + Символы.ПС + "Текущая цена: "+ Формат(ЦенаТекущая, "ЧДЦ=2");
			Если Строка(ДополнительноеСведение) <> "" Тогда
				Текст = Текст + Символы.ПС + "Доп. сведение: " + Строка(ДополнительноеСведение) 
			КонецЕсли;
			Текст = Текст + Символы.ПС + "Внести в список с расхождениями?";
		
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Штрихкод", Штрихкод);
			ДопПараметры.Вставить("Номенклатура", Номенклатура);
			ДопПараметры.Вставить("ЦенаТекущая", ЦенаТекущая);
			ДопПараметры.Вставить("ДополнительноеСведение", ДополнительноеСведение);
			ОповещениеПослеЗакрытияВопроса = Новый ОписаниеОповещения("ВопросДобавлениеСтроки", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеЗакрытияВопроса, Текст, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да);
				
			Иначе
				Текст = "У номенклатуры """ + Символы.ПС + Номенклатура +  """" + Символы.ПС + "нет цены по виду: " + Объект.ВидЦены + "!";
				ПоказатьПредупреждение(, Текст, 5);
			КонецЕсли;
			
		Иначе
			ПоказатьПредупреждение(, "Не удалось найти номенклатуру по штрихкоду!", 5);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДанныеПоШтрихкоду(Штрихкод, Номенклатура, ДополнительноеСведение, ЦенаТекущая)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаТекущая,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ДополнительныеСведения.Значение КАК ДополнительноеСведение		
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ШтрихкодыНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ШтрихкодыНоменклатуры.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ШтрихкодыНоменклатуры.Номенклатура.Ссылка = ДополнительныеСведения.Объект 
		|        	И ДополнительныеСведения.Свойство = &Свойство
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦены);
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Свойство", Объект.ДополнительноеСведениеКолонки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Номенклатура = "";
	ДополнительноеСведение = "";
	ЦенаТекущая = 0;	
	
	Если Выборка.Следующий() Тогда
		Номенклатура = Выборка.Номенклатура;
		ДополнительноеСведение = Выборка.ДополнительноеСведение;
		ЦенаТекущая = Выборка.ЦенаТекущая;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти



#Область Оповещения

&НаКлиенте
Процедура ПослеПроверкиСтроки(Результат, ДопПараметры) Экспорт
	
	ТекСтрока = Объект.Товары[ДопПараметры.НомерСтроки-1];
	ТекСтрока.Проверено = Истина;
	
	Если Результат = КодВозвратаДиалога.Да Или Результат = КодВозвратаДиалога.Таймаут Тогда
		ТекСтрока.ЕстьРасхождения = Ложь;
		ТекСтрока.НетЦенника = Ложь;
	Иначе
		ТекСтрока.ЕстьРасхождения = Истина;
		ТекСтрока.НетЦенника = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросДобавлениеСтроки(Результат, ДопПараметры) Экспорт
	
		НоваяСтрока = Объект.Товары.Добавить();
		ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();	
		
		НоваяСтрока.Штрихкод = ДопПараметры.Штрихкод;
		НоваяСтрока.Номенклатура = ДопПараметры.Номенклатура;
		НоваяСтрока.ЦенаТекущая = ДопПараметры.ЦенаТекущая;
		НоваяСтрока.ДополнительноеСведение = ДопПараметры.ДополнительноеСведение;   
		НоваяСтрока.Проверено = Истина;  
		
	Если Результат = КодВозвратаДиалога.Да Или Результат = КодВозвратаДиалога.Таймаут Тогда
		
		НоваяСтрока.НетЦенника = Истина;
		НоваяСтрока.ЕстьРасхождения = Истина;
	Иначе
		НоваяСтрока.НетЦенника = Ложь;
		НоваяСтрока.ЕстьРасхождения = Ложь;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти




#Область РаботаСТабличнойЧастьюТОвары

&НаКлиенте
Процедура ВернутьсяКТЧ(Команда)
	Элементы.РедактированиеДокументаНаТСД.Видимость=Истина;
	Элементы.РедактированиеСтрокиНаТСД.Видимость=Ложь;
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьЦенуИСвойство(ВидЦены, ДополнительноеСведениеКолонки, Номенклатура, ЦенаТекущая, ДополнительноеСведение)
	Запрос = Новый Запрос;
	Запрос.Текст =			
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаТекущая,
		|	ДополнительныеСведения.Значение КАК ДополнительноеСведение		
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура.Ссылка = ДополнительныеСведения.Объект 
		|        	И ДополнительныеСведения.Свойство = &Свойство
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
		
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Свойство", ДополнительноеСведениеКолонки);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда	
		ЦенаТекущая = Выборка.ЦенаТекущая;	
		ДополнительноеСведение = Выборка.ДополнительноеСведение;	
	Иначе
		ЦенаТекущая = 0;	
		ДополнительноеСведение = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();	
	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
	
	Элементы.РедактированиеДокументаНаТСД.Видимость=Ложь;
	Элементы.ВыборНоменклатуры.Видимость = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатура1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.РедактированиеСтрокиНаТСД.Видимость=Истина;
	Элементы.ВыборНоменклатуры.Видимость = Ложь;
	
	Номенклатура = "";
	ДополнительноеСведение = "";
	//ЦенаНаЦеннике = 0;
	ЦенаТекущая = 0;
	НетЦенника = Ложь;
	ЕстьРасхождения = Ложь;
	
	
	Номенклатура = Элементы.СписокНоменклатура.ТекущиеДанные.Ссылка;
	ПолучитьЦенуИСвойство(Объект.ВидЦены, Объект.ДополнительноеСведениеКолонки, Номенклатура, ЦенаТекущая, ДополнительноеСведение);	

	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.ЦенаТекущая = ЦенаТекущая;
	НоваяСтрока.ДополнительноеСведение = ДополнительноеСведение;

	ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;

	ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД);

	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД)
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
				
		Если ТипЗнч(ТекущаяСтрокаТСД) <> Тип("Неопределено") Тогда
			
			ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
			
			Номенклатура = "";
			//ЦенаНаЦеннике = 0;
			ЦенаТекущая = 0;
			НетЦенника = Ложь;
			ЕстьРасхождения = Ложь;
					
			Если ЭлементСписка <> Неопределено Тогда
				Элементы.РедактированиеДокументаНаТСД.Видимость=Ложь;
				Элементы.РедактированиеСтрокиНаТСД.Видимость=Истина;
				Номенклатура = ЭлементСписка.Номенклатура;
				ЦенаТекущая = ЭлементСписка.ЦенаТекущая;
				//ЦенаНаЦеннике = ЭлементСписка.ЦенаНаЦеннике;
				НетЦенника = ЭлементСписка.НетЦенника;
				ЕстьРасхождения = ЭлементСписка.ЕстьРасхождения;
			Конецесли;
			
		Иначе
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
			КонецЕсли;
			Сообщить("Штрихкод не найден!");
		КонецЕсли;
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НетЦенникаПриИзменении(Элемент)
	СтрокаИзменения = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
	СтрокаИзменения.НетЦенника = НетЦенника; 
	СтрокаИзменения.Проверено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЕстьРасхожденияПриИзменении(Элемент)
	СтрокаИзменения = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
	СтрокаИзменения.ЕстьРасхождения = ЕстьРасхождения; 
	СтрокаИзменения.Проверено = Истина;
КонецПроцедуры


#КонецОбласти
