////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент: клиент
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.БазоваяФункциональность

// См. ОбщегоНазначенияКлиентПереопределяемый.ПослеНачалаРаботыСистемы
Асинх Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	ПараметрыПриЗапускеПрограммы = ПараметрыПриложения["СтандартныеПодсистемы.ПараметрыПриЗапускеПрограммы"];
	Если ПараметрыПриЗапускеПрограммы.Свойство("СкрытьРабочийСтолПриНачалеРаботыСистемы") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если Не ПараметрыРаботыКлиента.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиАвторизацииИзБазы = Ждать ПрочитатьНастройкиАвторизацииАсинх();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ПослеНачалаРаботыСистемыЗавершение",
		ЭтотОбъект,
		НастройкиАвторизацииИзБазы);
	
	ДлительнаяОперация = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПодключитьсяИПолучитьВерсиюСервисаАсинхронно(
		НастройкиАвторизацииИзБазы.ИмяПользователя,
		НастройкиАвторизацииИзБазы.Пароль);
	ВыполнитьЗапросАсинхронно(
		ЭтотОбъект,
		ДлительнаяОперация,
		ОповещениеОЗавершении);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.БазоваяФункциональность

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

// Возвращает сохраненный ранее признак состоявшегося показа окна авторизации.
//
// Возвращаемое значение:
//   Булево - Истина, если авторизация была предложена в этом сеансе, и Ложь в противном случае.
//
Функция АвторизацияПредложена() Экспорт
	
	Результат = (ПараметрыПриложения["ИнтеграцияС1СДокументооборот.АвторизацияПредложена"] = Истина);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПереопределяемый.ПриОпределенииПредложенияАвторизации(
		Результат);
	
	Возврат Результат;
	
КонецФункции

// Открывает форму для указания значения дополнительного реквизита.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, на которой осуществляется работа с дополнительным реквизитом
//     и из которой вызывается форма заполнения.
//   Элемент - ПолеФормы - элемент формы, в который будет помещено указанной значение.
//   СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ВыбратьЗначениеДополнительногоРеквизита(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СписокДоступныхТипов = Элемент.Родитель.ТекущиеДанные.СписокДоступныхТипов;
	
	Если СписокДоступныхТипов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокДоступныхТипов.Количество() > 1 Тогда
		
		ЗаголовокФормы = НСтр("ru = 'Тип реквизита ""%Свойство%""'");
		ЗаголовокФормы = СтрЗаменить(ЗаголовокФормы,"%Свойство%",Элемент.Родитель.ТекущиеДанные.Свойство);
		ПараметрыФормы = Новый Структура("СписокДоступныхТипов, ЗаголовокФормы",
			СписокДоступныхТипов,
			ЗаголовокФормы);
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Форма", Форма);
		ПараметрыОповещения.Вставить("Элемент", Элемент);
		
		Оповещение = Новый ОписаниеОповещения(
			"ВыбратьЗначениеДополнительногоРеквизитаВыборТипаЗавершение",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			ПараметрыОповещения);
		ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.ВыборОдногоТипаИзСоставногоТипа";
		
		ОткрытьФорму(ИмяФормы, ПараметрыФормы, Форма,,,, Оповещение);
		
	Иначе
		
		ИмяТипа = СписокДоступныхТипов[0].Значение.XDTOClassName;
		ВыбратьЗначениеДополнительногоРеквизитаОбработка(ИмяТипа, Форма, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

// Универсальный метод для выбора произвольного значения в поле ввода.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, из которой вызывается команда.
//   Элемент - ПолеФормы - поле, куда должно быть помещено выбранное значение.
//   Типы - СписокЗначений из Тип - тип значения, которое требуется выбрать.
//        - Массив из Тип
//   ПараметрыВыбораЗначения - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыВыбораЗначенияДО
//
Процедура ВыбратьЗначениеРеквизитаДО(Форма, Элемент, Типы, ПараметрыВыбораЗначения) Экспорт
	
	Если Типы.Количество() = 1 Тогда
		Если ТипЗнч(Типы) = Тип("Массив") Тогда
			Значение = Типы[0];
		Иначе
			Значение = Типы[0].Значение;
		КонецЕсли;
		ВыбратьЗначениеРеквизитаДОЗавершение(Значение, ПараметрыВыбораЗначения);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ВыбратьЗначениеРеквизитаДОЗавершение",
			ЭтотОбъект,
			ПараметрыВыбораЗначения);
		Если ТипЗнч(Типы) = Тип("Массив") Тогда
			СписокТипов = Новый СписокЗначений;
			СписокТипов.ЗагрузитьЗначения(Типы);
		Иначе
			СписокТипов = Типы;
		КонецЕсли;
		
		Форма.ПоказатьВыборИзСписка(ОписаниеОповещения, СписокТипов, Элемент);
	КонецЕсли;
	
КонецПроцедуры

// Универсальный метод для выбора произвольного значения в поле ввода.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, из которой вызывается команда.
//   Элемент - ПолеФормы - поле, куда должно быть помещено выбранное значение.
//   Тип - ОписаниеТипов - тип значения, которое требуется выбрать.
//   Представление - Строка - представление реквизита, для которого выбирается значение.
//   ЗначениеРеквизита - Произвольный - текущее значение в поле ввода.
//   Оповещение - ОписаниеОповещения - вызывает процедуру формы, в которую передается выбранное значение.
//
Процедура ВыбратьЗначениеРеквизитаИС(Форма, Элемент, Тип, Представление, ЗначениеРеквизита, Оповещение) Экспорт
	
	Типы = Тип.Типы();
	
	ПараметрыВыбратьЗначение = Новый Структура;
	ПараметрыВыбратьЗначение.Вставить("ОписаниеТипа", Тип);
	ПараметрыВыбратьЗначение.Вставить("ТекстРедактирования", Элемент.ТекстРедактирования);
	ПараметрыВыбратьЗначение.Вставить("Представление", Представление);
	ПараметрыВыбратьЗначение.Вставить("ЗначениеРеквизита", ЗначениеРеквизита);
	ПараметрыВыбратьЗначение.Вставить("Оповещение", Оповещение);
	
	Если Типы.Количество() = 1 Тогда
		ВыбратьЗначениеРеквизитаИСЗавершениеВыбораТипа(Типы[0], ПараметрыВыбратьЗначение);
	Иначе
		ОповещениеВыбратьЗначение = Новый ОписаниеОповещения(
			"ВыбратьЗначениеРеквизитаИСЗавершениеВыбораТипа",
			ЭтотОбъект,
			ПараметрыВыбратьЗначение);
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(Типы);
		Форма.ПоказатьВыборИзСписка(ОповещениеВыбратьЗначение, СписокТипов, Элемент);
	КонецЕсли;
	
КонецПроцедуры

// Начинает длительную операцию запроса к сервису 1С:Документооборот, а также отображает на форме признак выполнения
// длительной операции.
//
// Параметры:
//   Владелец - ФормаКлиентскогоПриложения - форма, из которой вызывается команда.
//            - ОбщийМодуль - клиентский модуль, из которого вызывается команда.
//   ДлительнаяОперация - см. ДлительныеОперации.ВыполнитьВФоне
//   ОповещениеОЗавершении - ОписаниеОповещения - вызывает процедуру формы, в которую передается результат запроса.
//   ВыводитьОкноОжидания - Булево - если Истина, то открыть окно ожидания с визуальной индикацией длительной операции.
//   ТекстСообщения - Строка - текст сообщения, выводимый на форме ожидания.
//   СкрыватьИнтерфейс - Булево - если окно ожидания не выводится, то данный параметр указывает нужно ли использовать
//     переключение страниц, который скроет весь интерфейс, либо же нужно не скрывать интерфейс, а сделать видимой
//     группу элементов длительной операции.
//
Процедура ВыполнитьЗапросАсинхронно(Владелец, ДлительнаяОперация, ОповещениеОЗавершении,
		ВыводитьОкноОжидания = Ложь, ТекстСообщения = Неопределено, СкрыватьИнтерфейс = Истина) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Выполняется" И ДлительнаяОперация.ИдентификаторЗадания = Неопределено Тогда
		// К идентификатору привязаны обработчики ожидания завершения фонового задания.
		ДлительнаяОперация.ИдентификаторЗадания = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТипЗнч(Владелец) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Владелец);
		Элементы = Владелец.Элементы;
		Если Не ВыводитьОкноОжидания Тогда
			
			Если СкрыватьИнтерфейс И (Элементы.Найти("ГруппаСтраницыПодключения") <> Неопределено) Тогда
				
				Элементы.ГруппаСтраницыПодключения.ТекущаяСтраница = Элементы.СтраницаЗагрузкаИзДО;
				Если ЗначениеЗаполнено(ТекстСообщения) Тогда
					СтарыйЗаголовок = Элементы.ОписаниеЗагрузкаИзДОСтраница.Заголовок;
					Элементы.ОписаниеЗагрузкаИзДОСтраница.Заголовок = СтрШаблон("%1..", ТекстСообщения);
				КонецЕсли;
				
			ИначеЕсли Элементы.Найти("ГруппаЗагрузкаИзДО") <> Неопределено Тогда
				
				Элементы.ГруппаЗагрузкаИзДО.Видимость = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ПараметрыОжидания.ТекстСообщения = ТекстСообщения;
	Иначе
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Получение данных из 1С:Документооборота.'");
	КонецЕсли;
	ПараметрыОжидания.ВыводитьОкноОжидания = ВыводитьОкноОжидания;
	
	ОповещениеДлительнойОперации = Новый ОписаниеОповещения(
		"ВыполнитьЗапросАсинхронноЗавершение",
		ЭтотОбъект,
		ДлительнаяОперация.ИдентификаторЗадания);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Владелец", Владелец);
	ПараметрыОповещения.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	ПараметрыОповещения.Вставить("ВыводитьОкноОжидания", ВыводитьОкноОжидания);
	ПараметрыОповещения.Вставить("СкрыватьИнтерфейс", СкрыватьИнтерфейс);
	ПараметрыОповещения.Вставить("СтарыйЗаголовок", СтарыйЗаголовок);
	
	ОбработчикиОжидания = АктивныеОбработчикиОжиданияФоновогоЗадания();
	ОбработчикиОжиданияЗадания = ОбработчикиОжидания[ДлительнаяОперация.ИдентификаторЗадания];
	Если ОбработчикиОжиданияЗадания = Неопределено Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ПараметрыОповещения);
		ОбработчикиОжидания.Вставить(ДлительнаяОперация.ИдентификаторЗадания, МассивПараметров)
	Иначе
		ОбработчикиОжиданияЗадания.Добавить(ПараметрыОповещения);
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеДлительнойОперации, ПараметрыОжидания);
	
КонецПроцедуры

// Формирует и выводит на экран печатные формы.
//
// Параметры:
//   ИмяМенеджераПечати - Строка - менеджер печати для печатаемых объектов;
//   ИменаМакетов - Строка - идентификаторы печатных форм;
//   МассивОбъектов - ЛюбаяСсылка
//                  - Массив из ЛюбаяСсылка - объекты печати;
//   ВладелецФормы - ФормаКлиентскогоПриложения - форма, из которой выполняется печать;
//
Процедура ВыполнитьКомандуПечати(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ВладелецФормы) Экспорт
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить(
		"ИнтеграцияС1СДокументооборот_ПараметрыДлительнойОперации",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПараметрыДлительнойОперации());
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	МодульУправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		ИмяМенеджераПечати,
		ИменаМакетов,
		МассивОбъектов,
		ВладелецФормы,
		ПараметрыПечати);
	
КонецПроцедуры

// Выполняет подключаемую команду интеграции с 1С:Документооборотом из формы объекта или списка.
//
// Параметры:
//   Команда - КомандаФормы - вызванная команда.
//   Форма - ФормаКлиентскогоПриложения - форма, из которой вызывается команда.
//   Источник - ДанныеФормыСтруктура, ТаблицаФормы - данные, уточняющие параметр команды, содержат ссылку на объект ИС.
//
Процедура ВыполнитьПодключаемуюКомандуИнтеграции(Команда, Форма, Источник) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Команда", Команда);
	Параметры.Вставить("Форма", Форма);
	Параметры.Вставить("Источник", Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВыполнитьПодключаемуюКомандуИнтеграцииЗавершение",
		ЭтотОбъект,
		Параметры);
	ПроверитьПодключение(
		ОписаниеОповещения,
		ЭтотОбъект,
		Истина);
	
КонецПроцедуры

// Продолжает выполнение подключаемой команды интеграции после проверки подключения.
//
// Параметры:
//   Результат - Булево - Истина, если подключение успешно.
//   Параметры - Структура:
//     * Команда - КомандаФормы - вызванная команда.
//     * Форма - ФормаКлиентскогоПриложения - форма, из которой вызывается команда.
//     * Источник - ТаблицаФормы
//                - ДанныеФормыСтруктура:
//         ** Ссылка - ОпределяемыйТип.ИнтеграцияС1СДокументооборотВсеСсылкиПереопределяемый
//
Процедура ВыполнитьПодключаемуюКомандуИнтеграцииЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Параметры.Команда;
	Форма = Параметры.Форма;
	Источник = Параметры.Источник;
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		МодульИнтеграцияС1СДокументооборотКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотКлиент");
		МодульИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграцииЗавершение(
			Команда,
			Форма,
			Источник);
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		МодульИнтеграцияС1СДокументооборот3Клиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборот3Клиент");
		МодульИнтеграцияС1СДокументооборот3Клиент.ВыполнитьПодключаемуюКомандуИнтеграцииЗавершение(
			Команда,
			Форма,
			Источник);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет записан ли объект интегрированной системы. Если не записан - предлагает пользователю записать.
//
// Параметры:
//   СсылкаНаОбъектИС - ЛюбаяСсылка - проверяемый объект ИС.
//   ФормаОбъектаИС - ФормаКлиентскогоПриложения - форма, из которой вызвана команда.
//   ОповещениеПродолжения - ОписаниеОповещения - действие, вызываемое после проверки.
//   Действие - Строка - наименование действия.
//
Асинх Процедура ВыполнитьПроверкуЗаписиИПродолжить(Знач СсылкаНаОбъектИС, Знач ФормаОбъектаИС,
		Знач ОповещениеПродолжения, Знач Действие) Экспорт
	
	Если СсылкаНаОбъектИС.Пустая() Тогда
		
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Данные еще не записаны.
			|Выполнение действия ""%1"" возможно только после записи данных.'"),
			Действие);
		
		МожноЗадатьВопрос = Истина;
		Если ФормаОбъектаИС = Неопределено Тогда
			МожноЗадатьВопрос = Ложь;
		Иначе
			// Проверим можем ли определить основной реквизит формы.
			РеквизитыФормы = Новый Структура("Объект", Неопределено);
			ЗаполнитьЗначенияСвойств(РеквизитыФормы, ФормаОбъектаИС);
			Если РеквизитыФормы.Объект = Неопределено Тогда
				МожноЗадатьВопрос = Ложь;
			Иначе
				ОбъектФормы = РеквизитыФормы.Объект; // ДокументОбъект
				Если ТипЗнч(ОбъектФормы.Ссылка) <> ТипЗнч(СсылкаНаОбъектИС) Тогда
					МожноЗадатьВопрос = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если МожноЗадатьВопрос = Ложь Тогда
			// Ничего сделать не сможем.
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
		КонецЕсли;
		
		// Предложим пользователю автоматически записать объект ИС и продолжить.
		ДополнительныеПараметры = Новый Структура("ФормаОбъектаИС, ОповещениеПродолжения",
			ФормаОбъектаИС,
			ОповещениеПродолжения);
		ТекстВопроса = СтрШаблон(
			НСтр("ru = '%1
			|Данные будут записаны.'"),
			ТекстПредупреждения);
		ПараметрыВопросаДаНет = ПараметрыВопросаДаНет(КодВозвратаДиалога.Да);
		ПараметрыВопросаДаНет.ТекстКнопкиДа = НСтр("ru = 'ОК'");
		ПараметрыВопросаДаНет.ТекстКнопкиНет = НСтр("ru = 'Отмена'");
		Ответ = Ждать ПоказатьВопросДаНетАсинх(
			ТекстВопроса,
			ПараметрыВопросаДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Форма = ДополнительныеПараметры.ФормаОбъектаИС;
			Форма.Записать();
			ОбъектФормы = Форма.Объект; // ДокументОбъект
			Если Не ОбъектФормы.Ссылка.Пустая() И Не Форма.Модифицированность Тогда
				ВыполнитьОбработкуОповещения(
					ДополнительныеПараметры.ОповещениеПродолжения,
					ОбъектФормы.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		// Вопрос пользователю не нужен.
		ВыполнитьОбработкуОповещения(ОповещениеПродолжения, СсылкаНаОбъектИС);
	КонецЕсли;
	
КонецПроцедуры

// Определяет, встроены ли в конфигурации модули БИД, предназначенные для интеграции с 1С:Документооборотом редакции 2.
//
// Возвращаемое значение:
//   Булево
//
Функция ЕстьПодсистемаДО2() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ПодсистемаСуществует(
		"ИнтеграцияС1СДокументооборотом.ИнтеграцияС1СДокументооборотомРедакции2");
	
КонецФункции

// Определяет, встроены ли в конфигурации модули БИД, предназначенные для интеграции с 1С:Документооборотом редакции 3.
//
// Возвращаемое значение:
//   Булево
//
Функция ЕстьПодсистемаДО3() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ПодсистемаСуществует(
		"ИнтеграцияС1СДокументооборотом.ИнтеграцияС1СДокументооборотомРедакции3");
	
КонецФункции

// Записывает изменения объекта в Документообороте в фоновом задании.
//
// Параметры:
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   ОбъектСтрока - Строка - строковое представление объекта XDTO с сохраняемыми данными.
//   ОповещениеОЗавершении - ОписаниеОповещения - вызывает процедуру формы после записи объекта.
//
Процедура ЗаписатьОбъектАсинхронно(УникальныйИдентификаторФормы, ОбъектСтрока, ОповещениеОЗавершении) Экспорт
	
	ДлительнаяОперация = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЗаписатьОбъектАсинхронно(
		УникальныйИдентификаторФормы,
		ОбъектСтрока);
	
	ВыполнитьЗапросАсинхронно(
		ЭтотОбъект,
		ДлительнаяОперация,
		ОповещениеОЗавершении,
		Истина,
		НСтр("ru = 'Выполняется запись.'"),
		Ложь);
	
КонецПроцедуры

// Выполняет поиск связанного объекта ДО, при необходимости создавая его на основании объекта ИС
// с заполнением по правилам интеграции, если подходящее правило существует.
//
// Параметры:
//   ОбъектИС - ОпределяемыйТип.ИнтеграцияС1СДокументооборотВсеСсылкиПереопределяемый - объект ИС,
//     для которого разыскивается связанный объект ДО.
//   ОписаниеОповещения - ОписаниеОповещения - обработчик, вызываемый после создания с
//     передачей в качестве параметра Структуры (ID, type, name).
//   ПолучатьНДПС - Булево - требуется получить настройки доступности по состоянию на стороне Документооборота.
//   ИспользоватьПриоритетныеПравила - Булево - нужно ли задавать вопрос пользователю при создании нового объекта ДО
//     по правилам интеграции, в случае если для объекта ИС настроено несколько различных правил интеграции,
//     или нужно использовать наиболее приоритетное по ключевым реквизитам правило. Параметр используется только в
//     случае интеграции с ДО 3.
//   ЗадаватьВопросОПереносеФайлов - Булево - признак того требуется ли задавать вопрос о переносе файлов из ИС в ДО
//      после добавления новой связи.
//
Процедура НачатьПоискСвязанногоОбъектаДО(ОбъектИС, ОписаниеОповещения, ПолучатьНДПС = Ложь,
		ИспользоватьПриоритетныеПравила = Ложь, ЗадаватьВопросОПереносеФайлов = Истина) Экспорт
	
	СвязанныйОбъектДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеОбъектаДОПоВнешнемуОбъекту(
		ОбъектИС,,
		ПолучатьНДПС);
	
	Если СвязанныйОбъектДО <> Неопределено Тогда // Найден.
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, СвязанныйОбъектДО);
		Возврат;
	КонецЕсли;
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		МодульИнтеграцияС1СДокументооборотКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотКлиент");
		МодульИнтеграцияС1СДокументооборотКлиент.НачатьСозданиеСвязанногоОбъектаДО(ОбъектИС, ОписаниеОповещения);
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		МодульИнтеграцияС1СДокументооборот3Клиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборот3Клиент");
		МодульИнтеграцияС1СДокументооборот3Клиент.НачатьСозданиеСвязанногоОбъектаДО(
			ОбъектИС,
			ОписаниеОповещения,
			ИспользоватьПриоритетныеПравила,
			ЗадаватьВопросОПереносеФайлов);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет реквизиты формы по выбранному значению.
//
// Параметры:
//   Реквизит - Строка - строка с именем реквизита формы.
//   ВыбранноеЗначение - Строка, Структура - выбранное значение.
//   СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//   ФормаВладелец - ФормаКлиентскогоПриложения - форма, содержащая заполняемый реквизит.
//   ЭтоТаблица - Булево - признак, указывающий на то что заполнить требуется реквизит строки табличной части.
//   Элемент - ПолеФормы - поле табличной части, в которое пользователь вводит значение.
//   УстанавливатьМодифицированность - Булево - устанавливать модифицированность формы-владельца.
//
Процедура ОбработкаВыбораДанныхДляАвтоПодбора(Реквизит, ВыбранноеЗначение, СтандартнаяОбработка, ФормаВладелец,
		ЭтоТаблица = Ложь, Элемент = Неопределено, УстанавливатьМодифицированность = Истина) Экспорт
	
	БылиИзменения = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ВыбранноеЗначение.Свойство("isNotAvailableAccordingCommunicationRules")
				И ВыбранноеЗначение.isNotAvailableAccordingCommunicationRules = Истина Тогда
			МодульИнтеграцияС1СДокументооборот3Клиент =
				ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияС1СДокументооборот3Клиент");
			МодульИнтеграцияС1СДокументооборот3Клиент.ПоказатьНарушениеПравилКоммуникаций();
			Возврат;
		КонецЕсли;
		
		Если Не ВыбранноеЗначение.Свойство("presentation") Тогда
			ВыбранноеЗначение.Вставить("presentation", ВыбранноеЗначение.name);
		КонецЕсли;
		
		Результат = Новый Структура;
		Результат.Вставить(Реквизит, ВыбранноеЗначение.name);
		Результат.Вставить(Реквизит + "ID", ВыбранноеЗначение.ID);
		Результат.Вставить(Реквизит + "Тип", ВыбранноеЗначение.type);
		Результат.Вставить(Реквизит + "Представление", ВыбранноеЗначение.presentation);
		Если ЭтоТаблица Тогда
			ЗаполнитьЗначенияСвойств(СтрокаПоляТабличнойЧасти(Элемент), Результат);
		Иначе
			ЗаполнитьЗначенияСвойств(ФормаВладелец, Результат);
		КонецЕсли;
		БылиИзменения = Истина;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		Если ЭтоТаблица Тогда
			СтрокаПоляТабличнойЧасти(Элемент)[Реквизит] = ВыбранноеЗначение;
		Иначе
			ФормаВладелец[Реквизит] = ВыбранноеЗначение;
		КонецЕсли;
		БылиИзменения = Истина;
	КонецЕсли;
	
	Если БылиИзменения Тогда
		Если УстанавливатьМодифицированность Тогда
			ФормаВладелец.Модифицированность = Истина;
		КонецЕсли;
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Реквизит", Реквизит);
		ПараметрыОповещения.Вставить("ЭтоТаблица", ЭтоТаблица);
		ПараметрыОповещения.Вставить("Элемент", Элемент);
		Оповестить("Документооборот_ВыборДанныхДляАвтоПодбора", ПараметрыОповещения, ФормаВладелец);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет выполнена ли длительная операция.
//
// Параметры:
//   Результат - см. ДлительныеОперации.ОперацияВыполнена
//   НужноОбработатьФорму - Булево - неявно возвращаемое значение, Истина, в случае если требуется обработать форму.
//   ВыводитьПодробноеПредставлениеОшибки - Булево - в случае ошибки требуется вызвать
//     исключение с подробным представлением.
//
// Возвращаемое значение:
//   Булево - Истина, если длительная операция выполнена, Ложь, если операция еще выполняется или возникла ошибка.
//
Функция ОперацияВыполнена(Результат, НужноОбработатьФорму = Ложь, ВыводитьПодробноеПредставлениеОшибки = Ложь) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Возврат Истина;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Если ВыводитьПодробноеПредставлениеОшибки Тогда
			ПредставлениеОшибки = Результат.ПодробноеПредставлениеОшибки;
		Иначе
			ПредставлениеОшибки = Результат.КраткоеПредставлениеОшибки;
		КонецЕсли;
		НужноОбработатьФорму = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.НужноОбработатьФорму(
			ПредставлениеОшибки);
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Создает оповещение при добавлении связи на клиенте.
//
// Параметры:
//   ID - Строка - идентификатор объекта Документооборота.
//   Тип - Строка - тип XDTO объекта Документооборота.
//   СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект интегрированной системы.
//   ЗадаватьВопросОПереносеФайлов - Булево - признак того требуется ли задавать вопрос о переносе файлов из ИС в ДО
//     после добавления новой связи.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура Оповестить_ДобавлениеСвязи(ID, Тип, СсылкаНаОбъект, ЗадаватьВопросОПереносеФайлов = Истина,
		УникальныйИдентификаторФормы = Неопределено) Экспорт

	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ID", ID);
	ПараметрыОповещения.Вставить("Тип", Тип);
	ПараметрыОповещения.Вставить("Объект", СсылкаНаОбъект);
	ПараметрыОповещения.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	
	Оповестить("Документооборот_ДобавлениеСвязи", ПараметрыОповещения);
	
	Если ЗадаватьВопросОПереносеФайлов Тогда
		ПараметрыПереносаФайлов =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПараметрыПереносаФайловВДО(
				ПараметрыОповещения);
		Если ПараметрыПереносаФайлов.НужноЗадатьВопросОПереносеФайловВДО
				И (ПараметрыПереносаФайлов.СостояниеРазрешаетДобавлениеФайла
					Или ПараметрыПереносаФайлов.СостояниеРазрешаетДобавлениеСканКопии) Тогда
			МодульИнтеграцияС1СДокументооборот3Клиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
				"ИнтеграцияС1СДокументооборот3Клиент");
			МодульИнтеграцияС1СДокументооборот3Клиент.ЗадатьВопросОПереносеФайловВДО(
				ПараметрыПереносаФайлов,,
				УникальныйИдентификаторФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Создает оповещение при удалении связи на клиенте.
//
// Параметры:
//   ID - Строка - идентификатор объекта Документооборота.
//   Тип - Строка - тип XDTO объекта Документооборота.
//   СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект системы.
//
Процедура Оповестить_УдалениеСвязи(ID, Тип, СсылкаНаОбъект) Экспорт

	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ID", ID);
	ПараметрыОповещения.Вставить("Тип", Тип);
	ПараметрыОповещения.Вставить("Объект", СсылкаНаОбъект);
	
	Оповестить("Документооборот_УдалениеСвязи", ПараметрыОповещения);
	
КонецПроцедуры

// Устанавливает отбор при выборе объекта ДО, связанного с объектом ИС.
//
// Параметры:
//   СвязываемыйОбъект - ЛюбаяСсылка - объект ИС, связываемый с объектом ДО.
//   ТипОбъектаДокументооборота - Строка - тип выбираемого объекта ДО.
//   ВидДокументаДО - Структура - заполняется для объектов ДО типа Документ:
//     * Значение - Строка - наименование вида документа.
//     * ЗначениеID - Строка - идентификатор вида документа.
//
// Возвращаемое значение:
//   Неопределено, Структура - структура отбора, накладываемого перед предъявлением пользователю:
//     * documentType - Неопределено
//                    - Структура - заполняется для объектов ДО типа Документ:
//       ** Значение - Строка - наименование вида документа.
//       ** ЗначениеID - Строка - идентификатор вида документа.
//
Функция ОтборПриВыбореСвязанногоОбъекта(СвязываемыйОбъект, ТипОбъектаДокументооборота,
		ВидДокументаДО = Неопределено) Экспорт
	
	Отбор = Неопределено;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПереопределяемый.ПриУстановкеОтбораПриВыбореСвязанногоОбъекта(
		СвязываемыйОбъект,
		ТипОбъектаДокументооборота,
		Отбор);
	
	Если ЗначениеЗаполнено(ВидДокументаДО) Тогда
		Если Отбор = Неопределено Тогда
			Отбор = Новый Структура;
		КонецЕсли;
		Отбор.Вставить("documentType", ВидДокументаДО);
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

// Открывает нужную версию формы "Задачи мне", в зависимости от того какая редакция 1С:Документооборот используется.
//
// Параметры:
//   Владелец - ОкноКлиентскогоПриложения , ФормаКлиентскогоПриложения - форма или элемент управления другой формы.
//   Уникальность - Произвольный - ключ, значение которого будет использоваться для поиска уже открытых форм.
//   Окно - ОкноКлиентскогоПриложения - окно приложения, в котором будет открыта форма.
//
Процедура ОткрытьЗадачиМне(Владелец, Уникальность, Окно) Экспорт
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ЗадачиМне";
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот3.Форма.ЗадачиМне";
	Иначе
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормы,, Владелец, Уникальность, Окно);
	
КонецПроцедуры

// Открывает навигационную ссылку в программе, которая ассоциирована с протоколом навигационной ссылки.
// Допустимые протоколы: http, https, e1c, v8help, mailto, tel, skype.
//
// Параметры:
//   НавигационнаяСсылка - Строка - ссылка, которую требуется открыть.
//
Процедура ОткрытьНавигационнуюСсылку(Знач НавигационнаяСсылка) Экспорт
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылка);
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылка);
	
КонецПроцедуры

// Открывает объект Документооборота.
//
// Параметры:
//   ТипОбъекта - Строка - тип объекта XDTO Документооборота.
//   ID - Строка - идентификатор объекта Документооборота.
//   ВладелецФормы - Произвольный - произвольное значение, устанавливаемое в качестве владельца формы.
//   ДополнительныеПараметры - Структура - параметры, передаваемые в открываемый объект.
//   Оповещение - ОписаниеОповещения - оповещение при закрытии формы.
//
Процедура ОткрытьОбъект(ТипОбъекта, ID, ВладелецФормы = Неопределено, ДополнительныеПараметры = Неопределено,
		Оповещение = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ТипОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникФормыБазовая = "Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.";
	
	СоответствиеФормБазовая = Новый Соответствие;
	СоответствиеФормБазовая.Вставить("DMFile", "Файл");
	
	ИмяФормы = СоответствиеФормБазовая.Получить(ТипОбъекта);
	
	Если ЗначениеЗаполнено(ИмяФормы) Тогда
		
		ПараметрыФормы = Новый Структура("ID, type", ID, ТипОбъекта);
		Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
			Для Каждого Элемент Из ДополнительныеПараметры Цикл
				ПараметрыФормы.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;
		КонецЕсли;
		
		ОткрытьФорму(ИсточникФормыБазовая + ИмяФормы, ПараметрыФормы, ВладелецФормы, ID,,, Оповещение);
		
	Иначе
		
		СоответствиеФорм = Новый Соответствие;
		
		Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
		Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
			ИсточникФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.";
			МодульИнтеграцияС1СДокументооборотКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
				"ИнтеграцияС1СДокументооборотКлиент");
			МодульИнтеграцияС1СДокументооборотКлиент.ЗаполнитьСоответствиеФорм(СоответствиеФорм);
		ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
			ИсточникФормы = "Обработка.ИнтеграцияС1СДокументооборот3.Форма.";
			МодульИнтеграцияС1СДокументооборот3Клиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
				"ИнтеграцияС1СДокументооборот3Клиент");
			МодульИнтеграцияС1СДокументооборот3Клиент.ЗаполнитьСоответствиеФорм(СоответствиеФорм);
		КонецЕсли;
		
		ИмяФормы = СоответствиеФорм.Получить(ТипОбъекта);
		
		Если ЗначениеЗаполнено(ИмяФормы) Тогда
			
			ПараметрыФормы = Новый Структура("ID, type", ID, ТипОбъекта);
			Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
				Для Каждого Элемент Из ДополнительныеПараметры Цикл
					ПараметрыФормы.Вставить(Элемент.Ключ, Элемент.Значение);
				КонецЦикла;
			КонецЕсли;
			
			ОткрытьФорму(ИсточникФормы + ИмяФормы, ПараметрыФормы, ВладелецФормы, ID,,, Оповещение);
			
		Иначе
			ПоказатьПредупреждение(,
				НСтр("ru='Просмотр объектов такого типа не поддерживается в этой версии 1С:Документооборота.'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Конструктор структуры для показа вопроса "Да" / "Нет".
//
// Параметры:
//   КнопкаПоУмолчанию - РежимДиалогаВопрос, Неопределено - необязательный, кнопка по умолчанию.
//
// Возвращаемое значение:
//   Структура:
//     * ТекстКнопкиДа - Строка - необязательный, текст кнопки "Да".
//     * ТекстКнопкиНет - Строка - необязательный, текст кнопки "Нет".
//     * КнопкаПоУмолчанию - РежимДиалогаВопрос, Неопределено - необязательный, кнопка по умолчанию.
//     * Заголовок - Строка - необязательный, содержит заголовок окна вопроса.
//
Функция ПараметрыВопросаДаНет(КнопкаПоУмолчанию = Неопределено) Экспорт
	
	ПараметрыВопросаДаНет = Новый Структура;
	ПараметрыВопросаДаНет.Вставить("КнопкаПоУмолчанию", КнопкаПоУмолчанию);
	ПараметрыВопросаДаНет.Вставить("ТекстКнопкиДа", "");
	ПараметрыВопросаДаНет.Вставить("ТекстКнопкиНет", "");
	ПараметрыВопросаДаНет.Вставить("Заголовок", "");
	
	Возврат ПараметрыВопросаДаНет;
	
КонецФункции

// Конструктор структуры для выбора произвольного значения ДО.
//
// Возвращаемое значение:
//   Структура:
//     * ТекстРедактирования - Строка - текст редактирования элемента формы.
//     * Представление - Строка - представление реквизита, для которого выбирается значение.
//     * ЗначениеРеквизита - Строка - текущее значение в поле ввода.
//     * ЗначениеРеквизитаID - Строка - текущее значение в поле ввода.
//     * ЗначениеРеквизитаТип - Строка - текущее значение в поле ввода.
//     * Оповещение - ОписаниеОповещения, Неопределено - вызывает процедуру, в которую передается выбранное значение.
//     * Отбор - Структура, Неопределено - отбор для выбора из списка.
//
Функция ПараметрыВыбораЗначенияДО() Экспорт
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ТекстРедактирования", "");
	ПараметрыВыбора.Вставить("Представление", "");
	ПараметрыВыбора.Вставить("ЗначениеРеквизита", "");
	ПараметрыВыбора.Вставить("ЗначениеРеквизитаID", "");
	ПараметрыВыбора.Вставить("ЗначениеРеквизитаТип", "");
	ПараметрыВыбора.Вставить("Оповещение", Неопределено);
	ПараметрыВыбора.Вставить("Отбор", Неопределено);
	
	Возврат ПараметрыВыбора;
	
КонецФункции

// Проверяет необходимость добавить связь, в случае если объект ИС был создан на основании объекта ДО.
//
// Параметры:
//   Источник - ФормаКлиентскогоПриложения - форма нового объекта ИС.
//
Процедура ПередВыполнениемКоманды(Источник) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения")
			И ТипЗнч(Источник.ОписаниеОповещенияОЗакрытии) = Тип("ОписаниеОповещения")
			И Источник.ОписаниеОповещенияОЗакрытии.ИмяПроцедуры = "СоздатьИнтегрированныйОбъектЗавершение" Тогда
		СоздатьИнтегрированныйОбъектЗавершение(
			Неопределено,
			Источник.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры);
		Источник.ОписаниеОповещенияОЗакрытии = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Показывает вопрос "Да" / "Нет", принимая Esc и закрытие формы крестиком как ответ "Нет".
//
// Параметры:
//   ТекстВопроса - Строка - текст задаваемого вопроса.
//   ПараметрыВопроса - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыВопросаДаНет
//
// Возвращаемое значение:
//   Обещание - результат выполнения обещания КодВозвратаДиалога.
//
Функция ПоказатьВопросДаНетАсинх(ТекстВопроса, ПараметрыВопроса = Неопределено) Экспорт
	
	Если ПараметрыВопроса = Неопределено Тогда
		ПараметрыВопроса = ПараметрыВопросаДаНет();
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Если ПараметрыВопроса.ТекстКнопкиДа = "" Тогда
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Да'"));
	Иначе
		Кнопки.Добавить(КодВозвратаДиалога.Да, ПараметрыВопроса.ТекстКнопкиДа);
	КонецЕсли;
	Если ПараметрыВопроса.ТекстКнопкиНет = "" Тогда
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Нет'"));
	Иначе
		Кнопки.Добавить(КодВозвратаДиалога.Нет, ПараметрыВопроса.ТекстКнопкиНет);
	КонецЕсли;
	
	Если ПараметрыВопроса.КнопкаПоУмолчанию = Неопределено Тогда
		Возврат ВопросАсинх(ТекстВопроса, Кнопки,,, ПараметрыВопроса.Заголовок);
	ИначеЕсли ПараметрыВопроса.КнопкаПоУмолчанию = КодВозвратаДиалога.Да Тогда
		Возврат ВопросАсинх(ТекстВопроса, Кнопки,, КодВозвратаДиалога.Да, ПараметрыВопроса.Заголовок);
	ИначеЕсли ПараметрыВопроса.КнопкаПоУмолчанию = КодВозвратаДиалога.Нет Тогда
		Возврат ВопросАсинх(ТекстВопроса, Кнопки,, КодВозвратаДиалога.Нет, ПараметрыВопроса.Заголовок);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Недопустимое значение кнопки по умолчанию: %1'"),
			ПараметрыВопроса.КнопкаПоУмолчанию);
	КонецЕсли;
	
КонецФункции

// Управляет активностью обработчика обновления токена доступа в ДО.
//
// Параметры:
//   ИспользуетсяАутентификацияJWT - Булево - текущий пользователь использует авторизацию через JWT-токен.
//
Процедура ПриАвторизации(ИспользуетсяАутентификацияJWT) Экспорт
	
	Если ИспользуетсяАутентификацияJWT Тогда
		ПодключитьОбработчикОжидания(
			"ПриИстеченииВремениЖизниТокенаДоступа",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ВремяЖизниТокенаДоступа());
	Иначе
		ОтключитьОбработчикОжидания("ПриИстеченииВремениЖизниТокенаДоступа");
	КонецЕсли;
	
КонецПроцедуры

// Проверяет результат выполнения длительной операции на наличие ошибок, и, при необходимости, переключает
// интерфейс формы на страницу ошибки при обновлении.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется обновление.
//   Результат - см. ДлительныеОперации.ОперацияВыполнена
//   НужноОбработатьФорму - Булево - неявно возвращаемое значение, Истина, в случае если требуется обработать форму.
//
Процедура ПроверитьОшибкиПриОбновленииФормы(Форма, Результат, НужноОбработатьФорму = Ложь) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если Результат.Статус = "Ошибка" И Форма.ИнициализацияВыполнена = Ложь Тогда
			Форма.Элементы.ГруппаСтраницыПодключения.ТекущаяСтраница = Форма.Элементы.СтраницаОшибкаПриОбновлении;
			Форма.ТекстОшибкиПриОбновлении = Результат.КраткоеПредставлениеОшибки;
		ИначеЕсли Форма.Элементы.ГруппаСтраницыПодключения.ТекущаяСтраница = Форма.Элементы.СтраницаОшибкаПриОбновлении Тогда
			Форма.ТекстОшибкиПриОбновлении = "";
			НужноОбработатьФорму = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет подключение к 1С:Документообороту, при необходимости запрашивая имя пользователя и пароль.
//
// Параметры:
//
//   ОписаниеОповещения - ОписаниеОповещения - описание оповещения, вызываемого после проверки подключения с параметром
//     типа Булево.
//   Владелец - ФормаКлиентскогоПриложения - форма, в которой следует вызвать повторную попытку подключения.
//            - ОбщийМодуль - клиентский модуль, из которого вызывается команда.
//   ПовторноПоказыватьОкноАвторизации - Булево - Истина, если при отсутствии подключения необходимо
//     повторно показать окно авторизации, даже если оно было показано ранее.
//   ВыводитьОкноОжидания - Булево - если Истина, то открыть окно ожидания с визуальной индикацией длительной операции.
//   СкрыватьИнтерфейс - Булево - если окно ожидания не выводится, то данный параметр указывает нужно ли использовать
//     переключение страниц, который скроет весь интерфейс, либо же нужно не скрывать интерфейс, а сделать видимой
//     группу элементов длительной операции.
//   АдресВебСервисаДокументооборота - Строка - адрес веб-сервиса ДО, или
//                                   - Неопределено - признак необходимости использовать ранее сохраненный адрес.
//
Асинх Процедура ПроверитьПодключение(Знач ОписаниеОповещения, Знач Владелец,
		Знач ПовторноПоказыватьОкноАвторизации = Ложь, Знач ВыводитьОкноОжидания = Истина,
		Знач СкрыватьИнтерфейс = Ложь, Знач АдресВебСервисаДокументооборота = Неопределено) Экспорт
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПарольИзвестен()
			И АдресВебСервисаДокументооборота = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("НастройкиАвторизации", Ждать ПрочитатьНастройкиАвторизацииАсинх());
	ПараметрыОповещения.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	ПараметрыОповещения.Вставить("Владелец", Владелец);
	ПараметрыОповещения.Вставить("ПовторноПоказыватьОкноАвторизации", ПовторноПоказыватьОкноАвторизации);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ПроверитьПодключениеЗавершение",
		ЭтотОбъект,
		ПараметрыОповещения);
	
	Если ТипЗнч(Владелец) = Тип("ФормаКлиентскогоПриложения") Тогда
		УникальныйИдентификатор = Владелец.УникальныйИдентификатор;
	Иначе
		УникальныйИдентификатор = Неопределено;
	КонецЕсли;
	
	ДлительнаяОперация = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПодключитьсяИПолучитьВерсиюСервисаАсинхронно(
		ПараметрыОповещения.НастройкиАвторизации.ИмяПользователя,
		ПараметрыОповещения.НастройкиАвторизации.Пароль,
		УникальныйИдентификатор,,
		АдресВебСервисаДокументооборота);
	ВыполнитьЗапросАсинхронно(
		Владелец,
		ДлительнаяОперация,
		ОповещениеОЗавершении,
		ВыводитьОкноОжидания,
		НСтр("ru = 'Подключение к 1С:Документооборот.'"),
		СкрыватьИнтерфейс);
	
КонецПроцедуры

// Вызывается после закрытия окна авторизации. Вызывает обработчик, переданный вызвавшей формой.
//
// Параметры:
//   Результат - Булево - Истина, если в окне авторизации нажата ОК и подключение успешно.
//   Параметры - Структура:
//     ОписаниеОповещения - ОписаниеОповещения - обработчик вызвавшей формы.
//
Процедура ПроверитьПодключениеПослеОкнаАвторизации(Результат, Параметры) Экспорт
	
	Если Результат = Истина Тогда // Успех, настройки авторизации сохранены в параметрах сеанса.
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Истина);
		
	Иначе // Подключиться не удалось, или пользователь отказался от попытки авторизации.
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьВерсиюСервисаВПараметрыСеанса("0.0.0.0");
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Получает имя пользователя и пароль для доступа к 1С:Документообороту.
// В веб-клиенте возвращается только имя пользователя. Только имя пользователя возвращается и
// тогда, когда в предыдущий раз настройки были сохранены в веб-клиенте или на другом компьютере.
//
// Возвращаемое значение:
//   см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НастройкиАвторизацииВ1СДокументообороте
//
Асинх Функция ПрочитатьНастройкиАвторизацииАсинх() Экспорт
	
	НастройкиАвторизации =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НастройкиАвторизацииВ1СДокументообороте();
	
	НастройкиАвторизации.Пароль = Неопределено;
	ЧастьПароляВИБ = Неопределено;
	ИмяВременногоФайла = Неопределено;
	
#Если ВебКлиент Или МобильныйКлиент Тогда
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПрочитатьНастройкиАвторизации(
		НастройкиАвторизации);
	НастройкиАвторизации.ПарольСохранен = Ложь;
#Иначе
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПрочитатьНастройкиАвторизации(
		НастройкиАвторизации,
		ИмяКомпьютера(),
		ЧастьПароляВИБ,
		ИмяВременногоФайла);
#КонецЕсли
	
	Если НастройкиАвторизации.ИспользуетсяАутентификацияОС Или НастройкиАвторизации.ИспользуетсяАутентификацияJWT Тогда
		Возврат НастройкиАвторизации;
		
	ИначеЕсли НастройкиАвторизации.ПарольСохранен Тогда
#Если Не ВебКлиент И Не МобильныйКлиент Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		Попытка
			Ждать ТекстовыйДокумент.ПрочитатьАсинх(ИмяВременногоФайла);
			РазделенныйПароль = Новый Массив;
			РазделенныйПароль.Добавить(ЧастьПароляВИБ);
			РазделенныйПароль.Добавить(ТекстовыйДокумент.ПолучитьТекст());
			НастройкиАвторизации.Пароль =
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СобратьПароль(РазделенныйПароль);
			НастройкиАвторизации.ПарольСохранен = (НастройкиАвторизации.Пароль <> Неопределено);
		Исключение
			// Файл удален или поврежден.
			НастройкиАвторизации.ПарольСохранен = Ложь;
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЗаписатьПредупреждение(
				НСтр("ru = 'Не найдены сохраненные учетные данные пользователя 1С:Документооборота'"));
		КонецПопытки;
		Если НастройкиАвторизации.ПарольСохранен
				И ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЭтоПользовательЗаданияОбмена() Тогда
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиАвторизацииДляОбмена(
				НастройкиАвторизации.ИмяПользователя,
				НастройкиАвторизации.Пароль);
		КонецЕсли;
#КонецЕсли
		
	Иначе
		// Пароль не сохранен.
		// Получим настройки из старого хранилища общих настроек, сохраним их в новом и удалим.
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПрочитатьНастройкиАвторизацииИзХранилищаОбщихНастроек(
			НастройкиАвторизации.ИмяПользователя,
			НастройкиАвторизации.Пароль,
			НастройкиАвторизации.ПарольСохранен);
		Если НастройкиАвторизации.ИмяПользователя <> "" И НастройкиАвторизации.ПарольСохранен = Истина Тогда
			СохранитьНастройкиАвторизации(НастройкиАвторизации);
			Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЭтоПользовательЗаданияОбмена() Тогда
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиАвторизацииДляОбмена(
					НастройкиАвторизации.ИмяПользователя,
					НастройкиАвторизации.Пароль);
			КонецЕсли;
#Если Не ВебКлиент И Не МобильныйКлиент Тогда
			// В веб-клиенте пароль не сохранился, и удаление преждевременно.
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УдалитьНастройкиАвторизацииИзХранилищаОбщихНастроек();
#КонецЕсли
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НастройкиАвторизации;
	
КонецФункции

// Создает объект ИС, заполняет его по переданным данным и устанавливает связь.
//
// Параметры:
//   ДанныеЗаполнения - см. ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДанныеЗаполненияИнтегрируемогоОбъекта
//   Форма - ФормаКлиентскогоПриложения - форма объекта ДО или иная форма, требующая оповещения.
//
Процедура СоздатьИнтегрированныйОбъектИзДанныхЗаполнения(ДанныеЗаполнения, Форма = Неопределено) Экспорт
	
	Основание = Новый Структура;
	Для Каждого Элемент Из ДанныеЗаполнения Цикл
		Основание.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	Для Каждого Элемент Из ДанныеЗаполнения.ЗначенияРеквизитов Цикл
		Основание.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения.ЗначенияРеквизитов);
	ПараметрыФормы.Вставить("ИнтеграцияС1СДокументооборотом_ТипОбъектаДО",
		ДанныеЗаполнения.Объект1СДокументооборота.Тип);
	ПараметрыФормы.Вставить("ИнтеграцияС1СДокументооборотом_ИдентификаторОбъектаДО",
		ДанныеЗаполнения.Объект1СДокументооборота.ID);
	
	Уникальность = Новый УникальныйИдентификатор();
	
	ФормаОбъекта = ОткрытьФорму(
		ДанныеЗаполнения.ИмяФормы,
		ПараметрыФормы,
		Форма,
		Уникальность,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
	Если ФормаОбъекта = Неопределено Тогда
		Инфо = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			СтрШаблон(
				НСтр("ru = 'Не удалось заполнить объект по данным из 1С:Документооборот.
					|Проверьте <a href = ""%1"">правило интеграции</a>.'"),
				ПолучитьНавигационнуюСсылку(ДанныеЗаполнения.ПравилоИнтеграции)));
		ПоказатьПредупреждение(, Инфо);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Объект1СДокументооборота", ДанныеЗаполнения.Объект1СДокументооборота);
	ПараметрыОповещения.Вставить("ФормаОбъекта", ФормаОбъекта);
	ПараметрыОповещения.Вставить("НаличиеПрисоединенныхФайлов", ДанныеЗаполнения.НаличиеПрисоединенныхФайлов);
	ПараметрыОповещения.Вставить("ТипСоздаваемогоОбъекта", ДанныеЗаполнения.ТипСоздаваемогоОбъекта);
	
	Оповещение = Новый ОписаниеОповещения(
		"СоздатьИнтегрированныйОбъектЗавершение",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		ПараметрыОповещения);
	
	ФормаОбъекта.ОписаниеОповещенияОЗакрытии = Оповещение;
	
КонецПроцедуры

// Запоминает факт показа окна авторизации, чтобы больше не беспокоить пользователя в пределах сеанса.
//
Процедура СохранитьАвторизацияПредложена() Экспорт
	
	Если ПараметрыПриложения["ИнтеграцияС1СДокументооборот.АвторизацияПредложена"] = Неопределено Тогда
		ПараметрыПриложения.Вставить("ИнтеграцияС1СДокументооборот.АвторизацияПредложена", Истина);
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПереопределяемый.ПриСохраненииПредложенияАвторизации();
	
КонецПроцедуры

// Сохраняет имя пользователя и пароль для доступа к 1С:Документообороту.
// В веб-клиенте сохраняется только имя пользователя.
//
// Параметры:
//   НастройкиАвторизации - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НастройкиАвторизацииВ1СДокументообороте
//
Асинх Процедура СохранитьНастройкиАвторизации(Знач НастройкиАвторизации) Экспорт
	
#Если ВебКлиент Тогда
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиАвторизации(
		НастройкиАвторизации);
#Иначе
	ИмяСтарогоВременногоФайла = Неопределено;
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПрочитатьНастройкиАвторизации(
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НастройкиАвторизацииВ1СДокументообороте(),,,
		ИмяСтарогоВременногоФайла); // Получим имя старого временного файла.
	Если ЗначениеЗаполнено(ИмяСтарогоВременногоФайла) Тогда
		Файл = Новый Файл(ИмяСтарогоВременногоФайла);
		Если Ждать Файл.СуществуетАсинх() Тогда
			Ждать Файл.УстановитьТолькоЧтениеАсинх(Ложь);
			Ждать УдалитьФайлыАсинх(ИмяСтарогоВременногоФайла);
		КонецЕсли;
	КонецЕсли;
	
	ЧастьПароляВИБ = "";
	ИмяВременногоФайла = "";
	
	Если Не НастройкиАвторизации.ИспользуетсяАутентификацияОС
			И Не НастройкиАвторизации.ИспользуетсяАутентификацияJWT Тогда
		РазделенныйПароль = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.РазделитьПароль(
			НастройкиАвторизации.Пароль);
		
		ЧастьПароляВИБ = РазделенныйПароль[0];
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		
		// В сеансе подключения к удаленному рабочему столу Windows каталог временных файлов может быть временным
		// подкаталогом, создаваемым на время сеанса. В этом случае создадим файл в общем каталоге пользователя.
		ПозицияОбщегоКаталога = СтрНайти(ВРег(ИмяВременногоФайла), "\TEMP\", НаправлениеПоиска.СКонца);
		Если ПозицияОбщегоКаталога <> 0 Тогда
			ПозицияПредпоследнегоРазделителя = ПозицияОбщегоКаталога + СтрДлина("\TEMP");
			ПозицияПоследнегоРазделителя = СтрНайти(ИмяВременногоФайла, "\", НаправлениеПоиска.СКонца);
			Если ПозицияПоследнегоРазделителя > ПозицияПредпоследнегоРазделителя Тогда
				ИмяВременногоФайла = Лев(ИмяВременногоФайла, ПозицияПредпоследнегоРазделителя - 1)
					+ Сред(ИмяВременногоФайла, ПозицияПоследнегоРазделителя);
			КонецЕсли;
		КонецЕсли;
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.ДобавитьСтроку(РазделенныйПароль[1]);
		ТекстовыйДокумент.Записать(ИмяВременногоФайла);
		Файл = Новый Файл(ИмяВременногоФайла);
		Ждать Файл.УстановитьТолькоЧтениеАсинх(Истина);
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиАвторизации(
		НастройкиАвторизации,
		ИмяКомпьютера(),
		ЧастьПароляВИБ,
		ИмяВременногоФайла);
#КонецЕсли
	
КонецПроцедуры

// Получает из формы клиентского приложения ссылку на объект, интегрируемый с ДО.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется поиск ссылки.
//   ТипИнтегрируемогоОбъекта - Тип - тип ссылки, которую требуется найти на форме.
//
// Возвращаемое значение:
//   ЛюбаяСсылка - ссылка на интегрируемый объект.
//
Функция СсылкаНаИнтегрируемыйОбъектИзФормы(Форма, ТипИнтегрируемогоОбъекта = Неопределено) Экспорт
	
	ЗначенияРеквизитовФормы = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ФормаИнтегрируемогоОбъекта();
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовФормы, Форма);
	
	// Если в событии формы ПриСозданииНаСервере вызывался метод
	// ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере, то имя реквизита, содержащего
	// ссылку на объект, будет находиться в реквизите формы ИмяРеквизитаОбъектаИнтегрируемогоС1СДокументооборотом.
	Если Не ЗначениеЗаполнено(ЗначенияРеквизитовФормы.ИмяРеквизитаОбъектаИнтегрируемогоС1СДокументооборотом) Тогда
		// Если имя реквизита неизвестно - попытаемся его определить. Оно может быть задано в переопределяемом модуле.
		ЗначенияРеквизитовФормы.ИмяРеквизитаОбъектаИнтегрируемогоС1СДокументооборотом =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИмяРеквизитаОбъектаИнтегрируемогоС1СДокументооборотом(
				ЗначенияРеквизитовФормы,
				Неопределено,
				ТипИнтегрируемогоОбъекта);
	КонецЕсли;
	
	Возврат ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СсылкаНаИнтегрируемыйОбъектИзФормы(
		Форма,
		ЗначенияРеквизитовФормы.ИмяРеквизитаОбъектаИнтегрируемогоС1СДокументооборотом,
		ТипИнтегрируемогоОбъекта);
	
КонецФункции

// Открывает форму выбора объекта метаданных интегрированной системы.
//
// Параметры:
//   ТипОбъектаИС - Строка - текущий тип объекта метаданных интегрированной системы.
//   ОписаниеОповещения - ОписаниеОповещения - описание вызываемого оповещения.
//
Процедура ТипОбъектаИСНачалоВыбора(ТипОбъектаИС, ОписаниеОповещения) Экспорт
	
	ПараметрФормы = Новый Структура;
	ПараметрФормы.Вставить("ТекущаяСтрока", ТипОбъектаИС);
	ОткрытьФорму("Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.ВыборОбъектаМетаданных",
		ПараметрФормы,
		ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Вызывается при открытии форм связанных данных ДО и устанавливает заголовок согласно владельцу.
//
// Параметры:
//   Форма - РасширениеФормыКлиентскогоПриложенияДляОбъектов - форма, заголовок которой следует уточнить из владельца:
//     * Заголовок - Строка
//     * ВладелецФормы - ФормаКлиентскогоПриложения:
//         ** Заголовок - Строка
//
Процедура УстановитьЗаголовокПриОткрытии(Форма) Экспорт
	
	Если Форма.Окно = Неопределено
			И ТипЗнч(Форма.ВладелецФормы) = Тип("ФормаКлиентскогоПриложения")
			И ЗначениеЗаполнено(Форма.ВладелецФормы.Заголовок) Тогда
		
		Если ЗначениеЗаполнено(Форма.Заголовок) Тогда
			Форма.Заголовок = СтрШаблон("%1 (%2)", Форма.Заголовок, Форма.ВладелецФормы.Заголовок);
		Иначе
			Форма.Заголовок = Форма.ВладелецФормы.Заголовок;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет массив пользовательских настроек МассивСтруктур. Может применяться для случаев вызова с клиента.
//
// Параметры:
//   МассивСтруктур - Массив из Структура:
//     * Объект - Строка
//     * Настройка - Строка
//     * Автообновление - Булево
//   НужноОбновитьПовторноИспользуемыеЗначения - Булево - требуется обновить повторно используемые значения
//
Процедура ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур, НужноОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПереопределяемый.ПриСохраненииНастроекПользователя(
		МассивСтруктур,
		НужноОбновитьПовторноИспользуемыеЗначения,
		СтандартнаяОбработка);
	
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияВызовСервера");
	МодульОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранитьМассив(
		МассивСтруктур,
		НужноОбновитьПовторноИспользуемыеЗначения);
	
КонецПроцедуры

// Проверяет, является ли переданная строка внешней или внутренней навигационной ссылкой.
//
// Параметры:
//   Строка - Строка - навигационная ссылка.
//
// Возвращаемое значение:
//   Булево - результат проверки.
//
Функция ЭтоНавигационнаяСсылка(Знач Строка) Экспорт
	
	ОбработатьНавигационнуюСсылку(Строка);
	Строка = НРег(Строка);
	
	Возврат СтрНачинаетсяС(Строка, "e1c:")
		Или СтрНачинаетсяС(Строка, "e1cib/")
		Или СтрНачинаетсяС(Строка, "e1ccs/")
		Или (СтрНачинаетсяС(Строка, "http") И (СтрНайти(Строка, "#e1c") > 0));
	
КонецФункции

#КонецОбласти

#Область Файлы

// Возвращает выделенные в таблице файлы, игнорируя роли файлов.
//
// Параметры:
//   КоллекцияФайлы - ДанныеФормыКоллекция - таблица или дерево файлов.
//   ВыделенныеСтроки - Массив из Число - идентификаторы выделенных строк коллекции.
//
// Возвращаемое значение:
//   Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//
Функция ВыделенныеФайлы(КоллекцияФайлы, ВыделенныеСтроки) Экспорт
	
	ВыделенныеФайлы = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		Данные = КоллекцияФайлы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		РольФайлаID = Неопределено;
		Если Данные.Свойство("РольФайлаID") Тогда
			РольФайлаID = Данные.РольФайлаID;
		КонецЕсли;
		Тип = "";
		Если Данные.Свойство("Тип") Тогда
			Тип = Данные.Тип;
		КонецЕсли;
		Если Тип <> "DMFileRole" Тогда
			ДанныеФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
				Данные.Наименование,
				Данные.ID,
				"DMFile",
				Данные.Расширение,
				РольФайлаID);
			ВыделенныеФайлы.Добавить(ДанныеФайла);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыделенныеФайлы;
	
КонецФункции

// Начинает добавление файла с диска к объекту ДО, связанному с указанным объектом ИС.
//
// Параметры:
//   ВладелецФайла - ЛюбаяСсылка - источник команды, объект ИС - владелец файлов.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура ДобавитьФайлСДискаКОбъектуИС(ВладелецФайла, УникальныйИдентификаторФормы) Экспорт
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ВладелецФайла", ВладелецФайла);
	ПараметрыОповещения.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	
	Оповещение = Новый ОписаниеОповещения(
		"ДобавитьФайлСДискаКОбъектуИСПослеПоискаОбъектаДО",
		ЭтотОбъект,
		ПараметрыОповещения);
	
	НачатьПоискСвязанногоОбъектаДО(ВладелецФайла, Оповещение, Истина);
	
КонецПроцедуры

// Заканчивает редактирование файла, помещая его в ДО и снимая захват, если необходимо.
//
// Параметры:
//   ID - Строка - идентификатор файла ДО.
//   Наименование - Строка - имя редактируемого файла.
//   Расширение - Строка - расширение редактируемого файла.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   ОписаниеОповещенияОЗавершении - ОписаниеОповещения - необязательный, вызывается при успешном завершении.
//   ВладелецID - Строка - идентификатор владельца файла.
//
Асинх Процедура ЗакончитьРедактированиеФайла(Знач ID, Знач Наименование, Знач Расширение,
		Знач УникальныйИдентификаторФормы, Знач ОписаниеОповещенияОЗавершении = Неопределено,
		Знач ВладелецID = "") Экспорт
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		ID,
		"DMFile",
		Расширение);
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийФайл", ТекущийФайл);
	Параметры.Вставить("ВладелецID", ВладелецID);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Параметры.Вставить("ОписаниеОповещения", ОписаниеОповещенияОЗавершении);
	
	Если Не Ждать РасширениеРаботыСФайламиПодключеноАсинх() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ЗакончитьРедактированиеБезРасширенияПослеПомещения",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры);
		Попытка
			ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
			ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификаторФормы;
			ФайловаяСистемаКлиент.ЗагрузитьФайл(
				ОписаниеОповещения,
				ПараметрыЗагрузки);
		Исключение
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Не удалось сохранить изменения по причине:
					|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	СведенияОРедактировании =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла(
			ID,
			"DMFile");
	Параметры.Вставить("СведенияОРедактировании", СведенияОРедактировании);
	
	// Проверим, можно ли вообще выполнить операцию (на стороне ДО ситуация могла измениться).
	Если Не СведенияОРедактировании.Сохранен Или СведенияОРедактировании.НаЧтение Тогда
		Ответ = Ждать ПоказатьВопросДаНетАсинх(НСтр("ru = 'Файл не найден в рабочем каталоге. Освободить его?'"));
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗакончитьРедактированиеСРасширениемПослеВопросаОбОсвобождении(Параметры);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Проверим, существует ли файл в указанном месте.
	Файл = Новый Файл(СведенияОРедактировании.ПолныйПуть);
	Параметры.Вставить("Файл", Файл);
	Если Не Ждать Файл.СуществуетАсинх() Тогда
		Ответ = Ждать ПоказатьВопросДаНетАсинх(НСтр("ru = 'Файл не найден в рабочем каталоге. Освободить его?'"));
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗакончитьРедактированиеСРасширениемПослеВопросаОбОсвобождении(Параметры);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.ТекущийФайл.Размер = Ждать Файл.РазмерАсинх();
	Параметры.ТекущийФайл.ДатаМодификации = Ждать Файл.ПолучитьВремяИзмененияАсинх();
	Параметры.ТекущийФайл.ДатаМодификацииУниверсальная = Ждать Файл.ПолучитьУниверсальноеВремяИзмененияАсинх();
	
	// Все нормально, поместим файл в ДО и освободим его.
	ТекстПояснения = СтрШаблон(НСтр("ru = 'Идет сохранение файла ""%1"" (%2). Пожалуйста, подождите...'"),
		СведенияОРедактировании.ПолныйПуть,
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.КраткоеПредставлениеРазмера(
			Параметры.ТекущийФайл.Размер));
	Состояние(ТекстПояснения);
	
	ОповещениеПослеПомещенияФайла = Новый ОписаниеОповещения(
		"ЗакончитьРедактированиеСРасширениемПослеПомещения",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	Параметры.Вставить("ОповещениеПослеПомещенияФайла", ОповещениеПослеПомещенияФайла);
	
	Если СведенияОРедактировании.Свойство("КомментарийКВерсии") Тогда
		ОповещениеПослеВводаКомментария = Новый ОписаниеОповещения(
			"ПослеВводаОписанияВнесенныхИзменений",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры);
		ОткрытьФорму(
			"Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.ФормаВозвратаФайла",,,,,,
			ОповещениеПослеВводаКомментария,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ПослеВводаОписанияВнесенныхИзменений(КодВозвратаДиалога.ОК, Параметры);
	КонецЕсли;
	
КонецПроцедуры

// Извлекает текст из файла и возвращает его в виде строки.
//
// Параметры:
//   ПолноеИмяФайла - Строка - полное имя файла.
//
// Возвращаемое значение:
//   Строка - извлеченный текст.
//
Асинх Функция ИзвлечьТекстАсинх(Знач ПолноеИмяФайла) Экспорт
	
	ИзвлеченныйТекст = "";
	
	Попытка
		Файл = Новый Файл(ПолноеИмяФайла);
		Если Не Ждать Файл.СуществуетАсинх() Тогда
			Возврат ИзвлеченныйТекст;
		КонецЕсли;
	Исключение
		Возврат ИзвлеченныйТекст;
	КонецПопытки;
	
	Прекратить = Ложь;
	Отказ = Ложь;
	
	ОбщиеНастройки = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ОбщиеНастройкиРаботыСФайлами;
	
#Если Не ВебКлиент И Не МобильныйКлиент Тогда
	
	РасширениеИмениФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ПолноеИмяФайла);
	
	РасширениеФайлаВСписке = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.РасширениеФайлаВСписке(
		ОбщиеНастройки.СписокРасширенийТекстовыхФайлов,
		РасширениеИмениФайла);
	
	Если РасширениеФайлаВСписке Тогда
		Возврат ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ИзвлечьТекстИзТекстовогоФайла(
			ПолноеИмяФайла,
			Неопределено,
			Отказ);
	КонецЕсли;
	
	Попытка
		Извлечение = Новый ИзвлечениеТекста(ПолноеИмяФайла);
		ИзвлеченныйТекст = Извлечение.ПолучитьТекст();
	Исключение
		// Когда текст некому извлечь исключение не требуется. Это нормальный случай.
		ИзвлеченныйТекст = "";
		Прекратить = Истина;
	КонецПопытки;
	
#КонецЕсли
	
	Если ПустаяСтрока(ИзвлеченныйТекст) Тогда
		
		РасширениеИмениФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ПолноеИмяФайла);
		
		РасширениеФайлаВСписке = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.РасширениеФайлаВСписке(
			ОбщиеНастройки.СписокРасширенийФайловOpenDocument,
			РасширениеИмениФайла);
		
		Если РасширениеФайлаВСписке Тогда
			Возврат ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ИзвлечьТекстOpenDocument(
				ПолноеИмяФайла,
				Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Прекратить Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Возврат ИзвлеченныйТекст;
	
КонецФункции

// Получает индекс пиктограммы файла - индекс в картинке КоллекцияПиктограммФайлов.
//
// Параметры:
//   Расширение - Строка - расширение файла.
//   ПометкаУдаления - Булево - файл помечен на удаление.
//
// Возвращаемое значение:
//   Число
//
Функция ИндексПиктограммыФайла(Расширение, ПометкаУдаления = Ложь) Экспорт
	
	ИндексКартинки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ИндексПиктограммыФайла(Расширение);
	
	Если ПометкаУдаления Тогда
		ИндексКартинки = ИндексКартинки + 1;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

// По окончании подписания создает оповещение о подписании файла.
//
// Параметры:
//   ДействиеНадФайлом - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом
//   ИмяФайла - Строка - имя файла для вывода в сообщение.
//   ИдентификаторФайла - Строка - идентификатор файла Документооборота.
//   ВладелецФайла - Строка - идентификатор владельца файла.
//   ТекстСообщения - Строка - текст состояния.
//   ОповещатьКарточкуДокумента - Булево - требуется ли вызывать обработку оповещения в карточке документа.
//     Например, если изменение произошло в карточке файла - вызвать оповещение в карточке документа нужно.
//     Если, например, из самой карточки документа идет групповое подписание 10 файлов - дополнительно 10 раз
//     вызывать оповещение в карточке документа не нужно.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура ИнформироватьОбИзмененииФайла(ДействиеНадФайлом, ИмяФайла, ИдентификаторФайла, ВладелецФайла,
		ТекстСообщения = "", ОповещатьКарточкуДокумента = Истина, УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыОповещенияЗаписьФайл = Новый Структура;
	ПараметрыОповещенияЗаписьФайл.Вставить("ДействиеНадФайлом", ДействиеНадФайлом);
	ПараметрыОповещенияЗаписьФайл.Вставить("ИмяФайла", ИмяФайла);
	ПараметрыОповещенияЗаписьФайл.Вставить("ИдентификаторФайла", ИдентификаторФайла);
	ПараметрыОповещенияЗаписьФайл.Вставить("ВладелецФайла", ВладелецФайла);
	ПараметрыОповещенияЗаписьФайл.Вставить("ОповещатьКарточкуДокумента", ОповещатьКарточкуДокумента);
	ПараметрыОповещенияЗаписьФайл.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Оповестить("Запись_ДокументооборотФайл", ПараметрыОповещенияЗаписьФайл);
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Состояние(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет используется ли 1С:Документооборот для хранения файлов объекта.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма владельца файла.
//   Команда - КомандаФормы - выполняемая команда управления присоединенными файлами.
//   ВладелецПрисоединенныхФайлов - ЛюбаяСсылка - владелец присоединенных файлов.
//
// Возвращаемое значение:
//   Булево
//
Функция ИспользоватьДОДляХраненияФайловОбъекта(Форма, Команда, ВладелецПрисоединенныхФайлов) Экспорт
	
	ИспользоватьДОДляХраненияФайловОбъекта = Ложь;
	
	ПараметрыФормы = Новый Структура("ИспользоватьПрисоединенныеФайлы1СДокументооборота", Неопределено);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Форма);
	
	Если ПараметрыФормы.ИспользоватьПрисоединенныеФайлы1СДокументооборота = Истина Тогда
		ИспользоватьДОДляХраненияФайловОбъекта =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьПрисоединенныеФайлы1СДокументооборотаДляОбъекта(
				ВладелецПрисоединенныхФайлов);
	КонецЕсли;
	
	Возврат ИспользоватьДОДляХраненияФайловОбъекта;
	
КонецФункции

// Отправляет файлы на печать.
//
// Параметры:
//   КоллекцияФайлы - ДанныеФормыКоллекция - таблица или дерево файлов.
//                  - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//   ВыделенныеСтроки - Массив из Число - идентификаторы выделенных строк коллекции.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура НапечататьФайлы(КоллекцияФайлы, ВыделенныеСтроки, УникальныйИдентификаторФормы) Экспорт
	
	Если ТипЗнч(КоллекцияФайлы) = Тип("Массив") Тогда
		ВыделенныеФайлы = КоллекцияФайлы;
	Иначе
		ВыделенныеФайлы = ВыделенныеФайлы(КоллекцияФайлы, ВыделенныеСтроки);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"НапечататьФайлыПослеПолучения",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент);
	
	ПолучитьФайлыИПродолжить(
		ВыделенныеФайлы,
		УникальныйИдентификаторФормы,
		ОписаниеОповещения);
	
КонецПроцедуры

// Начинает сохранение выделенных файлов.
//
// Параметры:
//   КоллекцияФайлы - ДанныеФормыКоллекция - таблица файлов с колонками ID, Наименование, Расширение.
//   ВыделенныеСтроки - Массив из Число - идентификаторы выделенных строк коллекции.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   ОписаниеОповещения - ОписаниеОповещения - необязательный, обработчик, вызываемый с передачей имени файла
//     после его сохранения.
//
Процедура НачатьСохранениеВыделенныхФайлов(КоллекцияФайлы, ВыделенныеСтроки, УникальныйИдентификаторФормы,
		ОписаниеОповещения = Неопределено) Экспорт
	
	ВыделенныеФайлы = ВыделенныеФайлы(КоллекцияФайлы, ВыделенныеСтроки);
	
	Если ВыделенныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ОставшиесяФайлы", Новый Массив);
	Параметры.Вставить("ИспользоватьВизуализациюШтампаЭП", Истина);
	Для Индекс = 0 По ВыделенныеФайлы.ВГраница() Цикл
		Если Индекс = 0 Тогда
			Параметры.Вставить("ТекущийФайл", ВыделенныеФайлы[Индекс]);
		Иначе
			Параметры.ОставшиесяФайлы.Добавить(ВыделенныеФайлы[Индекс]);
		КонецЕсли;
	КонецЦикла;
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Параметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	
	СохранитьФайлыКакНачало(Параметры);
	
КонецПроцедуры

// Проверяет можно ли добавить только скан-копию и задает вопрос пользователю.
//
// Параметры:
//   СостояниеРазрешаетДобавлениеСканКопии - Булево - можно добавить скан-копию.
//   СостояниеРазрешаетДобавлениеФайла - Булево - можно добавить файл.
//
// Возвращаемое значение:
//   Обещание - результат выполнения обещания КодВозвратаДиалога.
//   КодВозвратаДиалога
//
Функция НеобходимоДобавитьСканКопиюАсинх(СостояниеРазрешаетДобавлениеСканКопии,
		СостояниеРазрешаетДобавлениеФайла) Экспорт
	
	Если СостояниеРазрешаетДобавлениеСканКопии И Не СостояниеРазрешаетДобавлениеФайла Тогда
		ТекстВопроса = НСтр(
			"ru = 'В текущем состоянии можно добавить только скан-копию оригинала документа. Продолжить?'");
		ПараметрыВопросаДаНет = ПараметрыВопросаДаНет(КодВозвратаДиалога.Да);
		ПараметрыВопросаДаНет.Заголовок = НСтр("ru = 'Добавление файла'");
		
		Возврат ПоказатьВопросДаНетАсинх(
			ТекстВопроса,
			ПараметрыВопросаДаНет);
	Иначе
		Возврат КодВозвратаДиалога.Да;
	КонецЕсли;
	
КонецФункции

// Обновляет файл ДО из файла на диске.
//
// Параметры:
//   ID - Строка - Идентификатор файла ДО.
//   Наименование - Строка - имя редактируемого файла.
//   Расширение - Строка - расширение редактируемого файла.
//   ДатаМодификации - Дата - дата модификации редактируемого файла. Местное время.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   ОписаниеОповещенияОЗавершении - ОписаниеОповещения - необязательный, вызывается при успешном завершении.
//   ВладелецID - Строка - идентификатор владельца файла.
//
Асинх Процедура ОбновитьИзФайлаНаДиске(Знач ID, Знач Наименование, Знач Расширение, Знач ДатаМодификации,
		Знач УникальныйИдентификаторФормы, Знач ОписаниеОповещенияОЗавершении = Неопределено,
		Знач ВладелецID = "") Экспорт
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		ID,
		"DMFile",
		Расширение);
	ТекущийФайл.ДатаМодификации = ДатаМодификации;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийФайл", ТекущийФайл);
	Параметры.Вставить("ВладелецID", ВладелецID);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Параметры.Вставить("ОписаниеОповещения", ОписаниеОповещенияОЗавершении);
	Параметры.Вставить("ОсвободитьФайл", Ложь);
	Параметры.Вставить("ОбновитьСведенияОРедактировании", Ложь);
	
	Фильтр = НСтр("ru = 'Файл (*.%1)|*.%1|Все файлы (*.*)|*.*'");
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = СтрШаблон(Фильтр, Расширение);
	
	Если Не Ждать РасширениеРаботыСФайламиПодключеноАсинх() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОбновитьИзФайлаНаДискеПослеПомещенияФайлаБезРасширения",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры);
		Попытка
			НачатьПомещениеФайлаНаСервер(
				ОписаниеОповещения,,,,
				ПараметрыДиалога,
				Параметры.УникальныйИдентификаторФормы);
		Исключение
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Не удалось обновить файл по причине:
					|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ДоступенФункционалВерсииСервиса("1.4.9.1") Тогда
		СведенияОРедактировании =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла(
				ID,
				"DMFile");
		Параметры.Вставить("СведенияОРедактировании", СведенияОРедактировании);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбновитьИзФайлаНаДискеПослеПомещенияФайлаСРасширением",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	Попытка
		НачатьПомещениеФайлаНаСервер(
			ОписаниеОповещения,,,,
			ПараметрыДиалога,
			Параметры.УникальныйИдентификаторФормы);
	Исключение
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Не удалось обновить файл по причине:
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецПопытки;
	
КонецПроцедуры

// Открывает версию файла для просмотра.
//
// Параметры:
//   ID - Строка - идентификатор версии в ДО.
//   Наименование - Строка - имя версии.
//   Расширение - Строка - расширение версии.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура ОткрытьВерсиюФайла(ID, Наименование, Расширение, УникальныйИдентификаторФормы) Экспорт
	
	ДанныеВерсииФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		ID,
		"DMFileVersion",
		Расширение);
	
	Параметры = Новый Структура("НаЧтение, УникальныйИдентификаторФормы", Истина, УникальныйИдентификаторФормы);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОткрытьФайлыПослеПолучения",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	
	ПолучитьФайлыИПродолжить(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеВерсииФайла),
		УникальныйИдентификаторФормы,
		ОписаниеОповещения,
		Истина);
	
КонецПроцедуры

// Открывает каталог файла, в котором он сохранен на просмотр или редактирование.
//
// Параметры:
//   ID - Строка - идентификатор файла в ДО.
//
Асинх Процедура ОткрытьКаталогФайла(Знач ID) Экспорт
	
	Если Не Ждать РасширениеРаботыСФайламиПодключеноАсинх() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Открывать каталог файла можно только после подключения
			|расширения для работы с файлами.'"));
		Возврат;
	КонецЕсли;
	
	СведенияОРедактировании =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла(
			ID,
			"DMFile");
	Если СведенияОРедактировании.Сохранен Тогда
		Файл = Новый Файл(СведенияОРедактировании.ПолныйПуть);
		Если Ждать Файл.СуществуетАсинх() Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(СведенияОРедактировании.ПолныйПуть);
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Файл не найден в рабочем каталоге.'"));
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Файл не найден в рабочем каталоге.'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Открывает файл для просмотра или редактирования.
//
// Параметры:
//   ID - Строка - идентификатор файла в ДО.
//   Наименование - Строка - имя файла.
//   Расширение - Строка - расширение файла.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   НаЧтение - Булево - Истина, если файл открывается для чтения, и Ложь, если для редактирования.
//   ОписаниеОповещенияОЗавершении - ОписаниеОповещения - вызывается при успешном открытии файла.
//   ВладелецID - Строка - идентификатор владельца файла.
//
Процедура ОткрытьФайл(ID, Наименование, Расширение, УникальныйИдентификаторФормы,
		НаЧтение = Истина, ОписаниеОповещенияОЗавершении = Неопределено, ВладелецID = "") Экспорт
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		ID,
		"DMFile",
		Расширение);
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийФайл", ТекущийФайл);
	Параметры.Вставить("ВладелецID", ВладелецID);
	Параметры.Вставить("НаЧтение", НаЧтение);
	Параметры.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОткрытьФайлыПослеПолучения",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	
	ПолучитьФайлыИПродолжить(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущийФайл),
		УникальныйИдентификаторФормы,
		ОписаниеОповещения,
		НаЧтение);
	
КонецПроцедуры

// Открывает файл, полученный из ДО, для просмотра.
//
// Параметры:
//   АдресФайла - Строка - адрес во временном хранилище, по которому помещены данные файла.
//   Наименование - Строка - имя файла.
//   Расширение - Строка - расширение файла.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура ОткрытьПолученныйФайл(АдресФайла, Наименование, Расширение, УникальныйИдентификаторФормы) Экспорт
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		"",
		"",
		Расширение);
	ТекущийФайл.СсылкаНаДвоичныеДанныеФайла = АдресФайла;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийФайл", ТекущийФайл);
	Параметры.Вставить("ВладелецID", "");
	Параметры.Вставить("НаЧтение", Истина);
	Параметры.Вставить("ОписаниеОповещенияОЗавершении", Неопределено);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОткрытьФайлыПослеПолучения",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	
	ПолучитьФайлыИПродолжить(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущийФайл),
		УникальныйИдентификаторФормы,
		ОписаниеОповещения,
		Истина);
	
КонецПроцедуры

// Открывает список файлов, присоединенных к объекту ИС.
//
// Параметры:
//   ВладелецФайла - ЛюбаяСсылка - источник команды, объект ИС - владелец файлов.
//   ПараметрыОткрытия - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыОткрытияСпискаФайлов
//
Процедура ОткрытьФормуПрисоединенныеФайлы(ВладелецФайла, ПараметрыОткрытия = Неопределено) Экспорт
	
	Если ПараметрыОткрытия = Неопределено Тогда
		ПараметрыОткрытия = ПараметрыОткрытияСпискаФайлов();
	КонецЕсли;
	
	ПередВыполнениемКоманды(ПараметрыОткрытия.ВладелецФормы);
	
	Если ВладелецФайла = Неопределено Тогда
		
		ОткрытьПрисоединенныеФайлыЗавершение(ВладелецФайла, ПараметрыОткрытия);
		
	Иначе
		
		ОповещениеПродолжения = Новый ОписаниеОповещения(
			"ОткрытьПрисоединенныеФайлыЗавершение",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			ПараметрыОткрытия);
		ВыполнитьПроверкуЗаписиИПродолжить(
			ВладелецФайла,
			ПараметрыОткрытия.ВладелецФормы,
			ОповещениеПродолжения,
			НСтр("ru = 'Присоединенные файлы'"));
		
	КонецЕсли;
	
КонецПроцедуры

// Отменяет редактирование ранее захваченного файла.
//
// Параметры:
//   ID - Строка - идентификатор файла в ДО.
//   ОписаниеОповещенияОЗавершении - ОписаниеОповещения - необязательный параметр, описание оповещения,
//     вызываемого после отмены.
//   ВладелецID - Строка - идентификатор владельца файла.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Асинх Процедура ОтменитьРедактированиеФайла(Знач ID, Знач ОписаниеОповещенияОЗавершении = Неопределено,
		Знач ВладелецID = "", Знач УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	Ответ = Ждать ПоказатьВопросДаНетАсинх(
		НСтр("ru = 'Отмена редактирования файла может привести к потере изменений. Продолжить?'"));
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Неопределено,
		ID,
		"DMFile",
		Неопределено);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОсвободитьФайл(ТекущийФайл.ID);
	Если Ждать РасширениеРаботыСФайламиПодключеноАсинх() Тогда
		СведенияОРедактировании =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла(
				ТекущийФайл.ID,
				"DMFile");
		Если СведенияОРедактировании.Сохранен И Не СведенияОРедактировании.НаЧтение Тогда
			Файл = Новый Файл(СведенияОРедактировании.ПолныйПуть);
			Если Ждать Файл.СуществуетАсинх() Тогда
				Если Не Ждать Файл.ПолучитьТолькоЧтениеАсинх() Тогда
					Ждать Файл.УстановитьТолькоЧтениеАсинх(Истина);
				КонецЕсли;
				СведенияОРедактировании.НаЧтение = Истина;
				СведенияОРедактировании.Размер = Ждать Файл.РазмерАсинх();
				СведенияОРедактировании.ДатаМодификацииУниверсальная = Ждать Файл.ПолучитьУниверсальноеВремяИзмененияАсинх();
			Иначе
				СведенияОРедактировании.Сохранен = Ложь;
			КонецЕсли;
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьСведенияОРедактированииФайла(
				СведенияОРедактировании);
		КонецЕсли;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл %1 освобожден.'"), ТекущийФайл.Наименование);
	ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
	ДействиеНадФайлом.РедактированиеФайлаЗавершено = Истина;
	ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
	ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
	ИнформироватьОбИзмененииФайла(
		ДействиеНадФайлом,
		ТекущийФайл.Наименование,
		ТекущийФайл.ID,
		ВладелецID,
		ТекстСообщения,,
		УникальныйИдентификаторФормы);
	
	Если ОписаниеОповещенияОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, ТекущийФайл);
	КонецЕсли;
	
КонецПроцедуры

// Конструктор структуры параметров для начала создания файла.
//
// Параметры:
//   РольФайлаID - Строка, Неопределено - роль файла.
//
// Возвращаемое значение:
//   Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла в Документообороте.
//     * ВладелецТип - Строка - тип XDTO владельца файла в Документообороте.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор, Неопределено - идентификатор вызвавшей формы.
//     * ВладелецПредставление - Строка - представление владельца файла.
//     * Владелец - ЛюбаяСсылка, Неопределено - владелец файла.
//     * ЯвляетсяСканКопией - Булево - признак скан-копии.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//     * ПолныеИменаФайлов - Массив из Строка - имена добавленных файлов.
//     * ПомещенныеФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//
Функция ПараметрыНачалаСозданияФайла(РольФайлаID = Неопределено) Экспорт
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Неопределено,
		Неопределено,
		"DMFile",
		Неопределено,
		РольФайлаID);
	
	ПараметрыНачалаСоздания = Новый Структура("ТекущийФайл", ТекущийФайл);
	ПараметрыНачалаСоздания.Вставить("ВладелецID", "");
	ПараметрыНачалаСоздания.Вставить("ВладелецТип", "");
	ПараметрыНачалаСоздания.Вставить("УникальныйИдентификаторФормы", Неопределено);
	ПараметрыНачалаСоздания.Вставить("ВладелецПредставление", "");
	ПараметрыНачалаСоздания.Вставить("Владелец", Неопределено);
	ПараметрыНачалаСоздания.Вставить("ЯвляетсяСканКопией", Ложь);
	ПараметрыНачалаСоздания.Вставить("ОписаниеОповещения", Неопределено);
	ПараметрыНачалаСоздания.Вставить("ПолныеИменаФайлов", Новый Массив);
	ПараметрыНачалаСоздания.Вставить("ПомещенныеФайлы", Новый Массив);
	
	Возврат ПараметрыНачалаСоздания;
	
КонецФункции

// Конструктор структуры параметров открытия списка файлов.
//
// Параметры:
//   ВладелецФормы - ФормаКлиентскогоПриложения, Неопределено - форма, из которой вызвана команда.
//
// Возвращаемое значение:
//   Структура:
//     * ВладелецФормы - ФормаКлиентскогоПриложения, Неопределено - форма, из которой вызвана команда.
//     * ТолькоПросмотр - Булево - режим открытия формы.
//     * ТекущийФайл - Строка - идентификатор текущего файла, на котором нужно спозиционировать список.
//     * Уникальность - Произвольный, Неопределено - ключ уникальности, с которым должна быть открыта форма файлов.
//     * Окно - ОкноКлиентскогоПриложения, Неопределено - необязательный параметр, окно формы-владельца.
//     * ПравилоИнтеграции - СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом
//                         - СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом3 - подходящее правило интеграции.
//                         - Неопределено - если правило интеграции не задано.
//     * ВладелецФайлаID - Строка - идентификатор объекта ДО, являющегося владельцем файла.
//     * ВладелецФайлаТип - Строка - тип объекта ДО, являющегося владельцем файла.
//     * ПредставлениеВладельца - Строка - представление объекта ДО, являющегося владельцем файла.
//
Функция ПараметрыОткрытияСпискаФайлов(ВладелецФормы = Неопределено) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВладелецФормы", ВладелецФормы);
	Если ВладелецФормы = Неопределено Тогда
		ТолькоПросмотр = Ложь;
	Иначе
		ТолькоПросмотр = ВладелецФормы.ТолькоПросмотр;
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	ПараметрыОткрытия.Вставить("ТекущийФайл", "");
	ПараметрыОткрытия.Вставить("Уникальность", Неопределено);
	ПараметрыОткрытия.Вставить("Окно", Неопределено);
	ПараметрыОткрытия.Вставить("ПравилоИнтеграции", Неопределено);
	ПараметрыОткрытия.Вставить("ВладелецФайлаID", "");
	ПараметрыОткрытия.Вставить("ВладелецФайлаТип", "");
	ПараметрыОткрытия.Вставить("ПредставлениеВладельца", "");
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

// Возвращает фильтр с наборами самых частых расширений файлов.
//
// Возвращаемое значение:
//   Строка
//
Функция ПолучитьФильтрДляДиалогаВыбораФайла() Экспорт
	
	Фильтр = НСтр("ru = 'Все файлы (*.*)|*.*'")
		+ НСтр("ru = '|Документы MS Office(*.doc;*.docx;*.xls;*.xlsx;*.ppt;*.pptx)|*.doc;*.docx;*.xls;*.xlsx;*.ppt;*.pptx'")
		+ НСтр("ru = '|Документы Open Office(*.odt;*.odf;*.ods;*.odp)|*.odt;*.odf;*.ods;*.odp'")
		+ НСтр("ru = '|Текстовые файлы(*.txt)|*.txt'")
		+ НСтр("ru = '|Файлы PDF(*.pdf)|*.pdf'")
		+ НСтр("ru = '|Файлы HTML(*.htm;*.html)|*.htm;*.html'")
		+ НСтр("ru = '|Картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf'");
	
	Возврат Фильтр;
	
КонецФункции

// Изменяет пометку удаления файлов.
//
// Параметры:
//   ВыделенныеФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//   ТекущаяПометкаУдаления - Булево - текущее значение пометки удаления файлов, которую нужно
//     изменить на противоположную.
//   ОписаниеОповещенияОЗавершении - ОписаниеОповещения - необязательный параметр, описание оповещения,
//     вызываемого после отмены.
//   ВладелецID - Строка - идентификатор владельца файлов.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Асинх Процедура ПометитьНаУдалениеСнятьПометкуФайлов(Знач ВыделенныеФайлы, Знач ТекущаяПометкаУдаления,
		Знач ОписаниеОповещенияОЗавершении = Неопределено, Знач ВладелецID = "",
		Знач УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	ВыделенныеФайлыКоличество = ВыделенныеФайлы.Количество();
	
	ТекстВопроса = "";
	Если ВыделенныеФайлыКоличество = 0 Тогда
		Возврат;
		
	ИначеЕсли ВыделенныеФайлыКоличество = 1 Тогда
		Если ТекущаяПометкаУдаления = Истина Тогда
			ТекстШаблона = НСтр("ru = 'Снять с ""%1"" пометку на удаление?'");
		Иначе
			ТекстШаблона = НСтр("ru = 'Пометить ""%1"" на удаление?'");
		КонецЕсли;
		ТекстВопроса = СтрШаблон(ТекстШаблона, ВыделенныеФайлы[0].Наименование);
		
	Иначе
		Если ТекущаяПометкаУдаления = Истина Тогда
			ТекстВопроса = НСтр("ru='Снять с выделенных файлов пометку на удаление?'");
		Иначе
			ТекстВопроса = НСтр("ru='Пометить выделенные файлы на удаление?'");
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ = Ждать ПоказатьВопросДаНетАсинх(ТекстВопроса);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПометитьНаУдалениеСнятьПометкуОбъектов(
		ВыделенныеФайлы);
	
	Для Каждого Файл Из ВыделенныеФайлы Цикл
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл %1 удален.'"), Файл.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.УдалениеФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Файл.Наименование,
			Файл.ID,
			ВладелецID,
			ТекстСообщения,,
			УникальныйИдентификаторФормы);
	КонецЦикла;
	Если ТипЗнч(Файл) = Тип("Структура") Тогда
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.УдалениеФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Файл.Наименование,
			Файл.ID,
			ВладелецID,,,
			УникальныйИдентификаторФормы);
	КонецЕсли;
	
	Если ОписаниеОповещенияОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, ВыделенныеФайлы);
	КонецЕсли;
	
КонецПроцедуры

// Раскладывает полное имя файла на составляющие.
//
// Параметры:
//   ПолноеИмяФайла - Строка - полный путь к файлу.
//   ЭтоПапка - Булево - признак того, что требуется разложить полное имя папки, а не файла.
//
// Возвращаемое значение:
//   см. ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла
//
Функция РазложитьПолноеИмяФайла(Знач ПолноеИмяФайла, ЭтоПапка = Ложь) Экспорт
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайла, ЭтоПапка);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПереопределяемый.ПриРазложенииПолногоИмениФайла(
		СтруктураИмениФайла);
	
	Возврат СтруктураИмениФайла;
	
КонецФункции

// Делает активной указанную версию файла.
//
// Параметры:
//   ИмяФайла - Строка - имя файла-владельца версии.
//   ИдентификаторФайла - Строка - идентификатор .
//   ВладелецФайла - Строка - идентификатор владельца файла-владельца версии.
//   ИдентификаторВерсии - Строка - идентификатор версии, которую следует сделать активной.
//   ОписаниеОповещения - ОписаниеОповещения - описание оповещения, вызываемого при успешном изменении.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура СделатьВерсиюАктивной(ИмяФайла, ИдентификаторФайла, ВладелецФайла, ИдентификаторВерсии,
		ОписаниеОповещения = Неопределено, УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	ТекстСообщения = "";
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СделатьВерсиюАктивной(
			ИдентификаторФайла, ИдентификаторВерсии, ТекстСообщения) Тогда
		Если ТекстСообщения = "" Тогда
			ТекстСообщения = НСтр("ru = 'Активная версия изменена.'");
		КонецЕсли;
		
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.ИзменениеАктивнойВерсииФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			ИмяФайла,
			ИдентификаторФайла,
			ВладелецФайла,
			ТекстСообщения,,
			УникальныйИдентификаторФормы);
		
		Если ОписаниеОповещения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, ИдентификаторВерсии);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Создает файл копированием.
//
// Параметры:
//   ОригиналID - Строка - идентификатор оригинала файла.
//   ОписаниеОповещения - ОписаниеОповещения - описание оповещения, вызываемого при успешном создании файла.
//
Процедура СоздатьФайлКопированием(ОригиналID, ОписаниеОповещения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОригиналID", ОригиналID);
	
	ОткрытьФорму("Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.Файл",
		ПараметрыФормы,,,,,
		ОписаниеОповещения);
	
КонецПроцедуры

// Начало создания файла из картинки из буфера.
//
// Параметры:
//   Параметры - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыНачалаСозданияФайла
//
Асинх Процедура СоздатьФайлИзБуфера(Знач Параметры) Экспорт
	
	Если Ждать ПроинициализироватьКомпонентуАсинх() Тогда
		ВставитьКартинкуИзБуфераЗавершение(Истина, Параметры);
	Иначе
		Обработчик = Новый ОписаниеОповещения("ВставитьКартинкуИзБуфераЗавершение", ЭтотОбъект, Параметры);
		УстановитьКомпоненту(Обработчик);
	КонецЕсли;
	
КонецПроцедуры

// Начало создания файла из файла на диске.
//
// Параметры:
//   Параметры - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыНачалаСозданияФайла
//
Процедура СоздатьФайлСДиска(Параметры) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами(
		Новый ОписаниеОповещения("СоздатьФайлСДискаПослеПодключенияРасширения",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры));
	
КонецПроцедуры

// Начало создания файлов ДО из файлов, перетаскиваемых с диска.
//
// Параметры:
//   МассивФайлов - Файл, Массив из Файл - список перетаскиваемых файлов.
//   Параметры - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыНачалаСозданияФайла
//
Асинх Процедура СоздатьФайлСДискаПеретаскиванием(Знач МассивФайлов, Знач Параметры) Экспорт
	
	ВыбранныеФайлы = Новый Массив;
	
	Если ТипЗнч(МассивФайлов) = Тип("Массив") Тогда
		Для Каждого Файл Из МассивФайлов Цикл
			Если ТипЗнч(Файл) = Тип("Файл") И Ждать Файл.ЭтоФайлАсинх() Тогда
				ВыбранныеФайлы.Добавить(Файл.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(МассивФайлов) = Тип("Файл") И Ждать МассивФайлов.ЭтоФайлАсинх() Тогда
		ВыбранныеФайлы.Добавить(МассивФайлов.ПолноеИмя);
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьФайлыСДискаАсинх(ВыбранныеФайлы, Параметры);
	
КонецПроцедуры

// Сохраняет версию файла на диск в указанный пользователем каталог.
//
// Параметры:
//   ID - Строка - идентификатор версии Документооборота.
//   Наименование - Строка - имя версии файла.
//   Расширение - Строка - расширение версии файла.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   ОписаниеОповещения - ОписаниеОповещения - необязательный, обработчик, вызываемый с передачей имени файла
//     после его сохранения.
//
Процедура СохранитьВерсиюКак(ID, Наименование, Расширение, УникальныйИдентификаторФормы,
		ОписаниеОповещения = Неопределено) Экспорт
	
	ДанныеВерсииФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		ID,
		"DMFileVersion",
		Расширение);
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийФайл", ДанныеВерсииФайла);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Параметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	Параметры.Вставить("ОставшиесяФайлы", Новый Массив);
	Параметры.Вставить("ИспользоватьВизуализациюШтампаЭП", Истина);
	
	СохранитьФайлыКакНачало(Параметры);
	
КонецПроцедуры

// Сохраняет изменения файла в ДО, не снимая захвата.
//
// Параметры:
//   ID - Строка - Идентификатор файла ДО.
//   Наименование - Строка - имя редактируемого файла.
//   Расширение - Строка - расширение редактируемого файла.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   ОписаниеОповещенияОЗавершении - ОписаниеОповещения - необязательный, вызывается при успешном завершении.
//   ВладелецID - Строка - идентификатор владельца файла.
//
Асинх Процедура СохранитьИзмененияРедактируемогоФайла(Знач ID, Знач Наименование, Знач Расширение,
		Знач УникальныйИдентификаторФормы, Знач ОписаниеОповещенияОЗавершении = Неопределено,
		Знач ВладелецID = "") Экспорт
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		ID,
		"DMFile",
		Расширение);
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийФайл", ТекущийФайл);
	Параметры.Вставить("ВладелецID", ВладелецID);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Параметры.Вставить("ОписаниеОповещения", ОписаниеОповещенияОЗавершении);
	
	Если Не Ждать РасширениеРаботыСФайламиПодключеноАсинх() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"СохранитьИзмененияБезРасширенияПослеПомещения",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры);
		Попытка
			ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
			ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификаторФормы;
			ФайловаяСистемаКлиент.ЗагрузитьФайл(
				ОписаниеОповещения,
				ПараметрыЗагрузки);
		Исключение
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Не удалось сохранить изменения по причине:
					|%1'"),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	СведенияОРедактировании =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла(
			ID,
			"DMFile");
	Параметры.Вставить("СведенияОРедактировании", СведенияОРедактировании);
	
	// Проверим, можно ли вообще выполнить операцию (на стороне ДО ситуация могла измениться).
	Если Не СведенияОРедактировании.Сохранен Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось сохранить изменения файла,
			|так как он сейчас не захвачен на редактирование.'"));
		Возврат;
	КонецЕсли;
	Если СведенияОРедактировании.НаЧтение Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось сохранить изменения файла,
			|так как он сейчас сохранен только для просмотра.'"));
		Возврат;
	КонецЕсли;
	
	// Проверим, существует ли файл в указанном месте.
	Файл = Новый Файл(СведенияОРедактировании.ПолныйПуть);
	Параметры.Вставить("Файл", Файл);
	Если Не Ждать Файл.СуществуетАсинх() Тогда
		Ответ = Ждать ПоказатьВопросДаНетАсинх(НСтр("ru = 'Файл не найден в рабочем каталоге. Освободить его?'"));
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СохранитьИзмененияСРасширениемПослеВопросаОбОсвобождении(Параметры);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.ТекущийФайл.Размер = Ждать Файл.РазмерАсинх();
	Параметры.ТекущийФайл.ДатаМодификации = Ждать Файл.ПолучитьВремяИзмененияАсинх();
	Параметры.ТекущийФайл.ДатаМодификацииУниверсальная = Ждать Файл.ПолучитьУниверсальноеВремяИзмененияАсинх();
	
	// Все нормально, поместим файл в ДО и освободим его.
	ТекстПояснения = СтрШаблон(НСтр("ru = 'Идет сохранение файла ""%1"" (%2). Пожалуйста, подождите...'"),
		СведенияОРедактировании.ПолныйПуть,
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.КраткоеПредставлениеРазмера(
			Параметры.ТекущийФайл.Размер));
	Состояние(ТекстПояснения);
	
	ОповещениеПослеПомещенияФайла = Новый ОписаниеОповещения(
		"СохранитьИзмененияСРасширениемПослеПомещения",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	Параметры.Вставить("ОповещениеПослеПомещенияФайла", ОповещениеПослеПомещенияФайла);
	
	Если СведенияОРедактировании.Свойство("КомментарийКВерсии") Тогда
		ОповещениеПослеВводаКомментария = Новый ОписаниеОповещения(
			"ПослеВводаОписанияВнесенныхИзменений",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры);
		ОткрытьФорму(
			"Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.ФормаВозвратаФайла",,,,,,
			ОповещениеПослеВводаКомментария,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ПослеВводаОписанияВнесенныхИзменений(КодВозвратаДиалога.ОК, Параметры);
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет файл на диск в указанный пользователем каталог.
//
// Параметры:
//   ID - Строка - идентификатор файла Документооборота.
//   Наименование - Строка - имя файла.
//   Расширение - Строка - расширение файла.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   ОписаниеОповещения - ОписаниеОповещения - необязательный, обработчик, вызываемый с передачей имени файла
//     после его сохранения.
//   ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//
Процедура СохранитьФайлКак(ID, Наименование, Расширение, УникальныйИдентификаторФормы,
		ОписаниеОповещения = Неопределено, ИспользоватьВизуализациюШтампаЭП = Истина) Экспорт
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		ID,
		"DMFile",
		Расширение);
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийФайл", ТекущийФайл);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Параметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	Параметры.Вставить("ОставшиесяФайлы", Новый Массив);
	Параметры.Вставить("ИспользоватьВизуализациюШтампаЭП", ИспользоватьВизуализациюШтампаЭП);
	
	СохранитьФайлыКакНачало(Параметры);
	
КонецПроцедуры

// Сохраняет файл или версию на диск в указанный пользователем каталог. Общая точка входа для файла и версии.
//
// Параметры:
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызов не требуется.
//
Асинх Процедура СохранитьФайлыКакНачало(Знач Параметры) Экспорт
	
	Если Не Ждать РасширениеРаботыСФайламиПодключеноАсинх() Тогда
		
		ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Идет сохранение файла ""%1"". Пожалуйста, подождите...'"),
			Параметры.ТекущийФайл.ИмяФайла);
		Состояние(ТекстПояснения);
		
		ИспользоватьВизуализациюШтампаЭП = Истина;
		Если ЗначениеЗаполнено(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла)
				И ЭтоАдресВременногоХранилища(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла) Тогда
			Адрес = Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла;
		ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFile" Тогда
			Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьФайлИПоместитьВХранилище(
				Параметры.ТекущийФайл.ID,
				ИспользоватьВизуализациюШтампаЭП,
				Параметры.УникальныйИдентификаторФормы,,
				Параметры.ТекущийФайл.Размер,
				Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
		ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFileVersion" Тогда
			Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьВерсиюФайлаИПоместитьВХранилище(
				Параметры.ТекущийФайл.ID,
				ИспользоватьВизуализациюШтампаЭП,
				Параметры.УникальныйИдентификаторФормы,
				Параметры.ТекущийФайл.Размер,
				Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип файла: %1'"), Параметры.ТекущийФайл.Тип);
		КонецЕсли;
		Параметры.Вставить("АдресВременногоХранилищаФайла", Адрес);
		Параметры.Вставить("РежимПолучения", "ВзятьИзДокументооборота");
		Параметры.Вставить("Каталог", "");
		
		ФайловаяСистемаКлиент.СохранитьФайл(
			Новый ОписаниеОповещения(
				"ПродолжитьСохранитьКакПослеВыбораИсточника",
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
				Параметры),
			Адрес,
			Параметры.ТекущийФайл.ИмяФайла);
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"СохранитьКакПослеДиалогаВыбораФайла",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	Если Параметры.ОставшиесяФайлы.Количество() = 0 Тогда
		Параметры.Вставить("РежимДиалогаВыбораФайла", РежимДиалогаВыбораФайла.Сохранение);
		Диалог = Новый ДиалогВыбораФайла(Параметры.РежимДиалогаВыбораФайла);
		Диалог.ПолноеИмяФайла = Параметры.ТекущийФайл.ИмяФайла;
		Диалог.Фильтр = СтрШаблон(НСтр("ru = 'Все файлы (*.%1)|*.%1'"), Параметры.ТекущийФайл.Расширение);
		Диалог.Показать(ОписаниеОповещения);
	Иначе
		Параметры.Вставить("РежимДиалогаВыбораФайла", РежимДиалогаВыбораФайла.ВыборКаталога);
		ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписи

// Получает таблицу значений выделенных строк подписей по выделенным срокам.
//
// Параметры:
//   ВыделенныеСтроки - Массив из Число - массив индексов выделенных строк подписей.
//   ТаблицаПодписей - ДанныеФормыКоллекция - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//   ОбъектID - Строка - идентификатор объекта-владельца подписей.
//
// Возвращаемое значение:
//   Массив из Структура:
//     * НомерСтроки - Число
//     * ОбъектID - Строка
//
Функция ВыделенныеПодписи(ВыделенныеСтроки, ТаблицаПодписей, ОбъектID = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТаблицаПодписей.НайтиПоИдентификатору(Элемент);
		
		Если Не ПустаяСтрока(ДанныеСтроки.ОбъектID) Тогда
			
			ВыделеннаяСтрока = Новый Структура("НомерСтроки, ОбъектID");
			
			ВыделеннаяСтрока.НомерСтроки = ДанныеСтроки.НомерСтроки;
			Если ОбъектID = Неопределено Тогда
				ВыделеннаяСтрока.ОбъектID = ДанныеСтроки.ОбъектID;
			Иначе
				ВыделеннаяСтрока.ОбъектID = ОбъектID;
			КонецЕсли;
			
			Результат.Добавить(ВыделеннаяСтрока);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Преобразует таблицу подписей на форме в массив структурированных данных подписей.
//
// Параметры:
//   ТаблицаПодписей - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//
// Возвращаемое значение:
//   Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеПодписи
//
Функция ДанныеПодписей(ТаблицаПодписей) Экспорт
	
	МассивДанныхПодписей = Новый Массив; // подписи, оставшиеся после удаления
	
	// формируем массив данных подписи.
	Для Каждого ДанныеСтроки Из ТаблицаПодписей Цикл
		
		ДвоичныеДанныеСертификата = Неопределено;
		Если ЗначениеЗаполнено(ДанныеСтроки.АдресСертификата) Тогда
			ДвоичныеДанныеСертификата = ПолучитьИзВременногоХранилища(ДанныеСтроки.АдресСертификата);
		КонецЕсли;
		ДанныеПодписи = ДанныеПодписи(
			ПолучитьИзВременногоХранилища(ДанныеСтроки.АдресПодписи),
			ДвоичныеДанныеСертификата,
			ДанныеСтроки);
		МассивДанныхПодписей.Добавить(ДанныеПодписи);
		
	КонецЦикла;
	
	Возврат МассивДанныхПодписей;
	
КонецФункции

// Возвращает данные, из которых будет формироваться XDTO объект DMSignature, для передачи в ДО.
//
// Параметры:
//   Подпись - ДвоичныеДанные - двоичные данные подписи.
//   ДвоичныеДанныеСертификата - ДвоичныеДанные - двоичные данные сертификата.
//   СвойстваПодписи - Структура - тут может быть или структура СвойстваПодписи, которую возвращает БСП при
//     добавлении новой подписи, или строка таблицы подписей, если это уже существующая на стороне ДО подпись.
//
// Возвращаемое значение:
//   см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеПодписи
//
Функция ДанныеПодписи(Подпись, ДвоичныеДанныеСертификата, СвойстваПодписи) Экспорт
	
	Возврат ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеПодписи(
		Подпись,
		ДвоичныеДанныеСертификата,
		СвойстваПодписи);
	
КонецФункции

// По окончании подписания отображает состояние установки подписи объекту.
//
// Параметры:
//   Представление - Строка - представление подписанного объекта для информирования пользователя о подписании.
//   ДобавленныеПодписиОбъектов - Соответствие из КлючИЗначение:
//     * Ключ - Строка - идентификатор объекта ДО, являющегося владельцем подписи.
//     * Значение - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеВладельцаПодписи
//   ДокументID - Строка - идентификатор подписанного документа.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура ИнформироватьОПодписании(Представление, ДобавленныеПодписиОбъектов, ДокументID,
		УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	Состояние(СтрШаблон(НСтр("ru = 'Установлена подпись для ""%1""'"), Представление));
	
	Для Каждого Элемент Из ДобавленныеПодписиОбъектов Цикл
		ДанныеВладельцаПодписи = Элемент.Значение;
		Если ДанныеВладельцаПодписи.Тип <> "DMFile" Тогда
			Продолжить;
		КонецЕсли;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Установлена подпись для ""%1""'"), ДанныеВладельцаПодписи.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.ИзменениеЭПФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			ДанныеВладельцаПодписи.Наименование,
			ДанныеВладельцаПодписи.ID,
			ДокументID,
			ТекстСообщения,
			Ложь,
			УникальныйИдентификаторФормы);
	КонецЦикла;
	
КонецПроцедуры

// Преобразует 2-уровневое дерево в массив.
//
// Параметры:
//   ДеревоПодписей - ДанныеФормыДерево - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//
// Возвращаемое значение:
//   Массив из Число - идентификаторы строк подписей.
//
Функция МассивПодписей(ДеревоПодписей) Экспорт
	
	МассивПодписей = Новый Массив;
	
	ЭлементыПервогоУровня = ДеревоПодписей.ПолучитьЭлементы();
	
	Для Каждого СтрокаУровняОдин Из ЭлементыПервогоУровня Цикл
		ЭлементыВторогоУровня = СтрокаУровняОдин.ПолучитьЭлементы();
		
		Для Каждого Строка Из ЭлементыВторогоУровня Цикл
			МассивПодписей.Добавить(Строка.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивПодписей;
	
КонецФункции

// Добавляет подпись из файла.
//
// Параметры:
//   СвойстваФайла - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СвойстваФайла
//
Процедура НачатьДобавлениеЭПИзФайла(СвойстваФайла) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("СвойстваФайла", СвойстваФайла);
	
	НачатьПодключениеРасширенияРаботыСФайлами(
		Новый ОписаниеОповещения(
			"НачатьДобавлениеЭПИзФайлаПослеПодключенияРасширения",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры));
	
КонецПроцедуры

// Сохраняет файл и подпись на диск.
//
// Параметры:
//   ID - Строка - идентификатор файла Документооборота.
//   Расширение - Строка - расширение файла.
//   Наименование - Строка - имя файла.
//   Размер - Число - размер файла в байтах.
//   ДатаМодификацииУниверсальная - Дата - дата модификации файла универсальная.
//   УникальныйИдентификаторФормы - Строка - идентификатор вызвавшей формы.
//   Подписи - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураПодписи
//
Процедура НачатьСохранениеВместеСЭП(ID, Расширение, Наименование, Размер, ДатаМодификацииУниверсальная,
		УникальныйИдентификаторФормы, Подписи = Неопределено) Экспорт
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		ID,
		"DMFile",
		Расширение);
	ТекущийФайл.Размер = Размер;
	ТекущийФайл.ДатаМодификацииУниверсальная = ДатаМодификацииУниверсальная;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийФайл", ТекущийФайл);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Параметры.Вставить("Подписи", Подписи);
	
	НачатьПодключениеРасширенияРаботыСФайлами(
		Новый ОписаниеОповещения(
			"НачатьСохранениеВместеСЭППослеПодключенияРасширения",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры));
	
КонецПроцедуры

// Формирует подпись для объекта Документооборот и всех его вложенных файлов.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения:
//     * Наименование - Строка
//     * Файлы - ДанныеФормыКоллекция
//   ОписаниеОповещенияОЗакрытии - ОписаниеОповещения:
//     * ДополнительныеПараметры - Структура:
//         ** МассивАдресов - Массив из Строка
//         ** МассивДанныхДляЗанесенияВБазу - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеВладельцаПодписи
//
Процедура НачатьФормированиеПодписиОбъекта(Форма, ОписаниеОповещенияОЗакрытии) Экспорт
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствует стандартная подсистема ""Электронная подпись"".'"));
		Возврат;
	КонецЕсли;
	
	МассивДанныхДляЗанесенияВБазу = ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.МассивДанныхДляЗанесенияВБазу;
	МассивФайлов = Новый Массив;
	Для Каждого Файл Из Форма.Файлы Цикл
		МассивФайлов.Добавить(Файл.ID);
	КонецЦикла;
	ДвоичныеДанныеДокумента = ПолучитьИзВременногоХранилища(Форма.АдресСлепкаДокумента);
	МассивОбъектовДляПодписи = Новый Массив;
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьОбъектыДляПодписи(
		Форма.Наименование,
		Форма.ID,
		Форма.Тип,
		МассивОбъектовДляПодписи,
		МассивФайлов,
		ДвоичныеДанныеДокумента);
	
	НаборДанных = Новый Массив;
	Для Каждого ОбъектДляПодписи Из МассивОбъектовДляПодписи Цикл
		ДанныеДляПодписи = Новый Структура;
		ДанныеДляПодписи.Вставить("Данные", ОбъектДляПодписи.ДвоичныеДанные);
		Если ОбъектДляПодписи.ОбъектСсылкаДляПодписи = Форма.ID Тогда
			ДанныеДляПодписи.Вставить("Представление",
				Новый Структура("Значение, Представление", Форма.Заголовок, Форма.Заголовок));
		ИначеЕсли ОбъектДляПодписи.ОбъектТип = "DMFile" Тогда
			Строки = Форма.Файлы.НайтиСтроки(Новый Структура("ID", ОбъектДляПодписи.ОбъектСсылкаДляПодписи));
			Если Строки.Количество() = 1 Тогда
				ПредставлениеФайла = СтрШаблон(НСтр("ru = 'Файл: %1'"), Строки[0].Наименование);
				ДанныеДляПодписи.Вставить("Представление",
					Новый Структура("Значение, Представление", ПредставлениеФайла, ПредставлениеФайла));
			Иначе
				ДанныеДляПодписи.Вставить("Представление", ОбъектДляПодписи.ОбъектТип);
			КонецЕсли;
		Иначе
			ДанныеДляПодписи.Вставить("Представление", ОбъектДляПодписи.ОбъектТип);
		КонецЕсли;
		НаборДанных.Добавить(ДанныеДляПодписи);
		МассивДанныхДляЗанесенияВБазу.Добавить(
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеВладельцаПодписи(
				ОбъектДляПодписи.ОбъектНаименование,
				ОбъектДляПодписи.ОбъектСсылкаДляПодписи,
				ОбъектДляПодписи.ОбъектТип,
				ОбъектДляПодписи.Зашифрован));
	КонецЦикла;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Подписание документа'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных", НСтр("ru = 'Документ'"));
	ОписаниеДанных.Вставить("НаборДанных", НаборДанных);
	ОписаниеДанных.Вставить("Представление", Форма.Наименование);
	ОписаниеДанных.Вставить("ПредставлениеНабора", НСтр("ru = 'Объекты (%1)'"));
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Форма", Форма);
	ПараметрыОповещения.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияОЗакрытии);
	ОбработчикЗавершения = Новый ОписаниеОповещения(
		"НачатьФормированиеПодписиОбъектаЗавершение",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		ПараметрыОповещения);
	
	МодульЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, Неопределено, ОбработчикЗавершения);
	
КонецПроцедуры

// Открывает форму просмотра подписи ЭП.
//
// Параметры:
//   ТаблицаПодписейТекущиеДанные - ДанныеФормыЭлементКоллекции - строка текущей подписи.
//
Процедура ОткрытьПодпись(ТаблицаПодписейТекущиеДанные) Экспорт
	
	Если ТаблицаПодписейТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТаблицаПодписейТекущиеДанные.Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствует стандартная подсистема ""Электронная подпись"".'"));
		Возврат;
	КонецЕсли;
	
	МодульЭлектроннаяПодписьКлиент.ОткрытьПодпись(
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей(
			ТаблицаПодписейТекущиеДанные));
	
КонецПроцедуры

// Подписывает файл в Документообороте.
//
// Параметры:
//   СвойстваФайла - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СвойстваФайла
//
Процедура ПодписатьФайл(СвойстваФайла) Экспорт
	
	Если СвойстваФайла.Редактируется Тогда
		ПоказатьПредупреждение(,
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтрокаСообщенияОНедопустимостиПодписанияЗанятогоФайла());
		Возврат;
	КонецЕсли;
	
	Если СвойстваФайла.Зашифрован Тогда
		ПоказатьПредупреждение(,
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтрокаСообщенияОНедопустимостиПодписанияЗашифрованногоФайла());
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствует стандартная подсистема ""Электронная подпись"".'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Подписание файла'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных", НСтр("ru = 'Файл'"));
	ОписаниеДанных.Вставить("Данные",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДвоичныеДанныеФайла(
			СвойстваФайла.ИдентификаторФайла,
			Ложь));
	ОписаниеДанных.Вставить("Представление", СвойстваФайла.ИмяФайла);
	ОписаниеДанных.Вставить("СписокПредставлений", Новый СписокЗначений());
	ОписаниеДанных.СписокПредставлений.Добавить(, СвойстваФайла.ИмяФайла);
	
	ОбработчикЗавершения = Новый ОписаниеОповещения(
		"ПодписатьФайлЗавершение",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		СвойстваФайла);
	
	МодульЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, Неопределено, ОбработчикЗавершения);
	
КонецПроцедуры

// Проверяет все выделенные подписи.
//
// Параметры:
//   ТаблицаПодписей - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//   ОписаниеОповещения - ОписаниеОповещения - необязательный, обработчик, вызываемый после проверки подписей.
//   ВыделенныеПодписи - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыделенныеПодписи
//   АдресСлепкаДокумента - Строка - адрес временного хранилища двоичных данных документа Документооборота.
//
Процедура ПроверитьПодписи(ТаблицаПодписей, ОписаниеОповещения = Неопределено,
		ВыделенныеПодписи = Неопределено, АдресСлепкаДокумента = Неопределено) Экспорт
	
	ЕстьПодсистемаЭП = ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись");
	Если ЕстьПодсистемаЭП Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
		МодульЭлектроннаяПодписьСлужебныйКлиентСервер =
			ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьСлужебныйКлиентСервер");
	КонецЕсли;
	
	НастройкиЭП = ОбщиеНастройкиЭП();
	
	Для Каждого ДанныеСтроки Из ТаблицаПодписей Цикл
		
		Если Не ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ПодписьВыделена(
				ВыделенныеПодписи, ДанныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЕстьПодсистемаЭП Тогда
			ДанныеСтроки.Статус = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтатусЭП(
				Истина,
				НСтр("ru = 'отсутствует стандартная подсистема ""Электронная подпись""'"));
			ДанныеСтроки.ДатаПроверкиПодписи = ТекущаяДата(); // Использование оправдано: фиксируется дата-время на клиенте.
			ДанныеСтроки.Неверна = Истина;
			ДанныеСтроки.ПодписьВерна = Ложь;
			ДанныеСтроки.КомуВыданСертификатИСтатус = ДанныеСтроки.КомуВыданСертификат + Символы.ПС + ДанныеСтроки.Статус;
			Продолжить;
		КонецЕсли;
		
		// Определим алгоритм подписи.
		Программа = Неопределено;
		Если НастройкиЭП.ОписанияПрограмм.Количество() > 1 И ЭтоАдресВременногоХранилища(ДанныеСтроки.АдресПодписи) Тогда
			ДанныеПодписи = ПолучитьИзВременногоХранилища(ДанныеСтроки.АдресПодписи);
			Если ТипЗнч(ДанныеПодписи) = Тип("ДвоичныеДанные") Тогда
				АлгоритмПодписи = МодульЭлектроннаяПодписьСлужебныйКлиентСервер.АлгоритмСформированнойПодписи(ДанныеПодписи);
				Для Каждого ОписаниеПрограммы Из НастройкиЭП.ОписанияПрограмм Цикл
					Если ОписаниеПрограммы.АлгоритмПодписи = АлгоритмПодписи Тогда
						Программа = ОписаниеПрограммы.Ссылка;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиЭП.ПроверятьЭлектронныеПодписиНаСервере Тогда
			
			ТаблицыПодписейПослеПроверки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей(ДанныеСтроки));
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПроверитьПодписи(
				ТаблицыПодписейПослеПроверки,
				ВыделенныеПодписи,
				АдресСлепкаДокумента,
				Программа);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТаблицыПодписейПослеПроверки[0]);
			
		Иначе
			
			Параметры = Новый Структура;
			Параметры.Вставить("ТаблицаПодписей", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтроки));
			Параметры.Вставить("АдресСлепкаДокумента", АдресСлепкаДокумента);
			Параметры.Вставить("ВыделенныеПодписи", ВыделенныеПодписи);
			Параметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
			
			ОповещениеПроверитьПодписиПослеСозданияМенеджера = Новый ОписаниеОповещения(
				"ПроверитьПодписиПослеСозданияМенеджера",
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
				Параметры);
			МодульЭлектроннаяПодписьКлиент.СоздатьМенеджерКриптографии(
				ОповещениеПроверитьПодписиПослеСозданияМенеджера,
				"ПроверкаПодписи",,
				Программа);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкиЭП.ПроверятьЭлектронныеПодписиНаСервере И ОписаниеОповещения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, ТаблицаПодписей);
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет подпись на диск.
//
// Параметры:
//   ТаблицаПодписейТекущиеДанные - ДанныеФормыЭлементКоллекции - строка текущей подписи.
//
Процедура СохранитьПодпись(ТаблицаПодписейТекущиеДанные) Экспорт
	
	Если ТаблицаПодписейТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТаблицаПодписейТекущиеДанные.Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствует стандартная подсистема ""Электронная подпись"".'"));
		Возврат;
	КонецЕсли;
	
	МодульЭлектроннаяПодписьКлиент.СохранитьПодпись(ТаблицаПодписейТекущиеДанные.АдресПодписи);
	
КонецПроцедуры

// Удаляет подписи документа и его файлов.
//
// Параметры:
//   УдаленныеСтроки - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыделенныеПодписи
//   ТаблицаПодписей - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//   ВладелецФайла - Строка - идентификатор общего владельца всех файлов, входящих в таблицу подписей.
//   ОписаниеОповещения - ОписаниеОповещения - необязательный, обработчик, вызываемый после удаления подписей.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Асинх Процедура УдалитьПодписи(Знач УдаленныеСтроки, Знач ТаблицаПодписей, Знач ВладелецФайла,
		Знач ОписаниеОповещения = Неопределено, Знач УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	Если УдаленныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВопросаДаНет = ПараметрыВопросаДаНет();
	ПараметрыВопросаДаНет.ТекстКнопкиДа = НСтр("ru='Удалить'");
	ПараметрыВопросаДаНет.ТекстКнопкиНет = НСтр("ru='Не удалять'");
	Ответ = Ждать ПоказатьВопросДаНетАсинх(
		НСтр("ru = 'Удалить выделенные подписи?'"),
		ПараметрыВопросаДаНет);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПодписиОбъектов = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УдалитьПодписи(
		УдаленныеСтроки,
		ТаблицаПодписей);
	
	ЕстьОтдельноеОповещение = (ОписаниеОповещения <> Неопределено);
	ОповещатьКарточкуДокументаОбИзмененииФайла = Не ЕстьОтдельноеОповещение;
	
	Для Каждого ЭлементСоответствия Из ПодписиОбъектов Цикл
		ДанныеВладельцаПодписи = ЭлементСоответствия.Значение;
		Если ДанныеВладельцаПодписи.Тип <> "DMFile" Тогда
			Продолжить;
		КонецЕсли;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Удалена подпись файла ""%1""'"), ДанныеВладельцаПодписи.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.ИзменениеЭПФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			ДанныеВладельцаПодписи.Наименование,
			ДанныеВладельцаПодписи.ID,
			ВладелецФайла,
			ТекстСообщения,
			ОповещатьКарточкуДокументаОбИзмененииФайла,
			УникальныйИдентификаторФормы);
	КонецЦикла;
	
	Если ЕстьОтдельноеОповещение Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКартинками

// Устанавливает компоненту сканирования.
//
// Параметры:
//   ОбработчикРезультата - ОписаниеОповещения
//
Асинх Процедура УстановитьКомпоненту(Знач ОбработчикРезультата) Экспорт
	
	Если ПараметрыПриложения["ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера"] = Неопределено Тогда
		КодВозврата = Ждать ПодключитьВнешнююКомпонентуАсинх(
			"ОбщийМакет.ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера",
			"ImageFromClipboard",
			ТипВнешнейКомпоненты.Native);
		
		Если КодВозврата Тогда
			Состояние(НСтр("ru = 'Компонента сканирования уже установлена.'"));
		Иначе
			
			ПараметрыВыполнения = Новый Структура;
			ПараметрыВыполнения.Вставить("ОбработчикРезультата", ОбработчикРезультата);
			
			ОписаниеОповещения = Новый ОписаниеОповещения(
				"НачатьУстановкуВнешнейКомпонентыПродолжение",
				ЭтотОбъект,
				ПараметрыВыполнения);
			НачатьУстановкуВнешнейКомпоненты(
				ОписаниеОповещения,
				"ОбщийМакет.ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера");
			Возврат;
			
		КонецЕсли;
		ПараметрыПриложения["ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера"] =
			Новый("AddIn.ImageFromClipboard.AddInNativeExtension");
	Иначе
		Состояние(НСтр("ru = 'Компонента сканирования уже установлена.'"));
	КонецЕсли;
	
КонецПроцедуры

// Продолжение установки компоненты.
//
// Параметры:
//   ПараметрыВыполнения - Структура:
//     * ОбработчикРезультата - ОписаниеОповещения
//
Процедура НачатьУстановкуВнешнейКомпонентыПродолжение(ПараметрыВыполнения) Экспорт
	
	ПараметрыВыполненияДляПодключения = Новый Структура;
	ПараметрыВыполненияДляПодключения.Вставить("ОбработчикРезультата", ПараметрыВыполнения.ОбработчикРезультата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"НачатьПодключениеВнешнейКомпонентыПродолжение",
		ЭтотОбъект,
		ПараметрыВыполненияДляПодключения);
	
	НачатьПодключениеВнешнейКомпоненты(
		ОписаниеОповещения,
		"ОбщийМакет.ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера",
		"ImageFromClipboard",
		ТипВнешнейКомпоненты.Native);
	
КонецПроцедуры

// Продолжение установки компоненты.
//
// Параметры:
//   Подключена - Булево - компонента подключена.
//   ПараметрыВыполнения - Структура:
//     * ОбработчикРезультата - ОписаниеОповещения
//
Процедура НачатьПодключениеВнешнейКомпонентыПродолжение(Подключена, ПараметрыВыполнения) Экспорт
	
	Если Подключена Тогда
		
		ПараметрыПриложения["ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера"] =
			Новый("AddIn.ImageFromClipboard.AddInNativeExtension");
		ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОбработчикРезультата, Подключена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Задачи

// Открывает формы получения объектов адресации роли.
//
// Параметры:
//   ОписаниеОповещенияОЗакрытии - ОписаниеОповещения - описание оповещения о закрытии.
//   ИмяРоли - Строка - имя роли для получения объектов адресации.
//   ТипРоли - Строка - тип роли для получения объектов адресации.
//   IDРоли - Строка - идентификатор роли в Документообороте.
//   ФормаВладелец - ФормаКлиентскогоПриложения - управляемая форма, на которой выбирается роль.
//
Процедура ПоказатьПолучениеОбъектовАдресацииРоли(ОписаниеОповещенияОЗакрытии, ИмяРоли, ТипРоли, IDРоли,
		ФормаВладелец) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Роль", ИмяРоли);
	ПараметрыФормы.Вставить("РольID", IDРоли);
	ПараметрыФормы.Вставить("РольТип", ТипРоли);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОписаниеОповещенияОЗакрытии", ОписаниеОповещенияОЗакрытии);
	ПараметрыОповещения.Вставить("ИмяРоли", ИмяРоли);
	ПараметрыОповещения.Вставить("ТипРоли", ТипРоли);
	ПараметрыОповещения.Вставить("IDРоли", IDРоли);
	ПараметрыОповещения.Вставить("ФормаВладелец", ФормаВладелец);
	
	Оповещение = Новый ОписаниеОповещения(
		"ПоказатьПолучениеОбъектовАдресацииРолиЗавершение",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		ПараметрыОповещения);
	
	ФормаВыбора = ОткрытьФорму(
		"Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.ВыборРолиИсполнителя",
		ПараметрыФормы,
		ФормаВладелец,,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	Если ФормаВыбора = Неопределено Тогда
		Результат = Новый Структура("Результат", "БезОбъектовАдресации");
		ВыполнитьОбработкуОповещения(Оповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать
// ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФормуПрисоединенныеФайлы.
// Открывает список файлов, присоединенных к объекту ИС.
//
// Параметры:
//   ВладелецФайла - ЛюбаяСсылка - источник команды, объект ИС - владелец файлов.
//   ТекущийФайл - Строка - идентификатор текущего файла, на котором нужно спозиционировать список.
//   ТолькоПросмотр - Булево - режим открытия формы.
//   ВладелецФормы - ФормаКлиентскогоПриложения - форма, из которой вызвана команда.
//   Уникальность - Произвольный - ключ уникальности, с которым должна быть открыта форма присоединенных файлов.
//   Окно - ОкноКлиентскогоПриложения - необязательный параметр, окно формы-владельца.
//   ПравилоИнтеграции - СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом
//                     - СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом3 - подходящее правило интеграции.
//   ВладелецФайлаID - Строка - идентификатор объекта ДО, являющегося владельцем файла.
//   ВладелецФайлаТип - Строка - тип объекта ДО, являющегося владельцем файла.
//   ПредставлениеВладельца - Строка - представление объекта ДО, являющегося владельцем файла.
//
Процедура ОткрытьПрисоединенныеФайлы(ВладелецФайла, ТекущийФайл = Неопределено, ТолькоПросмотр = Ложь,
		ВладелецФормы = Неопределено, Уникальность = Неопределено, Окно = Неопределено, ПравилоИнтеграции = Неопределено,
		ВладелецФайлаID = "", ВладелецФайлаТип = "", ПредставлениеВладельца= "") Экспорт
	
	ПараметрыОткрытия = ПараметрыОткрытияСпискаФайлов(ВладелецФормы);
	ПараметрыОткрытия.ТекущийФайл = ТекущийФайл;
	ПараметрыОткрытия.ТолькоПросмотр = ТолькоПросмотр;
	ПараметрыОткрытия.Уникальность = Уникальность;
	ПараметрыОткрытия.Окно = Окно;
	ПараметрыОткрытия.ПравилоИнтеграции = ПравилоИнтеграции;
	ПараметрыОткрытия.ВладелецФайлаID = ВладелецФайлаID;
	ПараметрыОткрытия.ВладелецФайлаТип = ВладелецФайлаТип;
	ПараметрыОткрытия.ПредставлениеВладельца = ПредставлениеВладельца;
	
	ОткрытьФормуПрисоединенныеФайлы(
		ВладелецФайла,
		ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаОповещения

#Область ОбработкаОповещенияФайлы

Процедура ВставитьКартинкуИзБуфераЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу =
		ПараметрыПриложения["ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера"].ПолучитьКартинкуИзБуфера();
	
	Если Не ПустаяСтрока(ПутьКФайлу) Тогда
		Параметры.Вставить("ПолноеИмяФайла", ПутьКФайлу);
		Параметры.Вставить("УдалитьФайлПослеПомещения", Истина);
		СоздатьФайлыСДискаАсинх(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПутьКФайлу), Параметры);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Буфер обмена не содержит картинки'"));
	КонецЕсли;
	
КонецПроцедуры

// Продолжает добавление файла с диска после поиска связанного объекта ДО.
//
// Параметры:
//   ОбъектДО - Структура:
//     * ID - Строка
//     * type - Строка
//     * name - Строка
//     * documentType - Структура:
//       ** ID - Строка
//       ** type - Строка
//       ** name - Строка
//     * ВнешнийОбъект - ЛюбаяСсылка
//     * СостояниеРазрешаетДобавлениеСканКопии - Булево
//     * СостояниеРазрешаетДобавлениеФайла - Булево
//     * СостояниеРазрешаетИзменениеЭП - Булево
//     * СостояниеРазрешаетРедактированиеФайла - Булево
//     * СостояниеРазрешаетУдалениеФайла - Булево
//   Параметры - Структура:
//     * ВладелецФайла - ЛюбаяСсылка - источник команды, объект ИС - владелец файлов.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Асинх Процедура ДобавитьФайлСДискаКОбъектуИСПослеПоискаОбъектаДО(Знач ОбъектДО, Знач Параметры) Экспорт
	
	Если ТипЗнч(ОбъектДО) <> Тип("Структура") Или Не ЗначениеЗаполнено(ОбъектДО.ID) Тогда
		Возврат;
	КонецЕсли;
	
	НеобходимоДобавитьСканКопию = Ждать НеобходимоДобавитьСканКопиюАсинх(
		ОбъектДО.СостояниеРазрешаетДобавлениеСканКопии,
		ОбъектДО.СостояниеРазрешаетДобавлениеФайла);
	
	Если НеобходимоДобавитьСканКопию = КодВозвратаДиалога.Да Тогда
		ПараметрыНачалаСоздания = ПараметрыНачалаСозданияФайла();
		ПараметрыНачалаСоздания.ЯвляетсяСканКопией = (ОбъектДО.СостояниеРазрешаетДобавлениеСканКопии
			И Не ОбъектДО.СостояниеРазрешаетДобавлениеФайла);
		ПараметрыНачалаСоздания.ВладелецID = ОбъектДО.ID;
		ПараметрыНачалаСоздания.ВладелецТип = ОбъектДО.type;
		ПараметрыНачалаСоздания.УникальныйИдентификаторФормы = Параметры.УникальныйИдентификаторФормы;
		ПараметрыНачалаСоздания.ВладелецПредставление = Строка(Параметры.ВладелецФайла);
		ПараметрыНачалаСоздания.Владелец = Параметры.ВладелецФайла;
		СоздатьФайлСДиска(ПараметрыНачалаСоздания);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет освобождение файла в ДО после разрешения пользователя.
//
// Параметры:
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура ЗакончитьРедактированиеСРасширениемПослеВопросаОбОсвобождении(Параметры)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОсвободитьФайл(
		Параметры.ТекущийФайл.ID);
	
	// Удалим сведения о редактировании файла.
	СведенияОРедактировании = Параметры.СведенияОРедактировании;
	СведенияОРедактировании.Сохранен = Ложь;
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьСведенияОРедактированииФайла(
		СведенияОРедактировании);
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл %1 обновлен и освобожден.'"), Параметры.ТекущийФайл.Наименование);
	ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
	ДействиеНадФайлом.РедактированиеФайлаЗавершено = Истина;
	ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
	ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
	ИнформироватьОбИзмененииФайла(
		ДействиеНадФайлом,
		Параметры.ТекущийФайл.Наименование,
		Параметры.ТекущийФайл.ID,
		Параметры.ВладелецID,
		ТекстСообщения,,
		Параметры.УникальныйИдентификаторФормы);
	Если Параметры.ОписаниеОповещения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Параметры.ТекущийФайл);
	КонецЕсли;
	
КонецПроцедуры

// Завершает помещение файла в ДО без использования расширения работы с файлами.
//
// Параметры:
//   ПомещенныйФайл - Структура - если файл помещен в хранилище:
//     * Хранение - Строка - адрес данных файла во временном хранилище.
//     * Имя - Строка - полный путь к помещенному файлу.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура ЗакончитьРедактированиеБезРасширенияПослеПомещения(ПомещенныйФайл, Параметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("АдресВременногоХранилищаФайла", ПомещенныйФайл.Хранение);
	Параметры.Вставить("ОсвободитьФайл", Истина);
	Параметры.Вставить("ОбновитьСведенияОРедактировании", Истина);
	
	// Получим расширение: оно могло измениться.
	СтруктураИмени = РазложитьПолноеИмяФайла(ПомещенныйФайл.Имя);
	Параметры.ТекущийФайл.Расширение = СтруктураИмени.Расширение;
	
	// Удалим параметры, которые передавать на сервер нельзя и не нужно.
	ОписаниеОповещения = Параметры.ОписаниеОповещения;
	Параметры.Удалить("ОписаниеОповещения");
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОбновитьФайлДвоичнымиДаннымиВременногоХранилища(
			Параметры) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл %1 обновлен и освобожден.'"), Параметры.ТекущийФайл.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.РедактированиеФайлаЗавершено = Истина;
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ID,
			Параметры.ВладелецID,
			ТекстСообщения,,
			Параметры.УникальныйИдентификаторФормы);
		Если ОписаниеОповещения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, Параметры.ТекущийФайл);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Завершает помещение файла в ДО с использованием расширения для работы с файлами.
//
// Параметры:
//   ПомещенныйФайл - Структура - если файл помещен в хранилище:
//     * Хранение - Строка - адрес данных файла во временном хранилище.
//     * Имя - Строка - полный путь к помещенному файлу.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла.
//     * Файл - Файл - помещаемый файл в рабочем каталоге.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Асинх Процедура ЗакончитьРедактированиеСРасширениемПослеПомещения(Знач ПомещенныйФайл, Знач Параметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("АдресВременногоХранилищаФайла", ПомещенныйФайл.Хранение);
	Параметры.Вставить("ОсвободитьФайл", Истина);
	Параметры.Вставить("ОбновитьСведенияОРедактировании", Истина);
	
	// Извлечем текст, если необходимо.
	НастройкиДокументооборот = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ПолучитьНастройки();
	Если НастройкиДокументооборот.НужноИзвлечьТекст Тогда
		Параметры.ТекущийФайл.Текст = Ждать ИзвлечьТекстАсинх(Параметры.СведенияОРедактировании.ПолныйПуть);
	КонецЕсли;
	
	// Удалим параметры, которые передавать на сервер нельзя и не нужно.
	ОписаниеОповещения = Параметры.ОписаниеОповещения;
	Параметры.Удалить("ОписаниеОповещения");
	Файл = Параметры.Файл;
	Параметры.Удалить("Файл");
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОбновитьФайлДвоичнымиДаннымиВременногоХранилища(
			Параметры) Тогда
		Если Не Ждать Файл.ПолучитьТолькоЧтениеАсинх() Тогда
			Ждать Файл.УстановитьТолькоЧтениеАсинх(Истина);
		КонецЕсли;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл %1 обновлен и освобожден.'"), Параметры.ТекущийФайл.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.РедактированиеФайлаЗавершено = Истина;
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ID,
			Параметры.ВладелецID,
			ТекстСообщения,,
			Параметры.УникальныйИдентификаторФормы);
		Если ОписаниеОповещения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, Параметры.ТекущийФайл);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после получения файлов и отправляет их на печать.
//
// Параметры:
//   ПолныеИменаФайлов - Массив из Строка - массив строк, содержащий полные имена полученных файлов.
//   Параметры - Произвольный - не используется.
//
Процедура НапечататьФайлыПослеПолучения(ПолныеИменаФайлов, Параметры) Экспорт
	
	Для Каждого ПолноеИмяФайла Из ПолныеИменаФайлов Цикл
		НапечататьФайлПриложением(ПолноеИмяФайла);
	КонецЦикла;
	
КонецПроцедуры

// Вызывается в ходе обновления из файла на диске после помещения файла без использования расширения.
//
// Параметры:
//   ОписаниеПомещенногоФайла - ОписаниеПомещенногоФайла - содержит описание помещенного во временное хранилище файла.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОсвободитьФайл - Булево - указывает нужно ли освободить файл.
//     * ОбновитьСведенияОРедактировании - Булево - указывает нужно ли обновить сведения о редактировании.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура ОбновитьИзФайлаНаДискеПослеПомещенияФайлаБезРасширения(ОписаниеПомещенногоФайла, Параметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Или ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("АдресВременногоХранилищаФайла", ОписаниеПомещенногоФайла.Адрес);
	
	Если ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл <> Неопределено Тогда
		Параметры.ТекущийФайл.Расширение = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.Расширение;
	КонецЕсли;
	
	// Удалим параметры, которые передавать на сервер нельзя и не нужно.
	ОписаниеОповещения = Параметры.ОписаниеОповещения;
	Параметры.Удалить("ОписаниеОповещения");
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОбновитьФайлДвоичнымиДаннымиВременногоХранилища(
			Параметры) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл %1 обновлен.'"), Параметры.ТекущийФайл.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.РедактированиеФайла = Истина; // Создает новую версию файла, но не завершает его редактирование.
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ID,
			Параметры.ВладелецID,
			ТекстСообщения,,
			Параметры.УникальныйИдентификаторФормы);
		Если ОписаниеОповещения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, Параметры.ТекущийФайл);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в ходе обновления из файла на диске после помещения файла с использованием расширения.
//
// Параметры:
//   ОписаниеПомещенногоФайла - ОписаниеПомещенногоФайла - содержит описание помещенного во временное хранилище файла.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОсвободитьФайл - Булево - указывает нужно ли освободить файл.
//     * ОбновитьСведенияОРедактировании - Булево - указывает нужно ли обновить сведения о редактировании.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Асинх Процедура ОбновитьИзФайлаНаДискеПослеПомещенияФайлаСРасширением(Знач ОписаниеПомещенногоФайла,
		Знач Параметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено
			Или ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено
			Или ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("АдресВременногоХранилищаФайла", ОписаниеПомещенногоФайла.Адрес);
	ПолныйПуть = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
	Параметры.ТекущийФайл.Расширение = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.Расширение;
	
	Файл = Новый Файл(ПолныйПуть);
	ВремяИзмененияВыбранное = Ждать Файл.ПолучитьУниверсальноеВремяИзмененияАсинх();
	ДатаМодификацииВыбранная = МестноеВремя(ВремяИзмененияВыбранное);
	
	Если ДатаМодификацииВыбранная < Параметры.ТекущийФайл.ДатаМодификации Тогда // В хранилище более новый.
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Файл ""%1""
				|в хранилище файлов имеет более позднюю дату изменения (%2),
				|чем выбранный файл (%3).
				|
				|Операция прервана.'"),
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ДатаМодификации,
			ДатаМодификацииВыбранная);
		
		ПоказатьПредупреждение(,ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Параметры.ТекущийФайл.Размер = Ждать Файл.РазмерАсинх();
	Параметры.ТекущийФайл.ДатаМодификации = Ждать Файл.ПолучитьВремяИзмененияАсинх();
	Параметры.ТекущийФайл.ДатаМодификацииУниверсальная = ВремяИзмененияВыбранное;
	
	// Извлечем текст, если необходимо.
	НастройкиДокументооборот = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ПолучитьНастройки();
	Если НастройкиДокументооборот.НужноИзвлечьТекст Тогда
		Параметры.ТекущийФайл.Текст = Ждать ИзвлечьТекстАсинх(ПолныйПуть);
	КонецЕсли;
	
	// Удалим параметры, которые передавать на сервер нельзя и не нужно.
	ОписаниеОповещения = Параметры.ОписаниеОповещения;
	Параметры.Удалить("ОписаниеОповещения");
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОбновитьФайлДвоичнымиДаннымиВременногоХранилища(
			Параметры) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл %1 обновлен.'"), Параметры.ТекущийФайл.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.РедактированиеФайла = Истина; // Создает новую версию файла, но не завершает его редактирование.
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ID,
			Параметры.ВладелецID,
			ТекстСообщения,,
			Параметры.УникальныйИдентификаторФормы);
		Если ОписаниеОповещения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, Параметры.ТекущийФайл);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Продолжение процедуры ПолучениеФайлаПослеПолученияИзДокументооборота.
//
// Параметры:
//   ПолучаемыеФайлы - Массив из ОписаниеПереданногоФайла
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * НаЧтение - Булево - Истина, если файлы сохраняются на чтение, и Ложь, если на редактирование.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается с передачей массива полных имен файлов.
//     * ПолныеИменаФайлов - Массив из Строка - полные имена уже полученных файлов.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла.
//     * КаталогВременныхФайлов - Строка - каталог для сохранения временного файла.
//     * ИмяВременногоФайла - Строка - имя, под которым будет сохранен файл.
//     * АдресВременногоХранилищаФайла - Строка - адрес, где хранится полученный из ДО файл.
//
Асинх Процедура ОбработатьФайлПослеПолученияИзДокументооборота(Знач ПолучаемыеФайлы, Знач Параметры) Экспорт
	
	// Удаляем файл из временного хранилища после записи на диск.
	Если ЭтоАдресВременногоХранилища(Параметры.АдресВременногоХранилищаФайла) Тогда
		УдалитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаФайла);
	КонецЕсли;
	
	Если ТипЗнч(ПолучаемыеФайлы) = Тип("Массив") И ПолучаемыеФайлы.Количество() > 0 Тогда
		
		ИмяВременногоФайла = ПолучаемыеФайлы[0].ПолноеИмя;
		
		СведенияОРедактировании = Неопределено;
		Если Параметры.Свойство("СведенияОРедактировании", СведенияОРедактировании) Тогда // Обновим их.
			
			СведенияОРедактировании.Вставить("Сохранен", Истина);
			СведенияОРедактировании.Вставить("ПолныйПуть", ИмяВременногоФайла);
			СведенияОРедактировании.Вставить("ДатаСохранения", ТекущаяДата()); // Использование оправдано: фиксируется дата-время на клиенте.
			Если Не СведенияОРедактировании.Свойство("НаЧтение") Тогда
				СведенияОРедактировании.Вставить("НаЧтение", Параметры.НаЧтение);
			Иначе
				СведенияОРедактировании.НаЧтение = СведенияОРедактировании.НаЧтение И Параметры.НаЧтение;
			КонецЕсли;
			СведенияОРедактировании.Вставить("ДатаМодификацииУниверсальная", Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
			СведенияОРедактировании.Вставить("Размер", Параметры.ТекущийФайл.Размер);
			
			// При сохранении передаем полученный ранее идентификатор текущей версии, а не файла.
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьСведенияОРедактированииФайла(
				СведенияОРедактировании);
			
		КонецЕсли;
		
		Если Ждать РасширениеРаботыСФайламиПодключеноАсинх() Тогда
			Файл = Новый Файл(ИмяВременногоФайла);
			Если ЗначениеЗаполнено(Параметры.ТекущийФайл.ДатаМодификацииУниверсальная) Тогда
				Ждать Файл.УстановитьУниверсальноеВремяИзмененияАсинх(Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
			КонецЕсли;
			Если Параметры.НаЧтение Тогда
				Ждать Файл.УстановитьТолькоЧтениеАсинх(Истина);
			КонецЕсли;
		КонецЕсли;
		
		Параметры.ПолныеИменаФайлов.Добавить(ИмяВременногоФайла);
		
	КонецЕсли;
	
	ПолучитьФайлыНачало(Параметры);
	
КонецПроцедуры

// Продолжение процедуры открытия списка файлов.
//
// Параметры:
//   ВладелецФайла - ЛюбаяСсылка - источник команды, объект ИС-владелец файлов.
//   ПараметрыОткрытия - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыОткрытияСпискаФайлов
//
Процедура ОткрытьПрисоединенныеФайлыЗавершение(ВладелецФайла, ПараметрыОткрытия) Экспорт
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ПрисоединенныеФайлы";
		Если ВладелецФайла = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не указан владелец файла в интегрированной системе.'"));
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот3.Форма.ПрисоединенныеФайлы";
		
	Иначе
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ВладелецФайла", ВладелецФайла);
	
	ВладелецФормы = ПараметрыОткрытия.ВладелецФормы;
	ПараметрыОткрытия.Удалить("ВладелецФормы");
	
	Окно = ПараметрыОткрытия.Окно;
	ПараметрыОткрытия.Удалить("Окно");
	
	Если ЗначениеЗаполнено(ПараметрыОткрытия.Уникальность) Тогда
		Уникальность = ПараметрыОткрытия.Уникальность;
	Иначе
		Уникальность = ВладелецФайла;
	КонецЕсли;
	
	ОткрытьФорму(
		ИмяФормы,
		ПараметрыОткрытия,
		ВладелецФормы,
		Уникальность,
		Окно);
	
КонецПроцедуры

// Открывает файлы приложением после их получения.
//
// Параметры:
//   ПолныеИменаФайлов - Массив из Строка - массив полных имен полученных из ДО файлов.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * ОписаниеОповещенияОЗавершении - ОписаниеОповещения - вызывается при успешном завершении.
//                                     - Неопределено - вызывать ничего не нужно.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * НаЧтение - Булево
//
Процедура ОткрытьФайлыПослеПолучения(ПолныеИменаФайлов, Параметры) Экспорт
	
	Для Каждого ПолноеИмяФайла Из ПолныеИменаФайлов Цикл
		ОткрытьФайлПриложением(ПолноеИмяФайла);
	КонецЦикла;
	
	Если Параметры.НаЧтение = Ложь Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Начато редактирование файла %1.'"), Параметры.ТекущийФайл.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.РедактированиеФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ID,
			Параметры.ВладелецID,
			ТекстСообщения,,
			Параметры.УникальныйИдентификаторФормы);
	КонецЕсли;
	
	Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ОписаниеОповещенияОЗавершении")
			И Параметры.ОписаниеОповещенияОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Параметры.ТекущийФайл);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в ходе получения файла после выбора источника: взять из ДО или использовать существующий.
//
// Параметры:
//   Результат - Строка - "ВзятьИзДокументооборота" или "ИспользоватьСуществующий".
//             - Неопределено - если пользователь отказался от выбора.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * НаЧтение - Булево - Истина, если файлы сохраняются на чтение, и Ложь, если на редактирование.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается с передачей массива полных имен файлов.
//     * ПолныеИменаФайлов - Массив из Строка - полные имена уже полученных файлов.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла.
//     * КаталогВременныхФайлов - Строка - каталог для сохранения временного файла.
//     * ИмяВременногоФайла - Строка - имя, под которым будет сохранен файл.
//     * ОбновитьСведенияОРедактировании - Булево
//
Асинх Процедура ПолучениеФайлаПослеВыбораИсточника(Знач Результат, Знач Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда // Отмена.
		Возврат;
	КонецЕсли;
	
	Если Результат = "ВзятьИзДокументооборота" Тогда
		
		// Получим файл из ДО на сервере.
		ИспользоватьВизуализациюШтампаЭП = Истина;
		Если ЗначениеЗаполнено(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла)
				И ЭтоАдресВременногоХранилища(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла) Тогда
			Адрес = Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла;
		ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFile" Тогда
			Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьФайлИПоместитьВХранилище(
				Параметры.ТекущийФайл.ID,
				ИспользоватьВизуализациюШтампаЭП,
				Параметры.УникальныйИдентификаторФормы,
				?(Параметры.НаЧтение, Неопределено, ТекущаяДата()), // Использование оправдано: фиксируется дата-время на клиенте.
				Параметры.ТекущийФайл.Размер,
				Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
		ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFileVersion" Тогда
			Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьВерсиюФайлаИПоместитьВХранилище(
				Параметры.ТекущийФайл.ID,
				ИспользоватьВизуализациюШтампаЭП,
				Параметры.УникальныйИдентификаторФормы,
				Параметры.ТекущийФайл.Размер,
				Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип файла: %1'"), Параметры.ТекущийФайл.Тип);
		КонецЕсли;
		Параметры.Вставить("АдресВременногоХранилищаФайла", Адрес);
		
		Файл = Новый Файл(Параметры.ИмяВременногоФайла);
		Попытка
			Ждать Файл.УстановитьТолькоЧтениеАсинх(Ложь);
		Исключение
			ПоказатьПредупреждение(,
				НСтр("ru = 'Не удалось заменить файл на диске файлом из 1С:Документооборота.
					|Возможно, он заблокирован другим приложением.'"));
			Возврат;
		КонецПопытки;
		
		ПолучениеФайлаПослеПолученияИзДокументооборота(Параметры);
		
	ИначеЕсли Результат = "ИспользоватьСуществующий" Тогда
		
		Если Параметры.СведенияОРедактировании.НаЧтение И Не Параметры.НаЧтение Тогда
			Параметры.СведенияОРедактировании.НаЧтение = Ложь;
			Параметры.ОбновитьСведенияОРедактировании = Истина;
			Файл = Новый Файл(Параметры.ИмяВременногоФайла);
			Попытка
				Ждать Файл.УстановитьТолькоЧтениеАсинх(Ложь);
			Исключение
				ПоказатьПредупреждение(,
					НСтр("ru = 'Не удалось открыть файл для редактирования. Возможно,
						|он заблокирован другим приложением.'"));
				ПолучитьФайлыНачало(Параметры);
			КонецПопытки;
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЗахватитьФайл(
				Параметры.ТекущийФайл.ID,
				ТекущаяДата()); // Использование оправдано: фиксируется дата-время на клиенте.
		КонецЕсли;
		Если Параметры.ОбновитьСведенияОРедактировании Тогда
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьСведенияОРедактированииФайла(
				Параметры.СведенияОРедактировании);
		КонецЕсли;
		
		Параметры.ПолныеИменаФайлов.Добавить(Параметры.ИмяВременногоФайла);
		ПолучитьФайлыНачало(Параметры);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после ввода комментария к версии файла.
//
// Параметры:
//   Результат - КодВозвратаДиалога - ответ пользователя.
//   Параметры - Структура:
//     * ОповещениеПослеПомещенияФайла - ОписаниеОповещения - описание процедуры,
//         которая будет вызвана в случае успешного помещения файлов.
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла.
//     * Файл - Файл - помещаемый файл в рабочем каталоге.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура ПослеВводаОписанияВнесенныхИзменений(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПослеПомещенияФайла = Параметры.ОповещениеПослеПомещенияФайла;
	Параметры.Удалить("ОповещениеПослеПомещенияФайла");
	
	Попытка
		ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
		ПараметрыЗагрузки.Интерактивно = Ложь;
		ПараметрыЗагрузки.ИдентификаторФормы = Параметры.УникальныйИдентификаторФормы;
		ФайловаяСистемаКлиент.ЗагрузитьФайл(
			ОповещениеПослеПомещенияФайла,
			ПараметрыЗагрузки,
			Параметры.СведенияОРедактировании.ПолныйПуть);
	Исключение
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Не удалось сохранить изменения по причине:
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецПопытки;
	
КонецПроцедуры

// Продолжение процедуры СохранитьКакПослеВыбораИсточника.
//
// Параметры:
//   ПолучаемыеФайлы - Массив из ОписаниеПереданногоФайла
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ПолныйПуть - Строка - полный путь к файлу в выбранном пользователем каталоге.
//     * ПолноеИмяФайла - Строка - полный путь к файлу в выбранном пользователем каталоге.
//     * Каталог - Строка - каталог, куда нужно сохранить файлы.
//     * ИмяВременногоФайла - Строка - имя временного файла.
//     * РежимДиалогаВыбораФайла - РежимДиалогаВыбораФайла - режим диалога выбора файла.
//     * РежимПолучения - Строка - режим получения.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Асинх Процедура ПродолжитьСохранитьКакПослеВыбораИсточника(Знач ПолучаемыеФайлы, Знач Параметры) Экспорт
	
	Если ТипЗнч(ПолучаемыеФайлы) = Тип("Массив") И ПолучаемыеФайлы.Количество() > 0 Тогда
		ПолныйПуть = ПолучаемыеФайлы[0].ПолноеИмя;
		Если Параметры.РежимПолучения = "ВзятьИзДокументооборота" Тогда
			УдалитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаФайла);
			Если Ждать РасширениеРаботыСФайламиПодключеноАсинх()
					И ЗначениеЗаполнено(Параметры.ТекущийФайл.ДатаМодификацииУниверсальная) Тогда
				Файл = Новый Файл(ПолныйПуть);
				Ждать Файл.УстановитьУниверсальноеВремяИзмененияАсинх(Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
			КонецЕсли;
		КонецЕсли;
		Состояние(НСтр("ru = 'Файл сохранен.'"),, ПолныйПуть);
	КонецЕсли;
	
	Если Параметры.ОставшиесяФайлы.Количество() <> 0 И ЗначениеЗаполнено(Параметры.Каталог) Тогда
		ЗаполнитьЗначенияСвойств(Параметры.ТекущийФайл, Параметры.ОставшиесяФайлы[0]);
		ВыбранныеФайлы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.Каталог);
		Параметры.ОставшиесяФайлы.Удалить(0);
		СохранитьКакПослеДиалогаВыбораФайла(ВыбранныеФайлы, Параметры);
	ИначеЕсли Параметры.ОписаниеОповещения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Параметры);
	КонецЕсли;
	
КонецПроцедуры

// Выполняется в ходе создания файла с диска после подключения расширения.
//
// Параметры:
//   Подключено - Булево - Истина, если расширение подключено.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * Владелец - ЛюбаяСсылка - владелец файла.
//     * ВладелецID - Строка - идентификатор владельца файла в Документообороте.
//     * ВладелецТип - Строка - тип XDTO владельца файла в Документообороте.
//     * ВладелецПредставление - Строка - представление владельца файла.
//     * ПолныеИменаФайлов - Массив из Строка - имена добавленных файлов.
//     * ПомещенныеФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ЯвляетсяСканКопией - Булево - признак скан-копии.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура СоздатьФайлСДискаПослеПодключенияРасширения(Подключено, Параметры) Экспорт
	
	Если Подключено Тогда
		
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.МножественныйВыбор = Истина;
		Если Параметры.ЯвляетсяСканКопией Тогда
			ВыборФайла.Заголовок = НСтр("ru = 'Выбор скан-копии оригинала документа'");
			
			СтрокаРасширений = "";
			ФильтрПоРасширениям = "";
			НастройкиДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ПолучитьНастройки();
			СписокРасширенийСканКопийОригиналов = НастройкиДО.СписокРасширенийСканКопийОригиналов;
			СписокРасширенийСканКопийОригиналов = СтрЗаменить(СписокРасширенийСканКопийОригиналов, " ", ",");
			СписокРасширенийСканКопийОригиналов = СтрЗаменить(СписокРасширенийСканКопийОригиналов, ";", ",");
			МассивРасширенийСканКопий = СтрРазделить(СписокРасширенийСканКопийОригиналов, ",", Ложь);
			Для Каждого Расширение Из МассивРасширенийСканКопий Цикл
				СтрокаРасширений = СтрокаРасширений + Расширение + ", ";
				ФильтрПоРасширениям = ФильтрПоРасширениям + "*." + Расширение + ";";
			КонецЦикла;
			
			Если ЗначениеЗаполнено(СтрокаРасширений) Тогда
				СтрокаРасширений = Лев(СтрокаРасширений, СтрДлина(СтрокаРасширений) - 2);
				ФильтрПоРасширениям = Лев(ФильтрПоРасширениям, СтрДлина(ФильтрПоРасширениям) - 1);
				ВыборФайла.Фильтр = СтрШаблон(НСтр("ru = 'Скан-копии (%1)|%2|Все файлы (*.*)|*.*'"),
					СтрокаРасширений, ФильтрПоРасширениям);
			Иначе
				ВыборФайла.Фильтр = ПолучитьФильтрДляДиалогаВыбораФайла();
			КонецЕсли;
		Иначе
			ВыборФайла.Заголовок = НСтр("ru = 'Выбор файла'");
			ВыборФайла.Фильтр = ПолучитьФильтрДляДиалогаВыбораФайла();
		КонецЕсли;
		ВыборФайла.Показать(
			Новый ОписаниеОповещения(
				"СоздатьФайлыСДискаАсинх",
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
				Параметры));
		
	Иначе // Веб-клиент без расширения.
		
		Попытка
			ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
			ПараметрыЗагрузки.ИдентификаторФормы = Параметры.УникальныйИдентификаторФормы;
			ФайловаяСистемаКлиент.ЗагрузитьФайл(
				Новый ОписаниеОповещения(
					"СоздатьФайлСДискаПослеПомещенияФайлаБезРасширения",
					ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
					Параметры),
				ПараметрыЗагрузки);
		Исключение
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Не удалось создать файл по причине:
					|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняется в ходе создания файла с диска после помещения файла (тонкий и веб с расширением).
//
// Параметры:
//   ПомещенныйФайл - Структура - если файл помещен в хранилище:
//     * Хранение - Строка - адрес данных файла во временном хранилище.
//     * Имя - Строка - полный путь к помещенному файлу.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * Файл - Файл - инициализированный файл.
//     * Владелец - ЛюбаяСсылка - владелец файла.
//     * ВладелецID - Строка - идентификатор владельца файла в Документообороте.
//     * ВладелецТип - Строка - тип XDTO владельца файла в Документообороте.
//     * ВладелецПредставление - Строка - представление владельца файла.
//     * ПолноеИмяФайла - Строка - полное имя выбранного пользователем файла.
//     * ПолныеИменаФайлов - Массив из Строка - имена добавленных файлов.
//     * ПомещенныеФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ЯвляетсяСканКопией - Булево - признак скан-копии.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Асинх Процедура СоздатьФайлСДискаПослеПомещенияФайла(Знач ПомещенныйФайл, Знач Параметры) Экспорт
	
	Состояние();
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("АдресВременногоХранилищаФайла", ПомещенныйФайл.Хранение);
	
	Если Параметры.Свойство("УдалитьФайлПослеПомещения") И Параметры.УдалитьФайлПослеПомещения Тогда
		НачатьУдалениеФайлов(Новый ОписаниеОповещения, Параметры.Файл.ПолноеИмя);
		Параметры.Файл = Неопределено;
	КонецЕсли;
	
	НастройкиДокументооборот = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ПолучитьНастройки();
	Если НастройкиДокументооборот.НужноИзвлечьТекст Тогда
		Параметры.ТекущийФайл.Текст = Ждать ИзвлечьТекстАсинх(Параметры.ПолноеИмяФайла);
	КонецЕсли;
	
	СоздатьФайлСДискаЗавершение(Параметры);
	
КонецПроцедуры

// Выполняется в ходе создания файла с диска после помещения файла (веб без расширения).
//
// Параметры:
//   ПомещенныйФайл - Структура - если файл помещен в хранилище:
//     * Хранение - Строка - адрес данных файла во временном хранилище.
//     * Имя - Строка - полный путь к помещенному файлу.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * Владелец - ЛюбаяСсылка - владелец файла.
//     * ВладелецID - Строка - идентификатор владельца файла в Документообороте.
//     * ВладелецТип - Строка - тип XDTO владельца файла в Документообороте.
//     * ВладелецПредставление - Строка - представление владельца файла.
//     * ПолныеИменаФайлов - Массив из Строка - имена добавленных файлов.
//     * ПомещенныеФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ЯвляетсяСканКопией - Булево - признак скан-копии.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура СоздатьФайлСДискаПослеПомещенияФайлаБезРасширения(ПомещенныйФайл, Параметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("АдресВременногоХранилищаФайла", ПомещенныйФайл.Хранение);
	Параметры.Вставить("ПолноеИмяФайла", ПомещенныйФайл.Имя);
	
	Файл = Новый Файл(ПомещенныйФайл.Имя);
	Параметры.Вставить("Файл", Файл);
	
	СоздатьФайлСДискаЗавершение(Параметры);
	
КонецПроцедуры

// Выполняется в ходе создания файла с диска после диалога выбора файлов, либо после перетаскивания файлов.
//
// Параметры:
//   ВыбранныеФайлы - Массив из Строка - полные имена выбранных файлов.
//                  - Неопределено - если пользователь отказался от выбора.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * Владелец - ЛюбаяСсылка - владелец файла.
//     * ВладелецID - Строка - идентификатор владельца файла в Документообороте.
//     * ВладелецТип - Строка - тип XDTO владельца файла в Документообороте.
//     * ВладелецПредставление - Строка - представление владельца файла.
//     * ПолныеИменаФайлов - Массив из Строка - полные имена добавленных файлов.
//     * ПомещенныеФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ЯвляетсяСканКопией - Булево - признак скан-копии.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Асинх Процедура СоздатьФайлыСДискаАсинх(Знач ВыбранныеФайлы, Знач Параметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ПолныеИменаФайлов = ВыбранныеФайлы;
	Параметры.Вставить("ПолноеИмяФайла", Параметры.ПолныеИменаФайлов[0]);
	Параметры.ПолныеИменаФайлов.Удалить(0);
	
	Параметры.Вставить("Файл", Новый Файл(Параметры.ПолноеИмяФайла));
	
	Если ОшибкаПриДобавленииСканКопии(Параметры.ЯвляетсяСканКопией, Параметры.Файл) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ТекущийФайл.Размер = Ждать Параметры.Файл.РазмерАсинх();
	
	МаксРазмерФайла =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.МаксимальныйРазмерПередаваемогоФайла();
	
	ТекстПредупреждения = "";
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.РазмерФайлаПревышаетМаксимальноДопустимый(
			МаксРазмерФайла, Параметры.ТекущийФайл.Размер, Параметры.ПолноеИмяФайла, Ложь, ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Параметры.ТекущийФайл.ДатаМодификации = Ждать Параметры.Файл.ПолучитьВремяИзмененияАсинх();
	Параметры.ТекущийФайл.ДатаМодификацииУниверсальная = Ждать Параметры.Файл.ПолучитьУниверсальноеВремяИзмененияАсинх();
	
	ТекстПояснения = СтрШаблон(НСтр("ru = 'Идет сохранение файла ""%1"" (%2). Пожалуйста, подождите...'"),
		Параметры.ПолноеИмяФайла,
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.КраткоеПредставлениеРазмера(
			Параметры.ТекущийФайл.Размер));
	Состояние(ТекстПояснения);
	
	Попытка
		ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
		ПараметрыЗагрузки.Интерактивно = Ложь;
		ПараметрыЗагрузки.ИдентификаторФормы = Параметры.УникальныйИдентификаторФормы;
		ФайловаяСистемаКлиент.ЗагрузитьФайл(
			Новый ОписаниеОповещения(
				"СоздатьФайлСДискаПослеПомещенияФайла",
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
				Параметры),
			ПараметрыЗагрузки,
			Параметры.ПолноеИмяФайла);
	Исключение
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Не удалось создать файл по причине:
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецПопытки;
	
КонецПроцедуры

// Выполняет освобождение файла в ДО после разрешения пользователя.
//
// Параметры:
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла.
//     * Файл - Файл - помещаемый файл в рабочем каталоге.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура СохранитьИзмененияСРасширениемПослеВопросаОбОсвобождении(Параметры)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОсвободитьФайл(Параметры.ТекущийФайл.ID);
	
	// Удалим сведения о редактировании файла.
	СведенияОРедактировании = Параметры.СведенияОРедактировании;
	СведенияОРедактировании.Сохранен = Ложь;
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьСведенияОРедактированииФайла(
		СведенияОРедактировании);
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Изменения файла %1 сохранены.'"), Параметры.ТекущийФайл.Наименование);
	ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
	ДействиеНадФайлом.РедактированиеФайлаЗавершено = Истина;
	ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
	ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
	ИнформироватьОбИзмененииФайла(
		ДействиеНадФайлом,
		Параметры.ТекущийФайл.Наименование,
		Параметры.ТекущийФайл.ID,
		Параметры.ВладелецID,
		ТекстСообщения,,
		Параметры.УникальныйИдентификаторФормы);
	
	Если Параметры.ОписаниеОповещения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Параметры.ТекущийФайл);
	КонецЕсли;
	
КонецПроцедуры

// Завершает сохранение изменений в ДО без использования расширения работы с файлами.
//
// Параметры:
//   ПомещенныйФайл - Структура - если файл помещен в хранилище:
//     * Хранение - Строка - адрес данных файла во временном хранилище.
//     * Имя - Строка - полный путь к помещенному файлу.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура СохранитьИзмененияБезРасширенияПослеПомещения(ПомещенныйФайл, Параметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("АдресВременногоХранилищаФайла", ПомещенныйФайл.Хранение);
	Параметры.Вставить("ОсвободитьФайл", Ложь);
	Параметры.Вставить("ОбновитьСведенияОРедактировании", Истина);
	
	// Получим расширение: оно могло измениться.
	СтруктураИмени = РазложитьПолноеИмяФайла(ПомещенныйФайл.Имя);
	Параметры.ТекущийФайл.Расширение = СтруктураИмени.Расширение;
	
	// Удалим параметры, которые передавать на сервер нельзя и не нужно.
	ОписаниеОповещения = Параметры.ОписаниеОповещения;
	Параметры.Удалить("ОписаниеОповещения");
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОбновитьФайлДвоичнымиДаннымиВременногоХранилища(
			Параметры) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Изменения файла %1 сохранены.'"), Параметры.ТекущийФайл.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.РедактированиеФайла = Истина; // Создает новую версию файла, но не завершает его редактирование.
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ID,
			Параметры.ВладелецID,
			ТекстСообщения,,
			Параметры.УникальныйИдентификаторФормы);
		Если ОписаниеОповещения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, Параметры.ТекущийФайл);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Завершает сохранение изменений в ДО с использованием расширения для работы с файлами.
//
// Параметры:
//   ПомещенныйФайл - Структура - если файл помещен в хранилище:
//     * Хранение - Строка - адрес данных файла во временном хранилище.
//     * Имя - Строка - полный путь к помещенному файлу.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ВладелецID - Строка - идентификатор владельца файла.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла.
//     * Файл - Файл - помещаемый файл в рабочем каталоге.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Асинх Процедура СохранитьИзмененияСРасширениемПослеПомещения(Знач ПомещенныйФайл, Знач Параметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("АдресВременногоХранилищаФайла", ПомещенныйФайл.Хранение);
	Параметры.Вставить("ОсвободитьФайл", Ложь);
	Параметры.Вставить("ОбновитьСведенияОРедактировании", Истина);
	
	// Извлечем текст, если необходимо.
	НастройкиДокументооборот = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ПолучитьНастройки();
	Если НастройкиДокументооборот.НужноИзвлечьТекст Тогда
		ИзвлеченныйТекст = Ждать ИзвлечьТекстАсинх(Параметры.СведенияОРедактировании.ПолныйПуть);
		Параметры.ТекущийФайл.Текст = ИзвлеченныйТекст;
	КонецЕсли;
	
	// Удалим параметры, которые передавать на сервер нельзя и не нужно.
	ОписаниеОповещения = Параметры.ОписаниеОповещения;
	Параметры.Удалить("ОписаниеОповещения");
	Параметры.Удалить("Файл");
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОбновитьФайлДвоичнымиДаннымиВременногоХранилища(
			Параметры) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Изменения файла %1 сохранены.'"), Параметры.ТекущийФайл.Наименование);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.РедактированиеФайла = Истина; // Создает новую версию файла, но не завершает его редактирование.
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ID,
			Параметры.ВладелецID,
			ТекстСообщения,,
			Параметры.УникальныйИдентификаторФормы);
		Если ОписаниеОповещения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, Параметры.ТекущийФайл);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в ходе сохранения файла на диск после выбора источника (или в отсутствие файла на диске).
//
// Параметры:
//   Результат - Строка - если "ВзятьИзДокументооборота", то взять файл из ДО, если "ИспользоватьСуществующий",
//     то взять файл из каталога временных.
//             - Неопределено - ничего не делать.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ПолныйПуть - Строка - полный путь к файлу в выбранном пользователем каталоге.
//     * ПолноеИмяФайла - Строка - полный путь к файлу в выбранном пользователем каталоге.
//     * Каталог - Строка - каталог, куда нужно сохранить файлы.
//     * ИмяВременногоФайла - Строка - имя временного файла.
//     * РежимДиалогаВыбораФайла - РежимДиалогаВыбораФайла - режим диалога выбора файла.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Асинх Процедура СохранитьКакПослеВыбораИсточника(Знач Результат, Знач Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда // Отмена.
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(Параметры.ПолныйПуть);
	Если Ждать Файл.СуществуетАсинх() Тогда
		Ждать Файл.УстановитьТолькоЧтениеАсинх(Ложь);
		Ждать УдалитьФайлыАсинх(Параметры.ПолныйПуть);
	КонецЕсли;
	
	Параметры.Вставить("РежимПолучения", Результат);
	
	Если Результат = "ВзятьИзДокументооборота" Тогда
		
		// Получим файл из ДО на сервере.
		Если ЗначениеЗаполнено(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла)
				И ЭтоАдресВременногоХранилища(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла) Тогда
			Адрес = Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла;
		ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFile" Тогда
			Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьФайлИПоместитьВХранилище(
				Параметры.ТекущийФайл.ID,
				Параметры.ИспользоватьВизуализациюШтампаЭП,
				Параметры.УникальныйИдентификаторФормы,,
				Параметры.ТекущийФайл.Размер,
				Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
		ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFileVersion" Тогда
			Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьВерсиюФайлаИПоместитьВХранилище(
				Параметры.ТекущийФайл.ID,
				Параметры.ИспользоватьВизуализациюШтампаЭП,
				Параметры.УникальныйИдентификаторФормы,
				Параметры.ТекущийФайл.Размер,
				Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип файла: %1'"), Параметры.ТекущийФайл.Тип);
		КонецЕсли;
		Параметры.Вставить("АдресВременногоХранилищаФайла", Адрес);
		
		// Соберем описание получаемого файла и получим его.
		ПолучаемыеФайлы = Новый Массив;
		Описание = Новый ОписаниеПередаваемогоФайла(
			Параметры.ПолныйПуть,
			Параметры.АдресВременногоХранилищаФайла);
		ПолучаемыеФайлы.Добавить(Описание);
		
		ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохранения.Интерактивно = Ложь;
		ФайловаяСистемаКлиент.СохранитьФайл(
			Новый ОписаниеОповещения(
				"ПродолжитьСохранитьКакПослеВыбораИсточника",
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
				Параметры),
			Параметры.АдресВременногоХранилищаФайла,
			Параметры.ПолныйПуть,
			ПараметрыСохранения);
		
	ИначеЕсли Результат = "ИспользоватьСуществующий" Тогда
		
		Попытка
			Ждать КопироватьФайлАсинх(Параметры.ИмяВременногоФайла, Параметры.ПолныйПуть);
			Файл = Новый Файл(Параметры.ПолныйПуть);
			Ждать Файл.УстановитьТолькоЧтениеАсинх(Ложь);
		Исключение
			Инфо = ИнформацияОбОшибке();
			ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось скопировать файл (""%1"").'"),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Инфо));
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
		КонецПопытки;
		
		ПродолжитьСохранитьКакПослеВыбораИсточника(ПолучаемыеФайлы, Параметры);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в ходе сохранения файла после выбора каталога и имени пользователем.
//
// Параметры:
//   Результат - Массив из Строка - массив с именем файла, если файл выбран.
//             - Строка - если выбран каталог.
//             - Неопределено - если пользователь отказался от выбора.
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * РежимДиалогаВыбораФайла - РежимДиалогаВыбораФайла - режим диалога выбора файла.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Асинх Процедура СохранитьКакПослеДиалогаВыбораФайла(Знач Результат, Знач Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		Результат = Результат[0];
	КонецЕсли;
	
	Если Параметры.РежимДиалогаВыбораФайла = РежимДиалогаВыбораФайла.Сохранение Тогда
		Параметры.Вставить("ПолныйПуть", Результат);
	Иначе
		Параметры.Вставить("Каталог", Результат);
		Параметры.Вставить("ПолныйПуть", Параметры.Каталог + ПолучитьРазделительПути() + Параметры.ТекущийФайл.ИмяФайла);
	КонецЕсли;
	
	Параметры.Вставить("ПолноеИмяФайла", Параметры.ПолныйПуть); // Параметр ПолноеИмяФайла используется в методах БСП.
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ДоступенФункционалВерсииСервиса("1.4.9.1")
			И Параметры.ТекущийФайл.Тип <> "DMFileVersion"
			И Параметры.ТекущийФайл.Тип <> "DMIncomingElectronicDocument"
			И Параметры.ТекущийФайл.Тип <> "DMOutgoingElectronicDocument" Тогда
		
		СведенияОРедактировании =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла(
				Параметры.ТекущийФайл.ID,
				Параметры.ТекущийФайл.Тип);
		
		Если Ждать НуженВыборДействийПриОбнаруженииОтличийФайлаАсинх(
				СведенияОРедактировании,
				Параметры,
				"СохранитьКакПослеВыбораИсточника",
				Ложь) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	// Выбора нет: файл должен быть получен из ДО.
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"СохранитьКакПослеВыбораИсточника",
		ЭтотОбъект,
		Параметры);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, "ВзятьИзДокументооборота");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаОповещенияЭлектронныеПодписи

Процедура НачатьДобавлениеЭПИзФайлаЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	ОписаниеДанных = Результат.ОписаниеДанных;
	
	Если Не ОписаниеДанных.Свойство("Подписи") Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваФайла = ПараметрыОповещения.СвойстваФайла;
	Подписи = ОписаниеДанных.Подписи;
	
	Если ТипЗнч(Подписи) <> Тип("Массив") Или Подписи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивПодписей = Новый Массив;
	Для Каждого Подпись Из Подписи Цикл
		Если ТипЗнч(Подпись) = Тип("Строка") Тогда
			СвойстваПодписи = ПолучитьИзВременногоХранилища(Подпись);
		Иначе
			СвойстваПодписи = Подпись;
		КонецЕсли;
		МассивПодписей.Добавить(
			ДанныеПодписи(
				СвойстваПодписи.Подпись,
				СвойстваПодписи.Сертификат,
				СвойстваПодписи));
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПодписей, СвойстваФайла.ДанныеПодписейФайла);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЗанестиИнформациюОПодписяхОбъекта(
		СвойстваФайла.ИмяФайла,
		СвойстваФайла.ИдентификаторФайла,
		"DMFile",
		СвойстваФайла.Зашифрован,
		МассивПодписей);
	
	Если МассивПодписей.Количество() = 1 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Добавлена подпись из файла для ""%1""'"), СвойстваФайла.ИмяФайла);
	Иначе
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Добавлены подписи из файлов для ""%1""'"), СвойстваФайла.ИмяФайла);
	КонецЕсли;
	ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
	ДействиеНадФайлом.ИзменениеЭПФайла = Истина;
	ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
	ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
	ИнформироватьОбИзмененииФайла(
		ДействиеНадФайлом,
		СвойстваФайла.ИмяФайла,
		СвойстваФайла.ИдентификаторФайла,
		СвойстваФайла.ВладелецФайла,
		ТекстСообщения,,
		СвойстваФайла.УникальныйИдентификаторФормы);
	
	ВыполнитьОбработкуОповещения(Результат.Оповещение, Новый Структура);
	
КонецПроцедуры

// Вызывается в ходе добавления подписи из файла после подключения расширения.
//
// Параметры:
//   Подключено - Булево
//   Параметры - Структура:
//     * СвойстваФайла - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СвойстваФайла
//
Процедура НачатьДобавлениеЭПИзФайлаПослеПодключенияРасширения(Подключено, Параметры) Экспорт
	
	Если Не Подключено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для выполнения операции нужно установить расширение работы с файлами.'"));
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствует стандартная подсистема ""Электронная подпись"".'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения(
		"НачатьДобавлениеЭПИзФайлаЗавершение",
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("ЗаголовокДанных", "Файл");
	ОписаниеДанных.Вставить("Объект", Оповещение);
	ОписаниеДанных.Вставить("Представление", Параметры.СвойстваФайла.ИмяФайла);
	ОписаниеДанных.Вставить("СписокПредставлений", Новый СписокЗначений());
	ОписаниеДанных.СписокПредставлений.Добавить(, Параметры.СвойстваФайла.ИмяФайла);
	
	МодульЭлектроннаяПодписьКлиент.ДобавитьПодписьИзФайла(ОписаниеДанных);
	
КонецПроцедуры

// Вызывается в ходе сохранения файла с ЭП после подключения расширения.
//
// Параметры:
//   Подключено - Булево
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * Подписи - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураПодписи
//
Процедура НачатьСохранениеВместеСЭППослеПодключенияРасширения(Подключено, Параметры) Экспорт
	
	Если Не Подключено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для выполнения операции нужно установить расширение работы с файлами.'"));
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствует стандартная подсистема ""Электронная подпись"".'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("ЗаголовокДанных", "Файл");
	ОписаниеДанных.Вставить("Представление", Параметры.ТекущийФайл.Наименование);
	ОписаниеДанных.Вставить("СписокПредставлений", Новый СписокЗначений());
	ОписаниеДанных.СписокПредставлений.Добавить(, Параметры.ТекущийФайл.Наименование);
	Если Параметры.Подписи = Неопределено Тогда
		АдресВХранилище = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПоместитьВХранилищеПодписиФайла(
			Параметры.ТекущийФайл.ID);
	Иначе
		АдресВХранилище = ПоместитьВоВременноеХранилище(Параметры.Подписи);
	КонецЕсли;
	ОписаниеДанных.Вставить("Объект", АдресВХранилище);
	ОписаниеДанных.Вставить("Данные",
		Новый ОписаниеОповещения(
			"СохранитьВместеСЭПСохранитьФайл",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры));
	МодульЭлектроннаяПодписьКлиент.СохранитьДанныеВместеСПодписью(ОписаниеДанных);
	
КонецПроцедуры

// Обработчик оповещения "НачатьФормированиеПодписиОбъектаЗавершение".
//
// Параметры:
//   ОписаниеДанных - Структура:
//     * ВыбранныйСертификат - Структура:
//         ** Данные - Строка
//         ** Отпечаток - Строка
//         ** Ссылка - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//     * ЗаголовокДанных - Строка
//     * НаборДанных - Массив из Структура:
//         ** Данные - ДвоичныеДанные
//         ** Представление - Структура:
//              *** Значение - Строка
//              *** Представление - Строка
//         ** СвойстваПодписи - Структура:
//              *** ДатаПодписи - Дата
//              *** ДатаПроверкиПодписи - Дата
//              *** ИмяФайлаПодписи - Строка
//              *** Комментарий - Строка
//              *** КомуВыданСертификат - Строка
//              *** Отпечаток - Строка
//              *** Подпись - ДвоичныеДанные
//              *** ПодписьВерна - Булево
//              *** Сертификат - ДвоичныеДанные
//              *** УстановившийПодпись - СправочникСсылка.Пользователи
//     * Операция - Строка
//     * Отказ - Булево
//     * ПользовательНажалКнопкуПодписать - Булево
//     * Представление - Строка
//     * ПредставлениеНабора - Строка
//     * ТекущийЭлементНабораДанных - Структура:
//         ** Данные - ДвоичныеДанные
//         ** Представление - Структура:
//              *** Значение - Строка
//              *** Представление - Строка
//         ** СвойстваПодписи - Структура:
//              *** ДатаПодписи - Дата
//              *** ДатаПроверкиПодписи - Дата
//              *** ИмяФайлаПодписи - Строка
//              *** Комментарий - Строка
//              *** КомуВыданСертификат - Строка
//              *** Отпечаток - Строка
//              *** Подпись - ДвоичныеДанные
//              *** ПодписьВерна - Булево
//              *** Сертификат - ДвоичныеДанные
//              *** УстановившийПодпись - СправочникСсылка.Пользователи
//     * Успех - Булево
//   ПараметрыОповещения - Структура:
//     * Форма - ФормаКлиентскогоПриложения
//     * ОписаниеОповещенияОЗакрытии - ОписаниеОповещения:
//       ** ДополнительныеПараметры - Структура:
//         *** МассивАдресов - Массив из Строка
//         *** МассивДанныхДляЗанесенияВБазу - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеВладельцаПодписи
//
Процедура НачатьФормированиеПодписиОбъектаЗавершение(ОписаниеДанных, ПараметрыОповещения) Экспорт
	
	Если Не ОписаниеДанных.Успех Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = ПараметрыОповещения.ОписаниеОповещенияОЗакрытии;
	МассивДанныхДляЗанесенияВБазу = ОписаниеОповещения.ДополнительныеПараметры.МассивДанныхДляЗанесенияВБазу;
	
	ДобавленныеПодписиОбъектов = Новый Соответствие;
	
	Для НомерПодписываемогоОбъекта = 0 По ОписаниеДанных.НаборДанных.Количество() - 1 Цикл
		// Порядок данных для подписи, переданных в Подписать(), совпадает с порядком
		// объектов для помещения в базу, переданных в параметрах оповещения.
		ДанныеДляПодписи = ОписаниеДанных.НаборДанных[НомерПодписываемогоОбъекта];
		СвойстваПодписи = Неопределено;
		Если Не ДанныеДляПодписи.Свойство("СвойстваПодписи", СвойстваПодписи) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(СвойстваПодписи) = Тип("Строка") Тогда
			СвойстваПодписи = ПолучитьИзВременногоХранилища(СвойстваПодписи);
		КонецЕсли;
		
		ДанныеПодписи = ДанныеПодписи(
			СвойстваПодписи.Подпись,
			СвойстваПодписи.Сертификат,
			СвойстваПодписи);
		
		ДанныеВладельцаПодписи = МассивДанныхДляЗанесенияВБазу[НомерПодписываемогоОбъекта];
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДополнитьПодписиОбъектов(
			ДобавленныеПодписиОбъектов,
			ДанныеВладельцаПодписи.Наименование,
			ДанныеВладельцаПодписи.ID,
			ДанныеВладельцаПодписи.Тип,
			ДанныеВладельцаПодписи.Зашифрован,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПодписи));
	КонецЦикла;
	
	ОписаниеОповещения.ДополнительныеПараметры.Вставить("ДобавленныеПодписиОбъектов", ДобавленныеПодписиОбъектов);
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	
КонецПроцедуры

Процедура ПодписатьФайлЗавершение(ОписаниеДанных, СвойстваФайла) Экспорт
	
	СвойстваПодписи = Неопределено;
	Если ТипЗнч(ОписаниеДанных) = Тип("Структура") И ОписаниеДанных.Свойство("СвойстваПодписи", СвойстваПодписи) Тогда
		
		Если ТипЗнч(СвойстваПодписи) = Тип("Строка") Тогда
			СвойстваПодписи = ПолучитьИзВременногоХранилища(СвойстваПодписи);
		КонецЕсли;
		
		МассивПодписей = Новый Массив;
		МассивПодписей.Добавить(
			ДанныеПодписи(
				СвойстваПодписи.Подпись,
				СвойстваПодписи.Сертификат,
				СвойстваПодписи));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПодписей, СвойстваФайла.ДанныеПодписейФайла);
		
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЗанестиИнформациюОПодписяхОбъекта(
			СвойстваФайла.ИмяФайла,
			СвойстваФайла.ИдентификаторФайла,
			"DMFile",
			СвойстваФайла.Зашифрован,
			МассивПодписей);
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Установлена подпись для ""%1""'"), СвойстваФайла.ИмяФайла);
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.ИзменениеЭПФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			СвойстваФайла.ИмяФайла,
			СвойстваФайла.ИдентификаторФайла,
			СвойстваФайла.ВладелецФайла,
			ТекстСообщения,,
			СвойстваФайла.УникальныйИдентификаторФормы);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в ходе проверки подписи после создания менеджера криптографии.
//
// Параметры:
//   МенеджерКриптографии - МенеджерКриптографии
//   Параметры - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПроверитьПодписи
//
Процедура ПроверитьПодписиПослеСозданияМенеджера(МенеджерКриптографии, Параметры) Экспорт
	
	Если ТипЗнч(МенеджерКриптографии) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, МенеджерКриптографии);
		Возврат;
	КонецЕсли;
	
	СоответствиеИдОбъектаИДвоичныхДанных = Новый Соответствие;
	
	Для Каждого ДанныеСтроки Из Параметры.ТаблицаПодписей Цикл
		Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ПодписьВыделена(
				Параметры.ВыделенныеПодписи, ДанныеСтроки) Тогда
			ПроверитьОднуПодпись(
				ДанныеСтроки,
				МенеджерКриптографии,
				СоответствиеИдОбъектаИДвоичныхДанных,
				Параметры.АдресСлепкаДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Если Параметры.ОписаниеОповещения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Параметры.ТаблицаПодписей);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в ходе сохранения ЭП вместе с файлом, сохраняет файл и вызывает обработчик, передав ему полное имя файла.
//
// Параметры:
//   Результат - Произвольный
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * Подписи - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураПодписи
//
Процедура СохранитьВместеСЭПСохранитьФайл(Результат, Параметры) Экспорт
	
	СохранитьФайлКак(
		Параметры.ТекущийФайл.ID,
		Параметры.ТекущийФайл.Наименование,
		Параметры.ТекущийФайл.Расширение,
		Параметры.УникальныйИдентификаторФормы,
		Результат.Оповещение,
		Ложь);
	
КонецПроцедуры

#КонецОбласти

// Обработчик оповещения "ВыбратьЗначениеДополнительногоРеквизитаВводЗначенияЗавершение".
//
// Параметры:
//   Результат - Произвольный
//   ПараметрыОповещения - Структура:
//     * Форма - ФормаКлиентскогоПриложения
//     * Элемент - ТаблицаФормы
//
Процедура ВыбратьЗначениеДополнительногоРеквизитаВводЗначенияЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат <> Неопределено Тогда
		ПараметрыОповещения.Элемент.Родитель.ТекущиеДанные.Значение = Результат;
		ПараметрыОповещения.Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения "ВыбратьЗначениеДополнительногоРеквизитаВыборТипаЗавершение".
//
// Параметры:
//   ИмяТипа - Произвольный
//   ПараметрыОповещения - Структура:
//     * Форма - ФормаКлиентскогоПриложения
//     * Элемент - ТаблицаФормы
//
Процедура ВыбратьЗначениеДополнительногоРеквизитаВыборТипаЗавершение(ИмяТипа, ПараметрыОповещения) Экспорт
	
	Форма = ПараметрыОповещения.Форма;
	Элемент = ПараметрыОповещения.Элемент;
	
	Если ИмяТипа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыбратьЗначениеДополнительногоРеквизитаОбработка(ИмяТипа, Форма, Элемент)
	
КонецПроцедуры

// Обработчик оповещения "ВыбратьЗначениеДополнительногоРеквизитаЗавершение".
//
// Параметры:
//   Результат - Произвольный
//   ПараметрыОповещения - Структура:
//     * Форма - ФормаКлиентскогоПриложения
//     * Элемент - ТаблицаФормы
//
Процедура ВыбратьЗначениеДополнительногоРеквизитаЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	Элемент = ПараметрыОповещения.Элемент;
	Форма = ПараметрыОповещения.Форма;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Элемент.Родитель.ТекущиеДанные.ЗначениеID = Результат.РеквизитID;
		Элемент.Родитель.ТекущиеДанные.ЗначениеТип = Результат.РеквизитТип;
		Элемент.Родитель.ТекущиеДанные.Значение = Результат.РеквизитПредставление;
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения "ВыбратьЗначениеРеквизитаИСЗавершениеВыбораТипа".
//
// Параметры:
//   ЗначениеТипа - Тип
//                - ЭлементСпискаЗначений
//   ПараметрыВыбораЗначения - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыВыбораЗначенияДО
//
Процедура ВыбратьЗначениеРеквизитаДОЗавершение(ЗначениеТипа, ПараметрыВыбораЗначения) Экспорт
	
	Если ТипЗнч(ЗначениеТипа) = Тип("ЭлементСпискаЗначений") Тогда
		ЗначениеТипа = ЗначениеТипа.Значение;
	КонецЕсли;
	
	Если ЗначениеТипа = "Строка" Тогда
		ПоказатьВводСтроки(
			ПараметрыВыбораЗначения.Оповещение,
			СтрЗаменить(ПараметрыВыбораЗначения.ТекстРедактирования, "¶", Символы.ПС),
			ПараметрыВыбораЗначения.Представление,,
			Истина);
		
	ИначеЕсли ЗначениеТипа = "Число" Тогда
		ПоказатьВводЧисла(
			ПараметрыВыбораЗначения.Оповещение,
			ПараметрыВыбораЗначения.ЗначениеРеквизита,
			ПараметрыВыбораЗначения.Представление,
			15,
			5);
		
	ИначеЕсли ЗначениеТипа = "Дата" Тогда
		ПоказатьВводДаты(
			ПараметрыВыбораЗначения.Оповещение,
			ПараметрыВыбораЗначения.ЗначениеРеквизита,
			ПараметрыВыбораЗначения.Представление,
			ЧастиДаты.Дата);
		
	ИначеЕсли ЗначениеТипа = "ДатаВремя" Тогда
		ПоказатьВводДаты(
			ПараметрыВыбораЗначения.Оповещение,
			ПараметрыВыбораЗначения.ЗначениеРеквизита,
			ПараметрыВыбораЗначения.Представление,
			ЧастиДаты.ДатаВремя);
		
	ИначеЕсли ЗначениеТипа = "Время" Тогда
		ПоказатьВводДаты(
			ПараметрыВыбораЗначения.Оповещение,
			ПараметрыВыбораЗначения.ЗначениеРеквизита,
			ПараметрыВыбораЗначения.Представление,
			ЧастиДаты.Время);
		
	ИначеЕсли ЗначениеТипа = "Булево" Тогда
		ПоказатьВводЗначения(
			ПараметрыВыбораЗначения.Оповещение,
			ПараметрыВыбораЗначения.ЗначениеРеквизита,
			ПараметрыВыбораЗначения.Представление,
			Тип("Булево"));
		
	ИначеЕсли ЗначениеЗаполнено(ЗначениеТипа) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТипОбъектаВыбора", ЗначениеТипа);
		Если ЗначениеЗаполнено(ПараметрыВыбораЗначения.ЗначениеРеквизитаID)
				И ЗначениеТипа = ПараметрыВыбораЗначения.ЗначениеРеквизитаТип Тогда
			ПараметрыФормы.Вставить("ВыбранныйЭлемент", ПараметрыВыбораЗначения.ЗначениеРеквизитаID);
		КонецЕсли;
		Если ПараметрыВыбораЗначения.Отбор = Неопределено Тогда
			ПараметрыФормы.Вставить("Отбор", Новый Структура);
		Иначе
			ПараметрыФормы.Вставить("Отбор", ПараметрыВыбораЗначения.Отбор);
		КонецЕсли;
		
		Если ЗначениеТипа = "DMDocument" Или ЗначениеТипа = "DMCorrespondent" Или ЗначениеТипа = "DMMeeting" Тогда
			
			// Объектов ДО потенциально много, нужен выбор поиском.
			Если ЗначениеЗаполнено(ПараметрыВыбораЗначения.ЗначениеРеквизита) Тогда
				ПараметрыФормы.Отбор.Вставить("name", СокрЛП(ПараметрыВыбораЗначения.ЗначениеРеквизита));
				ПараметрыФормы.Вставить("ИскатьСразу", Ложь);
			КонецЕсли;
			
			Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
			Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
				ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВыборОбъектаПоиском";
			ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
				ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот3.Форма.ВыборОбъектаПоиском";
			Иначе
				Возврат;
			КонецЕсли;
			
			ОткрытьФорму(ИмяФормы,
				ПараметрыФормы,
				ЭтотОбъект,
				Новый УникальныйИдентификатор,,,
				ПараметрыВыбораЗначения.Оповещение,
				РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе
			
			// Обычный выбор из списка.
			ОткрытьФорму("Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.ВыборИзСписка",
				ПараметрыФормы,
				ЭтотОбъект,
				Новый УникальныйИдентификатор,,,
				ПараметрыВыбораЗначения.Оповещение,
				РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения "ВыбратьЗначениеРеквизитаИСЗавершениеВыбораТипа".
//
// Параметры:
//   ЗначениеТипа - Тип
//                - ЭлементСпискаЗначений
//   ПараметрыВыбратьЗначение - Структура:
//     * ОписаниеТипа - ОписаниеТипов
//     * ТекстРедактирования - Строка
//     * Представление - Строка
//     * ЗначениеРеквизита - Произвольный
//     * Оповещение - ОписаниеОповещения
//
Процедура ВыбратьЗначениеРеквизитаИСЗавершениеВыбораТипа(ЗначениеТипа, ПараметрыВыбратьЗначение) Экспорт
	
	Если ЗначениеТипа = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ЗначениеТипа) = Тип("ЭлементСпискаЗначений") Тогда
		ТипОбъекта = ЗначениеТипа.Значение; // Тип
	Иначе
		ТипОбъекта = ЗначениеТипа; // Тип
	КонецЕсли;
	
	ОписаниеТипа = ПараметрыВыбратьЗначение.ОписаниеТипа;
	
	Если ТипОбъекта = Тип("Строка") Тогда
		Если ОписаниеТипа.КвалификаторыСтроки.Длина = 0 Или ОписаниеТипа.КвалификаторыСтроки.Длина > 40 Тогда
			Многострочность = Истина;
		Иначе
			Многострочность = Ложь;
		КонецЕсли;
		
		ПоказатьВводСтроки(
			ПараметрыВыбратьЗначение.Оповещение,
			СтрЗаменить(ПараметрыВыбратьЗначение.ТекстРедактирования, "¶", Символы.ПС),
			ПараметрыВыбратьЗначение.Представление,
			ОписаниеТипа.КвалификаторыСтроки.Длина,
			Многострочность);
		
	ИначеЕсли ТипОбъекта = Тип("Число") Тогда
		ПоказатьВводЧисла(
			ПараметрыВыбратьЗначение.Оповещение,
			ПараметрыВыбратьЗначение.ЗначениеРеквизита,
			ПараметрыВыбратьЗначение.Представление,
			ОписаниеТипа.КвалификаторыЧисла.Разрядность,
			ОписаниеТипа.КвалификаторыЧисла.РазрядностьДробнойЧасти);
		
	ИначеЕсли ТипОбъекта = Тип("Дата") Тогда
		ПоказатьВводДаты(
			ПараметрыВыбратьЗначение.Оповещение,
			ПараметрыВыбратьЗначение.ЗначениеРеквизита,
			ПараметрыВыбратьЗначение.Представление,
			ОписаниеТипа.КвалификаторыДаты.ЧастиДаты);
		
	ИначеЕсли ТипОбъекта = Тип("Булево") Тогда
		ПоказатьВводЗначения(
			ПараметрыВыбратьЗначение.Оповещение,
			ПараметрыВыбратьЗначение.ЗначениеРеквизита,
			ПараметрыВыбратьЗначение.Представление,
			Тип("Булево"));
		
	Иначе
		ИмяОбъекта = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИмяОбъектаМетаданныхПоТипу(
			ТипОбъекта);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ТекущаяСтрока", ПараметрыВыбратьЗначение.ЗначениеРеквизита);
		ОткрытьФорму(ИмяОбъекта + ".ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,,
			ПараметрыВыбратьЗначение.Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик ожидания, который вызывается при завершении длительной операции выполнения запроса.
//
// Параметры:
//   Результат - см. ДлительныеОперации.ОперацияВыполнена
//   ИдентификаторЗадания - УникальныйИдентификатор
//
Процедура ВыполнитьЗапросАсинхронноЗавершение(Результат, ИдентификаторЗадания) Экспорт
	
	ОбработчикиОжидания = АктивныеОбработчикиОжиданияФоновогоЗадания();
	ОбработчикиОжиданияЗадания = ОбработчикиОжидания[ИдентификаторЗадания];
	Если ОбработчикиОжиданияЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
		Если Результат.Статус = "Выполнено" Тогда
			Результат.Вставить("РезультатДлительнойОперации", ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			ВерсияСервиса = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьВерсиюСервисаВПараметрыСеанса(
				ВерсияСервиса);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Параметры Из ОбработчикиОжиданияЗадания Цикл
		
		Если Не Параметры.ВыводитьОкноОжидания И ТипЗнч(Параметры.Владелец) = Тип("ФормаКлиентскогоПриложения") Тогда
			
			Элементы = Параметры.Владелец.Элементы;
			Если Параметры.СкрыватьИнтерфейс И (Элементы.Найти("ГруппаСтраницыПодключения") <> Неопределено) Тогда
				
				Если Элементы.ГруппаСтраницыПодключения.ТекущаяСтраница = Элементы.СтраницаЗагрузкаИзДО Тогда
					Если Результат <> Неопределено И Результат.Статус = "Ошибка"
							И Не ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СервисДоступен(ВерсияСервиса) Тогда
						Элементы.ГруппаСтраницыПодключения.ТекущаяСтраница = Элементы.СтраницаДокументооборотНедоступен;
					Иначе
						Элементы.ГруппаСтраницыПодключения.ТекущаяСтраница = Элементы.СтраницаДокументооборотДоступен;
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Параметры.СтарыйЗаголовок) Тогда
					Элементы.ОписаниеЗагрузкаИзДОСтраница.Заголовок = Параметры.СтарыйЗаголовок;
				КонецЕсли;
				
			ИначеЕсли Элементы.Найти("ГруппаЗагрузкаИзДО") <> Неопределено Тогда
				
				Элементы.ГруппаЗагрузкаИзДО.Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеОЗавершении, Результат);
		
	КонецЦикла;
	
	ОбработчикиОжидания.Удалить(ИдентификаторЗадания);
	
КонецПроцедуры

// Обработчик ожидания, который вызывается после выбора объектов адресации роли исполнителя.
//
// Параметры:
//   РезультатЗаполнения - Структура:
//     * Результат - Строка
//     * Исполнитель - Строка
//     * ИсполнительID - Строка
//     * ИсполнительТип - Строка
//     * ОсновнойОбъектАдресации - Строка
//     * ОсновнойОбъектАдресацииID - Строка
//     * ОсновнойОбъектАдресацииТип - Строка
//     * ДополнительныйОбъектАдресации - Строка
//     * ДополнительныйОбъектАдресацииID - Строка
//     * ДополнительныйОбъектАдресацииТип - Строка
//   ПараметрыОповещения - Структура:
//     * ОписаниеОповещенияОЗакрытии - ОписаниеОповещения - описание оповещения о закрытии.
//     * ИмяРоли - Строка - имя роли для получения объектов адресации.
//     * ТипРоли - Строка - тип роли для получения объектов адресации.
//     * IDРоли - Строка - идентификатор роли в Документообороте.
//     * ФормаВладелец - ФормаКлиентскогоПриложения - управляемая форма, на которой выбирается роль.
//
Процедура ПоказатьПолучениеОбъектовАдресацииРолиЗавершение(РезультатЗаполнения, ПараметрыОповещения) Экспорт
	
	ОписаниеОповещенияОЗакрытии = ПараметрыОповещения.ОписаниеОповещенияОЗакрытии;
	ИмяРоли = ПараметрыОповещения.ИмяРоли;
	ТипРоли = ПараметрыОповещения.ТипРоли;
	IDРоли = ПараметрыОповещения.IDРоли;
	
	ДанныеВозврата = Новый Структура;
	
	Если ТипЗнч(РезультатЗаполнения) = Тип("Структура") Тогда
		
		Если РезультатЗаполнения.Результат = "ОК" Тогда
			
			ДанныеВозврата.Вставить("Исполнитель", РезультатЗаполнения.Исполнитель);
			ДанныеВозврата.Вставить("ИсполнительID", РезультатЗаполнения.ИсполнительID);
			ДанныеВозврата.Вставить("ИсполнительТип", РезультатЗаполнения.ИсполнительТип);
			
			ДанныеВозврата.Вставить("ОсновнойОбъектАдресации", РезультатЗаполнения.ОсновнойОбъектАдресации);
			ДанныеВозврата.Вставить("ОсновнойОбъектАдресацииID", РезультатЗаполнения.ОсновнойОбъектАдресацииID);
			ДанныеВозврата.Вставить("ОсновнойОбъектАдресацииТип", РезультатЗаполнения.ОсновнойОбъектАдресацииТип);
			
			ДанныеВозврата.Вставить("ДополнительныйОбъектАдресации", РезультатЗаполнения.ДополнительныйОбъектАдресации);
			ДанныеВозврата.Вставить("ДополнительныйОбъектАдресацииID", РезультатЗаполнения.ДополнительныйОбъектАдресацииID);
			ДанныеВозврата.Вставить("ДополнительныйОбъектАдресацииТип", РезультатЗаполнения.ДополнительныйОбъектАдресацииТип);
			
		ИначеЕсли РезультатЗаполнения.Результат = "БезОбъектовАдресации" Тогда
			
			ДанныеВозврата.Вставить("Исполнитель", ИмяРоли);
			ДанныеВозврата.Вставить("ИсполнительID", IDРоли);
			ДанныеВозврата.Вставить("ИсполнительТип", ТипРоли);
			
			ДанныеВозврата.Вставить("ОсновнойОбъектАдресации", "");
			ДанныеВозврата.Вставить("ОсновнойОбъектАдресацииID", "");
			ДанныеВозврата.Вставить("ОсновнойОбъектАдресацииТип", "");
			
			ДанныеВозврата.Вставить("ДополнительныйОбъектАдресации", "");
			ДанныеВозврата.Вставить("ДополнительныйОбъектАдресацииID", "");
			ДанныеВозврата.Вставить("ДополнительныйОбъектАдресацииТип", "");
			
		Иначе
			
			ДанныеВозврата = Неопределено;
			
		КонецЕсли;
		
	Иначе
		
		ДанныеВозврата = Неопределено;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, ДанныеВозврата);
	
КонецПроцедуры

// Обработчик ожидания, который вызывается при завершении длительной операции подключения к ДО после
// начала работы системы.
//
// Параметры:
//   Результат - Структура:
//     * АдресДополнительногоРезультата - Строка
//     * АдресРезультата - Строка
//     * КраткоеПредставлениеОшибки - Строка
//     * ПодробноеПредставлениеОшибки - Строка
//     * Сообщения - Массив из СообщениеПользователю
//     * Статус - Строка
//     * РезультатДлительнойОперации - см. ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПараметрыДлительнойОперации
//   НастройкиАвторизацииИзБазы - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НастройкиАвторизацииВ1СДокументообороте
//
Процедура ПослеНачалаРаботыСистемыЗавершение(Результат, НастройкиАвторизацииИзБазы) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Параметры = Результат.РезультатДлительнойОперации;
		
		ВерсияСервиса = Параметры.ИнтеграцияС1СДокументооборотВерсияСервиса;
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьВерсиюСервисаВПараметрыСеанса(
			ВерсияСервиса);
		
		Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СервисДоступен(ВерсияСервиса) Тогда
			// Подключение выполнено успешно, сервис ДО доступен.
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьНастройкиАвторизацииВПараметрыСеанса(
				Параметры.ИнтеграцияС1СДокументооборотИмяПользователя,
				Параметры.ИнтеграцияС1СДокументооборотПароль,
				Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияОС,
				Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияJWT,
				Параметры.ИнтеграцияС1СДокументооборотWSОпределения,
				Параметры.ИнтеграцияС1СДокументооборотМестоположениеПрокси);
			ПриАвторизации(Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияJWT);
			
#Если ВебКлиент Тогда
			ИмяКомпьютера = Неопределено;
#Иначе
			ИмяКомпьютера = ИмяКомпьютера();
#КонецЕсли
			Если Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияОС <>
					НастройкиАвторизацииИзБазы.ИспользуетсяАутентификацияОС Тогда
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиИспользованияАутентификацииОС(
					ИмяКомпьютера,
					Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияОС);
			КонецЕсли;
			Если Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияJWT <>
					НастройкиАвторизацииИзБазы.ИспользуетсяАутентификацияJWT Тогда
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиИспользованияАутентификацииJWT(
					ИмяКомпьютера,
					Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияJWT);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЗаписатьОшибку(Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик ожидания, который вызывается при завершении длительной операции подключения к ДО,
// из процедуры ПроверитьПодключение.
//
// Параметры:
//   Результат - Структура:
//     * АдресДополнительногоРезультата - Строка
//     * АдресРезультата - Строка
//     * КраткоеПредставлениеОшибки - Строка
//     * ПодробноеПредставлениеОшибки - Строка
//     * Сообщения - Массив из СообщениеПользователю
//     * Статус - Строка
//     * РезультатДлительнойОперации - см. ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПараметрыДлительнойОперации
//   ПараметрыОповещения - Структура:
//     * НастройкиАвторизации - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НастройкиАвторизацииВ1СДокументообороте
//     * ОписаниеОповещения - ОписаниеОповещения
//     * Владелец - ФормаКлиентскогоПриложения - форма, в которой следует вызвать повторную попытку подключения.
//                - ОбщийМодуль - клиентский модуль, из которого вызывается команда.
//     * ПовторноПоказыватьОкноАвторизации - Булево
//
Процедура ПроверитьПодключениеЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяАутентификацияОС = Ложь;
	ИспользуетсяАутентификацияJWT = Ложь;
	АвторизовалсяРанее = ПараметрыОповещения.НастройкиАвторизации.ПарольСохранен
		Или ПараметрыОповещения.НастройкиАвторизации.ИспользуетсяАутентификацияОС
		Или ПараметрыОповещения.НастройкиАвторизации.ИспользуетсяАутентификацияJWT;
	УспешноеПодключение = Ложь;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Параметры = Результат.РезультатДлительнойОперации;
		
		ВерсияСервиса = Параметры.ИнтеграцияС1СДокументооборотВерсияСервиса;
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьВерсиюСервисаВПараметрыСеанса(
			ВерсияСервиса);
		
		Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СервисДоступен(ВерсияСервиса) Тогда
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьНастройкиАвторизацииВПараметрыСеанса(
				Параметры.ИнтеграцияС1СДокументооборотИмяПользователя,
				Параметры.ИнтеграцияС1СДокументооборотПароль,
				Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияОС,
				Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияJWT,
				Параметры.ИнтеграцияС1СДокументооборотWSОпределения,
				Параметры.ИнтеграцияС1СДокументооборотМестоположениеПрокси);
			ПриАвторизации(Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияJWT);
			
			УспешноеПодключение = Истина;
			ПараметрыОповещения.ПовторноПоказыватьОкноАвторизации = Ложь;
			ИспользуетсяАутентификацияОС = Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияОС;
			ИспользуетсяАутентификацияJWT = Параметры.ИнтеграцияС1СДокументооборотИспользуетсяАутентификацияJWT;
			
#Если ВебКлиент Тогда
			ИмяКомпьютера = Неопределено;
#Иначе
			ИмяКомпьютера = ИмяКомпьютера();
#КонецЕсли
			Если ИспользуетсяАутентификацияОС <> ПараметрыОповещения.НастройкиАвторизации.ИспользуетсяАутентификацияОС Тогда
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиИспользованияАутентификацииОС(
					ИмяКомпьютера,
					ИспользуетсяАутентификацияОС);
			КонецЕсли;
			Если ИспользуетсяАутентификацияJWT <> ПараметрыОповещения.НастройкиАвторизации.ИспользуетсяАутентификацияJWT Тогда
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиИспользованияАутентификацииJWT(
					ИмяКомпьютера,
					ИспользуетсяАутентификацияJWT);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
		
	КонецЕсли;
	
	// Предлагаем окно авторизации, лишь если из контекста вызова известно, что пользователь явно
	// инициировал обращение к функционалу ДО.
	Если Не УспешноеПодключение
			И (ПараметрыОповещения.ПовторноПоказыватьОкноАвторизации
				Или ((ПараметрыОповещения.НастройкиАвторизации.ИмяПользователя = Неопределено Или Не АвторизовалсяРанее)
					И Не АвторизацияПредложена())) Тогда
		
		СохранитьАвторизацияПредложена();
		
		ПараметрыФормыАвторизации = Новый Структура;
		ПараметрыФормыАвторизации.Вставить("ИмяПользователя", ПараметрыОповещения.НастройкиАвторизации.ИмяПользователя);
		ПараметрыФормыАвторизации.Вставить("ПарольСохранен", ПараметрыОповещения.НастройкиАвторизации.ПарольСохранен);
		ПараметрыФормыАвторизации.Вставить("Пароль", ПараметрыОповещения.НастройкиАвторизации.Пароль);
		ПараметрыФормыАвторизации.Вставить("АвтоматическийВызовПриПроверкеПодключения", Истина);
		
		ПараметрыПроверкиПодключения = Новый Структура;
		ПараметрыПроверкиПодключения.Вставить("ОписаниеОповещения", ПараметрыОповещения.ОписаниеОповещения);
		
		ОписаниеОповещенияПроверкиПодключения = Новый ОписаниеОповещения(
			"ПроверитьПодключениеПослеОкнаАвторизации",
			ЭтотОбъект,
			ПараметрыПроверкиПодключения);
		
		ФормаАвторизации = ОткрытьФорму(
			"Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.АвторизацияВ1СДокументооборот",
			ПараметрыФормыАвторизации,
			ПараметрыОповещения.Владелец,,,,
			ОписаниеОповещенияПроверкиПодключения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		// В случае успешной аутентификации ОС форма не откроется.
		Если ФормаАвторизации = Неопределено Тогда
			
			УспешноеПодключение = Истина;
			
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПрочитатьНастройкиАвторизацииИзПараметровСеанса(
				ИспользуетсяАутентификацияОС,
				ИспользуетсяАутентификацияJWT);
			Если ИспользуетсяАутентификацияОС <> ПараметрыОповещения.НастройкиАвторизации.ИспользуетсяАутентификацияОС Тогда
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиИспользованияАутентификацииОС(
					ИмяКомпьютера,
					ИспользуетсяАутентификацияОС);
			КонецЕсли;
			Если ИспользуетсяАутентификацияJWT <> ПараметрыОповещения.НастройкиАвторизации.ИспользуетсяАутентификацияJWT Тогда
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиИспользованияАутентификацииJWT(
					ИмяКомпьютера,
					ИспользуетсяАутентификацияJWT);
			КонецЕсли;
			
		Иначе // Открылась форма авторизации.
			Возврат; // С асинхронным продолжением после нажатия ОК.
		КонецЕсли;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыОповещения.ОписаниеОповещения, УспешноеПодключение);
	
КонецПроцедуры

// Обработчик оповещения "СоздатьИнтегрированныйОбъектЗавершение".
//
// Параметры:
//   Результат - Произвольный
//   ПараметрыОповещения - Структура:
//     * Объект1СДокументооборота - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО
//     * ФормаОбъекта - ФормаКлиентскогоПриложения:
//         ** Объект - ОпределяемыйТип.ИнтеграцияС1СДокументооборотДокументыОбъектыПереопределяемый
//                   - ОпределяемыйТип.ИнтеграцияС1СДокументооборотСправочникиОбъектыПереопределяемый
//     * НаличиеПрисоединенныхФайлов - Булево
//     * ТипСоздаваемогоОбъекта - Строка - полное имя объекта метаданных, создаваемого в интегрированной системе.
//
Процедура СоздатьИнтегрированныйОбъектЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	ТипИнтегрируемогоОбъекта = Тип(ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ИмяТипаИзПолногоИмени(
		ПараметрыОповещения.ТипСоздаваемогоОбъекта));
	СсылкаНаОбъект = СсылкаНаИнтегрируемыйОбъектИзФормы(
		ПараметрыОповещения.ФормаОбъекта,
		ТипИнтегрируемогоОбъекта);
	ПараметрыОповещения.ФормаОбъекта = Неопределено;
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ID = ПараметрыОповещения.Объект1СДокументооборота.ID;
	Тип = ПараметрыОповещения.Объект1СДокументооборота.Тип;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДобавитьСвязь(
		ID,
		Тип,
		СсылкаНаОбъект,
		ПараметрыОповещения.НаличиеПрисоединенныхФайлов);
	Оповестить_ДобавлениеСвязи(ID, Тип, СсылкаНаОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииФайлы

Функция ИмяФайлаССуффиксом(КаталогССуффиксом, ТекущийФайл)
	
	ИмяФайлаССуффиксом = КаталогССуффиксом
		+ ПолучитьРазделительПути()
		+ ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ИмяФайлаСРасширением(
			ТекущийФайл.Наименование,
			ТекущийФайл.Расширение);
	
	МаксимальнаяДлинаПолногоПути = 260;
	Если НРег(ТекущийФайл.Расширение) = "xls" Или НРег(ТекущийФайл.Расширение) = "xlsx" Тогда
		// Excel длина имени файла вместе с путем не должна превышать 218 знаков.
		МаксимальнаяДлинаПолногоПути = 218;
	КонецЕсли;
	
#Если Не ВебКлиент Тогда
	
	ДлинаИмяФайлаССуффиксом = СтрДлина(ИмяФайлаССуффиксом);
	
	Если ДлинаИмяФайлаССуффиксом > МаксимальнаяДлинаПолногоПути Тогда
		
		МаксимальнаяДлинаСПутем = МаксимальнаяДлинаПолногоПути - 5; // 5 - минимум для "C:\1\"
		СколькоНадоОтрезать = ДлинаИмяФайлаССуффиксом - МаксимальнаяДлинаСПутем + 1;
		
		// Урезаем.
		ТекущийФайл.Наименование = Лев(ТекущийФайл.Наименование, СтрДлина(ТекущийФайл.Наименование) - СколькоНадоОтрезать);
		ТекущийФайл.Наименование = СокрЛП(ТекущийФайл.Наименование);
		ТекущийФайл.ИмяФайла = СтрШаблон("%1.%2", ТекущийФайл.Наименование, ТекущийФайл.Расширение);
		
		ИмяФайлаССуффиксом = КаталогССуффиксом
			+ ПолучитьРазделительПути()
			+ ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ИмяФайлаСРасширением(
				ТекущийФайл.Наименование,
				ТекущийФайл.Расширение);
		
	КонецЕсли;
	
#КонецЕсли
	
	Возврат ИмяФайлаССуффиксом;
	
КонецФункции

// Начинает печать файла во внешним приложением или, для некоторых видов файлов - средствами платформы.
//
Асинх Процедура НапечататьФайлПриложением(Знач ПолноеИмяФайла)
	
#Если МобильныйКлиент Тогда
	
	ПоказатьПредупреждение(, НСтр("ru = 'В мобильном клиенте печать файлов не поддерживается.'"));
	Возврат;
	
#ИначеЕсли ВебКлиент Тогда
	
	ПоказатьПредупреждение(, НСтр("ru = 'В веб-клиенте печать файлов не поддерживается.'"));
	Возврат;
	
#Иначе
	
	РасширенияИсключения =
		"m3u, m4a, mID, mIDi, mp2, mp3, mpa, rmi, wav, wma,
		|3g2, 3gp, 3gp2, 3gpp, asf, asx, avi, m1v, m2t, m2ts,
		|m2v, m4v, mkv, mov, mp2v, mp4, mp4v, mpe, mpeg, mts,
		|vob, wm, wmv, wmx, wvx, 7z, zip, rar, arc, arh, arj,
		|ark, p7m, pak, package, app, com, exe, jar, dll, res,
		|iso, isz, mdf, mds, cf, dt, epf, erf";
	РасширенияИсключенияМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		РасширенияИсключения,
		",",
		Истина,
		Истина);
	
	ПозицияТочки = СтрНайти(ПолноеИмяФайла, ".", НаправлениеПоиска.СКонца);
	Если ПозицияТочки <> 0 Тогда
		Расширение = НРег(Сред(ПолноеИмяФайла, ПозицияТочки + 1));
	Иначе
		Расширение = "";
	КонецЕсли;
	
	Расширение = НРег(Расширение);
	Если РасширенияИсключенияМассив.Найти(Расширение) <> Неопределено Тогда
		Возврат;
	
	ИначеЕсли Расширение = "grs" Тогда
		Схема = Новый ГрафическаяСхема;
		Ждать Схема.ПрочитатьАсинх(ПолноеИмяФайла);
		Схема.Напечатать();
	
	ИначеЕсли Расширение = "mxl" Тогда
		Результат = Ждать ПоместитьФайлНаСерверАсинх(,,, ПолноеИмяФайла);
		Если ТипЗнч(Результат) = Тип("ОписаниеПомещенногоФайла") И Не Результат.ПомещениеФайлаОтменено Тогда
			ТабличныйДокумент =
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЧтениеТабличногоДокумента(
					Результат.Адрес);
			ТабличныйДокумент.Напечатать();
		КонецЕсли;
		
	Иначе
		
		Попытка
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Если СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Windows_x86
					Или СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
				ПолноеИмяФайла = СтрЗаменить(ПолноеИмяФайла, "/", "\");
			КонецЕсли;
			ФайловаяСистемаКлиент.НапечататьИзПриложенияПоИмениФайла(ПолноеИмяФайла);
		Исключение
			Инфо = ИнформацияОбОшибке();
			ПоказатьПредупреждение(, СтрШаблон(
				НСтр("ru = 'Описание=""%1""'"),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Инфо)));
		КонецПопытки;
		
	КонецЕсли;
	
#КонецЕсли
	
КонецПроцедуры

// Открывает файл соответствующим ему приложением.
//
// Параметры:
//   ПолноеИмяФайла - Строка - полный путь к открываемому файлу.
//
// Возвращаемое значение:
//   Булево - Истина, если файл успешно открыт.
//
Функция ОткрытьФайлПриложением(ПолноеИмяФайла)
	
	СтруктураПолногоИмени = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайла);
	
	Если ЗначениеЗаполнено(СтруктураПолногоИмени.Путь) Тогда
		Попытка
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Если СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Windows_x86
					Или СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
				ПолноеИмяФайла = СтрЗаменить(ПолноеИмяФайла, "/", "\");
			КонецЕсли;
			ФайловаяСистемаКлиент.ОткрытьФайл(ПолноеИмяФайла);
		Исключение
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Описание=""%1""'"),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОшибкаПриДобавленииСканКопии(ЯвляетсяСканКопией, Файл)
	
	ЕстьОшибка = Ложь;
	
	Если ЯвляетсяСканКопией Тогда
		НастройкиДО = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ПолучитьНастройки();
		СписокРасширенийСканКопийОригиналов = НастройкиДО.СписокРасширенийСканКопийОригиналов;
		Если Не ПустаяСтрока(СписокРасширенийСканКопийОригиналов)
				И Не ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ЭтоРасширениеСканКопии(
					Файл.Расширение, СписокРасширенийСканКопийОригиналов) Тогда
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru='Файл ""%1"" не является скан-копией. Выберите файл с расширением: %2.'"),
				Файл.Имя,
				СписокРасширенийСканКопийОригиналов);
			ПоказатьПредупреждение(,ТекстПредупреждения);
			ЕстьОшибка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОшибка;
	
КонецФункции

// Начинает получение одного файла из Документооборота.
//
// Параметры:
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * НаЧтение - Булево - Истина, если файлы сохраняются на чтение, и Ложь, если на редактирование.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается с передачей массива полных имен файлов.
//     * ПолныеИменаФайлов - Массив из Строка - полные имена уже полученных файлов.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Асинх Процедура ПолучениеФайлаНачало(Знач Параметры)
	
	Если Не Ждать РасширениеРаботыСФайламиПодключеноАсинх() Тогда
		
		ИспользоватьВизуализациюШтампаЭП = Истина;
		Если ЗначениеЗаполнено(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла)
				И ЭтоАдресВременногоХранилища(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла) Тогда
			Адрес = Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла;
		ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFile" Тогда
			Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьФайлИПоместитьВХранилище(
					Параметры.ТекущийФайл.ID,
					ИспользоватьВизуализациюШтампаЭП,
					Параметры.УникальныйИдентификаторФормы,
					?(Параметры.НаЧтение, Неопределено, ТекущаяДата())); // Использование оправдано: фиксируется дата-время на клиенте.
		ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFileVersion" Тогда
			Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьВерсиюФайлаИПоместитьВХранилище(
					Параметры.ТекущийФайл.ID,
					ИспользоватьВизуализациюШтампаЭП,
					Параметры.УникальныйИдентификаторФормы);
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип файла: %1'"), Параметры.ТекущийФайл.Тип);
		КонецЕсли;
		Параметры.Вставить("АдресВременногоХранилищаФайла", Адрес);
		
		ФайловаяСистемаКлиент.СохранитьФайл(
			Новый ОписаниеОповещения(
				"ОбработатьФайлПослеПолученияИзДокументооборота",
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
				Параметры),
			Адрес,
			Параметры.ТекущийФайл.ИмяФайла);
		
		Возврат;
		
	КонецЕсли;
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентПовтИсп.ДоступенФункционалВерсииСервиса("1.4.9.1")
			И (Параметры.ТекущийФайл.Тип = "DMFile" Или Параметры.ТекущийФайл.Тип = "DMFileVersion") Тогда
		
		СведенияОРедактировании =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла(
				Параметры.ТекущийФайл.ID,
				Параметры.ТекущийФайл.Тип);
		Параметры.Вставить("СведенияОРедактировании", СведенияОРедактировании);
		
		Если Ждать НуженВыборДействийПриОбнаруженииОтличийФайлаАсинх(
				СведенияОРедактировании, Параметры, "ПолучениеФайлаПослеВыбораИсточника", Истина) Тогда
			Возврат;
		КонецЕсли;
		
		Если Параметры.ИспользоватьСуществующий Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения(
				"ПолучениеФайлаПослеВыбораИсточника",
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
				Параметры);
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, "ИспользоватьСуществующий");
			Возврат;
		КонецЕсли;
		
		// Если в ДО указана рабочая папка, попытаемся ее использовать.
		Если ЗначениеЗаполнено(СведенияОРедактировании.РекомендуемаяПапка) Тогда
			Файл = Новый Файл(СведенияОРедактировании.РекомендуемаяПапка);
			Если Ждать Файл.СуществуетАсинх() И Ждать Файл.ЭтоКаталогАсинх() Тогда // Используем указанную папку.
				КаталогВременныхФайлов = СведенияОРедактировании.РекомендуемаяПапка;
			ИначеЕсли Ждать Файл.СуществуетАсинх() И Ждать Файл.ЭтоФайлАсинх() Тогда // Использовать ее невозможно.
				КаталогВременныхФайлов = РабочийКаталогДанныхПользователя();
			Иначе // Попытаемся создать эту папку.
				Попытка
					Ждать СоздатьКаталогАсинх(СведенияОРедактировании.РекомендуемаяПапка);
					КаталогВременныхФайлов = СведенияОРедактировании.РекомендуемаяПапка;
				Исключение // Нет доступа или иные проблемы.
					КаталогВременныхФайлов = РабочийКаталогДанныхПользователя();
					ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ЗаписатьПредупреждение(
						СтрШаблон(
							НСтр("ru = 'Нет доступа к рабочей папке: %1'"),
							СведенияОРедактировании.РекомендуемаяПапка));
				КонецПопытки;
			КонецЕсли;
		Иначе // Рекомендуемый каталог не указан.
			КаталогВременныхФайлов = РабочийКаталогДанныхПользователя();
		КонецЕсли;
		
	Иначе // Веб-сервис этой версии не поддерживает расширенную работу с файлами.
		КаталогВременныхФайлов = РабочийКаталогДанныхПользователя();
	КонецЕсли;
	
	Если Прав(КаталогВременныхФайлов, 1) = ПолучитьРазделительПути() Тогда
		КаталогВременныхФайлов = Лев(КаталогВременныхФайлов, СтрДлина(КаталогВременныхФайлов) - 1);
	КонецЕсли;
	
	// Получим имя временного файла, не совпадающее с именем файла, существующего во временном каталоге,
	// создав, если нужно, подкаталог вида A...Z, A0...Z9.
	СчетчикПопыток = 0;
	Успех = Ложь;
#Если Не ВебКлиент Тогда
	Генератор = Новый ГенераторСлучайныхЧисел(Секунда(ТекущаяДата())); // Использование оправдано: ГСЧ.
#КонецЕсли
	Пока СчетчикПопыток < 100 Цикл
		СчетчикПопыток = СчетчикПопыток + 1;
#Если Не ВебКлиент Тогда
		Если СчетчикПопыток = 1 Тогда
			Суффикс = "";
		Иначе
			Суффикс = Символ(КодСимвола("A") + Генератор.СлучайноеЧисло(0, 25));
			Если СчетчикПопыток > 13 Тогда // Пора усложнить суффикс.
				Суффикс = Суффикс + Строка(Генератор.СлучайноеЧисло(0, 9));
			КонецЕсли;
		КонецЕсли;
#Иначе
		Если СчетчикПопыток = 1 Тогда
			Суффикс = "";
		Иначе
			Суффикс = Символ(КодСимвола("A") + (Секунда(ТекущаяДата()) + СчетчикПопыток) % 26); // Использование оправдано: ГСЧ.
			Если СчетчикПопыток > 13 Тогда // Пора усложнить суффикс.
				Суффикс = Суффикс + Строка((Секунда(ТекущаяДата()) + СчетчикПопыток) % 10); // Использование оправдано: ГСЧ.
			КонецЕсли;
		КонецЕсли;
#КонецЕсли
		КаталогССуффиксом = КаталогВременныхФайлов + ?(Суффикс = "",
			"",
			ПолучитьРазделительПути() + Суффикс);
		Файл = Новый Файл(КаталогССуффиксом);
		Если Ждать Файл.СуществуетАсинх() Тогда
			Если Ждать Файл.ЭтоФайлАсинх() Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			Попытка
				Ждать СоздатьКаталогАсинх(КаталогССуффиксом);
			Исключение
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка при создании каталога ""%1"":
						|""%2"".'"),
					КаталогССуффиксом,
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) );
			КонецПопытки;
		КонецЕсли;
		
		ИмяФайлаССуффиксом = ИмяФайлаССуффиксом(КаталогССуффиксом, Параметры.ТекущийФайл);
		Файл = Новый Файл(ИмяФайлаССуффиксом);
		Если Не Ждать Файл.СуществуетАсинх() Тогда
			Успех = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не Успех Тогда
		ВызватьИсключение НСтр("ru = 'Не удается создать файл в каталоге временных файлов.'");
	КонецЕсли;
	Параметры.Вставить("КаталогВременныхФайлов", КаталогССуффиксом);
	Параметры.Вставить("ИмяВременногоФайла", ИмяФайлаССуффиксом);
	
	// Получим файл из ДО на сервере.
	ИспользоватьВизуализациюШтампаЭП = Истина;
	Если ЗначениеЗаполнено(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла)
			И ЭтоАдресВременногоХранилища(Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла) Тогда
		Адрес = Параметры.ТекущийФайл.СсылкаНаДвоичныеДанныеФайла;
	ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFile" Тогда
		Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьФайлИПоместитьВХранилище(
			Параметры.ТекущийФайл.ID,
			ИспользоватьВизуализациюШтампаЭП,
			Параметры.УникальныйИдентификаторФормы,
			?(Параметры.НаЧтение, Неопределено, ТекущаяДата()), // Использование оправдано: фиксируется дата-время на клиенте.
			Параметры.ТекущийФайл.Размер,
			Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
	ИначеЕсли Параметры.ТекущийФайл.Тип = "DMFileVersion" Тогда
		Адрес = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьВерсиюФайлаИПоместитьВХранилище(
			Параметры.ТекущийФайл.ID,
			ИспользоватьВизуализациюШтампаЭП,
			Параметры.УникальныйИдентификаторФормы,
			Параметры.ТекущийФайл.Размер,
			Параметры.ТекущийФайл.ДатаМодификацииУниверсальная);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип файла: %1'"), Параметры.ТекущийФайл.Тип);
	КонецЕсли;
	Параметры.Вставить("АдресВременногоХранилищаФайла", Адрес);
	
	ПолучениеФайлаПослеПолученияИзДокументооборота(Параметры);
	
КонецПроцедуры

// Начинает получение файлов, вызывая оповещение после получения всех файлов.
//
// Параметры:
//   Параметры - Структура:
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * НаЧтение - Булево - Истина, если файлы сохраняются на чтение, и Ложь, если на редактирование.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается с передачей массива полных имен файлов.
//     * ПолныеИменаФайлов - Массив из Строка - полные имена уже полученных файлов.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//
Процедура ПолучитьФайлыНачало(Параметры)
	
	// Получены ли все файлы?
	Если Параметры.ОставшиесяФайлы.Количество() = 0 Тогда
		
		Если Параметры.ПолныеИменаФайлов.Количество() <> 0 Тогда
			ВыполнитьОбработкуОповещения(
				Параметры.ОписаниеОповещения,
				Параметры.ПолныеИменаФайлов);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Параметры.Вставить("ТекущийФайл", Параметры.ОставшиесяФайлы[0]);
	Параметры.ОставшиесяФайлы.Удалить(0);
	
	ПолучениеФайлаНачало(Параметры);
	
КонецПроцедуры

Асинх Функция НуженВыборДействийПриОбнаруженииОтличийФайлаАсинх(Знач СведенияОРедактировании, Знач Параметры,
		Знач ПроцедураПродолжения, Знач ВыполняетсяОткрытиеФайла)
	
	Параметры.Вставить("ИспользоватьСуществующий", Ложь);
	
	Если Не СведенияОРедактировании.Сохранен Или Параметры.ТекущийФайл.Тип = "DMFileVersion" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Параметры.Вставить("ИмяВременногоФайла", СведенияОРедактировании.ПолныйПуть);
	Параметры.Вставить("КаталогВременныхФайлов", СведенияОРедактировании.РекомендуемаяПапка);
	
	Файл = Новый Файл(СведенияОРедактировании.ПолныйПуть);
	Если Не Ждать Файл.СуществуетАсинх() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверим дату-время существующего файла.
	ДатаВремяНаДиске = Ждать Файл.ПолучитьУниверсальноеВремяИзмененияАсинх();
	ДатаВремяВДокументообороте = Дата(СведенияОРедактировании.ДатаМодификацииУниверсальная);
	РазмерНаДиске = Ждать Файл.РазмерАсинх();
	РазмерВДокументообороте = СведенияОРедактировании.Размер;
	РазницаДат = ДатаВремяНаДиске - ДатаВремяВДокументообороте;
	
	// Определим необходимость обновления сведений о редактировании.
	Если Параметры.Свойство("СведенияОРедактировании") И Параметры.Свойство("НаЧтение") Тогда
		Если РазницаДат <> 0 Или (СведенияОРедактировании.НаЧтение И Не Параметры.НаЧтение) Тогда
			Параметры.Вставить("ОбновитьСведенияОРедактировании", Истина);
			Параметры.СведенияОРедактировании.Вставить("ДатаМодификацииУниверсальная", ДатаВремяНаДиске);
			Параметры.СведенияОРедактировании.Вставить("Размер", РазмерНаДиске);
		Иначе
			Параметры.Вставить("ОбновитьСведенияОРедактировании", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	// Определим, следует ли задавать вопрос пользователю, или же решение очевидно.
	РазмерИДатаСовпадают = (РазницаДат >= -1 И РазницаДат <= 1 И РазмерВДокументообороте = РазмерНаДиске);
	ФайлНаРедактировании = (РазницаДат > 0 И СведенияОРедактировании.НаЧтение = Ложь);
	
	Если ВыполняетсяОткрытиеФайла Тогда
		
		// При открытии файла, если временный файл совпадает с файлом ДО, или если прямо сейчас файл
		// находится на редактировании - ничего спрашивать не нужно, используем существующий временный файл.
		Если (РазмерИДатаСовпадают Или ФайлНаРедактировании) Тогда
			Параметры.ИспользоватьСуществующий = Истина;
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		// При сохранении файла на диск, если временный файл совпадает с файлом ДО - ничего спрашивать не нужно,
		// для сохранения возьмем файл из ДО. Если временный файл отличается от файла ДО - спросим
		// какой именно файл требуется сохранить на диск.
		Если РазмерИДатаСовпадают Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// уверенности нет, требуется вмешательство пользователя
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПолныйПуть", СведенияОРедактировании.ПолныйПуть);
	ПараметрыФормы.Вставить("ДатаВремяНаДиске", ДатаВремяНаДиске);
	ПараметрыФормы.Вставить("ДатаВремяВДокументообороте", ДатаВремяВДокументообороте);
	ПараметрыФормы.Вставить("РазмерНаДиске", РазмерНаДиске);
	ПараметрыФормы.Вставить("РазмерВДокументообороте", РазмерВДокументообороте);
	
	// Сформулируем вопрос в зависимости от того, какой из файлов свежее.
	Если РазницаДат > 0 Тогда
		// файл на диске свежее
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'На диске новый файл'"));
		ПараметрыФормы.Вставить("Сообщение",
			НСтр("ru = 'Файл на диске новее, чем файл в 1С:Документообороте.
				|Возможно, он был изменен.
				|
				|Использовать существующий файл или заменить его на файл из 1С:Документооборота,
				|возможно, с потерей изменений?'"));
	Иначе
		// файл на диске старше
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'В 1С:Документообороте новый файл'"));
		ПараметрыФормы.Вставить("Сообщение",
			НСтр("ru = 'Файл в 1С:Документообороте новее, чем файл на диске.
				|Возможно, он был изменен.
				|
				|Взять файл из 1С:Документооборота, заменив файл на диске с потерей
				|изменений, или использовать существующий файл?'"));
	КонецЕсли;
	
	ОповещениеПродолжение = Новый ОписаниеОповещения(
		ПроцедураПродолжения,
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
		Параметры);
	
	ОткрытьФорму(
		"Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.ВыборДействийПриОбнаруженииОтличийФайла",
		ПараметрыФормы,,,,,
		ОповещениеПродолжение,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	Возврат Истина;
	
КонецФункции

// Вызывается в ходе получения файла после получения файла из ДО.
//
// Параметры:
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ОставшиесяФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ИспользоватьВизуализациюШтампаЭП - Булево - требуется получить двоичные данные файла с визуализацией штампа ЭП.
//     * НаЧтение - Булево - Истина, если файлы сохраняются на чтение, и Ложь, если на редактирование.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается с передачей массива полных имен файлов.
//     * ПолныеИменаФайлов - Массив из Строка - полные имена уже полученных файлов.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * СведенияОРедактировании - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьСведенияОРедактированииФайла
//     * КаталогВременныхФайлов - Строка - каталог для сохранения временного файла.
//     * ИмяВременногоФайла - Строка - имя, под которым будет сохранен файл.
//     * АдресВременногоХранилищаФайла - Строка - адрес, где хранится полученный из ДО файл.
//
Процедура ПолучениеФайлаПослеПолученияИзДокументооборота(Параметры)
	
	// Соберем описание получаемого файла и получим его.
	ПолучаемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(
		Параметры.ИмяВременногоФайла,
		Параметры.АдресВременногоХранилищаФайла);
	ПолучаемыеФайлы.Добавить(Описание);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Интерактивно = Ложь;
	ФайловаяСистемаКлиент.СохранитьФайл(
		Новый ОписаниеОповещения(
			"ОбработатьФайлПослеПолученияИзДокументооборота",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			Параметры),
		Параметры.АдресВременногоХранилищаФайла,
		Параметры.ИмяВременногоФайла,
		ПараметрыСохранения);
	
КонецПроцедуры

// Получает файлы из ДО в каталог временных файлов и передает их на дальнейшую обработку.
//
// Параметры:
//   Файлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла.
//   УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//   ОписаниеОповещенияОЗавершении - ОписаниеОповещения - вызывается с передачей массива полных имен файлов.
//   НаЧтение - Булево - Истина, если файлы сохраняются на чтение, и Ложь, если на редактирование.
//
Процедура ПолучитьФайлыИПродолжить(Файлы, УникальныйИдентификаторФормы, ОписаниеОповещенияОЗавершении,
		НаЧтение = Истина)
	
	Параметры = Новый Структура;
	Параметры.Вставить("ОставшиесяФайлы", Файлы);
	Параметры.Вставить("ИспользоватьВизуализациюШтампаЭП", Истина);
	Параметры.Вставить("ПолныеИменаФайлов", Новый Массив);
	Параметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	Параметры.Вставить("ОписаниеОповещения", ОписаниеОповещенияОЗавершении);
	Параметры.Вставить("НаЧтение", НаЧтение);
	
	ПолучитьФайлыНачало(Параметры);
	
КонецПроцедуры

// Проинициализировать компоненту сканирования.
//
// Возвращаемое значение:
//   Булево
//
Асинх Функция ПроинициализироватьКомпонентуАсинх()
	
	Если ПараметрыПриложения["ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера"] = Неопределено Тогда
		КодВозврата = Ждать ПодключитьВнешнююКомпонентуАсинх(
			"ОбщийМакет.ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера",
			"ImageFromClipboard",
		ТипВнешнейКомпоненты.Native);
		
		Если Не КодВозврата Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ПараметрыПриложения["ИнтеграцияС1СДокументооборотКомпонентаПолученияКартинкиИзБуфера"] =
			Новый("AddIn.ImageFromClipboard.AddInNativeExtension");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Возвращает результат подключения расширения работы с файлами.
//
// Возвращаемое значение:
//   Булево - в тонком клиенте всегда Истина, в браузере Google Chrome - всегда Ложь.
//
Асинх Функция РасширениеРаботыСФайламиПодключеноАсинх()
	
	Если КлиентПоддерживаетСинхронныеВызовы() Тогда
		Возврат Ждать ПодключитьРасширениеРаботыСФайламиАсинх();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Выполняется в ходе создания файла с диска после помещения файла (универсальное завершение).
//
// Параметры:
//   Параметры - Структура:
//     * ТекущийФайл - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * АдресВременногоХранилищаФайла - Строка - адрес временного хранилища файла.
//     * Файл - Файл - инициализированный файл.
//     * Владелец - ЛюбаяСсылка - владелец файла.
//     * ВладелецID - Строка - идентификатор владельца файла в Документообороте.
//     * ВладелецТип - Строка - тип XDTO владельца файла в Документообороте.
//     * ВладелецПредставление - Строка - представление владельца файла.
//     * ПолноеИмяФайла - Строка - полное имя выбранного пользователем файла.
//     * ПолныеИменаФайлов - Массив из Строка - имена добавленных файлов.
//     * ПомещенныеФайлы - Массив из см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//     * ЯвляетсяСканКопией - Булево - признак скан-копии.
//     * УникальныйИдентификаторФормы - УникальныйИдентификатор - идентификатор вызвавшей формы.
//     * ОписаниеОповещения - ОписаниеОповещения - вызывается при успешном завершении.
//                          - Неопределено - вызывать ничего не нужно.
//
Процедура СоздатьФайлСДискаЗавершение(Параметры)
	
	// Разберем полный путь на имя и расширение.
	СтруктураИмени = РазложитьПолноеИмяФайла(Параметры.ПолноеИмяФайла);
	Параметры.ТекущийФайл.Наименование = СтруктураИмени.ИмяБезРасширения;
	Параметры.ТекущийФайл.Расширение = СтруктураИмени.Расширение;
	
	ПараметрыСоздания = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НовыеПараметрыСозданияФайла(
		Параметры.ТекущийФайл);
	ПараметрыСоздания.АдресВременногоХранилищаФайла = Параметры.АдресВременногоХранилищаФайла;
	ПараметрыСоздания.Владелец = Параметры.Владелец;
	ПараметрыСоздания.ЯвляетсяСканКопией = Параметры.ЯвляетсяСканКопией;
	
	Параметры.ТекущийФайл.ID =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СоздатьФайлВДокументообороте(
			ПараметрыСоздания,
			Параметры.ВладелецID,
			Параметры.ВладелецТип,
			Параметры.ВладелецПредставление);
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Создан файл ""%1""'"), Параметры.ТекущийФайл.Наименование);
	ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
	ДействиеНадФайлом.СозданиеФайла = Истина;
	ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
	ИнформироватьОбИзмененииФайла(
		ДействиеНадФайлом,
		Параметры.ТекущийФайл.Наименование,
		Параметры.ТекущийФайл.ID,
		Параметры.ВладелецID,
		ТекстСообщения,,
		Параметры.УникальныйИдентификаторФормы);
	
	Параметры.ПомещенныеФайлы.Добавить(Параметры.ТекущийФайл);
	
	// Все ли файлы помещены?
	Если Параметры.ПолныеИменаФайлов.Количество() = 0 Тогда
		ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
		ДействиеНадФайлом.СозданиеФайла = Истина;
		ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
		ИнформироватьОбИзмененииФайла(
			ДействиеНадФайлом,
			Параметры.ТекущийФайл.Наименование,
			Параметры.ТекущийФайл.ID,
			Параметры.ВладелецID,,,
			Параметры.УникальныйИдентификаторФормы);
		Если Параметры.ОписаниеОповещения <> Неопределено Тогда // Оповестим, передав описания.
			ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Параметры.ПомещенныеФайлы);
		КонецЕсли;
	Иначе
		// Продолжим создание.
		Параметры.ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
			Неопределено,
			Неопределено,
			Параметры.ТекущийФайл.Тип,
			Неопределено,
			Параметры.ТекущийФайл.РольФайлаID);
		СоздатьФайлыСДискаАсинх(Параметры.ПолныеИменаФайлов, Параметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииЭлектронныеПодписи

// Проверяет, поддерживает ли клиент синхронные вызовы.
//
Функция КлиентПоддерживаетСинхронныеВызовы()
	
#Если ВебКлиент Тогда
	// В Chrome расширение не подключается.
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИнформацияПрограммыМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		СистемнаяИнформация.ИнформацияПрограммыПросмотра, " ");
	
	Для Каждого ИнформацияПрограммы Из ИнформацияПрограммыМассив Цикл
		Если Найти(ИнформацияПрограммы, "Chrome") > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
#КонецЕсли
	
	Возврат Истина;
	
КонецФункции

// Возвращает общие настройки электронной подписи.
//
// Возвращаемое значение:
//   Структура:
//     * ИспользоватьЭлектронныеПодписи - Булево - если Истина, то электронный подписи используются.
//     * ИспользоватьШифрование - Булево - если Истина, то шифрование используются.
//     * ПроверятьЭлектронныеПодписиНаСервере - Булево - если Истина, то электронные подписи и
//         сертификаты проверяются на сервере.
//     * СоздаватьЭлектронныеПодписиНаСервере - Булево - если Истина, то электронные подписи создаются
//         сначала на сервере, а в случае неудачи на клиенте.
//     * ОписанияПрограмм - Массив из см. ЭлектроннаяПодписьСлужебныйПовтИсп.ОписаниеПрограммы - сведения о
//         поддерживаемых программах криптографии.
//
Функция ОбщиеНастройкиЭП()
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента();
	
	Если ПараметрыРаботыКлиента.Свойство("ЭлектроннаяПодпись") Тогда
		Возврат ПараметрыРаботыКлиента.ЭлектроннаяПодпись.ОбщиеНастройки;
	Иначе
		ОбщиеНастройкиЭП = Новый Структура;
		ОбщиеНастройкиЭП.Вставить("ИспользоватьЭлектронныеПодписи", Ложь);
		ОбщиеНастройкиЭП.Вставить("ИспользоватьШифрование", Ложь);
		ОбщиеНастройкиЭП.Вставить("ПроверятьЭлектронныеПодписиНаСервере", Ложь);
		ОбщиеНастройкиЭП.Вставить("СоздаватьЭлектронныеПодписиНаСервере", Ложь);
		ОбщиеНастройкиЭП.Вставить("ОписанияПрограмм", Новый Массив);
		Возврат ОбщиеНастройкиЭП;
	КонецЕсли;
	
КонецФункции

// Проверяет одну электронно-цифровую подпись.
//
// Параметры:
//   ДанныеСтроки - ДанныеФормыЭлементДерева - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтруктураСтрокиДереваПодписей
//   МенеджерКриптографии - МенеджерКриптографии - объект Менеджера криптографии.
//   СоответствиеИдОбъектаИДвоичныхДанных - Соответствие из КлючИЗначение:
//     * Ключ - Строка - идентификатор объекта.
//     * Значение - ДвоичныеДанные - двоичные данные объекта.
//   АдресСлепкаДокумента - Строка - адрес временного хранилища двоичных данных документа Документооборота.
//
Процедура ПроверитьОднуПодпись(ДанныеСтроки, МенеджерКриптографии, СоответствиеИдОбъектаИДвоичныхДанных,
		АдресСлепкаДокумента)
	
	ПараметрыПроверкиЭП = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ПараметрыПроверкиЭП(
		ДанныеСтроки,
		СоответствиеИдОбъектаИДвоичныхДанных,
		АдресСлепкаДокумента);
	Если ПараметрыПроверкиЭП.Подпись = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	Попытка
		Неверна = Ложь;
		Сертификат = Неопределено;
		МенеджерКриптографии.ПроверитьПодпись(
			ПараметрыПроверкиЭП.ДвоичныеДанныеОбъекта,
			ПараметрыПроверкиЭП.Подпись,
			Сертификат);
		МассивРежимовПроверки = Новый Массив;
		МассивРежимовПроверки.Добавить(РежимПроверкиСертификатаКриптографии.ИгнорироватьВремяДействия);
		МассивРежимовПроверки.Добавить(РежимПроверкиСертификатаКриптографии.РазрешитьТестовыеСертификаты);
		МенеджерКриптографии.ПроверитьСертификат(Сертификат, МассивРежимовПроверки);
	Исключение
		Неверна = Истина;
		Инфо = ИнформацияОбОшибке();
		Если Инфо.Причина <> Неопределено Тогда
			ОписаниеОшибки = Инфо.Причина.Описание;
		КонецЕсли;
	КонецПопытки;
	
	ДанныеСтроки.ДатаПроверкиПодписи = ТекущаяДата(); // Использование оправдано: фиксируется дата-время на клиенте.
	ДанныеСтроки.Неверна = Неверна;
	ДанныеСтроки.ПодписьВерна = Не Неверна;
	ДанныеСтроки.Статус = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СтатусЭП(Неверна, ОписаниеОшибки);
	ДанныеСтроки.КомуВыданСертификатИСтатус = ДанныеСтроки.КомуВыданСертификат + Символы.ПС + ДанныеСтроки.Статус;
	
КонецПроцедуры

#КонецОбласти

// Возвращает активные обработчики ожидания фонового задания.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение:
//     * Ключ - УникальныйИдентификатор - идентификатор фонового задания.
//     * Значение - Массив из Структура:
//       ** Владелец - ФормаКлиентскогоПриложения
//       ** ОповещениеОЗавершении - ОписаниеОповещения
//       ** ВыводитьОкноОжидания - Булево
//       ** СкрыватьИнтерфейс - Булево
//       ** СтарыйЗаголовок - Строка
//
Функция АктивныеОбработчикиОжиданияФоновогоЗадания()
	
	ИмяПараметра = "ИнтеграцияС1СДокументооборотом.АктивныеОбработчикиОжиданияФоновогоЗадания";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		Обработчики = Новый Соответствие;
		ПараметрыПриложения.Вставить(ИмяПараметра, Обработчики);
	КонецЕсли;
	
	Возврат ПараметрыПриложения[ИмяПараметра];
	
КонецФункции

Процедура ВыбратьЗначениеДополнительногоРеквизитаОбработка(ИмяТипа, Форма, Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	Если ИмяТипа = "integer"
			Или ИмяТипа = "boolean"
			Или ИмяТипа = "string"
			Или ИмяТипа = "date" Тогда
		
		Если ИмяТипа = "integer" Тогда
			ТипЗначения = Тип("Число");
		ИначеЕсли ИмяТипа = "boolean" Тогда
			ТипЗначения = Тип("Булево");
		ИначеЕсли ИмяТипа = "string" Тогда
			ТипЗначения = Тип("Строка");
		ИначеЕсли ИмяТипа = "date" Тогда
			ТипЗначения = Тип("Дата");
		КонецЕсли;
		// Ввод значения примитивного типа - строка, число и т.п.
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Элемент", Элемент);
		ПараметрыОповещения.Вставить("Форма", Форма);
		Оповещение = Новый ОписаниеОповещения(
			"ВыбратьЗначениеДополнительногоРеквизитаВводЗначенияЗавершение",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			ПараметрыОповещения);
		ПоказатьВводЗначения(Оповещение, ТекущиеДанные.Значение, ТекущиеДанные.Свойство, ТипЗначения);
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		
		Владелец = Новый Структура;
		Владелец.Вставить("ID", ТекущиеДанные.СвойствоID);
		Владелец.Вставить("type", ТекущиеДанные.СвойствоТип);
		
		Отбор = Новый Структура;
		Если ИмяТипа = "DMObjectPropertyValue"
			Или ИмяТипа = "DMObjectPropertyValueHierarchy" Тогда
			Отбор.Вставить("additionalProperty", Владелец);
		КонецЕсли;
		
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("ТипОбъектаВыбора", ИмяТипа);
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Элемент", Элемент);
		ПараметрыОповещения.Вставить("Форма", Форма);
		
		Оповещение = Новый ОписаниеОповещения(
			"ВыбратьЗначениеДополнительногоРеквизитаЗавершение",
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент,
			ПараметрыОповещения);
		ОткрытьФорму("Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.ВыборИзСписка", ПараметрыФормы, Форма,,,, Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьНавигационнуюСсылку(НавигационнаяСсылка)
	
	НавигационнаяСсылка = СокрЛП(СтрЗаменить(НавигационнаяСсылка, Символы.НПП, " "));
	
КонецПроцедуры

Функция СтрокаПоляТабличнойЧасти(Элемент)
	
	РодительЭлемента = Элемент.Родитель;
	Пока ТипЗнч(РодительЭлемента) = Тип("ГруппаФормы") Цикл
		РодительЭлемента = РодительЭлемента.Родитель;
	КонецЦикла;
	
	Возврат РодительЭлемента.ТекущиеДанные;
	
КонецФункции

#КонецОбласти