
&НаКлиенте
Перем ШтрихкодСекция;

&НаКлиенте
Перем СуммаОплатыБонусами;

#Область СобытияФормы

&НаКлиенте
Процедура Док_ПартнерОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//158234 запись в чек способ ввода клиента
    СпособВводаКлиента = ПредопределенноеЗначение("Перечисление.СпособВводаКлиента.РучнойВвод");
    Объект.СпособВводаКлиента = СпособВводаКлиента;    
    //158234
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документы.РеализацияТоваровУслуг.ПроверкаКорректностиПримененияСкидокВЗаказе(Объект.Ссылка, Объект.ЗаказКлиента, Отказ);
	
	Если ПустаяСтрока(Объект.Номер) И Не ЗначениеЗаполнено(Объект.Дата) И Не ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		АльтерраОбщегоНазначения.ЗаполнитьРеквизитыПродажи(Объект);
	КонецЕсли;
	Элементы.ОплатаДоставкиКартой.Видимость = Ложь;
	ЭтаФорма.Элементы.ОтметкаКассы.Видимость = РольДоступна("ПолныеПрава") или РольДоступна("ОтметкаКассы");
	ЭтаФорма.Элементы.ТоварыСброситьПоСекции.Видимость=рольДоступна("ПолныеПрава") или рольДоступна("СнятьЗеленение");
	
	Элементы._ЗаполнитьШапкуПоЗаказу.Видимость= Ложь;
	Элементы._ЗаполнитьНарезкуПоЗаказу.Видимость = Ложь;
	
	Элементы.ТекстДокументыНаОснованииПодвалРасш.Доступность=Объект.ПорядокРасчетов=ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов");
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		_ТоварПодЗаказ = Объект.ЗаказКлиента.ТоварПодЗаказ;
	КонецЕсли;
	
	НовыйПорядокНачисленияБонусов = БонусыАльтерраРезерв.ПрименитьНовыйПорядокРаспределенияБонусов(Объект);
	Если НовыйПорядокНачисленияБонусов Тогда
		ЗаполнитьБонусыПоЗаказу();
	КонецЕсли;
	
	// договор на форме	
	элементы.ИспользуетсяДоговор.Доступность = Не Объект.РеализацияПоЗаказам;
	Элементы._НаценкаКарта.Доступность = Не Объект.РеализацияПоЗаказам;
	Элементы.Товары_ВыгрузитьВДБФ.Видимость = Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	_НаценкаКарта=найтиСкидку("Наценка на оплату картой",Объект);		
	
	ПоказатьИнформациюПоБонусам();
	
	// Альтерра Островская П.А. № 88786 Сделать доступным поле "Пробить чек" {+
	Элементы.ГруппаСчетФактураИСостояние.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	//Островская }+
	
	Элементы.ИсключитьИзКонтроля.Доступность = РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");
	
	Если Объект.Ссылка.Пустая() Тогда
		ДопМодуль.СохранитьПроцентРучнойСкидки(Объект.Товары);
	КонецЕсли;
	Элементы.КонтрагентРаботаетВЭДО.Видимость=ДопМодуль.КонтрагентРаботаетВЭдо(Объект.Контрагент);	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Товары_ДобавитьУслугуБезНДС", "Видимость", НЕ АльтерраОбщегоНазначения.ЕстьБлокировкаУслуги(текущаяДата()));
	
	Элементы.ПринятьОплатуПоСсылке.Видимость = Не ЗначениеЗаполнено(Объект.Кассир);
	
КонецПроцедуры


&НаСервере
Процедура Док_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	УстановитьВидимостьДоступностьДополнительно();
	ДопМодуль.СохранитьПроцентРучнойСкидки(Объект.Товары);
КонецПроцедуры


&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
			Объект.ВариантВыбытияМаркируемойПродукции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента, "ВариантВыбытияМаркируемойПродукции");
		КонецЕсли;
	конецесли;	
	
	УстановитьДоступностьПоОтметкеКассы();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Форма_Провести", "Доступность", РольДоступна("ОтделАналитики"));
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	Если Объект.Кассир.Пустая() Тогда // проверка отметки кассы
		Объект.ДатаПоследнегоОткрытия = ТекущаяДатаСеанса();
	КонецЕсли;	
	Элементы.ТоварыВидЦены.БыстрыйВыбор = Истина;
	УведомленияПодрядчику_ИнициализацияЗначений(); 
	ОбновитьПараметрыВыбораЦен();
	
	УстановитьВидимостьДоступностьДополнительно();  
	
	НовыйЭлемент = Элементы.Вставить("Обособленно", Тип("ПолеФормы"), Элементы.Товары,Элементы.ТоварыКоличествоУпаковок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;                                                                           
	НовыйЭлемент.ШиринаЭлемента = 10;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.Обособленно"; 
	НовыйЭлемент.ТолькоПросмотр = Истина;    
	
	ЗаполнитьКолонкуОбособленно();
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьКолонкуОбособленно()     
	Если Объект.Товары.Количество() > 0 Тогда 
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));    
		ТаблицаТоваров.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число"));
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл  
			Если ЗначениеЗаполнено(ТекущаяСтрока.ЗаказКлиента) Тогда
				НовыйТовар = ТаблицаТоваров.Добавить();
				НовыйТовар.Заказ = ТекущаяСтрока.ЗаказКлиента; 
				НовыйТовар.КодСтроки = ТекущаяСтрока.КодСтроки;
			КонецЕсли;
		КонецЦикла;      
		
		Если ТаблицаТоваров.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;  
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &ТЗ КАК ТЗ";
			Запрос.УстановитьПараметр("ТЗ", ТаблицаТоваров);
			Запрос.Выполнить();
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗ.КодСтроки КАК КодСтроки,
			|	ТЗ.Заказ КАК Заказ,
			|	ЕСТЬNULL(ЗаказКлиентаТовары.Обособленно, ЛОЖЬ) КАК Обособленно
			|ИЗ
			|	ТЗ КАК ТЗ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|		ПО ТЗ.Заказ = ЗаказКлиентаТовары.Ссылка
			|			И ТЗ.КодСтроки = ЗаказКлиентаТовары.КодСтроки";
			
			РезультатЗапроса = Запрос.Выполнить();  
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				Отбор = Новый Структура();
				Отбор.Вставить("КодСтроки", Выборка.КодСтроки);
				Отбор.Вставить("ЗаказКлиента", Выборка.Заказ);
				НайденноеЗначение = Объект.Товары.НайтиСтроки(Отбор);
				
				Если НайденноеЗначение.Количество() > 0 Тогда
					Для каждого ТекущаяСтрока Из НайденноеЗначение Цикл
						ТекущаяСтрока.Обособленно = Выборка.Обособленно; 
					КонецЦикла;
				КонецЕсли;	
			КонецЦикла;	    
			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура Док_ПриОткрытии(Отказ)
	// Альтерра ПроектЧеки
	ЗапретВидимостиБонусов();
	Элементы.ДатаСоздания.ТолькоПросмотр = Истина;
	УстановитьУсловноеОформлениеПолей();
	
	ЕстьРольОтметкаКассы = ПроверитьРоль();
	Если ЕстьРольОтметкаКассы = Ложь Тогда 
		Элементы.ГруппаСоздатьНаОснованииПКОИЭквайринговаяОперация.Видимость = ложь;
	КонецЕсли;  
	
	Если АльтерраОбщегоназначения.ЭтоБригадир(Объект.Партнер) Тогда
		Элементы.БонусныеБаллыСуммаБонусныхБалловЗаКП.Заголовок = "Доп. баллы";
		Элементы.ТоварыСуммаНачисленныхБалловЗаКП.Заголовок = "Доп. баллы";
	КонецЕсли;
	
	Если Элементы.Найти("ПодобратьИПроверитьПродукциюГосИС")<> Неопределено Тогда   
		Для Каждого Элемент из Элементы.ПодобратьИПроверитьПродукциюГосИС.ПодчиненныеЭлементы Цикл  
			Элемент.Доступность = Истина;
		КонецЦикла;
	КонецЕсли;
	
	НомерТелефонаПартнера = ПолучитьНомерТелефонаПартнера();
	
КонецПроцедуры                                                  


&НаСервере
Процедура УстановитьВидимостьДоступностьДополнительно()
	
	Если Не (АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер)
		Или АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Объект.Партнер))
		Тогда
		Элементы.НачисленныеБаллы.Видимость = Ложь;
		Элементы.ТоварыСуммаБонусныхБалловКСписаниюВВалюте.Видимость = Ложь;
	Иначе
		Элементы.НачисленныеБаллы.Видимость = Истина;
		Элементы.ТоварыСуммаБонусныхБалловКСписаниюВВалюте.Видимость = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Кассир) И Объект.СтатусДокументаВЭДО <> Перечисления.СтатусыДокументаЭДО.Выгружен И Объект.СтатусДокументаВЭДО <> Перечисления.СтатусыДокументаЭДО.Подписан тогда
		Если НЕ(Элементы.Найти("ПодобратьИПроверитьПродукциюГосИС0_") = Неопределено) Тогда
			ЭлементыГруппыГИСМ = Элементы.ПодобратьИПроверитьПродукциюГосИС0_.ПодчиненныеЭлементы;
			Для Каждого Элемент из ЭлементыГруппыГИСМ Цикл
				Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
				  Элемент.Доступность = Истина;
				КонецЕсли	
			КонецЦикла	
		КонецЕсли
	КонецЕсли;
	Если Не Элементы.Найти("СоответствиеТребованиямГИСМТГосИС") = Неопределено Тогда 
		Элементы.СоответствиеТребованиямГИСМТГосИС.Доступность = Истина
	КонецЕсли
КонецПроцедуры

&НаСервере
Функция ПроверитьРоль()
	Возврат РольДоступна("ОтметкаКассы");	
КонецФункции

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	УведомленияПодрядчику_ИнициализацияЗначений(); 
	//АвтоопределениеДистрибуция
	УстановитьВидимостьРеквизитовДоставкиДистрибуция();
	Если Объект.РаспределитьТранспортныеДистрибуция И НЕ Объект.РеализацияПоЗаказам Тогда
	   ТранспортныеИтог = АльтерраОбщегоНазначенияКлиент.ПолучитьТранспортныеИтог(Объект);
   КонецЕсли; 
   //
КонецПроцедуры 

&НаСервере
Процедура УстановитьУсловноеОформлениеПолей()
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента)	Тогда
		
		ИменаПолей = Новый Массив;
		ИменаПолей.Добавить("ТоварыВидЦены");
		ИменаПолей.Добавить("ТоварыПроцентРучнойСкидки");
		ИменаПолей.Добавить("ТоварыСуммаРучнойСкидки");
		ИменаПолей.Добавить("ТоварыСумма");
		ИменаПолей.Добавить("ТоварыСуммаНДС");
		
		Для каждого ИмяПоля Из ИменаПолей Цикл
			Элемент = УсловноеОформление.Элементы.Добавить();
			
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
			
			ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
			
			ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СуммаБонусныхБалловКСписаниюВВалюте");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			ОтборЭлемента.ПравоеЗначение = 0;
			
			ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СуммаНачисленныхБонусныхБалловВВалюте");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			ОтборЭлемента.ПравоеЗначение = 0;
			
			Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
			//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
			
		КонецЦикла;
		
		Элементы.ТоварыОткрытьПодбор.Доступность = Ложь;
		Элементы.ТоварыРассчитатьСкидкиНаценки.Доступность = Ложь;
		Элементы.ТоварыНазначитьАвтоматическиеСкидки.Доступность = Ложь;
		Элементы.ТоварыЗаполнитьЦеныПоСоглашению.Доступность = Ложь;
		Элементы.ТоварыЗаполнитьЦеныВыделенныхСтрокПоВидуЦен.Доступность = Ложь;
		Элементы.ТоварыНазначитьРучнуюСкидку.Доступность = Ложь;
		Элементы.ТоварыНазначитьРучнуюСкидкуВыделенныхСтрок.Доступность = Ложь;
		Элементы.ТоварыОтменитьРучныеСкидки.Доступность = Ложь;
		
	КонецЕсли;
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("ТоварыСуммаБонусныхБалловКСписанию");
	ИменаПолей.Добавить("ТоварыСуммаБонусныхБалловКСписаниюВВалюте");
	ИменаПолей.Добавить("ТоварыСуммаНачисленныхБонусныхБалловВВалюте");
	ИменаПолей.Добавить("ТоварыСуммаНачисленныхБалловЗаСтатус");
	ИменаПолей.Добавить("ТоварыСуммаНачисленныхБалловЗаКП");
	ИменаПолей.Добавить("ТоварыСуммаНачисленныхБалловПрочее");
	
	Для каждого ИмяПоля Из ИменаПолей Цикл
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		
		ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СуммаРучнойСкидки");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ОтборЭлемента.ПравоеЗначение = 0;
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВидЦены");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Справочники.ВидыЦен.ПустаяСсылка();
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиСкидку(имяскидки,ОбъектСкидок)
	Скидка=Справочники.СкидкиНаценки.НайтиПоНаименованию(ИмяСкидки);
	если ОбъектСкидок.СкидкиНаценки.Выгрузить().ВыгрузитьКолонку("СкидкаНаценка").Найти(Скидка)<>Неопределено тогда
		УправляемыеСкидки.Добавить(Скидка);
		результат=истина;
	иначе
		результат=ложь;	
	конецесли;
	Возврат результат;	
КонецФункции // НайтиСкидку()

&НаСервере
Процедура Док_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДопМодуль.ПроверитьВозможностьРучныхСкидкок(Отказ, Объект.Товары, Объект.Соглашение);
	
	Если ТекущийОбъект.Ссылка.СуммаДокумента <> ТекущийОбъект.СуммаДокумента Тогда
		Документы.ЗаданиеНаПеревозкуРейс.СнятьСогласование(ТекущийОбъект.Ссылка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка.Кассир) Тогда
		Если НовыйПорядокНачисленияБонусов И ЗначениеЗаполнено(ТекущийОбъект.ЗаказКлиента) Тогда
			ЗаполнитьБонусыПоЗаказу();
		Иначе
			БонусыАльтерраРезерв.НачислитьБонусныеБаллы(ТекущийОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийОбъект.ИспользуетсяДоговор И ЗначениеЗаполнено(ТекущийОбъект.Договор) Тогда
		ПорядокРасчетовДоговор = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ПорядокРасчетов");
		Если ТекущийОбъект.ПорядокРасчетов <> ПорядокРасчетовДоговор Тогда
			ТекущийОбъект.ПорядокРасчетов = ПорядокРасчетовДоговор;  
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)  
	
	ЗаполнитьКолонкуОбособленно();
	ДопМодуль.СохранитьПроцентРучнойСкидки(Объект.Товары); 
	
	Если Объект.Проведен И Не ЗначениеЗаполнено(Объект.Кассир) Тогда
		ПереактивироватьСсылкуНаОплату();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		СуммаБонусныхБаллов = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаБонусныхБаллов);
	КонецЕсли;
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаРаспределения" Тогда
		ОбработкаРаспределенияТранспортных(ВыбранноеЗначение.АдресТоваровВХранилище);
		//-		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	//ПоказатьИнформациюПоБонусам();
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыПередУдалением(Элемент, Отказ)
	// Альтерра Устинов В.А. Зеленение 18.03.2013 13:45:30
	если ЗначениеЗаполнено(Объект.Кассир) тогда
		Предупреждение("Товар оплачен. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;	
	если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные <> неопределено Тогда                            
		УдаляемаяНоменклатура = ТекущиеДанные.номенклатура; 
		Если ЭтоУслугаРезки(УдаляемаяНоменклатура) ТОгда 
			Объект.Нарезка.Очистить();
		КонецЕсли;
	КонецЕсли;
	//-
КонецПроцедуры  

&НаСервере
Функция ЭтоУслугаРезки(номенклатура) 
	Если номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
		И Найти(Номенклатура.Наименование, "резк") > 0 Тогда 
		Возврат Истина; 
	Иначе
		Возврат Ложь; 
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Док_ОбработкаОповещенияПеред(ИмяСобытия, Параметр, Источник)
	// Альтерра Беспалов
	Если ЗначениеЗаполнено(Объект.Кассир) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			// Альтерра Беспалов РС, 29.01.2015
			СтруктураДанных= МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			Штрихкод= СокрЛП(СтруктураДанных.Штрихкод);
			Если СтрДлина(Штрихкод) > 13 Тогда 
				Если РСОбщийМодульВызовСервера.ПоискШтрихкодаСекцииСервер(Объект.Ссылка, Штрихкод) Тогда
					ПодключитьОбработчикОжидания("ОтметкаКассыСканирование", 0.1, Истина);
				КонецЕсли;
			Иначе
				// Беспалов  Обробатываем считанные штрихкоды
				//1. - начинается на 8888 - ставим менеджера
				//2. - начинается 21,22,23,24,25 - ставим карту лояльности
				//3. остальное подбор номенклатуры
				Если Источник = "ПодключаемоеОборудование" И ИмяСобытия = "ScanData" Тогда
					
					Если Лев(Штрихкод, 4) = "8888" Тогда//1. Менеджер
						МенеджерСсылка = РСС_УправлениеОчередьюИСборкойЗаказов.ПоискПользователяПоШтрихкоду(Штрихкод);
						Если МенеджерСсылка <> Неопределено И МенеджерСсылка <> Объект.Менеджер Тогда
							Объект.Менеджер = МенеджерСсылка;	
							Модифицированность = Истина;
						КонецЕсли
					ИначеЕсли Лев(Штрихкод, 4) = "5555" Тогда//2. Выбор принтера
						ИмяПринтера= АльтерраОбщегоНазначения.ПолучитьИмяПринтера(Штрихкод);
						Если ЗначениеЗаполнено(ИмяПринтера) Тогда
							АльтерраОбщегоНазначенияКлиент.НапечататьПакетНаПринтер(Объект, ЭтаФорма, ИмяПринтера);
						КонецЕсли;
					ИначеЕсли АльтерраОбщегоНазначенияКлиент.ЭтоШтрихкодКартыЛояльности(Штрихкод) Тогда //3. Карта лояльности
						КартыЛояльности = КартыЛояльностиВызовСервера.НайтиКартыЛояльностиПоШтрихкоду(Штрихкод);
						Если КартыЛояльности.ЗарегистрированныеКартыЛояльности.Количество() > 0 Тогда 
							КартаЛояльности= КартыЛояльности.ЗарегистрированныеКартыЛояльности[0];
							Если КартаЛояльности.Статус = АльтерраОбщегоНазначения.ПолучитьСтатусКартыЛояльностиДействует() Тогда
								Объект.КартаЛояльности= КартаЛояльности.Ссылка;
								Док_КартаЛояльностиПриИзмененииНаКлиенте(Неопределено);
								//158234 запись в чек способ ввода клиента
							    СпособВводаКлиента = ПредопределенноеЗначение("Перечисление.СпособВводаКлиента.КартаЛояльности");
							    Объект.СпособВводаКлиента = СпособВводаКлиента;    
							    //158234
							Иначе
								ТекстСообщения = НСтр("ru = 'Карта со штрихкодом %1 аннулирована. Зарегистрируйте карту с помощью помощника регистрации карт лояльности'");
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Штрихкод), , "Объект.КартаЛояльности");
							КонецЕсли
						Иначе 
							ТекстСообщения = НСтр("ru = 'Карта со штрихкодом %1 не зарегистрирована. Карты регистрируются только с помощью помощника регистрации карт лояльности'");
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Штрихкод), , "Объект.КартаЛояльности");
						КонецЕсли;
					ИначеЕсли СтрДлина(Штрихкод) <= 30 Тогда //4. Номенклатура
						ОбработатьШтрихкоды(СтруктураДанных);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//-
	КонецЕсли;
	//-
	
	Если ИмяСобытия = "СчитанаКартаЛояльности"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		//158234 запись в чек способ ввода клиента
        СпособВводаКлиента = ПредопределенноеЗначение("Перечисление.СпособВводаКлиента.КартаЛояльности");
        Объект.СпособВводаКлиента = СпособВводаКлиента;
        //158234
		Объект.КартаЛояльности= Параметр.КартаЛояльности;
		Док_КартаЛояльностиПриИзмененииНаКлиенте(Неопределено);
		ИмяСобытия= "прервать";
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "СчитанПартнер"	И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		//158234 запись в чек способ ввода клиента
        СпособВводаКлиента = ПредопределенноеЗначение("Перечисление.СпособВводаКлиента.НомерТелефона");
        Объект.СпособВводаКлиента = СпособВводаКлиента;
        //158234
		Объект.Партнер= Параметр.Партнер;
		Док_ПартнерПриИзменении(Неопределено);				
		
		////ПартнерПриИзменении(Неопределено);
		//Объект.КартаЛояльности= АльтерраОбщегоНазначения.ПолучитьКартуЛояльности(Объект.Партнер);
		//Объект.Соглашение= АльтерраОбщегоНазначения.ПолучитьСоглашениеПоУмолчанию(Объект.Партнер, Объект.Подразделение, Объект.КартаЛояльности);
		
		//СоглашениеПриИзменении(Неопределено);
		ИмяСобытия= "прервать";
		Возврат;
	КонецЕсли;
	
//	//Исправление оповещения для автоматического отображения долга клиента
//	Если (ИмяСобытия = "ЗачтенаОплата" И Параметр = Объект.Ссылка)
//		Или ПродажиКлиент.ИзменилисьДокументыОплатыКлиентам(ИмяСобытия) Тогда
//		Если (НЕ Объект.РеализацияПоЗаказам И Объект.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным"))
//			ИЛИ Объект.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным") Тогда
//			Прочитать();
//		КонецЕсли;
//		ИмяСобытия= "прервать";
//		Возврат;
//	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
	ПоказатьИнформациюПоБонусам();
	
	//Инструкции
	мФайлов= АльтерраОбщегоНазначения.ПолучитьВыборкуФайловИзТовара(Объект.Ссылка);
	Если мФайлов.Количество() > 0 Тогда
		Оповещение= Новый ОписаниеОповещения("НапечататьФайлыЗавершение", ЭтотОбъект, мФайлов);
		ПоказатьВопрос(Оповещение, "По преобретаемому товару есть инструкции."+Символы.ПС+"Напечатать инструкции?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да, "Печать инструкций");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НапечататьФайлыЗавершение(Результат, мФайлов) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		РаботаСФайламиКлиент.НапечататьФайлы(мФайлов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ДоговорПриИзмененииПосле(Элемент) 
	
	ЗаполнитьПорядокРасчетовПоДоговору();
	Элементы.ТекстДокументыНаОснованииПодвалРасш.Доступность = Объект.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов");	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);  
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СуммаБонусныхБаллов = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
	ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаБонусныхБаллов); 
		Если ПолучитьМенеджераДоИзменения(Объект.Ссылка) <> Объект.Менеджер Тогда 
			Объект.ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Объект.Менеджер); 
			Объект.ОтделМенеджера = ПолучитьОтделМенеджера(Объект.Менеджер);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМенеджераДоИзменения(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Менеджер КАК Менеджер
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Менеджер;
КонецФункции

&НаКлиенте
Процедура Док_КонтрагентПриИзмененииПосле(Элемент)
	
	ОчиститьСообщения();
	Док_КонтрагентПриИзмененииПослеНаСервере(); 
	
КонецПроцедуры 

&НаСервере
Процедура Док_КонтрагентПриИзмененииПослеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент.Партнер)Тогда
		Объект.Партнер = Объект.Контрагент.Партнер;
	КонецЕсли;  
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СуммаБонусныхБаллов = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
		ОповещениеОбОчисткеБонусов(СуммаБонусныхБаллов);
	КонецЕсли;
	
	ЛистыСогласованияСервер.ЕстьНеисполненныеЛистыСогласования(Объект.Контрагент);
	
	ЗаполнитьПорядокРасчетовПоДоговору();  
	
	ПроверитьЭДО();
КонецПроцедуры

Процедура ПроверитьЭДО()
	если ДопМодуль.КонтрагентРаботаетВЭдо(Объект.Контрагент) тогда
		Элементы.КонтрагентРаботаетВЭДО.Видимость=истина;
		если Объект.СтатусДокументаВЭДО=Перечисления.СтатусыДокументаЭДО.НеВыгружен тогда
			Объект.СтатусДокументаВЭДО=Перечисления.СтатусыДокументаЭДО.ГотовКОтправке;
		конецесли;	 
	иначе
		если Объект.СтатусДокументаВЭДО=Перечисления.СтатусыДокументаЭДО.ГотовКОтправке тогда
			Объект.СтатусДокументаВЭДО=Перечисления.СтатусыДокументаЭДО.НеВыгружен;
		конецесли;	 
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ОрганизацияПриИзмененииПосле(Элемент) 
	
	ЗаполнитьПорядокРасчетовПоДоговору();   
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ПолучитьМенеджераДоИзменения(Объект.Ссылка) <> Объект.Менеджер Тогда 
			Объект.ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Объект.Менеджер); 
			Объект.ОтделМенеджера = ПолучитьОтделМенеджера(Объект.Менеджер);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьПорядокРасчетовПоДоговору()
	
	Если Объект.ИспользуетсяДоговор И ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.ПорядокРасчетов = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ПорядокРасчетов");
	КонецЕсли; 
	
КонецПроцедуры

&После("УстановитьДоступностьЭлементовПоСтатусуСервер")
Процедура Док_УстановитьДоступностьЭлементовПоСтатусуСервер()
	ДоступностьЦены=истина;
	если  рольДоступна("ЗапретИзменениеВидаЦеныВДокументе") тогда
		если не Объект.Склад.ЭтоГруппа	тогда
			ДоступностьЦены=не Объект.Склад.неРазрешеноРедактированиеЦены;
		конецесли;
	конецесли;	
	Элементы.ТоварыВидЦены.Доступность = ДоступностьЦены ;
	Элементы.ТоварыЗаполнитьЦеныВыделенныхСтрокПоВидуЦен.Доступность = ДоступностьЦены ;
	Элементы.ТоварыПодобратьТоварыПоЗаказамОрдерам.Доступность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Док__НаценкаКартаПриИзмененииПосле(Элемент)
		СуммаБонусныхБаллов = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();
	ОчиститьСообщения();
	ОповещениеОбОчисткеБонусов(СуммаБонусныхБаллов);
	ДобавитьУправляемуюСкидкуНаСервере(_НаценкаКарта,"Наценка на оплату картой");
КонецПроцедуры

&НаСервере
&Вместо("СкладПриИзмененииСервер")
Процедура Док_СкладПриИзмененииСервер(ОчищатьСтроки, ОтвязатьВсеСтрокиОтЗаказа)
	ОчищатьСтроки= Ложь;
	ОтвязатьВсеСтрокиОтЗаказа= Ложь;
	Если Объект.РеализацияПоЗаказам Тогда
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		Если НЕ БонусыАльтерраРезерв.ПроверитьЗапретБонусов(Объект) Тогда
			ОчиститьБонусыСервер();
			ПерераспределитьБонусы(СуммаОплатыБонусами);
		Иначе
			Для каждого Строка Из Объект.Товары Цикл
				ОбновитьДанныеПоСтроке(Строка.КодСтроки-1);
			КонецЦикла;
			ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
		КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	КонецЕсли;
	ПродолжитьВызов(ОчищатьСтроки, ОтвязатьВсеСтрокиОтЗаказа);
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыВидЦеныОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ПроверкиАльтерраСервер.ЕстьЗапретВыбораВидаЦены(ВыбранноеЗначение) Тогда  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вам запрещено выбирать данный вид цены");
		СтандартнаяОбработка = Ложь;
	КонеЦесли; 
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыПередНачаломИзменения(Элемент, Отказ)
	// Альтерра Устинов В.А. Зеленение 12.11.2013 11:08:04
	если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Редактирование запрещено!!!");
		Отказ=Истина;
	конецесли;	
	//-
КонецПроцедуры

&НаСервере
Процедура Док_МенеджерПриИзмененииПослеНаСервере()
	Объект.ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Объект.Менеджер); 
	Объект.ОтделМенеджера = ПолучитьОтделМенеджера(Объект.Менеджер);
КонецПроцедуры

&НаКлиенте
Процедура Док_МенеджерПриИзмененииПосле(Элемент)
	Док_МенеджерПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделМенеджера(Менеджер) 

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение.Наименование КАК Отдел
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО (ДополнительныеСведения.Объект = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ДополнительныеСведения.Свойство.Наименование = ""Отделы (Пользователи)""";
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Отдел;
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подразделение;
КонецФункции

#КонецОбласти

#Область Команды
&НаКлиенте
Процедура Док_ЗаполнитьШапкуПоЗаказу(Команда)
	Док_ЗаполнитьШапкуПоЗаказуНаСервере();
	Объект.Грузоотправитель= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "Грузоотправитель");
	
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным");
	Иначе
		Объект.ПорядокРасчетов = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ПорядокРасчетов");
	КонецЕсли;
	ПорядокРасчетов = Объект.ПорядокРасчетов;
	СоглашениеПриИзмененииСервер();
	если Объект.РеализацияПоЗаказам и ЗначениеЗаполнено(Объект.ЗаказКлиента) тогда
		ОбъектСкидок = Объект.ЗаказКлиента;
	иначе
		ОбъектСкидок = Объект;
	конецесли;	
	РассчитатьСкидкиНаценкиКлиент();	
	Элементы.ТекстДокументыНаОснованииПодвалРасш.Доступность = Объект.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов");
	
	ОчиститьБонусыСервер(); 
	
КонецПроцедуры
&НаСервере
Процедура Док_ЗаполнитьШапкуПоЗаказуНаСервере()
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		
		Отказ= Ложь;
		Если АльтерраОбщегоНазначения.ЕстьЗеленение(Объект) > 0 Тогда
			Сообщить("В документе есть зелененные строки!");
			Отказ= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Кассир) Тогда
			Сообщить("В документе стоит отметка кассы!");
			Отказ= Истина;
		КонецЕсли;
		
		Если Не Отказ Тогда
			//ЗаполнитьЗначенияСвойств(Объект,Объект.ЗаказКлиента);
			Объект.Партнер= Объект.ЗаказКлиента.Партнер;
			Объект.Контрагент=  Объект.ЗаказКлиента.Контрагент;
			Объект.Соглашение=  Объект.ЗаказКлиента.Соглашение;
			Объект.Договор=  Объект.ЗаказКлиента.Договор;
			Объект.Склад=  Объект.ЗаказКлиента.Склад;
			Объект.Подразделение= Объект.ЗаказКлиента.Подразделение;
			//Светлакова
			Если Объект.Организация <> Объект.ЗаказКлиента.Организация Тогда
				Объект.Организация =  Объект.ЗаказКлиента.Организация;	
				ОрганизацияПриИзмененииСервер();
			КонецЕсли; 
			Объект.ИспользуетсяДоговор=  Объект.ЗаказКлиента.ИспользуетсяДоговор;
			//Харина
			_ТоварПодЗаказ = Объект.ЗаказКлиента.ТоварПодЗаказ;
			
			Для Каждого стрТовар Из Объект.Товары Цикл
				стрТовар.Склад=  Объект.Склад;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док__ПровестиНапечататьЗакрыть(Команда)

	ПараметрыЗаписи= Новый Структура("РежимЗаписи ", РежимЗаписиДокумента.Проведение);
	Записать(ПараметрыЗаписи);

	Если ПроверкаНаличияЗаявкиНаСоответствующийДокументПродажи(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	АльтерраОбщегоНазначенияКлиент.НапечататьПакетНаПринтер(Объект, ЭтаФорма);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПроверкаНаличияЗаявкиНаСоответствующийДокументПродажи(Ссылка)
	Возврат Документы.ЗаявкаВЕГАИСЛес.ПроверкаНаличияЗаявкиНаСоответствующийДокументПродажи(Ссылка);
КонецФункции

&НаКлиенте
Процедура Док__ДобавитьУслугуБезНДС(Команда)
	ОчиститьРаспределение();
	ДобавитьУслугуБезНДСНаСервере();
	
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	//СформироватьНадписьВалюты(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ДобавитьУслугуБезНДСНаСервере()
	АльтерраОбщегоНазначения.ДобавитьУслугуБезНДСНаСервере(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПромокод(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПроверкиПромокода",Новый Структура("Партнер,Подразделение",Объект.Партнер,Объект.Подразделение),ЭтаФорма,,,,Новый ОписаниеОповещения("ОповещениеОЗакрытииФормыВводаПромокода",ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗакрытииФормыВводаПромокода(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект,Результат);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВводНаОсновании
&НаСервере
Процедура СоздатьНовыйДокумент(ИмяДокумента, НовыйОбъект)
	Документы[ИмяДокумента].ЗаполнитьДанныеПоОснованию(Объект.Ссылка, НовыйОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииЗаявкаВЕГАИСЛес(Команда)
	ИмяДокумента= "ЗаявкаВЕГАИСЛес";
	ФормаДок = ПолучитьФорму("Документ."+ИмяДокумента+".ФормаОбъекта");
	//ФормаДок = ПолучитьФорму("Документ.ЛистСогласования.ФормаОбъекта");
	
	//Далее мы получаем объект только, что созданной формы и помещаем её в переменную
	//В объекте содержатся все реквизиты (элементы) формы
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Реализация товаров и услуг");
		
		ПоказатьПредупреждение(,ТекстВопроса);
		возврат;	
	КонецЕсли;
	
	//Мы помещаем объект формы в переменную,
	//так как должны передать её в процедуру на сервере,
	//где нельзя изменять объект формы, зато можно править переменную содержащую его
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	
	//После выполнения процедуры на сервере мы получаем изменную переменную ДанныеФормы,
	//которую необходимо передать в уже созданную нами форму
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	
	//Открываем результат выполнения обработки
	ФормаДок.Открыть();	
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииПропуск(Команда)
	
	ИмяДокумента = "Пропуск";
	ФормаДок = ПолучитьФорму("Документ." +  ИмяДокумента + ".ФормаОбъекта");
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Реализация товаров и услуг");
		
		ПоказатьПредупреждение( , ТекстВопроса);
		Возврат;	
	КонецЕсли;
	
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	ФормаДок.Открыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииПриходныйКассовыйОрдерПосле(Команда) 
	
	ДокОснование = Новый Структура;
	
	ДокОснование.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", ДокОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииОперацияПоПлатежнойКартеПосле(Команда)
	
	ДокОснование = Новый Структура;
	
	ДокОснование.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ОперацияПоПлатежнойКарте.ФормаОбъекта", ДокОснование);
	
КонецПроцедуры  

#КонецОбласти

#Область Бонусы

#Область БонусыСобытияФормы

&НаСервере
Процедура ПересчитатьСуммыСУчетомБонусов()
	Если НЕ ЗначениеЗаполнено(Объект.Кассир) Тогда
		Для каждого СтрРеализации Из Объект.Товары Цикл
			БонусыАльтерраРезерв.ПересчитатьСуммыСУчетомБонусов(Объект, стрРеализации);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ПересчитатьСуммыСУчетомБонусов()

&НаКлиенте
Процедура Док_ПартнерПриИзменении(Элемент)
	
	//ПартнерПриИзменении(Неопределено);
	Объект.КартаЛояльности = АльтерраОбщегоНазначения.ПолучитьКартуЛояльности(Объект.Партнер);
	Объект.Контрагент = АльтерраОбщегоНазначения.ПолучитьЕдинственногоКонтрагента(Объект.Партнер);
	Объект.Соглашение = АльтерраОбщегоНазначения.ПолучитьСоглашениеПоУмолчанию(Объект.Партнер, Объект.Подразделение, Объект.КартаЛояльности, Объект.Дата);
	ПроверитьЭДО();	
	СоглашениеПриИзменении(Неопределено);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
		ПересчитатьСуммыСУчетомБонусов();
		ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	КонецЕсли;
	
	ОчиститьСообщения();
	АльтерраОбщегоНазначения.ПолучитьДополнительнуюИнформациюПоПартнеру(Объект.Партнер);// Вывод сообщением дополнительной информации по клиенту
	
	ПоказатьИнформациюПоБонусам();
	//Задача № 69132 Черный список
	УстановитьВидимостьЗапретаОтгрузкиПартнеру();
	Отказ = Ложь;
	АльтерраОбщегоНазначения.ЕстьПартнерСТакимТелефоном(Объект.Партнер, Отказ);
	Если Отказ Тогда
		Сообщить("Заполните у партнера его действительный номер телефона, иначе на кассе ЧЕК не пробъется!!!");
	КонецЕсли;  

	Если АльтерраОбщегоназначения.ЭтоБригадир(Объект.Партнер) Тогда
		Элементы.БонусныеБаллыСуммаБонусныхБалловЗаКП.Заголовок = "Доп. баллы";
		Элементы.ТоварыСуммаНачисленныхБалловЗаКП.Заголовок = "Доп. баллы";
	КонецЕсли;
	Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
		Объект.АдресДоставки = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ПолучитьМенеджераДоИзменения(Объект.Ссылка) <> Объект.Менеджер Тогда 
			Объект.ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Объект.Менеджер); 
			Объект.ОтделМенеджера = ПолучитьОтделМенеджера(Объект.Менеджер);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура Док_СоглашениеПриИзменении(Элемент)
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	ПересчитатьСуммыСУчетомБонусов();
	ПоказатьИнформациюПоБонусам(); 
	ОчиститьСообщения();
	ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами); 
	//АвтоопределениеДистрибуция
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		РаспределитьТранспортныеДистрибуция();
	КонецЕсли; 
	//

КонецПроцедуры 

&НаСервере
&После("СоглашениеПриИзмененииСервер")
Процедура Док_СоглашениеПриИзмененииСервер()
	
	ЗаполнитьПорядокРасчетовПоДоговору();   
	
	// Проверка на изменение цены товара по установке цен (заказ до изменения цены, реализация после)
	ПроверитьСоответствиеЦенСЗаказом();
	
КонецПроцедуры  

&НаКлиенте
Процедура Док_СоглашениеПриИзмененииПосле(Элемент)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ПолучитьМенеджераДоИзменения(Объект.Ссылка) <> Объект.Менеджер Тогда 
			Объект.ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Объект.Менеджер); 
			Объект.ОтделМенеджера = ПолучитьОтделМенеджера(Объект.Менеджер);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоответствиеЦенСЗаказом()
	
	Если Не ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	Для Каждого Стр Из Объект.Товары Цикл
		МассивСтрок.Добавить(Стр.КодСтроки);
	КонецЦикла;      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидЦены,
	|	Цена,
	|	КодСтроки,
	|	Номенклатура,
	|	Характеристика
	|ИЗ
	|	Документ.ЗаказКлиента.Товары 
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И КодСтроки В(&МассивСтрок)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("МассивСтрок", МассивСтрок);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ИзменениеЦены = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Отбор = ?(НовыйПорядокНачисленияБонусов,	Новый Структура("КодСтроки", Выборка.КодСтроки),
		Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Характеристика));
		
		стрРеализации = Объект.Товары.НайтиСтроки(Отбор)[0];
		
		Если Выборка.ВидЦены <> стрРеализации.ВидЦены Или Выборка.Цена <> стрРеализации.Цена Тогда
			стрРеализации.ВидЦены = Выборка.ВидЦены;
			стрРеализации.Цена = Выборка.Цена;
			БонусыАльтерраРезерв.ПересчитатьСуммыСУчетомБонусов(Объект, стрРеализации);
			ИзменениеЦены = Истина;
		КонецЕсли;         
	КонецЦикла;                    
	
	Если ИзменениеЦены Тогда	
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_КартаЛояльностиПриИзмененииНаКлиенте(Элемент)
	ОчиститьСообщения();
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	Док_КартаЛояльностиПриИзмененииНаСервере()
КонецПроцедуры
&НаСервере
Процедура Док_КартаЛояльностиПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда
		Объект.Партнер = Объект.КартаЛояльности.Партнер;
		Объект.Контрагент = Объект.КартаЛояльности.Контрагент;
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Объект.Контрагент = АльтерраОбщегоНазначения.ПолучитьЕдинственногоКонтрагента(Объект.Партнер);
		КонецЕсли;
		
		Объект.Соглашение = АльтерраОбщегоНазначения.ПолучитьСоглашениеПоУмолчанию(Объект.Партнер, Объект.Подразделение, Объект.КартаЛояльности, Объект.Дата);
		
		СоглашениеПриИзмененииСервер();
	КонецЕсли;
	
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	АльтерраОбщегоНазначения.ПолучитьДополнительнуюИнформациюПоПартнеру(Объект.Партнер);// Вывод сообщением дополнительной информации по клиенту
	ПоказатьИнформациюПоБонусам();
	//Задача № 69132 Черный список
	УстановитьВидимостьЗапретаОтгрузкиПартнеру();
КонецПроцедуры

&НаКлиенте
Процедура Док_НалогообложениеНДСПриИзменении(Элемент)
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
КонецПроцедуры

&НаКлиенте
Процедура Док_ЦенаВключаетНДСПриИзменении(Элемент)
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаПриИзменении(Элемент)
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	Если Объект.БонусныеБаллы.Количество() > 0 Тогда
		ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Док_СкладПриИзменении(Элемент)
	
	//АвтоопределениеДистрибуция
	ОчиститьРеквизитыДоставкиДистрибуция();
	УстановитьВидимостьРеквизитовДоставкиДистрибуция(); 
    //
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	
	Объект.Грузоотправитель= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "Грузоотправитель");
	УстановитьДоступностьЭлементовПоСтатусуСервер();	
	Объект.Подразделение= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "Подразделение");
	УведомленияПодрядчику_ИнициализацияЗначений();  
	если ДопМодуль.НовоеЦенообразование() тогда 
		СоглашениеПриИзмененииСервер();            
	конецесли;
	ОбновитьПараметрыВыбораЦен();
	
	Если НЕ ПроверитьЗапретБонусов() Тогда
		ОчиститьБонусыСервер();
		ПерераспределитьБонусы(СуммаОплатыБонусами);
	Иначе
		Для каждого Строка Из Объект.Товары Цикл
			ОбновитьДанныеПоСтроке(Строка.НомерСтроки-1);
		КонецЦикла;
		ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ПроверитьЗапретБонусов()

	Возврат БонусыАльтерраРезерв.ПроверитьЗапретБонусов(Объект);

КонецФункции

&НаКлиенте
Процедура Док_СчитатьКартуЛояльности(Команда)
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	ОчиститьСообщения();
	ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
КонецПроцедуры

#КонецОбласти     

&НаСервере
Процедура ОтменитьСкидки()
	СкидкиНаценкиЗаполнениеСервер.ОтменитьСкидки(Объект, "Товары", Истина, Истина);
КонецПроцедуры

&НаСервере      
&ИзменениеИКонтроль("РассчитатьПоРеализацииТоваровУслугПоЗаказу")
Процедура Док_РассчитатьПоРеализацииТоваровУслугПоЗаказу(Знач ЗаполнитьРеализациюПоЗаказу = Истина)
	
	ПараметрыРасчета = СкидкиНаценкиЗаполнениеСервер.НовыйПараметрыРассчитать();
	ПараметрыРасчета.ЗаполнитьРеализациюПоЗаказу = ЗаполнитьРеализациюПоЗаказу;
	#Вставка 
	ОтменитьСкидки();
	#КонецВставки
	СкидкиНаценкиЗаполнениеСервер.Рассчитать(Объект, ПараметрыРасчета);
	ЗаполнитьДанныеДляРасчетаОплатыБонуснымиБаллами();
	
КонецПроцедуры

#Область БонусыСобытияТовары

&НаСервере
&Вместо("УстановитьВидимостьЭлементовБонуснойПрограммыЛояльности")
Процедура Док_УстановитьВидимостьЭлементовБонуснойПрограммыЛояльности()
	// не скрываем
	//ПродолжитьВызов();
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыПриИзменении(Элемент)
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	Если Не НовыйПорядокНачисленияБонусов Тогда
		ОчиститьБонусыСервер();
		ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	КонецЕсли;
	ПоказатьИнформациюПоБонусам(); 
	
	//АвтоопределениеДистрибуция	
	Если Объект.РеализацияПоЗаказам И Объект.РаспределитьТранспортныеДистрибуция Тогда   
      КонтрольУслугиДоставкиПриНеполнойОтгрузке();
	КонецЕсли;
	// 
	
КонецПроцедуры  


&После("ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок")
Процедура Док_ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект, СтруктураЗаполненияБонусныхБаллов = Неопределено)
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗаполнитьЦеныПоСоглашению(Команда)
	Строка = Элементы.Товары.ТекущаяСтрока;
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		ОбновитьДанныеПоСтрокеИзЗаказа();
	Иначе
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
		ПерераспределитьБонусы(СуммаОплатыБонусами);
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
		Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
			ОповеститьОСниженииБонусов();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПоискПоШтрихкоду(Команда)
	//ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	//ПоказатьИнформациюПоБонусам();
КонецПроцедуры

&НаКлиенте
Процедура Док_РазбитьСтроку(Команда)
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыПередНачаломДобавленияПеред(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыВыборПеред(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
	
	// 
	
КонецПроцедуры   

&НаКлиенте
Процедура Док_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	Если Копирование Или НоваяСтрока Тогда      
		ОчиститьРаспределение();
		ДобавляемаяСтрока = Элемент.ТекущиеДанные;   
		ДобавляемаяСтрока.ПроцентРучнойСкидки = 0;
		ДобавляемаяСтрока.ПроцентРучнойСкидки_СтароеЗначение = 0;
		ДобавляемаяСтрока.Номенклатура_СтароеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры  

&НаСервере
&ИзменениеИКонтроль("ПолучитьСтрокиИзБуфераОбмена")
Процедура Док_ПолучитьСтрокиИзБуфераОбмена()
	
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
		ПараметрыОтбора = Новый Соответствие;
		ПараметрыОтбора.Вставить("Номенклатура.ТипНоменклатуры", НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре());
	Иначе
		ПараметрыОтбора = Неопределено;
	КонецЕсли;
	
	Колонки = "Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,ВидЦены,Цена,
		|ПроцентРучнойСкидки,СуммаРучнойСкидки,Склад,Подразделение,НоменклатураНабора,ХарактеристикаНабора";

	ТаблицаТоваров = РаботаСТабличнымиЧастями.СтрокиИзБуфераОбмена(ПараметрыОтбора, Колонки);

	Если Не ЗначениеЗаполнено(ТаблицаТоваров) Тогда
		Возврат;
	КонецЕсли;

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
		
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект));
		
	СтруктураДействий.Вставить("ЗаполнитьКодТНВЭД", Объект.НалогообложениеНДС);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Ложь));
		
	НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтотОбъект, СтруктураДействий);
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект);
	Если ТаблицаТоваров.Колонки.Найти("СуммаРучнойСкидки") <> Неопределено Тогда
		СтруктураДействий.ПересчитатьСуммуСУчетомРучнойСкидки.Вставить("ПересчитыватьСуммуРучнойСкидки", Ложь);
	КонецЕсли;
	ПакетнаяОбработкаТабличнойЧастиКлиентСерверЛокализация.ДополнитьСтруктуруДействийПриИзмененииЭлемента(
		ЭтотОбъект, "Номенклатура", СтруктураДействий);
	
	ПараметрыПроверкиВидаЦены = Новый Структура("ЦенаВключаетНДС, ИспользоватьПриПродаже, Статус",
		Объект.ЦенаВключаетНДС, Истина, Перечисления.СтатусыДействияВидовЦен.Действует);
	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьВидЦены",
		Новый Структура("ВидЦены, ПараметрыОтбора", "ВидЦены", ПараметрыПроверкиВидаЦены));
		
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
		
	ОбрабатываемыеСтроки = Новый Массив;
		
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл

		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара);
		Если НЕ ИспользоватьРучныеСкидкиВПродажах Тогда
			ТекущаяСтрока.ПроцентРучнойСкидки = 0;
			ТекущаяСтрока.СуммаРучнойСкидки = 0;
		КонецЕсли;
		#Вставка
			ТекущаяСтрока.ПроцентРучнойСкидки = 0;
			ТекущаяСтрока.ПроцентРучнойСкидки_СтароеЗначение = 0;
			ТекущаяСтрока.Номенклатура_СтароеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		#КонецВставки
		ОбновитьОтклоненияОтЗаказаВСтроке(ТекущаяСтрока, Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару);
		ОбрабатываемыеСтроки.Добавить(ТекущаяСтрока);
			
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Товары);
	
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ПриИзмененииСкладаВТабличнойЧастиСервер();
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыПослеУдаленияПосле(Элемент) 
	ОчиститьРаспределение();
	//АвтоопределениеДистрибуция
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		РаспределитьТранспортныеДистрибуция(); 
	КонецЕсли; 
	//
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	ОчиститьРаспределение();
	//АвтоопределениеДистрибуция
	РаспределитьТранспортныеДистрибуцияПриИзмененииСтроки();
	//
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗагрузитьИзВнешнегоФайлаПосле(Команда)
	ОчиститьРаспределение();
	//АвтоопределениеДистрибуция
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		РаспределитьТранспортныеДистрибуция(); 
	КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРаспределение()
	
	//АвтоопределениеДистрибуция
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		Возврат;
	КонецЕсли;
	//
	
	КоллекцияТовары = Объект.Товары;
	КоллекцияВидыЗапасов = Объект.ВидыЗапасов;
	
	ПроверкаИтоговПоСтрокам = 
	КоллекцияТовары.Итог("СуммаСНДСРТ") + 
	КоллекцияТовары.Итог("СуммаНДСРТ") + 
	КоллекцияТовары.Итог("СуммаРТ") + 
	КоллекцияТовары.Итог("Распределять") + 
	КоллекцияВидыЗапасов.Итог("СуммаСНДСРТ") + 
	КоллекцияВидыЗапасов.Итог("СуммаНДСРТ");
	
	Если ПроверкаИтоговПоСтрокам = 0 И Не Объект.РаспределитьТранспортные И Не Элементы.ТоварыРаспределять.Видимость Тогда  
		Возврат;
	КонецЕсли;
	
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();
	ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	
	Для Каждого Элемент Из КоллекцияТовары Цикл
		Элемент.СуммаСНДСРТ=0;
		Элемент.СуммаНДСРТ=0;
		Элемент.СуммаРТ=0;
		Элемент.Распределять=0;
	КонецЦикла;
	
	Для каждого Элемент из КоллекцияВидыЗапасов цикл
		Элемент.СуммаСНДСРТ=0;
		Элемент.СуммаНДСРТ=0;
	конеццикла;
	
	Объект.РаспределитьТранспортные=ложь;
	Элементы.ТоварыРаспределять.Видимость = Ложь;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыСуммаПриИзмененииПосле(Элемент)
	Если НЕ Объект.РеализацияПоЗаказам Тогда
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
			
		Если НовыйПорядокНачисленияБонусов Тогда	
			ПерераспределитьБонусы(СуммаОплатыБонусами);
			Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
				ОповеститьОСниженииБонусов();
			КонецЕсли;
		Иначе
			ОчиститьСообщения();
			ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
		КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоСтрокеИзЗаказа()
	МассивСтрок = Новый Массив;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	МассивСтрок.Добавить(ТекущиеДанные.КодСтроки);
	ПересчитатьБонусыВСтрокеНаСервере(МассивСтрок);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоСтроке(ТекущаяСтрока)
	
	Строка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если БонусыАльтерраРезерв.ПроверитьЗапретБонусов(Объект) Тогда
		Строка.СуммаБонусныхБалловКСписанию = 0;
		Строка.СуммаБонусныхБалловКСписаниюВВалюте = 0;
	КонецЕсли;
	
	Строка.СуммаНачисленныхБалловЗаКП = 0;
	Строка.СуммаНачисленныхБалловПрочее = 0;
	Строка.СуммаНачисленныхБалловЗаСтатус = 0;
	Строка.СуммаНачисленныхБонусныхБалловВВалюте = 0;
	
	БонусыАльтерраРезерв.ПересчитатьСуммыСУчетомБонусов(Объект, Строка);
	
	
КонецПроцедуры

&НаСервере
&Перед("НазначитьРучнуюСкидкуНаСервере")
Процедура Док_НазначитьРучнуюСкидкуНаСервере(СуммаСкидкиНаценки, Знач ВыделенныеСтроки, АдресВоВременномХранилище)
	Если НЕ Объект.РеализацияПоЗаказам Тогда
		Если НовыйПорядокНачисленияБонусов Тогда
			ЭтаФорма.Прочитать();
			Если ВыделенныеСтроки <> Неопределено Тогда
				Для Индекс = 1 - ВыделенныеСтроки.Количество() По 0 Цикл
					НайденнаяСтрока = Объект.Товары.НайтиПоИдентификатору(ВыделенныеСтроки[-Индекс]);
					Если Не ЗначениеЗаполнено(Объект.Кассир) Тогда
						БонусыАльтерраРезерв.ОчиститьБонусыПоСтроке(НайденнаяСтрока);
					Иначе
						ВыделенныеСтроки.Удалить(-Индекс);	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
			ОчиститьБонусыСервер();
			ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&После("ОбработкаПодбораТоваровИзЗаказа")
Процедура Док_ОбработкаПодбораТоваровИзЗаказа(АдресТоваровВХранилище)
	ЗаполнитьБонусыПоЗаказу();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБонусыПоЗаказу()
	Если Не ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		Возврат;
	КонецЕсли;
	
	//Если Не НовыйПорядокНачисленияБонусов Тогда
	//	Возврат;
	//КонецЕсли;
	
	МассивСтрок = Новый Массив;
	Для Каждого Стр Из Объект.Товары Цикл
		МассивСтрок.Добавить(Стр.КодСтроки);
	КонецЦикла;
	
	ПересчитатьБонусыВСтрокеНаСервере(МассивСтрок);
	
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	//СформироватьНадписьВалюты(ЭтаФорма);
	//ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
	//ОчиститьЭтапыГрафикаОплаты();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьБонусыВСтрокеНаСервере(МассивСтрок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток), 0) КАК Остаток
	|ПОМЕСТИТЬ ВТ_Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ДокументОтгрузки = &Ссылка) КАК ТоварыКОтгрузкеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.СуммаНачисленныхБонусныхБалловВВалюте КАК НачисленоВсего,
	|	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК КСписанию,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказКлиентаТовары.СуммаНачисленныхБалловЗаСтатус КАК НачисленоЗаСтатус,
	|	ВЫБОР
	|		КОГДА ВТ_Остаток.Остаток = 0
	|			ТОГДА ЗаказКлиентаТовары.СуммаНачисленныхБалловЗаКП
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленоЗаКП,
	|	ЗаказКлиентаТовары.СуммаНачисленныхБалловПрочее КАК НачисленоПрочее,
	|	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары,
	|	ВТ_Остаток КАК ВТ_Остаток
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка
	|	И ЗаказКлиентаТовары.КодСтроки В(&МассивСтрок)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("МассивСтрок", МассивСтрок);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НачисленоВсего > 0 Или Выборка.КСписанию > 0 Тогда
			
			Отбор = ?(НовыйПорядокНачисленияБонусов, Новый Структура("КодСтроки", Выборка.КодСтроки),
			Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Характеристика));
			
			стрРеализации = Объект.Товары.НайтиСтроки(Отбор)[0];
			стрРеализации.КоличествоУпаковок = Мин(стрРеализации.КоличествоУпаковок, Выборка.КоличествоУпаковок);
			стрРеализации.Количество = стрРеализации.КоличествоУпаковок;
			
			стрРеализации.СуммаБонусныхБалловКСписаниюВВалюте = (Выборка.КСписанию*стрРеализации.КоличествоУпаковок)/Выборка.КоличествоУпаковок;
			стрРеализации.СуммаБонусныхБалловКСписанию = стрРеализации.СуммаБонусныхБалловКСписаниюВВалюте;
			
			стрРеализации.СуммаНачисленныхБалловЗаКП = (Выборка.НачисленоЗаКП*стрРеализации.КоличествоУпаковок)/Выборка.КоличествоУпаковок;
			стрРеализации.СуммаНачисленныхБалловПрочее = (Выборка.НачисленоПрочее*стрРеализации.КоличествоУпаковок)/Выборка.КоличествоУпаковок;
			стрРеализации.СуммаНачисленныхБалловЗаСтатус = (Выборка.НачисленоЗаСтатус*стрРеализации.КоличествоУпаковок)/Выборка.КоличествоУпаковок;
			
			Если НовыйПорядокНачисленияБонусов Тогда
				стрРеализации.СуммаНачисленныхБонусныхБалловВВалюте = стрРеализации.СуммаНачисленныхБалловПрочее
				+ стрРеализации.СуммаНачисленныхБалловЗаКП
				+ стрРеализации.СуммаНачисленныхБалловЗаСтатус;
			Иначе
				стрРеализации.СуммаНачисленныхБонусныхБалловВВалюте = (Выборка.НачисленоВсего*стрРеализации.КоличествоУпаковок)/Выборка.КоличествоУпаковок;
			КонецЕсли;
			
			
			БонусыАльтерраРезерв.ПересчитатьСуммыСУчетомБонусов(Объект, стрРеализации);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область БонусыКоманды
//Оплата
&НаКлиенте
Процедура ОплатитьБонуснымиБаллами(Команда)
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		Сообщить("Установить оплату бонусными баллами возможно только в документе заказа.");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Или Не Объект.Проведен Тогда
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуОплатыБаламиЗавершение", ЭтотОбъект),
		НСтр("ru = 'Неоходимо провести документ для выполнения операции. Провести документ?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	
	Если ПроверитьВозможностьОплаты() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуОплатыБаламиФрагмент();
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьФормуОплатыБаламиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуОплатыБаламиФрагмент();
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьФормуОплатыБаламиФрагмент()
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Партнер",                   Объект.Партнер);
	ПараметрыОткрытияФормы.Вставить("КартаЛояльности",           Объект.КартаЛояльности);
	ПараметрыОткрытияФормы.Вставить("АдресТабличнойЧастиТовары", АдресТабличнойЧастиТовары());
	ПараметрыОткрытияФормы.Вставить("Валюта",                    Объект.Валюта);
	
	ОткрытьФорму(
	"Справочник.БонусныеПрограммыЛояльности.Форма.ОплатаБонуснымиБаллами",
	ПараметрыОткрытияФормы,
	ЭтотОбъект,,,,
	Новый ОписаниеОповещения("ДобавитьОплатуБонуснымиБалламиЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Процедура ОплатитьБонуснымиБалламиНаСервере(АдресВоВременномХранилище=Неопределено)
	
	БонусыАльтерраРезерв.ПересчитатьБонусныеБаллыВТоваре(Объект, АдресВоВременномХранилище);
	
	//ПересчитатьСуммуСверхЗаказа();
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	//СформироватьНадписьВалюты(ЭтаФорма);
	
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

//Начисление баллов
Процедура НачислитьБонусныеБаллы() Экспорт
	БонусыАльтерраРезерв.НачислитьБонусныеБаллы(Объект);
КонецПроцедуры

&НаСервере
Процедура ПоказатьИнформациюПоБонусам()
	БонусыАльтерраРезерв.ПоказатьИнформациюПоБонусам(Этаформа, Объект);
КонецПроцедуры

&НаСервере
Процедура ОчиститьБонусыСервер()
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) И (БонусыАльтерраРезерв.ПолучитьСуммуБалловКСписаниюИзЗаказа(Объект.ЗаказКлиента) > 0
		ИЛИ БонусыАльтерраРезерв.ПолучитьСуммуБалловКНачислениюИзЗаказа(Объект.ЗаказКлиента) > 0) 
		Тогда
		МассивСтрок = Новый Массив;
		Для каждого Стр Из Объект.Товары Цикл
			МассивСтрок.Добавить(Стр.КодСтроки);
		КонецЦикла;
		ПересчитатьБонусыВСтрокеНаСервере(МассивСтрок);
	Иначе
		БонусыАльтерраРезерв.ОчиститьБонусыПолностью(Объект);
	КонецЕсли;
	
	ЗапретВидимостиБонусов(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗапретВидимостиБонусов()
	
	ЗапретБонусов = ?(НовыйПорядокНачисленияБонусов, 
	БонусыАльтерраРезерв.ПроверитьЗапретБонусов(Объект),
	БонусыАльтерра.ПроверитьЗапретБонусов(Объект));
	
	Элементы._Бонусы.Доступность = НЕ ЗапретБонусов;
	
	Если ЗначениеЗаполнено(Объект.Кассир) Тогда
		Элементы._Бонусы.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьОплаты()
	ЗапретОплаты = БонусыАльтерраРезерв.ПроверитьЗапретОплатыБонусов(Объект);
	Возврат ЗапретОплаты;
КонецФункции
#КонецОбласти

#КонецОбласти


#Область ОтметкаКассы
&НаСервере
Процедура ВидимостьФлажки()
	УстановитьДоступнойтьККМ();
	если не объект.ккм тогда 
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость=Ложь;
		Элементы.Касса.Видимость=Ложь;
	иначе
		Объект.ФормаОплаты=Перечисления.ФормыОплаты.Наличная;
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость=истина;
		Элементы.Касса.Видимость=Истина;
	конецесли;	
	
конецПроцедуры	
&НаКлиенте
Процедура ОтметкуУстановить(Установка)
	Если _ПроверкаОповещение Тогда
		Возврат;
	Конецесли;	
	Если Установка Тогда
		Объект.Кассир = ПолучитьПользователя();
		Объект.ДатаОтметкиКасса = ТекущаяДата();  
	Иначе
		Объект.Кассир = "";
		Объект.ДатаОтметкиКасса = ТекущаяДата();
		ЭтаФорма.Модифицированность = Истина; 
	Конецесли;
	ОбщегоНазначенияУТКлиент.ЗаписатьИЗакрыть(ЭтаФорма, Истина);
КонецПроцедуры 
&НаСервере
Процедура ЗаписьБезПроверок(Ссылка)
	Документ = Ссылка.ПолучитьОбъект(); 
	Документ.ОбменДанными.Загрузка = Истина;
	Документ.Записать(РежимЗаписиДокумента.Проведение); 
КонецПроцедуры


&НаКлиенте
Процедура ОтметкаКассы(Команда)
	
	СФП_МаркерыКлиент.МаркерНачало("Реализация: Отметка кассы", Объект.Номер);
	
	УстановкаОтметки = Объект.Кассир.Пустая();
	// Блок проверок
	Если  УстановкаОтметки Тогда
		Если Не Объект.Проведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не проведен! Установка отметки кассы невозможна!", Объект.Ссылка, "Объект.Кассир");
			Возврат;
		Иначе
			Если Не ЗначениеЗаполнено(Объект.ПричинаПеределки) И ЗначениеЗаполнено(Объект.ДатаОтметкиКасса) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните причины правки документа", Объект.Ссылка, "Объект.ПричинаПеределки");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		//Проверка согласованного листа
		Если Не ЕстьСогласованныеЛисты() ИЛИ ЕстьНеСогласованныйРейс() Тогда             
			Возврат;
		КонецЕсли;		
	Иначе                                       
		Если  ПроверитьЕстьРейсыПоДокументу() Тогда       
			Возврат;
		КонецЕсли;
	КонецЕсли;
	_ПроверкаОповещение=Ложь;
	
	//ПроверкаИдентификацииКлиента(УстановкаОтметки);
	
	ПроверкаСекцийДокумента(УстановкаОтметки);
	
	ОтметкуУстановить(УстановкаОтметки);
	
	//УстановитьДоступностьПоОтметкеКассы();
	
КонецПроцедуры
&НаСервере
Процедура ЗаписьОтметкиКассы()
	ПараметрЗаписи =  Новый Структура;
	ПараметрЗаписи.Вставить("РежимЗаписи",РежимЗаписиДокумента.Запись);
	ЭтаФорма.Записать(ПараметрЗаписи);
	
КонецПроцедуры
&НаСервере
Функция ЕстьСогласованныеЛисты()
	ЛистыСогласования= ЛистыСогласованияСервер.ПолучитьЛистыСогласования(Объект.Ссылка);
	Пока ЛистыСогласования.Следующий() Цикл
		Если Не ЛистыСогласования.Согласован Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Есть не согласованный лист:"+Строка(ЛистыСогласования.Ссылка), ЛистыСогласования.Ссылка); 
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции
&НаКлиенте
Процедура ОбработкаФлажков(Команда)
	
	ОбработкаФлажковСервер(Команда.Имя);	
КонецПроцедуры
&НаСервере
Процедура ОбработкаФлажковСервер(имя)
	если Объект.ККМ тогда 
		//Объект.Касса=ДопМодуль.ПолучитьКассуПоУмолчанию(объект.Организация);
		Сотрудник= АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователи.ТекущийПользователь());
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			Если ЗначениеЗаполнено(Сотрудник.Касса) Тогда
				Объект.Касса= Сотрудник.Касса;
			КонецЕсли;
		КонецЕсли;
		
		Объект.ФормаОплаты=перечисления.ФормыОплаты.Наличная;
		Объект.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("ВЫРУЧКА ФИЗИЧЕСКИЕ ЛИЦА");
	конецесли;
	если не Объект.ККМ тогда
		Объект.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		Объект.Касса=Справочники.Кассы.ПустаяСсылка();
		Объект.ФормаОплаты=перечисления.ФормыОплаты.ПустаяСсылка();
	конецесли;
	ВидимостьФлажки();
конецпроцедуры	
&НаКлиенте
Процедура СброситьПоСекции(Команда)
	МассивВыдСтрок=Элементы.Товары.ВыделенныеСтроки;
	если МассивВыдСтрок.Количество()<>0 тогда
		Для Каждого ТекСтрока Из МассивВыдСтрок Цикл
			СтрокаКоллекции=Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
			СтрокаКоллекции.Кладовщик="";
		конеццикла;
	конецесли;	
КонецПроцедуры
&НаСервере
Процедура УстановитьДоступнойтьККМ()
	//ККМДоступна= Истина;
	//
	//ККМДоступна= ККМДоступна И Не АльтерраОбщегоНазначения.ЭтоОптоваяПродажа(Объект);
	//
	//Если Не ЗначениеЗаполнено(Объект.Кассир) И ККМДоступна = Ложь Тогда
	//	Объект.ККМ= Ложь;
	//КонецЕсли;
	//Элементы.ККМ.Доступность= ККМДоступна;
	//// временно
	//Элементы.ККМ.Доступность=Объект.Организация.Наименование<>"СтройКонтинент ООО";
	
КонецПроцедуры
&НаСервере
Функция ПолучитьПользователя()
	возврат параметрыСеанса.ТекущийПользователь;
конецфункции	
&НаСервере
Процедура УстановитьДоступностьПоОтметкеКассы()
	Если _ПроверкаОповещение Тогда
		Возврат;
	Конецесли;	
	
	ДопМодуль.УстановитьДоступностьПоОтметкеКассыОбщий(ЭтаФорма);
	
	ВидимостьФлажки();
	Если РольДоступна("ОтметкаКассы") ИЛИ РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.Элементы.ПричинаПеределки.ТолькоПросмотр = Ложь;
		//////Оплата картой при доставке
		СсылкаЗаказНаДоставку = Документы.ЗаказНаДоставкуКлиенту.ПолучитьЗаказНаДоставкуПоОснованию(Объект.Ссылка);
		Если СсылкаЗаказНаДоставку <> Документы.ЗаказНаДоставкуКлиенту.ПустаяСсылка() Тогда
			Элементы.ОплатаДоставкиКартой.Видимость = СсылкаЗаказНаДоставку.ОплатаБанковскойКартой;	
		КонецЕсли;	
		///////
	КонецЕсли;
	Если Объект.Кассир.Пустая() Тогда  
		Элементы._ЗаполнитьШапкуПоЗаказу.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		ЭтаФорма.Элементы.Форма_Нарезка.Доступность = Ложь;      
		Элементы._ЗаполнитьНарезкуПоЗаказу.Видимость = Истина;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаНачислитьБонусы.Доступность = Истина;
КонецПроцедуры	

&НаСервере
Процедура УстановитьДоступностьФормыПоОтметкеКассы_Устарела(флаг)
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		Элементы.Партнер.ТолькоПросмотр= Истина;
		Элементы.Контрагент.ТолькоПросмотр= Истина;
		Элементы.Соглашение.ТолькоПросмотр= Истина;
		Элементы.Договор.ТолькоПросмотр= Истина;
		Элементы.Склад.ТолькоПросмотр= Истина;
		Элементы.Организация.ТолькоПросмотр= Истина;
		Элементы._ЗаполнитьШапкуПоЗаказу.Видимость= Истина;
		Элементы.Товары_ДобавитьУслугуБезНДС.Доступность = Ложь; //
		Элементы.ТоварыКонтекстноеМеню.Доступность= Ложь;
		Элементы.ТоварыСкопироватьСтроки.Доступность= Ложь;
		Элементы.ТоварыВставитьСтроки.Доступность= Ложь;
		Элементы.ТоварыРазбитьСтроку.Доступность= Ложь;
		Элементы.ТоварыПоискПоШтрихкоду.Доступность= Ложь;
		Элементы.ТоварыНоменклатура.ТолькоПросмотр= Истина;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ТоварыДобавить.Доступность= Ложь;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ГруппаЦеныСкидки.Доступность= Ложь;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.Форма_Нарезка.Доступность= Ложь;
		ТоварыГруппаЗаполнить= Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ГруппаТоварыПодобратьТовары.ПодчиненныеЭлементы.ТоварыГруппаЗаполнить.ПодчиненныеЭлементы;
		ТоварыГруппаЗаполнить.ТоварыДополнитьМногооборотнойТарой.Доступность= Ложь;
		ТоварыГруппаЗаполнить.ТоварыЗагрузитьИзВнешнегоФайла.Доступность= Ложь;
		ТоварыГруппаЗаполнить.ТоварыЗаполнитьСерииПоFEFO.Доступность= Ложь;
		ТоварыГруппаЗаполнить.ТоварыОткрытьПодбор.Доступность= Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		ЭтаФорма.Элементы.Форма_Нарезка.Доступность= Ложь;                    	
	иначе
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ГруппаТоварыПодобратьТовары.Доступность= Не флаг;
		ЭтаФорма.Элементы.Форма_Нарезка.Доступность= не флаг;
	КонецЕсли;	
	
	ЭтаФорма.ТолькоПросмотр= флаг;
	Элементы._ДопФлажки.ТолькоПросмотр= флаг;
	Элементы._ПровестиНапечататьЗакрыть.Доступность= не флаг;
	ЭтаФорма.Элементы.ТоварыСброситьПоСекции.Доступность= не флаг;
	ЭтаФорма.Элементы.Форма_Провести.Видимость= Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр И (РольДоступна("ПроводитьПриОтметкеКассы") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		ЭтаФорма.Элементы.Форма_Провести.Видимость= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЕстьРейсыПоДокументу()
	Возврат Документы.ЗаданиеНаПеревозкуРейс.ПроверитьЕстьРейсыПоДокументу(Объект.Ссылка);
КонецФункции

&НаСервере
Функция ЕстьНеСогласованныйРейс()
	Возврат Документы.ЗаданиеНаПеревозкуРейс.ЕстьНеСогласованныйРейс(Объект.Ссылка);
КонецФункции


#Область РетеилСервис
&НаКлиенте
Процедура ОтметкаКассыСканирование()
	УстановкаОтметки=Объект.Кассир.Пустая();
	
	Если УстановкаОтметки тогда
		//Беспалов
		Если Не ЗначениеЗаполнено(Объект.ПричинаПеределки) И ЗначениеЗаполнено(Объект.ДатаОтметкиКасса) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните причины правки документа", Объект.Ссылка, "Объект.ПричинаПеределки");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПроверкаСекцийДокумента(УстановкаОтметки,ШтрихкодСекция);
	
	ОтметкуУстановить(УстановкаОтметки);
	
	УстановитьДоступностьПоОтметкеКассы();
	
КонецПроцедуры
&НаКлиенте
Функция ПоискШтрихкодаМенеджера(СтруктураДанных)
	
	Штрихкод = СтруктураДанных.Штрихкод;
	МенеджерСсылка = ПоискШтрихкодаМенеджераСервер(Штрихкод);
	
	Возврат МенеджерСсылка;
	
КонецФункции
&НаСервере
Функция ПоискШтрихкодаМенеджераСервер(ШК)
	МенеджерСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(13))) = &Штрихкод
	|	И ДополнительныеСведения.Свойство = &СвойствоШтрихкод";
	
	Запрос.УстановитьПараметр("СвойствоШтрихкод", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ШтрихкодПользователя"));
	Запрос.УстановитьПараметр("Штрихкод", ШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		МенеджерСсылка = Выборка.Объект;
	КонецЕсли;
	
	Возврат МенеджерСсылка;
	
КонецФункции
&НаКлиенте
Функция ДоступностьЭлемента(Элемент)
	
	Попытка 
		Если Не Элемент.Доступность Тогда
			Возврат Ложь;
		Иначе
			Возврат ДоступностьЭлемента(Элемент.Родитель);
		КонецЕсли;
	Исключение
		Возврат Истина;
	КонецПопытки;
	
КонецФункции
&НаСервере
Функция ЕстьПравоНаОтметкуКассы()
	
	возврат рольдоступна("Полныеправа") или рольдоступна("ОтметкаКассы");
	
КонецФункции // ПроверитьПравоНаОтметкуКассы()

&НаКлиенте
Процедура ПроверкаСекцийДокумента(Установить,ШК = Неопределено)
	если _ПроверкаОповещение тогда
		возврат;
	конецесли;	
	
	ИспользуетсяПроверкаШК = РСОбщийМодульВызовСервера.ПользовательИспользуетПроверкуПоШтрихкоду(ПолучитьПользователя());
	
	Если НЕ ИспользуетсяПроверкаШК Тогда
		Возврат ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		Если ЗначениеЗаполнено(АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента, "Кассир")) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ОповещениеПроверкиПоСекциям = Новый ОписаниеОповещения("ПроверкиПоСекциямЗавершение",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("Признак", не Установить);
	ПараметрыФормы.Вставить("Штрихкод", ШК);
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаПроверкиПоСекциям",ПараметрыФормы,ЭтаФорма,,,,ОповещениеПроверкиПоСекциям,);
	_ПроверкаОповещение=истина;
КонецПроцедуры // ПроверкаСекцийДокумента()

&НаКлиенте
Процедура ПроверкиПоСекциямЗавершение(Результат, ДополнительныеПараметры) экспорт
	УстановкаОтметки=Объект.Кассир.Пустая();
	
	если результат=УстановкаОтметки тогда
		
		_ПроверкаОповещение=ложь;
		
		ОтметкуУстановить(УстановкаОтметки);
		
		УстановитьДоступностьПоОтметкеКассы();
		
	конецесли;
	
КонецПроцедуры

&НаКлиенте                       
Процедура ПроверкаИдентификацииКлиента(УстановкаОтметки)
	если УстановкаОтметки тогда
		ТекстСМС="";
		если ДопМодуль.ИдентифицироватьКлиентаПоСМС(Объект.Ссылка,ТекстСМС) тогда
			Оповещение = Новый ОписаниеОповещения("ОткрытьПараметрыОтправкиСМСЗавершение",ЭтотОбъект);   	
			ПараметрыФормы = Новый Структура("Владелец", Объект.Партнер);
			ПараметрыФормы.Вставить("ИдТолькоСМС");
			ПараметрыФормы.Вставить("ТекстСМС",ТекстСМС);
			ОткрытьФорму("Справочник.БонусныеПрограммыЛояльности.Форма.Спр_СМСИдентификация", ПараметрыФормы,ЭтаФорма,,,,Оповещение,);
			_ПроверкаОповещение=Истина;
		иначе
			ДопМодуль.ИнформироватьКлиентаПоСМС(Объект.Ссылка); 
		конецесли;	
	конецесли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьПараметрыОтправкиСМСЗавершение(Результат, ДополнительныеПараметры) экспорт
	если результат=истина тогда
		УстановкаОтметки=Объект.Кассир.Пустая();
		
		_ПроверкаОповещение=ложь;
		
		ПроверкаСекцийДокумента(УстановкаОтметки);
		
		ОтметкуУстановить(УстановкаОтметки);
		
		УстановитьДоступностьПоОтметкеКассы();
		
	иначе
		Сообщить("Клиент не идентифицирован!");
	конецесли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область РаспределениеТранспортных
&НаСервере
Функция РаспределитьТранспортныеНаСервере()
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары";
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить(,"Номенклатура"));
	Результат = Запрос.ВыполнитьПакет();
	
	если Результат[0].Выгрузить().Количество()=0 тогда
		Возврат Ложь;
	иначе
		Возврат ИСТИНА;
	конецесли;	
	
КонецФункции 
&НаСервере
Процедура ОбработкаРаспределенияТранспортных(АдресТоваровВХранилище)
	
	ТаблицаРаспределения = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	если ТаблицаРаспределения = НЕОПРЕДЕЛЕНО тогда
		возврат;
	конецесли;	
	Структурапоиска=Новый Структура("Номенклатура,Характеристика,Склад,Количество");
	
	
	Для Каждого СтрокаТоваров Из ТаблицаРаспределения Цикл
		Структурапоиска.Номенклатура=СтрокаТоваров.Номенклатура;
		Структурапоиска.Характеристика=СтрокаТоваров.Характеристика;
		Структурапоиска.Склад=СтрокаТоваров.Склад;
		Структурапоиска.Количество=СтрокаТоваров.Количество;
		МассивСтрокТЧТовары = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		
		для каждого стр из МассивСтрокТЧТовары цикл
			стр.Распределять=СтрокаТоваров.Распределять;
		конеццикла;	
		
	конеццикла;
	
	Элементы.ТоварыРаспределять.Видимость=Объект.Товары.Итог("Распределять")<>0;
КонецПроцедуры
&НаСервере
Функция ЕстьУслуги()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
	|	И РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура Док__РаспределитьТранспортные(Команда)
	// Вставить содержимое обработчика.
	Если АльтерраОбщегоНазначения.ПроверитьУслуги(Объект) Тогда 
		ТекстПредупреждения = НСтр("ru='В табличной части нет услуг к распределению.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Товары", Объект.Товары);
	Модифицированность = Истина;	
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаРаспределения",ПараметрыОткрытия,ЭтотОбъект);
	
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();// Альтерра ПроектЧеки
	ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	
КонецПроцедуры
#КонецОбласти


#Область Дополнительно

// договор на форме 
&НаКлиенте
Процедура Док_ИспользуетсяДоговорПриИзмененииПосле(Элемент)
	если  Объект.ИспользуетсяДоговор тогда
		Объект.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов");
		
	иначе
		Объект.Договор="";
		Объект.ПорядокРасчетов =ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным");
		
	конецесли;
	ИспользуетсяДоговорПриИзменении();	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
	//	ПриИзмененииСоглашенияСервер();
	Элементы.ТекстДокументыНаОснованииПодвалРасш.Доступность=Объект.ПорядокРасчетов=ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов"); 
	
КонецПроцедуры
&НаСервере
Процедура  ИспользуетсяДоговорПриИзменении()
	
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.ГруппаДоговор.Видимость, Объект.Договор);
	Элементы.ГруппаНадписьДоговор.Видимость = Элементы.ГруппаДоговор.Видимость;
	Элементы.ГруппаНадписиСкладИЗадолженность.Видимость=Элементы.ГруппаДоговор.Видимость;
	Элементы.ГруппаНадписиЗадолженность.Видимость=Элементы.ГруппаДоговор.Видимость;
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Договор");
	ВзаиморасчетыСервер.ФормаПриИзмененииРеквизитов(ЭтаФорма, "Договор");
	
КонецПроцедуры

&НаКлиенте
Процедура Док__НаценкаДоставкаПриИзмененииПосле(Элемент)
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	ОчиститьБонусыСервер();
	ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	ДобавитьУправляемуюСкидкуНаСервере(_НаценкаДоставка,"+1% (доставка организацией)");
КонецПроцедуры
&НаСервере
Процедура ДобавитьУправляемуюСкидкуНаСервере(Добавить,ИмяСкидки)
	Скидка=Справочники.СкидкиНаценки.НайтиПоНаименованию(ИмяСкидки);
	если добавить тогда
		УправляемыеСкидки.Добавить(Скидка);
	иначе
		
		УправляемыеСкидки.Удалить(УправляемыеСкидки.НайтиПоЗначению(Скидка));
	конецесли;
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	СтруктураПараметры.Вставить("РеализацияСверхЗаказа", РеализацияСверхЗаказа И Объект.РеализацияПоЗаказам);
	
	СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	
	//АвтоопределениеДистрибуция
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		АльтерраОбщегоНазначения.ПересчитатьЦенуСДоставкойПечать(Объект.Товары);
	КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура Док_РеализацияПоЗаказуПриИзмененииПосле(Элемент)
	элементы.ИспользуетсяДоговор.Доступность=не Объект.РеализацияПоЗаказам;
	//Светлакова задача №75125
	Элементы.Товары_ДобавитьУслугуБезНДС.Доступность = не Объект.РеализацияПоЗаказам; //
	если Объект.РеализацияПоЗаказам и значениезаполнено(Объект.ЗаказКлиента) тогда
		ОбъектСкидок=Объект.ЗаказКлиента;
	иначе
		ОбъектСкидок=Объект;
	конецесли;	
	
КонецПроцедуры

#КонецОбласти


#Область Нарезка
&НаКлиенте
Процедура Док__Нарезка(Команда)
	ПараметрыОткрытия= Новый Структура;
	ПараметрыОткрытия.Вставить("АдресВХранилище", АльтерраОбщегоНазначения.ПередатьВХранилищеТЧПоНарезке(Объект)); 
	
	ОповещениеЗаполнитьНарезку= Новый ОписаниеОповещения("ЗаполнитьНарезку", ЭтотОбъект);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаНарезка", ПараметрыОткрытия, ЭтаФорма, Истина,,, ОповещениеЗаполнитьНарезку);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНарезку(Результат, ДопПараметры) Экспорт
	ЗаполнитьНарезкуСервер(Результат, ДопПараметры)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНарезкуСервер(Результат, ДопПараметры) 
	Если Результат <> Неопределено Тогда
		АльтерраОбщегоНазначения.ЗаполнитьНарезку(Объект, Результат);
		ЭтаФорма.Модифицированность= Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область Бригадиры

&НаКлиенте
Процедура Док_СоглашениеОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если АльтерраОбщегоназначения.ЭтоБригадир(Объект.Партнер) Тогда
		Если БонусыАльтерра.НужноПодтверждениеВыбораСоглашения(ВыбранноеЗначение) Тогда
			ИдентификацияВыбораСоглашения(ЭтотОбъект, Объект.Партнер, ВыбранноеЗначение);
			СтандартнаяОбработка = ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификацияВыбораСоглашения(Объект, Партнер, ВыбранноеЗначение) Экспорт 
	Оповещение = Новый ОписаниеОповещения("ОткрытьПараметрыЗавершение",Объект, ВыбранноеЗначение);   	
	ПараметрыФормы = Новый Структура("Владелец", Партнер);
	ОткрытьФорму("Справочник.БонусныеПрограммыЛояльности.Форма.Спр_СМСИдентификация", ПараметрыФормы, ЭтаФорма,,,,Оповещение,);
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьПараметрыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Истина тогда
		Объект.Соглашение = ДополнительныеПараметры;
		//+Альтерра
		СоглашениеПриИзменении(Элементы.Соглашение);	
		//-
	Иначе
		Сообщить("Идентификация не пройдена. Выберите другое соглашение или повторите попытку.");
	конецесли;
КонецПроцедуры 

#КонецОбласти


#Область ВыгрузкаПочтаРФ

&НаКлиенте
Процедура Док__ВыгрузитьВДБФПосле(Команда)
	ИмяФайла=Новый Структура;
	СтруктураОрганизации=ВернутьСтруктуруОрганизации();
	ИНН=СтруктураОрганизации.ИНН;
	ДатаФайла=формат(СтруктураОрганизации.ДатаФайла,"ДФ=ддММгг");
	ИмяФайла.Вставить("ИмяФайлаВыгрузки",ИНН+"_"+датаФайла+"_"+ПРАВ(Объект.Номер,4)+".dbf");
	
	ВыгрузитьДБФСервер(имяФайла,СтруктураОрганизации);
	СохранитьВыгружаемыеДанныеДБФ(имяФайла);
	
КонецПроцедуры

&НаСервере
Функция СоздатьСтруктуруФайлаДБФ()
	
	ДБФ=Новый XBase;
	ДБФ.Кодировка=КодировкаXBase.OEM;
	ДБФ.Поля.Добавить("INN_KONT","S",20);//обязательное
	ДБФ.Поля.Добавить("NOM_DOG","S",20); //обязательное
	ДБФ.Поля.Добавить("DATE_DOG","D");   //обязательное
	ДБФ.Поля.Добавить("NOM_DOC","S",20); //обязательное
	ДБФ.Поля.Добавить("DATE_DOC","D");   //обязательное
	ДБФ.Поля.Добавить("NOM_PP","N",3,0); //обязательное
	ДБФ.Поля.Добавить("PROD_NAME1","S",80);//обязательное
	ДБФ.Поля.Добавить("BARCODE1","S",13);
	ДБФ.Поля.Добавить("INDEX_POD","N",10,0);
	ДБФ.Поля.Добавить("BARCODE2","S",5);
	ДБФ.Поля.Добавить("ED_IZM","S",5);     //обязательное
	ДБФ.Поля.Добавить("ED_IZMOKEY","S",3); //обязательное
	ДБФ.Поля.Добавить("ED_IZMWRLD","S",3);
	ДБФ.Поля.Добавить("KOL","N",15,3);     //обязательное
	ДБФ.Поля.Добавить("PRICE","N",15,2);
	ДБФ.Поля.Добавить("RATE_NDS","N",2,0); //обязательное
	ДБФ.Поля.Добавить("SUMM_NDS","N",15,2); //обязательное
	ДБФ.Поля.Добавить("DATE_OUT","D");
	ДБФ.Поля.Добавить("PRC_OUT","N",3,0);
	ДБФ.Поля.Добавить("PRC_DOWN","N",3,0);
	ДБФ.Поля.Добавить("CODE_VND1","S",20);
	ДБФ.Поля.Добавить("CODE_VND","N",3,0);
	ДБФ.Поля.Добавить("OBLIGATORY","L");
	ДБФ.Поля.Добавить("COD_OTD","S",6);
	ДБФ.Поля.Добавить("NOM_SRT","S",40);
	ДБФ.Поля.Добавить("DATE_SRT","D");
	ДБФ.Поля.Добавить("WHO_SRT","S",80);
	ДБФ.Поля.Добавить("DT_SRT_OUT","D");
	ДБФ.Поля.Добавить("PROD_NAME2","S",30);
	ДБФ.Поля.Добавить("CODE_VND2","N",10,0);
	ДБФ.Поля.Добавить("CODE_NAKL","N",10,0);
	ДБФ.Поля.Добавить("SUMM_TOTAL","N",15,2);//обязательное
	
	
	Возврат ДБФ;
КонецФункции // СоздатьСтруктуруФайлаДБФ()

&НаСервере
Функция ВернутьСтруктуруОрганизации()
	Структура=ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация,Объект.Дата);			
	Структура.Вставить("ДатаФайла",Объект.Дата);
	возврат Структура;
КонецФункции // ВернутьСтруктуруОрганизации()

&НаСервере
Функция РеквизитыШапки(Документ,СтруктураОшибок,СтруктураОрганизации)
	СтруктураРеквизитовШапки=Новый Структура;
	// ИНН обязательный
	ИНН=СтруктураОрганизации.ИНН+"/"+СтруктураОрганизации.КПП;
	СтруктураРеквизитовШапки.Вставить("INN_KONT",ИНН);
	если значениезаполнено(Документ.Договор) тогда
		// номер и дата договора обязательный
		СтруктураРеквизитовШапки.Вставить("NOM_DOG",Документ.Договор.Номер);
		СтруктураРеквизитовШапки.Вставить("DATE_DOG",Документ.Договор.Дата);
	иначе
		Сообщить("Не заполнен договор с клиентом!");
		СтруктураОшибок.Вставить("Договор","Не заполнен договор с клиентом!");
	конецесли;
	// номер и дата документа обязательный
	СтруктураРеквизитовШапки.Вставить("NOM_DOC",Документ.Номер);
	СтруктураРеквизитовШапки.Вставить("DATE_DOC",Документ.Дата);
	Возврат СтруктураРеквизитовШапки;
КонецФункции // РеквизитыШапки()

&НаСервере
Процедура ВыгрузитьДБФСервер(ИмяФайла,СтруктураОрганизации)
	
	УстановитьПривилегированныйРежим(истина);
	ФайлДБФ=СоздатьСтруктуруФайлаДБФ();
	ИмяТемпФайла=ПолучитьИмяВременногоФайла("dbf");
	
	ТемпФайл=Новый Файл(ИмяТемпФайла);
	
	ПутьВрФайла=ТемпФайл.Путь+лев(ТемпФайл.ИмяБезРасширения,8)+ТемпФайл.Расширение;
	
	ФайлДБФ.СоздатьФайл(ПутьВрФайла);
	СтруктураОшибок=новый Структура;
	
	РеквизитыШапки=РеквизитыШапки(Объект,СтруктураОшибок,СтруктураОрганизации);
	
	ТаблицаТоваров=Объект.Товары.Выгрузить();
	
	ТаблицаТоваров.Свернуть("Номенклатура,СтавкаНДС","КоличествоУпаковок,СуммаНДС,СуммаСНДС");
	
	НомерСтр=1;
	для каждого стр из ТаблицаТоваров цикл
		ФайлДБФ.Добавить();	
		заполнитьзначенияСвойств(ФайлДБФ,РеквизитыШапки);
		ФайлДБФ.NOM_PP=НомерСтр;
		ФайлДБФ.PROD_NAME1=стр.Номенклатура.Наименование;
		ФайлДБФ.ED_IZM="ШТ.";
		ФайлДБФ.ED_IZMOKEY="796";
		ФайлДБФ.KOL=стр.КоличествоУпаковок;
		ФайлДБФ.PRICE=окр(стр.СуммаСНДС/стр.КоличествоУпаковок,2);
		ФайлДБФ.RATE_NDS=УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(стр.СтавкаНДС);
		ФайлДБФ.SUMM_NDS=стр.СуммаНДС;
		ФайлДБФ.SUMM_TOTAL=стр.СуммаСНДС;
		ФайлДБФ.DATE_OUT=Объект.Дата+180*60*60*24;
		ФайлДБФ.Записать();
		НомерСтр=НомерСтр+1;
	конеццикла;	
	ФайлДБФ.ЗакрытьФайл();
	
	ФайлВыгрузки = Новый ДвоичныеДанные(ПутьВрФайла);
	СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ФайлВыгрузки);
	УдалитьФайлы(ПутьВрФайла);
	ИмяФайла.Вставить("АдресФайлаВыгрузки", СсылкаНаДвоичныеДанныеФайла);
	УстановитьПривилегированныйРежим(ложь);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыгружаемыеДанныеДБФ(ВыгружаемыеДанные)
	
	
	Попытка
		
		ПолучитьФайл(ВыгружаемыеДанные.АдресФайлаВыгрузки, ВыгружаемыеДанные.ИмяФайлаВыгрузки);
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		
		ТекстСообщения = "Не удалось записать файл """ + ВыгружаемыеДанные.ИмяФайлаВыгрузки 
		+ """! Возможно, недостаточно места на диске или диск защищен от записи.";
		
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), ТекстСообщения);
		
		Сообщение.Сообщить();
		
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ХозяйственнаяОперацияПриИзмененииПосле(Элемент)
	Элементы.Товары_ВыгрузитьВДБФ.Видимость=Объект.ХозяйственнаяОперация=ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
КонецПроцедуры

#КонецОбласти


#Область ЗадолженностьДней
&НаКлиенте
Процедура Док__ТекстКоличествоДнейПросрочкиНажатиеПосле(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПродажиКлиент.ОткрытьОтчетРасшифровкаДнейпросрочки(Объект.Договор,Объект.Дата);	
	
КонецПроцедуры

#КонецОбласти

#Область УведомленияПодрядчику

&НаСервере
Процедура УведомленияПодрядчику_ИнициализацияЗначений()
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|    СобытияДокументовАльтерраСрезПоследних.Документ КАК Документ,
	|    СобытияДокументовАльтерраСрезПоследних.Событие КАК Событие
	|ИЗ
	|    РегистрСведений.СобытияДокументовАльтерра.СрезПоследних КАК СобытияДокументовАльтерраСрезПоследних
	|ГДЕ
	|    СобытияДокументовАльтерраСрезПоследних.Документ = &Документ
	|    И СобытияДокументовАльтерраСрезПоследних.Событие = &Событие";
	Запрос.УстановитьПараметр("Документ",объект.Ссылка);
	Запрос.УстановитьПараметр("Событие",Перечисления.СобытияДокументов.УведомлениеПодрядчику);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОтправлен = Истина;
	Иначе
		ДокументОтправлен = ложь;
	КонецЕсли;
	
	СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если (ЗначениеЗаполнено(Объект.Склад) И
		ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И
		Объект.Склад.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
		Объект.Склад.ОтправкаУведомлений = Истина)
		Тогда  
		Элементы.УведомленияПодрядчику.Видимость = ИСТИНА;
		Если ДокументОтправлен Тогда
			БлокировкаТаблицыТовары = Истина;
			Элементы.Товары.Доступность = Ложь;
		КонецЕсли;
		Если (ЗначениеЗаполнено(Объект.Склад) И
			ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И
			Объект.Склад.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
			Объект.Склад.ОтправкаУведомлений = Истина) Тогда  
			УведомленияПодрядчикуТелефон = Объект.Склад.ТелефонПодрядчика;
			УведомленияПодрядчикуПочта = Объект.Склад.EMAILподрядчика;
		Иначе
			УведомленияПодрядчикуТелефон = Объект.Склад.ТелефонПодрядчика;
			УведомленияПодрядчикуПочта = Объект.Склад.EMAILподрядчика;
		КонецЕсли;
	Иначе
		Элементы.УведомленияПодрядчику.Видимость = ЛОЖЬ;
		БлокировкаТаблицыТовары = Ложь;
		Элементы.Товары.Доступность = Истина;
		
	КонецЕсли;  
	
	
	
КонецПроцедуры      


&НаКлиенте
Процедура Док_БлокировкаТаблицыТоварыПриИзмененииПосле(Элемент)
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	ЭтотОбъект);    
	
	ПоказатьВопрос(Оповещение,
	"При снятии блокировки таблицы товары, подрядчик будет уведомлен об этом. Снять блокировку?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0);    
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		БлокировкаТаблицыТовары = Ложь;
		Элементы.БлокировкаТаблицыТовары.Доступность = Ложь;
		Элементы.Товары.Доступность = Истина;
		СоздатьЗаписьВРегистре();
	КонецЕсли;    
	
	Если Результат = КодВозвратаДиалога.Нет или Результат = КодВозвратаДиалога.Отмена Тогда
		БлокировкаТаблицыТовары = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВРегистре()
	События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
	События.Отбор.Документ.Установить(Объект.Ссылка);
	События.Отбор.Событие.Установить(Перечисления.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику);
	События.Отбор.Период.Установить(Объект.Дата);
	
	НовоеСобытие = События.Добавить();
	НовоеСобытие.Документ = Объект.Ссылка;
	НовоеСобытие.Событие = Перечисления.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику;
	НовоеСобытие.Период = Объект.Дата;
	События.Записать();
КонецПроцедуры


#КонецОбласти


&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьНадписьВалюты(Форма)
	
	ПараметрыНадписиВалюты = ВзаиморасчетыКлиентСервер.ПараметрыНадписиВалюты();
	
	ПараметрыНадписиВалюты.ВалютаДокумента      = Форма.ВалютаДокумента;
	ПараметрыНадписиВалюты.ВалютаВзаиморасчетов = Форма.ВалютаВзаиморасчетовДокумента;
	ПараметрыНадписиВалюты.ВалютаРеглУчета      = Форма.ВалютаРегламентированногоУчета;
	ПараметрыНадписиВалюты.СуммаДокумента       = Форма.Объект.Товары.Итог("СуммаСНДС");
	ПараметрыНадписиВалюты.СуммаВзаиморасчетов  = Форма.Объект.Товары.Итог("СуммаВзаиморасчетов");
	ПараметрыНадписиВалюты.КурсЧислитель        = Форма.Объект.КурсЧислитель;
	ПараметрыНадписиВалюты.КурсЗнаменатель      = Форма.Объект.КурсЗнаменатель;
	ПараметрыНадписиВалюты.НеПоказыватьРасчеты  = Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	
	Форма.НадписьВалюты = ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(Форма, ПараметрыНадписиВалюты);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам()
	
	ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	
	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
		Расчеты = НСтр("ru='Расчеты по договору'");
	ИначеЕсли Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным
		И Объект.РеализацияПоЗаказам
		И ТипЗнч(Объект.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Расчеты = НСтр("ru='Оплачено по заказу'") + ": " + Формат(СуммаОплаты, "ЧДЦ=2; ЧН=") + " " + ВалютаВзаиморасчетовДокумента + "  " + ПроцентОплаты + "%";
	ИначеЕсли Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным
		И Объект.РеализацияПоЗаказам
		И ТипЗнч(Объект.ЗаказКлиента) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		Расчеты = НСтр("ru='Оплачено по заявке на возврат'") + ": " + Формат(СуммаОплаты, "ЧДЦ=2; ЧН=") + " " + ВалютаВзаиморасчетовДокумента + "  " + ПроцентОплаты + "%";
	ИначеЕсли СписокЗаказов.Количество() > 1 Тогда
		Расчеты = НСтр("ru='Расчеты по заказам ('")+ Строка(СписокЗаказов.Количество()) + ")";
	Иначе
		Расчеты = НСтр("ru='Оплачено'") + ": " + Формат(СуммаОплаты, "ЧДЦ=2; ЧН=") + " " + ВалютаВзаиморасчетовДокумента + "  " + ПроцентОплаты + "%";
	КонецЕсли;
	
	НеКомиссия = Объект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;
	ПоЗаказамНакладным = Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	Элементы.Расчеты.Видимость = (НЕ Объект.РеализацияПоЗаказам И НеКомиссия)
	ИЛИ ((Объект.РеализацияПоЗаказам И НеКомиссия)
	И (ИспользоватьРасширенныеВозможностиЗаказаКлиента
	ИЛИ (НЕ ИспользоватьРасширенныеВозможностиЗаказаКлиента И НЕ ПоЗаказамНакладным)));
	
КонецПроцедуры   


&НаСервере
Процедура ОчиститьЭтапыГрафикаОплаты()
	Объект.ЭтапыГрафикаОплаты.Очистить();
	НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплатаДляСоглашений(ЭтаФорма);
КонецПроцедуры 

&НаСервере
&ИзменениеИКонтроль("РассчитатьИтоговыеПоказатели")
Процедура Док_РассчитатьИтоговыеПоказатели(Форма)
	
	// Заполнение итогов по таблице "Товары"
	КоллекцияТовары = Форма.Объект.Товары;
	#Вставка
	СтруктураДействий = Новый Структура;
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать,ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", Новый Структура("БезВозвратнойТары", "Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки"));
	ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьТЧ(КоллекцияТовары, СтруктураДействий, Неопределено);
	#КонецВставки
	Форма.СуммаВсего = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаСНДС"),
		КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары"));
	Форма.СуммаНДС = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаНДС"),
		КоллекцияТовары.Итог("СуммаНДСБезВозвратнойТары"));
	
	СуммаАвтоСкидки = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаАвтоматическойСкидки"),
		КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиБезВозвратнойТары"));
	СуммаРучнойСкидки = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаРучнойСкидки"),
		КоллекцияТовары.Итог("СуммаРучнойСкидкиБезВозвратнойТары"));
	СуммаСуммаБонусныхБалловКСписаниюВВалюте = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаБонусныхБалловКСписаниюВВалюте"),
		КоллекцияТовары.Итог("СуммаБонусныхБалловКСписаниюВВалютеБезВозвратнойТары"));
	#Удаление
	Форма.СуммаСкидки = СуммаАвтоСкидки + СуммаРучнойСкидки + СуммаСуммаБонусныхБалловКСписаниюВВалюте;
	#КонецУдаления
	#Вставка
	Форма.СуммаСкидки       = СуммаАвтоСкидки + СуммаРучнойСкидки;
	#КонецВставки
	Форма.СуммаЗалогаЗаТару = ?(Форма.Объект.ТребуетсяЗалогЗаТару, КоллекцияТовары.Итог("СуммаСНДС")
			-КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары"),0);
	
	Если УчетНДСУПКлиентСервер.ОтображатьНДСВИтогахДокументаПродажи(Форма.Объект.НалогообложениеНДС) Тогда
		Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоСНДС;
		Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница = Форма.Элементы.СтраницаСНДС;
	Иначе
		Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоБезНДС;
		Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница = Форма.Элементы.СтраницаБезНДС;
	КонецЕсли;
КонецПроцедуры

#Область НовоеЦенообразование


&НаКлиенте
&Вместо ("ЗаполнитьЦеныВыделенныхСтрокПоВидуЦен")
Процедура Док_ЗаполнитьЦеныВыделенныхСтрокПоВидуЦен(Команда)
	если ДопМодуль.НовоеЦенообразование() тогда
		Если ЦеныПредприятияЗаполнениеКлиент.НеобходимоЗаполнениеЦенПоВидуЦен(Объект, "Товары", НСтр("ru='Товары'")) Тогда
			
			ОписаниеОповещения=Новый ОписаниеОповещения("ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение", ЭтотОбъект);
			
			ОткрытьФорму(
			"Справочник.ГруппировкиВидовЦен.ФормаВыбора",,,,,,
			ОписаниеОповещения);
			
		КонецЕсли; 
	иначе	
		ПродолжитьВызов();
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
&Перед ("ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение")
Процедура Док_ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение(ВидЦен, ДополнительныеПараметры) Экспорт
	если ДопМодуль.НовоеЦенообразование() тогда	   
		ВидЦен=ПодборТоваровВызовСервера.ВернутьВидЦенПоПараметрам(ВидЦен,Объект.Подразделение)
	конецесли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьГруппуВидовЦен(ВидЦен)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЦен.ГруппаВидовЦен КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	ВидыЦен.Ссылка = &ВидыЦен";
	
	Запрос.УстановитьПараметр("ВидыЦен", ВидЦен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВидыЦен.ПустаяСсылка();
КонецФункции 


&НаСервере
Процедура ОбновитьПараметрыВыбораЦен()
	Если ДопМодуль.НовоеЦенообразование() тогда   
		Элементы.ТоварыВидЦены.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.ТоварыВидЦены, "Отбор.Подразделение", Объект.Подразделение );
	КонецЕсли;    
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьЦеныПоСоглашениюСервер")
Функция Док_ЗаполнитьЦеныПоСоглашениюСервер(ПоВсемСтрокам = Ложь, УчитыватьСтрокиСверхЗаказа = Истина, ТекстОшибки = "")

Если ПоВсемСтрокам Тогда
		Если РеализацияСверхЗаказа И УчитыватьСтрокиСверхЗаказа Тогда
			МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("КодСтроки", 0));
		Иначе
			МассивСтрок = Неопределено;
		КонецЕсли;
	Иначе
		МассивСтрок = Новый Массив;
		Для Каждого Строка Из Элементы.Товары.ВыделенныеСтроки Цикл
			НайденнаяСтрока = Объект.Товары.НайтиПоИдентификатору(Строка);
			Если (РеализацияСверхЗаказа И НайденнаяСтрока.КодСтроки = 0) 
				ИЛИ ОтклонениеОтУсловийПродаж Тогда
				МассивСтрок.Добавить(НайденнаяСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(Объект.Товары, МассивСтрок, Истина);
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов", Неопределено);
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗаполнения.Вставить("Партнер", Объект.Партнер);
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("НалогообложениеНДС",  Объект.НалогообложениеНДС);
	ПараметрыЗаполнения.Вставить("ВозвращатьМногооборотнуюТару",  Объект.ВернутьМногооборотнуюТару);
	ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены, СрокПоставки");
	#Вставка
	если Допмодуль.НовоеЦенообразование() тогда  
		ПараметрыЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	конецесли;	
	#КонецВставки
	Если РеализацияЧерезКомиссионера Тогда
		ПараметрыЗаполнения.Вставить("ВидЦены", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВидЦенПродажи"));
	Иначе
		ПараметрыЗаполнения.Вставить("Соглашение", Объект.Соглашение);
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Соглашение, "ЦенаВключаетНДС") <> Объект.ЦенаВключаетНДС Тогда
			ТекстОшибки = 
			НСтр("ru = 'Установленные значения полей ""Цена включает НДС"" в документе и соглашении разные.'");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
		Объект.Товары, // Табличная часть
		МассивСтрок, // Массив строк или структура отбора
		ПараметрыЗаполнения,
		СтруктураДействий);
	
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(ЭтаФорма);
	
	Возврат ЦеныРассчитаны;
		
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенСервер")
Функция Док_ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенСервер(ВидЦен)

	МассивСтрок = Новый Массив;
	
	Для Каждого ТекСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
		НайденнаяСтрока = Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
		Если (РеализацияСверхЗаказа И НайденнаяСтрока.КодСтроки = 0) 
			ИЛИ ОтклонениеОтУсловийПродаж Тогда
			МассивСтрок.Добавить(НайденнаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(Объект.Товары, МассивСтрок, Истина);
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов", Неопределено);
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("ВидЦены", ВидЦен);
	ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
	ПараметрыЗаполнения.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
	#Вставка
	если Допмодуль.НовоеЦенообразование() тогда  
		ПараметрыЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	конецесли;	
	#КонецВставки
	ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
		Объект.Товары, // Табличная часть
		МассивСтрок, // Массив строк или структура отбора
		ПараметрыЗаполнения,
		СтруктураДействий);
	
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаКлиенте
Процедура Док_ОплатаНаМестеПосле(Команда)
	
	ОткрытьФорму("Обработка.БезналичнаяОплатаБезПодключенияОборудования.Форма",Новый Структура("ДокументПродажи",Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура Док_КлиентКонтрагентПриИзмененииПосле(Элемент)
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПредложитьПользователюРассчитатьСкидкиЗавершение")
Процедура Док_ПредложитьПользователюРассчитатьСкидкиЗавершение(ОтветНаВопрос, ДополнительныеПараметры)
	
	Отказ = Ложь;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
		Отказ = Ложь;
		ПрименитьИзмененияСкидокНаценокНаКлиенте(Отказ);
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
		#Вставка
		МассивСтрок = Новый Массив;
		Для НомерСтр = 0 по Объект.Товары.Количество()-1 Цикл 
			Стр = Объект.Товары[НомерСтр];
			Если Стр.СуммаАвтоматическойСкидки <> 0 ИЛИ Стр.СуммаБонусныхБалловКСписанию Тогда
				МассивСтрок.Добавить(Стр.КодСтроки);
			КонецЕсли;
			ПересчитатьБонусыВСтрокеНаСервере(МассивСтрок);
		КонецЦикла;
		СуммаВсего = Объект.Товары.Итог("СуммаСНДС");
        #КонецВставки
	Иначе
		Возврат;
	КонецЕсли;
	
	ПередЗаписьюНаКлиентеСервер();
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ЗаполнитьПоказателиЭтаповОплатыКлиент();
	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("АдресТабличнойЧастиТовары")
Функция Док_АдресТабличнойЧастиТовары()
    #Удаление
	Если ИспользоватьРасширенныеВозможностиЗаказаКлиента Тогда
		МассивСтрок = Новый Массив();
		Для Каждого Строка Из Объект.Товары Цикл
			Если Не Строка.КодСтроки = 0 Тогда
				Продолжить;
			КонецЕсли;

			МассивСтрок.Добавить(Строка);
		КонецЦикла;
		ТоварыДляВыгрузки = Объект.Товары.Выгрузить(МассивСтрок);
	Иначе
		ТоварыДляВыгрузки = Объект.Товары.Выгрузить();
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТоварыДляВыгрузки, УникальныйИдентификатор);
	#КонецУдаления
	#Вставка
	Возврат ПоместитьВоВременноеХранилище(Объект.Товары.Выгрузить(), УникальныйИдентификатор);
    #КонецВставки
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьОплатуБонуснымиБалламиЗавершение")
Процедура Док_ДобавитьОплатуБонуснымиБалламиЗавершение(Результат, ДополнительныеПараметры)
	#Удаление	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
		Возврат;
	КонецЕсли;

	ПрименитьОплатуБонуснымиБалламиКлиент(Результат.АдресВоВременномХранилище);

	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	#КонецУдаления
	#Вставка
	Если Не Результат = Неопределено Тогда
		ОплатитьБонуснымиБалламиНаСервере(Результат.АдресВоВременномХранилище);
	КонецЕсли;
    #КонецВставки
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОткрытьПодбор")
Процедура Док_ОткрытьПодбор(Команда)
	#Вставка
	СФП_МаркерыКлиент.МаркерНачало("Реализация открытие подбора товаров (из формы)", Объект.Номер);
    #КонецВставки	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
	"Документ.РеализацияТоваровУслуг.ФормаДокумента.Команда.ОткрытьПодбор");

	Отказ = Ложь;
	Если (ИспользоватьСоглашенияСКлиентами И Не ЗначениеЗаполнено(Объект.Соглашение))
		ИЛИ Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОчиститьСообщения();
		СообщитьОбОшибкахОткрытияПодбора(Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	#Вставка
	ОчиститьРаспределение();
    #КонецВставки	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru = 'реализацию товаров и услуг'"));
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", Объект.Партнер);
	ПараметрыФормы.Вставить("Соглашение", Объект.Соглашение);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	ПараметрыФормы.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ПараметрыФормы.Вставить("ВозвращатьМногооборотнуюТару", Объект.ВернутьМногооборотнуюТару);
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("Валюта", Объект.Валюта);
	ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("РежимПодбораИсключитьГруппыДоступныеВЗаказах", Истина);
	ПараметрыФормы.Вставить("НаправлениеДеятельности", Объект.НаправлениеДеятельности);
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
		ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре()));
		ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",Истина);
	ИначеЕсли РеализацияЧерезКомиссионера Тогда
		ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",Истина);
	КонецЕсли;
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
	ПараметрыФормы.Вставить("ИспользоватьРасширенныеВозможностиЗаказаКлиента", ИспользоватьРасширенныеВозможностиЗаказаКлиента);
	
	#Вставка
	ПараметрыФормы.Вставить("СтруктураКлиента", Новый Структура("Партнер,Контрагент",Объект.Партнер,Объект.Контрагент));
	ПараметрыФормы.Вставить("Подразделение",                           Объект.Подразделение);
    #КонецВставки	

	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьБонусыВТЧ()

	Если НЕ ЗапретИспользованияБонусов() Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Партнер",                   Объект.Партнер);
		ПараметрыОткрытияФормы.Вставить("КартаЛояльности",           Объект.КартаЛояльности);
		ПараметрыОткрытияФормы.Вставить("АдресТабличнойЧастиТовары", АдресТабличнойЧастиТовары());
		ПараметрыОткрытияФормы.Вставить("Валюта",                    Объект.Валюта);
		
		ФормаОплатыББ = ПолучитьФорму("Справочник.БонусныеПрограммыЛояльности.Форма.ОплатаБонуснымиБаллами",
										ПараметрыОткрытияФормы,
										ЭтотОбъект);
		ПоместитьИзХранилищаВТЧ(ФормаОплатыББ.Спр_АдресВХ(ЭтаФорма.УникальныйИдентификатор));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоместитьИзХранилищаВТЧ(АдресВХ)
	Объект.Товары.Загрузить(ПолучитьИзВременногоХранилища(АдресВХ));
КонецПроцедуры

&НаСервере
Функция ЗапретИспользованияБонусов()

	Строка = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	Возврат БонусыАльтерраРезерв.ЗапрещеноИспользоватьБонусы(Строка);

КонецФункции 

&НаСервере
Процедура ПерераспределитьБонусы(СуммаОплатыБонусами = Неопределено)
	ВыборкаБПЛ = БонусныеБаллыСервер.БонуснаяПрограммаКартыЛояльности(Объект.КартаЛояльности);
	ВалютаБонуснойПрограммы 				= ?(ЗначениеЗаполнено(ВыборкаБПЛ.Валюта), ВыборкаБПЛ.Валюта, Константы.ВалютаРегламентированногоУчета.Получить());
	БонуснаяПрограммаЛояльности 			= ВыборкаБПЛ.БонуснаяПрограммаЛояльности;
	СтруктураКурсовВалютыДокумента			= РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, ТекущаяДатаСеанса());
	СтруктураКурсовВалютыБонуснойПрограммы	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаБонуснойПрограммы, ТекущаяДатаСеанса());
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;
	
	ТЧ = Объект.Товары.Выгрузить();
	
	ТабличнаяЧастьТовары = БонусыАльтерраРезерв.ОбработатьТабличнуюЧасть(ТЧ, БонуснаяПрограммаЛояльности,
																			СтруктураКурсовВалютыДокумента,
																			СтруктураКурсовВалютыБонуснойПрограммы,
																			БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту);
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(ТабличнаяЧастьТовары));
	ПараметрыВыполнения.Вставить("СуммаОплатыВБаллах", СуммаОплатыБонусами);
	ПараметрыВыполнения.Вставить("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	ПараметрыВыполнения.Вставить("КурсКонвертацииБонусовВВалюту", БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту);
	ПараметрыВыполнения.Вставить("СтруктураКурсовВалютыБонуснойПрограммы", СтруктураКурсовВалютыБонуснойПрограммы);
	ПараметрыВыполнения.Вставить("СтруктураКурсовВалютыДокумента", СтруктураКурсовВалютыДокумента);
	
	СтрокиСББ = ПолучитьИзВременногоХранилища(БонусыАльтерраРезерв.Спр_АдресВХ(ЭтаФорма.УникальныйИдентификатор, ПараметрыВыполнения));
	Для каждого Стр Из СтрокиСББ Цикл
		Строка = Объект.Товары.НайтиСтроки(Новый Структура("НомерСтроки",Стр.НомерСтроки));
		Если Строка.Количество() > 0 Тогда
			Строка[0].СуммаБонусныхБалловКСписаниюВВалюте = Стр.СуммаБонусныхБалловКСписаниюВВалюте;
			Строка[0].СуммаБонусныхБалловКСписанию = Стр.СуммаБонусныхБалловКСписанию;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, КэшированныеЗначения);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыПроцентРучнойСкидкиПриИзмененииВместо(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураЗаполненияБонусныхБаллов = Неопределено;
	ПроверкаОплатыБонуснымиБаллами(ТекущаяСтрока, СтруктураЗаполненияБонусныхБаллов);
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами", СтруктураЗаполненияБонусныхБаллов);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
	Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	
	Если НЕ Объект.РеализацияПоЗаказам Тогда	
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
		
		Если НовыйПорядокНачисленияБонусов Тогда
			ПерераспределитьБонусы(СуммаОплатыБонусами);
			Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
				ОповеститьОСниженииБонусов();
			КонецЕсли;
		Иначе
			ОчиститьСообщения();
			ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
		КонецЕсли;
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	КонецЕсли;  
	
	//АвтоопределениеДистрибуция
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		АльтерраОбщегоНазначенияКлиент.ПересчитатьЦенуСДоставкойПечатьПоСтроке(Текущаястрока);
	КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыСуммаРучнойСкидкиПриИзмененииВместо(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СтруктураЗаполненияБонусныхБаллов = Неопределено;
	ПроверкаОплатыБонуснымиБаллами(ТекущаяСтрока, СтруктураЗаполненияБонусныхБаллов);

	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами", СтруктураЗаполненияБонусныхБаллов);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
		Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
			
	Если НЕ Объект.РеализацияПоЗаказам Тогда	
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
			
		Если НовыйПорядокНачисленияБонусов Тогда
			ПерераспределитьБонусы(СуммаОплатыБонусами);
			Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
				ОповеститьОСниженииБонусов();
			КонецЕсли;
		Иначе
			ОчиститьСообщения();
			ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
		КонецЕсли;
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	КонецЕсли;
	
	//АвтоопределениеДистрибуция
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		АльтерраОбщегоНазначенияКлиент.ПересчитатьЦенуСДоставкойПечатьПоСтроке(Текущаястрока);
	КонецЕсли; 
	//
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	Строка = Элементы.Товары.ТекущаяСтрока;
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		ОбновитьДанныеПоСтрокеИзЗаказа();
	Иначе
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
		ПерераспределитьБонусы(СуммаОплатыБонусами);
		Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
			ОповеститьОСниженииБонусов();
		КонецЕсли;
	КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект); 
	//АвтоопределениеДистрибуция
	Если Объект.РаспределитьТранспортныеДистрибуция И объект.РеализацияПоЗаказам Тогда 
		ТекСтрока = Элементы.Товары.ТекущиеДанные;
		Коэфф = ПолучитьКоффДляСуммыРТ(ТекСтрока.КодСтроки);	
		Если НЕ Коэфф = Неопределено Тогда
			ТекСтрока.СуммаРТ = ТекСтрока.Сумма*Коэфф; 
		КонецЕсли;
	КонецЕсли;
	РаспределитьТранспортныеДистрибуцияПриИзмененииСтроки();
	//
КонецПроцедуры 

&НаСервере
Функция ПолучитьКоффДляСуммыРТ(КодСтроки)
	СтрокаЗаказа =  Объект.ЗаказКлиента.Товары.НайтиСтроки(Новый Структура("КодСтроки",КодСтроки));   
	Возврат  ?(СтрокаЗаказа.Количество() >0,СтрокаЗаказа[0].СуммаРТ/(СтрокаЗаказа[0].Сумма), Неопределено);
Конецфункции

&НаКлиенте
Процедура Док_ТоварыВидЦеныПриИзмененииПосле(Элемент)
	Если НЕ Объект.РеализацияПоЗаказам Тогда
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
			
		Если НовыйПорядокНачисленияБонусов Тогда	
			ПерераспределитьБонусы(СуммаОплатыБонусами);
			Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
				ОповеститьОСниженииБонусов();
			КонецЕсли;
		Иначе
			ОчиститьСообщения();
			ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
		КонецЕсли;
	КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект); 
	//АвтоопределениеДистрибуция
	РаспределитьТранспортныеДистрибуцияПриИзмененииСтроки(); 
	//
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтменитьОплатуБонуснымиБалламиПосле(Команда)
	Если НЕ Объект.РеализацияПоЗаказам Тогда
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
		ОчиститьСообщения();
		ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенПосле(Команда)
	Если НЕ Объект.РеализацияПоЗаказам Тогда
		СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
		ОчиститьБонусыСервер();
			
		Если НовыйПорядокНачисленияБонусов Тогда	
			ПерераспределитьБонусы(СуммаОплатыБонусами);
			Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
				ОповеститьОСниженииБонусов();
			КонецЕсли;
		Иначе
			ОчиститьСообщения();
			ОповещениеОбОчисткеБонусов(СуммаОплатыБонусами);
		КонецЕсли;
	КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗаполнитьЦеныПоСоглашениюВместо(Команда)
		
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	Если ЦеныПредприятияЗаполнениеКлиент.НеобходимоЗаполнениеЦенПоСоглашению(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Если РеализацияСверхЗаказа И НЕ ОтклонениеОтУсловийПродаж Тогда
			Если Объект.РеализацияПоЗаказам И Объект.Товары.Итог("РасхождениеЗаказ") = 0 Тогда
				ТекстПредупреждения = НСтр("ru='Цена не может быть назначена в строках по заказу.'");
				ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
				Возврат
			КонецЕсли;
		КонецЕсли;

		ОчиститьСообщения();
		ПрименитьОплатуБонуснымиБаллами(ОтправитьВоВременноеХранилище());
			

		ТекстОшибки = "";
		ЦеныРассчитаны = ЗаполнитьЦеныПоСоглашениюСервер(,, ТекстОшибки);
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоСоглашению(ЦеныРассчитаны, ТекстОшибки);
		
	КонецЕсли;
	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	Если Не Объект.РеализацияПоЗаказам Тогда
		Если НовыйПорядокНачисленияБонусов Тогда
			ОчиститьБонусыСервер();	
			ПерераспределитьБонусы(СуммаОплатыБонусами);
			Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
				ОповеститьОСниженииБонусов();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ОтправитьВоВременноеХранилище()

	Возврат ПоместитьВоВременноеХранилище(Объект.Товары.Выгрузить());

КонецФункции 

&НаСервере
Процедура ОповещениеОбОчисткеБонусов(СуммаБонусныхБаллов)
	Если СуммаБонусныхБаллов > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Оплата бонусными баллами отменена. При необходимости, оплату бонусными баллами можно назначить заново (""Цены и скидки / Добавить оплату бонусными баллами).""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение")
Процедура Док_ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение2(ВидЦен, ДополнительныеПараметры)
	
	#Вставка
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	#КонецВставки
	
	Если ЗначениеЗаполнено(ВидЦен) Тогда
		
		МассивСтрок = Новый Массив;
		
		Для Каждого ТекСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
			НайденнаяСтрока = Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
			Если ?(РеализацияСверхЗаказа, НайденнаяСтрока.КодСтроки = 0, Истина) Тогда
				МассивСтрок.Добавить(НайденнаяСтрока);
			КонецЕсли;
		КонецЦикла;
			
		Если МассивСтрок.Количество() = 0
			И РеализацияСверхЗаказа И НЕ ОтклонениеОтУсловийПродаж 
			И Объект.РеализацияПоЗаказам Тогда
			
			ТекстПредупреждения = НСтр("ru='Цена не может быть назначена в строках по заказу.'");
			ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
			Возврат
		КонецЕсли;
		
		ОчиститьСообщения();
		#Удаление
		ПрименитьОплатуБонуснымиБалламиКлиент(, Истина);
		#КонецУдаления

		ЦеныРассчитаны = ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенСервер(ВидЦен);
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦен);
		
		СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		
	КонецЕсли;
	
	#Вставка
	Если Не Объект.РеализацияПоЗаказам Тогда
		Если НовыйПорядокНачисленияБонусов Тогда
			ОчиститьБонусыСервер();	
			ПерераспределитьБонусы(СуммаОплатыБонусами);
			Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
				ОповеститьОСниженииБонусов();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("НазначитьАвтоматическиеСкидкиЗавершение")
Процедура Док_НазначитьАвтоматическиеСкидкиЗавершение(ВозвращенноеЗначение, ДополнительныеПараметры)

	#Вставка
	СуммаОплатыБонусами = Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	#КонецВставки
	Если ВозвращенноеЗначение <> Неопределено Тогда

		ОчиститьСообщения();
		#Удаление
		ПрименитьОплатуБонуснымиБалламиКлиент(, Истина);
		#КонецУдаления

		УправляемыеСкидки = ВозвращенноеЗначение;

		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
		СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
		СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
		СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
		СтруктураПараметры.Вставить("РеализацияСверхЗаказа", РеализацияСверхЗаказа И Объект.РеализацияПоЗаказам);

		СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
		Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
			ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
		КонецЕсли;

		ПоказатьОповещениеПользователя(
		НСтр("ru = 'Скидки (наценки)'"),
		,
		НСтр("ru = 'Скидки (наценки) рассчитаны'"),
		БиблиотекаКартинок.Информация32);

	КонецЕсли;
	#Вставка
	Если Не Объект.РеализацияПоЗаказам Тогда
		Если НовыйПорядокНачисленияБонусов Тогда
			ОчиститьБонусыСервер();	
			ПерераспределитьБонусы(СуммаОплатыБонусами);
			Если Объект.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте")<СуммаОплатыБонусами Тогда
				ОповеститьОСниженииБонусов();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	#КонецВставки

КонецПроцедуры

&НаСервере
Процедура ОповеститьОСниженииБонусов()

	Сообщить("Сумма бонусных баллов к списанию уменьшена!");

КонецПроцедуры // ОповеститьОСниженииБонусов()


&НаКлиенте
Процедура Док_ОтправитьСМСОГотовностиПосле(Команда)
	Док_ОтправитьСМСОГотовностиПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура Док_ОтправитьСМСОГотовностиПослеНаСервере()
	ОтправитьСМС(СтрШаблон("Реализация № %1 Ждем Вас: %2", Объект.Номер, Объект.Склад.Подразделение.Адрес), НомерТелефонаПартнера);
КонецПроцедуры

&НаСервере
Процедура ОтправитьСМС(ТекстСообщения, ТелефонПартнера) 
	
	Если ЗначениеЗаполнено(ТелефонПартнера) Тогда  
		НомерТелефонаПартнера = АльтерраОбщегоНазначения.ПолчитьТелефонБезКода(ТелефонПартнера);
		Если СтрДлина(НомерТелефонаПартнера) = 10 Тогда
			СтрокаНомерТелефона = "+7" + Строка(НомерТелефонаПартнера);
			АльтерраОбщегоНазначения.ОтправитьСМС(СтрокаНомерТелефона, ТекстСообщения);
			Сообщить("СМС сообщение отправлено");
		Иначе 
			Сообщить("Некорректный номер телефона");
		КонецЕсли;
	Иначе 
		Сообщить("Телефонный номер пуст");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерТелефонаПартнера()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ Первые 1
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ПартнерыКонтактнаяИнформация.Тип КАК Тип,
		|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка = &Ссылка
		|	И ПартнерыКонтактнаяИнформация.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Партнер);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерТелефона;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Процедура Док__ЗаполнитьНарезкуПоЗаказуПослеНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаНарезка.НомерСтроки
		|ИЗ
		|	Документ.ЗаказКлиента.Нарезка КАК ЗаказКлиентаНарезка
		|ГДЕ
		|	ЗаказКлиентаНарезка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЗаказКлиента.Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Объект.Нарезка.Загрузить(Объект.ЗаказКлиента.Нарезка.Выгрузить());
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаполнитьНарезкуПоЗаказуПосле(Команда)
	Док__ЗаполнитьНарезкуПоЗаказуПослеНаСервере();
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПрименитьОплатуБонуснымиБаллами")
Процедура Док_ПрименитьОплатуБонуснымиБаллами(АдресВоВременномХранилище, ВыводитьСообщение)

	УдалениеОплаты = Ложь;
	Если АдресВоВременномХранилище <> Неопределено Тогда
		ТаблицаТоваров = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	Иначе
		Если Не ОплатаБонуснымиБаллами Тогда
			Возврат;
		КонецЕсли;
		ТаблицаТоваров = Объект.Товары;
		УдалениеОплаты = Истина;
	КонецЕсли;

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());

	ОбрабатываемыеСтроки = Новый Массив;

	КорректировкаВыполнена = Ложь;
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл

		Если УдалениеОплаты Тогда
			Если СтрокаТаблицы.КодСтроки <> 0
				Или (СтрокаТаблицы.СуммаБонусныхБалловКСписанию = 0 
				И СтрокаТаблицы.СуммаБонусныхБалловКСписаниюВВалюте = 0) Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТЧ = СтрокаТаблицы;
			СтрокаТЧ.СуммаБонусныхБалловКСписанию        = 0;
			СтрокаТЧ.СуммаБонусныхБалловКСписаниюВВалюте = 0; 
			#Вставка
				БонусыАльтерраРезерв.ОчиститьБонусыПоСтроке(СтрокаТаблицы)			
			#КонецВставки
		Иначе
			СтрокаТЧ = Объект.Товары.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаТаблицы.КлючСвязи))[0];
			СтрокаТЧ.СуммаБонусныхБалловКСписанию        = СтрокаТаблицы.СуммаБонусныхБалловКСписанию;
			СтрокаТЧ.СуммаБонусныхБалловКСписаниюВВалюте = СтрокаТаблицы.СуммаБонусныхБалловКСписаниюВВалюте;
		КонецЕсли;

		ОбрабатываемыеСтроки.Добавить(СтрокаТЧ);

		КорректировкаВыполнена = Истина;

	КонецЦикла;

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
	ОбрабатываемыеСтроки,
	СтруктураДействий,
	Объект.Товары);

	Если КорректировкаВыполнена Тогда

		ОплатаБонуснымиБаллами = Не УдалениеОплаты;
		Объект.СкидкиРассчитаны = Ложь;

		РассчитатьИтоговыеПоказатели(ЭтотОбъект);

		Если ВыводитьСообщение Тогда
			Если УдалениеОплаты Тогда
			#Удаление
				ТекстСообщения = НСтр("ru = 'Оплата бонусными баллами отменена. При необходимости, оплату бонусными баллами можно назначить заново (""Цены и скидки / Добавить оплату бонусными баллами"").'");
			#КонецУдаления
			#Вставка
            	ТекстСообщения = НСтр("ru = 'Списанные бонусные баллы очищены, для повторного списания воспользуйтесь командой ""Бонусы Оплатить""'");
			#КонецВставки
			Иначе
				ТекстСообщения = НСтр("ru = 'Оплата бонусными баллами распределена.'");
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
&После("НазначитьРучнуюСкидкуЗавершение")
Процедура Док_НазначитьРучнуюСкидкуЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры)
	ПрименитьОплатуБонуснымиБаллами(, Истина);
КонецПроцедуры
#КонецОбласти


#Область АвтоопределениеДистрибуция

&НаКлиенте
Процедура Док_ВызватьРаспределениеТранспортныхДистрибуцияПеред(Команда)
	
    Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		СнятьРаспределениеТранспортныхДистрибуция();
	Иначе   
		Если НЕ ЗначениеЗаполнено(Объект.Тариф) Тогда
			Сообщить("Не определен тариф, транспортные распределены не будут. Выберите объект доставки");
			Объект.РаспределитьТранспортныеДистрибуция = Ложь;
			Возврат;
		КонецЕсли;
		РаспределитьТранспортныеДистрибуция();
	КонецЕсли; 
	Объект.РаспределитьТранспортныеДистрибуция = Не Объект.РаспределитьТранспортныеДистрибуция;
   	УстановитьВидимостьПоРаспределитьТранспортные();
КонецПроцедуры

&НаКлиенте
Процедура СнятьРаспределениеТранспортныхДистрибуция()
	
	Если НЕ Объект.РаспределитьТранспортныеДистрибуция ИЛИ Объект.РеализацияПоЗаказам Тогда
		Возврат;
	КонецЕсли; 
	
	ИзменитьУслугуДоставки(1);
	АльтерраОбщегоНазначенияКлиент.СнятьРаспределениеТранспортныхДистрибуция(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроки() 
	АльтерраОбщегоНазначенияКлиент.ПересчитатьСтроки(Объект);
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьТранспортныеДистрибуцияПриИзмененииСтроки()
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		ТекСтрока = Элементы.Товары.ТекущиеДанные; 
		Если ТекСтрока.Цена >0  И ТекСтрока.Количество > 0 Тогда 
			РаспределитьТранспортныеДистрибуция();
		КонецЕсли;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьТранспортныеДистрибуция()
	Если Объект.РеализацияПоЗаказам Тогда
		Возврат;
	КонецЕсли;
	СтоимостьДоставки  = РаспределитьТранспортныеДистрибуцияНаСервере(); 
	ИзменитьУслугуДоставки(СтоимостьДоставки);  
КонецПроцедуры 
	
 &НаСервере
 функция РаспределитьТранспортныеДистрибуцияНаСервере()  
 	Результат = УправлениеЛогистикойСервер.РаспределениеСтоимостиДоставкиДистрибуция(Объект);
 	ТранспортныеИтог = Результат.ТранспортныеИтог;
    Возврат	 Результат.СтоимостьДоставки;
 КонецФункции
 
&НаКлиенте
Процедура УстановитьВидимостьРеквизитовДоставкиДистрибуция() 
		
	КлиентДистрибуцииИлиКоммерческого = АльтерраОбщегоНазначения.КлиентДистрибуцииИлиКоммерческого(Объект.Партнер);
	ВидимостьАвтоопределениеДистрибуция = КлиентДистрибуцииИлиКоммерческого И Не Объект.РеализацияПоЗаказам;
	
    Элементы.ОбъектДоставки.Видимость    = ВидимостьАвтоопределениеДистрибуция;
    Элементы.Тариф.Видимость             = ВидимостьАвтоопределениеДистрибуция;
	Элементы.ТарифЗаКГ.Видимость         = ВидимостьАвтоопределениеДистрибуция;  
	Элементы.ТоварыВызватьРаспределениеТранспортныхДистрибуция.Видимость = ВидимостьАвтоопределениеДистрибуция; 
	Если  Элементы.СтраницаДоставка.Видимость = Ложь Тогда
	    Элементы.СтраницаДоставка.Видимость = ВидимостьАвтоопределениеДистрибуция;   
	КонецЕсли;
	УстановитьВидимостьПоРаспределитьТранспортные();
КонецПроцедуры

&НаСервере
Процедура ИзменитьУслугуДоставки(СтоимостьДоставки)
	АльтерраОбщегоНазначения.ИзменитьУслугуДоставки(Объект, СтоимостьДоставки);	 
КонецПроцедуры

&НаСервере
Функция ОпределитьТарифДистрибуция()
	Возврат УправлениеЛогистикойСервер.ОпределитьТарифДистрибуция(Объект, Объект.ПрибытиеНаОтгрузку, Объект.Подразделение);
КонецФункции

&НаКлиенте
Процедура Док_ПартнерПриИзмененииПеред(Элемент)
    ОчиститьРеквизитыДоставкиДистрибуция();
	УстановитьВидимостьРеквизитовДоставкиДистрибуция();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыДоставкиДистрибуция() 
	
	Если  Объект.РеализацияПоЗаказам Тогда  
		Возврат;
	КонецЕсли; 
	
	Объект.ОбъектДоставки = ПредопределенноеЗначение("Справочник.ОбъектыДоставки.ПустаяСсылка");
	Объект.Тариф = ПредопределенноеЗначение("Справочник.ТарифыПеревозчиков.ПустаяСсылка");
	Объект.ТарифЗаКг = 0;
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		 СнятьРаспределениеТранспортныхДистрибуция();
		 Объект.РаспределитьТранспортныеДистрибуция = Ложь;
		 УстановитьВидимостьПоРаспределитьТранспортные();
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьПоРаспределитьТранспортные()  
	Элементы.ТоварыЦенаСДоставкойПечать.Видимость = Объект.РаспределитьТранспортныеДистрибуция;
	Элементы.ТоварыСуммаРучнойСкидки.Видимость = Объект.РаспределитьТранспортныеДистрибуция;
	Элементы.ТранспортныеИтог.Видимость = Объект.РаспределитьТранспортныеДистрибуция И НЕ Объект.РеализацияПоЗаказам; 
	Элементы.ТоварыПроцентТранспортных.Видимость = Объект.РаспределитьТранспортныеДистрибуция;
	Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		Элементы.ТоварыВызватьРаспределениеТранспортныхДистрибуция.Заголовок = "Снять распределение транспортных дистрибуция";
	Иначе
		Элементы.ТоварыВызватьРаспределениеТранспортныхДистрибуция.Заголовок = "Распределить транспортные дистрибуция";
	Конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыЦенаПриИзмененииПосле(Элемент)
   //АвтоопределениеДистрибуция
   РаспределитьТранспортныеДистрибуцияПриИзмененииСтроки();
   //
КонецПроцедуры


&НаКлиенте
&После("ОбработкаВыбораПодборНаКлиенте")
Процедура Док_ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	Если Объект.РаспределитьТранспортныеДистрибуция И Не Объект.РеализацияПоЗаказам Тогда 
	    РаспределитьТранспортныеДистрибуция();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ОбъектДоставкиПриИзмененииПосле(Элемент)
	Результат = ОпределитьТарифДистрибуция();
	Объект.Тариф = Результат.Тариф;
	Объект.ТарифЗаКг = Результат.ТарифЗаКг;
	Если Объект.ТарифЗаКг = 0 Тогда
		Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		   СнятьРаспределениеТранспортныхДистрибуция();
		КонецЕсли;
		Сообщить("Не удалось определить тариф по выбранному объекту доставки");
	Иначе 
		Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		   РаспределитьТранспортныеДистрибуция();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КонтрольУслугиДоставкиПриНеполнойОтгрузке()
	Документы.РеализацияТоваровУслуг.КонтрольУслугиДоставкиПриНеполнойОтгрузке(Объект);
КонецПроцедуры 

#КонецОбласти

#Область ДинамическиеСсылки

&НаКлиенте
Процедура Док_ПринятьОплатуПоСсылкеПосле(Команда)
	
	Если Не Объект.Проведен Или ЭтаФорма.Модифицированность Тогда           
		Сообщить("Реализация должна быть проведена для оплаты по ссылке");                   
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Кассир) Тогда           
		Сообщить("Установлена отметка кассы, оплата по ссылке не возможна");                   
		Возврат;
	КонецЕсли;
	
	СсылкаОплаты = ОткрытьАктивированнуюСсылку();   

	Если ЗначениеЗаполнено(СсылкаОплаты) Тогда
		ЗапуститьПриложение(СсылкаОплаты);
	КонецЕсли;
	
КонецПроцедуры                     

&НаСервере
Функция ОткрытьАктивированнуюСсылку()   
	
	СсылкаОплаты = ИнтеграцияБанки.ПолучитьАктивированнуюДинамическуюСсылку(Объект.Ссылка).Ответ.СсылкаОплаты;         
	
	Если Не ЗначениеЗаполнено(СсылкаОплаты) Тогда
		
		РезультатАктивации = ИнтеграцияБанки.АктивироватьДинамическуюСсылку(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.ТипДинамическойСсылки.КартаСБП"));	
		
		Если РезультатАктивации.Результат Тогда  
			СсылкаОплаты = РезультатАктивации.Ответ.СсылкаОплаты;
		Иначе
			Сообщить(РезультатАктивации.Сообщение);
		КонецЕсли;
	КонецЕсли;  
	
	Возврат СсылкаОплаты;
	
КонецФункции

&НаСервере
Функция	ПереактивироватьСсылкуНаОплату()
	
	Если ИнтеграцияБанки.НужнаПереактивацияДинамическойСсылки(Объект.Ссылка).Результат Тогда
		
		РезультатАктивации = ИнтеграцияБанки.АктивироватьДинамическуюСсылку(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.ТипДинамическойСсылки.КартаСБП"));	
		Если Не РезультатАктивации.Результат Тогда
			Сообщить(РезультатАктивации.Сообщение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции	

#КонецОбласти