#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормыЭлемента

// Обработчик события ПриОткрытии формы элемента справочника Договоры
//
// Параметры:
//  Отказ - Булево - признак отказа.
//  Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПриОткрытии(Отказ, Форма) Экспорт
	//++ Локализация

	//-- Локализация
КонецПроцедуры

// Обработчик события ОбработкаОповещения формы элемента справочника Договоры
//
// Параметры:
//  ИмяСобытия - Строка - см. описание платформенного метода ОбработкаОповещения
//  Параметр - ЛюбаяСсылка - см. описание платформенного метода ОбработкаОповещения
//  Источник - ЛюбаяСсылка - см. описание платформенного метода ОбработкаОповещения
//  Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется процедура.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник, Форма) Экспорт
	//++ Локализация
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура ОбработкаНавигационнойСсылкиФормы(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
	СтандартнаяОбработка = Ложь;

	//-- Локализация
КонецПроцедуры

// Обработчик события изменения
// 
// Параметры:
//     Элемент - ПолеФормы - Изменившийся элемент.
//     Форма - ФормаКлиентскогоПриложения - Форма.
//
Процедура ПриИзмененииРеквизита(Элемент, Форма) Экспорт
	//++ Локализация


	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыЭлемента

Процедура ВыполнитьКомандуЛокализации(Команда, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиКомандФормы_Контрагенты_Служебные

//++ Локализация


//-- Локализация
#КонецОбласти

#КонецОбласти
