
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

    Если Параметры.Свойство("Сотрудник") Тогда
       Исполнитель = Параметры.Сотрудник;
       //ДляТеста
       Если Исполнитель.Отдел = Справочники.Отделы.НайтиПоНаименованию("ИТ отдел") Тогда
           Элементы.ОбновитьСписокДляТеста.Видимость =Истина;
           Элементы.ОтключитьОбновлениеСпискаДляТеста.Видимость = Истина;
       КонецЕсли;  
       //
   КонецЕсли;
   
   Если Параметры.Свойство("ИмяКоманды") Тогда
	   ИмяКоманды = Параметры.ИмяКоманды;
   КонецЕсли;
   
   Если Параметры.Свойство("РольМобильногоКлиента") Тогда
	   РольМобильногоКлиента = Параметры.РольМобильногоКлиента;
   КонецЕсли;
   
    ТекущийПользователь = Пользователи.ТекущийПользователь();
		
    Если Не ЗначениеЗаполнено(Исполнитель) Тогда
        #Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
            Отказ = Истина;
        #Иначе
            Сотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь",ТекущийПользователь);
            Если ЗначениеЗаполнено(Сотрудник) Тогда
            Исполнитель = Сотрудник;
        Иначе
            Сообщить("У пользователя нет карточки сотрудника!");
            Отказ = Истина;
            КонецЕсли;
        #КонецЕсли
    КонецЕсли;
    
    Дата = Текущаядата();
    ДатаСортировки = "Дата";
    
    ДатаПоступления.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	ДатаОтгрузки.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	ДатаПересчета.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	
	СостояниеОтгрузки = "ОжидаетсяОтбор";   //ОжидаетсяОтбор
	СостояниеПоступленияФильтр = "КПриемке";
	ОтборОрдеровПоСотруднику = Ложь; 
	
	Склад = Исполнитель.Склад;
	Секции.ЗагрузитьЗначения(Исполнитель.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток"));
	
	ИспользуетсяОтгрузкаПоНакладным = АльтерраОбщегоНазначения.ОтгрузкаПоНакладным(ТекущаяДата(),Склад);

	Если АльтерраОбщегоНазначения.ПолучитьОграничениеДоступностиОстатков() Тогда
		Для каждого Секция Из Секции Цикл
			Если Секция.Значение.СкрытьКоличествоПоУчету Тогда
				Элементы.ПроверитьОстатки.Заголовок = "Карточка товара с АХ";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Подключение оповещений из очереди
	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = Исполнитель.ОповещенияИзОчереди; 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;
	Для каждого Стр Из Секции Цикл
		ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
		Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
			Инт = ЗнчИнтервала;
		КонецЕсли; 
	КонецЦикла; 
	ИнтервалОповещений = Инт;   
	
	Если Параметры.Свойство("ОткрытьОчередь") Тогда 
		ОтрытьСписокОчереди = Истина;
	Иначе
		ОтрытьСписокОчереди = Ложь; 
	КонецЕсли;
 
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьНужныйСписок(ИмяКоманды) 
	
	Если ИмяКоманды = "Приемка" Тогда
		ЗаполняемДинамическийСписокПриемка(); 
	ИначеЕсли ИмяКоманды = "Отгрузка" Тогда 
		ЗаполняемДинамическийСписокОтгрузка(); 
	ИначеЕсли ИмяКоманды = "Пересчет" Тогда
		ЗаполняемДинамическийСписокПересчет(); 
	ИначеЕсли ИмяКоманды = "ПроверкаЦенников" Тогда   
		ЗаполняемДинамическийСписокПроверкаЦенников(); 
	ИначеЕсли ИмяКоманды = "ИзучениеАссортимента" Тогда  
		ЗаполняемДинамическийСписокИзучениеАссортимента(); 
		СгруппироватьПоТипу();
	ИначеЕсли ИмяКоманды = "ПриемкаСдачаРабот" Тогда
		ЗаполняемДинамическийСписокПриемкаСдачаРабот();
	КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполняемДинамическийСписокПриемкаСдачаРабот()
	ДокументыПриемкаСдачаРабот.ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ПриемкаСдачаВыполненныхРаботУслуг.Дата КАК Дата,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Ссылка КАК Ссылка,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Заказчик КАК Заказчик,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подрядчик КАК Подрядчик,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.ПриемкаСдачаВыполненныхРаботУслуг КАК ПриемкаСдачаВыполненныхРаботУслуг
	|ГДЕ
	|	ПриемкаСдачаВыполненныхРаботУслуг.Дата Между &ДатаНачало и &ДатаКонец
	|	И ПриемкаСдачаВыполненныхРаботУслуг.Подразделение = &Подразделение";
	УстанавливаемЗначенияПараметровДинамическихСписковПриемкаСдачаРабот();
КонецПроцедуры

&НаСервере
Процедура ЗаполняемДинамическийСписокПриемка() 
	ОрдераВРаботе.ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	ЖурналДокументовСкладскиеОрдера.Ссылка КАК Ссылка,
	|	ЖурналДокументовСкладскиеОрдера.Дата КАК Дата,
	|	ЖурналДокументовСкладскиеОрдера.ПометкаУдаления КАК ПометкаУдаления,
	|	ЖурналДокументовСкладскиеОрдера.Номер КАК Номер,
	|	ЖурналДокументовСкладскиеОрдера.Проведен КАК Проведен,
	|	ЖурналДокументовСкладскиеОрдера.Склад КАК Склад,
	|	ЖурналДокументовСкладскиеОрдера.Статус КАК Статус,
	|	ЖурналДокументовСкладскиеОрдера.ПомещениеОтправитель КАК ПомещениеОтправитель,
	|	ЖурналДокументовСкладскиеОрдера.ПомещениеПолучатель КАК ПомещениеПолучатель,
	|	ЖурналДокументовСкладскиеОрдера.Приоритет КАК Приоритет,
	|	ЖурналДокументовСкладскиеОрдера.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЖурналДокументовСкладскиеОрдера.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ЖурналДокументовСкладскиеОрдера.ОтгрузкаПоЗаданиюНаПеревозку КАК ОтгрузкаПоЗаданиюНаПеревозку,
	|	ЖурналДокументовСкладскиеОрдера.Комментарий КАК Комментарий,
	|	ЖурналДокументовСкладскиеОрдера.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ЖурналДокументовСкладскиеОрдера.ПорядокДоставки КАК ПорядокДоставки,
	|	ЖурналДокументовСкладскиеОрдера.Тип КАК Тип
	|ИЗ
	|	ЖурналДокументов.СкладскиеОрдера КАК ЖурналДокументовСкладскиеОрдера
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ЖурналДокументовСкладскиеОрдера.Ссылка) = ТИП(Документ.ПриходныйОрдерНаТовары)
	|	И ЖурналДокументовСкладскиеОрдера.Дата >= &ДатаПоступленияНачало
	|	И ЖурналДокументовСкладскиеОрдера.Дата <= &ДатаПоступленияОкончание
	|	И ЖурналДокументовСкладскиеОрдера.Ссылка.РабочийУчасток в (&РабочиеУчастки)
	|	И ЖурналДокументовСкладскиеОрдера.Склад = &Склад"; 
	
	
	РаспоряженияНаПоступление.ТекстЗапроса=	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыКПоступлению.ДокументПоступления КАК ДокументПоступления
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|ГДЕ
	|	ТоварыКПоступлению.Период МЕЖДУ &ДатаПоступленияНачало И &ДатаПоступленияОкончание
	|	  И ТоварыКПоступлению.Склад = &Склад
    |	  И НЕ(ТоварыКПоступлению.ДокументПоступления ССЫЛКА Документ.ЗаказНаПеремещение
    |     ИЛИ ТоварыКПоступлению.ДокументПоступления ССЫЛКА Документ.ЗаказНаСборку
    |     ИЛИ (ТоварыКПоступлению.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
    |     	И ВЫРАЗИТЬ(ТоварыКПоступлению.ДокументПоступления КАК Документ.ЗаказПоставщику).Договор.ВариантПриемкиТоваров
    |            = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным))
    |    )
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.ДокументПоступления КАК ДокументПоступления,
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель КАК Отправитель,
	|	ТоварыКПоступлениюОстаткиНаДату.Склад КАК Склад,
	|	ТоварыКПоступлениюОстаткиНаДату.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТоварыКПоступлениюОстаткиНаДату.Назначение КАК Назначение,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК ЯчейкаРабочийУчасток,
	|	ТоварыКПоступлениюОстаткиНаДату.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстаткиНаДату.Характеристика КАК Характеристика,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеров
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КОформлениюОрдеровПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюПоступленийПоОрдерам
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КОформлениюПоступленийПоОрдерамПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ТоварыКПоступлениюОстаткиНаДату.Принимается
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПринимаетсяПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеров
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КОформлениюОрдеровРасход,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюПоступленийПоОрдерам
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КОформлениюПоступленийПоОрдерамРасход,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ТоварыКПоступлениюОстаткиНаДату.Принимается
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПринимаетсяРасход
	|ПОМЕСТИТЬ ТоварыКПоступлениюОстаткиНаДату
	|ИЗ
	|	Распоряжения КАК Распоряжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлениюОстаткиНаДату
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|			ПО ТоварыКПоступлениюОстаткиНаДату.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|				И ТоварыКПоступлениюОстаткиНаДату.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|				И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|		ПО Распоряжения.ДокументПоступления = ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&РабочиеУчастки)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ

	|СГРУППИРОВАТЬ ПО
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель,
	|	ТоварыКПоступлениюОстаткиНаДату.Склад,
	|	ТоварыКПоступлениюОстаткиНаДату.ХозяйственнаяОперация,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ТоварыКПоступлениюОстаткиНаДату.Номенклатура,
	|	ТоварыКПоступлениюОстаткиНаДату.Характеристика,
	|	ТоварыКПоступлениюОстаткиНаДату.Назначение,
	|	Распоряжения.ДокументПоступления

	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	ДокументПоступления,
	|	Отправитель,
	|	ХозяйственнаяОперация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель КАК Отправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Контрагент
	|		ИНАЧЕ ТоварыКПоступлениюОстаткиНаДату.Отправитель
	|	КОНЕЦ КАК ОтправительКонтрагент,
	|	ТоварыКПоступлениюОстаткиНаДату.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТоварыКПоступлениюОстаткиНаДату.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстаткиНаДату.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстаткиНаДату.ЯчейкаРабочийУчасток КАК ЯчейкаРабочийУчасток,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНазначение,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.СоглашенияСПоставщиками
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Справочник.СоглашенияСПоставщиками).Номер КАК СТРОКА(11))
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Справочник.ДоговорыКонтрагентов).Номер КАК СТРОКА(11))
	|		ИНАЧЕ ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.СоглашенияСПоставщиками
	|			ТОГДА ВЫРАЗИТЬ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Справочник.СоглашенияСПоставщиками).Дата
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ВЫРАЗИТЬ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Справочник.ДоговорыКонтрагентов).Дата
	|		ИНАЧЕ ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Дата
	|	КОНЕЦ КАК Дата,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.СоглашенияСПоставщиками
	|				ИЛИ ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(РеестрДокументов.НомерПервичногоДокумента, """")
	|	КОНЕЦ КАК НомерВходящегоДокумента,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.СоглашенияСПоставщиками
	|				ИЛИ ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ЕСТЬNULL(РеестрДокументов.ДатаПервичногоДокумента, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаВходящегоДокумента,
	|	ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления) КАК ТипДокумента,    
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход > ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход
	|				И ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КПриемке,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход - ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход > 0
	|				И ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПринятЧастично,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход <= ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход
	|				И ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Принят,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяПриход > ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяРасход
	|				И ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Принимается,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход - ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход - (ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяПриход - ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяРасход) < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Перепоставка,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления) = ТИП(Документ.КорректировкаРеализации)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления) = ТИП(Документ.ЧекККМВозврат)
	|					ТОГДА ВЫБОР
	|							КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	КОНЕЦ КАК ОтметкаКассы
	|ПОМЕСТИТЬ ВТ_Распоряжения
	|ИЗ
	|	ТоварыКПоступлениюОстаткиНаДату КАК ТоварыКПоступлениюОстаткиНаДату
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления = РеестрДокументов.Ссылка
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|;                                                                                       

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Распоряжения.Распоряжение КАК Распоряжение,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Распоряжения.Распоряжение.СуммаДокумента, 0) КАК ЧИСЛО(15, 2)) КАК СуммаДокумента,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Распоряжения.Распоряжение.Комментарий, """") КАК СТРОКА(1024)) КАК Комментарий,
	|	ВТ_Распоряжения.Отправитель КАК Отправитель,
	|	ВТ_Распоряжения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТ_Распоряжения.Номер КАК Номер,
	|	ВТ_Распоряжения.Дата КАК Дата,
	|	ВТ_Распоряжения.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ВТ_Распоряжения.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ВТ_Распоряжения.ЯчейкаРабочийУчасток КАК РабочийУчасток,
	|	МАКСИМУМ(ВТ_Распоряжения.КПриемке) КАК КПриемке,
	|	МАКСИМУМ(ВТ_Распоряжения.ПринятЧастично) КАК ПринятЧастично,
	|	МИНИМУМ(ВТ_Распоряжения.Принят) КАК Принят,
	|	МАКСИМУМ(ВТ_Распоряжения.Принимается) КАК Принимается,
	|	МАКСИМУМ(ВТ_Распоряжения.Перепоставка) КАК Перепоставка,
	|	ВТ_Распоряжения.ОтметкаКассы КАК ОтметкаКассы,
	|	ВТ_Распоряжения.ТипДокумента КАК ТипДокумента,
	|	ВТ_Распоряжения.ОтправительКонтрагент КАК ОтправительКонтрагент,
	|	МАКСИМУМ(ВТ_Распоряжения.ЕстьНазначение) КАК ЕстьНазначение,
	|	Рейсы.Ссылка КАК Рейс,
	|	ЛОЖЬ КАК ДляУсловногоОформления
	|ИЗ
	|	ВТ_Распоряжения КАК ВТ_Распоряжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка КАК Ссылка,
	|			ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи КАК ДокументПродажи
	|		ИЗ
	|			Документ.ЗаданиеНаПеревозкуРейс.РасчетДоставки КАК ЗаданиеНаПеревозкуРейсРасчетДоставки
	|		ГДЕ
	|			ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.Проведен = ИСТИНА
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			РейсОтПоставщикаРасчетДоставки.Ссылка,
	|			РейсОтПоставщикаРасчетДоставки.ДокументОснование
	|		ИЗ
	|			Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|		ГДЕ
	|			РейсОтПоставщикаРасчетДоставки.Ссылка.Проведен = ИСТИНА
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			РейсСиламиПоставщикаОснования.Ссылка,
	|			РейсСиламиПоставщикаОснования.Документ
	|		ИЗ
	|			Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
	|		ГДЕ
	|			РейсСиламиПоставщикаОснования.Ссылка.Проведен = ИСТИНА) КАК Рейсы
	|		ПО ВТ_Распоряжения.Распоряжение = Рейсы.ДокументПродажи

	|СГРУППИРОВАТЬ ПО
	|	ВТ_Распоряжения.Распоряжение,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Распоряжения.Распоряжение.СуммаДокумента, 0) КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Распоряжения.Распоряжение.Комментарий, """") КАК СТРОКА(1024)),
	|	ВТ_Распоряжения.Отправитель,
	|	ВТ_Распоряжения.ХозяйственнаяОперация,
	|	ВТ_Распоряжения.ЯчейкаРабочийУчасток,
	|	ВТ_Распоряжения.ОтметкаКассы,
	|	ВТ_Распоряжения.ТипДокумента,
	|	ВТ_Распоряжения.Дата,
	|	ВТ_Распоряжения.ДатаВходящегоДокумента,
	|	ВТ_Распоряжения.Номер,
	|	ВТ_Распоряжения.НомерВходящегоДокумента,
	|	ВТ_Распоряжения.ОтправительКонтрагент,
	|	Рейсы.Ссылка

	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер,
	|	ТипДокумента";
	УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
КонецПроцедуры  

&НаСервере
Процедура ЗаполняемДинамическийСписокОтгрузка()
	
	ОрдераВРаботеОтгрузка.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЖурналДокументовСкладскиеОрдера.Ссылка КАК Ссылка,
	|	ЖурналДокументовСкладскиеОрдера.Дата КАК Дата,
	|	ЖурналДокументовСкладскиеОрдера.ПометкаУдаления КАК ПометкаУдаления,
	|	ЖурналДокументовСкладскиеОрдера.Номер КАК Номер,
	|	ЖурналДокументовСкладскиеОрдера.Проведен КАК Проведен,
	|	ЖурналДокументовСкладскиеОрдера.Склад КАК Склад,
	|	ЖурналДокументовСкладскиеОрдера.Статус КАК Статус,
	|	ЖурналДокументовСкладскиеОрдера.ПомещениеОтправитель КАК ПомещениеОтправитель,
	|	ЖурналДокументовСкладскиеОрдера.ПомещениеПолучатель КАК ПомещениеПолучатель,
	|	ЖурналДокументовСкладскиеОрдера.Приоритет КАК Приоритет,
	|	ЖурналДокументовСкладскиеОрдера.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЖурналДокументовСкладскиеОрдера.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ЖурналДокументовСкладскиеОрдера.ОтгрузкаПоЗаданиюНаПеревозку КАК ОтгрузкаПоЗаданиюНаПеревозку,
	|	ЖурналДокументовСкладскиеОрдера.Комментарий КАК Комментарий,
	|	ЖурналДокументовСкладскиеОрдера.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ЖурналДокументовСкладскиеОрдера.ПорядокДоставки КАК ПорядокДоставки,
	|	ЖурналДокументовСкладскиеОрдера.Тип КАК Тип,
	|	ВЫБОР
	|		КОГДА ЖурналДокументовСкладскиеОрдера.Ссылка.Проведен
	|			ТОГДА 0
	|		КОГДА ЖурналДокументовСкладскиеОрдера.Ссылка.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Картинка
	|ИЗ
	|	ЖурналДокументов.СкладскиеОрдера КАК ЖурналДокументовСкладскиеОрдера
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ЖурналДокументовСкладскиеОрдера.Ссылка) = ТИП(Документ.РасходныйОрдерНаТовары)
	|	И ЖурналДокументовСкладскиеОрдера.Дата >= &ДатаОтгрузкиНачало
	|	И ЖурналДокументовСкладскиеОрдера.Дата <= &ДатаОтгрузкиОкончание
	|	И ЖурналДокументовСкладскиеОрдера.Ссылка.РабочийУчасток В(&РабочиеУчастки)
	|	И ЖурналДокументовСкладскиеОрдера.Склад = &Склад"; 
	
	ОрдераВРаботеОтгрузка.ОсновнаяТаблица =  "ЖурналДокументов.СкладскиеОрдера";
	
	РаспоряженияНаОтгрузку.ТекстЗапроса=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РаспоряженияИСостояния.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА РаспоряженияИСостояния.Документ
	|		ИНАЧЕ РаспоряженияИСостояния.Заказ
	|	КОНЕЦ КАК Заказ,
	|	РаспоряженияИСостояния.Документ КАК Документ,
	|	РаспоряженияИСостояния.Получатель КАК Получатель,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Документ) КАК ТипДокумента,
	|	0 КАК ИндексКартинки,
	|	РаспоряженияИСостояния.РабочийУчасток КАК РабочийУчасток,
	|	РаспоряженияИСостояния.ОтметкаКассы КАК ОтметкаКассы,
	|	РаспоряженияИСостояния.ОжидаетсяОтбор КАК ОжидаетсяОтбор,
	|	РаспоряженияИСостояния.Набирается КАК Набирается,
	|	РаспоряженияИСостояния.Набран КАК Набран,
	|	РаспоряженияИСостояния.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|	РаспоряженияИСостояния.Отгружен КАК Отгружен,
	|   РаспоряженияИСостояния.ЕстьНарезка  КАК ЕстьНарезка, 
	|   ВЫБОР КОГДА   РаспоряженияИСостояния.ЕстьНарезка ТОГДА ""НАРЕЗКА"" ИНАЧЕ """" КОНЕЦ КАК Нарезка,
	|   РаспоряженияИСостояния.Ошибка КАК Ошибка
	|ПОМЕСТИТЬ Промежуточный
	|ИЗ
	|	РегистрСведений.СостоянияОтгрузкиНакладных КАК РаспоряженияИСостояния
	|ГДЕ
	|	РаспоряженияИСостояния.Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РаспоряженияИСостояния.РабочийУчасток В(&РабочиеУчастки)
	|	И РаспоряженияИСостояния.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияИСостояния.Документ КАК Документ,
	|	ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	МАКСИМУМ(ЗаказыКДоставке.Рейс) КАК Рейс
	|ПОМЕСТИТЬ ЗаказыНаДоставку
	|ИЗ
	|	Промежуточный КАК РаспоряженияИСостояния
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКДоставке КАК ЗаказыКДоставке
	|		ПО РаспоряженияИСостояния.Заказ = ЗаказыКДоставке.ДокументПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияИСостояния.Документ,
	|	ЗаказыКДоставке.ЗаказНаДоставку
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РаспоряженияИСостояния.Документ,
	|	ЗаказыКДоставке.ЗаказНаДоставку,
	|	МАКСИМУМ(ЗаказыКДоставке.Рейс)
	|ИЗ
	|	Промежуточный КАК РаспоряженияИСостояния
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКДоставке КАК ЗаказыКДоставке
	|		ПО РаспоряженияИСостояния.Документ = ЗаказыКДоставке.ДокументПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияИСостояния.Документ,
	|	ЗаказыКДоставке.ЗаказНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспоряженияИСостояния.Документ КАК Документ,
	|	ЗаказНаДоставкуОснования.Ссылка КАК ЗаказНаДоставку,
	|	ДополнительныеСведения.Значение КАК СведениеМаркетплейс
	|ПОМЕСТИТЬ ВТ_ПродажаДоставка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Промежуточный КАК РаспоряженияИСостояния
	|		ПО РеализацияТоваров.Ссылка = РаспоряженияИСостояния.Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуОснования
	|		ПО (РеализацияТоваров.Ссылка = ЗаказНаДоставкуОснования.Документ
	|				ИЛИ РеализацияТоваров.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|					И РеализацияТоваров.ЗаказКлиента = ЗаказНаДоставкуОснования.Документ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО РеализацияТоваров.Партнер = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Наименование = ""Маркетплейс"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПродажаДоставка.Документ КАК Документ,
	|	ВТ_ПродажаДоставка.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ДокЗаказ.ОбъектДоставки КАК Объектдоставки,
	|	ОбъектыДоставки.Маркетплейс КАК Маркетплейс
	|ПОМЕСТИТЬ ПродажиМаркетплейс
	|ИЗ
	|	Документ.ЗаказНаДоставкуКлиенту КАК ДокЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПродажаДоставка КАК ВТ_ПродажаДоставка
	|		ПО ДокЗаказ.Ссылка = ВТ_ПродажаДоставка.ЗаказНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыДоставки КАК ОбъектыДоставки
	|		ПО ДокЗаказ.ОбъектДоставки = ОбъектыДоставки.Ссылка
	|ГДЕ
	|	ОбъектыДоставки.Маркетплейс <> """"
	|	И ВТ_ПродажаДоставка.СведениеМаркетплейс = ОбъектыДоставки.Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияИСостояния.Заказ КАК Распоряжение,
	|	РаспоряженияИСостояния.Документ КАК Документ,
	|	РаспоряженияИСостояния.Получатель КАК Получатель,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Документ) КАК ТипДокумента,
	|	0 КАК ИндексКартинки,
	|	РаспоряженияИСостояния.РабочийУчасток КАК Секция,
	|	РаспоряженияИСостояния.ОтметкаКассы КАК ОтметкаКассы,
	|	ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку1,
	|	МАКСИМУМ(ЗаказыКДоставке.Рейс) КАК Рейс1,
	|	ДОБАВИТЬКДАТЕ(ЗаказыКДоставке.ЗаказНаДоставку.ПрибытиеНаОтгрузку, ЧАС, ЧАС(ЗаказыКДоставке.ЗаказНаДоставку.ВремяДоставкиС) - 2) КАК ДатаОтгрузки,
	|	РаспоряженияИСостояния.ОжидаетсяОтбор КАК ОжидаетсяОтбор,
	|	РаспоряженияИСостояния.Набирается КАК Набирается,
	|	РаспоряженияИСостояния.Набран КАК Набран,
	|	РаспоряженияИСостояния.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|	РаспоряженияИСостояния.Отгружен КАК Отгружен,
	|	РаспоряженияИСостояния.Ошибка КАК Ошибка,
	|   РаспоряженияИСостояния.ЕстьНарезка КАК ЕстьНарезка,
	|   РаспоряженияИСостояния.Нарезка КАК Нарезка
	|ПОМЕСТИТЬ Итоговый
	|ИЗ
	|	Промежуточный КАК РаспоряженияИСостояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыНаДоставку КАК ЗаказыКДоставке
	|		ПО РаспоряженияИСостояния.Документ = ЗаказыКДоставке.Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияИСостояния.Заказ,
	|	РаспоряженияИСостояния.Документ,
	|	РаспоряженияИСостояния.Получатель,
	|	РаспоряженияИСостояния.РабочийУчасток,
	|	ЗаказыКДоставке.ЗаказНаДоставку,
	|	РаспоряженияИСостояния.ОжидаетсяОтбор,
	|	РаспоряженияИСостояния.Набирается,
	|	РаспоряженияИСостояния.Набран,
	|	РаспоряженияИСостояния.ЧастичноОтгружен,
	|	РаспоряженияИСостояния.Отгружен,
	|	РаспоряженияИСостояния.Ошибка,
	|	РаспоряженияИСостояния.ОтметкаКассы,
	|	ДОБАВИТЬКДАТЕ(ЗаказыКДоставке.ЗаказНаДоставку.ПрибытиеНаОтгрузку, ЧАС, ЧАС(ЗаказыКДоставке.ЗаказНаДоставку.ВремяДоставкиС) - 2),
	|   РаспоряженияИСостояния.ЕстьНарезка,
	|   РаспоряженияИСостояния.Нарезка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итоговый.Распоряжение КАК Распоряжение,
	|	Итоговый.Документ КАК Документ,
	|	Итоговый.Документ.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА &ДатаСортировки = ""ДатаДокумента""
	|			ТОГДА Итоговый.Документ.Дата
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Итоговый.ДатаОтгрузки ЕСТЬ NULL
	|					ТОГДА Итоговый.Документ.Дата
	|				ИНАЧЕ Итоговый.ДатаОтгрузки
	|			КОНЕЦ
	|	КОНЕЦ КАК Дата,
	|   Итоговый.Нарезка КАК Нарезка,
	|	Итоговый.Получатель КАК Получатель,
	|	Итоговый.ТипДокумента КАК ТипДокумента,
	|	Итоговый.ИндексКартинки КАК ИндексКартинки,
	|	Итоговый.Секция КАК Секция,
	|	Итоговый.ОтметкаКассы КАК ОтметкаКассы,
	|	Итоговый.ЗаказНаДоставку1 КАК ЗаказНаДоставку,
	|	Итоговый.Рейс1 КАК Рейс,
	|	Итоговый.ОжидаетсяОтбор КАК ОжидаетсяОтбор,
	|	Итоговый.Набирается КАК Набирается,
	|	Итоговый.Набран КАК Набран,
	|	Итоговый.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|	Итоговый.Отгружен КАК Отгружен,
	|   Итоговый.ЕстьНарезка КАК ЕстьНарезка,
	|	ВЫБОР
	|		КОГДА НЕ ПродажиМаркетплейс.Маркетплейс ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркетплейс
	|ИЗ
	|	Итоговый КАК Итоговый
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиМаркетплейс КАК ПродажиМаркетплейс
	|		ПО Итоговый.Документ = ПродажиМаркетплейс.Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";	
	
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();   
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполняемДинамическийСписокПересчет() 
	РаспоряженияНаПересчет.ТекстЗапроса=" 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПересчетТоваров.Ссылка КАК Документ,
	|	ПересчетТоваров.Склад Как Склад, 
	|   ПересчетТоваров.Дата Как Дата,
	|	ПересчетТоваров.Номер Как Номер,
	|	ПересчетТоваров.ТипПересчета Как ТипПересчета,
	|	ПересчетТоваров.ТочкаПересчета Как ТочкаПересчета,
	|	ПересчетТоваров.Статус Как Статус,
	|	ПересчетТоваров.Ответственный Как Ответственный
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|			ПО ПересчетТоваровТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|				И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ПересчетТоваровТовары.Ссылка.Склад)
	|				И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|		ПО (ПересчетТоваровТовары.Ссылка = ПересчетТоваров.Ссылка)
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ИспользоватьСклад ТОГДА
	|			ПересчетТоваров.Склад = &Склад
	|		ИНАЧЕ НЕ &ИспользоватьСклад 
	|	КОНЕЦ
	|	И
	|	ВЫБОР 
	|		КОГДА &ИспользоватьСекции ТОГДА
	|			ВЫБОР			
	|				КОГДА ПересчетТоваров.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач
	|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток 
	|					В (&Секции, ЗНАЧЕНИЕ(Справочник.РабочиеУчастки.ПустаяСсылка))
	|				ИНАЧЕ
	|					&ИспользоватьСекции
	|			КОНЕЦ
	|		ИНАЧЕ
	|			НЕ &ИспользоватьСекции
	|	КОНЕЦ
	|	И 
	|	ПересчетТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|    И НЕ ПересчетТоваров.ПометкаУдаления
	|    И ПересчетТоваров.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.Отменено) ";  

	УстанавливаемЗначенияПараметровДинамическихСписковПересчет();
КонецПроцедуры
                  
&НаСервере
Процедура ЗаполняемДинамическийСписокПроверкаЦенников()  
	ПроверкиЦенников.ТекстЗапроса=" 
	|ВЫБРАТЬ
	|	ДокументПроверкаЦенников.Ссылка КАК Ссылка,
	|	ДокументПроверкаЦенников.Склад КАК Склад,
	|	ДокументПроверкаЦенников.Номер КАК Номер,
	|	ДокументПроверкаЦенников.Дата КАК Дата, 
	|	ДокументПроверкаЦенников.ВидПроверки КАК ВидПроверки
	|ИЗ
	|	Документ.ПроверкаЦенников КАК ДокументПроверкаЦенников
	|ГДЕ
	|	ДокументПроверкаЦенников.Склад = &Склад
	|	И ДокументПроверкаЦенников.Дата >= &Дата "; 

	УстанавливаемЗначенияПараметровДинамическихСписковПроверкаЦенников();
КонецПроцедуры

&НаСервере
Процедура ЗаполняемДинамическийСписокИзучениеАссортимента()
	ТаблицаИзученийАссортимента.ТекстЗапроса="
|ВЫБРАТЬ
|	СкладскиеЯчейки.Ссылка КАК Ячейка
|ПОМЕСТИТЬ ВТ_Ячейки
|ИЗ
|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
|ГДЕ
|	СкладскиеЯчейки.РабочийУчасток В(&РабочийУчасток)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура.ВидНоменклатуры КАК Вид
|ПОМЕСТИТЬ ВТ_Виды
|ИЗ
|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
|		ПО РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
|			И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыНаСкладахОстатки.Склад
|ГДЕ
|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка В
|			(ВЫБРАТЬ
|				ВТ_Ячейки.Ячейка
|			ИЗ
|				ВТ_Ячейки)
|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ТочкиПересчетаОбучение.Ссылка КАК Точка,
|	ТочкиПересчетаОбучение.Родитель КАК Родитель
|ПОМЕСТИТЬ ВТ_Точки
|ИЗ
|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТочкиПересчетаОбучение КАК ТочкиПересчетаОбучение
|		ПО ВидыНоменклатуры.ТочкаПересчетаОбучение = ТочкиПересчетаОбучение.Ссылка
|ГДЕ
|	ВидыНоменклатуры.Ссылка В
|			(ВЫБРАТЬ
|				Вт_Виды.Вид
|			ИЗ
|				Вт_Виды)
|	И ТочкиПересчетаОбучение.ЭтоТочка
|	И НЕ ТочкиПересчетаОбучение.Порядок = 168
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ИзучениеАссортиментаСрезПоследних.Регистратор КАК Ссылка,
|	ИзучениеАссортиментаСрезПоследних.ТочкаПересчетаОбучение КАК ТочкаПересчетаОбучение,
|	ИзучениеАссортиментаСрезПоследних.Статус КАК Статус,
|	ИзучениеАссортиментаСрезПоследних.ПоследняяОткрытаяСтрока КАК ПоследняяОткрытаяСтрока,
|	ИзучениеАссортиментаСрезПоследних.КоличествоОшибок КАК КоличествоОшибок
|ПОМЕСТИТЬ ВТ_СписокДокументов
|ИЗ
|	РегистрСведений.ИзучениеАссортимента.СрезПоследних КАК ИзучениеАссортиментаСрезПоследних
|ГДЕ
|	ИзучениеАссортиментаСрезПоследних.Сотрудник = &Сотрудник
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_Точки.Точка КАК ТочкаПересчетаОбучение,
|	ВТ_СписокДокументов.Ссылка КАК Ссылка,
|	ВТ_Точки.Точка.Порядок КАК Порядок,
|	ВТ_СписокДокументов.Статус КАК Статус,
|	ВТ_СписокДокументов.ПоследняяОткрытаяСтрока КАК СтрокНабрано,
|	ВТ_СписокДокументов.КоличествоОшибок КАК ОшибокДопущено,
|	ВТ_Точки.Родитель КАК Родитель
|ИЗ
|	ВТ_Точки КАК ВТ_Точки
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокДокументов КАК ВТ_СписокДокументов
|		ПО ВТ_Точки.Точка = ВТ_СписокДокументов.ТочкаПересчетаОбучение 
|
|ГДЕ
|	(НЕ &ТолькоНеИзученное
|			ИЛИ НЕ ЕСТЬNULL(ВТ_СписокДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИзученияАссортимента.НеИзучено)) = ЗНАЧЕНИЕ(Перечисление.СтатусыИзученияАссортимента.Завершено))
|";
	УстанавливаемЗначенияПараметровДинамическихСписковИзучениеАссортимента(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено,ЭтаФорма, "СканерШтрихкода");
		
	ИнициализироватьСканер();
	
	УстановитьВидимость(ИмяКоманды);
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		  ЭтаФорма.Элементы.ДополнительнаяИнформация.Видимость=Ложь;
	#Иначе
		 ЭтаФорма.Элементы.ДополнительнаяИнформация.Видимость=Истина;
	#КонецЕсли
	
	Если ОповещенияИзОчереди Тогда 
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли; 
		
	Если ОтрытьСписокОчереди Тогда        
		ПоказатьСписокОчередиКлиент(); 
		ОтрытьСписокОчереди = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	    ОтключитьСканер();

		ОтключитьОбработчикОжидания("ОбновитьДанныеНаКлиенте");	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode" Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 =  Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Штрихкод1));
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "РасходныйОрдер_СтатусИзменение_Доп" И ИмяКоманды="Отгрузка" И ВводДоступен() Тогда 
        УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ЭлектроннаяОчередь

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	
	ПоказатьСписокОчередиКлиент();

КонецПроцедуры     

&НаКлиенте
Процедура ПоказатьСписокОчередиКлиент()	
	ПолучитьСписокОчереди();
	Если СписокДокументовВОчереди.Количество() > 0 Тогда
		НайтиОткрытуюФормуДокумента();
			
		//Скидываем отбор 
		СостояниеОтгрузки = "";
		//УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();

		УстановитьВидимость("Список очереди");
		//УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
	Иначе 
		КлиентовВОчереди = 0;
		Сообщить("Все документы уже в работе");
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди(); 

	Если ПолучитьСписокОчереди() Тогда
		Если ЕстьОповещениеПоОрдеруВРаботе ИЛИ СписокДокументовВОчереди.Количество() > 0 Тогда
			ТекДата = ТекущаяДата();
			Если ВремяПоследнегоОповещения > ТекДата-5 Или ВремяПоследнегоОповещения < ТекДата - ИнтервалОповещений Тогда
				#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
					Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
						СредстваМультимедиа.ВоспроизвестиТекст("Клиент на выдаче!","ru-RU");
					Иначе
						СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();
					КонецЕсли;   
					СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();

				#КонецЕсли 
				ВремяПоследнегоОповещения = ТекДата;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", Секции);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
	КонецЕсли; 
КонецПроцедуры 	

&НаСервере
Функция ПолучитьСписокОчереди()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)  
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", Секции);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		СписокДокументовВОчереди.Очистить();
		Результат = Ложь;
	Иначе
		Результат = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		СпВОчереди = Новый СписокЗначений;
		СпКВыдаче  = Новый СписокЗначений;
		ЕстьОповещениеПоОрдеруВРаботе = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.Получатель) = Тип("СправочникСсылка.РабочиеУчастки") Тогда
				ДатаДок = Выборка.Документ.Дата;
				СпВОчереди.Добавить(Выборка.Документ);
				ЭлементСписка = СписокДокументовВОчереди.НайтиПоЗначению(Выборка.Документ);
				Если ЭлементСписка = Неопределено Тогда
					ВремяПоследнегоОповещения = ТекущаяДата();
				КонецЕсли; 
				Если ДатаДок < ДатаОтгрузки.ДатаНачала Тогда
					ДатаОтгрузки.ДатаНачала = ДатаДок;
				КонецЕсли; 
			Иначе
				Если Выборка.Получатель = Исполнитель Тогда
					СпКВыдаче.Добавить(Выборка.Документ);
					ЭлементСписка = СписокДокументовКВыдаче.НайтиПоЗначению(Выборка.Документ);
					Если ЭлементСписка = Неопределено Тогда
						ЕстьОповещениеПоОрдеруВРаботе = Истина;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
		
		Если ЕстьОповещениеПоОрдеруВРаботе Тогда
			СписокДокументовКВыдаче  = СпКВыдаче.Скопировать();
		КонецЕсли; 
		СписокДокументовВОчереди = СпВОчереди.Скопировать();
		
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ПоказатьДокументыКВыдаче()
	МассивДокументов = СписокДокументовКВыдаче.ВыгрузитьЗначения();
	Стр = СтрСоединить(МассивДокументов, Символы.ПС);
	Предупреждение(Стр,,"Клиенты ожидают выдачу по документам");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокументыОчереди(РезультатВопроса, ДополнительныеПараметры) Экспорт
	СообщениеОбработано = Истина;
	Если РезультатВопроса = "Показать документы" Тогда
		ПолучитьСписокОчереди();
		Если СписокДокументовВОчереди.Количество() > 0 Тогда
			НайтиОткрытуюФормуДокумента();
			
			//Скидываем отбор 
			СостояниеОтгрузки = "";
			УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();

			УстановитьВидимость("Список очереди");
			УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
		Иначе 
			Сообщить("Все документы уже в работе");
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Оповещения(Команда)
	
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
		
		Если (СписокДокументовКВыдаче.Количество() + СписокДокументовВОчереди.Количество()) > 2 Тогда
			ПричинаОтказа = "Нельзя отключить, пока в очереди более двух клиентов" 
		ИначеЕсли Не ОповещенияПоСекцииПодключены Тогда
			ПричинаОтказа = "Нельзя отключить, пока оповещения отключены у других сотрудников секции";
		КонецЕсли;
		
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Не ОповещенияИзОчереди;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди"); 
			ПроверкаЭлектроннойОчереди(); 
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Не ОповещенияИзОчереди;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();

КонецПроцедуры

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", Секции);
	Запрос.УстановитьПараметр("Сотрудник", Исполнитель);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", Секции); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 
	
	

&НаКлиенте
Процедура НайтиОткрытуюФормуДокумента()
	// Получение всех открытых окон приложения
	ОкнаПриложения = ПолучитьОкна();
	Для каждого ОкноПриложения Из ОкнаПриложения Цикл
		// Анализ заголовка окна
		Если Найти(ОкноПриложения.Заголовок, "товар") > 0 Тогда
			// Получение формы
			НайденнаяФорма = ОкноПриложения.Содержимое[0];
			//Если есть изменения - записываем
			Если НайденнаяФорма.Модифицированность Тогда
				ОбщегоНазначенияУТКлиент.ЗаписатьИЗакрыть(НайденнаяФорма);
			Иначе
				НайденнаяФорма.Закрыть()
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Исполнитель.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//Приемка
&НаКлиенте
Процедура ДатаПоступленияПриИзменении(Элемент)
	УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПоступленияФильтрПриИзменении(Элемент)
	УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОрдеровПриИзменении(Элемент)
	УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
КонецПроцедуры

//Отгрузка
&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОрдеровОтгрузкаПриИзменении(Элемент)
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		Склад = Исполнитель.Склад;
		Секции.ЗагрузитьЗначения(Исполнитель.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток"));
		УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
		УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура РаспоряженияНаПересчетВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РаспоряженияНаПересчет.ТекущиеДанные; 
	Если ТекущиеДанные <> Неопределено Тогда 
		СсылкаНаЭлемент	= ТекущиеДанные.Документ; 
		
		
		ПараметрыФормы = Новый Структура("Ключ, Сотрудник", СсылкаНаЭлемент, Исполнитель);
		ОткрытьФорму("Документ.ПересчетТоваров.Форма.Док_ФормаДокументаТСД", ПараметрыФормы);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаПоступлениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
			Если ПоРаспоряжениюИСекцииЕстьОрдера(ТекущиеДанные.Распоряжение) Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект); 
			
			ПоказатьВопрос(Оповещение, "Создать новый?",  РежимДиалогаВопрос.ДаНетОтмена,0,КодВозвратаДиалога.Да, "Найдены созданные ордера");
		Иначе	
			ЗаполнитьТовары(ТекущиеДанные.РабочийУчасток,ТекущиеДанные.Распоряжение);
			
			Основание = Новый Структура;
			Основание.Вставить("Распоряжение",               ТекущиеДанные.Распоряжение);
			Основание.Вставить("Отправитель",                ТекущиеДанные.Отправитель);
			Основание.Вставить("Склад",                      Склад);
			Основание.Вставить("ДатаВходящегоДокумента",     ТекущиеДанные.ДатаВходящегоДокумента);
			Основание.Вставить("НомерВходящегоДокумента",    ТекущиеДанные.НомерВходящегоДокумента);
			Основание.Вставить("ДатаПоступления",            ТекущаяДата());
			Основание.Вставить("ХозяйственнаяОперация",      ТекущиеДанные.ХозяйственнаяОперация);
			Основание.Вставить("РабочийУчасток",      ТекущиеДанные.РабочийУчасток);
			Основание.Вставить("Товары", Товары);
			Основание.Вставить("Исполнитель", ПолучитьПользователяСотрудника());
			Основание.Вставить("Секции", Секции);
			Основание.Вставить("Сотрудник", Исполнитель);
			
			ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.Док_ФормаДокументаТСД",
			Новый Структура("Основание, ТекущийСотрудникТСД",Основание, Исполнитель));
		КонецЕсли;
	Иначе
		
		ТекстПредупреждения = НСтр("ru = 'Выберите распоряжение на поступление товаров.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт 
	
	ТекущиеДанные = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТовары(ТекущиеДанные.РабочийУчасток,ТекущиеДанные.Распоряжение);
		
		Основание = Новый Структура;
		Основание.Вставить("Распоряжение",               ТекущиеДанные.Распоряжение);
		Основание.Вставить("Отправитель",                ТекущиеДанные.Отправитель);
		Основание.Вставить("Склад",                      Склад);
		Основание.Вставить("ДатаВходящегоДокумента",     ТекущиеДанные.ДатаВходящегоДокумента);
		Основание.Вставить("НомерВходящегоДокумента",    ТекущиеДанные.НомерВходящегоДокумента);
		Основание.Вставить("ДатаПоступления",            ТекущаяДата());
		Основание.Вставить("ХозяйственнаяОперация",      ТекущиеДанные.ХозяйственнаяОперация);
		Основание.Вставить("РабочийУчасток",      ТекущиеДанные.РабочийУчасток);
		Основание.Вставить("Товары", Товары);
		Основание.Вставить("Исполнитель", ПолучитьПользователяСотрудника());
		Основание.Вставить("Секции", Секции.ВыгрузитьЗначения());
		Основание.Вставить("Сотрудник", Исполнитель);

		ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.Док_ФормаДокументаТСД",
		Новый Структура("Основание, ТекущийСотрудникТСД",Основание, Исполнитель));
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		Элементы.ГруппаСтраницыПриемка.ТекущаяСтраница = Элементы.ПриходныеОрдера;
		
		ОрдераВРаботе.Отбор.Элементы.Очистить();
		
		ЭлементОтбора = ОрдераВРаботе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Распоряжение");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ТекущиеДанные.Распоряжение;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрдераВРаботеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СсылкаНаЭлемент = Элементы.ОрдераВРаботе.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("Ключ,Секции,ТекущийСотрудникТСД", СсылкаНаЭлемент.Ссылка,Секции.ВыгрузитьЗначения(),Исполнитель); 

	ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.Док_ФормаДокументаТСД",
					ПараметрыФормы); 
				
КонецПроцедуры

#КонецОбласти



&НаКлиенте
Процедура ПриемкаСдачаРабот(Команда)
	
	УстановитьВидимость(Команда.Имя);
КонецПроцедуры
#Область СлужебныеПроцедурыИФункции

Процедура УстанавливаемЗначенияПараметровДинамическихСписковПриемкаСдачаРабот()
	Если ЗначениеЗаполнено(Склад) И Секции.Количество() > 0 Тогда
		ДокументыПриемкаСдачаРабот.Параметры.УстановитьЗначениеПараметра("Подразделение", Склад.Подразделение);
		ДокументыПриемкаСдачаРабот.Параметры.УстановитьЗначениеПараметра("ДатаНачало", НачалоДня(ТекущаяДата()));
		ДокументыПриемкаСдачаРабот.Параметры.УстановитьЗначениеПараметра("ДатаКонец", КонецДня(ТекущаяДата()));
		Элементы.ДокументыПриемкаСдачаРабот.Обновить();
	Иначе
		Сообщить("У сотрудника в карточке должны быть заполнены реквизит 'Склад' и табличная часть 'Рабочие участки (ТСД)'!");
	КонецЕсли; 
КонецПроцедуры

Процедура УстанавливаемЗначенияПараметровДинамическихСписковПриемка()

	
	Если ЗначениеЗаполнено(Склад) И Секции.Количество() > 0 Тогда
					
		ОрдераВРаботе.Отбор.Элементы.Очистить(); 
		
		ОрдераВРаботе.Параметры.УстановитьЗначениеПараметра("Склад",Склад);
		ОрдераВРаботе.Параметры.УстановитьЗначениеПараметра("ДатаПоступленияНачало",?(ЗначениеЗаполнено(ДатаПоступления.ДатаНачала),НачалоДня(ДатаПоступления.ДатаНачала), НачалоМесяца(ТекущаяДата())));
		ОрдераВРаботе.Параметры.УстановитьЗначениеПараметра("ДатаПоступленияОкончание",?(ЗначениеЗаполнено(ДатаПоступления.ДатаОкончания),КонецДня(ДатаПоступления.ДатаОкончания), КонецДня(ТекущаяДата())));
		ОрдераВРаботе.Параметры.УстановитьЗначениеПараметра("РабочиеУчастки",Секции);

		//	
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Склад", Склад, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка.РабочийУчасток", Секции, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Дата", ?(ЗначениеЗаполнено(ДатаПоступления.ДатаНачала),НачалоДня(ДатаПоступления.ДатаНачала), НачалоМесяца(ТекущаяДата())), ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Дата", ?(ЗначениеЗаполнено(ДатаПоступления.ДатаОкончания),КонецДня(ДатаПоступления.ДатаОкончания), КонецДня(ТекущаяДата())), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Статус", ФильтрОрдеров, ВидСравненияКомпоновкиДанных.Равно,,?(ЗначениеЗаполнено(ФильтрОрдеров), Истина,Ложь) );
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Тип",Тип("ДокументСсылка.ПриходныйОрдерНаТовары") , ВидСравненияКомпоновкиДанных.Равно,,Истина);

		
		РаспоряженияНаПоступление.Отбор.Элементы.Очистить();
		
		РаспоряженияНаПоступление.Параметры.УстановитьЗначениеПараметра("Склад",Склад);
		РаспоряженияНаПоступление.Параметры.УстановитьЗначениеПараметра("ДатаПоступленияНачало",?(ЗначениеЗаполнено(ДатаПоступления.ДатаНачала),НачалоДня(ДатаПоступления.ДатаНачала), НачалоМесяца(ТекущаяДата())));
		РаспоряженияНаПоступление.Параметры.УстановитьЗначениеПараметра("ДатаПоступленияОкончание",?(ЗначениеЗаполнено(ДатаПоступления.ДатаОкончания),КонецДня(ДатаПоступления.ДатаОкончания), КонецДня(ТекущаяДата())));
		РаспоряженияНаПоступление.Параметры.УстановитьЗначениеПараметра("РабочиеУчастки",Секции);
		
		Если Не ПустаяСтрока(СостояниеПоступленияФильтр) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РаспоряженияНаПоступление, СостояниеПоступленияФильтр, Истина, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;	
		
	Иначе
		Сообщить("У сотрудника в карточке должны быть заполнены реквизит 'Склад' и табличная часть 'Рабочие участки (ТСД)'!");
	КонецЕсли;                                               
	

КонецПроцедуры

Процедура УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка()
	
	
	Если ЗначениеЗаполнено(Склад) И Секции.Количество() > 0 Тогда

		ОрдераВРаботеОтгрузка.Отбор.Элементы.Очистить();  
		
		ОрдераВРаботеОтгрузка.Параметры.УстановитьЗначениеПараметра("Склад",Склад);
		ОрдераВРаботеОтгрузка.Параметры.УстановитьЗначениеПараметра("ДатаОтгрузкиНачало",?(ЗначениеЗаполнено(ДатаОтгрузки.ДатаНачала),НачалоДня(ДатаОтгрузки.ДатаНачала), НачалоМесяца(ТекущаяДата())));
		ОрдераВРаботеОтгрузка.Параметры.УстановитьЗначениеПараметра("ДатаОтгрузкиОкончание",?(ЗначениеЗаполнено(ДатаОтгрузки.ДатаОкончания),КонецДня(ДатаОтгрузки.ДатаОкончания), КонецДня(ТекущаяДата())));
		ОрдераВРаботеОтгрузка.Параметры.УстановитьЗначениеПараметра("РабочиеУчастки",Секции);
		//
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботеОтгрузка, "Склад", Склад, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботеОтгрузка, "Ссылка.РабочийУчасток", Секции, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботеОтгрузка, "Дата", ?(ЗначениеЗаполнено(ДатаОтгрузки.ДатаОкончания),КонецДня(ДатаОтгрузки.ДатаОкончания), КонецДня(ТекущаяДата())), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботеОтгрузка, "Дата", ?(ЗначениеЗаполнено(ДатаОтгрузки.ДатаНачала),НачалоДня(ДатаОтгрузки.ДатаНачала), НачалоДня(ТекущаяДата())), ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботеОтгрузка, "Статус", ФильтрОрдеровОтгрузка, ВидСравненияКомпоновкиДанных.Равно,,?(ЗначениеЗаполнено(ФильтрОрдеровОтгрузка), Истина,Ложь) );
		Если ОтборОрдеровПоСотруднику Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботеОтгрузка, "Ссылка.Сотрудник", Исполнитель, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
		
		
		РаспоряженияНаОтгрузку.Отбор.Элементы.Очистить();
		
		РаспоряженияНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Склад",Склад);
		РаспоряженияНаОтгрузку.Параметры.УстановитьЗначениеПараметра("ДатаНачала",?(ЗначениеЗаполнено(ДатаОтгрузки.ДатаНачала),НачалоДня(ДатаОтгрузки.ДатаНачала), НачалоДня(ТекущаяДата())));
		РаспоряженияНаОтгрузку.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",?(ЗначениеЗаполнено(ДатаОтгрузки.ДатаОкончания),КонецДня(ДатаОтгрузки.ДатаОкончания), КонецДня(ТекущаяДата())));
		РаспоряженияНаОтгрузку.Параметры.УстановитьЗначениеПараметра("ДатаСортировки",ДатаСортировки);
		РаспоряженияНаОтгрузку.Параметры.УстановитьЗначениеПараметра("РабочиеУчастки",Секции);
		
		Если СписокОчереди Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РаспоряженияНаОтгрузку, "Документ", СписокДокументовВОчереди, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		КонецЕсли; 
		
		Если Не ПустаяСтрока(СостояниеОтгрузки) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РаспоряженияНаОтгрузку, СостояниеОтгрузки, Истина, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
		
	Иначе
		Сообщить("У сотрудника в карточке должны быть заполнены реквизит 'Склад' и табличная часть 'Рабочие участки (ТСД)'!");
	КонецЕсли;                                               
	
КонецПроцедуры

Процедура УстанавливаемЗначенияПараметровДинамическихСписковПересчет()
	
	
	ПараметрСклад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка"); 
	ПараметрСекции = ПредопределенноеЗначение("Справочник.РабочиеУчастки.ПустаяСсылка"); 
	Если ЗначениеЗаполнено(РольМобильногоКлиента) И РольМобильногоКлиента = ПредопределенноеЗначение("Перечисление.РолиМобильногоКлиента.Бухгалтер") Тогда
		ПараметрСклад = ФильтрПересчетовСклад;
		ПараметрСекции = ФильтрПересчетовСекция;
	Иначе
		Если НЕ ЗначениеЗаполнено(Склад) Или Секции.Количество() = 0 Тогда
			Сообщить("У сотрудника в карточке должны быть заполнены реквизит 'Склад' и табличная часть 'Рабочие участки (ТСД)'!");
			Возврат;
		КонецЕсли;
		ПараметрСклад = Склад;
		ПараметрСекции = Секции;
	КонецЕсли;
	
	РаспоряженияНаПересчет.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ФильтрПересчетовСтатус) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РаспоряженияНаПересчет, "Статус", ФильтрПересчетовСтатус, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
	РаспоряженияНаПересчет.Параметры.УстановитьЗначениеПараметра("ДатаНачала",?(ЗначениеЗаполнено(ДатаПересчета.ДатаНачала),НачалоДня(ДатаПересчета.ДатаНачала), НачалоМесяца(ТекущаяДата())));
	РаспоряженияНаПересчет.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",?(ЗначениеЗаполнено(ДатаПересчета.ДатаОкончания),КонецДня(ДатаПересчета.ДатаОкончания), КонецДня(ТекущаяДата())));
	
	РаспоряженияНаПересчет.Параметры.УстановитьЗначениеПараметра("ИспользоватьСклад",?(ЗначениеЗаполнено(ПараметрСклад), Истина, Ложь));
	РаспоряженияНаПересчет.Параметры.УстановитьЗначениеПараметра("Склад",ПараметрСклад);
	РаспоряженияНаПересчет.Параметры.УстановитьЗначениеПараметра("ИспользоватьСекции",?(ЗначениеЗаполнено(ПараметрСекции), Истина, Ложь));
	РаспоряженияНаПересчет.Параметры.УстановитьЗначениеПараметра("Секции",ПараметрСекции);
	
	
	
КонецПроцедуры

Процедура УстанавливаемЗначенияПараметровДинамическихСписковПроверкаЦенников()
		
	Если ЗначениеЗаполнено(Склад) И Секции.Количество() > 0 Тогда
		
		ПроверкиЦенников.Отбор.Элементы.Очистить();;
		
		ПроверкиЦенников.Параметры.УстановитьЗначениеПараметра("Дата",НачалоМесяца(ТекущаяДата()));
		ПроверкиЦенников.Параметры.УстановитьЗначениеПараметра("Склад",Склад);

		
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПроверкиЦенников, "Склад", Склад, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПроверкиЦенников, "Дата", НачалоМесяца(ТекущаяДата()), ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,Истина);
					
	Иначе
		Сообщить("У сотрудника в карточке должны быть заполнены реквизит 'Склад' и табличная часть 'Рабочие участки (ТСД)'!");
	КонецЕсли;                                               
	
КонецПроцедуры

Процедура УстанавливаемЗначенияПараметровДинамическихСписковИзучениеАссортимента()
	ТаблицаИзученийАссортимента.Параметры.УстановитьЗначениеПараметра("Сотрудник", Исполнитель);
	ТаблицаИзученийАссортимента.Параметры.УстановитьЗначениеПараметра("РабочийУчасток", Секции);
	ТаблицаИзученийАссортимента.Параметры.УстановитьЗначениеПараметра("ТолькоНеИзученное", ТолькоНеИзученное); 
КонецПроцедуры

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказПоставщику.ПустаяСсылка"));
    Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПеремещениеТоваров.ПустаяСсылка"));
    Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПриходныйОрдерНаТовары.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ВозвратТоваровОтКлиента.ПустаяСсылка"));
    Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЧекККМВозврат.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.КорректировкаРеализации.ПустаяСсылка"));
	
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	
	Если МассивСсылок.Количество() > 0 Тогда
		
		СсылкаДокумента = МассивСсылок[0];	
		
		Если СсылкаДокумента <> Неопределено Тогда
			Если ТипЗнч(СсылкаДокумента)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
				СсылкаНаОрдер = СсылкаДокумента;
				СсылкаДокумента = Неопределено;
				ПараметрыФормы = Новый Структура("Ключ, ТекущийСотрудникТСД", СсылкаНаОрдер, Исполнитель); 
                ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.Док_ФормаДокументаТСД",ПараметрыФормы);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ПоискШтрихкодаСтруктура = ПоискШтрихкодаСекции(Данные.Штрихкод);						
		СсылкаДокумента = ПоискШтрихкодаСтруктура.Документ;
	КонецЕсли;
		
	Если СсылкаДокумента <> Неопределено Тогда
			
		Если ЭтаФорма.Заголовок = "Приемка" Тогда
			
			РаспоряженияНаПоступление.Отбор.Элементы.Очистить();
			
			ЭлементОтбора = РаспоряженияНаПоступление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжение");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = СсылкаДокумента;
			
			ОрдераВРаботе.Отбор.Элементы.Очистить();
			
			ЭлементОтбора = ОрдераВРаботе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Распоряжение");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = СсылкаДокумента;
				
		ИначеЕсли ЭтаФорма.Заголовок = "Отгрузка" Тогда
			
			РаспоряженияНаОтгрузку.Отбор.Элементы.Очистить();
			//Тест поиск 
			
			СостояниеОтгрузки = "";
			УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
			
			
			ЭлементОтбора = РаспоряженияНаОтгрузку.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Документ");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = СсылкаДокумента;
			
			ОрдераВРаботеОтгрузка.Отбор.Элементы.Очистить();
			
			ЭлементОтбора = ОрдераВРаботеОтгрузка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Накладная");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = СсылкаДокумента;

        КонецЕсли;
			
	КонецЕсли;
		
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПоискШтрихкодаСекции(ШК)
	
	СтруктураВозврата = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыПоСекциямДокумента.Документ
		|ИЗ
		|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
		|ГДЕ
		|	ШтрихкодыПоСекциямДокумента.Штрихкод = &Штрихкод";


	Запрос.УстановитьПараметр("Штрихкод", ШК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Вставить("Документ", Выборка.Документ);
	Иначе
		СтруктураВозврата.Вставить("Документ", Неопределено);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ЗаполнитьТовары(РабочийУчасток,СсылкаНаДокумент)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ТоварыКПоступлениюОстатки.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыКПоступлениюОстатки.Склад)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления";
	
	Запрос.УстановитьПараметр("ДокументПоступления",СсылкаНаДокумент);
	Запрос.УстановитьПараметр("РабочиеУчастки",РабочийУчасток);
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

Функция ПолучитьПользователяСотрудника()
	Возврат Исполнитель.Пользователь;
КонецФункции

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
КонецПроцедуры

Функция ПоРаспоряжениюИСекцииЕстьОрдера(Распоряжение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Проведен = ИСТИНА
		|	И ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение
		|	И ПриходныйОрдерНаТовары.РабочийУчасток В(&РабочийУчасток)";
	
	Запрос.УстановитьПараметр("РабочийУчасток", Секции.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

&НаСервере
Процедура ПрисвоитьШтрихкодНаСервере()
	
КонецПроцедуры

Процедура СоздатьШК(Штрихкод,Номенклатура,Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК НоменклатураПредставление,
	|	ШтрихкодыНоменклатуры.Характеристика.Наименование КАК ХарактеристикаПредставление,
	|	ШтрихкодыНоменклатуры.Упаковка.Наименование КАК УпаковкаПредставление
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для номенклатуры %Номенклатура%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Номенклатура%", """" + Выборка.НоменклатураПредставление + """"
		+ ?(ЗначениеЗаполнено(Выборка.Характеристика), " " + НСтр("ru='с характеристикой'") + " """ + Выборка.ХарактеристикаПредставление + """", "")
		+ ?(ЗначениеЗаполнено(Выборка.Упаковка), " " + НСтр("ru='в упаковке'") + " """ + Выборка.УпаковкаПредставление + """", ""));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Сообщить();
		
	Иначе
		МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Штрихкод = Штрихкод;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Характеристика = Характеристика;

		МенеджерЗаписи.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Штрихкод записан!";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьШтрихкод(Команда)
	ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.ФормаЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОстатки(Команда)
	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.ФормаПроверкаЦенников",Новый Структура("Сотрудник",Исполнитель),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИзучениеАссортимента(Команда)
	УстановитьВидимость(Команда.Имя);
КонецПроцедуры 

&НаКлиенте
Процедура БлокировкаТоваров(Команда)
	УстановитьВидимость(Команда.Имя);
	Элементы.СчитатьШтрихкодКамера.Видимость = Ложь;
КонецПроцедуры  

&НаКлиенте
Процедура СоздатьБлокировкуНК(Команда)
	
	СоздатьБлокировку(Истина, "Брак на складе");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокировкуНедостача(Команда)
	
	СоздатьБлокировку(Ложь, "Нет на складе");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокировку(ДобавитьФотоТовара, ПричинаБлокировки)
	
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("ДобавитьФотоТовара", ДобавитьФотоТовара);
	ПараметрыФормы.Вставить("ПричинаБлокировки", ПричинаБлокировки);
	ПараметрыФормы.Вставить("Сотрудник", Исполнитель);
	
	ОткрытьФорму("Документ.БлокировкаДвиженияТоваров.Форма.Док_ФормаДокументаТСД", ПараметрыФормы);	
	
КонецПроцедуры

  
&НаКлиенте
Процедура ПриемкаПоРейсу(Команда)
	
	СозданныеОрдера = Новый Массив();
	
	Для каждого Строка из Элементы.РаспоряженияНаПоступление.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.РаспоряженияНаПоступление.ДанныеСтроки(Строка);
		
		Ордера = Новый Массив;
		
		Ордера = ПолучитьОрдерПоСекцииИРаспоряжению(ДанныеСтроки.РабочийУчасток,ДанныеСтроки.Распоряжение);
		
		Если Ордера.Количество()>0 Тогда
			Для каждого Строка из Ордера Цикл
				СозданныеОрдера.Добавить(Строка);
			КонецЦикла;
		Иначе
			СозданныйОрдер = СоздатьОрдер(ДанныеСтроки);
			
			СозданныеОрдера.Добавить(СозданныйОрдер);
			
		КонецЕсли;
			
	КонецЦикла;         
	
	ОчиститьСообщения(); 
	
	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.ФормаПриемПоРейсу",  Новый Структура("Сотрудник,СписокОрдеров",Исполнитель,СозданныеОрдера));
КонецПроцедуры

Функция СоздатьОрдер(Строка)
	
	ОрдерОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	
	ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.КПоступлению;
	ОрдерОбъект.Склад = Склад;
	ОрдерОбъект.Распоряжение = Строка.Распоряжение;
	ОрдерОбъект.Дата = ТекущаяДата();
	ОрдерОбъект.Отправитель = Строка.Отправитель;
	ОрдерОбъект.ДатаВходящегоДокумента =  Строка.ДатаВходящегоДокумента;
	ОрдерОбъект.НомерВходящегоДокумента =   Строка.НомерВходящегоДокумента;
	ОрдерОбъект.ХозяйственнаяОперация =     Строка.ХозяйственнаяОперация;
	ОрдерОбъект.РабочийУчасток = Строка.РабочийУчасток;
	ОрдерОбъект.Исполнитель = ПолучитьПользователяСотрудника();
	ОрдерОбъект.Ответственный = Пользователи.ТекущийПользователь();
	ОрдерОбъект.СкладскаяОперация = СкладыКлиентСервер.СкладскаяОперацияПриемкиПоХозяйственнойОперации(Строка.ХозяйственнаяОперация);
	
	ОрдерОбъект.ЗаполнитьТоварыПоТоварамКПоступлению("Номенклатура",ТекущаяДата());
	
	Если ЗначениеЗаполнено(ОрдерОбъект.РабочийУчасток) И ОрдерОбъект.Товары.Количество()>0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
		|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
		|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
		|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
		|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
		|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
		|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
		|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
		|ИЗ
		|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
		|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
		|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
		|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
		|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
		|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
		|ИЗ
		|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
		|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ячейка";
		
		Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",ОрдерОбъект.Товары.Выгрузить());
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("РабочиеУчастки",ОрдерОбъект.РабочийУчасток);
		
		ОрдерОбъект.Товары.Очистить();
		ОрдерОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
	ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ОрдерОбъект.Ссылка;
КонецФункции

Функция ПолучитьОрдерПоСекцииИРаспоряжению(Секция,Распоряжение)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение
		|	И ПриходныйОрдерНаТовары.РабочийУчасток = &РабочийУчасток
		|	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

&НаКлиенте
Процедура ПриемкаПоРейсуОрдера(Команда)
	
	СозданныеОрдера = Новый Массив();
	
	Для каждого Строка из Элементы.ОрдераВРаботе.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.ОрдераВРаботе.ДанныеСтроки(Строка);
		
		СозданныеОрдера.Добавить(ДанныеСтроки.Ссылка);
		
	КонецЦикла;        
	
	ОчиститьСообщения();
	
	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.ФормаПриемПоРейсу", Новый Структура("Сотрудник,СписокОрдеров",Исполнитель,СозданныеОрдера));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость(ИмяКоманды)
	ЭтаФорма.Заголовок = ИмяКоманды;
	СписокОчереди = Ложь;
	Если ИмяКоманды = "Список очереди" Тогда
		СписокОчереди = Истина;
		ИмяКоманды = "Отгрузка";
	КонецЕсли;  
	ЗаполнитьНужныйСписок(ИмяКоманды); 
	Элементы.ФормаИзменитьПериод.Видимость = ?(ИмяКоманды = "Отгрузка" ИЛИ ИмяКоманды = "Приемка" ИЛИ ИмяКоманды = "Пересчет", Истина, Ложь); 
	Элементы.ФормаКОтгрузке.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
	Элементы.ФормаВсе.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
	Элементы.ФормаКПриемке.Видимость =?(ИмяКоманды = "Приемка", Истина, Ложь);
	Элементы.ФормаОтгружен.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
	Элементы.ФормаПринят.Видимость = ?(ИмяКоманды = "Приемка", Истина, Ложь);
	Элементы.ОбновитьОтгрузку.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
	Элементы.ОбновитьПриемку.Видимость = ?(ИмяКоманды = "Приемка", Истина, Ложь);
	Элементы.ФормаНайти.Видимость = ?(ИмяКоманды = "Приемка", Истина, Ложь);
    Элементы.ФормаОтменитьПоиск.Видимость = ?(ИмяКоманды = "Приемка", Истина, Ложь);
	//Элементы.ФормаПоказатьМножественноеВыделение.Видимость = ?(ИмяКоманды = "Приемка", Истина, Ложь);
    Элементы.ФормаНайти1.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
    Элементы.ФормаОтменитьПоиск1.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
	//Элементы.ФормаПоказатьМножественноеВыделение1.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
	Элементы.СтраницаПриемка.Видимость = ?(ИмяКоманды = "Приемка", Истина, Ложь);
	Элементы.СтраницаОтгрузка.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
	Элементы.СтраницаПересчет.Видимость = ?(ИмяКоманды = "Пересчет", Истина, Ложь);
	Элементы.СтраницаДополнительно.Видимость = ?(ИмяКоманды = "Дополнительно", Истина, Ложь);
    Элементы.СтраницаПроверкаЦенников.Видимость = ?(ИмяКоманды = "ПроверкаЦенников", Истина, Ложь);
	Элементы.ФормаСортировкаПоДате.Видимость = ?(ИмяКоманды = "Отгрузка", Истина, Ложь);
	Элементы.СтраницаИзучениеАссортимента.Видимость = ?(ИмяКоманды = "ИзучениеАссортимента", Истина, Ложь);
	Элементы.ФормаПоказатьСкрытьИзученное.Видимость = ?(ИмяКоманды = "ИзучениеАссортимента", Истина, Ложь);  
	Элементы.СтраницаБлокировки.Видимость = ?(ИмяКоманды = "БлокировкаТоваров", Истина, Ложь);
	Элементы.ФормаНайти2.Видимость = ?(ИмяКоманды = "Пересчет", Истина, Ложь);
	Элементы.ФормаОтменитьПоиск2.Видимость = ?(ИмяКоманды = "Пересчет", Истина, Ложь);
	Элементы.ФормаОбновить.Видимость = ?(ИмяКоманды = "Пересчет", Истина, Ложь);
	Элементы.ФормаСоздатьПересчет.Видимость = ?(ИмяКоманды = "Пересчет", Истина, Ложь); 
	Элементы.СтраницаПриемкаСдачаРабот.Видимость = ?(ИмяКоманды = "ПриемкаСдачаРабот", Истина, Ложь);    
	
	ВидимостьДляБухгалтера = ?(ИмяКоманды = "Пересчет" И ЗначениеЗаполнено(РольМобильногоКлиента) 
		И РольМобильногоКлиента = ПредопределенноеЗначение("Перечисление.РолиМобильногоКлиента.Бухгалтер"), Истина, Ложь); 
	Элементы.ФормаОтборПересчетовСклад.Видимость =  ВидимостьДляБухгалтера;
	Элементы.ФормаОтборПересчетовСекция.Видимость = ВидимостьДляБухгалтера;       
	Элементы.ГруппаПересчетыБухгалтер.Видимость = ВидимостьДляБухгалтера;       
	Элементы.ФормаОтборПересчетовСтатус.Видимость = ?(ИмяКоманды = "Пересчет", Истина, Ложь); 

	
КонецПроцедуры 


&НаКлиенте
Процедура РаспоряженияНаОтгрузку1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РаспоряженияНаОтгрузку1.ТекущиеДанные;
	
	СтруктураОрдераПоДокументу = ПолучитьРасходныеОрдераПоНакладной(ТекущиеДанные.Документ,ТекущиеДанные.Секция); 
	ОрдераПоДокументу = СтруктураОрдераПоДокументу.МассивОрдеров;
	ПодготовленныеОрдераПоДокументу = СтруктураОрдераПоДокументу.МассивОрдеровВСтатусеПодготовлено;
	СобранныеОрдераПоДокументу =  СтруктураОрдераПоДокументу.МассивОрдеровВСтатусеСобрано;
	ОрдераВРаботеПоДокументу =  СтруктураОрдераПоДокументу.МассивОрдеровВСтатусеВРаботе;
	ОтгруженныеОрдераПоДокументу =  СтруктураОрдераПоДокументу.МассивОрдеровВСтатусеОтгружен;

	ОжидаетсяОтбор = ТекущиеДанные.ОжидаетсяОтбор;
	Набирается = ТекущиеДанные.Набирается;
	Набран = ТекущиеДанные.Набран;
	ЧастичноОтгружен = ТекущиеДанные.ЧастичноОтгружен;
	Отгружен = ТекущиеДанные.Отгружен;
	
	Если СтруктураОрдераПоДокументу.ИзменитьСтатусы Тогда
		ОжидаетсяОтбор = СтруктураОрдераПоДокументу.ОжидаетсяОтбор;
	    Набирается = ОрдераВРаботеПоДокументу.Количество()>0;
	    Набран = СобранныеОрдераПоДокументу.Количество()>0;
	    ЧастичноОтгружен = ОтгруженныеОрдераПоДокументу.Количество()>0;
	    Отгружен = ОтгруженныеОрдераПоДокументу.Количество()>0;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтгрузка",ЭтотОбъект); 
    СписокКнопок = Новый СписокЗначений; 	
	ЗаголовокВопроса="";
	
	ОрдеровНет = Ложь;
	ОрдерОдин = Ложь;
	ОрдеровНесколько = Ложь;
	
	Если ОрдераПоДокументу.Количество()=0 Тогда
		ОрдеровНет = Истина;
	Иначе
		Если ОрдераПоДокументу.Количество()=1 Тогда
			ОрдерОдин = Истина;
			ТекущийРасходныйОрдер = ОрдераПоДокументу[0];
		Иначе
			ОрдеровНесколько = Истина;  
		КонецЕсли;
	КонецЕсли;
	
	Если ОжидаетсяОтбор Тогда
		Если Набирается ИЛИ Набран ИЛИ ЧастичноОтгружен Тогда
			#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
				Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
					СредстваМультимедиа.ВоспроизвестиТекст("Документ не собран полностью!","ru-RU");	
				КонецЕсли;
			#КонецЕсли
			Вопрос = "Документ не собран полностью";
		Иначе
			Вопрос = "Документ не собирался";
		КонецЕсли;
		Если ПодготовленныеОрдераПоДокументу.Количество()=0 Тогда
			СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Начать сборку"); 
		ИначеЕсли ПодготовленныеОрдераПоДокументу.Количество()=1 Тогда
			ТекущийРасходныйОрдер = ПодготовленныеОрдераПоДокументу[0];
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Начать сборку");
		Иначе
			СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Перейти к ордерам"); 
		КонецЕсли;
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");	
	ИначеЕсли Набирается Тогда
		Если ЧастичноОтгружен Тогда
			Вопрос = "Документ частично отгружен, но не собран полностью";
			Если ОрдерОдин Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Дособирать");
			Иначе
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Перейти к ордерам");
			КонецЕсли;
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		Иначе
			Вопрос = "Документ в работе";
			Если ОрдерОдин Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "ОК");  //Доработано по желаниюю Красновой. Собирает только 1
			Иначе
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Перейти к ордерам");
			КонецЕсли; 
		КонецЕсли;
	ИначеЕсли Набран Тогда
		Если ЧастичноОтгружен Тогда
			Вопрос = "Документ частично отгружен и собран";
			Если ОрдерОдин Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Выдать");
			Иначе
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Перейти к ордерам");
			КонецЕсли;
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		Иначе
			Вопрос = "Документ собран";
			Если ОрдерОдин Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Выдать");
			Иначе
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Перейти к ордерам");
			КонецЕсли; 
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		КонецЕсли;
	ИначеЕсли Отгружен Тогда
		    Вопрос = "Документ отгружен";
			Если ОрдерОдин Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Перейти к ордеру");
			Иначе
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Перейти к ордерам");
			КонецЕсли; 
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	КонецЕсли;
	
	Для Каждого Ордер_ Из ОрдераПоДокументу Цикл
		Вопрос = ДобавитьЗначениеЯчейкаПромежуточногоХранения(Вопрос, Ордер_);
	КонецЦикла;

	ПоказатьВопрос(Оповещение, Вопрос,  СписокКнопок,0,, "Текущее состояние");
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЗначениеЯчейкаПромежуточногоХранения(Вопрос, Объект)
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЯчейкаПромежуточногоХранения", Объект.Метаданные()) Тогда
		Если Объект.ЯчейкаПромежуточногоХранения.Ссылка <> Справочники.СкладскиеЯчейки.ПустаяСсылка() Тогда
			Вопрос = Вопрос + ", ячейка хранения " + Объект.ЯчейкаПромежуточногоХранения;
			Возврат Вопрос;
		КонецЕсли;
	КонецЕсли;
	Возврат Вопрос;
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросОтгрузка(Результат, Параметры) Экспорт 
	
	ТекущиеДанные = Элементы.РаспоряженияНаОтгрузку1.ТекущиеДанные;
	
	Если Результат = КодВозвратаДиалога.ОК Тогда	
		
		
		ТекущийРасходныйОрдер = СоздатьОрдераСервер(ТекущиеДанные.Распоряжение,ТекущиеДанные.Получатель,ТекущиеДанные.Документ,ТекущиеДанные.Секция);
		
		ОткрытьФорму("Документ.РасходныйОрдерНаТовары.Форма.Док_ФормаДокументаДляТСД",Новый Структура("Ключ,Сотрудник,Секции", ТекущийРасходныйОрдер, Исполнитель, Секции.ВыгрузитьЗначения()),,,,,Новый ОписаниеОповещения("ОбновитьСписокОтгрузка",ЭтотОбъект)); 	
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда

		ОткрытьФорму("Документ.РасходныйОрдерНаТовары.Форма.Док_ФормаДокументаДляТСД",Новый Структура("Ключ,Сотрудник,Секции", ТекущийРасходныйОрдер, Исполнитель, Секции.ВыгрузитьЗначения()),,,,,Новый ОписаниеОповещения("ОбновитьСписокОтгрузка",ЭтотОбъект)); 
		

	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		Элементы.ГруппаСтраницыОтгрузки.ТекущаяСтраница = Элементы.РасходныеОрдера;
		
		ОрдераВРаботеОтгрузка.Отбор.Элементы.Очистить();
		
		ЭлементОтбора = ОрдераВРаботеОтгрузка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Накладная");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ТекущиеДанные.Документ;
		
	КонецЕсли;  
		
КонецПроцедуры

Функция СоздатьОрдераСервер(Распоряжение,Получатель, ТекущаяНакладная, ТекущийРабочийУчасток)
	ТекущийДокумент = Неопределено; 
	
	Если АльтерраОбщегоНазначения.ОтгрузкаПоНакладным(ТекущаяНакладная.Дата,Склад) Тогда 
		
		РО = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
		РО.Дата = ТекущаяДата(); 
		РО.ДатаОтгрузки = ТекущаяДата(); 
		РО.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен;		
		РО.Ответственный = Пользователи.ТекущийПользователь();
		РО.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию();
		РО.Склад = Склад;
		РО.Получатель = Документы.РасходныйОрдерНаТовары.ПолучательДляЗаполнения(ТекущаяНакладная); 
		РО.РабочийУчасток = ТекущийРабочийУчасток;
		РО.Накладная = ТекущаяНакладная;
		РО.Контролер = ПолучитьПользователяСотрудника();
		РО.Сотрудник = Исполнитель;
		РО.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
		РО.СкладскаяОперация = ПолучитьСкладскуюОперацию(ТекущаяНакладная);
		
		ТЧТовары = Документы.РасходныйОрдерНаТовары.ПолучитьТоварыДляЗаполнения(ТекущаяНакладная,ТекущийРабочийУчасток,Склад);
		РО.ТоварыПоРаспоряжениям.Загрузить(ТЧТовары);				
		РО.ОтгружаемыеТовары.Загрузить(ТЧТовары); 
		РО.ОтгружаемыеТовары.Свернуть("Действие,Номенклатура,Характеристика,Назначение,Серия,Упаковка","Количество,КоличествоУпаковок");
		ЗаполнитьНарезку(РО);
		РО.Записать(РежимЗаписиДокумента.Проведение);    
		
		Возврат РО.Ссылка;	
		
	КонецЕсли;
	
	Получатели = Новый Соответствие;
	ЗаданияНаПеревозку = Новый Массив; 
	
	СтруктураПараметровСозданияРасходныхОрдеров = СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
	
	СтруктураПараметровСозданияРасходныхОрдеров.Склад = Склад;	
	СтруктураПараметровСозданияРасходныхОрдеров.Получатель = Получатель;
	МассивРаспоряжение = Новый Массив();
	МассивРаспоряжение.Добавить(Распоряжение);
	СтруктураПараметровСозданияРасходныхОрдеров.РаспоряженияНаОтгрузку = ПолучитьМассивРаспоряжений(ТекущаяНакладная,МассивРаспоряжение);
	ОформОрдера = СкладыСервер.ПереоформитьРасходныеОрдера(СтруктураПараметровСозданияРасходныхОрдеров); 	
	Если ОформОрдера.Количество()>0 Тогда
		Если ЗначениеЗаполнено(ТекущийРабочийУчасток) Тогда
				Для каждого Строка из ОформОрдера.ОформленныеОрдера Цикл
					
					Если Не ЗначениеЗаполнено(Строка.РасходныйОрдер.РабочийУчасток) ИЛИ 
						Строка.РасходныйОрдер.РабочийУчасток = ТекущийРабочийУчасток Тогда
						РО = Строка.РасходныйОрдер.ПолучитьОбъект();
						ТекущийДокумент = РО.Ссылка;
						РО.РабочийУчасток = ТекущийРабочийУчасток;
						РО.Накладная = ТекущаяНакладная;
						РО.Контролер = ПолучитьПользователяСотрудника();
						РО.Сотрудник = Исполнитель;
						РО.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
						
						ТоварыПоРаспоряжениям = РО.ТоварыПоРаспоряжениям.Выгрузить();
						РО.ТоварыПоРаспоряжениям.Очистить();
						РО.ТоварыПоРаспоряжениям.Загрузить(ПолучитьТоварыПоРаспоряжениямПоСекции(Распоряжение,ТоварыПоРаспоряжениям,Склад,ТекущийРабочийУчасток,ТекущаяНакладная));
						
						ОтгружаемыеТовары = РО.ОтгружаемыеТовары.Выгрузить(); 
						РО.ОтгружаемыеТовары.Очистить();
						РО.ОтгружаемыеТовары.Загрузить(ПолучитьОтгружаемыеТоварыПоСекции(Распоряжение,ОтгружаемыеТовары,Склад,ТекущийРабочийУчасток,ТекущаяНакладная));
						ЗаполнитьНарезку(РО);

						
						РО.Записать(РежимЗаписиДокумента.Проведение);
					Иначе
						РО =  Строка.РасходныйОрдер.Скопировать();
						РО.Дата = ТекущаяДата();
						РО.РабочийУчасток = ТекущийРабочийУчасток;
						РО.Накладная = ТекущаяНакладная;
						РО.Контролер = ПолучитьПользователяСотрудника();
						РО.Сотрудник = Исполнитель;
						РО.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;

						ТекущийДокумент = РО.Ссылка;
						
						ТоварыПоРаспоряжениям = РО.ТоварыПоРаспоряжениям.Выгрузить();
						РО.ТоварыПоРаспоряжениям.Очистить();
						РО.ТоварыПоРаспоряжениям.Загрузить(ПолучитьТоварыПоРаспоряжениямПоСекции(Распоряжение,ТоварыПоРаспоряжениям,Склад,ТекущийРабочийУчасток,ТекущаяНакладная));
						
						ОтгружаемыеТовары = РО.ОтгружаемыеТовары.Выгрузить(); 
						РО.ОтгружаемыеТовары.Очистить();
						РО.ОтгружаемыеТовары.Загрузить(ПолучитьОтгружаемыеТоварыПоСекции(Распоряжение,ОтгружаемыеТовары,Склад,ТекущийРабочийУчасток,ТекущаяНакладная));
						ЗаполнитьНарезку(РО);

						РО.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Для каждого Строка из ОформОрдера.ОформленныеОрдера Цикл
					РО = Строка.РасходныйОрдер.ПолучитьОбъект();
					ТекущийДокумент = РО.Ссылка;
					РО.Накладная = ТекущаяНакладная;					
					РО.Контролер = ПолучитьПользователяСотрудника();
					РО.Сотрудник = Исполнитель;
					РО.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
					ЗаполнитьНарезку(РО); 
					
					РО.Записать(РежимЗаписиДокумента.Запись);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		

	Возврат ТекущийДокумент;
	
КонецФункции 

  &НаСервере
 Процедура ЗаполнитьНарезку(РасходныйОрдер)
     ПредРаспоряжение = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
     
     Для каждого строка из РасходныйОрдер.ТоварыПоРаспоряжениям цикл 
    	Распоряжение = Строка.Распоряжение;
    	Если ПредРаспоряжение = Распоряжение Тогда
    		Прервать; 
    	Иначе 
    		ПредРаспоряжение = Распоряжение;
    		РаспоряжениеОбъект = Распоряжение.ПолучитьОбъект();
    		Если РаспоряжениеОбъект.Метаданные().ТабличныеЧасти.Найти("Нарезка")<>Неопределено
            И ЗначениеЗаполнено(Распоряжение.Нарезка) Тогда
    		   
    	    Для Каждого Строка Из Распоряжение.Нарезка Цикл
    			  ЗаполнитьЗначенияСвойств(РасходныйОрдер.Нарезка.Добавить(), Строка); 
    	    КонецЦикла; 
    		  
    	   КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    КонецПроцедуры
    


&НаКлиенте
Процедура ОрдераВРаботеОтгрузкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СсылкаНаЭлемент = Элементы.ОрдераВРаботеОтгрузка.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("Ключ,Сотрудник,Секции", СсылкаНаЭлемент.Ссылка, Исполнитель, Секции.ВыгрузитьЗначения()); 

	ОткрытьФорму("Документ.РасходныйОрдерНаТовары.Форма.Док_ФормаДокументаДляТСД",
						ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивРаспоряжений(Накладная,МассивРаспоряжений)
	
	Распоряжение = Документы.ЗаказНаПеремещение.ПустаяСсылка();
	
	Если МассивРаспоряжений.Количество()=1 Тогда
		Если ТипЗнч(МассивРаспоряжений[0]) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			Распоряжение = МассивРаспоряжений[0];
		Иначе
			Возврат МассивРаспоряжений;
		КонецЕсли;
	Иначе
		Возврат МассивРаспоряжений;
	КонецЕсли;
	 
	Если Не Распоряжение.Пустая() Тогда
		  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.ЗаказНаПеремещение КАК ЗаказНаПеремещение
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		|	И ПеремещениеТоваровТовары.ЗаказНаПеремещение <> &ЗаказНаПеремещение
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровТовары.ЗаказНаПеремещение";
	
	Запрос.УстановитьПараметр("Ссылка", Накладная);
	Запрос.УстановитьПараметр("ЗаказНаПеремещение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивРаспоряжений.Добавить(ВыборкаДетальныеЗаписи.ЗаказНаПеремещение);
	КонецЦикла;
	
	Возврат МассивРаспоряжений;

	КонецЕсли;
	
КонецФункции

Функция ПолучитьОтгружаемыеТоварыПоСекции(Распоряжение,Таблица,Склад,Секция,Накладная)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
	|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
	|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
	|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
	|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
	|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
	|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
	|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
	|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
	|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
	|ИЗ
	|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
	|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
	|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
	|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
	|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
	|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
	|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
	|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
	|ИЗ
	|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВнешняяТаблицаНоменклатуры.Номенклатура В(&МассивНоменклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование";
	
	Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",Таблица);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("РабочиеУчастки",Секция);
	Запрос.УстановитьПараметр("МассивНоменклатура",Накладная.Товары.ВыгрузитьКолонку("Номенклатура"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		ТоварыПоНакладной = Накладная.Товары.Выгрузить();
		ТоварыПоНакладной.Свернуть("Номенклатура", "КоличествоУпаковок, Количество");
		Для Каждого Строка Из Результат Цикл
			Для Каждого СтрокаН Из ТоварыПоНакладной Цикл 
				Если Строка.Номенклатура = СтрокаН.Номенклатура И Строка.Количество > СтрокаН.Количество Тогда
					Строка.Количество = СтрокаН.Количество;
					Строка.КоличествоУпаковок = СтрокаН.КоличествоУпаковок;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
			
	Возврат Результат;

КонецФункции

Функция ПолучитьТоварыПоРаспоряжениямПоСекции(Распоряжение,Таблица,Склад,Секция,Накладная)
	ЗапросТ = Новый Запрос;
	ЗапросТ.Текст = 
	"ВЫБРАТЬ
	|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
	|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
	|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ВнешняяТаблицаНоменклатуры.Распоряжение КАК Распоряжение,
	|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
	|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
	|ИЗ
	|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
	|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ВнешняяТаблицаНоменклатуры.Распоряжение КАК Распоряжение,
	|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
	|ИЗ
	|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВнешняяТаблицаНоменклатуры.Номенклатура В(&МассивНоменклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование";
	
	ЗапросТ.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",Таблица);
	ЗапросТ.УстановитьПараметр("Склад",Склад);
	ЗапросТ.УстановитьПараметр("РабочиеУчастки",Секция);
    ЗапросТ.УстановитьПараметр("МассивНоменклатура",Накладная.Товары.ВыгрузитьКолонку("Номенклатура"));

	Результат = ЗапросТ.Выполнить().Выгрузить();
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		ТоварыПоНакладной = Накладная.Товары.Выгрузить();
		ТоварыПоНакладной.Свернуть("Номенклатура", "Количество");
		Для Каждого Строка Из Результат Цикл
			Для Каждого СтрокаН Из ТоварыПоНакладной Цикл 
				Если Строка.Номенклатура = СтрокаН.Номенклатура И Строка.Количество > СтрокаН.Количество Тогда
					Строка.Количество = СтрокаН.Количество;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;


КонецФункции

&НаСервере
Функция ПолучитьРасходныеОрдераПоНакладной(Документ,Секция)
	
	СтруктураВозврата = Новый Структура;
	
	МассивОрдеров = Новый Массив();
	МассивОрдеровВСтатусеПодготовлено = Новый Массив();
	МассивОрдеровВСтатусеВРаботе = Новый Массив();
	МассивОрдеровВСтатусеСобрано = Новый Массив();
	МассивОрдеровВСтатусеОтгружен = Новый Массив();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Проведен = ИСТИНА
		|	И РасходныйОрдерНаТовары.Накладная = &Накладная
		|	И РасходныйОрдерНаТовары.РабочийУчасток = &РабочийУчасток";
	
	Запрос.УстановитьПараметр("Накладная", Документ);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 МассивОрдеров.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		 Если ВыборкаДетальныеЗаписи.Ссылка.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен Тогда
			 МассивОрдеровВСтатусеПодготовлено.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		 КонецЕсли;
		 Если ВыборкаДетальныеЗаписи.Ссылка.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Тогда
			 МассивОрдеровВСтатусеСобрано.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		 КонецЕсли;
		 Если ВыборкаДетальныеЗаписи.Ссылка.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору Тогда
			 МассивОрдеровВСтатусеВРаботе.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		 КонецЕсли;
		 Если ВыборкаДетальныеЗаписи.Ссылка.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
			 МассивОрдеровВСтатусеОтгружен.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		 КонецЕсли;
	КонецЦикла;

	СтруктураВозврата.Вставить("МассивОрдеров",МассивОрдеров);
	СтруктураВозврата.Вставить("МассивОрдеровВСтатусеПодготовлено",МассивОрдеровВСтатусеПодготовлено);
    СтруктураВозврата.Вставить("МассивОрдеровВСтатусеВРаботе",МассивОрдеровВСтатусеВРаботе);
    СтруктураВозврата.Вставить("МассивОрдеровВСтатусеСобрано",МассивОрдеровВСтатусеСобрано);
    СтруктураВозврата.Вставить("МассивОрдеровВСтатусеОтгружен",МассивОрдеровВСтатусеОтгружен);

	ИзменитьСтатусы = Ложь;
	ОжидаетсяОтбор = Ложь;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если Документ.РеализацияПоЗаказам Тогда
			
			ИзменитьСтатусы = Истина;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
			|	РеализацияТоваровУслугТовары.Назначение КАК Назначение,
			|	СУММА(РеализацияТоваровУслугТовары.КоличествоУпаковок) КАК КоличествоУпаковок1
			|ПОМЕСТИТЬ ВТ_РТ
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
			|		ПО (РеализацияТоваровУслугТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
			|				И РеализацияТоваровУслугТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад)
			|ГДЕ
			|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
			|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочийУчасток
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслугТовары.Номенклатура,
			|	РеализацияТоваровУслугТовары.Характеристика,
			|	РеализацияТоваровУслугТовары.Назначение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура КАК Номенклатура,
			|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика,
			|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение КАК Назначение,
			|	СУММА(РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок) КАК КоличествоУпаковок
			|ПОМЕСТИТЬ ВТ_РО
			|ИЗ
			|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
			|ГДЕ
			|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Накладная = &Ссылка
			|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Проведен
			|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.РабочийУчасток = &РабочийУчасток
			|	И НЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Статус = &Статус
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура,
			|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика,
			|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИСТИНА КАК ОжидаетсяОтбор
			|ИЗ
			|	ВТ_РТ КАК ВТ_РТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РО КАК ВТ_РО
			|		ПО ВТ_РТ.Номенклатура = ВТ_РО.Номенклатура
			|			И ВТ_РТ.Характеристика = ВТ_РО.Характеристика
			|			И ВТ_РТ.Назначение = ВТ_РО.Назначение
			|
			|ИМЕЮЩИЕ
			|	МАКСИМУМ(ЕСТЬNULL(ВТ_РТ.КоличествоУпаковок1, 0) - ЕСТЬNULL(ВТ_РО.КоличествоУпаковок, 0)) > 0";
			
			Запрос.УстановитьПараметр("Ссылка", Документ); 
			Запрос.УстановитьПараметр("РабочийУчасток", Секция);
			Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыРасходныхОрдеров.Подготовлен);
			
			ОжидаетсяОтбор = Не Запрос.Выполнить().Пустой();
			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ИзменитьСтатусы",ИзменитьСтатусы);
	СтруктураВозврата.Вставить("ОжидаетсяОтбор",ОжидаетсяОтбор);   
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтатусОрдера(РасходныйОрдер)
	Возврат РасходныйОрдер.Статус;
КонецФункции

&НаКлиенте
Процедура ОбновитьОтгрузку(Команда)
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка(); 
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриемкаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.Распоряжения Тогда
		УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыОтгрузкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.РаспоряженияНаОтгрузку Тогда
		УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОбновлениеСпискаДляТеста(Команда)
	ПодключитьОбработчикОжидания("ОбработатьОжидание", 10, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОбновлениеСпискаДляТеста(Команда)
	ОтключитьОбработчикОжидания("ОбработатьОжидание"); 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОжидание() Экспорт
 УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПересчетаПриИзменении(Элемент)
	УстанавливаемЗначенияПараметровДинамическихСписковПересчет();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериод(Команда)
	Если ИмяКоманды = "Приемка" Тогда
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
		Диалог.Период = ДатаПоступления;        
		Если Диалог.Редактировать() Тогда
			ДатаПоступления = Диалог.Период;
		КонецЕсли;
		УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
	ИначеЕсли ИмяКоманды = "Отгрузка" Тогда
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
		Диалог.Период = ДатаОтгрузки;        
		Если Диалог.Редактировать() Тогда
			ДатаОтгрузки = Диалог.Период;
		КонецЕсли;
		УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
	ИначеЕсли ИмяКоманды = "Пересчет" Тогда
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
		Диалог.Период = ДатаПересчета;        
		Если Диалог.Редактировать() Тогда
			ДатаПересчета = Диалог.Период;
		КонецЕсли;
		УстанавливаемЗначенияПараметровДинамическихСписковПересчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КПриемке(Команда)
	 СостояниеПоступленияФильтр = "КПриемке";
     УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
КонецПроцедуры

&НаКлиенте
Процедура Принят(Команда)
	 СостояниеПоступленияФильтр = "Принят";
     УстанавливаемЗначенияПараметровДинамическихСписковПриемка();
КонецПроцедуры

&НаКлиенте
Процедура Отгружен(Команда)
	СостояниеОтгрузки = "Отгружен";
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура КОтгрузке(Команда)
	СостояниеОтгрузки = "ОжидаетсяОтбор";
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();  
КонецПроцедуры
                        
&НаКлиенте
Процедура ПроверкиЦенниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаНаЭлемент = Элементы.ПроверкиЦенников.ТекущаяСтрока;
	
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлемент);
	ОткрытьФорму("Документ.ПроверкаЦенников.Форма.ФормаДокументаДляТСД", ПараметрыФормы); 
	
КонецПроцедуры

Функция ПолучитьПоСотрудникуДанные(Исполнитель)
	Структура = Новый Структура("Организация,Подразделение",Исполнитель.Организация,Исполнитель.Подразделение);
	Возврат Структура;
КонецФункции

&НаКлиенте
Процедура СоздатьПроверкуЦенников(Команда)
	
	Основание = Новый Структура;
	ДанныеПоСотруднику = ПолучитьПоСотрудникуДанные(Исполнитель);
	Основание.Вставить("Организация",ДанныеПоСотруднику.Организация);
	Основание.Вставить("Подразделение",ДанныеПоСотруднику.Подразделение);
	Основание.Вставить("Склад",Склад);
	Основание.Вставить("Автор",Исполнитель);
		
	ОткрытьФорму("Документ.ПроверкаЦенников.Форма.ФормаДокументаДляТСД",
	Новый Структура("Основание",Основание));
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПоДате(Команда)
	
	ДатаСортировки = "ДатаДокумента";

	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
	
КонецПроцедуры

&НаКлиенте
Процедура Все(Команда)
	СостояниеОтгрузки = "";
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтборОрдеровПоСотруднику(Команда)
	ОтборОрдеровПоСотруднику = Не ОтборОрдеровПоСотруднику;
	УстанавливаемЗначенияПараметровДинамическихСписковОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоТипу()
	
	СтруктураСписка = ТаблицаИзученийАссортимента.КомпоновщикНастроек.Настройки.Структура;
	
	Если СтруктураСписка.Количество() > 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ГруппировкаСписка = СтруктураСписка.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	ЭлементГруппировки = ГруппировкаСписка.ПоляГруппировки. Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	
	//ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Родитель");
	
	Элементы.ТаблицаИзученийАссортимента.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;
	ТаблицаИзученийАссортимента.КомпоновщикНастроек.ЗагрузитьНастройки(ТаблицаИзученийАссортимента.КомпоновщикНастроек.Настройки); 
	
КонецПроцедуры


#Область ИзучениеМатериала
&НаСервере
Функция ПолучитьСсылкуНаДокументИзучениеАссортимента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзучениеАссортимента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИзучениеАссортимента КАК ИзучениеАссортимента
	|ГДЕ
	|	ИзучениеАссортимента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИзученияАссортимента.ВРаботе)
	|			И НЕ ИзучениеАссортимента.ПометкаУдаления
	|			И ИзучениеАссортимента.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Док = Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Док = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли; 
	
	Возврат Док;
	
КонецФункции

&НаКлиенте
Процедура НачатьИзучениеПоПорядку(Команда)
	СсылкаНаДокумент = ПолучитьСсылкуНаДокументИзучениеАссортимента();
	НачатьИзучение(СсылкаНаДокумент);
КонецПроцедуры

&НаКлиенте
Процедура НачатьИзучение(СсылкаНаДокумент)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СсылкаНаДокумент);
	ПараметрыФормы.Вставить("Сотрудник", Исполнитель);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокументаИзучения", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ИзучениеАссортимента.Форма.ФормаДокументаТСД", ПараметрыФормы,,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИзученийАссортиментаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные.Свойство("Порядок") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
			
			ДокСсылка = Элемент.ТекущиеДанные.Ссылка;
			Статус = Элемент.ТекущиеДанные.Статус;
			
			Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.Завершено") Тогда

				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Повтор", Истина);
				ПараметрыФормы.Вставить("Сотрудник", Исполнитель);
				ПараметрыФормы.Вставить("ЗначениеКопирования", Элемент.ТекущиеДанные.Ссылка);
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
				ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьНовоеИзучение", ЭтотОбъект, ДополнительныеПараметры), "Изучение по этой точке пересчета завершено, Вы хотите повторить обучение?", РежимДиалогаВопрос.ДаНет);

				
			ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.ВРаботе") Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Ключ", ДокСсылка);
				ПараметрыФормы.Вставить("Сотрудник", Исполнитель);
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокументаИзучения", ЭтотОбъект);
				ОткрытьФорму("Документ.ИзучениеАссортимента.Форма.ФормаДокументаТСД", ПараметрыФормы,,,,,Оповещение);
				
			ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.НеИзучено") Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Повтор", Истина);
				ПараметрыФормы.Вставить("Сотрудник", Исполнитель);
				ПараметрыФормы.Вставить("ЗначениеКопирования", Элемент.ТекущиеДанные.Ссылка);
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
				ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьНовоеИзучение", ЭтотОбъект, ДополнительныеПараметры), "Начать повторное изучение по точке?", РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
			
		Иначе
			
			Точка = Элемент.ТекущиеДанные.ТочкаПересчетаОбучение;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Сотрудник", Исполнитель);
			ПараметрыФормы.Вставить("Повтор", Истина);
			ПараметрыФормы.Вставить("ТочкаПересчетаОбучение", Точка);
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокументаИзучения", ЭтотОбъект);
			ОткрытьФорму("Документ.ИзучениеАссортимента.Форма.ФормаДокументаТСД", ПараметрыФормы,,,,,Оповещение);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовоеИзучение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокументаИзучения", ЭтотОбъект);
		ОткрытьФорму("Документ.ИзучениеАссортимента.Форма.ФормаДокументаТСД", ДополнительныеПараметры.ПараметрыФормы,,,,,Оповещение);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДокументПриемкаСдачаРабот(Результат, ДополнительныеПараметры) Экспорт
	Элементы.ДокументыПриемкаСдачаРабот.Обновить();	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияДокументаИзучения(Результат, ДополнительныеПараметры) Экспорт
	Элементы.ТаблицаИзученийАссортимента.Обновить();	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьСкрытьИзученное(Команда)
	ТолькоНеИзученное = Не ТолькоНеИзученное;
	УстановитьОтборПоИзучению();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоИзучению()
	УстанавливаемЗначенияПараметровДинамическихСписковИзучениеАссортимента();
	Элементы.ТаблицаИзученийАссортимента.Обновить();
КонецПроцедуры
#КонецОбласти


&НаКлиенте
Процедура СоздатьПересчет(Команда)
	ПараметрыФормы = Новый Структура("Склад, Сотрудник", Склад, Исполнитель);
	ОткрытьФорму("Документ.ПересчетТоваров.Форма.Док_ФормаДокументаТСД", ПараметрыФормы); 
КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрихкодКамера(Команда)
	
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		Данные = Новый Структура("Штрихкод, Количество", Штрихкод, 1); 	
		
		ОбработатьШтрихкоды(Данные);		

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПересчетовСтатус(Команда)
	Элементы.СтраницаПересчет.Видимость = Ложь;
	Элементы.СчитатьШтрихкодКамера.Видимость = Ложь;
	Элементы.СтраницаОтборПересчетовСтатус.Видимость = Истина;
КонецПроцедуры    

&НаКлиенте
Процедура УстановитьСтатусПересчетов(Команда)
	Элементы.СтраницаПересчет.Видимость = Истина; 
	Элементы.СчитатьШтрихкодКамера.Видимость = Истина;
	Элементы.СтраницаОтборПересчетовСтатус.Видимость = Ложь;   
	
	УстанавливаемЗначенияПараметровДинамическихСписковПересчет();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПересчетовСклад(Команда)        
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораСклада", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;                
	ПараметрыФормы.Вставить("ПометкаУдаления", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ОткрытьФорму("Справочник.Склады.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
			
КонецПроцедуры
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораСклада(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда  
        ФильтрПересчетовСклад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");  
	Иначе
		ФильтрПересчетовСклад = Значение;
	КонецЕсли;
	
	УстанавливаемЗначенияПараметровДинамическихСписковПересчет();			
КонецПроцедуры

&НаКлиенте
Процедура ОтборПересчетовСекция(Команда)
    ЗначениеОтбора = Новый Структура;
	Если ЗначениеЗаполнено(ФильтрПересчетовСклад) Тогда
    	ЗначениеОтбора.Вставить("Владелец", ФильтрПересчетовСклад);
	КонецЕсли;
    ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);

    ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);		
		
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораСекции", ЭтаФорма);

	ОткрытьФорму("Справочник.РабочиеУчастки.ФормаВыбора",ПараметрыВыбора,
	        ЭтаФорма, , , , ОбработкаВыбора);		
КонецПроцедуры
&НаКлиенте		
Процедура ПриЗакрытииФормыВыбораСекции(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда  
        ФильтрПересчетовСекции = ПредопределенноеЗначение("Справочник.РабочиеУчастки.ПустаяСсылка");  
	Иначе
		ФильтрПересчетовСекции = Значение;
	КонецЕсли;
	
	УстанавливаемЗначенияПараметровДинамическихСписковПересчет();			
КонецПроцедуры

Функция ПолучитьСкладскуюОперацию(ТекущаяНакладная) 
	
	СкладскаяОперация = Перечисления.СкладскиеОперации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СкладыСервер.ТекстЗапросаСкладскаяОперацияТипДокумента()+ " 
	|ВЫБРАТЬ
	|	СкладскаяОперацияТипДокумента.СкладскаяОперация КАК СкладскаяОперация
	|ИЗ
	|	СкладскаяОперацияТипДокумента КАК СкладскаяОперацияТипДокумента
	|ГДЕ
	|	СкладскаяОперацияТипДокумента.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип",ТипЗнч(ТекущаяНакладная));
	
	Результат = Запрос.Выполнить().Выбрать();  
	Результат.Следующий();
	
	СкладскаяОперация = Результат.СкладскаяОперация;
	
	Возврат  СкладскаяОперация;
	
КонецФункции 

&НаКлиенте
Процедура ОбновитьСписокОтгрузка(Результат, Параметры) Экспорт
	 ОбновитьОтгрузку(Неопределено); 
 КонецПроцедуры

#КонецОбласти








