
&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ВладелецНоменклатуры) Тогда 
		Элементы.НадписьВладельца.Заголовок = Строка(Объект.ВладелецНоменклатуры);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Док_КратностьПоставщикаПриИзмененииПосле(Элемент)
	Если Объект.КратностьПоставщика <> 0 Тогда
		Объект.КоэффициентКратности = Объект.КратностьНаша/Объект.КратностьПоставщика;
	Иначе
		Объект.КоэффициентКратности = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_КратностьНашаПриИзмененииПосле(Элемент)
	Если Объект.КратностьПоставщика <> 0 Тогда
		Объект.КоэффициентКратности = Объект.КратностьНаша/Объект.КратностьПоставщика;
	Иначе
		Объект.КоэффициентКратности = 0;
	КонецЕсли;
КонецПроцедуры
