//Функция формирует движения для регистра "Проблемные документы":
//по Ордеру при создании делает движения с признаком "Эталон" т.е. 
//это движения, которые до изменений
//При внесении изменений в Ордер, либо в реализацию, по данному регистру делаются движения
//с признаком "Ордер", либо "Реализация" - это строки отличия от эталона.
Функция СформироватьНаборЗаписейДляПроблемныхЗаявок(Ссылка, УдолениеДвижений=Ложь) Экспорт

	ЭтоОрдер = (ТипЗнч(ССылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары"));
	Ордер            = ?(ЭтоОрдер,Ссылка,ВернутьПодчиненныйОрдер(Ссылка));
	ДокументОтгрузки = ?(ЭтоОрдер,Ордер.Распоряжение,Ссылка);
	//1. Если нет ордера, то ничего не делаем
	Если Не ЗначениеЗаполнено(Ордер) Тогда
		Возврат Истина;
	КонецЕсли;	
	//2. Документ уже отработан. Чистим движения при наличии таковых
	Если ОрдерНабран(Ссылка,ЭтоОрдер) или УдолениеДвижений Тогда
		НЗ = РегистрыСведений.ПроблемныеОтгрузки.СоздатьНаборЗаписей();
		НЗ.Отбор.ДокументОтгрузки.Установить(ДокументОтгрузки);
		НЗ.Прочитать();
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПроблемныеОтгрузки");
		ЭлементБлокировки.УстановитьЗначение("ДокументОтгрузки", ДокументОтгрузки);
		ЭлементБлокировки.УстановитьЗначение("Ордер", Ордер);
		Попытка
			Блокировка.Заблокировать();
			Если НЗ.Количество()>0 Тогда
				НЗ.Очистить();
				НЗ.Записать();
			КонецЕсли;
		Исключение
			Сообщить("Не удалось сформировать движения по регистру ""Проблеммные документы"" по причине: "+ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина; //Результат
	КонецЕсли;	
	//2 Получаем полную таблицу записей для Ордера и Документа отгрузки
	ТЗ = ПолучитьТаблицуЗаписейПроблемныхДокументов(Ордер, ДокументОтгрузки);
	//Блокируем записи нашего документа
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПроблемныеОтгрузки");
	ЭлементБлокировки.УстановитьЗначение("ДокументОтгрузки", ДокументОтгрузки);
	ЭлементБлокировки.УстановитьЗначение("Ордер", Ордер);
	Попытка
		Блокировка.Заблокировать();
		НЗ = РегистрыСведений.ПроблемныеОтгрузки.СоздатьНаборЗаписей();
		НЗ.Отбор.ДокументОтгрузки.Установить(ДокументОтгрузки);
		НЗ.Загрузить(тз);
		НЗ.Записать();
		Если тз.Найти(Перечисления.ВидыЗаписейПроблемныхДокументов.Накладная)<>Неопределено Тогда
			ОбъектОрдера = Ордер.ПолучитьОбъект();
			ОбъектОрдера.ЕстьИзмененияВНакладной = Истина;
			ОбъектОрдера.Записать(РежимЗаписиДокумента.Запись)
		КонецЕсли;	
		Возврат Истина
	Исключение
		Сообщить("Не удалось сформировать движения по регистру ""Проблеммные документы"" по причине: "+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;	
	
КонецФункции

//Возвращает подчиненный, проведенный ордер
//иначе - неопределено
Функция ВернутьПодчиненныйОрдер(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ордер
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Проведен
	|	И РасходныйОрдерНаТовары.Распоряжение = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ордер;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//Возвращает истину, если ордер уже набран.
Функция ОрдерНабран(Ссылка, ЭтоОрдер=Ложь) Экспорт
	
	Если ЭтоОрдер Тогда
		МасЗапрещенныхСтатусов = Новый Массив;
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки);
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КПроверке);
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.Отгружен);
		Возврат МасЗапрещенныхСтатусов.Найти(Ссылка.Статус)<>Неопределено;
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Статус
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Распоряжение = &Ссылка
		|	И РасходныйОрдерНаТовары.Проведен
		|	И РасходныйОрдерНаТовары.Статус В (&МасЗапрещенныхСтатусов)";
		
		Запрос.УстановитьПараметр("МасЗапрещенныхСтатусов", МасЗапрещенныхСтатусов);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Возврат Не РезультатЗапроса.Пустой();	
	КонецЕсли;
	
КонецФункции

Функция ОграничитьДоступностьПриНаличииОрдераВСтатусе(Ссылка)
	
	МасЗапрещенныхСтатусов = Новый Массив;
	МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки);
	МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КПроверке);
	МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Статус В(&МасЗапрещенныхСтатусов)
	|	И РасходныйОрдерНаТовары.Проведен
	|	И РасходныйОрдерНаТовары.Распоряжение = &Ссылка";
	
	Запрос.УстановитьПараметр("МасЗапрещенныхСтатусов", МасЗапрещенныхСтатусов);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(),Ложь,Истина);
	
КонецФункции

Функция ИзменениеПризнакаРеализацииЕслиЕстьСобранныйОрдер(Ссылка,УстановливаемыйСтатус=Истина) Экспорт
	
	Если ТипЗнч(Ссылка.Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		МасЗапрещенныхСтатусов = Новый Массив;
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки);
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КПроверке);
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.Отгружен);
		Если МасЗапрещенныхСтатусов.Найти(Ссылка.Статус)<>Неопределено Тогда
			Если  Ссылка.Распоряжение.ЕстьСобранныйОрдер <> УстановливаемыйСтатус Тогда
				ОбъРеализации = Ссылка.Распоряжение.ПолучитьОбъект();
				ОбъРеализации.ЕстьСобранныйОрдер = УстановливаемыйСтатус;
				ОбъРеализации.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Иначе
			Если  Ссылка.Распоряжение.ЕстьСобранныйОрдер <> Ложь Тогда
				ОбъРеализации = Ссылка.Распоряжение.ПолучитьОбъект();
				ОбъРеализации.ЕстьСобранныйОрдер = Ложь;
				ОбъРеализации.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуЗаписейПроблемныхДокументов(Ордер, ДокументОтгрузки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроблемныеОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	ПроблемныеОтгрузки.Ордер КАК Ордер,
	               |	ПроблемныеОтгрузки.ВидЗаписи КАК ВидЗаписи,
	               |	ПроблемныеОтгрузки.Номенклатура КАК Номенклатура,
	               |	ПроблемныеОтгрузки.Характеристика КАК Характеристика,
	               |	ПроблемныеОтгрузки.Секция КАК Секция,
	               |	ПроблемныеОтгрузки.Количество КАК Количество
	               |ПОМЕСТИТЬ _01_Эталон
	               |ИЗ
	               |	РегистрСведений.ПроблемныеОтгрузки КАК ПроблемныеОтгрузки
	               |ГДЕ
	               |	ПроблемныеОтгрузки.ДокументОтгрузки.Ссылка = &Ссылка
	               |	И ПроблемныеОтгрузки.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Эталон)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументОтгрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК ДокументОтгрузки,
	               |	РасходныйОрдерНаТоварыТовары.Ссылка КАК Ордер,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Эталон) КАК ВидЗаписи,
	               |	РасходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	               |	РасходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
	               |	РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток КАК Секция,
	               |	РасходныйОрдерНаТоварыТовары.Количество КАК Количество
	               |ПОМЕСТИТЬ _02_Эталон
	               |ИЗ
	               |	Документ.РасходныйОрдерНаТовары.Товары КАК РасходныйОрдерНаТоварыТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	               |		ПО (РазмещениеОсновнаяЯчейка.Номенклатура = РасходныйОрдерНаТоварыТовары.Номенклатура)
	               |			И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	               |			И РасходныйОрдерНаТоварыТовары.Ссылка.Склад = РазмещениеОсновнаяЯчейка.Склад
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КОЛИЧЕСТВО(_0_Эталон.ДокументОтгрузки) КАК ЕстьЗаписи
	               |		ИЗ
	               |			_01_Эталон КАК _0_Эталон) КАК ВложенныйЗапрос
	               |		ПО (ЕСТЬNULL(ВложенныйЗапрос.ЕстьЗаписи, 0) = 0
	               |				ИЛИ ВложенныйЗапрос.ЕстьЗаписи ЕСТЬ NULL )
	               |ГДЕ
	               |	РасходныйОрдерНаТоварыТовары.Ссылка.Распоряжение = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	_01_Эталон.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	_01_Эталон.Ордер КАК Ордер,
	               |	_01_Эталон.ВидЗаписи КАК ВидЗаписи,
	               |	_01_Эталон.Номенклатура КАК Номенклатура,
	               |	_01_Эталон.Характеристика КАК Характеристика,
	               |	_01_Эталон.Секция КАК Секция,
	               |	_01_Эталон.Количество КАК Количество
	               |ПОМЕСТИТЬ _0_Эталон
	               |ИЗ
	               |	_01_Эталон КАК _01_Эталон
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	_02_Эталон.ДокументОтгрузки,
	               |	_02_Эталон.Ордер,
	               |	_02_Эталон.ВидЗаписи,
	               |	_02_Эталон.Номенклатура,
	               |	_02_Эталон.Характеристика,
	               |	_02_Эталон.Секция,
	               |	_02_Эталон.Количество
	               |ИЗ
	               |	_02_Эталон КАК _02_Эталон
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер КАК Ордер,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Ордер) КАК ВидЗаписи,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Характеристика КАК Характеристика,
	               |	ВложенныйЗапрос.Секция КАК Секция,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	               |ПОМЕСТИТЬ ИзмененыВОрдере
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РасходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК ДокументОтгрузки,
	               |		РасходныйОрдерНаТоварыТовары.Ссылка КАК Ордер,
	               |		ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Эталон) КАК ВидЗаписи,
	               |		РасходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	               |		РасходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
	               |		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток КАК Секция,
	               |		РасходныйОрдерНаТоварыТовары.Количество КАК Количество
	               |	ИЗ
	               |		Документ.РасходныйОрдерНаТовары.Товары КАК РасходныйОрдерНаТоварыТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	               |			ПО (РазмещениеОсновнаяЯчейка.Номенклатура = РасходныйОрдерНаТоварыТовары.Номенклатура)
	               |				И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	               |				И РасходныйОрдерНаТоварыТовары.Ссылка.Склад = РазмещениеОсновнаяЯчейка.Склад
	               |	ГДЕ
	               |		РасходныйОрдерНаТоварыТовары.Ссылка = &Ордер
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПроблемныеОтгрузки.ДокументОтгрузки,
	               |		ПроблемныеОтгрузки.Ордер,
	               |		ПроблемныеОтгрузки.ВидЗаписи,
	               |		ПроблемныеОтгрузки.Номенклатура,
	               |		ПроблемныеОтгрузки.Характеристика,
	               |		ПроблемныеОтгрузки.Секция,
	               |		-ПроблемныеОтгрузки.Количество
	               |	ИЗ
	               |		_0_Эталон КАК ПроблемныеОтгрузки) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.Товары КАК РасходныйОрдерНаТоварыТовары
	               |		ПО ВложенныйЗапрос.Номенклатура = РасходныйОрдерНаТоварыТовары.Номенклатура
	               |			И ВложенныйЗапрос.Характеристика = РасходныйОрдерНаТоварыТовары.Характеристика
	               |			И ВложенныйЗапрос.Ордер = РасходныйОрдерНаТоварыТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.Секция,
	               |	РасходныйОрдерНаТоварыТовары.Подтверждена
	               |
	               |ИМЕЮЩИЕ
	               |	(СУММА(ВложенныйЗапрос.Количество) <> 0
	               |		ИЛИ РасходныйОрдерНаТоварыТовары.Подтверждена)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер КАК Ордер,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Накладная) КАК ВидЗаписи,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Характеристика КАК Характеристика,
	               |	ВложенныйЗапрос.Секция КАК Секция,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	               |ПОМЕСТИТЬ ИзмененыВРеализацииНоНеИзмененыВОрдере
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РеализацияТоваровУслугТовары.Ссылка КАК ДокументОтгрузки,
	               |		&Ордер КАК Ордер,
	               |		ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Эталон) КАК ВидЗаписи,
	               |		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	               |		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток КАК Секция,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	               |				ТОГДА РеализацияТоваровУслугТовары.Упаковка.Коэффициент * РеализацияТоваровУслугТовары.КоличествоУпаковок
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.КоличествоУпаковок
	               |		КОНЕЦ КАК Количество
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	               |			ПО (РазмещениеОсновнаяЯчейка.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура)
	               |				И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	               |				И РеализацияТоваровУслугТовары.Ссылка.Склад = РазмещениеОсновнаяЯчейка.Склад
	               |	ГДЕ
	               |		РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПроблемныеОтгрузки.ДокументОтгрузки,
	               |		ПроблемныеОтгрузки.Ордер,
	               |		ПроблемныеОтгрузки.ВидЗаписи,
	               |		ПроблемныеОтгрузки.Номенклатура,
	               |		ПроблемныеОтгрузки.Характеристика,
	               |		ПроблемныеОтгрузки.Секция,
	               |		-ПроблемныеОтгрузки.Количество
	               |	ИЗ
	               |		_0_Эталон КАК ПроблемныеОтгрузки) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИзмененыВОрдере КАК ИзмененыВОрдере
	               |		ПО (ИзмененыВОрдере.Номенклатура = ВложенныйЗапрос.Номенклатура)
	               |			И (ИзмененыВОрдере.Характеристика = ВложенныйЗапрос.Характеристика)
	               |ГДЕ
	               |	ИзмененыВОрдере.Номенклатура ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.Секция
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВложенныйЗапрос.Количество) <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер,
	               |	ВложенныйЗапрос.ВидЗаписи,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.Секция,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	               |	ИСТИНА КАК Активность
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		_0_Эталон.ДокументОтгрузки КАК ДокументОтгрузки,
	               |		_0_Эталон.Ордер КАК Ордер,
	               |		_0_Эталон.ВидЗаписи КАК ВидЗаписи,
	               |		_0_Эталон.Номенклатура КАК Номенклатура,
	               |		_0_Эталон.Характеристика КАК Характеристика,
	               |		_0_Эталон.Секция КАК Секция,
	               |		_0_Эталон.Количество КАК Количество,
	               |		ИСТИНА КАК Активность
	               |	ИЗ
	               |		_0_Эталон КАК _0_Эталон
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИзмененыВОрдере.ДокументОтгрузки,
	               |		ИзмененыВОрдере.Ордер,
	               |		ИзмененыВОрдере.ВидЗаписи,
	               |		ИзмененыВОрдере.Номенклатура,
	               |		ИзмененыВОрдере.Характеристика,
	               |		ИзмененыВОрдере.Секция,
	               |		ИзмененыВОрдере.Количество,
	               |		ИСТИНА
	               |	ИЗ
	               |		ИзмененыВОрдере КАК ИзмененыВОрдере
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.ДокументОтгрузки,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Ордер,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.ВидЗаписи,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Номенклатура,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Характеристика,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Секция,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Количество,
	               |		ИСТИНА
	               |	ИЗ
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере КАК ИзмененыВРеализацииНоНеИзмененыВОрдере) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер,
	               |	ВложенныйЗапрос.ВидЗаписи,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.Секция";

	
	Запрос.УстановитьПараметр("Ордер", Ордер);
	Запрос.УстановитьПараметр("Ссылка", ДокументОтгрузки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ЕстьОрдерВСтатусеКОтбору(Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
		|	И РасходныйОрдерНаТовары.Проведен
		|	И РасходныйОрдерНаТовары.Распоряжение = &ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();	

КонецФункции

Процедура ОбновитьТаблицуТоваровОрдера(Ордер,Товары,ЕстьИзмененияВНакладной) Экспорт
	
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроблемныеОтгрузки.Номенклатура,
		|	ПроблемныеОтгрузки.Характеристика,
		|	СУММА(ПроблемныеОтгрузки.Количество) КАК Количество,
		|	СУММА(ПроблемныеОтгрузки.Количество) КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслугТовары.Упаковка ЕСТЬ NULL 
		|			ТОГДА ПроблемныеОтгрузки.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка
		|	КОНЕЦ КАК Упаковка
		|ИЗ
		|	РегистрСведений.ПроблемныеОтгрузки КАК ПроблемныеОтгрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ПроблемныеОтгрузки.ДокументОтгрузки = РеализацияТоваровУслугТовары.Ссылка
		|			И ПроблемныеОтгрузки.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ПроблемныеОтгрузки.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|ГДЕ
		|	ПроблемныеОтгрузки.Ордер = &Ордер
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроблемныеОтгрузки.Номенклатура,
		|	ПроблемныеОтгрузки.Характеристика,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслугТовары.Упаковка ЕСТЬ NULL 
		|			ТОГДА ПроблемныеОтгрузки.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ордер", Ордер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стр,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	ЕстьИзмененияВНакладной = Ложь;

КонецПроцедуры	

Функция СформироватьНаборЗаписейДляДокументовВСборке(Ссылка, Добавить=Истина) Экспорт 
	
	Если Ссылка.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено И
		НЕ Ссылка.Кассир = Справочники.Пользователи.ПустаяСсылка()      
		Тогда
		Попытка
			НЗ = РегистрыСведений.ДокументыВСборке.СоздатьНаборЗаписей();
			НЗ.Отбор.Документ.Установить(Ссылка);
			НЗ.Прочитать();
			Если НЗ.Количество() = 1 И Добавить Тогда
				Возврат Истина;
			ИначеЕсли НЗ.Количество() = 0 И Добавить Тогда
				стр = НЗ.Добавить();
				стр.Активность = Истина;
				стр.Документ   = Ссылка;
				стр.ДатаПоступленияВСборку = ТекущаяДата();
				НЗ.Записать();
				Возврат Истина;
			Иначе
				НЗ.Очистить();
				НЗ.Записать();
				Возврат Истина;
			КонецЕсли;
		Исключение
			#Если Клиент  Тогда
				Сообщить("Не удалось добавить документ в документы к сборке по причине: "+ОписаниеОшибки());
			#КонецЕсли
			Возврат Ложь;
		КонецПопытки;		
	Иначе
		НЗ = РегистрыСведений.ДокументыВСборке.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(Ссылка);
		НЗ.Прочитать();
		Если НЗ.Количество() > 0 Тогда
			НЗ.Очистить();
			НЗ.Записать();
        КонецЕсли;
		Возврат Истина;
	КонецЕсли;		 
		
КонецФункции	

Функция ОбновитьТаблицуТоваровРеализации(Реализация, Товары, ЕстьИзменения) Экспорт  
	
	Ордер = ВернутьПодчиненныйОрдер(Реализация);
	Если Не ЗначениеЗаполнено(Ордер) Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого стр Из Ордер.Товары Цикл
		Если стр.КоличествоУпаковок = 0 Тогда
			МасСтр = Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",стр.Номенклатура,стр.Характеристика));
			Если МасСтр.Количество()> 0 Тогда 
				Для Каждого ст Из МасСтр Цикл
					Товары.Удалить(Товары.Индекс(ст));
					ЕстьИзменения = Истина;
				КонецЦикла;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Возврат ЕстьИзменения;
	
КонецФункции	

Функция ПоискСотрудникаПоШтрихкоду(ШК)  Экспорт
	
	Сотрудник = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Код = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", ШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сотрудник = ВыборкаДетальныеЗаписи.Объект;
	КонецЦикла;
	
	Возврат Сотрудник;
	
КонецФункции

Функция ПоискПользователяПоШтрихкоду(ШК)  Экспорт
	
	Пользователь = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Пользователь
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Код = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", ШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
	КонецЦикла;
	
	Возврат Пользователь;
	
КонецФункции
