#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После ("ДобавитьКомандыСозданияНаОсновании")
Процедура Док_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВозвратТоваровМеждуОрганизациями) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = "ПеремещениеТоваров_ВозвратТоваровМеждуОрганизациями";
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ВозвратТоваровМеждуОрганизациями.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = "Возврат товаров между организациями";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииДополнительноКлиент.ВводНаОснованииКлиент";
	КонецЕсли;

	Документы.БлокировкаДвиженияТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = "ЗаказНаДоставкуКлиенту";
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказНаДоставкуКлиенту.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = "Заказ на доставку";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
КонецПроцедуры

Функция ПеремещениеНаФилиал(Документ) экспорт
	если ДопМодуль.ПолучитьНастройкиХранилища("НастройкиПеремещений")=НЕОПРЕДЕЛЕНО или не ДопМодуль.ПолучитьНастройкиХранилища("НастройкиПеремещений").Свойство("ТаблицаНастройки") тогда
		возврат ложь;
	конецесли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПеремещений.СкладОтправитель КАК СкладОтправитель,
		|	ТаблицаПеремещений.СкладПолучатель КАК СкладПолучатель
		|ПОМЕСТИТЬ ВР_Настройки
		|ИЗ
		|	&ТаблицаПеремещений КАК ТаблицаПеремещений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Настройки.СкладОтправитель КАК СкладОтправитель
		|ИЗ
		|	ВР_Настройки КАК ВР_Настройки
		|ГДЕ
		|	ВР_Настройки.СкладОтправитель = &СкладОтправитель
		|	И ВР_Настройки.СкладПолучатель = &СкладПолучатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВР_Настройки.СкладОтправитель
		|ИЗ
		|	ВР_Настройки КАК ВР_Настройки
		|ГДЕ
		|	ВР_Настройки.СкладПолучатель = &СкладОтправитель
		|	И ВР_Настройки.СкладОтправитель = &СкладПолучатель";
	
	Запрос.УстановитьПараметр("СкладОтправитель", Документ.СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", Документ.СкладПолучатель);
	Запрос.УстановитьПараметр("ТаблицаПеремещений", ДопМодуль.ПолучитьНастройкиХранилища("НастройкиПеремещений").ТаблицаНастройки);
	
	Возврат не Запрос.Выполнить().Пустой();
	
КонецФункции // ПеремещениеНаФилиал()

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("ОтгрузкаПоНакладным");  
	МеханизмыДокумента.Добавить("ДвижениеМаркированногоТовара"); 
КонецПроцедуры

Функция ТекстЗапросаТаблицаКОтгрузкеПоНакладным(Запрос, ТекстыЗапроса, Регистры, Документ) экспорт
	
	ИмяРегистра = "ТоварыКОтгрузкеПоНакладным";
	
	Если НЕ (ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) И 
		АльтерраОбщегоНазначения.ОтгрузкаПоНакладным(Документ.Дата,Документ.СкладОтправитель)) Тогда
		Возврат "";
	КонецЕсли;
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаТовары.ЗаказНаПеремещение В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка))
	|			ТОГДА ТаблицаТовары.ЗаказНаПеремещение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК Количество,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК РабочийУчасток,
	|   ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.НазначениеОтправителя.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.НазначениеОтправителя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение
	|ПОМЕСТИТЬ ВтТаблицаТоваров
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ТаблицаТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ТаблицаТовары.Ссылка.СкладОтправитель = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И ТаблицаТовары.Ссылка В(&Ссылка)
	|	И ТаблицаТовары.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаТовары.Ссылка.СкладОтправитель КАК Склад,
	|	ТаблицаТовары.РабочийУчасток КАК РабочийУчасток,
	|	ТаблицаТовары.Ссылка.СкладПолучатель КАК Получатель,
	|	ТаблицаТовары.Ссылка КАК Накладная,
	|	ТаблицаТовары.Заказ КАК Заказ,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ТаблицаТовары.Количество КАК КОтгрузке
	|ИЗ
	|	ВтТаблицаТоваров КАК ТаблицаТовары";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	// -
	
	Возврат ТекстЗапроса;

	
КонецФункции     

Функция ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры) экспорт
	ИмяРегистра = "ДвижениеМаркированногоТовара";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Штрихкоды.Ссылка.СкладПолучатель КАК Склад,
	|	Штрихкоды.Ссылка.Организация КАК Организация,
	|	ШтрихкодыУпаковка.Ссылка КАК ШтрихкодУпаковки,
	|	Штрихкоды.ШтрихкодУпаковки КАК Штрихкод,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ПеремещениеТоваров.ШтрихкодыУпаковок КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.ШтрихкодУпаковки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка
	|   И Штрихкоды.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|	И ВЫБОР
	|			КОГДА Штрихкоды.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
	|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Штрихкоды.Ссылка.СкладОтправитель,
	|	Штрихкоды.Ссылка.Организация,
	|	Штрихкоды.ШтрихкодУпаковки,
	|	ШтрихкодыУпаковка.Ссылка ,
	|	1
	|ИЗ
	|	Документ.ПеремещениеТоваров.ШтрихкодыУпаковок КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.ШтрихкодУпаковки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка    
	|   И Штрихкоды.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|	И ВЫБОР
	|			КОГДА Штрихкоды.Ссылка.СкладОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке
	|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.СкладОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";	
	
  	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецЕсли
