
Функция ПрименитьНовыйПорядокРаспределенияБонусов(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	 
	ДатаНачала = Константы.ДатаНачалаРаспределенияБонусов.Получить();
	ТекДата = ТекущаяДата();
	
	Если ТипЗнч(Объект) = Тип("Неопределено") Тогда
		 Результат = ?(ДатаНачала <> Дата(1,1,1) И ТекДата > ДатаНачала, Истина, Ложь);
	     Возврат Результат;
	 КонецЕсли;
	 
	ТипДокумента = ТипЗнч(Объект.Ссылка);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТипДокумента = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ДокДата = Объект.ДатаСоздания;
		Иначе
			ДокДата = Объект.Дата;
		КонецЕсли;
	Иначе
		ДокДата = ТекДата;
	КонецЕсли;
	
	ДатаНачала = ?(ДатаНачала = Дата(1,1,1), ДокДата + 86400, ДатаНачала);
	Результат = Ложь;
	
	Если Не ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") И ДокДата > ДатаНачала Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") И ДокДата > ДатаНачала Тогда
		Заказ = Объект.ЗаказКлиента;
		Если ЗначениеЗаполнено(Заказ) Тогда
			Результат = ПрименитьНовыйПорядокРаспределенияБонусов(Заказ);
		Иначе 
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
    УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

Функция ПолучитьСтрокиИзРеализацийПоЗаказу(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.КодСтроки КАК КодСтроки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Реализации.Ссылка
		|			ИЗ
		|				ВТ_Реализации)";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;

КонецФункции

Функция ПолучитьСуммуБалловКСписаниюИзЗаказа(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	isnull(СУММА(РезервБонусныхБаллов.СуммаБаллов), 0) КАК Сумма
		|ИЗ
		|	РегистрСведений.РезервБонусныхБаллов КАК РезервБонусныхБаллов
		|ГДЕ
		|	РезервБонусныхБаллов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат[0].Сумма;
	
КонецФункции

Функция ПолучитьСуммуБалловКНачислениюИзЗаказа(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ЗаказКлиентаТовары.СуммаНачисленныхБонусныхБалловВВалюте), 0) КАК Сумма
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат[0].Сумма;
	
КонецФункции

Функция ПолучитьОбщийРезервБонусныхБаллов(Партнер, Заказ = Неопределено) Экспорт 
	
	Резерв = 0;
	ОтборПоЗаказу = ?(Заказ = Неопределено, Ложь, Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	isnull(СУММА(РезервБонусныхБаллов.СуммаБаллов), 0) КАК Сумма
		|ИЗ
		|	РегистрСведений.РезервБонусныхБаллов КАК РезервБонусныхБаллов
		|ГДЕ
		|	РезервБонусныхБаллов.Партнер = &Партнер
		|	И (НЕ &ОтборПоЗаказу
		|			ИЛИ НЕ РезервБонусныхБаллов.Заказ = &Заказ)
		|	И РезервБонусныхБаллов.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ОтборПоЗаказу", ОтборПоЗаказу);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Резерв = Результат[0].Сумма;
	КонецЕсли;
	
	Возврат Резерв;
	
КонецФункции

Функция ПолучитьСуммуБалловСРеализациейИзЗаказа(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	isnull(СУММА(isnull(РезервБонусныхБаллов.СуммаБаллов, 0)), 0) КАК СуммаБаллов
		|ИЗ
		|	РегистрСведений.РезервБонусныхБаллов КАК РезервБонусныхБаллов
		|ГДЕ
		|	РезервБонусныхБаллов.Заказ = &Заказ";
		//|	И НЕ РезервБонусныхБаллов.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат[0].СуммаБаллов;
	
КонецФункции

Процедура ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Если Не ЗначениеЗаполнено(Источник.ЗаказКлиента) Или Не ПрименитьНовыйПорядокРаспределенияБонусов(Источник.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
		Заказ = Источник.ЗаказКлиента;
		
		ТоварыЗаказа = Заказ.Товары;
		
		СтрокиСРасхождением = Новый ТаблицаЗначений();
		СтрокиСРасхождением.Колонки.Добавить("КодСтроки");
		СтрокиСРасхождением.Колонки.Добавить("Разница");
		СтрокиСРасхождением.Колонки.Добавить("ЗаСтатус");
		СтрокиСРасхождением.Колонки.Добавить("Прочее");
		СтрокиСРасхождением.Колонки.Добавить("Статус"); 
		
		//АвтоопределениеДистрибуция
		Если Источник.РаспределитьТранспортныеДистрибуция Тогда
			СтрокиСРасхождением.Колонки.Добавить("Коэфф");
		КонецЕсли;
	    //

		СтатусПартнераРеализации = Источник.СтатусПартнераВПрограммеЛояльности;
		
		Для каждого СтрокаРеализации Из Источник.Товары Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("КодСтроки", СтрокаРеализации.КодСтроки);
			СтрокаЗаказа = ТоварыЗаказа.НайтиСтроки(Отбор);
			
			Если СтрокаЗаказа.Количество() = 0 Тогда 
				Отказ = Истина;
			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура " + СтрокаРеализации.Номенклатура + " не найдена в заказе.",, ,, Отказ);
				Возврат;
			КонецЕсли;
			
			Если СтрокаРеализации.Количество < СтрокаЗаказа[0].Количество
				ИЛИ СтрокаРеализации.СуммаНачисленныхБалловЗаСтатус <> СтрокаЗаказа[0].СуммаНачисленныхБалловЗаСтатус
				ИЛИ СтатусПартнераРеализации <> СтрокаЗаказа[0].Статус
			Тогда
				СтрокаСРасхождением = СтрокиСРасхождением.Добавить();
				СтрокаСРасхождением.КодСтроки = СтрокаЗаказа[0].КодСтроки;
				СтрокаСРасхождением.Разница = СтрокаЗаказа[0].Количество - СтрокаРеализации.Количество;
				СтрокаСРасхождением.ЗаСтатус = СтрокаРеализации.СуммаНачисленныхБалловЗаСтатус;
				СтрокаСРасхождением.Прочее = СтрокаРеализации.СуммаНачисленныхБалловПрочее;  
				
				//АвтоопределениеДистрибуция
				Если Источник.РаспределитьТранспортныеДистрибуция Тогда
					Коэфф = СтрокаЗаказа[0].СуммаРТ/(СтрокаЗаказа[0].Сумма); 
					СтрокаРеализации.СуммаРТ=СтрокаРеализации.Сумма*Коэфф; 
					СтрокаСРасхождением.Коэфф = Коэфф;
				КонецЕсли;
				//
				
				Если СтатусПартнераРеализации = Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.ПустаяСсылка() Тогда
					СтрокаСРасхождением.Статус = ПолучитьИнформациюПоБаллам(Источник.Дата, Источник.Партнер, Неопределено, Заказ).Статус;
				Иначе
					СтрокаСРасхождением.Статус = СтатусПартнераРеализации; 
				КонецЕсли;
			КонецЕсли; 
			
		КонецЦикла;		
	
		Если СтрокиСРасхождением.Количество() > 0 Тогда  			
			ОбработатьСтрокиВЗаказе(Заказ, СтрокиСРасхождением);  
		КонецЕсли;

		НачислитьБонусныеБаллы(Источник);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Источник);
		
		Если ЗначениеЗаполнено(Источник.Кассир) Тогда
			РезервБонусов = РегистрыСведений.РезервБонусныхБаллов;
			НаборЗаписей = РезервБонусов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Заказ.Установить(Заказ);
			НаборЗаписей.Прочитать();
			
			Для каждого Стр Из НаборЗаписей Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("КодСтроки", Стр.КодСтроки);
				СтрокаЗаказа = Источник.Товары.НайтиСтроки(Отбор);
				
				Если СтрокаЗаказа.Количество() > 0 Тогда
					Стр.Реализация = Источник.Ссылка;
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.Записать();	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		
		Если Не ПрименитьНовыйПорядокРаспределенияБонусов(Источник.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
		РезервБонусов = РегистрыСведений.РезервБонусныхБаллов;
		НаборЗаписей = РезервБонусов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Источник.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если Источник.Товары.Итог("СуммаБонусныхБалловКСписанию") > 0 Тогда
			
			Для Индекс = 1 - НаборЗаписей.Количество() По 0 Цикл
				Запись = НаборЗаписей[-Индекс];
				
				Отбор = Новый Структура;
				Отбор.Вставить("КодСтроки", Запись.КодСтроки);
				Отбор.Вставить("Отменено", Ложь);
				
				СтрокаЗаказа = Источник.Товары.НайтиСтроки(Отбор);
				Если СтрокаЗаказа.Количество() = 0 Тогда
					НаборЗаписей.Удалить(-Индекс);
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
			Для каждого Строка Из Источник.Товары Цикл
				
				Если Не ЗапрещеноИспользоватьБонусы(Строка) Тогда
					
					НаборЗаписей.Отбор.КодСтроки.Установить(Строка.КодСтроки);
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Количество() = 0 Тогда
						Запись = НаборЗаписей.Добавить();
					Иначе
						Запись = НаборЗаписей[0];
					КонецЕсли;
					Запись.Партнер = Источник.Партнер;
					Запись.Заказ = Источник.Ссылка;
					Запись.КодСтроки = Строка.КодСтроки;
					Запись.Номенклатура = Строка.Номенклатура;
					Запись.Количество = Строка.КоличествоУпаковок;
					Запись.СуммаБаллов = Строка.СуммаБонусныхБалловКСписанию;
					
					НаборЗаписей.Записать(); 
					
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Если Не ЗначениеЗаполнено(Источник.ЗаказКлиента) Или Не ПрименитьНовыйПорядокРаспределенияБонусов(Источник.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
		Заказ = Источник.ЗаказКлиента;
		
		Если  Заказ.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте") = 0 Тогда
			Возврат;
		КонецЕсли;
		
		РезервБонусов = РегистрыСведений.РезервБонусныхБаллов;
		НаборЗаписей = РезервБонусов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Заказ);
		НаборЗаписей.Прочитать();
		Для каждого Стр Из НаборЗаписей Цикл
			Если Стр.Реализация = Источник.Ссылка Тогда
				Стр.Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли; 
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		
		Если Источник.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте") = 0 
			Или Не ПрименитьНовыйПорядокРаспределенияБонусов(Источник.Ссылка) 
		Тогда
			Возврат;
		КонецЕсли;
		
		Заказ = Источник.Ссылка; 
		
		РезервБонусов = РегистрыСведений.РезервБонусныхБаллов;
		НаборЗаписей = РезервБонусов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Заказ);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольОстатковПоБонуснымБаллам(Док, Отказ) Экспорт
	
	СуммаОплаченныхБалловПриПродаже = Док.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	
	Если СуммаОплаченныхБалловПриПродаже = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Заказ = ?(ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента"), Док.Ссылка, Неопределено);
	
	ДоступноБаллов = ПолучитьИнформациюПоБаллам(Док.Дата, Док.Партнер, Неопределено, Заказ).ДоступныеБаллы;
	
	ОтгруженоРеализациями = ПолучитьСуммуБалловСРеализациейИзЗаказа(Заказ);
	
	Если СуммаОплаченныхБалловПриПродаже > ДоступноБаллов + ОтгруженоРеализациями Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У партнера не хватает бонусных баллов для оплаты!"+Символы.ПС+"Необходимо обновить оплату в документе.",, ,, Отказ);
	КонецЕсли;
	
	//БонуснаяПрограммаЛояльности = ПолучитьБПЛ(Док.КартаЛояльности);
	//ДокДата = Док.Дата;
	//ДокДата = ?(ДокДата <> Дата(1,1,1), ДокДата, ТекущаяДата());
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	БонусныеБаллыОстатки.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	//	|	БонусныеБаллыОстатки.Партнер КАК Партнер,
	//	|	БонусныеБаллыОстатки.НачисленоОстаток КАК НачисленоОстаток
	//	|ИЗ
	//	|	РегистрНакопления.БонусныеБаллы.Остатки(
	//	|			&Дата,
	//	|			Партнер = &Партнер
	//	|				И БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности) КАК БонусныеБаллыОстатки
	//	|ГДЕ
	//	|	БонусныеБаллыОстатки.НачисленоОстаток < 0";
	//
	//Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	//Запрос.УстановитьПараметр("Партнер", Док.Партнер);
	//Запрос.УстановитьПараметр("Дата", ДокДата);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У партнера не хватает бонусных баллов для оплаты!"+Символы.ПС+"Необходимо обновить оплату в документе.",, ,, Отказ);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтрокиВЗаказе(Ссылка, Строки)
	
	БонуснаяПрограмма = БонусныеБаллыСервер.БонуснаяПрограммаКартыЛояльности(Ссылка.КартаЛояльности);
	БонуснаяПрограммаЛояльности = БонуснаяПрограмма.БонуснаяПрограммаЛояльности;
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;
	
	ВалютаДокумента         = Ссылка.Валюта;
	ВалютаБонуснойПрограммы = БонуснаяПрограмма.Валюта;
	Если Не ЗначениеЗаполнено(ВалютаБонуснойПрограммы) Тогда
		ВалютаБонуснойПрограммы= Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;

	СтруктураКурсовВалютыДокумента         = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента,         ТекущаяДатаСеанса());
	СтруктураКурсовВалютыБонуснойПрограммы = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаБонуснойПрограммы, ТекущаяДатаСеанса());
	КурсКонвертацииБонусовВВалюту          = БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту; 
	
	ЗаказОбъект = Ссылка.ПолучитьОбъект();
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,ЗаказОбъект);
	
	ПоследняяСтрокаБезРеализации = Строки.Количество()-1;
	
	Для каждого Стр Из Строки Цикл
	
		Отбор = Новый Структура;
		Отбор.Вставить("КодСтроки", Стр.КодСтроки);
		
		НайденнаяСтрока = ЗаказОбъект.Товары.НайтиСтроки(Отбор)[0];
		БалловКРаспределению = НайденнаяСтрока.СуммаБонусныхБалловКСписанию;
		БалловЗаЕдиницу = БалловКРаспределению/НайденнаяСтрока.Количество;
		КоличествоВРеализации = НайденнаяСтрока.Количество - Стр.Разница;
		СуммаСписанияСтрокиЗаказа = НайденнаяСтрока.СуммаБонусныхБалловКСписанию;
				
		НайденнаяСтрока.Количество = КоличествоВРеализации;
		НайденнаяСтрока.КоличествоУпаковок = КоличествоВРеализации;
		НайденнаяСтрока.Сумма = НайденнаяСтрока.Цена*НайденнаяСтрока.Количество;
		НайденнаяСтрока.СуммаНачисленныхБалловЗаСтатус = Стр.ЗаСтатус;
		НайденнаяСтрока.СуммаНачисленныхБалловПрочее = Стр.Прочее;
		НайденнаяСтрока.СуммаБонусныхБалловКСписанию = КоличествоВРеализации*БалловЗаЕдиницу;
		НайденнаяСтрока.Статус = Стр.Статус;
		НайденнаяСтрока.СуммаБонусныхБалловКСписаниюВВалюте = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			НайденнаяСтрока.СуммаБонусныхБалловКСписанию * КурсКонвертацииБонусовВВалюту,
			СтруктураКурсовВалютыБонуснойПрограммы,
			СтруктураКурсовВалютыДокумента);
	 
		НайденнаяСтрока.СуммаАвтоматическойСкидки = НайденнаяСтрока.ПроцентАвтоматическойСкидки/100* КоличествоВРеализации*НайденнаяСтрока.Цена;
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НайденнаяСтрока,СтруктураДействий, Неопределено); 
		
		//АвтоопределениеДистрибуция
		Если Ссылка.РаспределитьТранспортныеДистрибуция Тогда
			НайденнаяСтрока.СуммаРТ=НайденнаяСтрока.Сумма*Стр.Коэфф;
		КонецЕсли;
        //
		Если Стр.Разница > 0 Тогда
			НоваяСтрока = ЗаказОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрока,,"КлючСвязи,КодСтроки");
			НоваяСтрока.Количество = Стр.Разница;
			НоваяСтрока.Количествоупаковок = Стр.Разница;
			НоваяСтрока.Сумма = НайденнаяСтрока.Цена*НайденнаяСтрока.Количество;
			
			//
			НоваяСтрока.СуммаАвтоматическойСкидки = НайденнаяСтрока.ПроцентАвтоматическойСкидки/100 * Стр.Разница*НайденнаяСтрока.Цена;
			//
			Если Строки.Индекс(Стр) = ПоследняяСтрокаБезРеализации Тогда
				НоваяСтрока.СуммаБонусныхБалловКСписанию = СуммаСписанияСтрокиЗаказа - НайденнаяСтрока.СуммаБонусныхБалловКСписанию;
			Иначе
				НоваяСтрока.СуммаБонусныхБалловКСписанию = Стр.Разница*БалловЗаЕдиницу;
			КонецЕсли;
			
			НоваяСтрока.СуммаБонусныхБалловКСписаниюВВалюте = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			НоваяСтрока.СуммаБонусныхБалловКСписанию * КурсКонвертацииБонусовВВалюту,
			СтруктураКурсовВалютыБонуснойПрограммы,
			СтруктураКурсовВалютыДокумента);
			
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока,СтруктураДействий, Неопределено); 
			//АвтоопределениеДистрибуция
			Если Ссылка.РаспределитьТранспортныеДистрибуция Тогда
				НоваяСтрока.СуммаРТ=НоваяСтрока.Сумма*Стр.Коэфф;
			КонецЕсли;
			//
		КонецЕсли;
	КонецЦикла;
	
	НачислитьБонусныеБаллы(ЗаказОбъект);
	
	//СтруктураПараметры = Новый Структура;
	//СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	//СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	//СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	//СтруктураПараметры.Вставить("УправляемыеСкидки", Неопределено);
	
	//РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры, ЗаказОбъект);
	
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры, ОбъектЗаказ)
	
	ПримененныеСкидки = СкидкиНаценкиЗаполнениеСервер.Рассчитать(ОбъектЗаказ, СтруктураПараметры);
	АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, ОбъектЗаказ.ссылка.УникальныйИдентификатор());
	

	ОбъектЗаказ.СкидкиРассчитаны = Истина;      
	
	СтруктураСообщений = СкидкиНаценкиЗаполнениеСервер.СтруктураСообщений(ОбъектЗаказ);
	
КонецПроцедуры

Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");   
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));  
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь ));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	
КонецПроцедуры 

Процедура ПересчитатьСуммыСУчетомБонусов(Объект, ТекущаяСтрока) Экспорт
	
	ТипДокумента = ТипЗнч(Объект.Ссылка);
	Заказ = Тип("ДокументСсылка.ЗаказКлиента");
	РТиУ = Тип("ДокументСсылка.РеализацияТоваровУслуг");
	ВозвратТоваров = Тип("ДокументСсылка.ВозвратТоваровОтКлиента");
	ЭтоПомощникПродаж = АльтерраОбщегоНазначения.ЕстьРеквизитОбъекта(Объект, "ЭтоПомощникПродаж");
	
	СтруктураДействий = Новый Структура;
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	
	Если  ТипДокумента <> ВозвратТоваров Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать,ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	КонецЕсли;
	
	Если  ТипДокумента = ВозвратТоваров Тогда
		Если ТипЗнч(ТекущаяСтрока) = Тип("ДанныеФормыЭлементКоллекции") И Объект.Товары.Итог("Сумма") <> Объект.СуммаДокумента И Объект.СуммаДокумента <> 0 Тогда 
			СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВозвратПереданнойМногооборотнойТары);
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВозвратПереданнойМногооборотнойТары);
			СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", Новый Структура("БезВозвратнойТары",	"Сумма,СуммаНДС,СуммаСНДС"));
		КонецЕсли;
	КонецЕсли;
	
	Если ТипДокумента = РТиУ ИЛИ ТипДокумента = Заказ И Не ЭтоПомощникПродаж Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);

		Если ТипДокумента = РТиУ Тогда
			СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару", Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
			СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыРТиУ());
			СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
		Иначе
			СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыЗаказ());
		КонецЕсли;
	КонецЕсли;
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

Функция ЗависимыеРеквизитыЗаказ()
	
	Возврат Новый Структура(
		"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки");
	
КонецФункции

Функция ЗависимыеРеквизитыРТиУ()
	
	Возврат Новый Структура("БезВозвратнойТары", "Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки");
	
КонецФункции

Функция ОбработатьТабличнуюЧасть(ТЧ, БПЛ, СтруктураКурсовДок, СтруктураКурсовБПЛ, КурсКонвертации) Экспорт
	
	ТЧ.Колонки.Добавить("МаксимальнаяСуммаОплаты", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	ТЧ.Колонки.Добавить("МаксимальнаяСуммаОплатыВБаллах", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.КлючСвязи КАК КлючСвязи,
		|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Товары.Цена КАК ЦенаЗаУпаковку,
		|	Товары.КодСтроки КАК КодСтроки,
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки
		|ПОМЕСТИТЬ ВременнаяТаблицаТовары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.КлючСвязи КАК КлючСвязи,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЕСТЬNULL(ЕСТЬNULL(ТабличнаяЧастьЦеновыеГруппы.МаксимальныйПроцентОплатыБонусами, БонусныеПрограммыЛояльности.МаксимальныйПроцентОплатыБонусами), 0) КАК МаксимальныйПроцентОплатыБонусами,
		|	Товары.КоличествоУпаковок * Товары.ЦенаЗаУпаковку КАК Сумма,
		|	Товары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.КодСтроки КАК КодСтроки,
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА БонусныеПрограммыЛояльности.СегментНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НоменклатураСегмента.Сегмент = БонусныеПрограммыЛояльности.СегментНоменклатуры
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ВходитВДоступныйСегмент
		|ИЗ
		|	ВременнаяТаблицаТовары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БонусныеПрограммыЛояльности.ЦеновыеГруппы КАК ТабличнаяЧастьЦеновыеГруппы
		|		ПО (ТабличнаяЧастьЦеновыеГруппы.Ссылка = &БонуснаяПрограммаЛояльности)
		|			И (ТабличнаяЧастьЦеновыеГруппы.ЦеноваяГруппа = Товары.Номенклатура.ЦеноваяГруппа)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БонусныеПрограммыЛояльности КАК БонусныеПрограммыЛояльности
		|		ПО (БонусныеПрограммыЛояльности.Ссылка = &БонуснаяПрограммаЛояльности)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|		ПО Товары.Номенклатура = НоменклатураСегмента.Номенклатура
		|			И Товары.Характеристика = НоменклатураСегмента.Характеристика
		|			И (НоменклатураСегмента.Сегмент = БонусныеПрограммыЛояльности.СегментНоменклатуры)
		|ГДЕ
		|	Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ Товары.Номенклатура В ИЕРАРХИИ (&ГрТара)";
	
	грТара = Справочники.Номенклатура.НайтиПоКоду("00448      ");
	Запрос.УстановитьПараметр("ГрТара", ГрТара);
	Запрос.УстановитьПараметр("Товары", ТЧ);
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БПЛ);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.МаксимальныйПроцентОплатыБонусами > 0
			ИЛИ Не Выборка.ВходитВДоступныйСегмент 
			ИЛИ Выборка.ПроцентАвтоматическойСкидки > Выборка.МаксимальныйПроцентОплатыБонусами Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = ТЧ.Найти(Выборка.НомерСтроки, "НомерСтроки");
		
		СтрокаТЧ.МаксимальнаяСуммаОплаты = ((Выборка.МаксимальныйПроцентОплатыБонусами 
											- Выборка.ПроцентАвтоматическойСкидки
											- Выборка.ПроцентРучнойСкидки) / 100) * Выборка.Сумма;
											
		Если (Выборка.Сумма - (СтрокаТЧ.МаксимальнаяСуммаОплаты	+ Выборка.СуммаРучнойСкидки	+ Выборка.СуммаАвтоматическойСкидки)) <= 0 Тогда 
			СтрокаТЧ.МаксимальнаяСуммаОплаты = СтрокаТЧ.МаксимальнаяСуммаОплаты	- (Выборка.КоличествоУпаковок*0.01);
		КонецЕсли;
		
		СтрокаТЧ.МаксимальнаяСуммаОплатыВБаллах = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.МаксимальнаяСуммаОплаты,
																									 СтруктураКурсовДок,
																									 СтруктураКурсовБПЛ)/КурсКонвертации;
		
	КонецЦикла;

	Возврат ТЧ;

КонецФункции

Функция ПроверитьЗапретОплатыБонусов(Объект)  Экспорт
	Если АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер) тогда
		Если Не БонусыАльтерра.МожноРассчитыватьсяБаллами(Объект.Соглашение) Тогда
			    Сообщить("По данному соглашению оплата бонусами невозможна!");
				Возврат Истина;
		конецесли;
	КонецЕсли;
	
	Если ?(ПрименитьНовыйПорядокРаспределенияБонусов(Объект.Ссылка), 
			ПроверитьЗапретБонусов(Объект),
			БонусыАльтерра.ПроверитьЗапретБонусов(Объект))
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат БонусыАльтерра.ЕстьКомиссионныйТовар(Объект);
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции 

Функция ПроверитьЗапретБонусов(Объект, РазрешитьЮЛ = Ложь, ПоказатьСообщение = Истина)  Экспорт
	
	Условие = Новый Массив;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Товары = Объект.Товары.Выгрузить();
		
		//1. Не начиляем струдникам, юр лицам, не не в группе партнеров Частные лица, Бригадиры
		Если Не БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер, РазрешитьЮЛ) Тогда
			Возврат Истина;
		КонецЕсли;
		
		//2. Склад транзит
		Если Найти(Объект.Склад, "Транзит") > 0 Тогда 
			Возврат Истина;
		КонецЕсли;
		
		//3. Есть произвольные цены/ручные скидки
		ЕстьПроизвольныеЦены = Товары.Найти(Справочники.ВидыЦен.ПустаяСсылка(), "ВидЦены");
		Если ЕстьПроизвольныеЦены <> Неопределено Тогда //И Не ЭтоЗаказССайта
			ТекстУсловия = "произвольными ценами";
			Условие.Добавить(ТекстУсловия);
		КонецЕсли;
			
		//4. Контрагент не физическое лицо
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Если Объект.Контрагент.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо И Не РазрешитьЮЛ Тогда
				Сообщить("Только физические лица могут участвовать в бонусной программе!");
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//5. Проверка на Розницу
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Если Объект.Партнер = Справочники.Партнеры.РозничныйПокупатель Тогда  
			Если ТипЗнч(Объект.Ссылка) <> Тип("ДокументСсылка.ЧекККМ") Тогда
				Сообщить("Партнер Розница не может участвовать в бонусной программе!");  
			КонецЕсли;	
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	//6. Есть ручные скидки
	Если Товары <> Неопределено Тогда 
		ЕстьРучныеСкидки = Товары.Итог("ПроцентРучнойСкидки");
		Если ЕстьРучныеСкидки <> 0 Тогда
			ТекстУсловия = "ручными скидками";
			Условие.Добавить(ТекстУсловия);
		КонецЕсли;	
	КонецЕсли;
	
	Если Условие.Количество() > 0 И ПоказатьСообщение Тогда
		Сообщить("По строкам с " + СтрСоединить(Условие, " и ") + " начисление бонусов и оплата ими невозможна!");
	КонецЕсли;
	
	//7. Организация АСК-Р задача № 119167
	Если Объект.Организация = АльтерраОбщегоНазначения.ПолучитьАСКР() Тогда
		Возврат истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

Функция ЗапрещеноИспользоватьБонусы(Стр) Экспорт
	
	Отменено = ПолучитьЗначениеРеквизита(Стр, "Отменено");
	СтрокаИзПомощника = ?(ТипЗнч(ПолучитьЗначениеРеквизита(Стр, "Нехватает")) = Тип("Число"), Истина, Ложь);
	
	Если Отменено 
		Или ?(СтрокаИзПомощника,Стр.ПроцентРучнойСкидки > 0, Стр.СуммаРучнойСкидки > 0)
		Или Стр.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка() 
	Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

Функция ПолучитьЗначениеРеквизита(Источник, ИмяРеквизита) Экспорт
	
	УИД = Новый УникальныйИдентификатор(); 
	ВременнаяСтруктура = Новый Структура(ИмяРеквизита, УИД); 
	ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, Источник);
	Если ТипЗнч(ВременнаяСтруктура[ИмяРеквизита]) = Тип("УникальныйИдентификатор") Тогда
		Результат = Ложь;
	Иначе
	    Результат = Источник[ИмяРеквизита];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура ПоказатьИнформациюПоБонусам(Этаформа, Объект) Экспорт
	Элементы = Этаформа.Элементы;
	
	ВидимостьНовыхПолей = ПрименитьНовыйПорядокРаспределенияБонусов(Объект);
	Заказ = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента"), Объект.Ссылка, Неопределено);
	
	Если БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер) Тогда
		Элементы.ДекорацияБонусы.Заголовок = "Бонусы";
		Элементы._Информация.Видимость = Истина;
		
		ИнформацияПоБонусам = ПолучитьИнформациюПоБаллам(Объект.Дата, Объект.Партнер, Неопределено, Заказ);
		
		Если ИнформацияПоБонусам.ЭтоБригадир Тогда
			Элементы.ДекорацияБонусы.Заголовок = "Клиент является профессиональным бригадиром";
			Элементы.ДекорацияБонусы.ЦветТекста = Новый Цвет(0, 128, 0);
			Элементы._Информация.Видимость = Ложь;
		Иначе
			Если Не ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
				Этаформа._ВНаличииБаллов = ИнформацияПоБонусам.ДоступноНаТекущуюДату;
				Этаформа._ВРезервеБаллов = ИнформацияПоБонусам.РезервБаллов;
				Элементы._ВРезервеБаллов.Видимость = ВидимостьНовыхПолей;
			КонецЕсли;
			Этаформа._ДоступноБаллов = ИнформацияПоБонусам.ДоступныеБаллы;
			Если Не Заказ = Неопределено Тогда
				Этаформа._РеализованоПоЗаказу = Объект.Товары.Выгрузить(Новый Структура("ОтметкаРеализации", Истина)).Итог("СуммаБонусныхБалловКСписаниюВВалюте");
				Этаформа._ВРезервеПоЗаказу = Объект.Товары.Выгрузить(Новый Структура("ОтметкаРеализации", Ложь)).Итог("СуммаБонусныхБалловКСписаниюВВалюте");
				Элементы._РеализованоПоЗаказу.Видимость = ВидимостьНовыхПолей;
				Элементы._ВРезервеПоЗаказу.Видимость = ВидимостьНовыхПолей;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Объект.СтатусПартнераВПрограммеЛояльности) Тогда
				Объект.СтатусПартнераВПрограммеЛояльности = ИнформацияПоБонусам.Статус;
			КонецЕсли;
			Этаформа._ПроцентУчастникаБонуснойПрограммы = ИнформацияПоБонусам.Коэффициент*100;
			Если Объект.Партнер.БонуснаяПрограммаАктивна Тогда
				Элементы.ДекорацияБонусы.ЦветТекста = Новый Цвет(0, 128, 0);
			Иначе
				Элементы.ДекорацияБонусы.ЦветТекста = Новый Цвет(255, 0, 0);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияБонусы.Заголовок = "Не участвует в бонусной программе";
		Если Объект.Партнер.БонуснаяПрограммаАктивна Тогда
			Элементы.ДекорацияБонусы.ЦветТекста = Новый Цвет(0, 128, 0);
		Иначе
			Элементы.ДекорацияБонусы.ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЕсли;
		
		Элементы._Информация.Видимость = Ложь;		
		
		Объект.СтатусПартнераВПрограммеЛояльности = Неопределено;
		Объект.ПроцентЗаКрупнуюПокупку = 0;	
		Этаформа._ПроцентУчастникаБонуснойПрограммы = 0;
	КонецЕсли;
	
КонецПроцедуры

функция ЯвляетсяБригадиромНаДату(ДатаДокумента, Партнер)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СрезПоследних(&ДатаДокумента,) КАК
		|		СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних
		|ГДЕ
		|	СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.Статус = Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.НайтиПоКоду("000000005") Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ПолучитьИнформациюПоБаллам(Дата, Партнер, КартаЛояльности = Неопределено, Заказ = Неопределено) Экспорт
	
	БонуснаяПрограммаЛояльности = ПолучитьБПЛ(КартаЛояльности);
	РезервБаллов = ПолучитьОбщийРезервБонусныхБаллов(Партнер, Заказ);
	ЭтоБригадир	= ЯвляетсяБригадиромНаДату(Дата, Партнер);//АльтерраОбщегоНазначения.ЭтоБригадир(Партнер);
	Период = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаИнформацииПоБаллам();
	
	Запрос.УстановитьПараметр("Период", Дата);//Период);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	Запрос.УстановитьПараметр("УчитыватьПоследнийСтатус", Истина);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	// Получаем статус партнера
	Выборка = ПакетРезультатов[0].Выбрать();
	Статус = ?(Выборка.Следующий(), Выборка.Статус, Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.ПустаяСсылка());
	Коэффициент = ?(ЗначениеЗаполнено(Статус.Коэффициент), Статус.Коэффициент, 0.01);         
	
	// получаем баллы, списанные на КСО, но пока не учтенные
	ВыборкаКСО = ПакетРезультатов[3].Выбрать();   
	ЕстьДанныеКСО = ВыборкаКСО.Следующий();
	
	// получаем доступные баллы
	Выборка = ПакетРезультатов[1].Выбрать();
	ЕстьДанные = Выборка.Следующий();  
	ДоступноНаТекущуюДату = ?(ЕстьДанные, Выборка.НачисленоОстаток, 0) - ?(ЕстьДанныеКСО, ВыборкаКСО.ИспользованоНаКСО, 0);
	ДоступныеБаллы = ?(ЕстьДанные, Выборка.НачисленоОстаток - РезервБаллов, 0) - ?(ЕстьДанныеКСО, ВыборкаКСО.ИспользованоНаКСО, 0);
	
	// получаем накопленные баллы
	Выборка = ПакетРезультатов[2].Выбрать();
	НакопленныеБаллы = ?(Выборка.Следующий(), Выборка.НачисленоОстаток, 0); 
	
	Возврат Новый Структура("Статус,Коэффициент,НакопленныеБаллы,ДоступноНаТекущуюДату,ДоступныеБаллы,РезервБаллов,ЭтоБригадир",
							Статус,Коэффициент,НакопленныеБаллы,ДоступноНаТекущуюДату,ДоступныеБаллы,РезервБаллов,ЭтоБригадир);	
	
КонецФункции

Процедура НачислитьБонусныеБаллы(Объект) Экспорт 
	
	Если Не БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер)
		Или Объект.Товары.Итог("Сумма") = 0
	Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПрименитьНовыйПорядокРаспределенияБонусов(Объект.Ссылка) Тогда
		БонусыАльтерра.НачислитьБонусныеБаллы(Объект);
		Возврат;
	КонецЕсли;
	
	Соглашение 					 = Объект.Соглашение;
	СегментБригадир				 = Справочники.СегментыПартнеров.НайтиПоНаименованию("Бригадиры");
	ИспользуетсяСоглашениеБригадиров = Соглашение.СегментПартнеров = СегментБригадир;
	
	//ЭтоБригадир = АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер);
	РеализацияПоЗаказу = Ложь;
	Если (ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") И ЗначениеЗаполнено(Объект.ЗаказКлиента)) Тогда
		РеализацияПоЗаказу = Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект.БонусныеБаллы.Очистить();
	
	БонуснаяПрограммаЛояльности = ПолучитьБПЛ(Объект.КартаЛояльности);
	
	ТекДата = ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
	
	Если Не РеализацияПоЗаказу Или (АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер) И ИспользуетсяСоглашениеБригадиров) Тогда
		
		ЭтоЗаказ = Ложь;
		СтрокиСРеализацией = Новый ТаблицаЗначений;
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
			ЭтоЗаказ = Истина;
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				СтрокиСРеализацией = ПолучитьСтрокиИзРеализацийПоЗаказу(Объект.Ссылка).Выгрузить();    //либо пересчитывать потом за статус либо нет
			КонецЕсли;
		КонецЕсли;
		
		//Если заказ, то пропускаем строки с реализацией за статус
		Для Каждого стрТовар Из Объект.Товары Цикл
			
			Если Не ЭтоЗаказ Или СтрокиСРеализацией.Найти(стрТовар.КодСтроки) = Неопределено Тогда
				стрТовар.СуммаНачисленныхБалловЗаСтатус = 0;
				стрТовар.СуммаНачисленныхБалловПрочее = 0;
			КонецЕсли;
			
			стрТовар.СуммаНачисленныхБалловЗаКП = 0;
			стрТовар.СуммаНачисленныхБонусныхБалловВВалюте = 0;
			
		КонецЦикла;
			
		РезультатРасчета = РасчетБонусныхБаллов(Объект, БонуснаяПрограммаЛояльности);
		
		РасчитанныеБаллы = РезультатРасчета.РасчитанныеБаллы;
		РасчитанныеБаллыЗаКП = Цел(РезультатРасчета.СуммаКРасчету * РезультатРасчета.КоэффициентЗаКрупнуюПокупку);
		РасчитанныеБаллыЗаСтатус = Цел(РезультатРасчета.СуммаКРасчету * РезультатРасчета.КоэффициентЗаСтатус);
		
		//Если ЭтоБригадир Тогда 
		//	РасчитанныеБаллыПрочее = РасчитанныеБаллыЗаКП;
		//	РасчитанныеБаллыЗаКП = 0;
		//Иначе
		//	РасчитанныеБаллыПрочее = 0;
		//КонецЕсли;
		
		СуммаИтог = РезультатРасчета.Товары.Итог("Сумма");
		
		Если СуммаИтог = 0 Тогда 
			Возврат;
		КонецЕсли;
		
		БалловКРаспределению = РасчитанныеБаллы/СуммаИтог;
		
		//БалловКРаспределениюПрочее = РасчитанныеБаллыПрочее/СуммаИтог;
		БалловКРаспределениюЗаСтатус = РасчитанныеБаллыЗаСтатус/СуммаИтог;
		БалловКРаспределениюЗаКП = РасчитанныеБаллыЗаКП/СуммаИтог; 
		
		ИтогКП = 0;
		ИтогПрочее = 0;
		ИтогСтатус = 0;
		//ИтогПрочее = 0;
		
		Если РасчитанныеБаллы <> 0 Тогда
			Для Каждого стрТовар Из РезультатРасчета.Товары Цикл
				СтрокаСРеализацией = ?(СтрокиСРеализацией.Найти(стрТовар.КодСтроки) = Неопределено, Ложь, Истина);
				
				СуммаБонусныхБаллов = БалловКРаспределению * стрТовар.Сумма; 
							
				СуммаБонусныхБалловЗаКП = Окр(БалловКРаспределениюЗаКП * стрТовар.Сумма, 2); 
				//СуммаБонусныхБалловПрочее = Окр(БалловКРаспределениюПрочее * стрТовар.Сумма, 2); 
				СуммаБонусныхБалловЗаСтатус = Окр(БалловКРаспределениюЗаСтатус * стрТовар.Сумма, 2);
				
				НайденнаяСтрока = Объект.Товары[стрТовар.НомерСтроки - 1];
				НайденнаяСтрока.СуммаНачисленныхБалловЗаКП = СуммаБонусныхБалловЗаКП;  
				//НайденнаяСтрока.СуммаНачисленныхБалловПрочее = СуммаБонусныхБалловПрочее;

				Если Не ЭтоЗаказ Или Не СтрокаСРеализацией Тогда
					НайденнаяСтрока.СуммаНачисленныхБалловЗаСтатус = СуммаБонусныхБалловЗаСтатус;
				КонецЕсли;
				НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте = НайденнаяСтрока.СуммаНачисленныхБалловЗаКП
																		+ НайденнаяСтрока.СуммаНачисленныхБалловПрочее
																		+ НайденнаяСтрока.СуммаНачисленныхБалловЗаСтатус;
																		
				ИтогКП = ИтогКП + СуммаБонусныхБалловЗаКП;
				ИтогСтатус = ИтогСтатус + СуммаБонусныхБалловЗаСтатус;
				//ИтогПрочее = ИтогПрочее + СуммаБонусныхБалловПрочее;
				
				Если ЭтоЗаказ И (Не ЗначениеЗаполнено(НайденнаяСтрока.Статус) ИЛИ Не СтрокаСРеализацией) Тогда
					НайденнаяСтрока.Статус = РезультатРасчета.Статус;
				КонецЕсли;
				
			КонецЦикла;
			
			НайденнаяСтрока.СуммаНачисленныхБалловЗаКП 				= НайденнаяСтрока.СуммаНачисленныхБалловЗаКП
																	-(ИтогКП - РасчитанныеБаллыЗаКП);
			
			НайденнаяСтрока.СуммаНачисленныхБалловЗаСтатус 			= НайденнаяСтрока.СуммаНачисленныхБалловЗаСтатус
																	-(ИтогСтатус - РасчитанныеБаллыЗаСтатус);
			//НайденнаяСтрока.СуммаНачисленныхБалловПрочее 			= НайденнаяСтрока.СуммаНачисленныхБалловПрочее
																	//-(ИтогПрочее - РасчитанныеБаллыПрочее);														
			
			
			НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте	= НайденнаяСтрока.СуммаНачисленныхБалловЗаКП
																	+ НайденнаяСтрока.СуммаНачисленныхБалловПрочее
																	+ НайденнаяСтрока.СуммаНачисленныхБалловЗаСтатус;
			
		КонецЕсли;

		Объект.СтатусПартнераВПрограммеЛояльности = РезультатРасчета.Статус;  
		Объект.ПроцентЗаКрупнуюПокупку = РезультатРасчета.КоэффициентЗаКрупнуюПокупку*100; 
	
	КонецЕсли;
	
	СуммаКНачислению = Объект.Товары.Итог("СуммаНачисленныхБонусныхБалловВВалюте");
	Если СуммаКНачислению > 0 Тогда
		ДатаНачисления = НачалоДня(ТекДата)+3600*24*3;
		НоваяСтрока = Объект.БонусныеБаллы.Добавить();
		НоваяСтрока.БонуснаяПрограммаЛояльности = БонуснаяПрограммаЛояльности;
		НоваяСтрока.ДатаНачисления = ДатаНачисления;
		НоваяСтрока.СуммаБонусныхБаллов = СуммаКНачислению;
		НоваяСтрока.СуммаБонусныхБалловЗаКП = Объект.Товары.Итог("СуммаНачисленныхБалловЗаКП");
		НоваяСтрока.СуммаБонусныхБалловПрочее = Объект.Товары.Итог("СуммаНачисленныхБалловПрочее");
		НоваяСтрока.СуммаБонусныхБалловЗаСтатус = Объект.Товары.Итог("СуммаНачисленныхБалловЗаСтатус");
		
		Если ПолучитьЗначениеРеквизита(Объект, "НачислениеБонусныхБаллов") <> Ложь Тогда
			Объект.НачислениеБонусныхБаллов.Очистить();
			Для каждого СтрокаТовары Из Объект.Товары Цикл
				НоваяСтрокаТЧ = Объект.НачислениеБонусныхБаллов.Добавить();
				НоваяСтрокаТЧ.КлючСвязи = СтрокаТовары.КлючСвязи;
				НоваяСтрокаТЧ.БонуснаяПрограммаЛояльности = БонуснаяПрограммаЛояльности;
				НоваяСтрокаТЧ.ДатаНачисления = ДатаНачисления;
				НоваяСтрокаТЧ.СуммаБонусныхБаллов = СтрокаТовары.СуммаНачисленныхБонусныхБалловВВалюте; 
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция РасчетБонусныхБаллов(Объект, БонуснаяПрограммаЛояльности = Неопределено) Экспорт
	
	Если БонуснаяПрограммаЛояльности = Неопределено Тогда
		БонуснаяПрограммаЛояльности = ПолучитьБПЛ(Объект.КартаЛояльности);
	КонецЕсли;

	Запрет						 = Ложь;
	Партнер						 = Объект.Партнер;
	Соглашение 					 = Объект.Соглашение;
	ЭтоБригадир					 = АльтерраОбщегоНазначения.ЭтоБригадир(Партнер);
	СегментБригадир				 = Справочники.СегментыПартнеров.НайтиПоНаименованию("Бригадиры");	
	ЭтоЗаказ					 = ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента"), Истина, Ложь);
	МаксимальныйПроцентОплаты	 = БонуснаяПрограммаЛояльности.МаксимальныйПроцентОплатыБонусами / 100;
	ДокДата						 = Объект.Дата;
	РезервБаллов				 = ПолучитьОбщийРезервБонусныхБаллов(Партнер, ?(ЭтоЗаказ, Объект.Ссылка, Неопределено));
	Период						 = ?(ДокДата = Дата(1,1,1) ИЛИ ДокДата = НачалоДня(Объект.Дата), ТекущаяДата(), ДокДата);
	
	УчитыватьПоследнийСтатус = Истина;
	Если ЭтоБригадир И Соглашение.СегментПартнеров <> СегментБригадир Тогда
		УчитыватьПоследнийСтатус = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаИнформацииПоБаллам()
					+ ";
					|
					|////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	БонусныеБаллы.Партнер КАК Партнер,
					|	БонусныеБаллы.Начислено КАК Количество
					|ИЗ
					|	РегистрНакопления.БонусныеБаллы КАК БонусныеБаллы
					|ГДЕ
					|	БонусныеБаллы.Регистратор = &Регистратор";
					
	Период = ?(ЭтоЗаказ, ТекущаяДата(), Период); 
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("УчитыватьПоследнийСтатус", УчитыватьПоследнийСтатус);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	// Получаем статус партнера
	Выборка = ПакетРезультатов[0].Выбрать();
	Статус = ?(Выборка.Следующий(), Выборка.Статус, Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.ПустаяСсылка());
	КоэффициентЗаСтатус = ?(ЗначениеЗаполнено(Статус.Коэффициент), Статус.Коэффициент, 0.01);
	
	//Бригадиры
	Если ЭтоБригадир И Соглашение.СегментПартнеров = СегментБригадир Тогда 
		КоэффициентЗаСтатус = ?(Объект.Соглашение.НачислятьБаллыЗаСтатус, КоэффициентЗаСтатус, 0);
		//Истина - Соглашение 1 или 2, Ложь - соглашение без бонусов за статус
	КонецЕсли;
	
	// получаем доступные баллы
	Выборка = ПакетРезультатов[1].Выбрать();
	ДоступныеБаллы = ?(Выборка.Следующий(), Выборка.НачисленоОстаток - РезервБаллов, 0);
	
	// получаем накопленные баллы
	Выборка = ПакетРезультатов[2].Выбрать();
	НакопленныеБаллы = ?(Выборка.Следующий(), Выборка.НачисленоОстаток, 0);
	
	// получаем начисленные этим документом баллы
	Выборка = ПакетРезультатов[4].Выбрать();
	НачисленныеБаллы = ?(Выборка.Следующий(), Выборка.Количество, 0);
	
	СуммаКРасчету = 0;
	СуммаКОплате = 0;
	
	ДокТовары = Объект.Товары;
	ДокДата = Объект.Дата;
	
	ТЗТовары = ПолучитьТоварыКрасчетуБаллов(ДокТовары, ЭтоЗаказ, ДокДата);
	ТЗТоварыКОплате = ПолучитьТоварыКрасчетуБаллов(Объект.Товары, ЭтоЗаказ, Объект.Дата, Истина);
	
	//Дополнительный расчет бонусов за крупную покупку
	СуммаКРасчету = ТЗТовары.Итог("Сумма");
	СуммаКОплате = ТЗТоварыКОплате.Итог("Сумма");
	
	КоэффициентЗаКрупнуюПокупку = 0;
	
	Если СуммаКРасчету >= 120000 Тогда
		КоэффициентЗаКрупнуюПокупку = 0.03;
	ИначеЕсли СуммаКРасчету >= 60000 Тогда
		КоэффициентЗаКрупнуюПокупку =  0.02;
	ИначеЕсли СуммаКРасчету >= 30000 Тогда
		КоэффициентЗаКрупнуюПокупку =  0.01;
	КонецЕсли; 
	
	//Бригадиры 
	Если ЭтоБригадир И Соглашение.СегментПартнеров = СегментБригадир Тогда
		Если Объект.Соглашение.НачислятьБаллыЗаКрупнуюПокупку = Ложь тогда
			КоэффициентЗаКрупнуюПокупку = 0;
		Иначе 
			КоэффициентЗаКрупнуюПокупку = Объект.Соглашение.КоэффициентНачисленияББРозничнаяЦена; 
		КонецЕсли;
	КонецЕсли;
	
	ОбщийКоэффициент = КоэффициентЗаСтатус + КоэффициентЗаКрупнуюПокупку;
		
	РасчитанныеБаллы = Цел(СуммаКРасчету * ОбщийКоэффициент);
	
	Если ЭтоБригадир И Соглашение.СегментПартнеров = СегментБригадир И Соглашение.ВозможностьСписатьБаллы = Ложь Тогда	
		СуммаБаловКОплате = 0; 
	Иначе
		СуммаБаловКОплате = Мин(Цел(СуммаКОплате*МаксимальныйПроцентОплаты), Цел(ДоступныеБаллы));
	КонецЕсли;
		
	ОбъектПроверки = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента"), Объект.ЧекККМ, Объект);
	Если ПроверитьЗапретБонусов(ОбъектПроверки) Тогда
		НачисленныеБаллы = 0;
		РасчитанныеБаллы = 0;
		МаксимальныйПроцентОплаты = 0;
		СуммаБаловКОплате = 0;
		Запрет = Истина;
	КонецЕсли;
	
	Возврат Новый Структура("Статус,Коэффициент,КоэффициентЗаСтатус,КоэффициентЗаКрупнуюПокупку,НакопленныеБаллы,ДоступныеБаллы,
							|НачисленныеБаллы,РасчитанныеБаллы,МаксимальныйПроцентОплаты,СуммаБаловКОплате,Запрет,СуммаКРасчету,Товары",
							Статус,ОбщийКоэффициент,КоэффициентЗаСтатус,КоэффициентЗаКрупнуюПокупку,НакопленныеБаллы,ДоступныеБаллы,
							НачисленныеБаллы,РасчитанныеБаллы,МаксимальныйПроцентОплаты,СуммаБаловКОплате,Запрет,СуммаКРасчету,ТЗТовары);	
	
КонецФункции

Функция ПолучитьТоварыКРасчетуБаллов(Товары, ЭтоЗаказ = Ложь, Дата = Неопределено, ОставитьТоварБезБонусов = Ложь)  Экспорт
	
	ТаблицаТоваров = ?(ТипЗнч(Товары) = Тип("ТаблицаЗначений"), Товары, Товары.Выгрузить());
	
		Для Индекс = 1 - ТаблицаТоваров.Количество() По 0 Цикл
			Строка = ТаблицаТоваров.Получить(-Индекс);
			Если ЗапрещеноИспользоватьБонусы(Строка) Тогда
				ТаблицаТоваров.Удалить(-Индекс);
			КонецЕсли;
		КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура,
		|	Характеристика,
		|	Сумма,
		|	НомерСтроки,
		|	КодСтроки
		|ПОМЕСТИТЬ Товар
		|ИЗ
		|	&Товар КАК Товар
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура,
		|	Характеристика,
		|	Сумма,
		|	НомерСтроки,
		|	КодСтроки
		|ПОМЕСТИТЬ ТоварБезТары	
		|ИЗ
		|	Товар 
		|ГДЕ
		|	Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ Номенклатура В ИЕРАРХИИ (&ГрТара)
		|;
		|////////////////////////////////////////////////////////////////////////////////     
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа,
		|	ДатаОкончанияДействия
		|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусовПоследние
		|ИЗ
		|	РегистрСведений.ЦеновыеГруппыБезБонусов.СрезПоследних(&Дата)
		|;
		|////////////////////////////////////////////////////////////////////////////////     
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа    
		|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусов
		|ИЗ
		|	втЦеновыеГруппыБезБонусовПоследние
		|ГДЕ 
		|	ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)  
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа    
		|ИЗ
		|	втЦеновыеГруппыБезБонусовПоследние
		|ГДЕ 
		|	ДатаОкончанияДействия >= &Дата
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварБезТары.Номенклатура,
		|	ТоварБезТары.Характеристика,
		|	ТоварБезТары.Сумма,
		|	ТоварБезТары.НомерСтроки,
		|	ТоварБезТары.КодСтроки,
		|   втЦеновыеГруппыБезБонусов.ЦеноваяГруппа ЕСТЬ НЕ NULL КАК БезБонусов
		|ИЗ
		|	ТоварБезТары 
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		втЦеновыеГруппыБезБонусов
		|			ПО ТоварБезТары.Номенклатура.ЦеноваяГруппа = втЦеновыеГруппыБезБонусов.ЦеноваяГруппа
		|%УсловиеБезБонусов";  
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеБезБонусов", ?(ОставитьТоварБезБонусов, "", "ГДЕ втЦеновыеГруппыБезБонусов.ЦеноваяГруппа ЕСТЬ NULL"));
	
    Запрос.УстановитьПараметр("Товар", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ГрТара", Справочники.Номенклатура.НайтиПоКоду("00448      "));
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(Дата)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Функция ПолучитьБПЛ(Карта) Экспорт
	
	БПЛ = БонусныеБаллыСервер.БонуснаяПрограммаКартыЛояльности(Карта).БонуснаяПрограммаЛояльности;
	Если Не ЗначениеЗаполнено(БПЛ) Тогда
		БПЛ = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;
	
	Возврат БПЛ;	
	
КонецФункции

Функция ПолучитьТекстЗапросаИнформацииПоБаллам()
	Текст = 
		"ВЫБРАТЬ
		|	СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СрезПоследних(
		|			&Период,
		|			БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности
		|				И Партнер = &Партнер) КАК СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних
		|ГДЕ
		|	&УчитыватьПоследнийСтатус ИЛИ Не СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыПартнеровВПрограммеЛояльности_Альтерра.Бригадир)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БонусныеБаллыОстатки.Партнер КАК Партнер,
		|	БонусныеБаллыОстатки.НачисленоОстаток КАК НачисленоОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллы.Остатки(
		|			&Период,
		|			Партнер = &Партнер
		|				И БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности) КАК БонусныеБаллыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БонусныеБаллыОстатки.Партнер КАК Партнер,
		|	БонусныеБаллыОстатки.НачисленоОстаток КАК НачисленоОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллы.Остатки(
		|			,
		|			Партнер = &Партнер
		|				И БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности) КАК БонусныеБаллыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ЕСТЬNULL(СУММА(КОплатеБаллами), 0) ИспользованоНаКСО
		|ИЗ
		|	Документ.ЧекСамообслуживания       
		|ГДЕ 
		|	Партнер = &Партнер	
		|	И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|	И (ДатаОтправкиНаПробитие = ДАТАВРЕМЯ(1, 1, 1) 
		|		ИЛИ ДатаРезультатаПробития = ДАТАВРЕМЯ(1, 1, 1) 
		|		ИЛИ (ТипПродажи = 0 И ЧекККМ = ЗНАЧЕНИЕ(Документ.ЧекККМ.ПустаяСсылка) 
		|			ИЛИ ОшибкаЗаписиДокумента <> """"))";
	
	Возврат Текст;
	
КонецФункции

Процедура ПересчитатьБонусныеБаллыВТоваре(Объект, АдресВоВременномХранилище = Неопределено) Экспорт
	
	ЭтоЗаказ = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента");
	 
	ОчиститьБонусы(Объект, ЭтоЗаказ);
	
	 Если ЗначениеЗаполнено(АдресВоВременномХранилище) Тогда
		 ТаблицаТоваров = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	 Иначе
		 ТаблицаТоваров = Объект.Товары;
	 КонецЕсли;
	 
	 Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		 
		 Если Не ЭтоЗаказ Или Не СтрокаТЧ.ОтметкаРеализации Тогда
			 
			 НайденнаяСтрока = Объект.Товары.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаТЧ.НомерСтроки))[0];
			 НайденнаяСтрока.СуммаБонусныхБалловКСписанию = СтрокаТЧ.СуммаБонусныхБалловКСписанию;
			 НайденнаяСтрока.СуммаБонусныхБалловКСписаниюВВалюте = СтрокаТЧ.СуммаБонусныхБалловКСписаниюВВалюте;
			 
			 ПересчитатьСуммыСУчетомБонусов(Объект, НайденнаяСтрока);
			 
		 КонецЕсли;
		 
	 КонецЦикла;
	
КонецПроцедуры
 
Процедура ОчиститьБонусыПолностью(Объект) Экспорт
	
	ОчиститьБонусы(Объект);
	Объект.СкидкиРассчитаны = Ложь;	
	Объект.СтатусПартнераВПрограммеЛояльности = Неопределено;
	Объект.ПроцентЗаКрупнуюПокупку = 0;
	
КонецПроцедуры

Процедура ОчиститьБонусы(Объект, ЭтоЗаказ = Ложь) Экспорт 
	
	Объект.БонусныеБаллы.Очистить();
	
	Для Каждого Строка Из Объект.Товары Цикл
		Если Не ЭтоЗаказ Или Не Строка.ОтметкаРеализации Тогда
			ОчиститьБонусыПоСтроке(Строка);
			ПересчитатьСуммыСУчетомБонусов(Объект, Строка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьБонусыПоСтроке(Строка) Экспорт
	
	Строка.СуммаБонусныхБалловКСписанию = 0;
	Строка.СуммаБонусныхБалловКСписаниюВВалюте = 0;
	//Строка.СуммаБонусныхБалловКСписаниюВВалютеБезВозвратнойТары = 0;
	Строка.СуммаНачисленныхБалловЗаКП = 0;
	Строка.СуммаНачисленныхБалловПрочее = 0;
	Строка.СуммаНачисленныхБалловЗаСтатус = 0;
	Строка.СуммаНачисленныхБонусныхБалловВВалюте = 0;
	
КонецПроцедуры

Функция ПолучитьТаблицуБонусныхБаловДляПроведенияВозврата(Объект, Отказ) Экспорт
	Запрос= Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|		ТабличнаяЧасть.ДатаНачисления КАК Период,
		|		ВЫБОР
		|			КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|				ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		КОНЕЦ КАК ВидДвижения,
		|		ТабличнаяЧасть.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|		&Партнер КАК Партнер,
		|		ВЫБОР
		|			КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|				ТОГДА ТабличнаяЧасть.СуммаБонусныхБаллов
		|			ИНАЧЕ ТабличнаяЧасть.СуммаБонусныхБаллов
		|		КОНЕЦ КАК СуммаБаллов
		|			ПОМЕСТИТЬ ВтБонусныеБаллы
		|	ИЗ
		|		Документ.ВозвратТоваровОтКлиента.НачислениеБонусныхБаллов КАК ТабличнаяЧасть
		|	ГДЕ
		|		ТабличнаяЧасть.Ссылка = &Ссылка
		|		И ТабличнаяЧасть.ДатаНачисления <> ДАТАВРЕМЯ(1, 1, 1)
		|	
		|		
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧасть.ДатаОплаты,
		|		ВЫБОР
		|			КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|				ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		КОНЕЦ,
		|		ТабличнаяЧасть.БонуснаяПрограммаЛояльности,
		|		&Партнер,
		|		ВЫБОР
		|			КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|				ТОГДА ТабличнаяЧасть.СуммаБонусныхБаллов
		|			ИНАЧЕ -ТабличнаяЧасть.СуммаБонусныхБаллов
		|		КОНЕЦ
		|	ИЗ
		|		Документ.ВозвратТоваровОтКлиента.ОплатаБонуснымиБаллами КАК ТабличнаяЧасть
		|	ГДЕ
		|		ТабличнаяЧасть.Ссылка = &Ссылка
		|	;
		|	
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|		БонусныеБаллы.Период КАК Период,
		|		БонусныеБаллы.ВидДвижения КАК ВидДвижения,
		|		БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|		БонусныеБаллы.Партнер КАК Партнер,
		|		СУММА(БонусныеБаллы.СуммаБаллов) КАК Начислено
		|	ИЗ
		|		ВтБонусныеБаллы КАК БонусныеБаллы
		|	ГДЕ
		|		&ОтметкаКассы = ИСТИНА
		|	
		|	СГРУППИРОВАТЬ ПО
		|		БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|		БонусныеБаллы.Партнер,
		|		БонусныеБаллы.Период,
		|		БонусныеБаллы.ВидДвижения";
	
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ОтметкаКассы", ЗначениеЗаполнено(Объект.Кассир));
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Процедура ЗаполнитьБонусныеБаллыВозвратТоваровОтКлиентаПоРеализации(Объект) Экспорт
	Объект.НачислениеБонусныхБаллов.Очистить();
	Объект.ОплатаБонуснымиБаллами.Очистить();

	
	Если ТипЗнч(Объект.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Основание = Объект.ДокументРеализации;
	Иначе
		Основание = Объект.ЧекККМ;
	КонецЕсли;
	
	Если Основание.Кассир.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	БонуснаяПрограммаЛояльности = Основание.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности;	
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		 БонуснаяПрограммаЛояльности= АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;
	
	Если БонуснаяПрограммаЛояльности.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СуммаНачисленныхБалловПриПродажи = Основание.БонусныеБаллы.Итог("СуммаБонусныхБаллов");
	СуммаОплаченныхБалловПриПродажи = Основание.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");

	Если СуммаНачисленныхБалловПриПродажи > 0 ИЛИ СуммаОплаченныхБалловПриПродажи > 0 Тогда
		Для Каждого стрТовар Из Объект.Товары Цикл
			СтрокИОснования = Основание.Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",стрТовар.Номенклатура, стрТовар.Характеристика));
			СтрокаОснования = СтрокиОснования[0];
						
			//1. Пересчёт бонусных сумм
			Если СтрокаОснования.Количество = стрТовар.Количество Тогда
				стрТовар.СуммаНачисленныхБонусныхБалловВВалюте = СтрокаОснования.СуммаНачисленныхБонусныхБалловВВалюте;
				стрТовар.СуммаБонусныхБалловКСписанию = СтрокаОснования.СуммаБонусныхБалловКСписаниюВВалюте;
				стрТовар.СуммаБонусныхБалловКСписаниюВВалюте = стрТовар.СуммаБонусныхБалловКСписанию;
			Иначе
				стрТовар.СуммаНачисленныхБонусныхБалловВВалюте = (стрТовар.Количество*СтрокаОснования.СуммаНачисленныхБонусныхБалловВВалюте)/СтрокаОснования.Количество;
				
				стрТовар.СуммаБонусныхБалловКСписанию = (стрТовар.Количество*СтрокаОснования.СуммаБонусныхБалловКСписаниюВВалюте)/СтрокаОснования.Количество;
				стрТовар.СуммаБонусныхБалловКСписаниюВВалюте = стрТовар.СуммаБонусныхБалловКСписанию;
			КонецЕсли;
			
			//2. Пересчёт сумм рублевых с учётом бонусных
			Если СтрокаОснования.СуммаАвтоматическойСкидки  = 0 Тогда
				 стрТовар.Цена = СтрокаОснования.Цена;
			Иначе//цену нужно пересчитать от исходной суммы, чтобы исключить двойной учёт бонусов, но при этом перенести учёт скидки
				стрСумма = СтрокаОснования.Цена*СтрокаОснования.Количество;
				стрТовар.Цена = (стрСумма*(1-СтрокаОснования.ПроцентАвтоматическойСкидки/100))/СтрокаОснования.Количество;
			КонецЕсли;
			ПересчитатьСуммыСУчетомБонусов(Объект, стрТовар);     
			
			//3. Отбрасывание копеек у бонусных сумм
			Если СтрокаОснования.Количество <> стрТовар.Количество Тогда
				стрТовар.СуммаНачисленныхБонусныхБалловВВалюте =  Цел(стрТовар.СуммаНачисленныхБонусныхБалловВВалюте);
				стрТовар.СуммаБонусныхБалловКСписанию = Цел(стрТовар.СуммаБонусныхБалловКСписанию);
				стрТовар.СуммаБонусныхБалловКСписаниюВВалюте = стрТовар.СуммаБонусныхБалловКСписанию;
			КонецЕсли;
		КонецЦикла;
		
		Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС");
		
		ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Объект, Объект.СуммаДокумента);// затирает сумму взаиморасчетов
		//Поэтому проставляем сумму
		Для Каждого стрРасшифровки Из  Объект.РасшифровкаПлатежа Цикл
			стрРасшифровки.СуммаВзаиморасчетов= стрРасшифровки.Сумма;
		КонецЦикла;
		
		СуммаВозвратаНачисленныхБаллов = Мин(Объект.Товары.Итог("СуммаНачисленныхБонусныхБалловВВалюте"), СуммаНачисленныхБалловПриПродажи);
		
		Если СуммаВозвратаНачисленныхБаллов > 0 Тогда
			ДатаСписания = НачалоДня(Основание.Дата)+3600*24*3;
			
			НоваяСтрока = Объект.НачислениеБонусныхБаллов.Добавить();
			НоваяСтрока.БонуснаяПрограммаЛояльности = БонуснаяПрограммаЛояльности;
			НоваяСтрока.ДатаНачисления = ДатаСписания;
			НоваяСтрока.ДатаСписания =  ДатаСписания;
			НоваяСтрока.СуммаБонусныхБаллов = СуммаВозвратаНачисленныхБаллов;
		КонецЕсли;
	КонецЕсли;
	
	//Возвращаем оплаты балов часть баллов
	СуммаОплаченныхБалловВернуть = Мин(Объект.Товары.Итог("СуммаБонусныхБалловКСписанию"), СуммаОплаченныхБалловПриПродажи);
	Если СуммаОплаченныхБалловВернуть > 0 Тогда
		
		ТекДата= ?(Объект.Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Объект.Дата);
		
		НоваяСтрока = Объект.ОплатаБонуснымиБаллами.Добавить();
		НоваяСтрока.БонуснаяПрограммаЛояльности = БонуснаяПрограммаЛояльности;
		НоваяСтрока.ДатаОплаты = ТекДата;
		НоваяСтрока.СуммаБонусныхБаллов = -СуммаОплаченныхБалловВернуть;
	КонецЕсли;
КонецПроцедуры

Функция Спр_АдресВХ(УникальныйИдентификаторВладельцаФормы, Параметры) Экспорт
	
	СтрокиТабличнойЧасти = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
	
	СуммаКРаспределению = цел(Параметры.СуммаОплатыВБаллах);
	СтрокаСМаксимальнойСуммой = Неопределено;
	МаксимальнаяСуммаОплатыВБаллах = 0;
	ТребуетсяКорректировка = Ложь;
	КоличествоКорректировок = 0;
	НомерПоследнейСтроки = 0;
	
	Для Индекс = 1 - СтрокиТабличнойЧасти.Количество() По 0 Цикл 
		
		Стр = СтрокиТабличнойЧасти[-Индекс];
		ОтметкаРеализации = ПолучитьЗначениеРеквизита(Стр, "ОтметкаРеализации");
		СтрокаИзПомощника = ?(ТипЗнч(ПолучитьЗначениеРеквизита(Стр, "Нехватает")) = Тип("Число"), Истина, Ложь);
		ЗапретБаллов = ЗапрещеноИспользоватьБонусы(Стр);
		
		Если СтрокаИзПомощника И ЗапретБаллов Тогда
			СтрокиТабличнойЧасти.Удалить(Стр);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗапретБаллов И Не ОтметкаРеализации Тогда 
			МаксимальнаяСуммаОплатыВБаллах = МаксимальнаяСуммаОплатыВБаллах + Стр.МаксимальнаяСуммаОплатыВБаллах;
			НомерПоследнейСтроки = ?(Стр.НомерСтроки > НомерПоследнейСтроки, Стр.НомерСтроки, НомерПоследнейСтроки);
		Иначе
			СтрокиТабличнойЧасти.Удалить(Стр);
		КонецЕсли;
		
	КонецЦикла;
	
	Если СуммаКРаспределению>МаксимальнаяСуммаОплатыВБаллах Тогда
		СуммаКРаспределению = цел(МаксимальнаяСуммаОплатыВБаллах);
	КонецЕсли;
		
	Для каждого СтрокаТЧ Из СтрокиТабличнойЧасти Цикл
		
		Если МаксимальнаяСуммаОплатыВБаллах <= 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если СтрокаСМаксимальнойСуммой = Неопределено Тогда
			СтрокаСМаксимальнойСуммой = СтрокаТЧ;
		Иначе 
			СтрокаСМаксимальнойСуммой = ?(СтрокаТЧ.Сумма > СтрокаСМаксимальнойСуммой.Сумма, СтрокаТЧ, СтрокаСМаксимальнойСуммой);
		КонецЕсли;
		
		
		СтрокаТЧ.СуммаБонусныхБалловКСписанию = СтрокаТЧ.МаксимальнаяСуммаОплатыВБаллах * (СуммаКРаспределению / МаксимальнаяСуммаОплатыВБаллах);
		
		Если СтрокаТЧ.НомерСтроки = НомерПоследнейСтроки Тогда
			СтрокаТЧ.СуммаБонусныхБалловКСписанию = СуммаКРаспределению;
		КонецЕсли;
		
		Цена = (СтрокаТЧ.Сумма - СтрокаТЧ.СуммаБонусныхБалловКСписанию)/СтрокаТЧ.Количество;
		Если Цена < 0.01 Тогда
			СтрокаТЧ.СуммаБонусныхБалловКСписанию = СтрокаТЧ.Сумма-0.01*СтрокаТЧ.Количество;
			ТребуетсяКорректировка = Истина;
			КоличествоКорректировок = КоличествоКорректировок + 1;
		КонецЕсли;
		
		СтрокаТЧ.СуммаБонусныхБалловКСписаниюВВалюте = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
														СтрокаТЧ.СуммаБонусныхБалловКСписанию * Параметры.КурсКонвертацииБонусовВВалюту,
														Параметры.СтруктураКурсовВалютыБонуснойПрограммы,
														Параметры.СтруктураКурсовВалютыДокумента);
		
		СуммаКРаспределению = СуммаКРаспределению - СтрокаТЧ.СуммаБонусныхБалловКСписанию;
		МаксимальнаяСуммаОплатыВБаллах = МаксимальнаяСуммаОплатыВБаллах - СтрокаТЧ.МаксимальнаяСуммаОплатыВБаллах;
		
	КонецЦикла;
	
	Если ТребуетсяКорректировка Тогда
		СтрокаСМаксимальнойСуммой.СуммаБонусныхБалловКСписанию = СтрокаСМаксимальнойСуммой.СуммаБонусныхБалловКСписанию + 0.01*КоличествоКорректировок;
		
		СтрокаСМаксимальнойСуммой.СуммаБонусныхБалловКСписаниюВВалюте = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
																		СтрокаСМаксимальнойСуммой.СуммаБонусныхБалловКСписанию * Параметры.КурсКонвертацииБонусовВВалюту,
																		Параметры.СтруктураКурсовВалютыБонуснойПрограммы,
																		Параметры.СтруктураКурсовВалютыДокумента);
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(СтрокиТабличнойЧасти, УникальныйИдентификаторВладельцаФормы);
	
КонецФункции