
Функция НоменклатураПодлежитМаркировке(Номенклатура)   Экспорт
	
	ВидПродукции = ИнтеграцияИСУТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(Номенклатура.ОсобенностьУчета); 
	
	Если ВидПродукции = Неопределено Тогда 
		Возврат Ложь; 
	КонецЕсли;  
			      
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиУчетаМаркируемойПродукции.ВидПродукции КАК ВидПродукции
	|ИЗ
    | РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП КАК НастройкиУчетаМаркируемойПродукции
	|	
	|ГДЕ
	|	НастройкиУчетаМаркируемойПродукции.ВидПродукции В (&ВидыПродукцииИСМП) И НастройкиУчетаМаркируемойПродукции.ВидПродукции =&ВидПродукции 
	|   И ВестиУчетПродукции 
	|";
	
	Запрос.УстановитьПараметр("ВидыПродукцииИСМП", ОбщегоНазначенияИСКлиентСервер.ВидыПродукцииИСМП(Истина,Истина,Истина));   
	Запрос.УстановитьПараметр("ВидПродукции",ВидПродукции);


	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ЗаписатьGTINИС(Запись) Экспорт
	
	Если Запись.Номенклатура.ВидНоменклатуры.ПродукцияМаркируемаяДляГИСМ Тогда
		УпаковкаШтрихкода 	 = Запись.Упаковка;
		УпаковкаНоменклатуры = Запись.Номенклатура.ЕдиницаИзмерения;
		СтруктураОписания 	 = Новый Структура();
		СтруктураОписания.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Групповая);
		СтруктураОписания.Вставить("GTIN", "0" + Запись.Штрихкод);
		Если УпаковкаШтрихкода = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() ИЛИ УпаковкаШтрихкода = УпаковкаНоменклатуры Тогда
			СтруктураОписания.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Потребительская);
	 		СтруктураОписания.Вставить("КоличествоПотребительскихУпаковок", 1);
		Иначе
			Если УпаковкаШтрихкода.Знаменатель <> 0 Тогда
				СтруктураОписания.Вставить("КоличествоПотребительскихУпаковок", УпаковкаШтрихкода.Числитель/УпаковкаШтрихкода.Знаменатель);
			Иначе
				СтруктураОписания.Вставить("КоличествоПотребительскихУпаковок", УпаковкаШтрихкода.Числитель);
			КонецЕсли;		
		КонецЕсли;
		РегистрыСведений.ОписаниеGTINИС.УстановитьОписание(СтруктураОписания);
	КонецЕсли
	 
КонецПроцедуры

//СтруктураКодаМаркировки = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки( ШтрихкодМаркировки, Неопределено, Неопределено,Неопределено,Неопределено); 
//Структура номенклатуры (Номенклатура, Характеристика, Серия)
Функция ПолучитьСсылкуНаШтрихкодМаркируемогоТовара(СтруктураКодаМаркировки,СтруктураНоменклатуры)  Экспорт
	
	МенеджерШтрихкоды = Справочники.ШтрихкодыУпаковокТоваров;
	
	НормализованныйКодМаркировки = СтруктураКодаМаркировки.НормализованныйКодМаркировки;
	
	CcылкаНаШтрихкод = МенеджерШтрихкоды.ПолучитьПоЗначениюШтрихкода(НормализованныйКодМаркировки);
	
	Если CcылкаНаШтрихкод = Неопределено Тогда 
		
		ВидПродукции = СтруктураКодаМаркировки.ВидыПродукции[0];
		ТипШтрихкода = СтруктураКодаМаркировки.ТипШтрихкода;
		ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
		
		ДанныеШтрихкода = Новый Структура;
		ДанныеШтрихкода.Вставить("Штрихкод",               НормализованныйКодМаркировки);
		ДанныеШтрихкода.Вставить("ШтрихкодBase64",                                 Ложь);   
		ДанныеШтрихкода.Вставить("ТипШтрихкода",                           ТипШтрихкода);
		ДанныеШтрихкода.Вставить("ТипУпаковки",                             ТипУпаковки);
		ДанныеШтрихкода.Вставить("ВидПродукции",                           ВидПродукции);
		ДанныеШтрихкода.Вставить("Номенклатура",     СтруктураНоменклатуры.Номенклатура);  
		ДанныеШтрихкода.Вставить("Характеристика", СтруктураНоменклатуры.Характеристика);
		ДанныеШтрихкода.Вставить("Серия",                   СтруктураНоменклатуры.Серия);
		ДанныеШтрихкода.Вставить("Количество",                                        1);
	    ДанныеШтрихкода.Вставить("Ответственный",   ПараметрыСеанса.ТекущийПользователь);
		
		CcылкаНаШтрихкод = МенеджерШтрихкоды.СоздатьШтрихкодУпаковки(ДанныеШтрихкода, Неопределено, Неопределено, Неопределено, Неопределено); 
	КонецЕсли;
	
	Возврат CcылкаНаШтрихкод;
КонецФункции

 Функция ЭтоКодМаркировки(МассивШтрихкодов) Экспорт
	
	ЭтоКодМаркировки = Ложь;
	
	Для Каждого ТекШтрихкод Из МассивШтрихкодов Цикл
			Если Найти(ТекШтрихкод, МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1()) <> 0 Тогда
				ЭтоКодМаркировки = Истина;
			КонецЕсли;
		Прервать;
	КонецЦикла;
	Возврат  ЭтоКодМаркировки;
 КонецФункции  
	Функция ПолучитьКартинкуСканированияМаркировки(ВидМаркируемойПродукции) Экспорт

	Если ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СоковаяПродукция") Тогда
		Картинка = БиблиотекаКартинок.СканированиеМаркировкаСоковаяПродукция;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувь") Тогда
		Картинка = БиблиотекаКартинок.СканированиеМаркировкаОбувь;
	Иначе // По умолчанию УпакованнаяВода
		Картинка = БиблиотекаКартинок.СканированиеМаркировкаУпакованнаяВода;
	КонецЕсли;

	Возврат Картинка;
	
КонецФункции  
Функция ПолучитьРасхожденияПоКодамМаркировки(Товары, ШтрихкодыУпаковок) Экспорт
	
	ОсобенностьУчета = Новый Массив;
	
	Для Каждого ВидПродукции Из ОбщегоНазначенияИСМП.ВидыПродукцииОбязательнойМаркировки() Цикл
		ОсобенностьУчета.Добавить(ИнтеграцияИСУТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(ВидПродукции));
	КонецЦикла;
	
	Если Не ОсобенностьУчета.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|		Товары.Номенклатура КАК НоменклатураТЗ,
	|       Товары.Характеристика,  
	|		Товары.КоличествоУпаковок КАК КоличествоУпаковок
	|	ПОМЕСТИТЬ ВТ_Товары
	|	ИЗ
	|		 &Товары КАК Товары 
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		Номенклатура.Ссылка КАК НоменклатураТЗ,
	|       Товары.Характеристика, 
	|		СУММА(Товары.КоличествоУпаковок) КАК КоличествоУпаковок
	|    ПОМЕСТИТЬ Товары
	|	ИЗ
	|		ВТ_Товары КАК Товары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ПО Товары.НоменклатураТЗ = Номенклатура.Ссылка
	|	ГДЕ
	|		Номенклатура.ОсобенностьУчета В(&ОсобенностьУчета)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Номенклатура.Ссылка,
	|       Товары.Характеристика
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|       ШтрихкодыУпаковокТоваров.Характеристика,
	|		Сумма(1) КАК КоличествоКМ 
	|	Поместить Вт_КоличествоКМ
	|	ИЗ
	|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров 
	|	ГДЕ
	|	    ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковок)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ШтрихкодыУпаковокТоваров.Номенклатура,
	|       ШтрихкодыУпаковокТоваров.Характеристика;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НоменклатураТЗ КАК Номенклатура, 
	|   Товары.Характеристика,    
	|	Товары.КоличествоУпаковок - ЕСТЬNULL(Вт_КоличествоКМ.КоличествоКМ, 0) КАК КоличествоУпаковок
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_КоличествоКМ КАК Вт_КоличествоКМ
	|		ПО (Товары.НоменклатураТЗ = Вт_КоличествоКМ.Номенклатура И Товары.Характеристика = Вт_КоличествоКМ.Характеристика)
	|ГДЕ
	|	Товары.КоличествоУпаковок - ЕСТЬNULL(Вт_КоличествоКМ.КоличествоКМ, 0) > 0"; 
	
	Запрос.УстановитьПараметр("ОсобенностьУчета", ОсобенностьУчета);
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ШтрихкодыУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки"));
	
    Возврат Запрос.Выполнить();
	
КонецФункции

#Область ПроверкаЧестныйЗнак

#Область ПроверкаВОбороте

Функция ПроверитьМаркировку(КодыМаркировки, ТестовыйРежим = -1, КоличествоПлощадок = 2, ТаймаутПроверки = 5, JSONОтвет = Ложь) Экспорт    
	
	ПараметрыПроверки = ПараметрыОперацииПроверки();      
	КодыМаркировкиДляПроверки = ПодготовитьКодыМаркировкиДляПроверки(КодыМаркировки);
	Организация = Справочники.Организации.НайтиПоНаименованию("Альтерра ООО");

	// Реальный запрос в ЧЗ
	Если ТестовыйРежим = -1 Тогда
		CDNПлощадки = ПолучитьCDNПлощадки(КоличествоПлощадок); 
		Если CDNПлощадки.Количество() > 0 Тогда
			Для Каждого CDNПлощадка Из CDNПлощадки Цикл  

				ЗапросНаПроверку = ОтправитьЗапросНаПроверку(CDNПлощадка, КодыМаркировкиДляПроверки, Организация, ТаймаутПроверки);
				ЗаполнитьПараметрыОперацииПроверки(КодыМаркировкиДляПроверки, ПараметрыПроверки, ЗапросНаПроверку);
				
				Если ЗапросНаПроверку.Результат Тогда    
					Прервать;
				КонецЕсли;
			КонецЦикла; 
		Иначе
			ПараметрыПроверки.ОписаниеОшибкиОтправкиЗапроса = "Отсутствуют CDN площадки";
		КонецЕсли;
		
	// Имитация ответа ЧЗ: СтатусВОбороте (ТестовыйРежим = 1), Не СтатусВОбороте (ТестовыйРежим = 0)
	Иначе
		ЗаполнитьТестПараметрыОперацииПроверки(КодыМаркировкиДляПроверки, ПараметрыПроверки, ТестовыйРежим);			
	КонецЕсли;
	
	Если Не JSONОтвет Тогда
		ПараметрыПроверки.Удалить("JSONОтвет");	
	КонецЕсли;
	
	Возврат ПараметрыПроверки;
	
КонецФункции

Функция ОтправитьЗапросНаПроверку(CDNПлощадка, КодыМаркировкиДляПроверки, Организация, ТаймаутПроверки)    
	
	РезультатВыполнения = Новый Структура("Результат, CDNПлощадка, Ответ, JSONОтвет, ОшибкаОтправки", Ложь, CDNПлощадка.Сервер, Неопределено, "", "");
	
	Попытка 
		Соединение = Новый HTTPСоединение(CDNПлощадка.Сервер, CDNПлощадка.Порт, , , 
			Новый ИнтернетПрокси(Истина), ТаймаутПроверки, Новый ЗащищенноеСоединениеOpenSSL);	   
		
		URLЗапроса = "/api/v4/true-api/codes/check";	  
		КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
			ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессииИСМПРозница(Организация));   
		
		Если ЗначениеЗаполнено(КлючСессии) Тогда
		
			Запрос = Новый HTTPЗапрос(URLЗапроса);     
			Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
			Запрос.Заголовки.Вставить("Accept-Charset","utf-8");
			Запрос.Заголовки.Вставить("X-API-KEY", КлючСессии);
			
			Тело = ДопМодульСервер.ФорматироватьJsonТекст(Новый Структура("codes", КодыМаркировкиДляПроверки));
			Запрос.УстановитьТелоИзСтроки(Тело);
					 
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);	
	
			Если ТипЗнч(Ответ) = Тип("HTTPОтвет") Тогда
				РезультатВыполнения.JSONОтвет = ДопМодульСервер.ФорматироватьJsonТекст(Ответ.ПолучитьТелоКакСтроку());
				Попытка  
					РезультатВыполнения.Ответ = АльтерраОбщегоНазначения.ДесериализоватьИзJSON(РезультатВыполнения.JSONОтвет);
				Исключение
				КонецПопытки;
				
				Если ТипЗнч(РезультатВыполнения.Ответ) = Тип("Структура") Тогда
					Если РезультатВыполнения.Ответ.Свойство("code") И РезультатВыполнения.Ответ.code = 0 Тогда
						РезультатВыполнения.Результат = Истина;
					КонецЕсли;
				Иначе                                
					РезультатВыполнения.ОшибкаОтправки = СтрШаблон("Ошибка ответа:  %1", РезультатВыполнения.JSONОтвет);	
				КонецЕсли;
			Иначе	 
				РезультатВыполнения.ОшибкаОтправки = СтрШаблон("Ошибка при получении ответа, код: %1", Строка(Ответ.КодСостояния));
			КонецЕсли;
			
		Иначе
			РезультатВыполнения.ОшибкаОтправки = "Не получен API-ключ авторизации";
		КонецЕсли;			
	Исключение
		РезультатВыполнения.ОшибкаОтправки = СтрШаблон("Ошибка запроса проверки: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;     
	
	Возврат РезультатВыполнения;

КонецФункции

Функция ПолучитьCDNПлощадки(КоличествоПлощадок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ %КоличествоПлощадок  
		|	Сервер,        
		|	Порт,
		|	ВЫБОР 
		|		КОГДА СреднееВремяОтвета > 0 И СреднееВремяПроверкиКМ > 0
		|		ТОГДА СреднееВремяОтвета + СреднееВремяПроверкиКМ
		|		ИНАЧЕ 1000000
		|	КОНЕЦ КАК ОбщееВремяОтклика
		|ИЗ 
		|	РегистрСведений.СостоянияCDNПлощадокИСМП   
		|ГДЕ 
		|	&ТекущаяДата > ДатаНедоступнаДоУниверсальная
		|УПОРЯДОЧИТЬ ПО 3";   
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%КоличествоПлощадок", Формат(КоличествоПлощадок, "ЧГ=")); 
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции    

Функция ПодготовитьКодыМаркировкиДляПроверки(КодыМаркировки)  Экспорт
	
	КодыДляПроверки = Новый Массив;
	
	Для Каждого Код Из КодыМаркировки Цикл          
		КодДляПроверки = СтрЗаменить(Код, ОбщегоНазначенияБПОКлиентСервер.РазделительGS1(), "\u001d");
		КодыДляПроверки.Добавить(КодДляПроверки);
	КонецЦикла;
	
	Возврат КодыДляПроверки;
	
КонецФункции	

Функция ПараметрыОперацииПроверки()
	
	ПараметрыПроверки = Новый Структура;
	
	ПараметрыПроверки.Вставить("CDNПлощадка", 					"");
	ПараметрыПроверки.Вставить("ЗапросНаПроверкуОтправлен", 	Ложь);
	ПараметрыПроверки.Вставить("ОписаниеОшибкиОтправкиЗапроса", "");
	ПараметрыПроверки.Вставить("КодРезультатПроверки", 			0);
	ПараметрыПроверки.Вставить("ОписаниеРезультатаПроверки", 	""); 
	ПараметрыПроверки.Вставить("УИДЗапроса", 					"");
	ПараметрыПроверки.Вставить("ДатаРегистрацииЗапроса", 		"");
	ПараметрыПроверки.Вставить("КодыМаркировки", 				Новый Массив);  
	ПараметрыПроверки.Вставить("JSONОтвет", 					"");  
	
	Возврат ПараметрыПроверки;

КонецФункции	     

Функция ПараметрыПроверкиКодовМаркировки()
	
	КодМаркировки = Новый Структура;
	
	КодМаркировки.Вставить("КодМаркировки", "");	
	КодМаркировки.Вставить("КодОшибки", 0);	
	КодМаркировки.Вставить("ОписаниеОшибки", 		"");	
	КодМаркировки.Вставить("GTIN", 					"");
	КодМаркировки.Вставить("КодНайден", 			Ложь);
	КодМаркировки.Вставить("СтруктураВалидная", 	Ложь);
	КодМаркировки.Вставить("ПроверкаКриптоподписи",	Ложь);
	КодМаркировки.Вставить("СтатусВОбороте", 		Ложь);
	КодМаркировки.Вставить("Продано", 				Ложь);
	КодМаркировки.Вставить("ПринадлежитВладельцу",	Ложь);
	КодМаркировки.Вставить("ИстекСрокГодности",		Ложь);
	КодМаркировки.Вставить("ЗаблокированОГВ",		Ложь);
	
	Возврат КодМаркировки;

КонецФункции 

Процедура ЗаполнитьПараметрыОперацииПроверки(КодыМаркировкиДляПроверки, ПараметрыПроверки, ЗапросНаПроверку)

	ПараметрыПроверки.CDNПлощадка = ЗапросНаПроверку.CDNПлощадка;
	ПараметрыПроверки.ЗапросНаПроверкуОтправлен = ЗапросНаПроверку.Результат;
	ПараметрыПроверки.ОписаниеОшибкиОтправкиЗапроса = ЗапросНаПроверку.ОшибкаОтправки;  
	ПараметрыПроверки.JSONОтвет = ЗапросНаПроверку.JSONОтвет;
	
	Ответ = ЗапросНаПроверку.Ответ;   
	
	Если ТипЗнч(ЗапросНаПроверку.Ответ) = Тип("Структура") Тогда
	                              
		ПараметрыПроверки.КодРезультатПроверки 			= ?(Ответ.Свойство("code"), 		Ответ.code, 0);
		ПараметрыПроверки.ОписаниеРезультатаПроверки 	= ?(Ответ.Свойство("description"), 	Ответ.description, "");    
		ПараметрыПроверки.УИДЗапроса 					= ?(Ответ.Свойство("reqId"), 		Ответ.reqId, "");
		ПараметрыПроверки.ДатаРегистрацииЗапроса 		= ?(Ответ.Свойство("reqTimestamp"), Формат(Ответ.reqTimestamp, "ЧГ="), ""); 
		
		Если Ответ.Свойство("codes") Тогда
			
			Для Индекс = 0 По Ответ.codes.Количество() - 1  Цикл    
				
				ПроверенныйКод = Ответ.codes[Индекс];
				
				Код = ПараметрыПроверкиКодовМаркировки(); 
				Код.КодМаркировки = КодыМаркировкиДляПроверки[Индекс];
				
				Код.КодОшибки 					= ?(ПроверенныйКод.Свойство("errorCode "),	ПроверенныйКод.errorCode, 	0);
				Код.ОписаниеОшибки 				= ?(ПроверенныйКод.Свойство("message"), 	ПроверенныйКод.message, 	"");
				Код.GTIN 						= ?(ПроверенныйКод.Свойство("gtin"), 		ПроверенныйКод.gtin, 		"");
				Код.КодНайден 					= ?(ПроверенныйКод.Свойство("found"), 		ПроверенныйКод.found, 		Ложь);
				Код.СтруктураВалидная 			= ?(ПроверенныйКод.Свойство("valid"), 		ПроверенныйКод.valid, 		Ложь);
				Код.ПроверкаКриптоподписи 		= ?(ПроверенныйКод.Свойство("verified"), 	ПроверенныйКод.verified, 	Ложь);
				Код.СтатусВОбороте 				= ?(ПроверенныйКод.Свойство("realizable"),	ПроверенныйКод.realizable,	Ложь); 
				Код.Продано 					= ?(ПроверенныйКод.Свойство("sold"),		ПроверенныйКод.sold, 		Ложь); 	
				Код.ПринадлежитВладельцу        = ?(ПроверенныйКод.Свойство("isOwner"),		ПроверенныйКод.isOwner, 	Ложь);
				Код.ЗаблокированОГВ        		= ?(ПроверенныйКод.Свойство("isBlocked"),	ПроверенныйКод.isBlocked, 	Ложь);
				
				СрокГодности 					= ?(ПроверенныйКод.Свойство("expireDate"), 	ПроверенныйКод.expireDate, 	"");
				Если ЗначениеЗаполнено(СрокГодности) Тогда
					ДатаСрокГодности = Дата(Лев(СрокГодности, 4) + Сред(СрокГодности, 6, 2) +  Сред(СрокГодности, 9, 2));
					Код.ИстекСрокГодности = НачалоДня(ТекущаяДатаСеанса()) > НачалоДня(ДатаСрокГодности);
				Иначе
					Код.ИстекСрокГодности = Ложь;
				КонецЕсли; 					
				
				ПараметрыПроверки.КодыМаркировки.Добавить(Код);
	
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры    

Процедура ЗаполнитьТестПараметрыОперацииПроверки(КодыМаркировкиДляПроверки, ПараметрыПроверки, ТестовыйРежим)
	
	ПараметрыПроверки.CDNПлощадка = "CDNПлощадка Тест";
	ПараметрыПроверки.ЗапросНаПроверкуОтправлен = Истина;
	ПараметрыПроверки.УИДЗапроса = "00000000-0000-0000-0000-000000000000";
	ПараметрыПроверки.ДатаРегистрацииЗапроса = "1000000000000";
	
	Для Каждого КодДляПроверки Из КодыМаркировкиДляПроверки Цикл    
		
		Код = ПараметрыПроверкиКодовМаркировки();  
		Код.КодМаркировки = КодДляПроверки; 
		Код.GTIN = Сред(КодДляПроверки, 3, 14);
		Код.КодНайден = Истина;   
		Код.СтруктураВалидная = Истина;   
		Код.ПроверкаКриптоподписи = Истина;      
		Код.СтатусВОбороте = Не ТестовыйРежим = 0;
		Код.Продано = Не Код.СтатусВОбороте;
		Код.ПринадлежитВладельцу = Не ТестовыйРежим = 0;
		Код.ИстекСрокГодности = ТестовыйРежим = 0;
		Код.ЗаблокированОГВ = ТестовыйРежим = 0;
		
		ПараметрыПроверки.КодыМаркировки.Добавить(Код);
		
	КонецЦикла;
	
	ПараметрыПроверки.JSONОтвет = "{
	    |""code"": 0,
	    |""description"": ""ok"",
	    |""codes"": [
	    |   {
	    |        ""cis"": ""0000000000000000000.cojl6nosiCp" + Символ(29) + "93wmVA""," + Символы.ПС +
	    "        ""valid"": true,
	    |        ""printView"": ""0000000000000000000.cojl6nosiCp"",
	    |        ""gtin"": ""00000000000000"",
	    |        ""groupIds"": [
	    |            13
	    |        ],
	    |        ""verified"": false,
	    |        ""message"": ""Тест"",
	    |        ""found"": true,
	    |        ""realizable"": true,
	    |        ""utilised"": true,
	    |        ""isBlocked"": false,
	    |        ""expireDate"": ""2025-01-01T00:00:00.000Z"",
	    |        ""productionDate"": ""2025-01-01T00:00:00.000Z"",
	    |        ""isOwner"": true,
	    |        ""errorCode"": 0,
	    |        ""isTracking"": false,
	    |        ""sold"": false,
	    |        ""packageType"": ""UNIT"",
	    |        ""parent"": ""00000000000000000000=StUXHL"",
	    |        ""producerInn"": ""0000000000"",
	    |        ""grayZone"": false
	    |    }
	    |],
	    |""reqId"": ""00000000-0000-0000-0000-000000000000"",
	    |""reqTimestamp"": 1000000000000
		|}";
	
КонецПроцедуры

Функция ПолучитьОписаниеОшибкиПроверки(ПараметрыПроверки, КонтрольСтатуса, Номенклатура) Экспорт
	
	ОбщееОписаниеОшибки = "";
	
	Если Не ПараметрыПроверки.ЗапросНаПроверкуОтправлен И ЗначениеЗаполнено(ПараметрыПроверки.ОписаниеОшибкиОтправкиЗапроса) Тогда
		ОбщееОписаниеОшибки = СтрШаблон("Запрос на проверку кода маркировки не отправлен: %1", ПараметрыПроверки.ОписаниеОшибкиОтправкиЗапроса);	
		
	ИначеЕсли Не ПараметрыПроверки.КодРезультатПроверки = 0 Тогда
		ОбщееОписаниеОшибки = СтрШаблон("Ошибка проверки кода маркировки: %1", ПараметрыПроверки.ОписаниеРезультатаПроверки);
		
	ИначеЕсли Не ПараметрыПроверки.Свойство("КодыМаркировки") Или  ПараметрыПроверки.КодыМаркировки.Количество() = 0 Тогда
		ОбщееОписаниеОшибки = "Не получены результаты проверки кода маркировки";
		
	ИначеЕсли Не (ПараметрыПроверки.КодыМаркировки[0].СтруктураВалидная И ПараметрыПроверки.КодыМаркировки[0].ПроверкаКриптоподписи) Тогда
		ОбщееОписаниеОшибки = "У товара %1 маркировка не валидная";	
		
	ИначеЕсли КонтрольСтатуса И Не ПараметрыПроверки.КодыМаркировки[0].СтатусВОбороте Тогда
		ОбщееОписаниеОшибки = "Товар %1 с этой маркировкой не находится в обороте";
	
	ИначеЕсли ПараметрыПроверки.КодыМаркировки[0].ИстекСрокГодности Тогда
		ОбщееОписаниеОшибки = "У товара %1 с этой маркировкой истек срок годности";
	
	ИначеЕсли ПараметрыПроверки.КодыМаркировки[0].ЗаблокированОГВ Тогда
		ОбщееОписаниеОшибки = "Товар %1 с этой маркировкой заблокирован по решению органов государственной власти";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОбщееОписаниеОшибки) И СтрНайти(ОбщееОписаниеОшибки, "%1") Тогда
		ОбщееОписаниеОшибки = СтрШаблон(ОбщееОписаниеОшибки, ?(ЗначениеЗаполнено(Номенклатура), 
			"""" + Строка(Номенклатура) + """", ""));	
	КонецЕсли;

	ПараметрыПроверки.Вставить("ОбщееОписаниеОшибки", ОбщееОписаниеОшибки);
	
	Возврат ОбщееОписаниеОшибки;
	
КонецФункции	

#КонецОбласти

#Область ПолучениеИнформации

Функция ПолучениеИнформацииМаркировки(КодыМаркировки, ТестовыйРежим = -1, ТаймаутПроверки = 5, JSONОтвет = Ложь) Экспорт    
	
	ПараметрыИнформации = ПараметрыПолучениеИнформации();      
	КодыМаркировкиДляИнформации = ПодготовитьКодыМаркировкиДляИнформации(КодыМаркировки);
	Организация = Справочники.Организации.НайтиПоНаименованию("Альтерра ООО");

	// Реальный запрос в ЧЗ
	Если ТестовыйРежим = -1 Тогда

		ЗапросНаПроверку = ОтправитьЗапросНаИнформацию(КодыМаркировкиДляИнформации, Организация, ТаймаутПроверки);
		ЗаполнитьПараметрыПолученияИнфоормации(КодыМаркировкиДляИнформации, Организация, ПараметрыИнформации, ЗапросНаПроверку);
		
	// Имитация ответа ЧЗ: Владелец - Наша Организация (ТестовыйРежим = 1), Владелец - Не наша Организация (ТестовыйРежим = 0)
	Иначе
		ЗаполнитьТестПараметрыПолученияИнформации(КодыМаркировкиДляИнформации, ПараметрыИнформации, ТестовыйРежим);			
	КонецЕсли;
	
	Если Не JSONОтвет Тогда
		ПараметрыИнформации.Удалить("JSONОтвет");	
	КонецЕсли;
	
	Возврат ПараметрыИнформации;
	
КонецФункции

Функция ОтправитьЗапросНаИнформацию(КодыМаркировкиДляПроверки, Организация, ТаймаутПроверки)    
	
	РезультатВыполнения = Новый Структура("Результат, Ответ, JSONОтвет, ОшибкаОтправки", Ложь, Неопределено, "", "");
	
	Попытка 
		Соединение = Новый HTTPСоединение("markirovka.crpt.ru", 443, , , 
			Новый ИнтернетПрокси(Истина), ТаймаутПроверки, Новый ЗащищенноеСоединениеOpenSSL);	   
		
		URLЗапроса = "/api/v3/true-api/cises/info";	  
		КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
			ОбщегоНазначенияИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
			
		Если ЗначениеЗаполнено(КлючСессии) Тогда 
		
			Запрос = Новый HTTPЗапрос(URLЗапроса);    
			Запрос.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
			Запрос.Заголовки.Вставить("Accept-Charset", "utf-8");
			Если КлючСессии <> Неопределено Тогда
				Запрос.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
			КонецЕсли;
			
			Тело = ДопМодульСервер.ФорматироватьJsonТекст(КодыМаркировкиДляПроверки);
			Запрос.УстановитьТелоИзСтроки(Тело);
					 
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);	
	
			Если ТипЗнч(Ответ) = Тип("HTTPОтвет") Тогда
				РезультатВыполнения.JSONОтвет = ДопМодульСервер.ФорматироватьJsonТекст(Ответ.ПолучитьТелоКакСтроку());
				РезультатВыполнения.Ответ = АльтерраОбщегоНазначения.ДесериализоватьИзJSON(РезультатВыполнения.JSONОтвет);
				
				Если ТипЗнч(РезультатВыполнения.Ответ) = Тип("Массив") Тогда
					Если РезультатВыполнения.Ответ.Количество() > 0 Тогда
						РезультатВыполнения.Результат = Истина;
					КонецЕсли;
				Иначе                                
					РезультатВыполнения.ОшибкаОтправки = СтрШаблон("Ошибка ответа:  %1", РезультатВыполнения.JSONОтвет);	
				КонецЕсли;
			Иначе	 
				РезультатВыполнения.ОшибкаОтправки = СтрШаблон("Ошибка при получении ответа, код: %1", Строка(Ответ.КодСостояния));
			КонецЕсли;	
		Иначе
			РезультатВыполнения.ОшибкаОтправки = "Не получен Bearer-токен авторизации";
		КонецЕсли;
	Исключение
		РезультатВыполнения.ОшибкаОтправки = СтрШаблон("Ошибка запроса получения информации: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;     
	
	Возврат РезультатВыполнения;

КонецФункции

Функция ПодготовитьКодыМаркировкиДляИнформации(КодыМаркировки)  Экспорт
	
	КодыДляПроверки = Новый Массив;
	
	Для Каждого Код Из КодыМаркировки Цикл     
		
		КодДляПроверки = Код;
		
		ПозицияGS = СтрНайти(Код, ОбщегоНазначенияБПОКлиентСервер.РазделительGS1());
		Если ПозицияGS > 1 Тогда
			КодДляПроверки = Лев(Код, ПозицияGS - 1);
		КонецЕсли;
	     
		КодыДляПроверки.Добавить(КодДляПроверки);
	КонецЦикла;
	
	Возврат КодыДляПроверки;
	
КонецФункции	

Функция ПараметрыПолучениеИнформации()
	
	ПараметрыИнформации = Новый Структура;
	
	ПараметрыИнформации.Вставить("ЗапросНаПроверкуОтправлен", 	Ложь);
	ПараметрыИнформации.Вставить("ОписаниеОшибкиОтправкиЗапроса", "");
	ПараметрыИнформации.Вставить("КодыМаркировки", 				Новый Массив);  
	ПараметрыИнформации.Вставить("JSONОтвет", 					"");  
	
	Возврат ПараметрыИнформации;

КонецФункции	

Функция ПараметрыИнформацииКодовМаркировки()
	
	КодМаркировки = Новый Структура;
	
	КодМаркировки.Вставить("КодМаркировки", 			"");	
	КодМаркировки.Вставить("КодОшибки", 				0);	
	КодМаркировки.Вставить("ОписаниеОшибки", 			"");	
	КодМаркировки.Вставить("GTIN", 						"");
	КодМаркировки.Вставить("ВладелецНашаОрганизация",	Ложь);
	КодМаркировки.Вставить("ИННВладельца",				"");
	КодМаркировки.Вставить("НаименованиеВладельца", 	"");
	
	Возврат КодМаркировки;

КонецФункции 

Процедура ЗаполнитьПараметрыПолученияИнфоормации(КодыМаркировкиИнформации, Оганизация, ПараметрыПолученияИнформации, ЗапросНаИнформацию)

	ПараметрыПолученияИнформации.ЗапросНаПроверкуОтправлен = ЗапросНаИнформацию.Результат;
	ПараметрыПолученияИнформации.ОписаниеОшибкиОтправкиЗапроса = ЗапросНаИнформацию.ОшибкаОтправки;  
	ПараметрыПолученияИнформации.JSONОтвет = ЗапросНаИнформацию.JSONОтвет;
	
	Ответ = ЗапросНаИнформацию.Ответ;   
	
	Если ТипЗнч(ЗапросНаИнформацию.Ответ) = Тип("Массив") Тогда
			
		Для Индекс = 0 По Ответ.Количество() - 1  Цикл  
			
			ОбъектМаркировки = Ответ[Индекс];
			
			Если ТипЗнч(ОбъектМаркировки) = Тип("Структура") Тогда
			
				Код = ПараметрыИнформацииКодовМаркировки();
				
				Код.КодОшибки 					= ?(ОбъектМаркировки.Свойство("errorCode "),	ОбъектМаркировки.errorCode , 	0);
				Код.ОписаниеОшибки 				= ?(ОбъектМаркировки.Свойство("errorMessage"),	ОбъектМаркировки.errorMessage , "");
				
				ПроверенныйКод 					= ?(ОбъектМаркировки.Свойство("cisInfo "),		ОбъектМаркировки.cisInfo , 		"");
				
				Если ТипЗнч(ПроверенныйКод) = Тип("Структура") Тогда
					
					Код.КодМаркировки 			= ?(ПроверенныйКод.Свойство("cis"), 			ПроверенныйКод.cis ,			"");
					Код.GTIN 					= ?(ПроверенныйКод.Свойство("gtin"), 			ПроверенныйКод.gtin ,			"");

					ИННВладельца 				= ?(ПроверенныйКод.Свойство("ownerInn"), 		ПроверенныйКод.ownerInn , 		"");
					Код.ВладелецНашаОрганизация	= Оганизация.ИНН = ИННВладельца;
					Код.ИННВладельца 			= ИННВладельца;
					Код.НаименованиеВладельца 	= ?(ПроверенныйКод.Свойство("ownerName"),		ПроверенныйКод.ownerName , 		"");
				
				КонецЕсли;
				
				ПараметрыПолученияИнформации.КодыМаркировки.Добавить(Код);
			
			КонецЕсли;

		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры       

Функция ЗаполнитьТестПараметрыПолученияИнформации(КодыМаркировкиДляИнформации, ПараметрыИнформации, ТестовыйРежим)
	
	ПараметрыИнформации.ЗапросНаПроверкуОтправлен = Истина;
	
	Для Каждого КодДляПроверки Из КодыМаркировкиДляИнформации Цикл    
		
		Код = ПараметрыИнформацииКодовМаркировки();  
		Код.КодМаркировки = КодДляПроверки; 
		Код.GTIN = Сред(КодДляПроверки, 3, 14);
		Код.ВладелецНашаОрганизация = ТестовыйРежим = 1;   
		Код.ИННВладельца = ?(ТестовыйРежим = 1, "2208015955", "2287003050");   
		Код.НаименованиеВладельца = ?(ТестовыйРежим = 1, "ООО ""Альтерра""", "ООО ""БПЗ""");      
		
		ПараметрыИнформации.КодыМаркировки.Добавить(Код);
		
	КонецЦикла;
	
	ПараметрыИнформации.JSONОтвет = 
	"[
    |	{
    |    ""cisInfo"": {
    |       ""applicationDate"": ""2023-07-10T10:46:30.878Z"",
    |       ""isMultipleSales"": false,
    |       ""requestedCis"": ""0000000000000000000JMNIX<ynYO7u"",
    |       ""cis"": ""0000000000000000000JMNIX<ynYO7u"",
    |       ""cisWithoutBrackets"": ""0000000000000000000JMNIX<ynYO7u"",
    |       ""gtin"": ""00000000000000"",
    |       ""tnVedEaes"": ""2201900000"",
    |       ""tnVedEaesGroup"": ""2201"",
    |       ""productName"": Тестовый товар ""Алтай"",
    |       ""productGroupId"": 13,
    |       ""productGroup"": ""water"",
    |       ""brand"": ""-"",
    |       ""emissionDate"": ""2023-07-06T06:32:22.678Z"",
    |       ""emissionType"": ""LOCAL"",
    |       ""packageType"": ""UNIT"",
    |       ""generalPackageType"": ""UNIT"",
    |       ""ownerInn"": """ + ?(ТестовыйРежим = 1, "2208015955", "2287003050") + """," + Символы.ПС +
    "       ""ownerName"": """ + ?(ТестовыйРежим = 1, "ООО ""Альтерра""", "ООО ""БПЗ""") + """," + Символы.ПС +
    "       ""status"": ""INTRODUCED"",
    |       ""statusEx"": ""EMPTY"",
    |       ""child"": [],
    |       ""parent"": ""0104607069767149215EFhHYJgA5F6i"",
    |       ""producerInn"": ""2287003050"",
    |       ""producerName"": ""ООО ""БПЗ"",
    |       ""markWithdraw"": false,
    |       ""expirationDate"": ""2024-07-03T00:00:00.000Z""
    |    	}
    |	}
	|]";	
	
КонецФункции	

Функция ПолучитьОписаниеОшибкиПолученияИнформации(ПараметрыПолученияИнформации, КонтрольВладельца, Номенклатура) Экспорт
	
	ОбщееОписаниеОшибки = "";
	
	Если Не ПараметрыПолученияИнформации.ЗапросНаПроверкуОтправлен И ЗначениеЗаполнено(ПараметрыПолученияИнформации.ОписаниеОшибкиОтправкиЗапроса) Тогда
		ОбщееОписаниеОшибки = СтрШаблон("Запрос на проверку владельца кода маркировки не отправлен: %1", ПараметрыПолученияИнформации.ОписаниеОшибкиОтправкиЗапроса);	
	
	ИначеЕсли Не ПараметрыПолученияИнформации.Свойство("КодыМаркировки") Или  ПараметрыПолученияИнформации.КодыМаркировки.Количество() = 0 Тогда
		ОбщееОписаниеОшибки = "Не получены результаты проверки владельца кода маркировки";
	
	ИначеЕсли ЗначениеЗаполнено(ПараметрыПолученияИнформации.КодыМаркировки[0].ОписаниеОшибки) Тогда
		ОбщееОписаниеОшибки = "Ошибка получения результатов проверки владельца товара %1";	
	
	ИначеЕсли КонтрольВладельца И Не ПараметрыПолученияИнформации.КодыМаркировки[0].ВладелецНашаОрганизация Тогда
		ОбщееОписаниеОшибки = СтрШаблон("Не пройден контроль владельца товара. Владелец товара не наша организация: %1, ИНН %2", 
			ПараметрыПолученияИнформации.КодыМаркировки[0].НаименованиеВладельца, ПараметрыПолученияИнформации.КодыМаркировки[0].ИННВладельца);	
	КонецЕсли;

	ПараметрыПолученияИнформации.Вставить("ОбщееОписаниеОшибки", ОбщееОписаниеОшибки);
	
	Возврат ОбщееОписаниеОшибки;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

Функция НастройкиПроверкиКМПоВидуПродукции(ВидПродукции, Операция = Неопределено) Экспорт
	
	Операция = ?(Операция = Неопределено,ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтгрузкаПродажа"),Операция); 
	НастройкиСканированияКодовМаркировки = ОбщегоНазначенияИСМПВызовСервера.НастройкиСканированияКодовМаркировки();
	
    КонтрольСтатуса   = НужнаПроверкаПоПараметрамКонроляКМ(НастройкиСканированияКодовМаркировки.ПараметрыКонтроляСтатусов,ВидПродукции, Операция);
    КонтрольВладельца = НужнаПроверкаПоПараметрамКонроляКМ(НастройкиСканированияКодовМаркировки.ПараметрыКонтроляВладельцев,ВидПродукции, Операция);

	Возврат Новый Структура("КонтрольСтатуса,КонтрольВладельца",КонтрольСтатуса, КонтрольВладельца);
	
КонецФункции

функция  НужнаПроверкаПоПараметрамКонроляКМ(ПараметрыКонтроляКМ, ВидПродукции, Операция = Неопределено);
	
	НуженКонтроль = Ложь;
	
	Если ПараметрыКонтроляКМ.Включено Тогда 
		НуженКонтроль = Истина;
		Если ПараметрыКонтроляКМ.Исключения[ВидПродукции] <> Неопределено Тогда
			Если ПараметрыКонтроляКМ.Исключения[ВидПродукции][Операция] <> Неопределено Тогда	
				НуженКонтроль = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
  
 Возврат НуженКонтроль;  
 
КонецФункции


Функция АктуализироватьМаркировку(Товары, ОбнулитьКоличествоМарк = Ложь) Экспорт
	
	ТабТовары = Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК НоменклатураТЗ,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|   Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|   Товары.Количество КАК Количество
	|
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ВидНоменклатуры.ПродукцияМаркируемаяДляГИСМ КАК ПродукцияМаркируемаяДляГИСМ,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|   Товары.Количество КАК Количество
	|ИЗ
	|	ВТ_Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Товары.НоменклатураТЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры.ПродукцияМаркируемаяДляГИСМ = ИСТИНА";
	
	Запрос.УстановитьПараметр("Товары",ТабТовары);
	Запрос.УстановитьПараметр("ОбнулитьКоличествоМарк", ОбнулитьКоличествоМарк);
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	ТабТовары.ЗаполнитьЗначения(Ложь,"Маркировка");
	
	Если Результат.Количество()>0 Тогда
		
		Если ОбнулитьКоличествоМарк Тогда
		   Результат.ЗаполнитьЗначения(0,"КоличествоУпаковок,Количество");  
		КонецЕсли;
		
		Для Каждого Строка из Результат Цикл
			СтрТовары = ТабТовары.Найти(Строка.НомерСтроки,"НомерСтроки");
			ЕстьМаркировка = Строка.ПродукцияМаркируемаяДляГИСМ;
			Если ЕстьМаркировка Тогда
		    	СтрТовары.Маркировка = НоменклатураПодлежитМаркировке(СтрТовары.Номенклатура);	
			КонецЕсли;	
		КонецЦикла; 
		Возврат ТабТовары;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
    
КонецФункции

Функция ОпределитьВидПродукции(Номенклатура,МассивВидовПродукции)Экспорт 
    ВидПродукции = ИнтеграцияИСУТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(Номенклатура.ВидНоменклатуры.ОсобенностьУчета);
    ВидПродукции =  ?(МассивВидовПродукции.Найти(ВидПродукции) = Неопределено,МассивВидовПродукции[0],ВидПродукции);
    Возврат ВидПродукции;
КонецФункции


#Область ОбработкаКМ
Функция ПолучитьСтруктуруКодаМаркировки (ШКМаркировки) Экспорт  
	
	МассивКодовМаркировкиЧЗ = Новый Массив;
	МассивКодовМаркировкиЧЗ.Добавить(ШКМаркировки);

	ШтрихкодМаркировки = СтрЗаменить(ШКМаркировки,МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1(),""); 
		
	СтруктураКодаМаркировки = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ШтрихкодМаркировки);
	СтруктураКодаМаркировки.Вставить("МассивКодовМаркировкиЧЗ",МассивКодовМаркировкиЧЗ);   
	
	Возврат СтруктураКодаМаркировки;
КонецФункции

Функция ПроверкаЧЗ(МассивКодовМаркировки,ВидПродукции,Операция) Экспорт 
	
        НастройкиПроверкиКМ = МаркировкаАльтерра.НастройкиПроверкиКМПоВидуПродукции(ВидПродукции, Операция);
		КодВалидный = Истина;
		СообщениеОбОшибках = "";
		
		Если АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда
			РежимПроверки = -1;
		Иначе
			РежимПроверки = 1; //тестовый положительный ответ по проверкам		
		КонецЕсли;    
		 
		// Проверка на владельца   
		Если НастройкиПроверкиКМ.КонтрольВладельца Тогда
			РезультатПроверки = МаркировкаАльтерра.ПолучениеИнформацииМаркировки(МассивКодовМаркировки, РежимПроверки, , Истина);
			Если РезультатПроверки.ЗапросНаПроверкуОтправлен Тогда 	
				Если НЕ РезультатПроверки.КодыМаркировки[0].ВладелецНашаОрганизация  Тогда							   
					СообщениеОбОшибках ="Код маркировки не прошел проверку по владельцу!";
					КодВалидный = Ложь; 
				КонецЕсли;		
			Иначе  
				СообщениеОбОшибках = "Не удалось выполнить запрос на проверку владельца кода маркировки в ЧЗ!";
			КонецЕсли;		
		КонецЕсли;
		
		//Проверка на статус  
		Если НастройкиПроверкиКМ.КонтрольСтатуса И КодВалидный Тогда 
			
			РезультатПроверки = МаркировкаАльтерра.ПроверитьМаркировку(МассивКодовМаркировки,РежимПроверки); 
			
			Если РезультатПроверки.ЗапросНаПроверкуОтправлен Тогда 	
				Если НЕ РезультатПроверки.КодыМаркировки[0].СтатусВОбороте  Тогда							   
					СообщениеОбОшибках =  СообщениеОбОшибках + "
				    |Код маркировки не в обороте!";
				 	КодВалидный = Ложь; 
				КонецЕсли;		
			Иначе  
				СообщениеОбОшибках = СообщениеОбОшибках + "
				|Не удалось выполнить запрос на проверку статуса кода маркировки в ЧЗ!";
			КонецЕсли;		
		КонецЕсли;
		
		СтруктураОтвета = Новый Структура("КодВалидный, СообщениеОбОшибках",КодВалидный,СообщениеОбОшибках);
			
	    Возврат СтруктураОтвета; 
		
КонецФункции   
	
#КонецОбласти



 
