
&НаКлиенте
Процедура ЧислительПриИзменении(Элемент)
	ПересчитатьНорматив();
КонецПроцедуры

&НаКлиенте
Процедура ЗнаменательПриИзменении(Элемент)
	ПересчитатьНорматив();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНорматив()
	Если Объект.Знаменатель <>0 Тогда
		Объект.Норматив = Объект.Числитель/Объект.Знаменатель;
	КонецЕсли;
КонецПроцедуры // ПересчитатьНорматив()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЕдиницИзмерения = Объект.ЕдИзмеренияЗнаменателя.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура СписокЕдиницИзмеренияПриИзменении(Элемент)
	Объект.ЕдИзмеренияЗнаменателя = ПолучитьЕдиницуИзмерениСервер(СписокЕдиницИзмерения);
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмерениСервер(Наименование)

	 Возврат Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(Наименование);

КонецФункции // ПолучитьЕдиницуИзмерениСервер()

