#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Пропуск") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Пропуск", НСтр("ru = 'Пропуск'"), СформироватьПечатнуюФормуПропуска(МассивОбъектов, "Пропуск"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПропускЭтикетка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПропускЭтикетка", НСтр("ru = 'ПропускЭтикетка'"), СформироватьПечатнуюФормуПропуска(МассивОбъектов, "ПропускЭтикетка"));
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуПропуска(Документ, ПечататьМакет) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Если ПечататьМакет = "Пропуск" Тогда 
		Макет = ПолучитьМакет("Пропуск");
	Иначе 
		Макет = ПолучитьМакет("ПропускЭтикетка");
	КонецЕсли;
		
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");

	
	
	Выборка = ЗапросФормированиеПечатнойФормыПропуска(Документ.Ссылка);
	Выборка.Следующий();
	
	//Если Выборка.Доступ.Наименование = "Склад Барнаул" Тогда   //Если Барнаул - то QR код на печать
		
		ОбластьQRкода = Макет.ПолучитьОбласть("ОбластьQRкода");;
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(Выборка.QrКод, 1, 400);
  		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
 		ОбластьQRкода.Рисунки.QRКод.Картинка = КартинкаQRКода;
		ТабличныйДокумент.Вывести(ОбластьQRкода);
	//Иначе
	//	ОбластьШтрихкода = Макет.ПолучитьОбласть("ОбластьШтрихкода"); //Для других - штрихкод	
	//	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШтрихкода, Документ.Ссылка);
	//	ТабличныйДокумент.Вывести(ОбластьШтрихкода);
	//	
	//КонецЕсли; 

	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Выборка);
	ОбластьШапка.Параметры.ПериодПрохода = "" + Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(Выборка.ДатаОкончания, "ДФ=dd.MM.yy");
	ОбластьШапка.Параметры.ЦельПосещения = "" + Выборка.ЦельПосещ + ?(Выборка.Расшифровка = "", "", ", ") + Выборка.Расшифровка; 
	ТабличныйДокумент.Вывести(ОбластьШапка);
 
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, Выборка);
	Если Выборка.ТребуетсяПодтверждение Тогда
		ОбластьПодвал.Параметры.Пометка = "Требует подтверждения на КПП"; 
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Если ПечататьМакет = "ПропускЭтикетка" Тогда
		ТабличныйДокумент.ПолеСверху = 0;
		ТабличныйДокумент.ПолеСлева = 0;
		ТабличныйДокумент.ПолеСнизу = 0;
		ТабличныйДокумент.ПолеСправа = 0;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;	
	КонецЕсли;

	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЗапросФормированиеПечатнойФормыПропуска(СсылкаНаДокумент)
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пропуск.Дата КАК Дата,
	|	Пропуск.Номер КАК Номер,
	|	Пропуск.ТипПрохода КАК ТипПрохода,
	|	Пропуск.ДатаНачала КАК ДатаНачала,
	|	Пропуск.ДатаОкончания КАК ДатаОкончания,
	|	Пропуск.Подразделение КАК Подразделение,
	|	Пропуск.Доступ КАК Доступ,
	|	Пропуск.Расшифровка КАК Расшифровка,
	|	Пропуск.ФИО КАК ФИО,
	|	Пропуск.ВидТранспортногоСредства КАК ВидТС,
	|	Пропуск.НаименованиеОрганизации КАК Организация,
	|	Пропуск.Комментарий КАК Комментарий,
	|	Пропуск.Автор КАК Автор,
	|	Пропуск.ТипПропуска КАК ТипПропуска,
	|	Пропуск.ЦельПосещения КАК ЦельПосещ,
	|	Пропуск.Подразделение.Адрес КАК АдресПодразделения,
	|	Пропуск.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
	|	Пропуск.QRкод КАК QRкод
	|ИЗ
	|	Документ.Пропуск КАК Пропуск
	|ГДЕ
	|	Пропуск.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьДанныеПоОснованию(Основание, Объект) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);

	ТекПользователь = Пользователи.ТекущийПользователь();
	Объект.Автор = ТекПользователь;
	Объект.ТипПропуска = Перечисления.ТипыПропусков.Разовый;
	
	ПараметрыИзСправочника = ПараметрыСотрудника(ТекПользователь);

	Если ПараметрыИзСправочника.Количество() = 0 Тогда 
		Возврат;
	Иначе
		Параметры = ПараметрыИзСправочника[0];
	КонецЕсли;
	Объект.РазрешеноУстанавливатьПериодНеПозднее = Параметры.УстанавливатьПериодНеПозднее;
	
	Если Основание = Неопределено ИЛИ ТипЗнч(Основание) = Тип("Структура") Тогда
		 Объект.Подразделение = Параметры.Подразделение;
	КонецЕсли;

	Если Основание = Неопределено Тогда
		Объект.ЦельПосещения = Параметры.ЦельПоУмолчанию; 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Если Основание.Свойство("ЦельПосещения") И Основание.Свойство("ЗонаДоступа") Тогда 
			Объект.ЦельПосещения = Основание.ЦельПосещения;
			Объект.Доступ = Основание.ЗонаДоступа;
			Если Основание.ЦельПосещения = Справочники.ЦелиПосещения.Аутсорс ИЛИ Основание.ЦельПосещения = Справочники.ЦелиПосещения.Собеседование Тогда	
				Объект.ТипПрохода = Перечисления.ТипыПрохода.Вход;
			Иначе
				Объект.ТипПрохода = Перечисления.ТипыПрохода.Въезд;
			КонецЕсли;
			Объект.ДатаНачала = ТекущаяДата();
			Объект.ДатаОкончания = КонецДня(ТекущаяДата());
		КонецЕсли;
	Иначе
		Объект.Основание = Основание;
		Объект.ЦельПосещения = Справочники.ЦелиПосещения.ОсмотрТовара;
		Объект.Подразделение = Основание.Подразделение;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПараметрыСотрудника(Пользователь) 
	
	Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователь);
	
	Запрос = Новый Запрос;
	Если Сотрудник.Индивидуально Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.УстанавливатьПериодНеПозднее КАК УстанавливатьПериодНеПозднее,
		|	Сотрудники.ЦельПоУмолчанию КАК ЦельПоУмолчанию,
		|	Сотрудники.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Отделы.УстанавливатьПериодНеПозднее КАК УстанавливатьПериодНеПозднее,
		|	Отделы.ЦельПоУмолчанию КАК ЦельПоУмолчанию,
		|	Сотрудники.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Отделы КАК Отделы
		|		ПО (Сотрудники.Отдел = Отделы.Ссылка)
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";	
	КонецЕсли;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции


#КонецЕсли
