
&НаСервереБезКонтекста
&Вместо("КартаПерсонализирована")
Функция Док_КартаПерсонализирована(ВидКарты)
	
	// +Альтерра -
	//Персонализирована = Ложь;
	//
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	ВидыКартЛояльности.Персонализирована КАК Персонализирована
	//|ИЗ
	//|	Справочник.ВидыКартЛояльности КАК ВидыКартЛояльности
	//|ГДЕ
	//|	ВидыКартЛояльности.Ссылка = &Ссылка");
	//
	//Запрос.УстановитьПараметр("Ссылка", ВидКарты);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	Персонализирована = Выборка.Персонализирована;
	//КонецЕсли;
	//
	//Возврат Персонализирована;
	// -Альтерра -
	
	// +Альтерра +
	Если Не ЗначениеЗаполнено(ВидКарты) тогда
		Возврат Истина;
	Иначе
		Результат = ПродолжитьВызов(ВидКарты);
		Возврат Результат;
	КонецЕсли;
	// -Альтерра +
	
КонецФункции
