&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("АдминистрированиеПропускнойСистемы") ИЛИ РольДоступна("ПолныеПрава") Тогда
		Элементы.СКУД.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры 



&НаСервереБезКонтекста
Функция ЕстьДублиПоСекциям(Секция,Ссылка)   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Отделы.Ссылка КАК Ссылка,
		|	Отделы.Секция.Владелец КАК Склад
		|ИЗ
		|	Справочник.Отделы КАК Отделы
		|ГДЕ
		|	Отделы.Секция = &Секция
		|	И НЕ Отделы.ПометкаУдаления
		|	И Отделы.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Секция", Секция); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	  Результат.Добавить(Новый Структура("Склад,Ссылка",Выборка.Склад,Выборка.Ссылка));
  	КонецЦикла;   
  
  Возврат Результат;

КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)        
Если ЗначениеЗаполнено(Объект.Секция) Тогда	
	РезультатПроверки = ЕстьДублиПоСекциям(Объект.Секция,Объект.Ссылка);
	Если РезультатПроверки.Количество() > 0 Тогда 
		Отказ = Истина;
		Для Каждого Элемент Из РезультатПроверки Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Запись не возможна!!!! В справочнике уже есть отдел с секцией: %1 (%2)",Объект.Секция,Элемент.Склад);
			Сообщение.КлючДанных = Элемент.Ссылка;
			Сообщение.Сообщить(); 
		КонецЦикла;
	КонецЕсли;  
КонецЕсли;
   
 ЗначениеЗаполнено(Объект.Подразделение);

Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
	Отказ = Истина;          
	Сообщить("Не заполнено Подразделение"); 
КонецЕсли;	
КонецПроцедуры

