
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	тзнВрем1 = Параметры.СоответствиеОсновныхРеквизитовНоменклатуры.выгрузить();
	тзнВрем2 = Параметры.СоответствиеДополнительныхРеквизитовНоменклатуры.выгрузить();
	
	СоответствиеОсновныхРеквизитовНоменклатуры.Загрузить(тзнВрем1);
	СоответствиеДополнительныхРеквизитовНоменклатуры.Загрузить(тзнВрем2);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруСоответствий()
	
	Результат = Новый Структура;
	Результат.Вставить("СоответствиеОсновныхРеквизитовНоменклатуры",СоответствиеОсновныхРеквизитовНоменклатуры);
	Результат.Вставить("СоответствиеДополнительныхРеквизитовНоменклатуры",СоответствиеДополнительныхРеквизитовНоменклатуры);

	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивПолей1СДляНоменклатуры()
	
	мПолей1С = новый Массив;
	мПолей1С.Добавить("");
	мПолей1С.Добавить("Номенклатура");
	мПолей1С.Добавить("Код");
	мПолей1С.Добавить("Наименование");
	мПолей1С.Добавить("Полное наименование");
	мПолей1С.Добавить("Штрихкод");
	мПолей1С.Добавить("Артикул");
	мПолей1С.Добавить("Описание");
	мПолей1С.Добавить("Марка");
	мПолей1С.Добавить("Вес");
	мПолей1С.Добавить("Родитель");
	мПолей1С.Добавить("Вид номенклатуры");
	 
	Возврат мПолей1С;
	
КонецФункции

&НаСервере
Функция ПроверитьКорректностьПоля(НаименованиеПоля)
	
	МассивПолей = ПолучитьМассивПолей1СДляНоменклатуры();
	
	Если МассивПолей.Найти(НаименованиеПоля) = Неопределено тогда
		
		Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
		
		Попытка
			
			Выполнить(" Проверка = " + НаименованиеПоля);
			
		Исключение
			Возврат Ложь;	
		КонецПопытки;
		
	КонецЕсли;	
	
	Возврат Истина;	
	
КонецФункции

&НаСервере
Процедура ЗаполнениеТаблицСоответствийПоУмолчанию()
	
	СтруктураСТаблицами = Новый Структура;
	СтруктураСТаблицами.Вставить("СоответствиеОсновныхРеквизитовНоменклатуры"		, СоответствиеОсновныхРеквизитовНоменклатуры.Выгрузить());
	СтруктураСТаблицами.Вставить("СоответствиеДополнительныхРеквизитовНоменклатуры"	, СоответствиеДополнительныхРеквизитовНоменклатуры.Выгрузить());

	ПланыОбмена.Б_ОбменССайтом.ЗаполнениеПолейСоответствийНоменклатурыПоУмолчанию(СтруктураСТаблицами);
	
	СоответствиеОсновныхРеквизитовНоменклатуры.Загрузить(СтруктураСТаблицами.СоответствиеОсновныхРеквизитовНоменклатуры);
	СоответствиеДополнительныхРеквизитовНоменклатуры.Загрузить(СтруктураСТаблицами.СоответствиеДополнительныхРеквизитовНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(ПолучитьСтруктуруСоответствий());

КонецПроцедуры

&НаКлиенте
Процедура СоответствиеОсновныхРеквизитовНоменклатурыНаименованиеПоля1СОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Ответ = Вопрос("Проверить корректность поля? ", РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаУспешна = ПроверитьКорректностьПоля(Текст);	
	
	Если Не ПроверкаУспешна тогда
		Сообщить("При проверке корректности поля 1С возникла ошибка. Указать это поле нельзя.");
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Ответ = Вопрос("Будут очищены все пользовательские соответствия полей. Продолжить? ", РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеДополнительныхРеквизитовНоменклатуры.Очистить();
	СоответствиеОсновныхРеквизитовНоменклатуры.Очистить();
	
    ЗаполнениеТаблицСоответствийПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеОсновныхРеквизитовНоменклатурыНаименованиеПоля1СНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивПолей1СДляНоменклатуры());
	
КонецПроцедуры



