// В процедуре нужно реализовать заполнение параметров формирования текста запроса на основании ссылки на документ.
//
// Параметры:
// 	Параметры - Структура - 
// 	ДокументСсылка - ДокументСсылка - 
Процедура ЗаполнитьПараметрыФормированияТекстаЗапросаВложенныхШтрихкодов(Параметры, ДокументСсылка) Экспорт
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.ЧекККМ")
		Или ТипДокумента = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		
		Параметры.ИспользоватьИдентификаторСтроки = Истина;
		Параметры.ИмяПоляАлкогольнаяПродукция     = "НоменклатураЕГАИС";
		
	КонецЕсли;
	
	Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		Или ТипДокумента = Тип("ДокументСсылка.ВнутреннееПотребление")
		Или ТипДокумента = Тип("ДокументСсылка.ПеремещениеТоваров")
		Или ТипДокумента = Тип("ДокументСсылка.ПередачаТоваровХранителю")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		Или ТипДокумента = Тип("ДокументСсылка.СборкаТоваров")


	Тогда
		
		Параметры.ИмяТабЧастиАкцизныхМарок = "ШтрихкодыУпаковок";
		Параметры.ОрганизацияЕГАИС = Истина;
		Параметры.ИспользоватьИдентификаторСтроки = Ложь;
		
	КонецЕсли;
	

КонецПроцедуры