
&НаСервере
Процедура ОП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
МодифицироватьЗапрос();	
КонецПроцедуры   
&НаСервере
Процедура СоздатьЗапрос()

	 СписокПоддерживаемыхЗапасов.ТекстЗапроса=  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ТоварныеОграниченияПереопределяемый.ГруппировкаТоварныхОграничений КАК ГруппировкаТоварныхОграничений,
|	ТоварныеОграниченияПереопределяемый.Номенклатура КАК Номенклатура,
|	ТоварныеОграниченияПереопределяемый.Характеристика КАК Характеристика,
|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	ТоварныеОграниченияПереопределяемый.Склад КАК Склад,
|	ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, ТоварныеОграниченияПереопределяемый.МетодОбеспеченияПотребностей) КАК ПоддержаниеЗапаса,
|	ЕСТЬNULL(НастройкаГруппировки.МинимальноеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.МинимальноеКоличествоЗапаса) КАК МинимальныйЗапас,
|	ЕСТЬNULL(НастройкаГруппировки.МаксимальноеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.МаксимальноеКоличествоЗапаса) КАК МаксимальныйЗапас,
|	ЕСТЬNULL(НастройкаГруппировки.ПределМИН, ТоварныеОграниченияПереопределяемый.ПределМИН) КАК ПределМИН,
|	ЕСТЬNULL(НастройкаГруппировки.ПределМАКС, ТоварныеОграниченияПереопределяемый.ПределМАКС) КАК ПределМАКС,
|	ЕСТЬNULL(НастройкаГруппировки.СтраховоеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.СтраховоеКоличествоЗапаса) КАК СтраховойЗапас,
|	ЕСТЬNULL(НастройкаГруппировки.НормаПотребления, ТоварныеОграниченияПереопределяемый.НормаПотребления) КАК НормаПотребления,
|	ЕСТЬNULL(НастройкаГруппировки.ОбеспечениеЗаказовПриПоддержанииЗапаса, ТоварныеОграниченияПереопределяемый.ОбеспечениеЗаказовПриПоддержанииЗапаса) КАК ОбеспечениеЗаказов,
|	ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление КАК СреднедневноеПотребление,
|	ВЫБОР
|		КОГДА ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление > 0
|			ТОГДА ТоварныеОграниченияПереопределяемый.СреднееОтклонениеПотребления / ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление * 100
|		ИНАЧЕ 0
|	КОНЕЦ КАК ОтклонениеПотребления,
|	ВЫБОР
|		КОГДА ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление > 0
|				И ТоварныеОграниченияПереопределяемый.СреднееОтклонениеПотребления < 0.05 * ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление
|			ТОГДА &РекомендацияПоддерживать
|		ИНАЧЕ &РекомендацияНеПоддерживать
|	КОНЕЦ КАК Рекомендация,
|	СпрСпособ.Ссылка КАК СпособОбеспечения,
|	СпрСпособ.СрокИсполненияЗаказа КАК СрокПоставки,
|	СпрСпособ.ОбеспечиваемыйПериод КАК ОбеспечиваемыйПериод,  
|  	СпрСпособ.ВариантОбеспечиваемогоПериода КАК ВариантОбеспечиваемогоПериода,
|	СпрСпособ.ИсточникОбеспеченияПотребностей КАК ИсточникОбеспечения,
|	СпрСпособ.ТипОбеспечения КАК ТипОбеспечения,
|	СпрНоменклатура.СхемаОбеспечения КАК СхемаОбеспечения,
|	СпрФорматы.ФорматМагазина КАК ФорматМагазина,
|	ТоварныеОграниченияПереопределяемый.ЭтоГруппировка КАК ЭтоГруппа,
|	СпрНоменклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) КАК ХарактеристикиИспользуются,
|	ВЫБОР
|		КОГДА ТоварныеОграниченияПереопределяемый.ЭтоГруппировка
|			ТОГДА &РежимОтображения
|		КОГДА ТоварныеОграниченияПереопределяемый.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
|				И СпрНоменклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
|			ТОГДА 4
|		ИНАЧЕ 3
|	КОНЕЦ КАК Картинка,
|	&ЭтоРежимРекомендаций КАК ЭтоРежимРекомендаций,
|	ИСТИНА КАК ПолеИстина,
|	&АлгоритмРасчета КАК АлгоритмРасчета
|{ВЫБРАТЬ
|	ГруппировкаТоварныхОграничений.*,
|	Номенклатура.*,
|	Характеристика.*,
|	ЕдиницаИзмерения.*,
|	Склад.*,
|	ПоддержаниеЗапаса,
|	МинимальныйЗапас,
|	МаксимальныйЗапас,
|	ПределМИН,
|	ПределМАКС,
|	СтраховойЗапас,
|	НормаПотребления,
|	ОбеспечениеЗаказов,
|	СреднедневноеПотребление,
|	ОтклонениеПотребления,
|	Рекомендация,
|	СрокПоставки,
|	ОбеспечиваемыйПериод,
|   ВариантОбеспечиваемогоПериода,
|	ИсточникОбеспечения,
|	АлгоритмРасчета}
|ИЗ
|	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграниченияПереопределяемый
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
|		ПО ТоварныеОграниченияПереопределяемый.Номенклатура = СпрНоменклатура.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияФорматовМагазинов.СрезПоследних(, ) КАК СпрФорматы
|		ПО (СпрФорматы.Склад = ТоварныеОграниченияПереопределяемый.Склад)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыОбеспеченияТоварами КАК ТаблицаВариантыОбеспеченияТоварами
|		ПО (ТаблицаВариантыОбеспеченияТоварами.Номенклатура = ТоварныеОграниченияПереопределяемый.Номенклатура)
|			И (ТаблицаВариантыОбеспеченияТоварами.Характеристика = ТоварныеОграниченияПереопределяемый.Характеристика)
|			И (ТаблицаВариантыОбеспеченияТоварами.Склад = ТоварныеОграниченияПереопределяемый.Склад)
|			И (ТаблицаВариантыОбеспеченияТоварами.РеквизитДопУпорядочивания = 1)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ТаблицаСхемыОбеспеченияСкладов
|		ПО (ТаблицаСхемыОбеспеченияСкладов.СхемаОбеспечения = СпрНоменклатура.СхемаОбеспечения)
|			И (ТаблицаСхемыОбеспеченияСкладов.Склад = ТоварныеОграниченияПереопределяемый.Склад)
|			И (ТаблицаВариантыОбеспеченияТоварами.Номенклатура ЕСТЬ NULL)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ТаблицаСхемыОбеспеченияФорматов
|		ПО (ТаблицаСхемыОбеспеченияФорматов.СхемаОбеспечения = СпрНоменклатура.СхемаОбеспечения)
|			И (ТаблицаСхемыОбеспеченияФорматов.Склад = СпрФорматы.ФорматМагазина)
|			И (ТаблицаСхемыОбеспеченияСкладов.СхемаОбеспечения ЕСТЬ NULL)
|			И (ТаблицаВариантыОбеспеченияТоварами.Номенклатура ЕСТЬ NULL)
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
|		ПО (ЕСТЬNULL(ТаблицаВариантыОбеспеченияТоварами.СпособОбеспеченияПотребностей, ЕСТЬNULL(ТаблицаСхемыОбеспеченияСкладов.СпособОбеспеченияПотребностей, ЕСТЬNULL(ТаблицаСхемыОбеспеченияФорматов.СпособОбеспеченияПотребностей, ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)))) = СпрСпособ.Ссылка)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК НастройкаГруппировки
|		ПО (НастройкаГруппировки.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
|			И (НастройкаГруппировки.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
|			И (НастройкаГруппировки.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
|			И (НастройкаГруппировки.ГруппировкаТоварныхОграничений = ТоварныеОграниченияПереопределяемый.ГруппировкаТоварныхОграничений)
|			И (НастройкаГруппировки.ЭтоДействующийПараметр)
|ГДЕ
|	&РежимПросмотра
|	И &РежимРекомендаций
|{ГДЕ
|	(СпрНоменклатура.ТоварнаяКатегория = &ТоварнаяКатегория
|			ИЛИ ТоварныеОграниченияПереопределяемый.ЭтоГруппировка) КАК Поле2,
|	(СпрФорматы.ФорматМагазина = &ФорматМагазина
|			ИЛИ ТоварныеОграниченияПереопределяемый.ЭтоГруппировка) КАК Поле4,
|	(ТоварныеОграниченияПереопределяемый.Номенклатура В
|			(ВЫБРАТЬ
|				Сегменты.Номенклатура
|			ИЗ
|				РегистрСведений.НоменклатураСегмента КАК Сегменты
|			ГДЕ
|				Сегменты.Сегмент = &СегментНоменклатуры)) КАК Поле6,
|	((ТоварныеОграниченияПереопределяемый.Номенклатура, ТоварныеОграниченияПереопределяемый.Склад) В
|			(ВЫБРАТЬ
|				ИзменениеАссортиментаТовары.Номенклатура КАК Номенклатура,
|				ЕСТЬNULL(Форматы.Склад, ИзменениеАссортимента.ОбъектПланирования) КАК Склад
|			ИЗ
|				Документ.ИзменениеАссортимента КАК ИзменениеАссортимента
|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеАссортимента.Товары КАК ИзменениеАссортиментаТовары
|					ПО
|						ИзменениеАссортиментаТовары.Ссылка = ИзменениеАссортимента.Ссылка
|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияФорматовМагазинов.СрезПоследних КАК Форматы
|					ПО
|						Форматы.ФорматМагазина = ИзменениеАссортимента.ОбъектПланирования
|			ГДЕ
|				ИзменениеАссортимента.Ссылка = &ДокументИзмененияАссортимента)) КАК Поле8,
|	ТоварныеОграниченияПереопределяемый.Номенклатура.* КАК Номенклатура,
|	ТоварныеОграниченияПереопределяемый.Характеристика.* КАК Характеристика,
|	СпрНоменклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
|	ТоварныеОграниченияПереопределяемый.Склад.* КАК Склад,
|	(ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, ТоварныеОграниченияПереопределяемый.МетодОбеспеченияПотребностей)).* КАК ПоддержаниеЗапаса,
|	(ЕСТЬNULL(НастройкаГруппировки.МинимальноеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.МинимальноеКоличествоЗапаса)) КАК МинимальныйЗапас,
|	(ЕСТЬNULL(НастройкаГруппировки.МаксимальноеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.МаксимальноеКоличествоЗапаса)) КАК МаксимальныйЗапас,
|	(ЕСТЬNULL(НастройкаГруппировки.ПределМИН, ТоварныеОграниченияПереопределяемый.ПределМИН)) КАК ПределМИН,
|	(ЕСТЬNULL(НастройкаГруппировки.ПределМАКС, ТоварныеОграниченияПереопределяемый.ПределМАКС)) КАК ПределМАКС,
|	(ЕСТЬNULL(НастройкаГруппировки.СтраховоеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.СтраховоеКоличествоЗапаса)) КАК СтраховойЗапас,
|	(ЕСТЬNULL(НастройкаГруппировки.НормаПотребления, ТоварныеОграниченияПереопределяемый.НормаПотребления)) КАК НормаПотребления,
|	(ЕСТЬNULL(НастройкаГруппировки.ОбеспечениеЗаказовПриПоддержанииЗапаса, ТоварныеОграниченияПереопределяемый.ОбеспечениеЗаказовПриПоддержанииЗапаса)).* КАК ОбеспечениеЗаказов,
|	ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление КАК СреднедневноеПотребление,
|	(ВЫБОР
|			КОГДА ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление > 0
|				ТОГДА ТоварныеОграниченияПереопределяемый.СреднееОтклонениеПотребления / ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление * 100
|			ИНАЧЕ 0
|		КОНЕЦ) КАК ОтклонениеПотребления,
|	(ВЫБОР
|			КОГДА ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление > 0
|					И ТоварныеОграниченияПереопределяемый.СреднееОтклонениеПотребления / ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление < 0.05
|				ТОГДА &РекомендацияПоддерживать
|			ИНАЧЕ &РекомендацияНеПоддерживать
|		КОНЕЦ) КАК Рекомендация,
|	СпрСпособ.Ссылка.* КАК СпособОбеспечения,
|	СпрСпособ.СрокИсполненияЗаказа КАК СрокПоставки,
|	СпрСпособ.ОбеспечиваемыйПериод КАК ОбеспечиваемыйПериод,
|   СпрСпособ.ВариантОбеспечиваемогоПериода КАК ВариантОбеспечиваемогоПериода,
|	СпрСпособ.ИсточникОбеспеченияПотребностей КАК ИсточникОбеспечения,
|	СпрСпособ.ТипОбеспечения.* КАК ТипОбеспечения,
|	СпрНоменклатура.СхемаОбеспечения.* КАК СхемаОбеспечения,
|	СпрФорматы.ФорматМагазина.* КАК ФорматМагазина,
|	(СпрНоменклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)) КАК ХарактеристикиИспользуются}";	
	

КонецПроцедуры


&НаСервере
Процедура МодифицироватьЗапрос()
	
	 СписокПоддерживаемыхЗапасов.ТекстЗапроса=стрзаменить(СписокПоддерживаемыхЗапасов.ТекстЗапроса,"&АлгоритмРасчета",
	            "ЕСТЬNULL(НастройкаГруппировки.АлгоритмРасчета, ТоварныеОграниченияПереопределяемый.АлгоритмРасчета)");
	 
КонецПроцедуры

&После ("УстановитьРежимРекомендацийИПросмотра")
Процедура Док_УстановитьРежимРекомендацийИПросмотраПосле()
	МодифицироватьЗапрос();
КонецПроцедуры

&Перед ("ПриСозданииНаСервере")
&НаСервере
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СоздатьЗапрос();
КонецПроцедуры
