Функция ТабельНомерДняПоИмениЭлемента(ИмяПоля) Экспорт
	
	План = ?(СтрНайти(ИмяПоля, "План") > 1,"План", "");
	
	ОбрабатываемыйТекст = СтрЗаменить(ИмяПоля, "ДанныеОВремени" + План, "");
	ОбрабатываемыйТекст = СтрЗаменить(ОбрабатываемыйТекст, "Представление" + План, "");
	
	//ОбрабатываемыйТекст = СтрЗаменить(ИмяПоля, "ДанныеОВремени", "");
	//ОбрабатываемыйТекст = СтрЗаменить(ОбрабатываемыйТекст, "Представление", "");
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ОбрабатываемыйТекст) Тогда
		Возврат Число(ОбрабатываемыйТекст);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьДанныеОВремени(Объект, Форма, ИмяЭлемента, ВидВремени, Часов, БуквенноеОбозначение) Экспорт 
	
	План = ?(СтрНайти(ИмяЭлемента, "План") > 1,"План", "");
	НомерДня = ТабельНомерДняПоИмениЭлемента(ИмяЭлемента);
	ДанныеТекущейСтроки = Форма.Элементы.ДанныеОВремени.ТекущиеДанные;
	Если План = "" Тогда
		ДанныеТекущейСтроки["ВидВремени" + НомерДня] = ВидВремени;
	КонецЕсли;
	ДанныеТекущейСтроки["Часов" + План + НомерДня] = Часов;
	//ДанныеТекущейСтроки["Часов" + НомерДня] = Часов;
	ДанныеТекущейСтроки["Представление" + План + НомерДня] = ""+БуквенноеОбозначение+?(Часов = 0, "", Строка(Часов));
	//ДанныеТекущейСтроки["Представление"+НомерДня] = ""+БуквенноеОбозначение+?(Часов=0, "", Строка(Часов));	
	
	ОбновитьИтогДанныхОВремени(Объект);
	
КонецПроцедуры

Функция ПолучитьДанныеОВремени(Форма, ИмяЭлемента) Экспорт   
	
	НомерДня = ТабельНомерДняПоИмениЭлемента(ИмяЭлемента);
	ДанныеТекущейСтроки = Форма.Элементы.ДанныеОВремени.ТекущиеДанные; 
	
	ВидВремени = ДанныеТекущейСтроки["ВидВремени" + НомерДня];
	Часов = ДанныеТекущейСтроки["Часов" + НомерДня];             
	Представление= ДанныеТекущейСтроки["Представление"+НомерДня];	
	
	Возврат Новый Структура("ВидВремени,Часов,Представление",ВидВремени,Часов,Представление);
	
КонецФункции

Функция ТабельРазобратьСтрокуВремени(Знач ПредставлениеДанныхОВремени, Отказ = Ложь) Экспорт
	
	Если ПустаяСтрока(ПредставлениеДанныхОВремени) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(ПредставлениеДанныхОВремени, Ложь, "") Тогда
		Сообщить("Данные о времени необходимо вводить на русском!");	
		Возврат Неопределено;
	КонецЕсли;
	
	ДлиннаСтроки= СтрДлина(ПредставлениеДанныхОВремени);
	Часы = 0;
	БуквенноеОбозначение = "";
	//Если только число
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПредставлениеДанныхОВремени, Ложь, Ложь) Тогда
		Часы= Число(ПредставлениеДанныхОВремени);
		
		Если Часы = 0 Тогда
			ДанныеВидВремени= УчетРабочегоВремениСервер.ПолучитьВидВремениВыходной();
		Иначе
			ДанныеВидВремени= УчетРабочегоВремениСервер.ПолучитьВидВремениЯвкаСтруктура();
		КонецЕсли;
		ВидВремени= ДанныеВидВремени.ВидВремени;
		БуквенноеОбозначение= ДанныеВидВремени.БуквенноеОбозначение;
		
		Возврат Новый Структура("ВидВремени, БуквенноеОбозначение, Часы", ВидВремени, БуквенноеОбозначение, Часы);
	КонецЕсли;
	
	//Если не только число
	Для Инд=1 По СтрДлина(ПредставлениеДанныхОВремени) Цикл
		Подстрока=Лев(ПредставлениеДанныхОВремени, Инд);
		Если СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Подстрока, Ложь, "") Тогда
			Сообщить("Данные о времени необходимо вводить на русском!");	
			Прервать;
		КонецЕсли;
		
		Если СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Подстрока, Ложь, "") Тогда
			БуквенноеОбозначение= Подстрока;
		Иначе
			Подстрока= Прав(ПредставлениеДанныхОВремени, ДлиннаСтроки-(Инд-1));
			Подстрока= СтрЗаменить(Подстрока,",",".");
			Часы= Число(Подстрока);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ВидВремени= УчетРабочегоВремениСервер.ПолучитьВидВремениПоБуквенномуКоду(БуквенноеОбозначение);
	
	Если ВидВремени= Неопределено Тогда 
		Часы= 0;
		БуквенноеОбозначение= "";
	КонецЕсли;
	
	Возврат Новый Структура("ВидВремени, БуквенноеОбозначение, Часы", ВидВремени, БуквенноеОбозначение, Часы);	
	
КонецФункции

Функция ПолучитьПредставлениеМесяца(ДатаНачалаМесяца) Экспорт
	
	Возврат Формат(ДатаНачалаМесяца, "ДФ='ММММ гггг'");
	
КонецФункции

Процедура ОбновитьИтогДанныхОВремени(Объект)
	
	Табель = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремени");
	
	Для Каждого ДанныеОВремени Из Объект.ДанныеОВремени Цикл
		КолЧасовПлан = 0;
		КолДнейПлан = 0;
		КолЧасов = 0;
		КолДней = 0;
		Для сч = 1 По 31 Цикл
			Часов = ДанныеОВремени["Часов" + сч];
			ЧасовПлан = ?(Табель, ДанныеОВремени["ЧасовПлан" + сч], 0);
			КолЧасов = КолЧасов + Часов;
			КолЧасовПлан = КолЧасовПлан + ЧасовПлан;
			Если Часов <> 0 Тогда 
				КолДней = КолДней + 1;
			КонецЕсли;
			Если ЧасовПлан <> 0 Тогда 
				КолДнейПлан = КолДнейПлан + 1;
			КонецЕсли;
		КонецЦикла;
		
		ДанныеОВремени.ИтогоЧасов = Строка(КолЧасов);
		ДанныеОВремени.ИтогоДней = Строка(КолДней);
		
		Если Табель Тогда
			ДанныеОВремени.ИтогоЧасовПлан = Строка(КолЧасовПлан);
			ДанныеОВремени.ИтогоДнейПлан = Строка(КолДнейПлан);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗарегестрироватьСотрудникаПоШтрихкоду(Штрихкод) Экспорт
	Возврат УчетРабочегоВремениСервер.ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Штрихкод);
КонецФункции