
#Область ПрограммныйИнтерфейс

// Вызывается перед выгрузкой данных.
// ОбщийМодуль.ВыгрузкаЗагрузкаДанныхПереопределяемый.ПередВыгрузкойДанных()
//
Процедура ПередВыгрузкойДанных(Контейнер) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

// Вызывается после выгрузки данных.
// см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеВыгрузкиДанных
//
Процедура ПослеВыгрузкиДанных(Контейнер) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

// Вызывается после загрузки данных.
// см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиДанных
//
Процедура ПослеЗагрузкиДанных(Контейнер) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

// Заполняет массив типов, исключаемых из выгрузки и загрузки данных.
// см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки
//
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт	
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	// Конец ЭлектронноеВзаимодействие
	
	//-- Локализация 
	
КонецПроцедуры

// Заполняет массив типов неразделенных данных, для которых не требуется сопоставление ссылок
// при загрузке данных в другую информационную базу, т.к. корректное сопоставление ссылок
// гарантируется с помощью других механизмов.
// см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке
//
Процедура ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

// Заполняет массив типов неразделенных данных, для которых поддерживается сопоставление ссылок
// при загрузке данных в другую информационную базу.
// см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке 
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	
	//++ Локализация
	
	
	ИнтеграцияЗЕРНО.ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти