
&НаКлиенте
Процедура Док_СтатусОтображениеНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.КВыполнению"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт"));
КонецПроцедуры

&НаСервере
Функция Док_СтатусОтображениеНачалоВыбораПослеНаСервере()
	ДанныеВыбора = Документы.ЗаказНаПеремещение.ДопустимыеСтатусыВводаНаОсновании(Объект);
	Возврат ДанныеВыбора;
КонецФункции

&НаКлиенте
Процедура Док_СтатусОтображениеПриИзмененииПосле(Элемент)
	
	Объект.Статус = Объект.СтатусОтображение;
			
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ВидимостьКнопкиЗаполненияОстатками(Объект.СкладОтправитель);
	
	Для Каждого Команда_СоздатьНаОсновании Из Этаформа.Команды Цикл
		Если Команда_СоздатьНаОсновании.Действие = "Подключаемый_ВыполнитьКоманду"
			И Команда_СоздатьНаОсновании.Заголовок = "Перемещение товаров" Тогда
			ИмяКнопкиСоздатьПеремещение = Команда_СоздатьНаОсновании.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Объект.СтатусОтображение = Объект.Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	
	ИнициализацияДляСкладовПодрядчика();
		
КонецПроцедуры


&НаСервере
Процедура ИнициализацияДляСкладовПодрядчика()
	
	СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если (ЗначениеЗаполнено(Объект.СкладПолучатель) И
       ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И
       Объект.СкладПолучатель.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
       Объект.СкладПолучатель.ОтправкаУведомлений = Истина)
       ИЛИ
       (ЗначениеЗаполнено(Объект.СкладОтправитель) И
       ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И
       Объект.СкладОтправитель.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
       Объект.СкладОтправитель.ОтправкаУведомлений = Истина)	
	Тогда  
		нЭлемент = Элементы.Добавить("КомментарийОтИнженера", Тип("ПолеФормы"), Элементы.Товары); 
		нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
		нЭлемент.ПутьКДанным = "Объект.Товары.КомментарийОтИнженера";  	
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ВВводНаОснованииЗаявкаНаТранспорт(Команда)
	
	ИмяДокумента= "ЗаявкиНаТранспорт";
	ФормаДок = ПолучитьФорму("Документ."+ИмяДокумента+".ФормаОбъекта");
	
	//Далее мы получаем объект только, что созданной формы и помещаем её в переменную
	//В объекте содержатся все реквизиты (элементы) формы
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Заявка на доставку");
		
		ПоказатьПредупреждение(,ТекстВопроса);
		возврат;	
	КонецЕсли;
	
	//Мы помещаем объект формы в переменную,
	//так как должны передать её в процедуру на сервере,
	//где нельзя изменять объект формы, зато можно править переменную содержащую его
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	
	//После выполнения процедуры на сервере мы получаем изменную переменную ДанныеФормы,
	//которую необходимо передать в уже созданную нами форму
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	
	//Открываем результат выполнения обработки
	ФормаДок.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНовыйДокумент(ИмяДокумента, НовыйОбъект)
	Документы[ИмяДокумента].ЗаполнитьДанныеПоОснованию(Объект.Ссылка, НовыйОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииЗаказНаДоставкуОтПоставщика(Команда)
	
	ИмяДокумента= "ЗаказНаДоставкуОтПоставщика";
	ФормаДок = ПолучитьФорму("Документ." + ИмяДокумента + ".ФормаОбъекта");
		
	//Далее мы получаем объект только, что созданной формы и помещаем её в переменную
	//В объекте содержатся все реквизиты (элементы) формы
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Заявка на доставку");
		
		ПоказатьПредупреждение(,ТекстВопроса);
		возврат;	
	КонецЕсли;
	
	//Мы помещаем объект формы в переменную,
	//так как должны передать её в процедуру на сервере,
	//где нельзя изменять объект формы, зато можно править переменную содержащую его
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	
	//После выполнения процедуры на сервере мы получаем изменную переменную ДанныеФормы,
	//которую необходимо передать в уже созданную нами форму
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	
	//Открываем результат выполнения обработки
	ФормаДок.Открыть(); 
	
КонецПроцедуры

&После ("УстановитьУсловноеОформление")
&НаСервере
Процедура Док_УстановитьУсловноеОформление()
	
	ЗаказыСервер.УстановитьОформлениеОтмененнойСтроки(УсловноеОформление,
		Элементы.Товары,
		Элементы.ТоварыОтменено.Имя,
		Элементы.ТоварыПричинаОтмены.Имя);
		
	УстановитьСостояниеЗаказа();
	
КонецПроцедуры

&НаСервере
Функция УстановитьСостояниеЗаказа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ДокументЗаказНаПеремещение.Проведен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияВнутреннихЗаказов.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(СостоянияВнутреннихЗаказов.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияВнутреннихЗаказов.Закрыт))
	|	КОНЕЦ КАК Состояние,
	|	ЕСТЬNULL(СостоянияВнутреннихЗаказов.ЕстьРасхожденияОрдерНакладная, ЛОЖЬ) КАК ЕстьРасхожденияОрдерНакладная
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК ДокументЗаказНаПеремещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВнутреннихЗаказов КАК СостоянияВнутреннихЗаказов
	|		ПО (СостоянияВнутреннихЗаказов.Заказ = ДокументЗаказНаПеремещение.Ссылка)
	|ГДЕ
	|	ДокументЗаказНаПеремещение.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Состояние = Выборка.Состояние;
	Если Выборка.ЕстьРасхожденияОрдерНакладная = Истина Тогда 
		Элементы.ЕстьРасхожденияОрдерНакладная.Видимость = Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ОтменитьВыделенныеСтроки")
Процедура Док_ОтменитьВыделенныеСтроки(Команда)
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
	"Документ.ЗаказНаПеремещение.ФормаДокумента.Команда.ОтменитьВыделенныеСтроки");
	
	#Вставка
	Если Объект.Товары.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Таблица товаров не заполнена.'"));
		Возврат;
	ИначеЕсли Элементы.Товары.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='В таблице товаров отсутствуют выделенные строки.'"));
		Возврат;
	КонецЕсли;
	
	ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовНаПеремещения.ПустаяСсылка");
	ОткрытьФорму("Справочник.ПричиныОтменыЗаказовНаПеремещения.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ОтменитьВыделенныеСтрокиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Возврат;
	#КонецВставки
	
	#Удаление
	ОтменитьВыделенныеСтрокиСервер();
	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена выделенных строк'"), , НСтр("ru = 'Выделенные строки отменены'"));
	#КонецУдаления
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделенныеСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПричинаОтмены = Результат;
    Если ПричинаОтмены = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделенныеСтрокиФрагмент(Знач ПричинаОтмены)
	
	Для Каждого ТекСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
        СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
        
        Если СтрокаТаблицы <> Неопределено Тогда
            
            СтрокаТаблицы.ПричинаОтмены = ПричинаОтмены;
            
            Если Не СтрокаТаблицы.Отменено Тогда
                СтрокаТаблицы.Отменено = Истина;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    ПоказатьОповещениеПользователя(
    НСтр("ru = 'Выделенные строки отменены'"),
    ,
    НСтр("ru='Выделенные строки заказа отменены.'"),
    БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыОтмененоПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если Не ТекущаяСтрока.Отменено Тогда
		ТекущаяСтрока.ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовНаПеремещения.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
&ИзменениеИКонтроль("ОтменитьНеотработанные")
Процедура Док_ОтменитьНеотработанные(Команда)
	
	#Удаление
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.ЗаказНаПеремещение.ФормаДокумента.Команда.ОтменитьНеотработанные");
	
	РезультатОтмены = ОтменитьНеотработанныеСервер();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена неотработанных строк'"), , РезультатОтмены.Оповещение);
	#КонецУдаления

	#Вставка
	ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовНаПеремещения.ПустаяСсылка");
	ОткрытьФорму("Справочник.ПричиныОтменыЗаказовНаПеремещения.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ОтменитьНеотработанныеСтрокиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьНеотработанныеСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПричинаОтменыПустая = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовНаПеремещения.ПустаяСсылка");
    ПричинаОтмены = Результат;
    Если ПричинаОтмены = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
 	РезультатОтмены = ОтменитьНеотработанныеСервер();
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		
		Если ТекСтрока.Отменено Тогда
			ТекСтрока.ПричинаОтмены = ПричинаОтмены;
		иначе
			ТекСтрока.ПричинаОтмены = ПричинаОтменыПустая; 
		КонецЕсли;
		
	КонецЦикла;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена неотработанных строк'"), , РезультатОтмены.Оповещение);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СкорректироватьСтрокиЗаказа")
Функция Док_СкорректироватьСтрокиЗаказа(СтруктураДополнительныхПараметров)

	ЗаказОбъект = РеквизитФормыВЗначение("Объект");

	СтруктураДополнительныхПараметров.ПроверятьОстатки = Истина;

	СтруктураРезультата = ЗаказОбъект.СкорректироватьСтрокиЗаказа(СтруктураДополнительныхПараметров);

	Если СтруктураДополнительныхПараметров.ЗакрыватьЗаказы Тогда
		ЗаказОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
	КонецЕсли;

	ЗначениеВРеквизитФормы(ЗаказОбъект, "Объект");

	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ЗаполнитьСлужебныеРеквизитыФормыДокумента();
	ОбновитьКолонкуДоступноСервер();

	Модифицированность = Истина;
	
#Вставка
	ПричинаОтменыПустая = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовНаПеремещения.ПустаяСсылка");
    ПричинаОтмены = СтруктураДополнительныхПараметров.ПричинаОтмены;
	
	Если ПричинаОтмены = Неопределено Тогда
        Возврат СтруктураРезультата;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		Если ТекСтрока.Отменено Тогда
			ТекСтрока.ПричинаОтмены = ПричинаОтмены;
		иначе
			ТекСтрока.ПричинаОтмены = ПричинаОтменыПустая; 
		КонецЕсли;
	КонецЦикла;
#КонецВставки

	Возврат СтруктураРезультата;

КонецФункции

&НаКлиенте
Процедура Док__ОбновитьКросдокинг(Команда)
	Док__ОбновитьКросдокингНаСервере();
КонецПроцедуры

&НаСервере
Процедура Док__ОбновитьКросдокингНаСервере() 
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Объект.КроссДокинг = Объект.ДокументОснование.КроссДокинг;
	КонецЕсли; 
	
КонецПроцедуры

#Область ЗаполнениеОстаткамиНаСкладе
&НаКлиенте
Процедура Док_ЗаполнитьОстаткамиНаСкладеПосле(Команда)
	
	Если Не ЭтоТорговыйСклад(Объект.СкладОтправитель) Тогда
		ЗаполнитьОстаткамиПоСкладу(Объект.СкладОтправитель);
	Конецесли; 
	
КонецПроцедуры

&НаСервере
Функция ЭтоТорговыйСклад(ТекСклад)
	Возврат ТекСклад.СкладПродажи
КонецФункции 

&НаКлиенте
Процедура Док_СкладОтправительПриИзмененииПосле(Элемент)
	
	ВидимостьКнопкиЗаполненияОстатками(Объект.СкладОтправитель);
	ИнициализацияДляСкладовПодрядчика();

КонецПроцедуры

&НаСервере
Процедура ВидимостьКнопкиЗаполненияОстатками(Склад) 
	
	Если Не Склад.Пустая() Тогда
    	Элементы.ТоварыЗаполнитьОстаткамиНаСкладе.Доступность = НЕ ЭтоТорговыйСклад(Склад)
  	Иначе
   	 	Элементы.ТоварыЗаполнитьОстаткамиНаСкладе.Доступность = Ложь
	Конецесли	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиПоСкладу(Склад)

	Результат = АльтерраОбщегоНазначения.ПолучитьОстаткиПоСкладу(Склад);
		
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("На данном складе нет доступных остатков");
	Иначе
		Объект.Товары.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_СкладПолучательПриИзмененииПосле(Элемент)
	ИнициализацияДляСкладовПодрядчика();
КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СФП_МаркерыКлиент.МаркерНачало("Заказ на перемещение: Проведение из формы");
	КонецЕсли;
	Объект.СтатусОтображение = Объект.Статус;
КонецПроцедуры


#КонецОбласти
