
#Область НовоеЦенообразование

Функция ВидыЦенПоСоглашениюСКлиентом_НЦ(СоглашениеСКлиентом,Подразделение) экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыЦен.Ссылка КАК ВидЦен
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО СоглашениеШапка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	|ГДЕ
	|	СоглашениеШапка.Ссылка = &Соглашение
	|	И ВидыЦен.ФорматПодразделения = &ФорматПодразделения
	|	И ВидыЦен.РегионПрисутствия = &РегионПрисутствия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыЦен.Ссылка
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО Товары.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	|			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	|			И (ВидыЦен.РегионПрисутствия = &РегионПрисутствия)
	|ГДЕ
	|	Товары.Ссылка = &Соглашение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыЦен.Ссылка
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК ЦеновыеГруппыТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО ЦеновыеГруппыТоваров.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	|			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	|			И (ВидыЦен.РегионПрисутствия = &РегионПрисутствия)
	|ГДЕ
	|	ЦеновыеГруппыТоваров.Ссылка = &Соглашение";
	
	Запрос.УстановитьПараметр("Соглашение", СоглашениеСКлиентом);
	Запрос.УстановитьПараметр("ФорматПодразделения", Подразделение.ФорматПодразделения);
	Запрос.УстановитьПараметр("РегионПрисутствия", Подразделение.РегионПрисутствия);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЦен");
	
КонецФункции

Функция ПолучитьВидЦеныСоглашения(Соглашение,Подразделение) экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ВидыЦен.Ссылка КАК ВидЦен
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО СоглашениеШапка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	|ГДЕ
	|	СоглашениеШапка.Ссылка = &Соглашение
	|	И ВидыЦен.ФорматПодразделения = &ФорматПодразделения
	|	И ВидыЦен.РегионПрисутствия = &РегионПрисутствия";
	
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("ФорматПодразделения", Подразделение.ФорматПодразделения);
	Запрос.УстановитьПараметр("РегионПрисутствия", Подразделение.РегионПрисутствия); 
	РезультатЗапроса=Запрос.Выполнить();
	Выборка=РезультатЗапроса.Выбрать();
	если Выборка.Следующий() тогда
		возврат Выборка.Видцен;
	иначе
		возврат Справочники.ВидыЦен.ПустаяСсылка();
	конецесли;	
	
КонецФункции

Функция ПолучитьВидЦеныСоглашенияСПоставщиком(Соглашение,Подразделение,Владелец)экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ВидыЦенПоставщиков.Ссылка КАК ВидЦен
	|ИЗ
	|	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
	|		ПО ВидыЦенПоставщиков.ГруппаВидовЦен = СоглашенияСПоставщиками.ГруппаВидовЦен
	|ГДЕ
	|	СоглашенияСПоставщиками.Ссылка = &Соглашение
	|	И ВидыЦенПоставщиков.ФорматПодразделения = &ФорматПодразделения
	|	И ВидыЦенПоставщиков.РегионПрисутствия = &РегионПрисутствия
	|	И ВидыЦенПоставщиков.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("ФорматПодразделения", Подразделение.ФорматПодразделения);
	Запрос.УстановитьПараметр("РегионПрисутствия", Подразделение.РегионПрисутствия); 
	РезультатЗапроса=Запрос.Выполнить();
	Выборка=РезультатЗапроса.Выбрать();
	если Выборка.Следующий() тогда
		возврат Выборка.Видцен;
	иначе
		возврат Справочники.ВидыЦен.ПустаяСсылка();
	конецесли;	
	
	
КонецФункции // ()

Функция ТекстЗапросаЦенаПродажиТовара_НЦ(СоставРазделовЗапроса) Экспорт
	
	Если СоставРазделовЗапроса = Неопределено Тогда
		СоставРазделовЗапроса = Новый Массив;
	КонецЕсли;
	
	СоставРазделовЗапроса.Добавить("ЦенаПродажиТовара");
	
	Текст = 
	"ВЫБРАТЬ
	|	&ПолеВидаЦен КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|			ТОГДА 1
	|		КОГДА СоглашениеТовары.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|				И СоглашениеТовары.ГруппаВидовЦен ЕСТЬ НЕ NULL 
	|			ТОГДА 2
	|		КОГДА (СоглашениеТовары.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ГруппаВидовЦен ЕСТЬ NULL)
	|				И СоглашениеЦеновыеГруппы.ГруппаВидовЦен ЕСТЬ НЕ NULL 
	|				И СоглашениеЦеновыеГруппы.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|			ТОГДА 3
	|		КОГДА (СоглашениеТовары.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ГруппаВидовЦен ЕСТЬ NULL)
	|				И (СоглашениеЦеновыеГруппы.ГруппаВидовЦен ЕСТЬ NULL
	|					ИЛИ СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка))
	|				И СоглашениеШапка.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|			ТОГДА 4
	|	КОНЕЦ КАК Описание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|			ТОГДА СоглашениеТовары.Упаковка
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|	КОНЕЦ КАК Упаковка,
	|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК Коэффициент,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|				ТОГДА СоглашениеТовары.Цена
	|			КОГДА &ПолеВидаЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					И ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) > 0
	|				ТОГДА ЦеныНоменклатуры.Цена * ВЫБОР
	|						КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
	|										ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.СрокПоставки, 0) > 0
	|			ТОГДА СоглашениеТовары.СрокПоставки
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(СоглашениеЦеновыеГруппы.СрокПоставки, 0) > 0
	|					ТОГДА СоглашениеЦеновыеГруппы.СрокПоставки
	|				ИНАЧЕ СоглашениеШапка.СрокПоставки
	|			КОНЕЦ
	|	КОНЕЦ КАК СрокПоставки,
	|	ВидыЦенТовары.Ссылка КАК ВидЦеныТовары,
	|	ВидыЦенЦеновыеГруппы.Ссылка КАК ВидЦеныЦеновыеГруппы,
	|	ВидыЦен.Ссылка КАК ВидЦеныСоглашение
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенТовары
	|			ПО СоглашениеТовары.ГруппаВидовЦен = ВидыЦенТовары.ГруппаВидовЦен
	|				И (ВидыЦенТовары.ФорматПодразделения = &ФорматПодразделения)
	|				И (ВидыЦенТовары.РегионПрисутствия = &РегионПрисутствия)
	|		ПО (СоглашениеТовары.Ссылка = &Соглашение)
	|			И (СоглашениеТовары.Номенклатура = &Номенклатура)
	|			И (СоглашениеТовары.Характеристика = &Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Ссылка = &Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенЦеновыеГруппы
	|			ПО СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ВидыЦенЦеновыеГруппы.ГруппаВидовЦен
	|				И (ВидыЦенЦеновыеГруппы.ФорматПодразделения = &ФорматПодразделения)
	|				И (ВидыЦенЦеновыеГруппы.РегионПрисутствия = &РегионПрисутствия)
	|		ПО (СоглашениеЦеновыеГруппы.Ссылка = &Соглашение)
	|			И (СоглашениеЦеновыеГруппы.ЦеноваяГруппа = СправочникНоменклатура.ЦеноваяГруппа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&текущаяДата, ДЕНЬ),
	|				ВидЦены В (&ВидыЦен)
	|					И Номенклатура = &Номенклатура
	|					И Характеристика = &Характеристика) КАК ЦеныНоменклатуры
	|		ПО (ЦеныНоменклатуры.ВидЦены = &СвязьВидаЦен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|				,
	|				БазоваяВалюта В
	|					(ВЫБРАТЬ
	|						БазоваяВалютаПоУмолчанию.Значение
	|					ИЗ
	|						Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаЦены
	|		ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатуры.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|				,
	|				Валюта = &Валюта
	|					И БазоваяВалюта В
	|						(ВЫБРАТЬ
	|							БазоваяВалютаПоУмолчанию.Значение
	|						ИЗ
	|							Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаДокумента
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО СоглашениеШапка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	|			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	|			И (ВидыЦен.РегионПрисутствия = &РегионПрисутствия)
	|ГДЕ
	|	СоглашениеШапка.Ссылка = &Соглашение";
	
	Текст = СтрЗаменить(Текст,
	"&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныНоменклатуры.Упаковка",
	"ЦеныНоменклатуры.Номенклатура"));
	Текст = СтрЗаменить(Текст,
	"&ПолеВидаЦен",
	ЦеныПредприятияЗаполнениеСервер.ПолеВидаЦены());
	Текст = СтрЗаменить(Текст,
	"&СвязьВидаЦен",
	ЦеныПредприятияЗаполнениеСервер.ПолеВидаЦены(2));
	
	Возврат Текст;
	
КонецФункции

&Вместо ("ШаблонТекстаЗапросаСпискаНоменклатурыПоПараметрамСоглашенияСПокупателем")
Функция Док_ШаблонТекстаЗапросаСпискаНоменклатурыПоПараметрамСоглашенияСПокупателем(Форма)
	
	ВариантРасчетаЦен = Форма.ВариантРасчетаЦен;
	// изменение Альтерра	
	Если Допмодуль.НовоеЦенообразование() и ВариантРасчетаЦен <> Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен и 
		ВариантРасчетаЦен<>Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.ВидЦенВШапке Тогда    		
		ШаблонТекстаЗапроса = КодАльтерра();    
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЦеныНоменклатуры.Упаковка",
		"ЦеныНоменклатуры.Номенклатура"));
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки3",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"СоглашениеТовары.Упаковка",
		"СоглашениеТовары.Номенклатура"));
		Возврат ШаблонТекстаЗапроса; 
	КонецЕсли;
	
	возврат ПродолжитьВызов(Форма);
	
КонецФункции

Функция КодАльтерра()
	Возврат 
	"ВЫБРАТЬ
	
	|	&СправочникНоменклатураОбщиеПоля,
	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА СоглашениеТовары.Упаковка
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|	КОНЕЦ КАК Упаковка,
	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВидыЦенТовары.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ВидыЦенТовары.Ссылка
	|		КОГДА ЕСТЬNULL(ВидыЦенЦеновыеГруппы.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ВидыЦенЦеновыеГруппы.Ссылка
	|		ИНАЧЕ ЕСТЬNULL(ВидыЦен.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|	КОНЕЦ КАК ВидЦены,
	
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВидыЦенТовары.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|							ТОГДА ВидыЦенТовары.Ссылка
	|						КОГДА ЕСТЬNULL(ВидыЦенЦеновыеГруппы.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|							ТОГДА ВидыЦенЦеновыеГруппы.Ссылка
	|						ИНАЧЕ ЕСТЬNULL(ВидыЦен.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|					КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					И ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) > 0
	|				ТОГДА ЦеныНоменклатуры.Цена * ВЫБОР
	|						КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
	|										ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
	
	|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии / 
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
	|		ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1)
	|	КОНЕЦ КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
	
	|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
	
	|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно /ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
	|		ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1)
	|	КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Доступно
	
	|ИЗ
	
	|	&СправочникНоменклатура1
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|			ПО СоглашениеШапка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	|				И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	|				И (ВидыЦен.РегионПрисутствия = &РегионПрисутствия)
	|		ПО (СоглашениеШапка.Ссылка = &Соглашение)
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенТовары
	|			ПО СоглашениеТовары.ГруппаВидовЦен = ВидыЦенТовары.ГруппаВидовЦен
	|				И (ВидыЦенТовары.ФорматПодразделения = &ФорматПодразделения)
	|				И (ВидыЦенТовары.РегионПрисутствия = &РегионПрисутствия)
	|		ПО (СоглашениеТовары.Ссылка = &Соглашение)
	|			И СправочникНоменклатура.Ссылка = СоглашениеТовары.Номенклатура
	|			И (СоглашениеТовары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенЦеновыеГруппы
	|			ПО СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ВидыЦенЦеновыеГруппы.ГруппаВидовЦен
	|				И (ВидыЦенЦеновыеГруппы.ФорматПодразделения = &ФорматПодразделения)
	|				И (ВидыЦенЦеновыеГруппы.РегионПрисутствия = &РегионПрисутствия)
	|		ПО (СоглашениеЦеновыеГруппы.Ссылка = &Соглашение)
	|			И СправочникНоменклатура.ЦеноваяГруппа = СоглашениеЦеновыеГруппы.ЦеноваяГруппа
	
	|	СОЕДИНЕНИЕ &ЦеныНоменклатуры ПО ИСТИНА
	|			И (ЦеныНоменклатуры.ВидЦены = ВЫБОР
	|				КОГДА ЕСТЬNULL(ВидыЦенТовары.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					ТОГДА ВидыЦенТовары.Ссылка
	|				КОГДА ЕСТЬNULL(ВидыЦенЦеновыеГруппы.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					ТОГДА ВидыЦенЦеновыеГруппы.Ссылка.Ссылка
	|				ИНАЧЕ ЕСТЬNULL(ВидыЦен.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|			КОНЕЦ)
	
	|	СОЕДИНЕНИЕ &КурсВалютыЦены ПО ИСТИНА
	|	СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА
	|	СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА
	
	|ГДЕ
	
	|	&ОтборНоменклатурыПоГруппе
	|	И &ОтборНоменклатурыПоСегменту
	
	|";
КонецФункции

&ИзменениеИКонтроль("ПодстрокаЗаменыПараметраШаблонаТекстаЗапроса")
Функция Док_ПодстрокаЗаменыПараметраШаблонаТекстаЗапроса(ПодстрокаПоиска, ПараметрыЗамены)
	
	ТипСписка = ПараметрыЗамены.ТипСписка;
	НесколькоСкладов = ПараметрыЗамены.НесколькоСкладов;
	НесколькоВидовЦен = ПараметрыЗамены.НесколькоВидовЦен;
	ЕстьЦеныВБудущем = ПараметрыЗамены.ЕстьЦеныВБудущем;
	ИспользоватьХарактеристикиНоменклатуры = ПараметрыЗамены.ИспользоватьХарактеристикиНоменклатуры;
	ОтображатьОстаткиПоНазначению = ПараметрыЗамены.ОтображатьОстаткиПоНазначению;
	РежимПодбораБезСуммовыхПараметров = ПараметрыЗамены.РежимПодбораБезСуммовыхПараметров;
	ОтображатьОстаткиНаСкладах = ПараметрыЗамены.ОтображатьОстаткиНаСкладах;
	ЕстьЦеныНоменклатурыПоставщиковВБудущем = ПараметрыЗамены.ЕстьЦеныНоменклатурыПоставщиковВБудущем;
	ИспользоватьКомплекты = ПараметрыЗамены.ИспользоватьКомплекты;
	ИспользуетсяЦенообразование25 = ПараметрыЗамены.ИспользуетсяЦенообразование25;
	НеИспользоватьВидыЦенПоУсловиюПродаж = ПараметрыЗамены.НеИспользоватьВидыЦенПоУсловиюПродаж;
	
	Если ПодстрокаПоиска = "&СправочникНоменклатура1" Тогда
		
		Если ИспользоватьКомплекты Тогда
			ПодстрокаЗамены = "
			|	Справочник.Номенклатура КАК СправочникНоменклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
			|		ПО ВариантыКомплектацииНоменклатуры.Владелец = СправочникНоменклатура.Ссылка
			|		И ВариантыКомплектацииНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		И ВариантыКомплектацииНоменклатуры.Основной
			|";
		Иначе
			ПодстрокаЗамены = "
			|	Справочник.Номенклатура КАК СправочникНоменклатура";
		КонецЕсли;
		
	ИначеЕсли ПодстрокаПоиска = "&СправочникХарактеристики1" Тогда
		
		Если ИспользоватьКомплекты Тогда
			ПодстрокаЗамены = "
			|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
			|		ПО ВариантыКомплектацииНоменклатуры.Владелец = &Номенклатура
			|		И ВариантыКомплектацииНоменклатуры.Характеристика = ХарактеристикиНоменклатуры.Ссылка
			|		И ВариантыКомплектацииНоменклатуры.Основной
			|";
		Иначе
			ПодстрокаЗамены = "
			|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры";
		КонецЕсли;
		
	ИначеЕсли ПодстрокаПоиска = "&СправочникНоменклатураКонтрагентов1" Тогда
		
		ПодстрокаЗамены = "
		|	Справочник.НоменклатураКонтрагентов КАК СправочникНоменклатураКонтрагентов
		|";
		
	ИначеЕсли ПодстрокаПоиска = "&СправочникНоменклатураОбщиеПоля," Тогда
		
		ПодстрокаЗамены = "
		|	СправочникНоменклатура.Ссылка КАК Ссылка,
		|	СправочникНоменклатура.Артикул КАК Артикул,
		|	СправочникНоменклатура.Код КАК Код,
		|	СправочникНоменклатура.Наименование КАК Наименование,
		|	СправочникНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникНоменклатура.Родитель КАК Родитель,
		|	СправочникНоменклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	СправочникНоменклатура.Ссылка КАК Номенклатура,
		|	СправочникНоменклатура.Ссылка КАК ЭлементСписка,
		|	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	
		|	ВЫБОР КОГДА СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) ТОГДА
		|		ЕСТЬNULL(&ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка))
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
		|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
		|	&НаборСодержитТовары КАК СодержитТовары,
		|	&НаборСодержитУслуги КАК СодержитУслуги,
		|	
		|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СправочникНоменклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	СправочникНоменклатура.Качество КАК Качество,
		|	СправочникНоменклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|			ТОГДА ИСТИНА
		|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)) И ЕСТЬNULL(&НаборСодержитТовары, ЛОЖЬ) И Не ЕСТЬNULL(&НаборСодержитУслуги, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТовар,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|			ТОГДА ИСТИНА
		|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)) И ЕСТЬNULL(&НаборСодержитУслуги, ЛОЖЬ) И НЕ ЕСТЬNULL(&НаборСодержитТовары, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУслуга,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
		|			ТОГДА СправочникНоменклатура.ВидНоменклатуры
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
		|			ТОГДА СправочникНоменклатура.Ссылка
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
		|			ТОГДА СправочникНоменклатура.ВладелецХарактеристик
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ КАК ВладелецХарактеристик,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикиИспользуются,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ЭтоГруппа
		|			ТОГДА ВЫБОР
		|					КОГДА СправочникНоменклатура.ПометкаУдаления
		|						ТОГДА 13
		|					ИНАЧЕ 12
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СправочникНоменклатура.ЕстьТоварыДругогоКачества
		|					ТОГДА 4 + ВЫБОР
		|							КОГДА СправочникНоменклатура.ПометкаУдаления
		|								ТОГДА 1
		|							ИНАЧЕ 0
		|						КОНЕЦ + ВЫБОР
		|							КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|								ТОГДА 0
		|							ИНАЧЕ 2
		|						КОНЕЦ
		|				ИНАЧЕ -1 + ВЫБОР
		|						КОГДА СправочникНоменклатура.ПометкаУдаления
		|							ТОГДА 1
		|						ИНАЧЕ 0
		|					КОНЕЦ + ВЫБОР
		|						КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|							ТОГДА 1
		|						ИНАЧЕ 3
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ИндексКартинки,
		|";
		
	ИначеЕсли ПодстрокаПоиска = "&СправочникХарактеристикиОбщиеПоля," Тогда
		
		Если ИспользуетсяЦенообразование25 Тогда
			ПодстрокаЗамены = "
			|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
			|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
			|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
			|	ИСТИНА КАК ХарактеристикиИспользуются,
			|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(&ТипНоменклатуры КАК Перечисление.ТипыНоменклатуры) КАК ТипНоменклатуры,
			|	
			|	ВЫБОР
			|		КОГДА ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры).НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
			|		ИНАЧЕ ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования
			|	КОНЕЦ КАК ХарактеристикаЦО,
			|	
			|	ВЫБОР КОГДА &ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) ТОГДА
			|		ЕСТЬNULL(&ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка))
			|	ИНАЧЕ
			|		ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
			|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
			|	&НаборСодержитТовары КАК СодержитТовары,
			|	&НаборСодержитУслуги КАК СодержитУслуги,
			|	
			|	ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры) КАК ВидНоменклатуры,
			|	ВЫРАЗИТЬ(&ЕдиницаИзмерения КАК Справочник.УпаковкиЕдиницыИзмерения) КАК ЕдиницаИзмерения,
			|	&ВладелецХарактеристик,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатуры.ПометкаУдаления
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИндексКартинки,
			|";
		Иначе
			ПодстрокаЗамены = "
			|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
			|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
			|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
			|	ИСТИНА КАК ХарактеристикиИспользуются,
			|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(&ТипНоменклатуры КАК Перечисление.ТипыНоменклатуры) КАК ТипНоменклатуры,
			|	
			|	ВЫБОР КОГДА &ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) ТОГДА
			|		ЕСТЬNULL(&ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка))
			|	ИНАЧЕ
			|		ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
			|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
			|	&НаборСодержитТовары КАК СодержитТовары,
			|	&НаборСодержитУслуги КАК СодержитУслуги,
			|	
			|	ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры) КАК ВидНоменклатуры,
			|	ВЫРАЗИТЬ(&ЕдиницаИзмерения КАК Справочник.УпаковкиЕдиницыИзмерения) КАК ЕдиницаИзмерения,
			|	&ВладелецХарактеристик,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатуры.ПометкаУдаления
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИндексКартинки,
			|";
		КонецЕсли;
	ИначеЕсли ПодстрокаПоиска = "&СправочникНоменклатураКонтрагентовОбщиеПоля," Тогда
		
		ПодстрокаЗамены = "
		|	СправочникНоменклатураКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникНоменклатураКонтрагентов.Предопределенный КАК Предопределенный,
		|	СправочникНоменклатураКонтрагентов.Владелец КАК Владелец,
		|	СправочникНоменклатураКонтрагентов.Родитель КАК Родитель,
		|	СправочникНоменклатураКонтрагентов.ЭтоГруппа КАК ЭтоГруппа,
		|	СправочникНоменклатураКонтрагентов.Наименование КАК Наименование,
		|	СправочникНоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
		|	СправочникНоменклатураКонтрагентов.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	СправочникНоменклатураКонтрагентов.Номенклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
		|	СправочникНоменклатураКонтрагентов.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	СправочникНоменклатураКонтрагентов.Характеристика КАК Характеристика,
		|	НоменклатураСпр.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА НоменклатураСпр.ЕдиницаИзмерения ЕСТЬ NULL
		|			ТОГДА СправочникНоменклатураКонтрагентов.Упаковка
		|		ИНАЧЕ ВЫБОР
		|			КОГДА НоменклатураСпр.ЕдиницаИзмерения = СправочникНоменклатураКонтрагентов.Упаковка
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ИНАЧЕ СправочникНоменклатураКонтрагентов.Упаковка
		|		КОНЕЦ
		|	КОНЕЦ КАК Упаковка,
		|	СправочникНоменклатураКонтрагентов.Артикул КАК Артикул,
		|	СправочникНоменклатураКонтрагентов.Код КАК Код,
		|	СправочникНоменклатураКонтрагентов.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатураКонтрагентов.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикиИспользуются,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатураКонтрагентов.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТовар,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатураКонтрагентов.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУслуга,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатураКонтрагентов.ЭтоГруппа
		|			ТОГДА ВЫБОР
		|					КОГДА СправочникНоменклатураКонтрагентов.ПометкаУдаления
		|						ТОГДА 13
		|					ИНАЧЕ 12
		|				КОНЕЦ
		|	КОНЕЦ КАК ИндексКартинки,
		|";
		
	ИначеЕсли ПодстрокаПоиска = "&ОтборНоменклатурыПоГруппе" Тогда
		
		ПодстрокаЗамены = "
		|	НЕ СправочникНоменклатура.ЭтоГруппа
		|";
		
	ИначеЕсли ПодстрокаПоиска = "&ОтборНоменклатурыКонтрагентовПоГруппе" Тогда
		
		ПодстрокаЗамены = "
		|	НЕ СправочникНоменклатураКонтрагентов.ЭтоГруппа
		|";
	
	ИначеЕсли ПодстрокаПоиска = "&ЦеныНоменклатурыПоставщиковСрезПоследнихНаДату" Тогда
		
		ПодстрокаЗамены = ?(ЕстьЦеныНоменклатурыПоставщиковВБудущем, "&Дата", "");
		
	ИначеЕсли ПодстрокаПоиска = "И &ОтборНоменклатурыПоЦене1" Тогда
		
		Если Не РежимПодбораБезСуммовыхПараметров Тогда
			ПодстрокаЗамены = "
			|	И (ВЫБОР
			|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|		КОНЕЦ ИЛИ ВЫБОР
			|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
			|			ТОГДА СоглашениеТовары.Цена * ВЫБОР
			|					КОГДА &Валюта <> СоглашениеТовары.Ссылка.Валюта
			|						ТОГДА ВЫБОР
			|								КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.КурсЗнаменатель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.КурсЧислитель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
			|									ТОГДА КурсыСрезПоследнихВалютаСоглашения.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаСоглашения.КурсЗнаменатель)
			|								ИНАЧЕ 0
			|							КОНЕЦ
			|					ИНАЧЕ 1
			|				КОНЕЦ
			|		КОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
			|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|					КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|							И СоглашениеТовары.ВидЦены ЕСТЬ Не NULL 
			|						ТОГДА СоглашениеТовары.ВидЦены
			|					КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|							Или СоглашениеТовары.ВидЦены ЕСТЬ NULL )
			|							И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ Не NULL 
			|							И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|						ТОГДА СоглашениеЦеновыеГруппы.ВидЦен
			|					КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|							Или СоглашениеТовары.ВидЦены ЕСТЬ NULL )
			|							И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL 
			|								Или СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
			|							И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|						ТОГДА СоглашениеШапка.ВидЦен
			|				КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|				И ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) > 0
			|			ТОГДА ЦеныНоменклатуры.Цена * ВЫБОР
			|					КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
			|						ТОГДА ВЫБОР
			|								КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
			|									ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
			|								ИНАЧЕ 0
			|							КОНЕЦ
			|					ИНАЧЕ 1
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ <> 0 ИЛИ &ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих))
			|";
		Иначе
			ПодстрокаЗамены = "";
		КонецЕсли;
			
	ИначеЕсли ПодстрокаПоиска = "И &ОтборНоменклатурыПоЦене25" Тогда
		
		Если Не РежимПодбораБезСуммовыхПараметров Тогда
			ПодстрокаЗамены = "
			|	И (ВЫБОР
			|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|		КОНЕЦ ИЛИ ВЫБОР
			|			КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
			|				ТОГДА ИндивидуальныеЦеныНоменклатуры.Цена * ВЫБОР
			|						КОГДА &Валюта <> ИндивидуальныеЦеныНоменклатуры.Валюта
			|							ТОГДА ВЫБОР
			|									КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЗнаменатель, 0) > 0
			|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЧислитель, 0) > 0
			|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
			|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
			|										ТОГДА КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЗнаменатель)
			|									ИНАЧЕ 0
			|								КОНЕЦ
			|						ИНАЧЕ 1
			|					КОНЕЦ
			|			ИНАЧЕ ЦеныНоменклатуры.Цена * ВЫБОР
			|				КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
			|					ТОГДА ВЫБОР
			|							КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
			|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
			|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
			|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
			|								ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|					ИНАЧЕ 1
			|				КОНЕЦ
			|			КОНЕЦ <> 0 ИЛИ &ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих))
			|";
			
		Иначе
			ПодстрокаЗамены = "";
		КонецЕсли;
		
	ИначеЕсли ПодстрокаПоиска = "&ВариантРасчетаЦеныНабора" Тогда
		
		ПодстрокаЗамены = ?(ИспользоватьКомплекты,
			"ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора",
			"ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)");
		
	ИначеЕсли ПодстрокаПоиска = "&НаборСодержитТовары" Тогда
		
		ПодстрокаЗамены = ?(ИспользоватьКомплекты,
			"ВариантыКомплектацииНоменклатуры.СодержитТовары",
			"Ложь");
		
	ИначеЕсли ПодстрокаПоиска = "&НаборСодержитУслуги" Тогда
		
		ПодстрокаЗамены = ?(ИспользоватьКомплекты,
			"ВариантыКомплектацииНоменклатуры.СодержитУслуги",
			"Ложь");
		
	ИначеЕсли ПодстрокаПоиска = "И &ОтборНоменклатурыПоСегменту" Тогда
		
		ПодстрокаЗамены = "
		|{ГДЕ
		|	(1 В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			1
		|		ИЗ
		|			РегистрСведений.НоменклатураСегмента КАК Сегменты
		|		ГДЕ
		|			Сегменты.Номенклатура = СправочникНоменклатура.Ссылка
		|			И Сегменты.Сегмент = &СегментНоменклатуры))}
		|";
		
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА" Тогда
		
		ПодстрокаЗамены = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(, Валюта = &Валюта
		|				И БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаДокумента
		|	ПО (ИСТИНА)
		|";
		
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &КурсВалютыСоглашения ПО ИСТИНА" Тогда
		
		ПодстрокаЗамены = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(,
		|				БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаСоглашения
		|	ПО (КурсыСрезПоследнихВалютаСоглашения.Валюта = СоглашениеТовары.Ссылка.Валюта)
		|";
		
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &КурсВалютыЦены ПО ИСТИНА" Тогда
		
		ПодстрокаЗамены = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(,
		|				БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаЦены
		|	ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатуры.Валюта)
		|";
		
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &КурсВалютыИндивидуальныеЦены ПО ИСТИНА" Тогда
		
		ПодстрокаЗамены = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(,
		|				БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаИндивидуальныеЦены
		|	ПО (КурсыСрезПоследнихВалютаИндивидуальныеЦены.Валюта = ИндивидуальныеЦеныНоменклатуры.Валюта)
		|";
		
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &ИндивидуальныеЦеныНоменклатуры ПО ИСТИНА" Тогда
		
		Если ТипСписка = "СписокНоменклатура" Тогда
			
			ПодстрокаЗамены = "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
			|			{УсловиеОтбораПоДате},
			|			{УсловиеОтбораПоВидуЦен}
			|				И ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
			|			{(Номенклатура).* КАК Номенклатура}
			|		) КАК ИндивидуальныеЦеныНоменклатуры
			|	ПО (ИндивидуальныеЦеныНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка)
			|		И (ИндивидуальныеЦеныНоменклатуры.ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
			|		И (ИндивидуальныеЦеныНоменклатуры.СерияЦО = ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
			|		И (ИндивидуальныеЦеныНоменклатуры.УпаковкаЦО = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))";
			
		ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда
			
			ПодстрокаЗамены = "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
			|			{УсловиеОтбораПоДате},
			|			{УсловиеОтбораПоВидуЦен}
			|				И Номенклатура = &Номенклатура
			|			{(ХарактеристикаЦО).* КАК ХарактеристикаЦО}
			|		) КАК ИндивидуальныеЦеныНоменклатуры
			|	ПО (ИндивидуальныеЦеныНоменклатуры.Номенклатура = &Номенклатура)
			|		И (ИндивидуальныеЦеныНоменклатуры.ХарактеристикаЦО = ВЫБОР
			|			КОГДА ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры).НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
			|				ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
			|			ИНАЧЕ ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования
			|		КОНЕЦ)
			|		И (ИндивидуальныеЦеныНоменклатуры.СерияЦО = ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
			|		И (ИндивидуальныеЦеныНоменклатуры.УпаковкаЦО = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
			|";
			
		КонецЕсли;
		
		УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "КОНЕЦПЕРИОДА(&Дата, День)", ""); 
		
		#Вставка
		Год = Формат(Год(ТекущаяДата()),"ЧГ=0");
		Месяц = Месяц(ТекущаяДата());
		День = День(ТекущаяДата());
		УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "ДАТАВРЕМЯ(" + год + "," + Месяц + "," +  День + ")", ""); 
		#КонецВставки
		УсловиеОтбораПоВидуЦен = "ВидЦены = &ВидЦенИндивидуальный";
		
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоДате}", УсловиеОтбораПоДате);
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоВидуЦен}", УсловиеОтбораПоВидуЦен);
			 
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &ЦеныНоменклатуры ПО ИСТИНА" Тогда
		
		Если ИспользуетсяЦенообразование25 Тогда
			
			Если ТипСписка = "СписокНоменклатура" Тогда
				
				ПодстрокаЗамены = "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
				|			{УсловиеОтбораПоДате},
				|			{УсловиеОтбораПоВидуЦен}
				|				И ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
				|			{(Номенклатура).* КАК Номенклатура}
				|		) КАК ЦеныНоменклатуры
				|	ПО (ЦеныНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка)
				|		И (ЦеныНоменклатуры.ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
				|		И (ЦеныНоменклатуры.СерияЦО = ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
				|		И (ЦеныНоменклатуры.УпаковкаЦО = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))";
				
			ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда
				
				ПодстрокаЗамены = "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
				|			{УсловиеОтбораПоДате},
				|			{УсловиеОтбораПоВидуЦен}
				|				И Номенклатура = &Номенклатура
				|			{(ХарактеристикаЦО).* КАК ХарактеристикаЦО}
				|		) КАК ЦеныНоменклатуры
				|	ПО (ЦеныНоменклатуры.Номенклатура = &Номенклатура)
				|		И (ЦеныНоменклатуры.ХарактеристикаЦО = ВЫБОР
				|			КОГДА ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры).НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
				|				ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
				|			ИНАЧЕ ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования
				|		КОНЕЦ)
				|		И (ЦеныНоменклатуры.СерияЦО = ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
				|		И (ЦеныНоменклатуры.УпаковкаЦО = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
				|";
				
			КонецЕсли;
			
			УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "КОНЕЦПЕРИОДА(&Дата, День)", ""); 	
			#Вставка
			Год = Формат(Год(ТекущаяДата()),"ЧГ=0");
			Месяц = Месяц(ТекущаяДата());
			День = День(ТекущаяДата());
			УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "ДАТАВРЕМЯ(" + год + "," + Месяц + "," +  День + ")", "");  
			#КонецВставки

			Если НеИспользоватьВидыЦенПоУсловиюПродаж Тогда
				УсловиеОтбораПоВидуЦен = ?(НесколькоВидовЦен, "ВидЦены В (&ВидыЦен)", "ВидЦены = &ВидыЦен");
			Иначе
				УсловиеОтбораПоВидуЦен = "ВидЦены = &ВидЦенОсновной";
			КонецЕсли;
			
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоДате}", УсловиеОтбораПоДате);
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоВидуЦен}", УсловиеОтбораПоВидуЦен);
			
		Иначе
			
			Если ТипСписка = "СписокНоменклатура" Тогда
				
				ПодстрокаЗамены = "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|			{УсловиеОтбораПоДате},
				|			{УсловиеОтбораПоВидуЦен}
				|				И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|			{(Номенклатура).* КАК Номенклатура}
				|		) КАК ЦеныНоменклатуры
				|	ПО (ЦеныНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка)
				|		И (ЦеныНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))";
				
			ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда
				
				ПодстрокаЗамены = "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|			{УсловиеОтбораПоДате},
				|			{УсловиеОтбораПоВидуЦен}
				|				И Номенклатура = &Номенклатура
				|			{(Характеристика).* КАК Характеристика}
				|		) КАК ЦеныНоменклатуры
				|	ПО (ЦеныНоменклатуры.Номенклатура = &Номенклатура)
				|		И (ЦеныНоменклатуры.Характеристика = ХарактеристикиНоменклатуры.Ссылка)
				|";
				
			КонецЕсли;
			 
			УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "КОНЕЦПЕРИОДА(&Дата, День)", "");  
			#Вставка
			Год = Формат(Год(ТекущаяДата()),"ЧГ=0");
			Месяц = Месяц(ТекущаяДата());
			День = День(ТекущаяДата());
			УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "ДАТАВРЕМЯ(" + год + "," + Месяц + "," +  День + ")", "");
			#КонецВставки
			УсловиеОтбораПоВидуЦен = ?(НесколькоВидовЦен, "ВидЦены В (&ВидыЦен)", "ВидЦены = &ВидыЦен");
			
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоДате}", УсловиеОтбораПоДате);
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоВидуЦен}", УсловиеОтбораПоВидуЦен);
		КонецЕсли;
		
		
	ИначеЕсли ПодстрокаПоиска = "&ОтборХарактеристикПоВладельцу" Тогда
		
		ПодстрокаЗамены = "
		|	ХарактеристикиНоменклатуры.Владелец = &ВладелецХарактеристик
		|";
		
	ИначеЕсли ПодстрокаПоиска = "И &ОтборХарактеристикПоСегменту" Тогда
		
		ПодстрокаЗамены = "
		|{ГДЕ
		|	(1 В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			1
		|		ИЗ
		|			РегистрСведений.НоменклатураСегмента КАК Сегменты
		|		ГДЕ
		|			Сегменты.Характеристика = ХарактеристикиНоменклатуры.Ссылка
		|			И Сегменты.Номенклатура = &НоменклатураСегмента
		|			И Сегменты.Сегмент = &СегментНоменклатуры))}
		|";
		
	ИначеЕсли ПодстрокаПоиска = "&ВсеОстаткиВНаличии" Тогда
		
		Если Не ОтображатьОстаткиНаСкладах Тогда
			ПодстрокаЗамены = "0";
		Иначе
			
			Если ОтображатьОстаткиПоНазначению Тогда
				ПодстрокаЗамены = "ЕСТЬNULL(ВсеОстатки.Запас, 0)";
			Иначе
				ПодстрокаЗамены = "ЕСТЬNULL(ВсеОстатки.ВНаличии, 0)";
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ПодстрокаПоиска = "&ВсеОстаткиДоступно" Тогда
		
		Если Не ОтображатьОстаткиНаСкладах Тогда
			ПодстрокаЗамены = "0";
		Иначе
			
			ПодстрокаЗамены = "ЕСТЬNULL(ВсеОстатки.Свободно, 0)";
			
		КонецЕсли;
		
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА" Тогда
		
		Если Не ОтображатьОстаткиНаСкладах Тогда
			ПодстрокаЗамены = "
			|";
		Иначе
			
			Если НесколькоСкладов Тогда
				
				Если ТипСписка = "СписокНоменклатура" Или ТипСписка = "СписокНоменклатураПартнера" Тогда
					
					ПодстрокаЗамены = "
					|	ЛЕВОЕ СОЕДИНЕНИЕ(
					|		ВЫБРАТЬ
					|			РаспределениеЗапасов.Номенклатура    КАК Номенклатура,
					|			СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
					|			СУММА(РаспределениеЗапасов.Запас)    КАК Запас,
					|			СУММА(РаспределениеЗапасов.Свободно) КАК Свободно
					|		ИЗ
					|			РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
					|		ГДЕ
					|			РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
					|			И РаспределениеЗапасов.Назначение = &Назначение
					|			И РаспределениеЗапасов.Склад В(&Склад)
					|		СГРУППИРОВАТЬ ПО
					|			РаспределениеЗапасов.Номенклатура
					|	) КАК ВсеОстатки
					|	ПО 
					|		(ВсеОстатки.Номенклатура = СправочникНоменклатура.Ссылка)
					|";
					
				ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда
					
					ПодстрокаЗамены = "
					|	ЛЕВОЕ СОЕДИНЕНИЕ(
					|		ВЫБРАТЬ
					|			РаспределениеЗапасов.Характеристика  КАК Характеристика,
					|			СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
					|			СУММА(РаспределениеЗапасов.Запас)    КАК Запас,
					|			СУММА(РаспределениеЗапасов.Свободно) КАК Свободно
					|		ИЗ
					|			РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
					|		ГДЕ
					|			РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
					|			И РаспределениеЗапасов.Назначение = &Назначение
					|			И РаспределениеЗапасов.Склад В(&Склад)
					|			И РаспределениеЗапасов.Номенклатура = &Номенклатура
					|		СГРУППИРОВАТЬ ПО
					|			РаспределениеЗапасов.Характеристика
					|	) КАК ВсеОстатки
					|	ПО 
					|		(ВсеОстатки.Характеристика = ХарактеристикиНоменклатуры.Ссылка)
					|";
					
				КонецЕсли;
				
			Иначе
				
				Если ТипСписка = "СписокНоменклатура" Или ТипСписка = "СписокНоменклатураПартнера" Тогда
					
					Если ИспользоватьХарактеристикиНоменклатуры Тогда
						
						ПодстрокаЗамены = "
						|	ЛЕВОЕ СОЕДИНЕНИЕ(
						|		ВЫБРАТЬ
						|			РаспределениеЗапасов.Номенклатура    КАК Номенклатура,
						|			СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
						|			СУММА(РаспределениеЗапасов.Запас)    КАК Запас,
						|			СУММА(РаспределениеЗапасов.Свободно) КАК Свободно
						|		ИЗ
						|			РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
						|		ГДЕ
						|			РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
						|			И РаспределениеЗапасов.Назначение = &Назначение
						|			И РаспределениеЗапасов.Склад = &Склад

						|		СГРУППИРОВАТЬ ПО
						|			РаспределениеЗапасов.Номенклатура
						|	) КАК ВсеОстатки
						|	ПО 
						|		(ВсеОстатки.Номенклатура = СправочникНоменклатура.Ссылка)
						|";
						
					Иначе
						
						ПодстрокаЗамены = "
						|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ВсеОстатки
						|		ПО ВсеОстатки.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
						|		И ВсеОстатки.Назначение = &Назначение
						|		И ВсеОстатки.Склад = &Склад
						|		И ВсеОстатки.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
						|		И ВсеОстатки.Номенклатура = СправочникНоменклатура.Ссылка
						|";
						
					КонецЕсли;
					
				ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда
					
					ПодстрокаЗамены = "
						|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ВсеОстатки
						|		ПО ВсеОстатки.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
						|		И ВсеОстатки.Назначение = &Назначение
						|		И ВсеОстатки.Склад = &Склад
						|		И ВсеОстатки.Номенклатура = &Номенклатура
						|		И ВсеОстатки.Характеристика = ХарактеристикиНоменклатуры.Ссылка
						|";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстНазначение = ?(ОтображатьОстаткиПоНазначению, "&Назначение", "ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)");
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "&Назначение", ТекстНазначение);
		
	КонецЕсли;
	
	Возврат ПодстрокаЗамены;

КонецФункции

&ИзменениеИКонтроль("ПриСозданииФормыПодбораНаСервере")
Процедура Док_ПриСозданииФормыПодбораНаСервере1(Форма) 
	
	Параметры = Форма.Параметры;
	Элементы = Форма.Элементы;
	ЭтоФормаПодбораВДокументыПродажи = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыПродажи(Форма);
	ЭтоФормаПодбораВДокументыЗакупки = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыЗакупки(Форма);
	АвторизованВнешнийПользователь = ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь();
	
	#Область ПолучитьЗначенияФункциональныхОпций
	
	Форма.ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	Форма.ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	Форма.ИспользоватьСтандартныйПоискПриПодбореТоваров = Константы.ИспользоватьСтандартныйПоискПриПодбореТоваров.Получить();
	Форма.ИспользоватьПартнеровИКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов");
	
	Если ЭтоФормаПодбораВДокументыПродажи Тогда
		Если Параметры.Свойство("ИспользуетсяЦенообразование25") Тогда
			Форма.ИспользуетсяЦенообразование25 = Параметры.ИспользуетсяЦенообразование25;
		Иначе			
			Форма.ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(Параметры.Дата);
		КонецЕсли;
		Форма.ИспользоватьРучныеСкидкиВПродажах = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах")
		И НЕ АвторизованВнешнийПользователь;
		Форма.ИспользоватьНоменклатуруПродаваемуюСовместно = ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПродаваемуюСовместно");
		Если Не Форма.РежимПодбораБезСоглашенийСКлиентами	Тогда	
			Форма.ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		КонецЕсли;
		Если Не Форма.ИспользоватьСоглашенияСКлиентами Тогда
			ПараметрыВыбораВидаЦены = ЗначениеНастроекПовтИсп.ПараметрыВыбораВидаЦеныПоУмолчанию();
			ПараметрыВыбораВидаЦены.ЦенаВключаетНДС = Форма.Объект.ЦенаВключаетНДС;
			ПараметрыВыбораВидаЦены.ИспользоватьПриПродаже = Истина;
			ПараметрыВыбораВидаЦены.Статус = Перечисления.СтатусыДействияВидовЦен.Действует;
			
			ВидЦеныПоУмолчанию = ЗначениеНастроекПовтИсп.ВидЦеныПоУмолчанию(ПараметрыВыбораВидаЦены);
			Форма.ЕдинственныйВидЦенПродажи = Не ВидЦеныПоУмолчанию.Пустая();
		КонецЕсли;
	ИначеЕсли ЭтоФормаПодбораВДокументыЗакупки Тогда
		Форма.ИспользоватьРучныеСкидкиВЗакупках = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВЗакупках");
		Форма.ИспользоватьНоменклатуруПартнеров = ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПартнеров");
	КонецЕсли;
	#КонецОбласти
	
	
	#Область УстановитьСвойстваФормыПоПараметрам
	
	#Область УстановитьСкладскиеНастройкиПоПараметрам
	
	ПереданСписокСкладов = ТипЗнч(Параметры.Склад) = Тип("СписокЗначений");
	ЭтоГруппаСкладов = Не ПереданСписокСкладов И Справочники.Склады.ЭтоГруппа(Параметры.Склад);
	
	
	Если ЗначениеЗаполнено(Параметры.Склад)
		И ЭтоГруппаСкладов Тогда
		
		ЗапросПоСкладам = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Склады.Ссылка КАК Склад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка В ИЕРАРХИИ(&Склад)
		|	И Склады.ВыборГруппы В(&ВыборГруппыСкладов)
		|	И НЕ Склады.ЭтоГруппа");
		
		ВыборГруппыСкладов = Новый Массив();
		ВыборГруппыСкладов.Добавить(Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных);
		
		Если Не Параметры.РежимПодбораИсключитьГруппыДоступныеВЗаказах Тогда
			
			ВыборГруппыСкладов.Добавить(Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказах);
			
		КонецЕсли;
		
		
		ЗапросПоСкладам.УстановитьПараметр("Склад", Параметры.Склад);
		ЗапросПоСкладам.УстановитьПараметр("ВыборГруппыСкладов", ВыборГруппыСкладов);
		
		Форма.Склады.ЗагрузитьЗначения(ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад"));
		
	ИначеЕсли ПереданСписокСкладов Тогда
		
		Форма.Склады.ЗагрузитьЗначения(Параметры.Склад.ВыгрузитьЗначения());
		
	Иначе
		
		Если ЗначениеЗаполнено(Параметры.Склад) Тогда
			Форма.Склады.Добавить(Параметры.Склад);
		КонецЕсли;
		
	КонецЕсли;
	
	// Если склад не выбран, то заполнить список складов всеми разрешенными складами.
	Если Форма.Склады.Количество() = 0
		И Не ПереданСписокСкладов
		И Параметры.Свойство("ОстаткиПоВсемСкладам")
		И Параметры.ОстаткиПоВсемСкладам Тогда
		
		Форма.ОстаткиПоВсемСкладам = Истина;
		
		ЗапросПоСкладам = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Склады.Ссылка КАК Склад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	(Не Склады.ЭтоГруппа)");
		
		Форма.Склады.ЗагрузитьЗначения(ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад"));
		
	КонецЕсли;
	
	Если Форма.Склады.Количество() = 0 Тогда
		СкладПараметр = Справочники.Склады.ПустаяСсылка();
	ИначеЕсли Форма.Склады.Количество() = 1 Тогда
		СкладПараметр = Форма.Склады[0].Значение;
	Иначе
		СкладПараметр = Форма.Склады.ВыгрузитьЗначения();
	КонецЕсли;
	
	КоличествоСкладов = Форма.Склады.Количество();
	НесколькоСкладов = (КоличествоСкладов > 1);
	
	// Заполнить список выбора доступных складов в корзине.
	Элементы.КорзинаСклад.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.КорзинаСклад, "Ссылка", Форма.Склады.ВыгрузитьЗначения());
	Элементы.КорзинаСклад.Видимость = (НесколькоСкладов И Параметры.РежимПодбораИспользоватьСкладыВТабличнойЧасти);
	
	Если КоличествоСкладов = 0 Тогда
		
		Форма.ТолькоВНаличии = Ложь;
		Форма.ОтображатьОстатки = Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Склад) Тогда 
		
		Форма.ТолькоВНаличии = Ложь;
		
	КонецЕсли;
	
	Форма.ОтображатьОстаткиНадпись = ?(Форма.ОтображатьОстатки, 
	НСтр("ru = 'Подробная информация об остатках (скрыть)'"),
	НСтр("ru = 'Подробная информация об остатках (показать)'"));
	
	Элементы.КорзинаСклад.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.КорзинаСклад, "Ссылка", СкладПараметр);
	
	#КонецОбласти
	
	#Область УстановитьСвойстваФормыПодбораПоНалогообложениюНДС
	Если Параметры.Свойство("НалогообложениеНДС")
		И ЗначениеЗаполнено(Параметры.НалогообложениеНДС) Тогда
		Ограничения = УчетНДСУП.ОграничениеТоваровПоНалогообложению(Параметры.НалогообложениеНДС);
		Для Каждого Ограничение Из Ограничения Цикл
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокНоменклатура,
			"Номенклатура." + Ограничение.Реквизит,
			Ограничение.Значение,
			Ограничение.ВидСравнения,
			"ОтборПоУмолчанию",
			Истина);
			Если Ограничение.Реквизит = "ПодакцизныйТовар" Тогда
				Элементы.ДекорацияПодакцизныйТовар.Видимость = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#КонецОбласти
	
	Если ЭтоФормаПодбораВДокументыЗакупки Тогда
		
		#Область УстановитьСвойстваФормыПодбораВДокументыЗакупкиПоПараметрам
		
		ЗаполнитьЗначенияСвойств(Форма, Параметры,
		"Валюта, Дата, Соглашение, Партнер,
		|РежимПодбораИспользоватьСкладыВТабличнойЧасти,
		|ПроверятьЗаполнение");
		Форма.ПоставщикПартнер = Параметры.Партнер;
		
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Параметры, "ВидЦеныПоставщика") Тогда
			Форма.ВидЦеныПоставщика = Параметры.ВидЦеныПоставщика;
		КонецЕсли;
		
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Параметры, "ЦенаВключаетНДС") Тогда
			Форма.Объект.ЦенаВключаетНДС = Параметры.ЦенаВключаетНДС;
		КонецЕсли;
		
		Форма.ЕстьЦеныНоменклатурыПоставщиковВБудущем = ЕстьЗначенияЦенНоменклатурыПозжеДатыПодбора(Форма.Дата);
		
		Форма.Объект.Склад = Параметры.Склад;
		Если ЗначениеЗаполнено(Параметры.Соглашение) Тогда
			Форма.Объект.Соглашение = Параметры.Соглашение;
			Форма.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Соглашение, "Организация");
		КонецЕсли;
		Форма.Объект.Партнер = Параметры.Партнер;
		
		// Установить свойства элементов формы по переданным параметрам.
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.ИерархияНоменклатурыПартнера, "Владелец", Форма.ПоставщикПартнер);
		
		// Заполнить значения реквизитов формы и объекта по переданным параметрам.
		Элементы.КорзинаСклад.Видимость = Форма.РежимПодбораИспользоватьСкладыВТабличнойЧасти И (Форма.Склады.Количество() > 1);
		
		Если Не (Параметры.РежимПодбораБезКоличественныхПараметров = Неопределено) Тогда
			Форма.РежимПодбораБезКоличественныхПараметров = Параметры.РежимПодбораБезКоличественныхПараметров;
		КонецЕсли;
		
		Если Не (Параметры.РежимПодбораБезСуммовыхПараметров = Неопределено) Тогда
			Форма.РежимПодбораБезСуммовыхПараметров = Параметры.РежимПодбораБезСуммовыхПараметров;
		КонецЕсли;
		
		Если Не (Параметры.СкрыватьРучныеСкидки = Неопределено) Тогда
			Форма.СкрыватьРучныеСкидки = Параметры.СкрыватьРучныеСкидки;
		КонецЕсли;
		
		Если Не Форма.РежимПодбораБезСуммовыхПараметров И Не ЗначениеЗаполнено(Форма.Валюта) Тогда
			Форма.Валюта = ЗначениеНастроекПовтИсп.ВалютаУправленческогоУчета();
		КонецЕсли;
		
		// Установить свойства элементов формы по переданным параметрам.
		Элементы.КорзинаЦена.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Цена (%1)'"), Форма.Валюта);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатураПартнера, "Владелец", Параметры.Партнер, 
		ВидСравненияКомпоновкиДанных.Равно, "ОтборПоУмолчанию", ЗначениеЗаполнено(Параметры.Партнер));
		
		Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
			Форма.АвтоЗаголовок = Ложь;
			Форма.Заголовок = Параметры.Заголовок;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ЗаголовокКнопкиПеренести) Тогда
			Форма.Команды.ПеренестиВДокумент.Заголовок = Параметры.ЗаголовокКнопкиПеренести;
			Форма.Команды.ПеренестиВДокумент.Подсказка = Параметры.ЗаголовокКнопкиПеренести;
			Форма.Элементы.КоманднаяПанельПеренести.Ширина = 24;
		КонецЕсли;
		
		Если Параметры.РежимПодбораБезКоличественныхПараметров Тогда
			Элементы.КорзинаКоличественныеПараметры.Видимость = Ложь;
		КонецЕсли;
		
		ОтображатьОстаткиНаСкладах = Не Параметры.СкрыватьКомандуОстаткиНаСкладах И Не (Форма.Склады.Количество() = 0);
		Форма.СкрыватьКомандуОстаткиНаСкладах = Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Форма.ОтображатьОстаткиНаСкладах = ОтображатьОстаткиНаСкладах;
		
		Элементы.ОтображатьОстаткиНадпись.Видимость = ОтображатьОстаткиНаСкладах;
		Элементы.ОтображатьОстаткиНоменклатурыПартнераНадпись.Видимость = ОтображатьОстаткиНаСкладах;
		
		Если ПервоеОткрытиеФормы(Форма.КодФормы) Тогда
			УстановитьПараметрыДереваОтбораКачествоНовый(Форма);
			Форма.ОтображатьОстатки = Истина;
		КонецЕсли;
		
		Элементы.ОстаткиТоваров.Видимость = Форма.ОтображатьОстатки И ОтображатьОстаткиНаСкладах И Не Форма.РежимПодбораБезКоличественныхПараметров;
		Элементы.ОстаткиТоваровПоставщика.Видимость = Форма.ОтображатьОстатки И ОтображатьОстаткиНаСкладах И Не Форма.СкрыватьКомандуОстаткиНаСкладах;
		
		// Установить видимость элементов отображения остатков.
		
		Элементы.ТолькоВНаличии.Видимость = ОтображатьОстаткиНаСкладах;
		
		Элементы.СписокСтандартныйПоискНоменклатураВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискНоменклатураВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		
		Элементы.СписокСтандартныйПоискНоменклатураДоступно.Видимость = ОтображатьОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискНоменклатураДоступно.Видимость = ОтображатьОстаткиНаСкладах;
		Элементы.СписокСтандартныйПоискХарактеристикиВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокСтандартныйПоискХарактеристикиДоступно.Видимость = ОтображатьОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискХарактеристикиВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискХарактеристикиДоступно.Видимость = ОтображатьОстаткиНаСкладах;
		
		// Установить видимость элементов отображения цен.
		ВидимостьЭлементовОтображенияЦен = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		
		Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМенюПерейтиКЦенамНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокСтандартныйПоискХарактеристикиКонтекстноеМенюЦеныНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМенюПерейтиКЦенамНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокРасширенныйПоискХарактеристикиКонтекстноеМенюЦеныНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокСтандартныйПоискНоменклатураПартнераКонтекстноеМенюПерейтиКЦенамНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокРасширенныйПоискНоменклатураПартнераКонтекстноеМенюПерейтиКЦенамНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		
		Если Параметры.РежимПодбораБезСуммовыхПараметров Тогда
			Элементы.КорзинаСуммаРучнойСкидки.Видимость                         = Ложь;
			Элементы.КорзинаПроцентРучнойСкидки.Видимость                       = Ложь;
			Элементы.КорзинаСумма.Видимость                                     = Ложь;
			Элементы.КорзинаЦена.Видимость                                      = Ложь;
			Элементы.СписокСтандартныйПоискНоменклатураЦена.Видимость           = Ложь;
			Элементы.СписокРасширенныйПоискНоменклатураЦена.Видимость           = Ложь;
			Элементы.СписокРасширенныйПоискХарактеристикиЦена.Видимость         = Ложь;
			Элементы.СписокСтандартныйПоискХарактеристикиЦена.Видимость         = Ложь;
			Элементы.СписокСтандартныйПоискНоменклатураПартнераЦена.Видимость   = Ложь;
			Элементы.СписокРасширенныйПоискНоменклатураПартнераЦена.Видимость   = Ложь;
			Элементы.ГруппаФильтрПоЦене.Видимость                               = Ложь;
			Элементы.ВидЦеныПоставщикаНоменклатура.Видимость                    = Ложь;
			Элементы.ВидЦеныПоставщика.Видимость                                = Ложь;
			Элементы.КорзинаВидЦеныПоставщика.Видимость                         = Ложь;
		КонецЕсли;
		
		Если Параметры.СкрыватьРучныеСкидки Тогда
			Элементы.КорзинаСуммаРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаПроцентРучнойСкидки.Видимость = Ложь;
		КонецЕсли;
		
		Если Не (Параметры.ЗапрашиватьКоличество = Неопределено) Тогда
			Форма.ЗапрашиватьКоличество = Параметры.ЗапрашиватьКоличество;
		КонецЕсли;
		
		Элементы.ЗапрашиватьКоличествоЦену.Видимость = Не Параметры.СкрыватьКнопкуЗапрашиватьКоличество;
		Элементы.ЗапрашиватьКоличествоЦену.Пометка = Форма.ЗапрашиватьКоличество;
		
		Если Форма.РежимПодбораБезСуммовыхПараметров Тогда
			Элементы.ЗапрашиватьКоличествоЦену.Заголовок = НСтр("ru = 'Запрашивать количество'");
		КонецЕсли;
		
		Если Не Форма.ИспользоватьНоменклатуруПартнеров Или Не ЗначениеЗаполнено(Параметры.Партнер) Тогда
			Элементы.СтраницаНоменклатураПартнера.Видимость = Ложь;
			Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			Элементы.НоменклатураПартнера.Видимость = Ложь;
		КонецЕсли;
		
		Форма.ВидНоменклатурыДоИзменения = Форма.ВидНоменклатуры;
		
		Элементы.СтраницаСоздатьНоменклатуру.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.Номенклатура);
		Элементы.СтраницаСоздатьХарактеристику.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.ХарактеристикиНоменклатуры);
		
		#КонецОбласти
		
	ИначеЕсли ЭтоФормаПодбораВДокументыПродажи Тогда
		
		#Область УстановитьСвойстваФормыПодбораВДокументыПродажиПоПараметрам
		
		ПервоеОткрытиеФормы = ПервоеОткрытиеФормы(Форма.КодФормы);
		Если ПервоеОткрытиеФормы Тогда
			УстановитьПараметрыДереваОтбораКачествоНовый(Форма);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Соглашение) Тогда
			СегментНоменклатуры = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Параметры.Соглашение, "СегментНоменклатуры");
			Форма.СегментНоменклатуры = СегментНоменклатуры;
		Иначе 
			Форма.СегментНоменклатуры = Справочники.СегментыНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
		Элементы.СегментНоменклатуры.Доступность = ПравоДоступа("Просмотр", Метаданные.Справочники.СегментыНоменклатуры); 
		
		Элементы.КорзинаНоменклатура.ТолькоПросмотр = Параметры.СкрыватьВыборНоменклатуры;
		
		Форма.Валюта = Параметры.Валюта;
		Форма.Дата = Параметры.Дата;
		Форма.Объект.Склад = Параметры.Склад;
		Форма.Партнер = Параметры.Партнер;
		Форма.Соглашение = Параметры.Соглашение;
		Форма.Объект.Соглашение = Параметры.Соглашение;
		Форма.Объект.НалогообложениеНДС = Параметры.НалогообложениеНДС;
		Форма.Объект.ЦенаВключаетНДС = Параметры.ЦенаВключаетНДС;
		Форма.РежимПодбораИспользоватьСкладыВТабличнойЧасти = Параметры.РежимПодбораИспользоватьСкладыВТабличнойЧасти;
		Форма.ВозвращатьМногооборотнуюТару = Параметры.ВозвращатьМногооборотнуюТару;
		
		Форма.ВидЦены = Параметры.ВидЦены;
		
		Форма.РежимПодбораБезКоличественныхПараметров = Параметры.РежимПодбораБезКоличественныхПараметров;
		
		Форма.РежимПодбораБезСуммовыхПараметров = Параметры.РежимПодбораБезСуммовыхПараметров;
		
		Форма.РежимПодбораБезСоглашенийСКлиентами = Параметры.РежимПодбораБезСоглашенийСКлиентами;
		
		Форма.СкрыватьРучныеСкидки = Параметры.СкрыватьРучныеСкидки;
		
		Форма.ИспользоватьДатыОтгрузки = Параметры.ИспользоватьДатыОтгрузки;
		
		Форма.НеРазбиватьНаборыПоКомплектующим = Параметры.НеРазбиватьНаборыПоКомплектующим;
		
		Форма.ВариантАнализаНоменклатурыПродаваемойСовместно = Параметры.ВариантАнализаНоменклатурыПродаваемойСовместно;
		
		ВидыЦенОбъектаХраненияУсловийПродаж = Неопределено;
		
		ВидыЦен = Новый Массив();
		
		Если Не Форма.РежимПодбораБезСуммовыхПараметров Тогда
			Если Форма.РежимОтбораПоАссортименту Тогда
				Форма.ОбъектПланированияАссортимента = АссортиментСервер.ОбъектПланирования(СкладПараметр, Форма.Дата);
				
				ОтборВидовЦен = Новый Структура;
				ОтборВидовЦен.Вставить("РазрешеныПродажи", Истина);
				
				ВидыЦен = АссортиментСервер.ВидыЦенПоАссортименту(Форма.ОбъектПланированияАссортимента, Форма.Дата, ОтборВидовЦен);
				Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен, Форма.ИспользуетсяЦенообразование25);
			ИначеЕсли Форма.РежимОтбораДляРозничныхПродаж Тогда
				Если Форма.ИспользуетсяЦенообразование25 Тогда
					Форма.ОбъектХраненияУсловийПродаж = АссортиментСерверПовтИсп.ФорматМагазинаПоСкладу(СкладПараметр, Форма.Дата);
					ВидыЦен.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ОбъектХраненияУсловийПродаж, "РозничныйВидЦены"));
					Форма.ВидЦенИндивидуальный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ОбъектХраненияУсловийПродаж, "ИндивидуальныйВидЦены");
					Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен, Форма.ИспользуетсяЦенообразование25);
				КонецЕсли;
			ИначеЕсли Форма.РежимПодбораБезСоглашенийСКлиентами Тогда
				ВидыЦен.Добавить(Форма.ВидЦены);
				Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен, Форма.ИспользуетсяЦенообразование25);
			ИначеЕсли Не Форма.ИспользоватьСоглашенияСКлиентами Тогда
				Форма.ОбъектХраненияУсловийПродаж = Форма.Партнер;
				Если Форма.ИспользуетсяЦенообразование25 Тогда
					ВидыЦен.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ОбъектХраненияУсловийПродаж, "ВидЦен"));
					Форма.ВидЦенИндивидуальный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ОбъектХраненияУсловийПродаж, "ИндивидуальныйВидЦены");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ВидыЦен) Тогда
					ВидыЦен = ВидыЦенПоУмолчанию(Форма.Объект.ЦенаВключаетНДС);
				КонецЕсли;
				Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен, Форма.ИспользуетсяЦенообразование25);
			Иначе
				Форма.ОбъектХраненияУсловийПродаж = Форма.Соглашение;
				Если Форма.ИспользуетсяЦенообразование25 Тогда
					ВидыЦен.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ОбъектХраненияУсловийПродаж, "ВидЦен"));
					Форма.ВидЦенИндивидуальный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ОбъектХраненияУсловийПродаж, "ИндивидуальныйВидЦены");
				Иначе
					ВидыЦен = ВидыЦенПоСоглашениюСКлиентом(Форма.Соглашение);
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ВидыЦен) Тогда
					ВидыЦен = ВидыЦенПоУмолчанию(Форма.Объект.ЦенаВключаетНДС);
				КонецЕсли;
				Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен, Форма.ИспользуетсяЦенообразование25);
			КонецЕсли;
		КонецЕсли;
		
		Форма.ВидыЦен.ЗагрузитьЗначения(ВидыЦен);
		
		Если НЕ ВидыЦенОбъектаХраненияУсловийПродаж = Неопределено Тогда
			Если ВидыЦенОбъектаХраненияУсловийПродаж.Свойство("ВидЦен") Тогда
				Форма.ВидЦенОсновной = ВидыЦенОбъектаХраненияУсловийПродаж.ВидЦен;
			ИначеЕсли ВидыЦенОбъектаХраненияУсловийПродаж.Свойство("РозничныйВидЦены") Тогда 
				Форма.ВидЦенОсновной = ВидыЦенОбъектаХраненияУсловийПродаж.РозничныйВидЦены;
			Иначе
				Форма.ВидЦенОсновной = Справочники.ВидыЦен.ПустаяСсылка();
			КонецЕсли;
			
			Если ВидыЦенОбъектаХраненияУсловийПродаж.Свойство("ИндивидуальныйВидЦены") Тогда
				Форма.ВидЦенИндивидуальный = ВидыЦенОбъектаХраненияУсловийПродаж.ИндивидуальныйВидЦены;
			Иначе
				Форма.ВидЦенИндивидуальный = Справочники.ВидыЦен.ПустаяСсылка();
			КонецЕсли;
		Иначе
			Форма.НеИспользоватьВидыЦенПоУсловиюПродаж = Истина;
		КонецЕсли;
		
		Если Форма.ИспользуетсяЦенообразование25 Тогда
			Если Форма.РежимПодбораБезСуммовыхПараметров Тогда
				Форма.ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен;
			ИначеЕсли (Не Форма.ИспользоватьСоглашенияСКлиентами ИЛИ Форма.РежимПодбораБезСоглашенийСКлиентами) 
				И Не Форма.РежимОтбораДляРозничныхПродаж Тогда
				Форма.ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.ВидЦенВШапке;
			Иначе
				Форма.ВариантРасчетаЦен = ВариантРасчетаЦен(Форма);
			КонецЕсли;
		Иначе
			Если Форма.РежимПодбораБезСуммовыхПараметров Тогда
				Форма.ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен;
			ИначеЕсли НЕ Форма.ИспользоватьСоглашенияСКлиентами
				Или Форма.РежимПодбораБезСоглашенийСКлиентами Тогда	
				Форма.ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.ВидЦенВШапке;
			Иначе
				Форма.ВариантРасчетаЦен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Соглашение, "ВариантРасчетаЦен");
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Форма.ВариантРасчетаЦен) Тогда
			Форма.ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Форма.ВариантАнализаНоменклатурыПродаваемойСовместно) Тогда
			Форма.ВариантАнализаНоменклатурыПродаваемойСовместно = Перечисления.ВариантыАнализаНоменклатурыПродаваемойСовместно.ОптоваяТорговля;
		КонецЕсли;
		
		Элементы.КорзинаДатаОтгрузки.Видимость = Форма.ИспользоватьДатыОтгрузки;
		
		Если Не Форма.РежимПодбораБезСуммовыхПараметров Тогда
			Если Не ЗначениеЗаполнено(Форма.Валюта) Тогда
				Форма.Валюта = ЗначениеНастроекПовтИсп.ВалютаУправленческогоУчета();
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.РежимПодбораБезКоличественныхПараметров Тогда
			Элементы.КорзинаКоличественныеПараметры.Видимость = Ложь;
		КонецЕсли;
		
		УстановкаЦенНоменклатуры = Ложь;
		БезОтбораПоИспользоватьПриПродажеВЦену = Ложь;
		Если Параметры.Свойство("Документ") Тогда
			Если ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
				УстановкаЦенНоменклатуры = Истина;
			КонецЕсли;
			
			Если ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.ВводОстатковТоваров") Тогда
				НовыеПараметры = Новый Массив;
				НовыеПараметры.Добавить(Новый ПараметрВыбора("ВыводитьПроизвольныйВидЦен", Истина));
				НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.Статус", Перечисления.СтатусыДействияВидовЦен.Действует));
				Элементы.КорзинаВидЦены.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
				
				БезОтбораПоИспользоватьПриПродажеВЦену = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ТолкающееНазначение = Неопределено;
		Если ЗначениеЗаполнено(Параметры.НаправлениеДеятельности) Тогда
			ТолкающееНазначение = НаправленияДеятельностиСервер.ТолкающееНазначение(Параметры.НаправлениеДеятельности);
		КонецЕсли;
		РежимПодбораОстатковПоНаправлениюДеятельности = ЗначениеЗаполнено(ТолкающееНазначение);
		Форма.Обособленно = РежимПодбораОстатковПоНаправлениюДеятельности;
		Форма.ОтборПоНазначению = ТолкающееНазначение;
		Форма.ОтборПоНазначениюТекущий = ТолкающееНазначение;
		Форма.РежимПодбораОстатковПоНаправлениюДеятельности = РежимПодбораОстатковПоНаправлениюДеятельности;
		Элементы.ОбособленноСтандартныйПоискНоменклатура.Видимость = РежимПодбораОстатковПоНаправлениюДеятельности;
		Элементы.ОбособленноРасширенныйПоискНоменклатура.Видимость = РежимПодбораОстатковПоНаправлениюДеятельности;
		Элементы.ОбособленноСтандартныйПоискХарактеристики.Видимость = РежимПодбораОстатковПоНаправлениюДеятельности;
		Элементы.ОбособленноРасширенныйПоискХарактеристики.Видимость = РежимПодбораОстатковПоНаправлениюДеятельности;
		Элементы.КорзинаОбособленно.Видимость = РежимПодбораОстатковПоНаправлениюДеятельности
		Или Форма.ПодборВариантовОбеспечения
		И Не Форма.ОграничиватьВариантыОбеспечения;
		Элементы.КорзинаВариантОбеспечения.Видимость = Форма.ПодборВариантовОбеспечения
		И Не Форма.ОграничиватьВариантыОбеспечения;
		
		Если Форма.ПодборВариантовОбеспечения
			И Не Форма.ОграничиватьВариантыОбеспечения Тогда
			Элементы.КорзинаВариантОбеспечения.СписокВыбора.Очистить();
			Элементы.КорзинаВариантОбеспечения.СписокВыбора.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить);
			Элементы.КорзинаВариантОбеспечения.СписокВыбора.Добавить(Перечисления.ВариантыОбеспечения.СоСклада);
			Элементы.КорзинаВариантОбеспечения.СписокВыбора.Добавить(Перечисления.ВариантыОбеспечения.КОбеспечению);
			Элементы.КорзинаВариантОбеспечения.СписокВыбора.Добавить(Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления);
			Элементы.КорзинаВариантОбеспечения.СписокВыбора.Добавить(Перечисления.ВариантыОбеспечения.НеТребуется);
		КонецЕсли;
		
		
		ОтображатьОстаткиНаСкладах = Не Параметры.СкрыватьКомандуОстаткиНаСкладах И Не (Форма.Склады.Количество() = 0);
		Форма.СкрыватьКомандуОстаткиНаСкладах = Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Форма.ОтображатьОстаткиНаСкладах = ОтображатьОстаткиНаСкладах;
		
		Если ПервоеОткрытиеФормы Тогда
			Форма.ОтображатьОстатки = Истина;
		КонецЕсли;
		
		// Остатки в форме подбора.
		Элементы.ОтображатьОстаткиНадпись.Видимость = ОтображатьОстаткиНаСкладах
		И Не ЗначениеЗаполнено(Параметры.НаправлениеДеятельности);
		Элементы.ОстаткиТоваров.Видимость = Форма.ОтображатьОстатки
		И ОтображатьОстаткиНаСкладах
		И Не ЗначениеЗаполнено(Параметры.НаправлениеДеятельности);
		Элементы.СписокСтандартныйПоискНоменклатураВНаличииОстаток.Видимость = Не Форма.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискНоменклатураВНаличииОстаток.Видимость = Не Форма.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокСтандартныйПоискХарактеристикиВНаличииОстаток.Видимость = Не Форма.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискХарактеристикиВНаличииОстаток.Видимость = Не Форма.СкрыватьКомандуОстаткиНаСкладах;
		УстановитьВидимостьДоступныхОстатковПодбораВДокументПродажи(Форма);
		
		Элементы.ТолькоВНаличии.Видимость = ОтображатьОстаткиНаСкладах;
		
		Если ПраваПользователяПовтИсп.ЭтоПартнер() Тогда
			Элементы.ТолькоВНаличии.Видимость = Ложь;
		КонецЕсли;
		
		Если Параметры.РежимПодбораБезСуммовыхПараметров Тогда
			Элементы.КорзинаСуммаРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаПроцентРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаСумма.Видимость = Ложь;
			Элементы.КорзинаЦена.Видимость = Ложь;
			Элементы.СписокСтандартныйПоискНоменклатураЦена.Видимость = Ложь;
			Элементы.СписокРасширенныйПоискНоменклатураЦена.Видимость = Ложь;
			Элементы.СписокРасширенныйПоискХарактеристикиЦена.Видимость = Ложь;
			Элементы.СписокСтандартныйПоискХарактеристикиЦена.Видимость = Ложь;
			Элементы.ГруппаФильтрПоЦене.Видимость = Ложь;
			
			Элементы.КорзинаКонтекстноеМенюЗаполнитьЦеныПоСоглашению.Видимость            = Ложь;
			Элементы.КорзинаКонтекстноеМенюЗаполнитьЦеныВыделенныхСтрокПоВидуЦен.Видимость = Ложь;
			Элементы.КорзинаКонтекстноеМенюНазначитьРучнуюСкидку.Видимость                = Ложь;
			Элементы.КорзинаКонтекстноеМенюНазначитьРучнуюСкидкуВыделенныхСтрок.Видимость = Ложь;
			Элементы.КорзинаКонтекстноеМенюОтменитьРучныеСкидки.Видимость                 = Ложь;
		КонецЕсли;
		
		Если Параметры.СкрыватьРучныеСкидки Тогда
			Элементы.КорзинаСуммаРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаПроцентРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаКонтекстноеМенюНазначитьРучнуюСкидку.Видимость                = Ложь;
			Элементы.КорзинаКонтекстноеМенюНазначитьРучнуюСкидкуВыделенныхСтрок.Видимость = Ложь;
			Элементы.КорзинаКонтекстноеМенюОтменитьРучныеСкидки.Видимость                 = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
			Форма.АвтоЗаголовок = Ложь;
			Форма.Заголовок = Параметры.Заголовок;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ЗаголовокКнопкиПеренести) Тогда
			Форма.Команды.ПеренестиВДокумент.Заголовок = Параметры.ЗаголовокКнопкиПеренести;
			Форма.Команды.ПеренестиВДокумент.Подсказка = Параметры.ЗаголовокКнопкиПеренести;
		КонецЕсли;
		
		Если Параметры.ЗапрашиватьКоличество <> Неопределено Тогда
			Форма.ЗапрашиватьКоличество = Параметры.ЗапрашиватьКоличество;
		КонецЕсли;
		
		Элементы.НеЗапрашиватьКоличество.Видимость = Не Параметры.СкрыватьКнопкуЗапрашиватьКоличество И Не Форма.РежимПодбораБезСуммовыхПараметров;
		Элементы.ЗапрашиватьКоличествоЦену.Видимость = Не Параметры.СкрыватьКнопкуЗапрашиватьКоличество И Не Форма.РежимПодбораБезСуммовыхПараметров;
		Элементы.ЗапрашиватьКоличество.Видимость = Не Параметры.СкрыватьКнопкуЗапрашиватьКоличество;
		
		Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМенюЦеныНоменклатуры.Видимость = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМенюЦеныНоменклатуры.Видимость = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		Элементы.СписокРасширенныйПоискХарактеристикиКонтекстноеМенюЦеныНоменклатуры.Видимость = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		Элементы.СписокСтандартныйПоискХарактеристикиКонтекстноеМенюЦеныНоменклатуры.Видимость = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		Элементы.КорзинаВидЦены.Видимость = Не (Параметры.РежимПодбораБезСуммовыхПараметров Или Параметры.СкрыватьКолонкуВидЦены);
		
		Элементы.КорзинаКонтекстноеМенюЗаполнитьЦеныПоСоглашению.Видимость            = Не (Параметры.РежимПодбораБезСуммовыхПараметров Или Параметры.СкрыватьКолонкуВидЦены);
		Элементы.КорзинаКонтекстноеМенюЗаполнитьЦеныВыделенныхСтрокПоВидуЦен.Видимость = Не (Параметры.РежимПодбораБезСуммовыхПараметров Или Параметры.СкрыватьКолонкуВидЦены);
		
		Элементы.КорзинаИндексСовместноПродаваемыеТовары.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПродаваемуюСовместно");
		
		Форма.ВидНоменклатурыДоИзменения = Форма.ВидНоменклатуры;
		
		Элементы.СтраницаСоздатьНоменклатуру.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.Номенклатура);
		Элементы.СтраницаСоздатьХарактеристику.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.ХарактеристикиНоменклатуры);
		
		Форма.ЗапретРедактированияСоставаНабора = Параметры.ЗапретРедактированияСоставаНабора;
		Форма.ЗапретРедактированияЦеныНабора    = Параметры.ЗапретРедактированияЦеныНабора;
		
		Форма.БезОтбораПоВключениюНДСВЦену      = Параметры.БезОтбораПоВключениюНДСВЦену;
		Форма.ЗапретРедактированияСоставаНабора = Параметры.ЗапретРедактированияСоставаНабора;
		Форма.ЗапретРедактированияЦеныНабора    = Параметры.ЗапретРедактированияЦеныНабора;
		Форма.БезОтбораПоИспользоватьПриПродажеВЦену    = БезОтбораПоИспользоватьПриПродажеВЦену;
		
		Форма.РежимПодбораДляДокументовЦенообразования = Параметры.РежимПодбораДляДокументовЦенообразования;
		
		#КонецОбласти
		
	КонецЕсли;
	
	#КонецОбласти
	УстановитьЗначенияПоНастройкамФормы(Форма);
	
	#Область УстановитьЗначенияПоНастройкамФормыПодбора
	
	Форма.ТолькоВНаличии = Ложь;
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(Форма.КодФормы,  "");
	
	Если Не (Настройки = Неопределено) Тогда
		
		Если Настройки.Свойство("ТолькоВНаличии") Тогда
			Форма.ТолькоВНаличии = Настройки.ТолькоВНаличии И Форма.ОтображатьОстаткиНаСкладах;
		КонецЕсли;
		
		Если Форма.СкрыватьКомандуОстаткиНаСкладах Тогда
			Форма.ТолькоВНаличии = Ложь;
		КонецЕсли; 
		
		// Остатки в форме подбора.
		Если Настройки.Свойство("ОтображатьОстатки") Тогда
			Форма.ОтображатьОстатки = Настройки.ОтображатьОстатки;
			Форма.ОтображатьОстаткиНадпись = ?(Форма.ОтображатьОстатки,
			НСтр("ru = 'Подробная информация об остатках (скрыть)'"),
			НСтр("ru = 'Подробная информация об остатках (показать)'"));
			
			Элементы.ОстаткиТоваров.Видимость = Форма.ОтображатьОстатки
			И Не (Форма.РежимПодбораБезКоличественныхПараметров
			Или Форма.СкрыватьКомандуОстаткиНаСкладах)
			И Форма.ОтображатьОстаткиНаСкладах
			И (ЭтоФормаПодбораВДокументыЗакупки Или Не ЗначениеЗаполнено(Параметры.НаправлениеДеятельности));
			
			Если ЭтоФормаПодбораВДокументыЗакупки Тогда
				Элементы.ОстаткиТоваровПоставщика.Видимость = Форма.ОтображатьОстатки
				И Не Форма.СкрыватьКомандуОстаткиНаСкладах;
			КонецЕсли;
		КонецЕсли;
		
		Если Настройки.Свойство("ПоказыватьПодобранныеТовары") Тогда
			
			Форма.ПоказыватьПодобранныеТовары = Настройки.ПоказыватьПодобранныеТовары;
			
		КонецЕсли;
		
		Если ЭтоФормаПодбораВДокументыПродажи Тогда
			Если Настройки.Свойство("ЗапрашиватьКоличество") Тогда
				Форма.ЗапрашиватьКоличество = Настройки.ЗапрашиватьКоличество;
			Иначе
				Форма.ЗапрашиватьКоличество = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
			КонецЕсли;
			
			Если Настройки.Свойство("ЗапрашиватьЦену") Тогда
				Форма.ЗапрашиватьЦену = Настройки.ЗапрашиватьЦену;
			Иначе
				Форма.ЗапрашиватьЦену = Истина;
			КонецЕсли;
		Иначе
			Если Настройки.Свойство("ЗапрашиватьКоличество") Тогда
				Форма.ЗапрашиватьКоличество = Настройки.ЗапрашиватьКоличество;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоФормаПодбораВДокументыЗакупки Тогда
		Элементы.ЗапрашиватьКоличествоЦену.Пометка = Форма.ЗапрашиватьКоличество;
	Иначе
		Элементы.НеЗапрашиватьКоличество.Пометка = Не Форма.ЗапрашиватьКоличество;
		Элементы.ЗапрашиватьКоличество.Пометка = Форма.ЗапрашиватьКоличество И (Не Форма.ЗапрашиватьЦену Или Форма.РежимПодбораБезСуммовыхПараметров);
		Элементы.ЗапрашиватьКоличествоЦену.Пометка = Форма.ЗапрашиватьКоличество И Форма.ЗапрашиватьЦену;
	КонецЕсли;
	
	#КонецОбласти	
	
	УстановитьОтборТолькоВНаличии(Форма);
	
	#Область УстановитьЗаголовкиЭлементовФормыПоПараметрам
	ИмяСпискаНоменклатуры = ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(Форма);
	ИмяСпискаХарактеристик = ПодборТоваровКлиентСервер.ИмяСпискаХарактеристикПоВариантуПоиска(Форма);
	
	ТекстЗаголовка = НСтр("ru = 'Цена'");
	
	Если ЗначениеЗаполнено(Форма.Валюта) Тогда
		ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Цена (%1)'"), Форма.Валюта);
	КонецЕсли;
	
	ПолеФормыНоменклатураЦена = Форма.Элементы[ИмяСпискаНоменклатуры].ПодчиненныеЭлементы[ИмяСпискаНоменклатуры+"Цена"]; // ПолеФормы
	ПолеФормыХарактеристикаЦена = Форма.Элементы[ИмяСпискаХарактеристик].ПодчиненныеЭлементы[ИмяСпискаХарактеристик+"Цена"]; // ПолеФормы
	
	ПолеФормыНоменклатураЦена.Заголовок = ТекстЗаголовка;
	ПолеФормыХарактеристикаЦена.Заголовок = ТекстЗаголовка;
	
	Элементы.КорзинаЦена.Заголовок = ТекстЗаголовка;
	ВыбранаГруппаСкладов = Не ПереданСписокСкладов И Справочники.Склады.ЭтоГруппа(Параметры.Склад);
	
	ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	?(ВыбранаГруппаСкладов,
	НСтр("ru = 'Только в наличии на группе складов ""%1""'"),
	?(Не ПереданСписокСкладов И ЗначениеЗаполнено(Параметры.Склад),
	НСтр("ru = 'Только в наличии на складе ""%1""'"), НСтр("ru = 'Только в наличии'"))),
	Параметры.Склад);
	
	Если Параметры.Свойство("Документ") Тогда
		Если ТипЗнч(Параметры.Документ) <> Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
			Элементы.ТолькоВНаличии.Заголовок = ТекстЗаголовка;
		КонецЕсли;
	Иначе
		Элементы.ТолькоВНаличии.Заголовок = ТекстЗаголовка;
	КонецЕсли;
	#КонецОбласти
	
	УстановитьЭлементыСпискаЗначенийКачества(Форма);
	УстановитьОтборПоТипуНоменклатурыПоПараметрам(Форма);
	
	#Область УстановитьОтборПоВариантуРасчетаЦенНаборов
	
	Если ЭтоФормаПодбораВДокументыПродажи Тогда
		
		Если Параметры.ОтборПоВариантуРасчетаЦенНаборов <> Неопределено Тогда
			ОтборПоВариантуРасчетаЦенНаборов = Параметры.ОтборПоВариантуРасчетаЦенНаборов;
			Отбор = Новый СписокЗначений;
			Отбор.ЗагрузитьЗначения(ОтборПоВариантуРасчетаЦенНаборов);
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.СписокНоменклатура, "ВариантРасчетаЦеныНабора", Отбор, 
			ВидСравненияКомпоновкиДанных.ВСписке, "ОтборПоВариантуРасчетаЦенНаборов", (Отбор.Количество() > 0));
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.СписокХарактеристики, "ВариантРасчетаЦеныНабора", Отбор, 
			ВидСравненияКомпоновкиДанных.ВСписке, "ОтборПоВариантуРасчетаЦенНаборов", (Отбор.Количество() > 0));
		КонецЕсли;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область УстановитьОтборОсобенностьУчета
	Если Параметры.Свойство("ОсобенностьУчета") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатура, "Ссылка.ОсобенностьУчета", Параметры.ОсобенностьУчета, 
		ВидСравненияКомпоновкиДанных.ВСписке, "ОтборОсобенностьУчета",ЗначениеЗаполнено(Параметры.ОсобенностьУчета));
	КонецЕсли;
	
	#КонецОбласти
	
	#Область УстановитьОтборОсобенностьУчета
	
	Если Параметры.Свойство("КоллекцияНоменклатуры") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатура, "Ссылка.КоллекцияНоменклатуры", Параметры.КоллекцияНоменклатуры, 
		ВидСравненияКомпоновкиДанных.Равно, "ОтборКоллекцияНоменклатуры",ЗначениеЗаполнено(Параметры.КоллекцияНоменклатуры));
	КонецЕсли;
	
	#КонецОбласти
	
	Форма.ТекущаяСтрокаНоменклатуры = ПодборТоваровКлиентСервер.СтруктураСтрокиНоменклатуры();
	Форма.ТекущаяСтрокаХарактеристик = ПодборТоваровКлиентСервер.СтруктураСтрокиХарактеристик();
	
	ОбщегоНазначенияУТ.ИнициализироватьРеквизитыФормыДляПолнотекстовогоПоиска(Форма, "ИспользоватьПолнотекстовыйПоискПриПодбореТоваров");
	#Вставка
	Попытка	
		Вставка_Продажи = ЭтоФормаПодбораВДокументыПродажи И 
		не Форма.РежимПодбораБезСуммовыхПараметров и 
		не Форма.РежимОтбораПоАссортименту и 
		не Форма.РежимПодбораБезСоглашенийСКлиентами и 
		Форма.ИспользоватьСоглашенияСКлиентами и 
		Допмодуль.НовоеЦенообразование();
		
		Если Вставка_Продажи Тогда 
			Вставка_ВидыЦен = ВидыЦенПоСоглашениюСКлиентом_НЦ(Форма.Соглашение, Форма.Параметры.Подразделение);
			Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, Вставка_ВидыЦен);
		КонецЕсли;	
	Исключение
		Вставка_Продажи = Ложь;
	КонецПопытки;  
	#КонецВставки
	УстановитьТекстыЗапросовСписковФормыПодбора(Форма);
	
	#Область УстановитьПараметрыСписковФормыПодбора
	
	СписокНоменклатура = Форма.СписокНоменклатура;
	СписокХарактеристики = Форма.СписокХарактеристики;
	
	Если ЭтоФормаПодбораВДокументыЗакупки Тогда
		СписокНоменклатураПартнера = Форма.СписокНоменклатураПартнера;
	КонецЕсли;
	
	Если ЭтоФормаПодбораВДокументыПродажи Тогда
		
		Если Форма.РежимОтбораПоАссортименту Тогда
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ОбъектПланирования", Форма.ОбъектПланированияАссортимента);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ОбъектПланирования", Форма.ОбъектПланированияАссортимента);
		КонецЕсли;
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "СегментНоменклатуры", Форма.СегментНоменклатуры, ЗначениеЗаполнено(Форма.СегментНоменклатуры));
		Если Форма.ИспользоватьСоглашенияСКлиентами
			И Не Форма.РежимПодбораБезСоглашенийСКлиентами Тогда
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Соглашение", Форма.Соглашение);
		КонецЕсли;
		
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Валюта", Форма.Валюта);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Дата", Форма.Дата);
		
		Если Форма.ВидыЦен.Количество() = 0 Тогда
			ВидыЦенПараметр = Справочники.ВидыЦен.ПустаяСсылка();
		ИначеЕсли Форма.ВидыЦен.Количество() = 1 Тогда
			ВидыЦенПараметр = Форма.ВидыЦен[0].Значение;
		Иначе
			ВидыЦенПараметр = Форма.ВидыЦен.ВыгрузитьЗначения();
		КонецЕсли;
		
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ВидыЦен", ВидыЦенПараметр);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Назначение", Форма.ОтборПоНазначениюТекущий);
		
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ВидЦенОсновной", Форма.ВидЦенОсновной);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ВидЦенИндивидуальный", Форма.ВидЦенИндивидуальный);
		
		Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "СегментНоменклатуры", Справочники.СегментыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "НоменклатураСегмента", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВладелецХарактеристик", Справочники.Номенклатура.ПустаяСсылка());
			Если Форма.ИспользоватьСоглашенияСКлиентами
				И Не Форма.РежимПодбораБезСоглашенийСКлиентами Тогда
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Соглашение", Форма.Соглашение);
			КонецЕсли;
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Валюта", Форма.Валюта);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Дата", Форма.Дата);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидыЦен", ВидыЦенПараметр);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидЦенОсновной", Форма.ВидЦенОсновной);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидЦенИндивидуальный", Форма.ВидЦенИндивидуальный);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидНоменклатуры", Справочники.ВидыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ЦеноваяГруппа", Справочники.ЦеновыеГруппы.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Назначение", Форма.ОтборПоНазначениюТекущий);
			
		КонецЕсли;
		
		Если Не ПраваПользователяПовтИсп.ЭтоПартнер() Тогда
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Склад", СкладПараметр);
			
			Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Склад", СкладПараметр);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ЭтоФормаПодбораВДокументыЗакупки Тогда
		
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Дата", Форма.Дата);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Склад", СкладПараметр);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Валюта", Форма.Валюта);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Соглашение", Форма.Соглашение);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ВидЦеныПоставщика", Форма.ВидЦеныПоставщика);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "СегментНоменклатуры", Форма.СегментНоменклатуры, ЗначениеЗаполнено(Форма.СегментНоменклатуры));
		
		Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидЦеныПоставщика", Форма.ВидЦеныПоставщика);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "СегментНоменклатуры", Форма.СегментНоменклатуры);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "НоменклатураСегмента", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Соглашение", Форма.Соглашение);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Валюта", Форма.Валюта);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Дата", Форма.Дата);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВладелецХарактеристик", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидНоменклатуры", Справочники.ВидыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "СтавкаНДС", Справочники.СтавкиНДС.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Склад", СкладПараметр);
			
		КонецЕсли;
		
		Если Форма.ИспользоватьНоменклатуруПартнеров Тогда
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатураПартнера, "ВидЦеныПоставщика", Форма.ВидЦеныПоставщика);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатураПартнера, "Соглашение", Форма.Параметры.Соглашение);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатураПартнера, "Валюта", Форма.Параметры.Валюта);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатураПартнера, "Дата", Форма.Параметры.Дата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//++ Локализация
	ИнтеграцияСМаркетплейсамиСерверЛокализация.УстановитьПараметрыДинамическогоСписка(Форма, СписокНоменклатура, СписокХарактеристики);
	//-- Локализация
	
	#КонецОбласти
	
	НастройкиФормыПриОткрытии = НастройкиФормыПодбора(Форма);
	СтруктураСохраняемыхНастроекФормы = Новый Структура("ТребуетсяСохранение");
	Для Каждого Настройка Из НастройкиФормыПриОткрытии Цикл
		Если Не ТипЗнч(Настройка.Значение) = Тип("ТаблицаЗначений") Тогда
			СтруктураСохраняемыхНастроекФормы.Вставить(Настройка.Ключ);
		КонецЕсли;
	КонецЦикла;
	Форма.НастройкиФормыПриОткрытии = СтруктураСохраняемыхНастроекФормы;
	
	ПодборТоваровКлиентСервер.УстановитьТекущиеСтраницыПоВариантуПоиска(Форма);
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьСервер.ИзменениеТекстаЗапросаСпискаДляТекущегоЯзыка(Форма, "СписокНоменклатура");
	МультиязычностьСервер.ИзменениеТекстаЗапросаСпискаДляТекущегоЯзыка(Форма, "СписокХарактеристики");
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	#Вставка
	Попытка
		// продажи
		Если Вставка_Продажи Тогда		
			Форма.ВидыЦен.ЗагрузитьЗначения(Вставка_ВидыЦен);  
			Если Форма.ВидыЦен.Количество() = 0 Тогда
				ВидыЦенПараметр = Справочники.ВидыЦен.ПустаяСсылка();
			ИначеЕсли Форма.ВидыЦен.Количество() = 1 Тогда
				ВидыЦенПараметр = Форма.ВидыЦен[0].Значение;
			Иначе
				ВидыЦенПараметр = Форма.ВидыЦен.ВыгрузитьЗначения();
			КонецЕсли;  
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.СписокНоменклатура, "ВидыЦен", ВидыЦенПараметр);
			Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда   
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.СписокХарактеристики, "ВидыЦен", ВидыЦенПараметр);
			КонецЕсли;
			
			// закупки
		иначеесли ЭтоФормаПодбораВДокументыЗакупки И 
			Допмодуль.НовоеЦенообразованиеЗакупа(Форма.Дата) и 
			Форма.Параметры.Свойство("Подразделение") тогда
			
			ВидЦеныПоставщика=ПолучитьВидЦеныСоглашенияСПоставщиком(Форма.Соглашение, Форма.Параметры.Подразделение, Форма.Партнер);
			Форма.ВидЦеныПоставщика=ВидЦеныПоставщика;
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.СписокНоменклатура, "ВидЦеныПоставщика", ВидЦеныПоставщика);
		конецесли;	
	Исключение
	КонецПопытки;  
	#КонецВставки
КонецПроцедуры

#КонецОбласти
