#Область Доработки_по_ордерной_схеме

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПоРаспоряжению")
Процедура Док_ЗаполнитьПоРаспоряжению()
	
	#Вставка
		Если Не ЗначениеЗаполнено(Объект.Накладная) Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо указать накладную!");
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.РабочийУчасток) Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо указать рабочий участок!");
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо сначала записать документ!");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПоНакладной();
	#КонецВставки
	
	#Удаление
	Документы.РасходныйОрдерНаТовары.ЗаполнитьОтгружаемыеТоварыПоТоварамПоРаспоряжениям(Объект); 
	РасходныйОрдерНаТоварыЛокализация.УстановитьПризнакИспользованияМаркируемойПродукции(ЭтотОбъект);
	УстановитьВидимостьЭлементовУпаковкиПриМаркировке();
	
	УпаковочныеЛистыСервер.ПриЧтенииСозданииФормыСУпаковочнымиЛистами(ЭтотОбъект,
																Объект.ОтгружаемыеТовары,
																Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	#КонецУдаления   
	
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары", Истина);
	НоменклатураСервер.ЗаполнитьСерииПоFEFO(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары, Ложь);	
	
	#Удаление
	Если Не СкладыСервер.ИспользоватьАдресноеХранение(Объект.Склад, Объект.Помещение, Объект.ДатаОтгрузки)
		И ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
		Документы.РасходныйОрдерНаТовары.РазбитьПоУпаковкамСправочно(Объект);
	КонецЕсли;
	#КонецУдаления

	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
	
	ОтобразитьИнформациюПоНеотгружаемымТоварам();
	
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары", Ложь);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоНакладной()
	
	Объект.ОтгружаемыеТовары.Очистить();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРасходныхОрдеров", Новый Структура("Склад", Объект.Склад)) Тогда
		Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
	Иначе
		Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКОтгрузкеПоНакладным.Регистратор КАК Регистратор,
		|	ТоварыКОтгрузкеПоНакладным.Накладная КАК Накладная,
		|	ТоварыКОтгрузкеПоНакладным.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузкеПоНакладным.Характеристика КАК Характеристика,
		|	ТоварыКОтгрузкеПоНакладным.Назначение КАК Назначение,
		|	ТоварыКОтгрузкеПоНакладным.Серия КАК Серия,
		|	СУММА(ТоварыКОтгрузкеПоНакладным.КОтгрузке + ТоварыКОтгрузкеПоНакладным.КСборке + ТоварыКОтгрузкеПоНакладным.Собирается + ТоварыКОтгрузкеПоНакладным.Собрано) КАК Количество
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузкеПоНакладным КАК ТоварыКОтгрузкеПоНакладным
		|ГДЕ
		|	ТоварыКОтгрузкеПоНакладным.РабочийУчасток = &РабочийУчасток
		|	И ТоварыКОтгрузкеПоНакладным.Накладная = &Накладная
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтгрузкеПоНакладным.Регистратор,
		|	ТоварыКОтгрузкеПоНакладным.Накладная,
		|	ТоварыКОтгрузкеПоНакладным.Номенклатура,
		|	ТоварыКОтгрузкеПоНакладным.Характеристика,
		|	ТоварыКОтгрузкеПоНакладным.Назначение,
		|	ТоварыКОтгрузкеПоНакладным.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Номенклатура КАК Номенклатура,
		|	Данные.Характеристика КАК Характеристика,
		|	Данные.Назначение КАК Назначение,
		|	Данные.Серия КАК Серия
		|ПОМЕСТИТЬ ВТДанныеПоДругимРасходнымОрдерам
		|ИЗ
		|	ВТДанные КАК Данные
		|ГДЕ
		|	Данные.Регистратор <> &Накладная
		|	И Данные.Регистратор <> &ТекущийРасходныйОрдерНаТовары
		|	И Данные.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Номенклатура КАК Номенклатура,
		|	Данные.Характеристика КАК Характеристика,
		|	Данные.Назначение КАК Назначение,
		|	Данные.Серия КАК Серия,
		|	Данные.Количество КАК Количество
		|ИЗ
		|	ВТДанные КАК Данные
		|ГДЕ
		|	Данные.Регистратор = &Накладная
		|	И НЕ (Данные.Номенклатура, Данные.Характеристика, Данные.Назначение, Данные.Серия) В
		|				(ВЫБРАТЬ
		|					ВТДанныеПоДругимРасходнымОрдерам.Номенклатура,
		|					ВТДанныеПоДругимРасходнымОрдерам.Характеристика,
		|					ВТДанныеПоДругимРасходнымОрдерам.Назначение,
		|					ВТДанныеПоДругимРасходнымОрдерам.Серия
		|				ИЗ
		|					ВТДанныеПоДругимРасходнымОрдерам)";
	
	Запрос.УстановитьПараметр("Накладная", Объект.Накладная);
	Запрос.УстановитьПараметр("РабочийУчасток", Объект.РабочийУчасток);
	Запрос.УстановитьПараметр("ТекущийРасходныйОрдерНаТовары", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		НоваяСтрока = Объект.ОтгружаемыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЗапроса);
		
		НоваяСтрока.КоличествоУпаковок = РезультатЗапроса.Количество;
		НоваяСтрока.Действие = Действие;
	КонецЦикла;
	
	Объект.ВсегоМест = УпаковочныеЛистыСервер.КоличествоМестВТЧ(Объект.ОтгружаемыеТовары);

КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.ТоварыПоРаспоряжениям.Видимость = РольДоступна("ПолныеПрава");

	Если Объект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению Тогда
		_НомерВерсииПеремещения = ПолучитьНомерВерсииПеремещения();
	КонецЕсли; 
	
	ОграничитьДоступность();  
	
	Если ОбменУТМПСервер.ОрдерЗаполнялсяВМП(Объект.Ссылка, Объект.Накладная) Тогда
		Элементы.ОтгружаемыеТоварыЗаполнитьПоРегиструМП.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура Док_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ОграничитьДоступность()       
	
	Если РольДоступна("МенеджерТорговогоЗала") Или РольДоступна("СотрудникМД") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		// Расширяемые элементы
		Элементы.ПроверитьКоличество.Доступность = Ложь;
		Элементы.ИсправитьКоличество.Доступность = Ложь;
		Элементы.ТоварыПоРаспоряжениямПерезаполнитьОтгружаемымиТоварами.Доступность = Ложь;
		Элементы.ТипОтгрузки.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры	

&НаКлиенте
Процедура Док_ОтгружаемыеТоварыПриИзмененииПосле(Элемент)
	 ПерезаполнитьОтгружаемымиТоварамиСервер();
	 ОчиститьСообщения();
КонецПроцедуры

&НаКлиенте
Процедура Расш1__КПроверкеПосле(Команда)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КПроверке");
	СтатусПриИзменении(Неопределено);
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Расш1__НачатьСборкуПосле(Команда)
	Объект.Статус =ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору"); 
	СтатусПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Расш1__ОтгрузитьПосле(Команда)
	Объект.Статус =  ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен");
	СтатусПриИзменении(Неопределено); 
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Расш1__СобраноПосле(Команда)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтгрузке");
	СтатусПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура СортировкаПоЯчейке()
	
	Если Объект.ОтгружаемыеТовары.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
					|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
					|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
					|ИЗ
					|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование КАК ЯчейкаНаименование,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
					|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
					|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ИЗ
					|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
					|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
					|
					|УПОРЯДОЧИТЬ ПО
					|	ЯчейкаНаименование";
					
					Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",Объект.ОтгружаемыеТовары.Выгрузить());
					Запрос.УстановитьПараметр("Склад",Объект.Склад);
					
					Объект.ОтгружаемыеТовары.Очистить();
					Объект.ОтгружаемыеТовары.Загрузить(Запрос.Выполнить().Выгрузить());

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док__СортировкаПоЯчейкеПосле(Команда)
	СортировкаПоЯчейке();
КонецПроцедуры

Функция ПолучитьНомерВерсииПеремещения()
	Возврат АльтерраОбщегоНазначения.ПолучитьКоличествоЗаписейВРегистреСобытияДокументов(ПолучитьПеремещениеПоЗаказам(),Перечисления.СобытияДокументов.ИзменениеТабличнойЧасти);
КонецФункции

Функция ПолучитьПеремещениеПоЗаказам()
	
	СсылкаНаПеремещение = Документы.ПеремещениеТоваров.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
		|ПОМЕСТИТЬ ВТ_Распоряжения
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Распоряжения КАК ВТ_Распоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ПО (ПеремещениеТоваровТовары.Ссылка = ВТ_Распоряжения.Распоряжение
		|				ИЛИ ПеремещениеТоваровТовары.ЗаказНаПеремещение = ВТ_Распоряжения.Распоряжение)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СсылкаНаПеремещение = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СсылкаНаПеремещение;
КонецФункции

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ПосчитатьИтогПоВесу();
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтгружаемыеТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	ПосчитатьИтогПоВесу();
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьИтогПоВесу()
	
	ВесВсего = 0;
    
    Для Каждого Строка Из Объект.ОтгружаемыеТовары Цикл
		//Если Элементы.ОтгружаемыеТовары.ПроверитьСтроку(Строка) тогда
            ВесВсего = ВесВсего+Строка.Вес;
		//КонецЕсли;  
	КонецЦикла;
	
    Элементы.ОтгружаемыеТоварыВес.ТекстПодвала = ВесВсего;
	
КонецПроцедуры

#КонецОбласти   

#Область ИнициализацияЯПХ

&НаКлиенте
Процедура ЯчейкаПромежуточногоХраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОткрытияФормы = ПараметрыОткрытияФормы_СкладскиеЯчейки(СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СкладскиеЯчейки.Форма.ФормаВыбора", 
		ПараметрыОткрытияФормы,
		ЭтаФорма, 
		, 
		, 
		,
		Новый ОписаниеОповещения("ЯчейкаПромежуточногоХраненияНачалоВыбора_Завершение", ЭтаФорма), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
				
КонецПроцедуры        
	
&НаКлиенте
Процедура ЯчейкаПромежуточногоХраненияНачалоВыбора_Завершение(НовоеЗначение, ДополнительныеПараметры) Экспорт
	Если НовоеЗначение <> Неопределено Тогда
		Объект.ЯчейкаПромежуточногоХранения = НовоеЗначение;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтгрузке");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормы_СкладскиеЯчейки(СтандартнаяОбработка)     
	
	СекцииСотрудника = Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь", Пользователи.ТекущийПользователь()).РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
	
	МассивСсылокИерархия = Новый Массив;     
	РабочийУчасток = Справочники.РабочиеУчастки.ПустаяСсылка();         
	
	Если СекцииСотрудника.Количество() > 0 Тогда
		Для Каждого Строка Из СекцииСотрудника.ВыгрузитьЗначения() Цикл
			МассивСсылокИерархия.Добавить(Строка.ГруппаСкладскихЯчеекХраненияПриОтгрузке);		
		КонецЦикла;                   
	ИначеЕсли ЗначениеЗаполнено(Объект.РабочийУчасток) Тогда
		Если ЗначениеЗаполнено(Объект.РабочийУчасток.ГруппаСкладскихЯчеекХраненияПриОтгрузке) Тогда
			МассивСсылокИерархия.Добавить(Объект.РабочийУчасток.ГруппаСкладскихЯчеекХраненияПриОтгрузке);
		Иначе       
			РабочиеУчастки = Объект.РабочийУчасток;
		КонецЕсли;	  
	Иначе
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначения.СообщитьПользователю("Необходимо сначала указать рабочий участок!");
	КонецЕсли;  
	
	Возврат Новый Структура("МассивСсылокИерархия, РабочийУчасток", МассивСсылокИерархия, РабочийУчасток);

КонецФункции 

#КонецОбласти

&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СФП_МаркерыКлиент.МаркерНачало("Расходный ордер на товары: проведение из формы", Объект.Номер);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция Док_ЗаполнитьПоРегиструМППослеНаСервере(Отработаные) 
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	БылиИзменения = ОбменУТМПСервер.ЗаполнитьОрдер(ДокОбъект, "ОтгружаемыеТовары", Отработаные); 
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект"); 
	Возврат БылиИзменения;
КонецФункции

&НаКлиенте
Процедура Док_ЗаполнитьПоРегиструМППосле(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветЗаполнениеПоРегистру", ЭтаФорма);
	ТекстВопроса = "Дозаполнить только необработанные строки?";
   	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьОтветЗаполнениеПоРегистру(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отработаные = Ложь;
	Иначе
		Отработаные = Истина;	
	КонецЕсли;
	БылиИзменения = Док_ЗаполнитьПоРегиструМППослеНаСервере(Отработаные);
	Если БылиИзменения Тогда
		ЭтаФорма.Модифицированность = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветОчисткаПустыхСтрок", ЭтаФорма);
		ТекстВопроса = "Очистить неотработанные строки?";
	   	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьОтветОчисткаПустыхСтрок(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьОтветОчисткаПустыхСтрокНаСервере();
	КонецЕсли;	 	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветОчисткаПустыхСтрокНаСервере() 
	
	МассивСтрок = Объект.ОтгружаемыеТовары.НайтиСтроки(Новый Структура("КоличествоУпаковок",0));
	Для Каждого Строка Из МассивСтрок Цикл
		Объект.ОтгружаемыеТовары.Удалить(Строка);
	КонецЦикла;	
	ПерезаполнитьОтгружаемымиТоварамиСервер();
	
КонецПроцедуры	






