#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
&После("УстановкаПараметровСеанса")
Процедура Док_УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	ТекущийСотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователи.ТекущийПользователь());

	Если ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		ПараметрыСеанса.ТекущийСотрудник = ТекущийСотрудник;
	КонецЕсли;

	ДопМодульСервер.ПроверитьНумерациюТренажера();
	
	СФП_МаркерыСервер.УстановитьЗначенияПараметровСеанса(ИменаПараметровСеанса);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли