#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		Дата = ТекущаяДата();
		Ответственный = Пользователи.ТекущийПользователь();
		Утверждающий1 = ПолучитьРуководителяПользователя(Ответственный);
		Комментарий = ДанныеЗаполнения.Комментарий;
		Склад = ДанныеЗаполнения.Склад;
		Исполнитель = ПолучитьИсполнителя(Склад);
		Вид = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересчет");
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.КоличествоУпаковок = ТекСтрокаТовары.КоличествоУпаковок;
			НоваяСтрока.КоличествоУпаковокФакт = ТекСтрокаТовары.КоличествоУпаковокФакт;
			НоваяСтрока.Назначение = ТекСтрокаТовары.Назначение;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Характеристика = ТекСтрокаТовары.Характеристика;
			НоваяСтрока.Отклонение = Документы.ПересчетТоваров.НовыйРасчетОтклонения(ТекСтрокаТовары, ДанныеЗаполнения.НовыйРасчетОтклонения);
			НоваяСтрока.ЯПХ = ТекСтрокаТовары.ЯПХ;
			НоваяСтрока.КоличествоПоУчетуВЗонеХранения = ТекСтрокаТовары.КоличествоПоУчетуВЗонеХранения;
			НоваяСтрока.Основание = ДанныеЗаполнения.Ссылка;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.БлокировкаДвиженияТоваров") Тогда
		Дата = ТекущаяДата();
		Ответственный = Пользователи.ТекущийПользователь();
		Утверждающий1 = ПолучитьРуководителяПользователя(Ответственный);
		Комментарий = ДанныеЗаполнения.Комментарий;
		Склад = ДанныеЗаполнения.Склад;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.КоличествоУпаковок = ТекСтрокаТовары.КоличествоУпаковок;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Характеристика = ТекСтрокаТовары.Характеристика;
			НоваяСтрока.Основание = ДанныеЗаполнения.Ссылка;
			НоваяСтрока.ПричинаБлокировки = ДанныеЗаполнения.ПричинаБлокировки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Товары.Количество() = 0 Тогда
		Сообщить("Табличная часть не заполнена, проведение не возможно!", СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаСчет) Тогда   
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "'За счет' должно быть заполнено, проведение не возможно!";
		Сообщение.Поле = "ЗаСчет";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	
	
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Склад = Справочники.Склады.ПустаяСсылка() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТЧ.Основание КАК Основание
	|ПОМЕСТИТЬ ТЧ_Товары
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БлокировкаДвиженияТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ТЧ_Товары.КоличествоУпаковок - БлокировкаДвиженияТоваровТовары.КоличествоУпаковок КАК ПревышениеКоличества,
	|	БлокировкаДвиженияТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	БлокировкаДвиженияТоваровТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТЧ_Товары КАК ТЧ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.БлокировкаДвиженияТоваров.Товары КАК БлокировкаДвиженияТоваровТовары
	|		ПО ТЧ_Товары.Номенклатура = БлокировкаДвиженияТоваровТовары.Номенклатура
	|			И ТЧ_Товары.Основание = БлокировкаДвиженияТоваровТовары.Ссылка
	|ГДЕ
	|	БлокировкаДвиженияТоваровТовары.КоличествоУпаковок < ТЧ_Товары.КоличествоУпаковок";
	
	Запрос.УстановитьПараметр("ТЧ", Товары);
	//Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()  Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТекстСообщения = "";
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + "Для позиции " + Выборка.Номенклатура + " (номер строки " + Выборка.НомерСтроки + ") количество указано больше, чем в документе основания на " + Выборка.ПревышениеКоличества + " " + Выборка.ЕдиницаИзмерения + Символы.ПС;
		КонецЦикла;
		
		Если ТекстСообщения <> "" Тогда
			Сообщить(ТекстСообщения + "Проведение документа невозможно");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРуководителяПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Отдел.Руководитель.Пользователь КАК Руководитель
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Пользователь = &Пользователь
		|	И НЕ Сотрудники.Уволен";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Руководитель = Выборка.Руководитель;
	КонецЦикла;
	
	Возврат Руководитель;

КонецФункции 

Функция ПолучитьИсполнителя(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятия.БухгалтерПодразделения.Ссылка КАК БухгалтерПодразделения
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО СтруктураПредприятия.СкладПоУмолчанию.Подразделение = Склады.Подразделение
		|ГДЕ
		|	Склады.Ссылка = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.БухгалтерПодразделения;
	КонецЦикла;
	
	Возврат Исполнитель;

КонецФункции

#КонецЕсли          