#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ВремяСохраненияДокументов = Константы.ВремяСохраненияДокументов.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
			
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Элементы.РедактированиеСтрокиНаТСД.Видимость = Ложь;
	
	Если Параметры.Свойство("Склад") Тогда
		Объект.Склад = Параметры.Склад;
	КонецЕсли; 
	
	Если Параметры.Свойство("ДобавитьФотоТовара") Тогда
		ДобавитьФотоТовара = Параметры.ДобавитьФотоТовара; 
		Элементы.ГруппаЗагрузкиФотоТовараСДефектом.Видимость = Параметры.ДобавитьФотоТовара;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Комментарий = "Создан из ТСД: ";
		
		Если Параметры.Свойство("ПричинаБлокировки") Тогда
			Объект.ПричинаБлокировки = Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(Параметры.ПричинаБлокировки, Истина);
		КонецЕсли;
		
		Если Параметры.Свойство("Номенклатура") Тогда
			
			Элементы.РедактированиеДокументаНаТСД.Видимость = Ложь;
			Элементы.РедактированиеСтрокиНаТСД.Видимость = Истина;
			
			Номенклатура = Параметры.Номенклатура;
			Характеристика = "";
			Количество = 1;
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.Количество = Количество;
			НоваяСтрока.Характеристика = Характеристика;
			
			ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();	
			
			Элементы.Товары.ТекущаяСтрока = ТекущаяСтрокаТСД;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ИнициализироватьСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 = Параметр;
			Иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			КонецЕсли;

			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Штрихкод1));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
			
	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
			
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
	ОтключитьСканер();
	 
КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
	ТекущаяСтрока.КоличествоУпаковок = Количество;

КонецПроцедуры

#КонецОбласти


 #Область ОбработчикиСобытийЭлементовТаблицы

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;
  	ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД);
	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Отказ = Истина;

		Элементы.РедактированиеДокументаНаТСД.Видимость = Ложь;
		Элементы.ВыборНоменклатуры.Видимость = Истина;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;	
	ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД);		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатура1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.РедактированиеСтрокиНаТСД.Видимость = Истина;
	Элементы.ВыборНоменклатуры.Видимость = Ложь;   
		
	Номенклатура = "";
	Характеристика = "";
	Количество = 1;

	Номенклатура = Элементы.СписокНоменклатура1.ТекущиеДанные.Ссылка;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Характеристика = Характеристика;
	
	ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();	
		
	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрокаТСД;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоЯчейкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.РедактированиеСтрокиНаТСД.Видимость = Истина;
	Элементы.ВыборНоменклатурыПоЯчейке.Видимость = Ложь;
	
	Номенклатура = "";
	Характеристика = "";
	Количество = 1;

	Номенклатура = Элементы.НоменклатураПоЯчейке.ТекущиеДанные.Ссылка;
   	Характеристика = Элементы.НоменклатураПоЯчейке.ТекущиеДанные.Характеристика;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Характеристика = Характеристика;
	
	ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор();	
		
	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрокаТСД;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВернутьсяКТЧ(Команда)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);			
	ТекущаяСтрока.КоличествоУпаковок = Количество;
	
	Элементы.РедактированиеДокументаНаТСД.Видимость = Истина;
	Элементы.РедактированиеСтрокиНаТСД.Видимость = Ложь; 
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти


 #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		Попытка
			глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
			глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
			глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрикодКамера(Команда) 
	
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод, Результат, Сообщение, ДопПараметры) Экспорт
	
	Если Результат И ЗначениеЗаполнено(Штрихкод) Тогда	
		#Если МобильныйКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		ДанныеСтруктура =  Новый Структура("Штрихкод, Количество", Штрихкод, 1);
		
		Данные = Новый Массив;
		Данные.Добавить(ДанныеСтруктура);		
		
		ОбработатьШтрихкоды(Данные);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов) 
	
	Штрихкод = ДанныеШтрихкодов[0].Штрихкод;
	
	// Штрихкод ячейки
	Если СтрДлина(Штрихкод) > 35   Тогда	
		Если Элементы.РедактированиеДокументаНаТСД.Видимость И НЕ Элементы.РедактированиеСтрокиНаТСД.Видимость Тогда	
			МассивСсылок = СсылкаНаЯчейкуПоШтрихкоду(Штрихкод);	
			// Ячейка найдена
			Если МассивСсылок.Количество() > 0 Тогда
				НайденнаяЯчейка = МассивСсылок[0];		
				ОбработатьОтсканированнуюЯчейку(НайденнаяЯчейка);
			Иначе
				Сообщить("Ячейка не найдена");
			КонецЕсли;
		КонецЕсли;
	Иначе   	
		ОбработатьТоварПоШтрихкоду(ДанныеШтрихкодов);	
	КонецЕсли;        

	ЭтаФорма.ОбновитьОтображениеДанных();   
	
КонецПроцедуры    

&НаКлиенте
Функция СсылкаНаЯчейкуПоШтрихкоду(Штрихкод) 
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Справочник.СкладскиеЯчейки.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры); 
	
КонецФункции

&НаСервере
Процедура ОбработатьОтсканированнуюЯчейку(ОтсканированнаяЯчейка)
	
	Если Ячейка <> ОтсканированнаяЯчейка Тогда 	
		НоменклатураПоЯчейке.Очистить();
		ТоварыПоЯчейке = ПолучитьТоварыПоЯчейке(ОтсканированнаяЯчейка);
		НоменклатураПоЯчейке.Загрузить(ТоварыПоЯчейке);	  
		Ячейка = ОтсканированнаяЯчейка; 
	КонецЕсли;

	Если НоменклатураПоЯчейке.Количество()> 0 Тогда
		Элементы.РедактированиеДокументаНаТСД.Видимость = Ложь; 
		Элементы.РедактированиеСтрокиНаТСД.Видимость = Ложь;
		Элементы.ВыборНоменклатурыПоЯчейке.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры  

&НаСервере
Функция ПолучитьТоварыПоЯчейке(ОтсканированнаяЯчейка);
	
	УстановитьПривилегированныйРежим(Истина);
	Если ОбеспечениеВДокументахСервер.ЭтоПроизводительныйРежим() Тогда  
		ТекстОстатки="
		|ВЫБРАТЬ
		|	ЗапасыИПотребностиОстатки.Номенклатура КАК Ссылка,
		|	ЗапасыИПотребностиОстатки.Номенклатура.Код КАК Код,
		|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(
		|			,
		|			(Номенклатура, Склад) В
		|				(ВЫБРАТЬ
		|					ВТ_Номенклатура.Номенклатура,
		|					ВТ_Номенклатура.Склад
		|				ИЗ
		|					ВТ_Номенклатура КАК ВТ_Номенклатура)) КАК ЗапасыИПотребностиОстатки
		|ГДЕ
		|	ЗапасыИПотребностиОстатки.ВНаличииОстаток > 0";	
	иначе
		ТекстОстатки="
		|ВЫБРАТЬ
		|	РаспределениеЗапасов.Номенклатура КАК Ссылка,
		|	РаспределениеЗапасов.Номенклатура.Код КАК Код,
		|	РаспределениеЗапасов.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
		|ГДЕ
		|	(РаспределениеЗапасов.Номенклатура, РаспределениеЗапасов.Склад) В
		|			(ВЫБРАТЬ
		|				ВТ_Номенклатура.Номенклатура,
		|				ВТ_Номенклатура.Склад
		|			ИЗ
		|				ВТ_Номенклатура КАК ВТ_Номенклатура)
		|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|   И РаспределениеЗапасов.ВНаличии > 0";	
	конецесли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|ГДЕ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка = &Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////"+
	ТекстОстатки;
		
	Запрос.УстановитьПараметр("Ячейка", ОтсканированнаяЯчейка);
	Запрос.УстановитьПараметр("Склад", Объект.Склад); 
	Результат = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	  	
КонецФункции

&НаКлиенте
Процедура ОбработатьТоварПоШтрихкоду(ДанныеШтрихкодов)
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	СтруктураДействий.Штрихкоды = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = Новый Структура;
	СтруктураДействий.ИзменятьКоличество = Истина;
	СтруктураДействий.ТолькоТовары = Истина;

	ОбработатьШтрихкодыСервер(СтруктураДействий, КэшированныеЗначения);
		
	Если СтруктураДействий.ТекущаяСтрока = Неопределено Тогда 
		#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
			КонецЕсли; 
		#КонецЕсли
		Сообщить("Штрихкод не найден!");		
	Иначе	
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока; 
		ТекущаяСтрокаТСД = СтруктураДействий.ТекущаяСтрока;
		ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрокаТСД);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураПараметровДействия,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма, Объект, СтруктураПараметровДействия, КэшированныеЗначения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнениеДанныхГруппыРедактированиеСтрокиНаТСД(ТекущаяСтрока)
	
	ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	Номенклатура = "";
	Характеристика = "";
	Количество = 0;
	АдресКартинки = "";
	
	Если ЭлементСписка <> Неопределено Тогда
		Элементы.РедактированиеДокументаНаТСД.Видимость = Ложь;
		Элементы.РедактированиеСтрокиНаТСД.Видимость = Истина;
		Элементы.ВыборНоменклатурыПоЯчейке.Видимость = Ложь;
		Номенклатура = ЭлементСписка.Номенклатура;
		Характеристика = ЭлементСписка.Характеристика;
		Количество = ЭлементСписка.КоличествоУпаковок;
		ПолучитьАдресКартинки(Номенклатура);
	Конецесли;		
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьАдресКартинки(Номенклатура)
	
	ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ФайлКартинки");
	Если ЗначениеЗаполнено(ФайлКартинки) Тогда
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ЭтотОбъект.УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
	
КонецПроцедуры 


#Область ДобавлениеФото 

&НаКлиенте
Процедура ЗагрузитьФотоТовара(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Данные не записаны!");
		Возврат;
	КонецЕсли; 
		
	Кнопки = КнопкиОповещения();
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСпособДобавленияФото", Этаформа), "Загрузите фото.", Кнопки);
	
КонецПроцедуры

Функция КнопкиОповещения()
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Отмена");
	Кнопки.Добавить("С телефона");
	Кнопки.Добавить("Камера");
	
	Возврат Кнопки;
	
КонецФункции 

&НаКлиенте
Процедура ВыбратьСпособДобавленияФото(РезультатВопроса, ДополнительныеПараметры) Экспорт  
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Если РезультатВопроса = "Камера" Тогда
			СделатьФотоКамерой();
		ИначеЕсли 
			РезультатВопроса = "С телефона" Тогда
			ДобавитьФотоИзГалереи();
		Иначе
			Возврат;
		КонецЕсли; 
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьФотоКамерой()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		ДанныеМультимедиа = Неопределено;
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда	
			ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок(, Новый РазрешениеКамерыУстройства(1920, 2400) , 100, , ТипПодсветкиКамеры.Включена);	
		Иначе    
			Сообщить(НСтр("ru = 'Съемка фото не поддерживается.'", "ru"));
		КонецЕсли; 

		Если ДанныеМультимедиа <> Неопределено Тогда
			ФайлЗаписан = СоздатьНовыйФайл(ДанныеМультимедиа.ПолучитьДвоичныеДанные(), ДанныеМультимедиа.РасширениеФайла);
			Если ФайлЗаписан Тогда  
				ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершение", Этаформа), "Изображение успешно загружено." + Символы.ПС + "Добавить новый снимок?", РежимДиалогаВопрос.ДаНет, 0.1);
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СделатьФотоКамерой();
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФотоИзГалереи()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Фильтр = "Все картинки (*.jpg;*.jpeg;*.tif;*.png)"
		+ "|*.jpg;*.jpeg;*.tif;*.png|";
		Диалог.МножественныйВыбор = Истина;
			
		Если Диалог.Выбрать() Тогда
			МассивФайлов = Диалог.ВыбранныеФайлы;
			Сч = 0;      
			Для Каждого Файл Из МассивФайлов Цикл
				Фото = Новый Файл(Файл);
				Данные = Новый ДвоичныеДанные(Фото.ПолноеИмя);
				ПредставлениеФайла = Фото.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
				РасширениеФайла = СтрРазделить(ПредставлениеФайла, ".");
				Расширение = РасширениеФайла[РасширениеФайла.Количество() - 1];

				ФайлЗаписан = СоздатьНовыйФайл(Данные, Расширение);
				Если ФайлЗаписан Тогда 
					Сч = Сч + 1;
				КонецЕсли;	
			КонецЦикла;
			ПоказатьПредупреждение(, "Загружено " + Сч + " из " + МассивФайлов.Количество() + " файлов", 1);
		КонецЕсли;	
	#КонецЕсли

КонецПроцедуры

&НаСервере
Функция СоздатьНовыйФайл(Данные, Расширение)
	
	Если Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Центральный склад", Истина) Тогда
		ПапкаСклада = "СП ЦБ\";  		
	ИначеЕсли Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад (Барнаул)", Истина) Тогда
		ПапкаСклада = "СП Барнаул\";
	ИначеЕсли Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад (Выбор)", Истина) Тогда
		ПапкаСклада = "СП Выбор\";
	ИначеЕсли Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад (Бийск)", Истина) Тогда	
		ПапкаСклада = "СП Бийск\"; 
	Иначе 
		ПапкаСклада	= "";
	КонецЕсли; 
	
	СчетчикФото = СчетчикФото + 1; 
	Имя = "" + Объект.Номер + " (" + СчетчикФото + ")";

	ИмяФайла = "\\TG-Storage01\Склад\Общие\Отдел качества\" + ПапкаСклада + "Фото брака\" + Имя + ".png";
	
	Объект.Комментарий = Объект.Комментарий + Символы.ПС + ИмяФайла;
	 
    Попытка 
        Данные.Записать(ИмяФайла);  
		Возврат Истина;
    Исключение 
		Ошибка = ИнформацияОбОшибке();
		ПодробнаяОшибка = ПодробноеПредставлениеОшибки(Ошибка);
		Сообщить(ПодробнаяОшибка);
		Возврат Ложь;
    КонецПопытки;

КонецФункции

#КонецОбласти


#КонецОбласти     




