#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ)   
	Если НЕ ЭтоГруппа Тогда
	  Если ЭтоНовый() Тогда
	  	  СсылкаНового = ПолучитьСсылкуНового();
          Если СсылкаНового.Пустая() Тогда
            СсылкаНового = Справочники.СкладскиеЯчейки.ПолучитьСсылку();
            УстановитьСсылкуНового(СсылкаНового);
			СсылкаНового = ПолучитьСсылкуНового();
          КонецЕсли;
        Штрихкод = ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(СсылкаНового);
		Иначе  
		Штрихкод = ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Ссылка);
	  КонецЕсли;
	КонецЕсли;  
//	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
//		ЭтотОбъект.Штрихкод = ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(ЭтотОбъект.Ссылка);
//	КонецЕсли;	
КонецПроцедуры

#КонецЕсли