////////////////////////////////////////////////////////////////////////////////
// Подсистема «Аудит состояния системы».
// Переопределяемые процедуры и функции.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет заполнить описание групп проверок.
// Вызывается при заполнении справочника ПравилаПроверкиУчета.
//
// Параметры:
//	ТаблицаГруппПроверок - см. АудитСостоянияСистемы.ТаблицаГруппПроверокСостоянияСистемы 
//
Процедура ЗаполнитьГруппыПроверокДляРегистрации(ТаблицаГруппПроверок) Экспорт
	//++ Локализация
	
	
	//-- Локализация
КонецПроцедуры

// Позволяет заполнить описание проверок.
// Вызывается при заполнении справочника ПравилаПроверкиУчета.
//
// Параметры:
//	ТаблицаПроверок - см. АудитСостоянияСистемы.ТаблицаПроверокСостоянияСистемы 
//
Процедура ЗаполнитьПроверкиДляРегистрации(ТаблицаПроверок) Экспорт
	//++ Локализация
	
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти
