#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  

&Перед("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Договор");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, ПараметрыЗаписи)	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		И ЗначениеЗаполнено(ДокументОснование.Кассир) = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Запись документа без отметки кассы в документе продажи запрещена.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Отказ И ЗначениеЗаполнено(Ссылка) И Не Проведен И ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Попытка
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда	
				Если Не ПометкаУдаления Тогда                               // Записанный документ проводится
					НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
				КонецЕсли;
			Иначе
				Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда      // Пометка на удаление записанного документа
					Если Не РольДоступна("ПолныеПрава") Тогда
						АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Ложь, Ложь, "Сначала необходимо пометить на удаление следуюшие документы:", Отказ);
			        КонецЕсли;

					Если Не Отказ Тогда
						НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
						Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
							НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Ссылка.ПометкаУдаления И Не ПометкаУдаления Тогда // Пометка на удаление снимается
					НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Истина);
					Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			ВызватьИсключение;
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры


&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		
		КорректировкаНазначения = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Проведен, ПометкаУдаления);	
		
		Если ЗначениеЗаполнено(КорректировкаНазначения) И	
			КорректировкаНазначения.Дата < (Дата + 60) Тогда
			Попытка
				КорректировкаНазначения = КорректировкаНазначения.ПолучитьОбъект();      
				КорректировкаНазначения.Дата = Дата + 60;
				УстановитьПривилегированныйРежим(Истина);
				КорректировкаНазначения.Записать(РежимЗаписиДокумента.Проведение);
				УстановитьПривилегированныйРежим(Ложь);
			Исключение
				ВызватьИсключение;
			КонецПопытки;  
		КонецЕсли;
		
 	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не ЗначениеЗаполнено(ПричинаДляОрганизацииСпр) Тогда
		Сообщить("Не заполнена Причина корректировки! (Вкладка: Дополнительно)");
		Отказ = Истина;
	КонецЕсли;  
	
	Если Не Отказ Тогда
	    СоздатьКорректировкуНазначения(Дата + 60);	
	КонецЕсли; 
	
	Если ЭтотОбъект.Проведен Тогда
		Документы.ЗаявкаВЕГАИСЛес.ПроверкаЕГАИС(ДокументОснование, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Функция ЕстьТоварыКОбособленномуОбеспечению(Назначение,МассивНоменклатуры) 
	
	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбеспечениеЗаказов.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов КАК ОбеспечениеЗаказов
	|ГДЕ
	|	ОбеспечениеЗаказов.Назначение = &Назначение
	|	И ОбеспечениеЗаказов.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Не Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ВидКорректировки=Перечисления.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон;
	Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		Менеджер = ДанныеЗаполнения.ДокументОснование.Менеджер;
		Магазин = ДанныеЗаполнения.ДокументОснование.Магазин; 
		Если Не БонусыАльтерраРезерв.ПолучитьЗначениеРеквизита(ДанныеЗаполнения.ДокументОснование, "ПодразделениеМенеджера") = Ложь 
				и Не БонусыАльтерраРезерв.ПолучитьЗначениеРеквизита(ДанныеЗаполнения.ДокументОснование, "ОтделМенеджера") = Ложь Тогда
			ПодразделениеМенеджера = ДанныеЗаполнения.ДокументОснование.ПодразделениеМенеджера;
			ОтделМенеджера = ДанныеЗаполнения.ДокументОснование.ОтделМенеджера;
		КонецЕсли;

		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование)= Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ
			ТипЗнч(ДанныеЗаполнения.ДокументОснование)= Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ИспользуетсяДоговор=ДанныеЗаполнения.ДокументОснование.ИспользуетсяДоговор;
			Если ИспользуетсяДоговор Тогда
				Договор=ДанныеЗаполнения.ДокументОснование.Договор;
			Иначе
				Договор="";
			КонецЕсли;
			СпособВводаКлиента = ДанныеЗаполнения.ДокументОснование.СпособВводаКлиента;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПодразделениеМенеджера) и Не ЗначениеЗаполнено(ОтделМенеджера)Тогда
		ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Менеджер); 
		ОтделМенеджера = ПолучитьОтделМенеджера(Менеджер);
	КонецЕсли; 

КонецПроцедуры

&Перед("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	Если Не Отказ И ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Попытка
			Если Не РольДоступна("ПолныеПрава") Тогда
				Если ПометкаУдаления Тогда     // Пометка на удаление проведенного документа
					АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Истина, Ложь, "Сначала необходимо пометить на удаление следуюшие документы:", Отказ);
				Иначе                          // Распроведение документа
					АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Истина, Ложь, "Сначала необходимо снять с проведения следуюшие документы:", Отказ);
				КонецЕсли;
			КонецЕсли;
						
			Если Не Отказ Тогда
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Истина, Ложь);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					Если ПометкаУдаления Тогда // Пометка на удаление проведенного документа
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
					Иначе                      // Распроведение документа
						НаличиеКорректировки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения1(Отказ)
	
	АльтерраОбщегоНазначения.КонтрольОтметкиКассы(ЭтотОбъект, Отказ);
	
	РегистрыСведений.СостоянияОтгрузкиНакладных.УдалениеЗаписейВРегистре(ЭтотОбъект); 

КонецПроцедуры

&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.QRкод = "";
КонецПроцедуры

&После("ПередУдалением")
Процедура Док_ПередУдалением(Отказ)
	ДопМодульСервер.ПроверитьНаличиеРасходногоОрдераНаТовары(Ссылка, Отказ);
КонецПроцедуры

Процедура СоздатьКорректировкуНазначения(ДатаКорректировки = '00010101')
	
 УстановитьПривилегированныйРежим(Истина);
	
	Если Не СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(Склад,Дата) Тогда 
		Заказ = Документы.ЗаказКлиента.ПустаяСсылка();
		
		Заказ = ДокументОснование.ЗаказКлиента;
		
		Если Не Заказ = Неопределено Тогда
			Если Не Заказ.Пустая() Тогда
				Назначение = Документы.КорректировкаНазначенияТоваров.НазначениеЗаказа(Заказ);
				
				Если Документы.КорректировкаНазначенияТоваров.ЕстьТоварыКСнятиюРезерва(Назначение) Тогда
					КорректировкаНазначения = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
					
					ОрганизацияЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Организация");
					
					КорректировкаНазначения.Организация = ОрганизацияЗаказа;
					КорректировкаНазначения.Назначение = Назначение;
					КорректировкаНазначения.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
					КорректировкаНазначения.Дата = ?(ДатаКорректировки = '00010101', ТекущаяДатаСеанса(),ДатаКорректировки);
					КорректировкаНазначения.УстановитьНовыйНомер();
					КорректировкаНазначения.Автор = Справочники.Пользователи.НайтиПоНаименованию("Администратор"); 
					КорректировкаНазначения.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					КорректировкаНазначения.Комментарий = "Создана автоматически при создании документа "" " + Ссылка + """";
					
					Для Каждого СтрокаТовара Из Расхождения Цикл
						Если СтрокаТовара.Назначение = Назначение Тогда
							СтрокаПродукция = КорректировкаНазначения.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаПродукция, СтрокаТовара);
						КонецЕсли;
					КонецЦикла;
					
					ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(КорректировкаНазначения, Документы.КорректировкаНазначенияТоваров));
					НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(КорректировкаНазначения, ПараметрыУказанияСерий);
					
					Документы.КорректировкаНазначенияТоваров.ЗаполнитьПоОснованию(Назначение, ОрганизацияЗаказа,КорректировкаНазначения.Ссылка, Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв, КорректировкаНазначения.Товары,);
					Для Каждого Строка Из КорректировкаНазначения.Товары Цикл
						Строка.склад = Склад;
					КонецЦикла;
					Если КорректировкаНазначения.Товары.Количество()>0 Тогда
						КорректировкаНазначения.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
  УстановитьПривилегированныйРежим(Ложь);  
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение.Наименование КАК Отдел
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО (ДополнительныеСведения.Объект = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ДополнительныеСведения.Свойство.Наименование = ""Отделы (Пользователи)""";
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Отдел;
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подразделение;
КонецФункции

#КонецЕсли







