#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТранспортнаяНакладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
						КоллекцияПечатныхФорм,
						"ТранспортнаяНакладная", "Транспортная накладная",
						СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуТранспортнойНакладной(ДанныеПечати, ОбъектыПечати, КомплектыПечати = Неопределено) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТРАНСПОРТНАЯ_НАКЛАДНАЯ";
	
	УстановитьПривилегированныйРежим(Истина);
		ЗаполнитьТабличныйДокументТН(
			ТабличныйДокумент,
			ДанныеПечати,
			ОбъектыПечати,
			КомплектыПечати);
		
	Возврат ТабличныйДокумент;
КонецФункции

Процедура ЗаполнитьТабличныйДокументТН(ТабличныйДокумент, ДанныеПечати, ОбъектыПечати, КомплектыПечати)
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладнойЛогистика.ПФ_MXL_ТранспортнаяНакладная");
	
	ПервыйДокумент = Истина;
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
			
		ПервыйДокумент = Ложь;
				
		ОбластьМакета = Макет.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона");
		
		ОбластьМакетаОборотная = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
		
		СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.ДатаЗаявки,,Данныепечати.БанковскийСчетГрузоотправителя);
		СведенияОВодителе ="";
		СведенияОГрузополучателе=ПолучитьРеквизитыПартнера(ДанныеПечати.Грузополучатель);
		СведенияОПеревозчике=ПолучитьРеквизитыПартнера(ДанныеПечати.ТранспортнаяКомпания);

		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		ОбластьМакета.Параметры.Пункт0_2=Формат(ДанныеПечати.ДатаЗаявки, "ДЛФ=D");
		
		Если ДанныеПечати.Грузополучатель.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
			ОбластьМакета.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ФактическийАдрес");
		Иначе
			ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
		КонецЕсли;
		
		ОбластьМакета.Параметры.Пункт3_1=ДанныеПечати.НаименованиеТовара;
		ОбластьМакета.Параметры.Пункт3_2=ДанныеПечати.Количество;
		ОбластьМакета.Параметры.Пункт3_3=ДанныеПечати.Вес;
		
		Если ДанныеПечати.Грузоотправитель.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ФактическийАдрес");
			ПредставлениеГрузоотправителяРеквизиты = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ФактическийАдрес,НомерСчета,Банк,БИК,КоррСчет");
			
			ОбластьМакета.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
			ПредставлениеГрузоотправителяРеквизиты = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
			
			ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
		
		ОбластьМакета.Параметры.Пункт7_1 = ДанныеПечати.АдресОтправителя;
		ОбластьМакета.Параметры.Пункт6_1 = ДанныеПечати.АдресПогрузки;
		
		ОбластьМакета.Параметры.Пункт6_2= Формат(ДанныеПечати.ДатаПрибытия, "ДЛФ=D");
		
		ОбластьМакета.Параметры.Пункт6_5= ""+ДанныеПечати.Вес+" кг";
		ОбластьМакета.Параметры.Пункт7_5= ""+ДанныеПечати.Вес+" кг";
		
		ОбластьМакета.Параметры.Пункт6_51= ДанныеПечати.Количество;
		ОбластьМакета.Параметры.Пункт7_51= ДанныеПечати.Количество;
		
		ОбластьМакета.Параметры.Пункт9_1= Формат(ДанныеПечати.ДатаЗаявки, "ДЛФ=D");
		ОбластьМакета.Параметры.Пункт9_2= Перевозчик;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		Если ДанныеПечати.ТранспортнаяКомпания.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			ОбластьМакетаОборотная.Параметры.Пункт10_1 = ПредставлениеПеревозчика;
		Иначе
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			ОбластьМакетаОборотная.Параметры.Пункт10_2 = ПредставлениеПеревозчика;
		КонецЕсли;

		ОбластьМакетаОборотная.Параметры.Пункт15_6 = ПредставлениеГрузоотправителяРеквизиты;

		ОбластьМакетаОборотная.Параметры.Пункт16_1 = Грузоотправитель;
		ОбластьМакетаОборотная.Параметры.Пункт16_2 = Перевозчик;
		
		ОбластьМакетаОборотная.Параметры.Пункт15_2 = "Фиксированный";;
		ОбластьМакетаОборотная.Параметры.Пункт16_11 =Формат(ДанныеПечати.ДатаЗаявки, "ДЛФ=D");
		ОбластьМакетаОборотная.Параметры.Пункт16_21 =Формат(ДанныеПечати.ДатаЗаявки, "ДЛФ=D") ;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,"Транспортная накладная");
КонецПроцедуры

Функция ПолучитьРеквизитыПартнера(Партнер)

		Сведения = Новый Структура("Представление, СокращенноеНаименование, ПолноеНаименование, НаименованиеДляПечатныхФорм");

		Сведения.Вставить("Представление", 				 Партнер.Наименование);
        Сведения.Вставить("ПолноеНаименование", 				 Партнер.НаименованиеПолное);
        Сведения.Вставить("Телефоны", 		  ФормированиепечатныхФорм.ПолучитьТелефонИзКонтактнойИнформации(Партнер));
		Сведения.Вставить("ФактическийАдрес", ФормированиепечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(Партнер));

	 Возврат Сведения;

КонецФункции

#КонецЕсли