//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область Узел
//Функция ИнициализацияУзлаМобильногоУстройства(ВходящиеДанные) Экспорт
//	//Иницитруем центральный узел
//	ЭтотУзел = ПланыОбмена.МобильноеПриложениеВодителей.ЭтотУзел();
//	Если ПустаяСтрока(ЭтотУзел.Код) Тогда
//		ЭтотУзелОбъект = ЭтотУзел.ПолучитьОбъект();
//		ЭтотУзелОбъект.Код= "ЦБ";
//		ЭтотУзелОбъект.Наименование= "Центральная база";
//		ЭтотУзелОбъект.Записать();
//	КонецЕсли;
//	
//	НайденыйУзел = ПланыОбмена.МобильноеПриложениеВодителей.НайтиПоРеквизиту("Водитель", ВходящиеДанные.Сотрудник);
//	Если ЗначениеЗаполнено(НайденыйУзел) Тогда
//		НовыйУзел = НайденыйУзел.ПолучитьОбъект();
//	Иначе
//		УИД = Новый УникальныйИдентификатор(ВходящиеДанные.ИдентификаторКлиента);
//		СсылкаНаНовыйУзел = ПланыОбмена.МобильноеПриложениеВодителей.ПолучитьСсылку(УИД);
//		Если СсылкаНаНовыйУзел.ПолучитьОбъект() <> Неопределено Тогда
//			Возврат Неопределено;
//		КонецЕсли;
//		
//		//Создаем узел
//		НовыйУзел= ПланыОбмена.МобильноеПриложениеВодителей.СоздатьУзел();
//		НовыйУзел.УстановитьСсылкуНового(СсылкаНаНовыйУзел);
//	КонецЕсли;
//	
//	НовыйУзел.Код = ВходящиеДанные.ИдентификаторКлиента;
//	НовыйУзел.Наименование = ВходящиеДанные.Сотрудник.Наименование;
//	НовыйУзел.Водитель = ВходящиеДанные.Сотрудник;
//	НовыйУзел.ОперативнаяПамять= ВходящиеДанные.ОперативнаяПамять;
//	НовыйУзел.Процессор = ВходящиеДанные.Процессор;
//	НовыйУзел.ВерсияОС = ВходящиеДанные.ВерсияОС;
//	НовыйУзел.НомерОтправленного = 0;
//	НовыйУзел.НомерПринятого = 0;
//	ДатаВыгрузки = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
//	НовыйУзел.ВыружатьСДаты = ДатаВыгрузки;
//	НовыйУзел.Записать();
//	
//	//Данные= Новый Структура("НаименованиеУзла,ВыружатьСДаты", НовыйУзел.Наименование, НовыйУзел.ВыружатьСДаты);
//	//
//	//Ответ= ОбщийHTTPСервер.ПодготовитьОтвет(Ложь, "Узел обмена успешно создан", Данные);
//	//Возврат Ответ;
//	
//	Возврат НовыйУзел.Ссылка;
//КонецФункции

//Процедура ЗарегестрироватьКОбменуНачальныеДанные(УзелВодителя) Экспорт
//	//ПричиныОтказаВЗаказахНаДоставку
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ПричиныОтказаВЗаказахНаДоставку.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.ПричиныОтказаВЗаказахНаДоставку КАК ПричиныОтказаВЗаказахНаДоставку
//	|ГДЕ
//	|	НЕ ПричиныОтказаВЗаказахНаДоставку.ПометкаУдаления
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗаданиеНаПеревозкуРейс.Ссылка КАК Ссылка
//	|ИЗ
//	|	Документ.ЗаданиеНаПеревозкуРейс КАК ЗаданиеНаПеревозкуРейс
//	|ГДЕ
//	|	ЗаданиеНаПеревозкуРейс.Проведен
//	|	И ЗаданиеНаПеревозкуРейс.Водитель = &Водитель
//	|	И ЗаданиеНаПеревозкуРейс.Дата >= &ДатаВыгрузки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗаданиеНаПеревозкуРейсОснования.Документ КАК Ссылка
//	|ИЗ
//	|	Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
//	|ГДЕ
//	|	ЗаданиеНаПеревозкуРейсОснования.Ссылка.Проведен
//	|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.Дата >= &ДатаВыгрузки
//	|	И ЗаданиеНаПеревозкуРейсОснования.Документ.Проведен
//	|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.Водитель = &Водитель";
//	
//	Запрос.УстановитьПараметр("Водитель", УзелВодителя.Водитель.ФизическоеЛицо);
//	Запрос.УстановитьПараметр("ДатаВыгрузки", УзелВодителя.ВыружатьСДаты);
//	
//	ПакетРезультатов = Запрос.ВыполнитьПакет();
//	
//	Для Каждого Пакет Из ПакетРезультатов Цикл
//		Выборка = Пакет.Выбрать();
//		
//		Пока Выборка.Следующий() Цикл
//			ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, Выборка.Ссылка);
//		КонецЦикла;
//	КонецЦикла;
//КонецПроцедуры

//Функция ПолучитьУзелВодителя(ВодительФизЛицо) Экспорт
//	Водитель= АльтерраОбщегоНазначения.ПолучитьСотрудникаПоФизЛицу(ВодительФизЛицо);
//	Если ЗначениеЗаполнено(Водитель) И Не ПустаяСтрока(Водитель.ИдентификаторМобильногоПриложения) Тогда
//		//УИД= Новый УникальныйИдентификатор(Водитель.ИдентификаторМобильногоПриложения);
//		//УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.ПолучитьСсылку(УИД);
//		
//		УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.НайтиПоРеквизиту("Водитель", Водитель);
//		
//		Возврат УзелВодителя;
//	Иначе 
//		Возврат ПланыОбмена.МобильноеПриложениеВодителей.ПустаяСсылка();
//	КонецЕсли;
//КонецФункции

//Функция ПолучитьУзелВодителяПоИдентификатору(ИдентификаторМобильногоПриложения) Экспорт
//	Если НЕ ПустаяСтрока(ИдентификаторМобильногоПриложения) Тогда
//		УИД= Новый УникальныйИдентификатор(ИдентификаторМобильногоПриложения);
//		УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.ПолучитьСсылку(УИД);
//		
//		Если ЗначениеЗаполнено(УзелВодителя.Водитель) Тогда
//			Возврат УзелВодителя;
//		Иначе 
//			Водитель= Справочники.Сотрудники.НайтиПоРеквизиту("ИдентификаторМобильногоПриложения", ИдентификаторМобильногоПриложения);
//			УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.НайтиПоРеквизиту("Водитель", Водитель);
//			
//			Возврат УзелВодителя;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат ПланыОбмена.МобильноеПриложениеВодителей.ПустаяСсылка();
//КонецФункции

//#КонецОбласти

//#Область РегистрацияИзменений
//Процедура ЗарегистрироватьРейсВОбмене(Объект) Экспорт
//	УстановитьПривилегированныйРежим(Истина);
//	
//	Если ЗначениеЗаполнено(Объект.Водитель) Тогда
//		УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.ПолучитьУзелВодителя(Объект.Водитель);
//		
//		Если ЗначениеЗаполнено(УзелВодителя) Тогда
//			ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, Объект.Ссылка);
//			
//			Для Каждого стрОснования Из Объект.Основания Цикл
//				ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, стрОснования.ЗаказНаДоставку);
//			КонецЦикла;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры
//#КонецОбласти

//#Область Обмен
//Процедура ПринятьПакет1СДанными(ВходящиеДанные, Отказ) Экспорт
//	ЕстьОшибки= Ложь;
//	УзелВодителя= ПолучитьУзелВодителяПоИдентификатору(ВходящиеДанные.ИдентификаторКлиента);
//	ВодительФизЛицо= УзелВодителя.Водитель.ФизическоеЛицо;
//	Водитель= УзелВодителя.Водитель;
//	
//	//Удаляем регистрацию по номеру принятого у водителя
//	ПланыОбмена.УдалитьРегистрациюИзменений(УзелВодителя, ВходящиеДанные.НомерПринятого);
//	
//	//ВерсияПриложения = ВходящиеДанные.Версия;
//	ВерсияПриложения = 0;
//	
//	//Рейсы
//	Для Каждого Рейс Из ВходящиеДанные.Рейсы Цикл
//		Попытка
//			УИД = Новый УникальныйИдентификатор(Рейс.Ссылка);
//			РейсЦБ = Документы.ЗаданиеНаПеревозкуРейс.ПолучитьСсылку(УИД);
//			РейсЦБОбъект = РейсЦБ.ПолучитьОбъект();
//			
//			//Если РейсЦБОбъект <> Неопределено Тогда
//			//убрать эту проверку на статус и дату, когда будет выпущена новая версия мобильного приложения
//			МассивИзменяемыхСтатусов = Новый Массив;
//			МассивИзменяемыхСтатусов.Добавить(Перечисления.СтатусыРейсов.ТСНаПогрузке);
//			МассивИзменяемыхСтатусов.Добавить(Перечисления.СтатусыРейсов.ТСВПути);
//			НовыйСтатус = Перечисления.СтатусыРейсов[Рейс.Статус]; 
//			
//			Если НовыйСтатус <> РейсЦБОбъект.Статус И МассивИзменяемыхСтатусов.Найти(РейсЦБОбъект.Статус)<>Неопределено Тогда 
//				РейсЦБОбъект.Статус = НовыйСтатус;
//				РейсЦБОбъект.Доставлен = Рейс.Доставлен;
//				
//				//ОбновлениеИнформационнойБазы.ЗаписатьДанные(РейсЦБОбъект);
//				РейсЦБОбъект.Записать();
//			КонецЕсли;
//			//Иначе
//			//	ЕстьОшибки= Истина;
//			//	ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось найти Рейс: "+Рейс.Ссылка);
//			//КонецЕсли;
//		Исключение
//			ЕстьОшибки= Истина;
//			Текст= "Не удалось записать "+Строка(РейсЦБ)  + " //Версия: " + ВерсияПриложения;
//			ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Водитель, Текст, ИнформацияОбОшибке().Описание);
//		КонецПопытки;
//	КонецЦикла;
//	
//	//Заказы на доставку
//	Для Каждого ЗаказНаДоставку Из ВходящиеДанные.ЗаказыНаДоставку Цикл
//		Попытка
//			УИД = Новый УникальныйИдентификатор(ЗаказНаДоставку.Ссылка);
//			ЗаказНаДоставкуЦБ= Документы.ЗаказНаДоставкуКлиенту.ПолучитьСсылку(УИД);
//			ЗаказНаДоставкуЦБОбъект= ЗаказНаДоставкуЦБ.ПолучитьОбъект();
//			
//			//Если ЗаказНаДоставкуЦБОбъект <> Неопределено Тогда
//			//убрать эту проверку на статус и дату, когда будет выпущена новая версия мобильного приложения
//			МассивИзменяемыхСтатусов = Новый Массив;
//			МассивИзменяемыхСтатусов.Добавить(Перечисления.СтатусыЗаказовНаДоставку.Ожидает);
//			МассивИзменяемыхСтатусов.Добавить(Перечисления.СтатусыЗаказовНаДоставку.ВРейсе);
//			
//			
//			Если ЗаказНаДоставкуЦБОбъект.ДатаПрибытия <> ЗаказНаДоставку.ДатаПрибытия И МассивИзменяемыхСтатусов.Найти(ЗаказНаДоставкуЦБОбъект.Статус)<>Неопределено Тогда
//				ЗаказНаДоставкуЦБОбъект.ДатаПрибытия= ЗаказНаДоставку.ДатаПрибытия;
//				Если Не ПустаяСтрока(ЗаказНаДоставку.Статус) Тогда
//					ЗаказНаДоставкуЦБОбъект.Статус= Перечисления.СтатусыЗаказовНаДоставку[ЗаказНаДоставку.Статус];
//				КонецЕсли;
//				Если Не ПустаяСтрока(ЗаказНаДоставку.ОценкаКачестваДоставки) Тогда
//					ЗаказНаДоставкуЦБОбъект.ОценкаКачестваДоставки= Перечисления.ОценкиКлиентов[ЗаказНаДоставку.ОценкаКачестваДоставки];
//				КонецЕсли;
//				//откомментировать, когда обновится приложение
//				Если Не ПустаяСтрока(ЗаказНаДоставку.Сдача) И Число(ЗаказНаДоставку.Сдача)>0 И ЗаказНаДоставкуЦБОбъект.Сдача=0 Тогда
//					ЗаказНаДоставкуЦБОбъект.Сдача = Число(ЗаказНаДоставку.Сдача);
//				КонецЕсли;
//				
//				//ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗаказНаДоставкуЦБОбъект);
//				ЗаказНаДоставкуЦБОбъект.Записать();
//				
//			КонецЕсли;
//			//Иначе
//			//	ЕстьОшибки= Истина;
//			//	ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось найти Рейс: "+Рейс.Ссылка);
//			//КонецЕсли;
//		Исключение
//			ЕстьОшибки= Истина;
//			Текст= "Не удалось записать "+Строка(ЗаказНаДоставкуЦБ)  + " //Версия: " + ВерсияПриложения;
//			ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Водитель, Текст, ИнформацияОбОшибке().Описание);
//		КонецПопытки;
//		
//		Если ЗаказНаДоставку.Статус = "ОтказЧастичный" ИЛИ ЗаказНаДоставку.Статус = "ОтказПолный" Тогда
//			Если ЗаказНаДоставку.Свойство("ПричинаОтказа") И ЗаказНаДоставку.ПричинаОтказа <> "0" Тогда 
//				СоздатьОбращениеКлиента(ЗаказНаДоставку);
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	
//	//Журнал ошибок
//	Если ВходящиеДанные.ЖурналОшибок.Количество() > 0 Тогда
//		Для Каждого Ошибка Из ВходящиеДанные.ЖурналОшибок Цикл
//			Попытка
//				ТипСообщения= Перечисления.ТипыСообщенийМобильногоПриложения[Ошибка.ТипСообщения];
//				
//				Запись= РегистрыСведений.ЖурналРаботыМобильногоУстройства.СоздатьМенеджерЗаписи();
//				ЗаполнитьЗначенияСвойств(Запись, Ошибка);
//				Запись.ТипСообщения= ТипСообщения;
//				Запись.Сотрудник= Водитель;
//				
//				Запись.Прочитать();
//				Если Не Запись.Выбран() Тогда
//					ЗаполнитьЗначенияСвойств(Запись, Ошибка);
//					Запись.ТипСообщения= ТипСообщения;
//					Запись.Сотрудник= Водитель;
//					Попытка
//						Запись.Записать(Ложь);
//					Исключение
//						ЕстьОшибки= Истина;
//						ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей",
//												УровеньЖурналаРегистрации.Ошибка,
//												,
//												ИнформацияОбОшибке().Описание,
//												"Ошибка при записи в Журнала работы: "+Ошибка.Текст  + " //Версия: " + ВерсияПриложения);
//					КонецПопытки;
//				КонецЕсли;
//			Исключение
//				ЕстьОшибки= Истина;
//				Текст= "Не удалось записать ошибку: "+Ошибка.Текст  + " //Версия: " + ВерсияПриложения;
//				ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Водитель, Текст, ИнформацияОбОшибке().Описание);
//			КонецПопытки;		
//		КонецЦикла;
//	КонецЕсли;
//	
//	//СтатусыВодителей
//	Если ВходящиеДанные.СтатусыВодителей.Количество() > 0 Тогда
//		ВходящаяЗапись = ВходящиеДанные.СтатусыВодителей[0];
//		
//		СтруктураСтатусов = АльтерраОбщегоНазначения.ПолучитьСтруктуруСтатусаВодителя(Водитель);
//		Если ВходящаяЗапись.Дата > СтруктураСтатусов.Дата Тогда
//			
//			НаборЗаписей = РегистрыСведений.СтатусыВодителей.СоздатьНаборЗаписей();
//			НаборЗаписей.Отбор.Водитель.Установить(ВодительФизЛицо);
//			
//			Запись = НаборЗаписей.Добавить();
//			
//			ЗаполнитьЗначенияСвойств(Запись, ВходящаяЗапись);
//			
//			Запись.Статус = Перечисления.СтатусыВодителей[ВходящаяЗапись.Статус];
//			Запись.Водитель = ВодительФизЛицо;
//			Запись.Автор = Пользователи.ТекущийПользователь();
//			Запись.Комментарий = "Обмен с мобильным устройством";
//			
//			Попытка
//				НаборЗаписей.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
//				НаборЗаписей.Записать(Истина);
//			Исключение
//				ЕстьОшибки = Истина;
//				Текст = "Ошибка при записи статуса водителя: "+УзелВодителя.Водитель + " //Версия: " + ВерсияПриложения;
//				ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Водитель, Текст, ИнформацияОбОшибке().Описание);
//			КонецПопытки;
//		КонецЕсли;
//	КонецЕсли;
//	
//	//ИсторияДвижения
//	Если ВходящиеДанные.ИсторияДвижения.Количество() > 0 Тогда
//		НаборЗаписей = РегистрыСведений.ИсторияДвижения.СоздатьНаборЗаписей();
//		Для Каждого Координаты Из ВходящиеДанные.ИсторияДвижения Цикл
//			Запись = РегистрыСведений.ИсторияДвижения.СоздатьМенеджерЗаписи();
//			ЗаполнитьЗначенияСвойств(Запись, Координаты);
//			Запись.Водитель= Водитель;
//			
//			УИД = Новый УникальныйИдентификатор(Координаты.Рейс);
//			РейсЦБ = Документы.ЗаданиеНаПеревозкуРейс.ПолучитьСсылку(УИД);
//			Запись.Рейс = РейсЦБ;
//			
//			Запись.Прочитать();
//			Если Не Запись.Выбран() Тогда
//				ЗаполнитьЗначенияСвойств(Запись, Координаты);
//				Запись.Водитель= Водитель;
//				Запись.Рейс= РейсЦБ;
//				Попытка
//					Запись.Записать(Ложь);
//				Исключение
//					ЕстьОшибки= Истина;
//					Текст= "Ошибка при записи координат водителя: "+УзелВодителя.Водитель + " //Версия: " + ВерсияПриложения;
//					ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Водитель, Текст, ИнформацияОбОшибке().Описание);
//				КонецПопытки;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	
//	
//	Если Не ЕстьОшибки Тогда
//		ПланыОбмена.МобильноеПриложениеВодителей.ЗаписатьНомерПринятого(УзелВодителя, ВходящиеДанные.НомерОтправленного);
//	КонецЕсли;
//	
//КонецПроцедуры

//Функция ПодготовитьПакет1СКОтправке(ИдентификаторМобильногоПриложения, Отказ) Экспорт
//	Данные= ПолучитьШаблонСтруктурыДанных();
//	
//	ДанныеОтправки= Неопределено;
//	
//	УзелВодителя= ПолучитьУзелВодителяПоИдентификатору(ИдентификаторМобильногоПриложения);
//	Если УзелВодителя.Пустая() Тогда
//		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , "Нет центрального узла");
//		Отказ= Истина;
//		
//		Возврат Данные;
//	КонецЕсли;
//	
//	НомерСообщения= УзелВодителя.НомерОтправленного+1;
//	Данные.Вставить("НомерОтправленного", НомерСообщения);
//	Данные.Вставить("НомерПринятого", УзелВодителя.НомерПринятого);
//	
//	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелВодителя, НомерСообщения);
//	Пока ВыборкаИзменений.Следующий() Цикл
//		ОбъектОбмена = ВыборкаИзменений.Получить();
//		ТипОбъект= ТипЗнч(ОбъектОбмена);
//		УдалитьЭтотОбъект = НужноЛиУдалятьОбъект(ОбъектОбмена, УзелВодителя.Водитель);  //булево, флажок
//		//ПричиныОтказаВЗаказахНаДоставку
//		Если ТипОбъект = Тип("СправочникОбъект.ПричиныОтказаВЗаказахНаДоставку") Тогда
//			СтруктураОбъекта= Новый Структура();
//			СтруктураОбъекта.Вставить("Ссылка", XMLСтрока(ОбъектОбмена.Ссылка));
//			СтруктураОбъекта.Вставить("Код", XMLСтрока(ОбъектОбмена.Код));
//			СтруктураОбъекта.Вставить("Наименование", XMLСтрока(ОбъектОбмена.Наименование));
//			
//			Данные.ПричиныОтказа.Добавить(СтруктураОбъекта);
//			
//			//ЗаказНаДоставкуКлиенту	
//		ИначеЕсли ТипОбъект = Тип("ДокументОбъект.ЗаказНаДоставкуКлиенту") Тогда
//			СтруктураОбъекта= Новый Структура();
//			СтруктураОбъекта.Вставить("Ссылка", XMLСтрока(ОбъектОбмена.Ссылка));
//			СтруктураОбъекта.Вставить("Номер", XMLСтрока(ОбъектОбмена.Номер));
//			СтруктураОбъекта.Вставить("Дата", XMLСтрока(ОбъектОбмена.Дата));
//			СтруктураОбъекта.Вставить("ПрибытиеНаОтгрузку", ОбъектОбмена.ПрибытиеНаОтгрузку);
//			СтруктураОбъекта.Вставить("ВремяДоставкиПо", XMLСтрока(ОбъектОбмена.ВремяДоставкиПо));
//			СтруктураОбъекта.Вставить("Статус", XMLСтрока(ОбъектОбмена.Статус));
//			СтруктураОбъекта.Вставить("ЭкспрессДоставка", XMLСтрока(ОбъектОбмена.ЭкспрессДоставка));
//			СтруктураОбъекта.Вставить("ДоставкаСРазгрузкой", XMLСтрока(ОбъектОбмена.ДоставкаСРазгрузкой));
//			СтруктураОбъекта.Вставить("Вес", ОбъектОбмена.Вес);
//			СтруктураОбъекта.Вставить("Объем", ОбъектОбмена.Объем);
//			СтруктураОбъекта.Вставить("Инкассация", ОбъектОбмена.Инкассация);
//			СтруктураОбъекта.Вставить("Широта", ОбъектОбмена.Широта);
//			СтруктураОбъекта.Вставить("Долгота", ОбъектОбмена.Долгота);
//			СтруктураОбъекта.Вставить("ФИОКлиента", XMLСтрока(ОбъектОбмена.ФИОКлиента));
//			СтруктураОбъекта.Вставить("АдресДоставки", XMLСтрока(ОбъектОбмена.АдресДоставки));
//			СтруктураОбъекта.Вставить("КороткийАдрес", АльтерраОбщегоНазначения.ПолучитьКороткийАдрес(ОбъектОбмена.АдресДоставки));
//			СтруктураОбъекта.Вставить("ДатаПрибытия", XMLСтрока(ОбъектОбмена.ДатаПрибытия));
//			СтруктураОбъекта.Вставить("НужнаИнкассация", XMLСтрока(ОбъектОбмена.НужнаИнкассация));
//			СтруктураОбъекта.Вставить("ТелефонКлиентаНаВыгрузке", XMLСтрока(ОбъектОбмена.ТелефонКлиентаНаВыгрузке));
//			СтруктураОбъекта.Вставить("ОценкаКачестваДоставки", XMLСтрока(ОбъектОбмена.ОценкаКачестваДоставки));
//			
//			Если ТипЗнч(ОбъектОбмена.Партнер) = Тип("СправочникСсылка.Партнеры") И ЗначениеЗаполнено(ОбъектОбмена.Партнер.ОсновнойМенеджер) Тогда
//				Менеджер= ОбъектОбмена.Партнер.ОсновнойМенеджер.Наименование;
//				ТелефонМенеджера= АльтерраОбщегоНазначения.ПолучитьТелефонПоВиду(ОбъектОбмена.Партнер.ОсновнойМенеджер, "ТелефонПользователя");
//			Иначе
//				Менеджер= "";
//				ТелефонМенеджера= "";
//			КонецЕсли;
//			СтруктураОбъекта.Вставить("Менеджер", Менеджер);
//			СтруктураОбъекта.Вставить("ТелефонМенеджера", Строка(ТелефонМенеджера));
//			СтруктураОбъекта.Вставить("Комментарий", XMLСтрока(ОбъектОбмена.Комментарий));
//			СтруктураОбъекта.Вставить("ОплатаБанковскойКартой", XMLСтрока(ОбъектОбмена.ОплатаБанковскойКартой));
//			СтруктураОбъекта.Вставить("Интервал", "с "+Формат(ОбъектОбмена.ВремяДоставкиС, "ДФ=ЧЧ:мм")+" по "+Формат(ОбъектОбмена.ВремяДоставкиПо, "ДФ=ЧЧ:мм"));
//			СтруктураОбъекта.Вставить("НомераДокПродажи", Документы.ЗаказНаДоставкуКлиенту.ПолучитьНомераОснований(ОбъектОбмена.Ссылка));
//			
//			мТоваров= Новый Массив;
//			ВыборкаТовара= Документы.ЗаказНаДоставкуКлиенту.ПолучитьТоварОснований(ОбъектОбмена.Основания.ВыгрузитьКолонку("Документ"));
//			Пока ВыборкаТовара.Следующий() Цикл
//				Товар= Новый Структура("Номенклатура,Количество,Цена,Сумма");
//				ЗаполнитьЗначенияСвойств(Товар, ВыборкаТовара);
//				Товар.Номенклатура= ВыборкаТовара.Номенклатура.Наименование;
//				
//				мТоваров.Добавить(Товар);
//			КонецЦикла;
//			СтруктураОбъекта.Вставить("Товары", мТоваров );
//			
//			мОснований= Новый Массив;
//			мДокументовПродажи= Документы.ЗаказНаДоставкуКлиенту.ПолучитьДокументыПродажи(ОбъектОбмена.Ссылка);
//			Для Каждого ДокПродажи Из мДокументовПродажи Цикл
//				струкДокПродажи= Новый Структура("СсылкаДокПродажи,Номер,Дата,ВидДокумента,СуммаДокумента");
//				ЗаполнитьЗначенияСвойств(струкДокПродажи, ДокПродажи);
//				струкДокПродажи.СсылкаДокПродажи= XMLСтрока(ДокПродажи.Ссылка);
//				
//				Тип= Строка(ТипЗнч(ДокПродажи));
//				мТип= СтрРазделить(Тип, " ", Ложь);
//				Если мТип.Количество() > 0 Тогда 
//					струкДокПродажи.ВидДокумента= мТип[0];
//				КонецЕсли;
//				мОснований.Добавить(струкДокПродажи);
//			КонецЦикла;
//			СтруктураОбъекта.Вставить("Основания", мОснований );
//			
//			Если УдалитьЭтотОбъект Тогда
//				Данные.УдалитьОбъекты.Добавить(СтруктураОбъекта);
//			Иначе
//				Данные.ЗаказыНаДоставку.Добавить(СтруктураОбъекта);
//			КонецЕсли;
//			//ЗаданиеНаПеревозкуРейс	
//		ИначеЕсли ТипОбъект = Тип("ДокументОбъект.ЗаданиеНаПеревозкуРейс") Тогда
//			СтруктураОбъекта= Новый Структура();
//			СтруктураОбъекта.Вставить("Ссылка", XMLСтрока(ОбъектОбмена.Ссылка));
//			СтруктураОбъекта.Вставить("ПометкаУдаления", XMLСтрока(ОбъектОбмена.ПометкаУдаления));
//			СтруктураОбъекта.Вставить("Номер", XMLСтрока(ОбъектОбмена.Номер));
//			СтруктураОбъекта.Вставить("Дата", XMLСтрока(ОбъектОбмена.Дата));
//			СтруктураОбъекта.Вставить("Подразделение", ОбъектОбмена.Подразделение.Наименование);
//			СтруктураОбъекта.Вставить("ВремяВыезда", ОбъектОбмена.ВремяВыезда);
//			СтруктураОбъекта.Вставить("НачалоРазгрузки", ОбъектОбмена.НачалоРазгрузки);
//			СтруктураОбъекта.Вставить("Водитель", ОбъектОбмена.Водитель.Наименование);
//			СтруктураОбъекта.Вставить("Вес", ОбъектОбмена.Вес);
//			СтруктураОбъекта.Вставить("Объем", ОбъектОбмена.Объем);
//			СтруктураОбъекта.Вставить("МаксимальнаяДлина", ОбъектОбмена.МаксимальнаяДлина);
//			СтруктураОбъекта.Вставить("ОплатаВодителю", ОбъектОбмена.ОплатаВодителю);
//			СтруктураОбъекта.Вставить("Компенсация", ОбъектОбмена.Компенсация);
//			СтруктураОбъекта.Вставить("ОплатаВодителюСНДС", ОбъектОбмена.ОплатаВодителюСНДС);
//			СтруктураОбъекта.Вставить("КомпенсацияСНДС", ОбъектОбмена.КомпенсацияСНДС);
//			СтруктураОбъекта.Вставить("Статус", XMLСтрока(ОбъектОбмена.Статус));
//			СтруктураОбъекта.Вставить("Доставлен", XMLСтрока(ОбъектОбмена.Доставлен));
//			
//			мОснований= Новый Массив;
//			Для Каждого стрОснования Из ОбъектОбмена.Основания Цикл
//				мОснований.Добавить(XMLСтрока(стрОснования.Документ.Ссылка));
//			КонецЦикла;
//			СтруктураОбъекта.Вставить("Основания", мОснований);
//			
//			Если УдалитьЭтотОбъект Тогда
//				Данные.УдалитьОбъекты.Добавить(СтруктураОбъекта);
//			Иначе
//				Данные.Рейсы.Добавить(СтруктураОбъекта);
//			КонецЕсли;	
//			//СтатусыВодителей
//		ИначеЕсли ТипОбъект = Тип("РегистрСведенийНаборЗаписей.СтатусыВодителей") Тогда
//			Если ОбъектОбмена.Количество() > 0 Тогда
//				Запись= ОбъектОбмена[0];
//				СтруктураОбъекта= Новый Структура();
//				СтруктураОбъекта.Вставить("Рейс", XMLСтрока(Запись.Рейс));
//				СтруктураОбъекта.Вставить("Статус", XMLСтрока(Запись.Статус));
//				СтруктураОбъекта.Вставить("Дата", XMLСтрока(Запись.Дата));
//				
//				Данные.СтатусыВодителей.Добавить(СтруктураОбъекта);
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	
//	//Константы
//	Данные.Константы.Вставить("Подразделение", УзелВодителя.Водитель.Подразделение.Наименование);
//	Данные.Константы.Вставить("Водитель", УзелВодителя.Водитель.Наименование);
//	Данные.Константы.Вставить("РасстояниеДоФилиала", Константы.РасстояниеДоФилиала.Получить());
//	Данные.Константы.Вставить("РасстояниеДоКлиента", Константы.РасстояниеДоКлиента.Получить());
//	Данные.Константы.Вставить("ВключитьЖурналРаботыМобильногоПриложения", Константы.ВключитьЖурналРаботыМобильногоПриложения.Получить());
//	Данные.Константы.Вставить("ВерсияКонфигурацииМобильногоПриложения", Константы.ВерсияКонфигурацииМобильногоПриложения.Получить());
//	Данные.Константы.Вставить("ИспользоватьРежимОплатВМобильномПриложенииВодителей", Константы.ИспользоватьРежимОплатВМобильномПриложенииВодителей.Получить());
//	
//	ПланыОбмена.МобильноеПриложениеВодителей.ЗаписатьНомерОтправленого(УзелВодителя, НомерСообщения);
//	
//	Возврат Данные;
//КонецФункции
//#КонецОбласти

//#Область Вспомогательные
////Не использую
//Процедура ОчиститьРегистрацию(ВходящиеДанные, Отказ) Экспорт
//	УзелВодителя= ПолучитьУзелВодителяПоИдентификатору(ВходящиеДанные.ИдентификаторМобильногоПриложения);
//	Если УзелВодителя.Пустая() Тогда
//		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , "Нет центрального узла");
//		Отказ= Истина;
//		
//		Возврат;
//	КонецЕсли;
//	
//	ПланыОбмена.УдалитьРегистрациюИзменений(УзелВодителя, ВходящиеДанные.НомерСообщения);
//КонецПроцедуры

//Функция ПолучитьШаблонСтруктурыДанных() Экспорт
//	Данные= Новый Структура();
//	Данные.Вставить("Рейсы", Новый Массив);
//	Данные.Вставить("ЗаказыНаДоставку", Новый Массив);
//	Данные.Вставить("Сообщения", Новый Массив);
//	Данные.Вставить("ПричиныОтказа", Новый Массив);
//	Данные.Вставить("Константы", Новый Структура);
//	Данные.Вставить("СтатусыВодителей", Новый Массив);
//	
//	Данные.Вставить("УдалитьОбъекты", Новый Массив);
//	
//	Возврат Данные;
//КонецФункции

////не использую
//Функция ПодготовитьXMLПакетКОтправке(ИдентификаторМобильногоПриложения, Отказ) Экспорт
//	Данные= Новый Структура;
//	
//	ДанныеОтправки= Неопределено;
//	
//	УзелОбмена= ПолучитьУзелВодителяПоИдентификатору(ИдентификаторМобильногоПриложения);
//	Если УзелОбмена.Пустая() Тогда
//		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , "Нет центрального узла");
//		Отказ= Истина;
//		
//		Возврат Данные;
//	КонецЕсли;
//	
//	ЗаписьXML = Новый ЗаписьXML;
//	ЗаписьXML.УстановитьСтроку();
//	
//	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
//	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
//	
//	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
//	Пока ВыборкаИзменений.Следующий() Цикл
//		ОбъектОбменаУзел = ВыборкаИзменений.Получить();
//		ЗаписатьXML(ЗаписьXML, ОбъектОбменаУзел);
//	КонецЦикла; 
//	
//	ЗаписьСообщения.ЗакончитьЗапись();
//	
//	Данные.Вставить("ПакетXML", ЗаписьXML.Закрыть());
//	
//	Возврат Данные;
//КонецФункции

//Функция НужноЛиУдалятьОбъект(ОбъектПроверки, Водитель)
//	
//	Если ТипЗнч(ОбъектПроверки) = Тип("ДокументОбъект.ЗаданиеНаПеревозкуРейс") //ИЛИ 
//		//ТипЗнч(ОбъектПроверки) = Тип("ДокументОбъект.ЗаказНаДоставкуКлиенту") 
//		Тогда
//		
//		Если ОбъектПроверки.ПометкаУдаления Тогда
//			Возврат Истина;
//		КонецЕсли;
//		
//		//условие на водителя и шаг назад
//		Если ТипЗнч(ОбъектПроверки) = Тип("ДокументОбъект.ЗаданиеНаПеревозкуРейс") Тогда
//			Если  ОбъектПроверки.Водитель<>Водитель.ФизическоеЛицо Тогда
//				Возврат Истина;
//			КонецЕсли;
//		Иначе
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ЗаданиеНаПеревозкуРейсОснования.Ссылка КАК Ссылка,
//			|	ЗаданиеНаПеревозкуРейсОснования.Документ КАК Документ,
//			|	ЗаданиеНаПеревозкуРейсОснования.Ссылка.Водитель КАК Водитель
//			|ИЗ
//			|	Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
//			|		ПО ЗаданиеНаПеревозкуРейсОснования.Документ = ЗаказНаДоставкуКлиенту.Ссылка
//			|ГДЕ
//			|	ЗаказНаДоставкуКлиенту.Ссылка = &Ссылка
//			|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.Водитель <> &Водитель
//			|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.ПометкаУдаления = Ложь
//			|
//			|ОБЪЕДИНИТЬ ВСЕ
//			|
//			|ВЫБРАТЬ
//			|	ЗаданиеНаПеревозкуРейсОснования.Ссылка,
//			|	ЗаданиеНаПеревозкуРейсОснования.Документ,
//			|	ЗаданиеНаПеревозкуРейсОснования.Ссылка.Водитель
//			|ИЗ
//			|	Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
//			|		ПО ЗаданиеНаПеревозкуРейсОснования.Документ = ЗаказНаДоставкуКлиенту.Ссылка
//			|ГДЕ
//			|	ЗаказНаДоставкуКлиенту.Ссылка = &Ссылка
//			|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.Водитель = &Водитель
//			|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.Статус В(&СписокСтатусов)
//			|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.ПометкаУдаления = ИСТИНА";
//			Запрос.УстановитьПараметр("Ссылка", ОбъектПроверки.Ссылка); 
//			Запрос.УстановитьПараметр("Водитель", Водитель); 
//			МассивСтатусов = Новый Массив;
//			МассивСтатусов.Добавить(Перечисления.СтатусыРейсов.ТСНеНайдено);
//			МассивСтатусов.Добавить(Перечисления.СтатусыРейсов.ПредварительнаяКомплектация);
//			МассивСтатусов.Добавить(Перечисления.СтатусыРейсов.РейсСогласованПоискТС);
//			Запрос.УстановитьПараметр("СписокСтатусов", МассивСтатусов); 
//			РезультатЗапроса = Запрос.Выполнить();
//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//				Возврат Истина;
//			КонецЦикла;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат Ложь;
//КонецФункции // НужноЛиУдалятьОбъект()


//Процедура ЗаписатьНомерОтправленого(УзелОбмена, НомерСообщения) Экспорт
//	УзелОбменаОбъект= УзелОбмена.ПолучитьОбъект();
//	УзелОбменаОбъект.НомерОтправленного= НомерСообщения;
//	УзелОбменаОбъект.Записать();
//КонецПроцедуры

//Процедура ЗаписатьНомерПринятого(УзелОбмена, НомерСообщения) Экспорт
//	УзелОбменаОбъект= УзелОбмена.ПолучитьОбъект();
//	УзелОбменаОбъект.НомерПринятого= НомерСообщения;
//	УзелОбменаОбъект.Записать();
//КонецПроцедуры

//Процедура СоздатьОбращениеКлиента(Заказ)
//	
//	СтруктураДанных = ОбработатьДанныеОбращенияПоЗаказуНаДоставку(Заказ);
//	Заказ = СтруктураДанных.ЗаказСсылка;
//	НайтиЗаказ = ПолучитьСсылкуПоЗаказу(Заказ);
//	
//	Если НайтиЗаказ Тогда
//		Возврат;
//	КонецЕсли;
//	
//	//Содержание
//	Товары = "";
//	Для каждого Стр Из СтруктураДанных.Товары Цикл
//		Товары = Товары + Стр.Номенклатура + " " + Стр.Количество + " шт." + Символы.ПС; 
//	КонецЦикла;
//	Содержание = СтруктураДанных.Статус + Символы.ПС
//				+СтруктураДанных.ПричинаОтказа + Символы.ПС
//				+?(Товары = "", "", "Товары: " + Символы.ПС + Товары)
//				+СтруктураДанных.МестонахождениеТовара+ Символы.ПС
//				+ "Комментарий водителя: " + СтруктураДанных.КомментарийВодителя;
//	
//	ДокДата = ТекущаяДата();
//	 
//	
//	ДокОбращение = Документы.ОбращениеКлиента.СоздатьДокумент();
//	ДокОбращение.Заполнить(Заказ);
//	ДокОбращение.Дата = ДокДата;	
//	ДокОбращение.ВидОбращения = Перечисления.ВидыОбращений.Жалоба;
//	ДокОбращение.ВидЖалобы = Справочники.ВидыОбращенийКлиентов.НайтиПоНаименованию("Жалоба на товар");
//	ДокОбращение.ТипОбращения = Справочники.ТипыОбращенийКлиентов.НайтиПоНаименованию("Доставка");
//	ДокОбращение.ИнициаторОбращения = Строка(ДокОбращение.Водитель);
//	ДокОбращение.ОтветственныйЗаРешение = ПолучитьОтветственного(ДокОбращение.Перевозчик, ДокОбращение.Подразделение);
//	ДокОбращение.ИсточникОбращения = Справочники.ИсточникиОбращенийКлиентов.НайтиПоНаименованию("Мобильное приложение");
//	ДокОбращение.ДатаПроблемнойСитуации = ДокДата;
//	ДокОбращение.Содержание = Содержание;
//	
//	Для каждого Файл Из СтруктураДанных.Файлы Цикл
//		ВременныйФайл = ПолучитьИмяВременногоФайла("jpg");
//		Файл.Записать(ВременныйФайл);
//		СозданныйФайл = РаботаСФайлами.ДобавитьФайлСДиска(Справочники.ПапкиФайлов.НайтиПоНаименованию("Логистика"), ВременныйФайл);
//		
//		НовыйФайл = ДокОбращение.ПрисоединенныеФайлы.Добавить();
//		НовыйФайл.Файл = СозданныйФайл;
//		НовыйФайл.ДатаИзменения = ДокДата;
//		НовыйФайл.Отредактировал = ДокДата;
//	КонецЦикла;
//	
//	Попытка
//		ДокОбращение.Записать(РежимЗаписиДокумента.Запись);
//		ПроизошлаОшибка = Ложь;
//	Исключение
//		ПроизошлаОшибка = Истина;
//		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, ,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//	КонецПопытки; 
//	
//	Если Не ПроизошлаОшибка Тогда 
//		Документы.ОбращениеКлиента.ПередатьВБитриксСервер(ДокОбращение);
//	КонецЕсли;
//	
//КонецПроцедуры

//Функция ПолучитьСсылкуПоЗаказу(Ссылка)
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОбращениеКлиента.Ссылка КАК Ссылка
//		|ИЗ
//		|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
//		|ГДЕ
//		|	ОбращениеКлиента.Основание = &Основание
//		|	И ОбращениеКлиента.ИсточникОбращения = &ИсточникОбращения
//		|	И НЕ ОбращениеКлиента.ПометкаУдаления";
//	
//	Запрос.УстановитьПараметр("ИсточникОбращения", Справочники.ИсточникиОбращенийКлиентов.НайтиПоНаименованию("Мобильное приложение"));
//	Запрос.УстановитьПараметр("Основание", Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если РезультатЗапроса.Пустой() Тогда
//		Возврат Ложь;
//	Иначе
//		Возврат Истина;
//	КонецЕсли;
//КонецФункции 

//Функция ПолучитьОтветственного(Организация, Подразделение)
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ ПЕРВЫЕ 1
//		|	Сотрудники.Пользователь КАК Пользователь
//		|ИЗ
//		|	Справочник.Сотрудники КАК Сотрудники
//		|ГДЕ
//		|	Сотрудники.Должность.Наименование = ""Руководитель отдела транспортной логистики""
//		//|	И Сотрудники.Организация = &Организация
//		//|	И Сотрудники.Подразделение = &Подразделение
//		|	И НЕ Сотрудники.ПометкаУдаления
//		|	И НЕ Сотрудники.Уволен";
//	
//	//Запрос.УстановитьПараметр("Организация", Организация);
//	//Запрос.УстановитьПараметр("Подразделение", Подразделение);
//	
//	Результат = Запрос.Выполнить();
//	
//	Выборка = Результат.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		Ответственный = Выборка.Пользователь;
//	КонецЦикла; 
//	
//	Возврат Ответственный;
//КонецФункции

//Функция ОбработатьДанныеОбращенияПоЗаказуНаДоставку(Данные)
//	СтруктураДанных = Новый Структура();
//	
//	//Ссылка заказа на доставку
//	УИД = Новый УникальныйИдентификатор(Данные.Ссылка);
//	ЗаказСсылка = Документы.ЗаказНаДоставкуКлиенту.ПолучитьСсылку(УИД);
//	
//	//Статус 
//	Статус = "Статус заказа: " + НРег(Строка(Перечисления.СтатусыЗаказовНаДоставку[Данные.Статус]));
//	
//	//Причина отказа
//	ДанныеПричина = Данные.ПричинаОтказа;
//	ПричинаОтказа = "Причина отказа: ";
//	Если ДанныеПричина = "1" Тогда
//		ПричинаОтказа = ПричинаОтказа + "брак, транспортный бой";
//	ИначеЕсли ДанныеПричина = "2" Тогда
//		ПричинаОтказа = ПричинаОтказа + "пересорт";
//	ИначеЕсли ДанныеПричина = "3" Тогда
//		ПричинаОтказа = ПричинаОтказа + "недостача";
//	ИначеЕсли ДанныеПричина = "4" Тогда
//		ПричинаОтказа = ПричинаОтказа + "не подошел";
//	ИначеЕсли ДанныеПричина = "5" Тогда
//		ПричинаОтказа = ПричинаОтказа + "бой на выгрузке";
//	ИначеЕсли ДанныеПричина = "6" Тогда
//		ПричинаОтказа = ПричинаОтказа + "клиент не доступен, нет на месте";
//	КонецЕсли;
//	
//	//Товары
//	ЧтениеXML = Новый ЧтениеXML;
//	ЧтениеXML.УстановитьСтроку(Данные.ТоварыПоОтказу);
//	ТЗТовары = СериализаторXDTO.ПрочитатьXML(ЧтениеXML); 
//	
//	//Файлы
//	ЧтениеXML = Новый ЧтениеXML;
//	ЧтениеXML.УстановитьСтроку(Данные.Файлы);
//	Файлы = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
//	
//	//Местонахождение товара
//	МестонахождениеТовара = "Местонахождение товара: ";
//	Если Данные.МестонахождениеТовара = "1" Тогда
//		МестонахождениеТовара = МестонахождениеТовара + "у клиента";
//	Иначе
//		МестонахождениеТовара = МестонахождениеТовара + "возврат на склад";
//	КонецЕсли;

//	СтруктураДанных.Вставить("ЗаказСсылка", ЗаказСсылка);
//	СтруктураДанных.Вставить("Статус", Статус);
//	СтруктураДанных.Вставить("ПричинаОтказа", ПричинаОтказа);
//	СтруктураДанных.Вставить("Товары", ТЗТовары);
//	СтруктураДанных.Вставить("КомментарийВодителя", Данные.КомментарийВодителя);
//	СтруктураДанных.Вставить("Файлы", Файлы);
//	СтруктураДанных.Вставить("МестонахождениеТовара", МестонахождениеТовара);
//	
//	Возврат СтруктураДанных;
//	
//КонецФункции

//#КонецОбласти

//#КонецЕсли
