#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы()); 
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыиФункции
&НаКлиенте
Функция СтруктураТаблицы()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("Код", "строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура",
		"СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("ТСК", "число#ТСК#10");
	СтруктураТаблицы.Вставить("МД", "число#МД#10");
	СтруктураТаблицы.Вставить("МДР", "число#МДР#10");

	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ОграниченияПоКолонкеОпт.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				если МенеджерЗаписи.МД>8 тогда
					МенеджерЗаписи.МД=8;
				конецесли;
				если МенеджерЗаписи.МД<4 тогда
					МенеджерЗаписи.МД=4;
				конецесли;
				если МенеджерЗаписи.ТСК>8 тогда
					МенеджерЗаписи.ТСК=8;
				конецесли;
				если МенеджерЗаписи.ТСК<4 тогда
					МенеджерЗаписи.ТСК=4;
				конецесли;
				если МенеджерЗаписи.МДР>8 тогда
					МенеджерЗаписи.МДР=8;
				конецесли;
				если МенеджерЗаписи.МДР<4 тогда
					МенеджерЗаписи.МДР=4;
				конецесли;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		//	Объект.Товары.Загрузить(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;
Элементы.Список.Обновить();
КонецПроцедуры


#КонецОбласти