Функция ПолучитьТаблицуКодовГородов() Экспорт
	
	ПростыеЗвонкиКодыГородов = Новый ТаблицаЗначений;
	ПростыеЗвонкиКодыГородов.Колонки.Добавить("КодГорода");
	ПростыеЗвонкиКодыГородов.Колонки.Добавить("Город");
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("ПростыеЗвонки_КодыГородов");
	
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	Для н = 1 по 2216 Цикл
		
		НомерСтроки = Формат(н,"ЧРГ=; ЧГ=");
		
		НоваяСтрока = ПростыеЗвонкиКодыГородов.Добавить();
		НоваяСтрока.КодГорода	= СокрЛП(Таб.Область("R"+НомерСтроки+"C1").Текст);
		НоваяСтрока.Город		= СокрЛП(Таб.Область("R"+НомерСтроки+"C2").Текст);
		
	КонецЦикла;
	
	ПростыеЗвонкиКодыГородов.Индексы.Добавить("КодГорода");
	
	Возврат ПростыеЗвонкиКодыГородов;
	
КонецФункции

Функция ПолучитьТаблицуКодовМобильныхОператоров() Экспорт
	
	ПростыеЗвонкиКодыМобильныхОператоров = Новый ТаблицаЗначений;
	ПростыеЗвонкиКодыМобильныхОператоров.Колонки.Добавить("КодОператора");
	ПростыеЗвонкиКодыМобильныхОператоров.Колонки.Добавить("НомерС");
	ПростыеЗвонкиКодыМобильныхОператоров.Колонки.Добавить("НомерПо");
	ПростыеЗвонкиКодыМобильныхОператоров.Колонки.Добавить("Регион");
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("ПростыеЗвонки_КодыМобильныхОператоров");
	
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	Для н = 1 по 3464 Цикл
		
		НомерСтроки = Формат(н,"ЧРГ=; ЧГ=");
		
		НоваяСтрока = ПростыеЗвонкиКодыМобильныхОператоров.Добавить();
		
		НоваяСтрока.КодОператора	= СокрЛП(Таб.Область("R"+НомерСтроки+"C1").Текст);
		НоваяСтрока.НомерС			= СокрЛП(Таб.Область("R"+НомерСтроки+"C2").Текст);
		НоваяСтрока.НомерПо			= СокрЛП(Таб.Область("R"+НомерСтроки+"C3").Текст);
		НоваяСтрока.Регион			= СокрЛП(Таб.Область("R"+НомерСтроки+"C4").Текст);
		
	КонецЦикла;
	
	ПростыеЗвонкиКодыМобильныхОператоров.Индексы.Добавить("КодОператора");
	
	Возврат ПростыеЗвонкиКодыМобильныхОператоров;
	
КонецФункции
