&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ИсключитьИзКонтроля.Доступность= РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");
	
	Если РольДоступна("ПолныеПрава") Тогда
		 УстановитьДоступностьПоПраву();
	КонецЕсли;	
	
	//+Альтерра
	Если Объект.Статус <> Перечисления.СтатусыЧековККМ.Пробит Тогда
		Объект.ДатаПоследнегоОткрытия = ТекущаяДатаСеанса();
	КонецЕсли;	
	//-
КонецПроцедуры

//Зеленение
&После("УстановитьУсловноеОформление")
Процедура Док__УстановитьУсловноеОформление()
	АльтерраОбщегоНазначения.УстановитьОформлениеЗеленениеСтрокТабличныхЧастей(ЭтаФорма,"Товары");
КонецПроцедуры

&НаКлиенте
Процедура Док__РеквизитыПечатиЗаявленияНаВозврат(Команда)
	если не значениезаполнено(Объект.Покупатель) тогда
		Объект.покупатель= строка(Объект.Партнер);
	конецесли;	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Контрагент",                          неопределено);
	СтруктураПараметров.Вставить("Покупатель",                          Объект.Покупатель);
	СтруктураПараметров.Вставить("ДатаРожденияПокупателя",              Объект.ДатаРожденияПокупателя);
	СтруктураПараметров.Вставить("ПричинаВозврата",                     Объект.ПричинаВозврата);
	СтруктураПараметров.Вставить("ВидДокументаПокупателя",              Объект.ВидДокументаПокупателя);
	СтруктураПараметров.Вставить("СерияДокументаПокупателя",            Объект.СерияДокументаПокупателя);
	СтруктураПараметров.Вставить("НомерДокументаПокупателя",            Объект.НомерДокументаПокупателя);
	СтруктураПараметров.Вставить("ДатаВыдачиДокументаПокупателя",       Объект.ДатаВыдачиДокументаПокупателя);
	СтруктураПараметров.Вставить("СрокДействияДокументаПокупателя",     Объект.СрокДействияДокументаПокупателя);
	СтруктураПараметров.Вставить("КемВыданДокументПокупателя",          Объект.КемВыданДокументПокупателя);
	СтруктураПараметров.Вставить("КодПодразделенияДокументаПокупателя", Объект.КодПодразделенияДокументаПокупателя);
	СтруктураПараметров.Вставить("ДатаДокумента",                       Объект.Дата);
	СтруктураПараметров.Вставить("Организация",                         Объект.Организация);
	
	ОткрытьФорму("Обработка.ПечатьЗаявленияНаВозвратТоваровОтКлиента.Форма.РеквизитыПечатиЗаявленияНаВозврат", СтруктураПараметров, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура Док_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПечатьЗаявленияНаВозвратТоваровОтКлиента.Форма.РеквизитыПечатиЗаявленияНаВозврат" Тогда
		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док__СоздатьБлокировкуДвиженияТоваровПосле(Команда)
	ИмяДокумента= "БлокировкаДвиженияТоваров";
	ФормаДок = ПолучитьФорму("Документ."+ИмяДокумента+".ФормаОбъекта");
	//ФормаДок = ПолучитьФорму("Документ.ЛистСогласования.ФормаОбъекта");
	
	//Далее мы получаем объект только, что созданной формы и помещаем её в переменную
	//В объекте содержатся все реквизиты (элементы) формы
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Чек ККМ на возврат");
		
		ПоказатьПредупреждение(,ТекстВопроса);
		возврат;	
	КонецЕсли;
	
	//Мы помещаем объект формы в переменную,
	//так как должны передать её в процедуру на сервере,
	//где нельзя изменять объект формы, зато можно править переменную содержащую его
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	
	//После выполнения процедуры на сервере мы получаем изменную переменную ДанныеФормы,
	//которую необходимо передать в уже созданную нами форму
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	
	//Открываем результат выполнения обработки
	ФормаДок.Открыть();
КонецПроцедуры

&НаСервере
Процедура СоздатьНовыйДокумент(ИмяДокумента, НовыйОбъект)
	НовыйОбъект.ДокументОснование= Объект.Ссылка;
	НовыйОбъект.Склад= Объект.Склад;
	НовыйОбъект.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
	НовыйОбъект.Товары.Загрузить(Объект.Товары.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Док__СоздатьПретензиюПосле(Команда)
	ФормаДок = ПолучитьФорму("Справочник.Претензии.ФормаОбъекта");
	
	//Далее мы получаем объект только, что созданной формы и помещаем её в переменную
	//В объекте содержатся все реквизиты (элементы) формы
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Заявка на доставку");
		
		ПоказатьПредупреждение(,ТекстВопроса);
		возврат;	
	КонецЕсли;
	
	//Мы помещаем объект формы в переменную,
	//так как должны передать её в процедуру на сервере,
	//где нельзя изменять объект формы, зато можно править переменную содержащую его
	СоздатьНовуюПретензию(ДанныеФормы);
	
	//После выполнения процедуры на сервере мы получаем изменную переменную ДанныеФормы,
	//которую необходимо передать в уже созданную нами форму
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	
	//Открываем результат выполнения обработки
	ФормаДок.Открыть();
КонецПроцедуры

&НаСервере
Процедура СоздатьНовуюПретензию(НовыйОбъект)
	НовыйОбъект.ОснованиеЧекККМ= Объект.Ссылка;
	НовыйОбъект.Партнер= Объект.Партнер;
	НовыйОбъект.ДатаРегистрации= ТекущаяДата();
	НовыйОбъект.Ответственный= Пользователи.ТекущийПользователь();
	НовыйОбъект.Статус= Перечисления.СтатусыПретензийКлиентов.Зарегистрирована;
КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЧекККМ = ТекущийОбъект.ЧекККМ;     
	Если Не Отказ И 
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И
		ЗначениеЗаполнено(ЧекККМ) Тогда
		
		ТЗТовары = ТекущийОбъект.Товары.Выгрузить( , "Номенклатура, Количество");
		ТЗТовары.Свернуть("Номенклатура", "Количество");	
		
		АльтерраОбщегоНазначения.НаличиеЗаказаНаДоставкуПриПолномВозврате(Отказ, ТЗТовары, ТекущийОбъект.Ссылка, ЧекККМ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоПраву()

	для каждого СТР_Элемент из ЭтаФорма.Элементы цикл
		если ( типзнч(стр_Элемент)=тип("ГруппаФормы") и стр_Элемент.ТолькоПросмотр) или
		(типзнч(стр_Элемент)=тип("ПолеФормы") и стр_Элемент.ТолькоПросмотр) или
		(типзнч(стр_Элемент)=тип("ТаблицаФормы") и стр_Элемент.ТолькоПросмотр) тогда
			  стр_Элемент.ТолькоПросмотр=ложь;
		конецесли;	
	конеццикла;	

КонецПроцедуры

&НаСервере
Процедура Док_МенеджерПриИзмененииПослеНаСервере()
	Объект.ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Объект.Менеджер); 
	Объект.ОтделМенеджера = ПолучитьОтделМенеджера(Объект.Менеджер);
КонецПроцедуры

&НаКлиенте
Процедура Док_МенеджерПриИзмененииПосле(Элемент)
	Док_МенеджерПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделМенеджера(Менеджер) 

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение.Наименование КАК Отдел
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО (ДополнительныеСведения.Объект = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ДополнительныеСведения.Свойство.Наименование = ""Отделы (Пользователи)""";
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Отдел;
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подразделение;
КонецФункции

#Область НапечататьПоследнийСлипЧек

&НаКлиенте
Процедура НапечататьПоследнийСлипЧек(Команда)
	ДопМодульКлиент.НапечататьПоследнийСлипЧек(ЭтотОбъект.УникальныйИдентификатор, ИдентификаторУстройства(Объект.КассаККМ));
КонецПроцедуры        

&НаСервереБезКонтекста
Функция ИдентификаторУстройства(КассаККМ)
	Возврат Справочники.КассыККМ.ПараметрыКассыККМ(КассаККМ).ИдентификаторУстройства;
КонецФункции
   
#КонецОбласти

