//Процедура вызывается при записи документов ЗаказКлиента, РеализацияТоваровУслуг, ЧекККМ (расширение)
//Изменить название сделки
//Если Партнер и/или Контрагент, отличается и переносится в сделку
Процедура НазваниеСделки(Сделка, Партнер = Неопределено, Контрагент = Неопределено) Экспорт
		
	СделкаОбъект = Сделка.ПолучитьОбъект();
	Если Партнер <> Неопределено Тогда
		СделкаОбъект.Наименование = "";
		СделкаОбъект.Партнер = Партнер;
		СделкаОбъект.Наименование = СделкаОбъект.Наименование + Партнер + " ";
		СделкаОбъект.Наименование = СделкаОбъект.Наименование + Формат(СделкаОбъект.ДатаНачала, "ДФ=dd.MM.yyyy") + " на сумму: " + СделкаОбъект.ПотенциальнаяСуммаПродажи;
	КонецЕсли;
	Если Контрагент <> Неопределено Тогда
		СделкаОбъект.Контрагент = Контрагент;
	КонецЕсли;	
	
	СделкаОбъект.Записать();

КонецПроцедуры
