#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Акции

Процедура РасчетПоМаркетинговымМероприятиям(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ЭтоЗаказ = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента"),Истина,Ложь);
	РеализацияПоЗаказу = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") И ЗначениеЗаполнено(Объект.ЗаказКлиента),Истина,Ложь);
	
	НовыйПорядокНачисления = БонусыАльтерраРезерв.ПрименитьНовыйПорядокРаспределенияБонусов(Объект);
	
	ДокДата = ?(НовыйПорядокНачисления И ЭтоЗаказ, Объект.ДатаСоздания, Объект.Дата);
	ДокДата = ?(НовыйПорядокНачисления И РеализацияПоЗаказу И ЗначениеЗаполнено(Объект.ЗаказКлиента), Объект.ЗаказКлиента.ДатаСоздания, Объект.Дата);
	 
	Если ПолучитьВсеДействующиеМероприятия(ДокДата).Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    //Очищение таблицы по акциям
	Объект.Акции.Очистить();

	ТаблицаПримененныхАкций = Новый ТаблицаЗначений();
	ТаблицаПримененныхАкций.Колонки.Добавить("МаркетинговоеМероприятие");
	ТаблицаПримененныхАкций.Колонки.Добавить("Действие");
	ТаблицаПримененныхАкций.Колонки.Добавить("Баллы");
	ТаблицаПримененныхАкций.Колонки.Добавить("НеПрименено");
	
	//Проверка по алгоритмам
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказНаДоставкуКлиенту") Тогда 
		
		Если Не ЗаказНаДоставкуПодходитПодУсловия(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(Объект.Партнер) = Тип("СправочникСсылка.Партнеры") Тогда
			Если Не БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;  
		
		АкцииНаДоставку = ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(Перечисления.АлгоритмыАкций.ЗаДоставку,Объект.Подразделение,ДокДата);
		
		//Проверяем подходит ли заказ под условия и существуют ли мероприятия с типом алгоритма "За доставку"
		Если АкцииНаДоставку.Количество()>0 Тогда
			ТЗНоменклатуры = ПолучитьНоменклатуруДляРасчета(Объект.Основания.Выгрузить(,"Документ"));
			СтруктураДействийИМероприятий = ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Объект.Партнер,ТЗНоменклатуры.ВыгрузитьКолонку("Номенклатура"),АкцииНаДоставку,ТаблицаПримененныхАкций);
			ЗаполнитьЗначенияСвойств(ТаблицаПримененныхАкций,СтруктураДействийИМероприятий);
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		МожноНачислитьБонусы = Не ЕстьЗапретНаБонусы(Объект,,НовыйПорядокНачисления);
		
		АкцииЗаТовар = ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(Перечисления.АлгоритмыАкций.ЗаТовар,Объект.Подразделение,ДокДата);  
		
		ТЗНоменклатуры = БонусыАльтерраРезерв.ПолучитьТоварыКРасчетуБаллов(Объект.Товары, ЭтоЗаказ, Объект.Дата, Истина);  
		МассивНоменклатуры = ТЗНоменклатуры.ВыгрузитьКолонку("Номенклатура");
		ТЗНоменклатурыБезБонусов = БонусыАльтерраРезерв.ПолучитьТоварыКРасчетуБаллов(Объект.Товары, ЭтоЗаказ, Объект.Дата, Ложь);
		МассивНоменклатурыБезБонусов = ТЗНоменклатурыБезБонусов.ВыгрузитьКолонку("Номенклатура");
		
		//Проверяем существуют ли мероприятия с типом алгоритма "За товар"
		Если АкцииЗаТовар.Количество() > 0 Тогда
			СтруктураДействийИМероприятий = ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Объект.Партнер, МассивНоменклатуры, АкцииЗаТовар,ТаблицаПримененныхАкций);
			ЗаполнитьЗначенияСвойств(ТаблицаПримененныхАкций,СтруктураДействийИМероприятий);
		КонецЕсли;
		
		АкцииЗаПромокод = ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(Перечисления.АлгоритмыАкций.ЗаПромокод,Объект.Подразделение,ДокДата);
		
		//Проверяем существуют ли мероприятия с типом алгоритма "За промокод"
		Если АкцииЗаПромокод.Количество() > 0 Тогда  
			
			Если МожноНачислитьБонусы Тогда 
			
				Если ЗначениеЗаполнено(Объект.Промокод) Тогда
					
					МероприятияПоОтборуПромокод = ПолучитьМероприятияПоОтборуПромокод(Объект.Промокод,Объект.Подразделение,ДокДата);
					
					Для каждого СтрокаМероприятие из МероприятияПоОтборуПромокод Цикл
						
						Для каждого СтрокаДействие из СтрокаМероприятие.Ссылка.Действия Цикл
							
							НоваяСтрока = ТаблицаПримененныхАкций.Добавить();
							НоваяСтрока.МаркетинговоеМероприятие = СтрокаМероприятие.Ссылка;
							НоваяСтрока.Действие = СтрокаДействие.Действие;
							
						КонецЦикла;	
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Объект.ПривелКлиент) Тогда
					
					СтруктураДействийИМероприятий = ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Объект.ПривелКлиент, МассивНоменклатуры, АкцииЗаПромокод,ТаблицаПримененныхАкций,Истина);
					
					Если СтруктураДействийИМероприятий.ТаблицаПримененныхАкций.Количество()>0 Тогда
						ЗаполнитьЗначенияСвойств(ТаблицаПримененныхАкций,СтруктураДействийИМероприятий);
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЕсли;
	
	//Выполнение действий
	Если ТаблицаПримененныхАкций.Количество() > 0 Тогда
		
		ПересчитатьБонусныеБаллы = Ложь;
		СтатусИзменен = Ложь;       
		РассчитатьСкидкиНаценки = Ложь;   
		СтрокиСРеализацией = Новый Массив;
		
		
		Для каждого СтрокаТаблицы из ТаблицаПримененныхАкций Цикл
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.УстановитьВидЦены Тогда     
				
				Если Не ЕстьЗапретНаБонусы(Объект, Истина, НовыйПорядокНачисления) Тогда 
				
					ПересчитатьБонусныеБаллы = Ложь;
					
					Для Каждого СтрокаТовар Из ТЗНоменклатуры Цикл
						
						НовыйВидЦены = Справочники.МаркетинговыеМероприятия.ПолучитьПроцентБонусовВидЦеныПоНоменклатуре(СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТовар.Номенклатура,СтрокаТовар.Характеристика,СтрокаТаблицы.Действие);		
						
						Если ЗначениеЗаполнено(НовыйВидЦены) Тогда
							
							НоваяЦена = АльтерраОбщегоНазначения.ПолучитьЦену(СтрокаТовар.Номенклатура, НовыйВидЦены);
							
							НайденнаяСтрока = Объект.Товары[СтрокаТовар.НомерСтроки-1];
							
							Если НоваяЦена < НайденнаяСтрока.Цена Тогда  
								НайденнаяСтрока.ВидЦены = НовыйВидЦены;
								НайденнаяСтрока.Цена = НоваяЦена;					
								АльтерраОбщегоНазначения.ПересчитатьСуммыВСтрокеТовара(Объект, НайденнаяСтрока);
								
								НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма - НайденнаяСтрока.СуммаБонусныхБалловКСписанию;
								НайденнаяСтрока.СуммаСНДС = НайденнаяСтрока.СуммаСНДС - НайденнаяСтрока.СуммаБонусныхБалловКСписанию;

								Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
									Объект.ПричинаОтклоненияОтЦеновыхУсловий = Объект.ПричинаОтклоненияОтЦеновыхУсловий + " Акция: " + СтрокаТаблицы.МаркетинговоеМероприятие.Наименование + " - Строка №" + Строка(СтрокаТовар.НомерСтроки) + " " ;
								КонецЕсли;
								
								ПересчитатьБонусныеБаллы = Истина; 
								РассчитатьСкидкиНаценки = Истина;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					СтрокаТаблицы.НеПрименено = Истина;	
				КонецЕсли;
							
			КонецЕсли;
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.СменитьСтатусУчастникаБонуснойПрограммы Тогда 
				
				Если МожноНачислитьБонусы Тогда
				
					СтарыйСтатус = Объект.СтатусПартнераВПрограммеЛояльности;
					НовыйСтатус = СтрокаТаблицы.Действие.СтатусУчастникаБонуснойПрограммы;
					
					Если НовыйСтатус.Коэффициент > СтарыйСтатус.Коэффициент Тогда    
					
						БонусыАльтерра.ОбновитьСтатусВРегистре(Объект.Партнер,НовыйСтатус);
						СтатусИзменен = Истина;
						
						Если Не ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаДоставкуКлиенту") Тогда 
							
							ПересчитатьБонусныеБаллы = Истина;
							
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					СтрокаТаблицы.НеПрименено = Истина;				
				КонецЕсли
				
			КонецЕсли;
				
		КонецЦикла;

		Если ПересчитатьБонусныеБаллы Тогда
			БонусыАльтерраРезерв.НачислитьБонусныеБаллы(Объект);
		КонецЕсли;
		
		Если РассчитатьСкидкиНаценки Тогда
			РассчитатьСкидкиНаценкиВДокументе(Объект);
		КонецЕсли;
		
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаДоставкуКлиенту") Тогда
			ДокументОплачен = Истина;
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			ДокументОплачен = Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит;
		Иначе
			ДокументОплачен = ЗначениеЗаполнено(Объект.Кассир);
		Конецесли;
		
		Если Не ДокументОплачен И СтатусИзменен Тогда
			
			Набор = РегистрыСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(ТекущаяДата());
			Набор.Отбор.БонуснаяПрограммаЛояльности.Установить(Справочники.БонусныеПрограммыЛояльности.НайтиПоНаименованию("Бонус от ALTERRA", Истина));
			Набор.Отбор.Партнер.Установить(Объект.Партнер);
			Набор.Записать();
			
		КонецЕсли;
		
		СуммаББПрочее = 0;
		
		Для каждого СтрокаТаблицы из ТаблицаПримененныхАкций Цикл
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом Тогда      
				
				Если МожноНачислитьБонусы Тогда
				
					ПримененоНаТовар = Ложь;
				
					СуммаДополнительныхБонусов = 0;
					Для Каждого СтрокаТовар Из ТЗНоменклатуры Цикл			
						
						Если Не СтрокаТовар.БезБонусов Тогда 
							
							ДополнительныйПроцент = 0;
							ДополнительныйПроцент = Справочники.МаркетинговыеМероприятия.ПолучитьПроцентБонусовВидЦеныПоНоменклатуре(СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТовар.Номенклатура,СтрокаТовар.Характеристика,СтрокаТаблицы.Действие);
							Если ДополнительныйПроцент > 0 Тогда
								НайденнаяСтрока = Объект.Товары[СтрокаТовар.НомерСтроки-1];
								СуммаДополнительныхБонусовПоНоменклатуре = Цел(НайденнаяСтрока.Сумма*ДополнительныйПроцент);
								Если НовыйПорядокНачисления Тогда
									НайденнаяСтрока.СуммаНачисленныхБалловПрочее = СуммаДополнительныхБонусовПоНоменклатуре;
									НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте = НайденнаяСтрока.СуммаНачисленныхБалловЗаСтатус
																							+ НайденнаяСтрока.СуммаНачисленныхБалловЗаКП
																							+ НайденнаяСтрока.СуммаНачисленныхБалловПрочее;
								Иначе
									НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте = НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте + СуммаДополнительныхБонусовПоНоменклатуре;
								КонецЕсли;
								
								СуммаДополнительныхБонусов = СуммаДополнительныхБонусов + СуммаДополнительныхБонусовПоНоменклатуре;	
								
								ПримененоНаТовар = Истина;	
							КонецЕсли;	
						КонецЕсли;
					КонецЦикла;
					
					СтрокаТаблицы.Баллы = СуммаДополнительныхБонусов;
					СуммаББПрочее = СуммаББПрочее + СуммаДополнительныхБонусов;
					
					Если Не ПримененоНаТовар Тогда 
						СтрокаТаблицы.НеПрименено = Истина;				
					КонецЕсли
				Иначе
					СтрокаТаблицы.НеПрименено = Истина				
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой Тогда 
				
				Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказНаДоставкуКлиенту") Тогда
					МассивНоменклатурыБезБонусов = ТЗНоменклатуры.ВыгрузитьКолонку("Номенклатура");
				КонецЕсли;
				
				ТЗ = ПолучитьМероприятияПоОтборуНоменклатуры(МассивНоменклатурыБезБонусов, СтрокаТаблицы.МаркетинговоеМероприятие);
				
				Если МожноНачислитьБонусы И (ТЗ.Количество() > 0 ИЛИ СтрокаТаблицы.Действие.Алгоритм = Перечисления.АлгоритмыАкций.ЗаПромокод) Тогда 

					Если ДокументОплачен(Объект, НовыйПорядокНачисления) И Не СозданоНачислениеПоДокументу(Объект.Ссылка,СтрокаТаблицы.МаркетинговоеМероприятие,Справочники.ПричиныНачисленияБонусныхБаллов.ПоАкции) Тогда
						СоздатьНачислениеБонусов(АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму(),Объект.Ссылка,Объект.Партнер,СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТаблицы.Действие.СуммаБонусов,"Начислено по акции на основании документа " + Строка(Объект.Номер) + " от " + Строка(Объект.Дата),Справочники.ПричиныНачисленияБонусныхБаллов.ПоАкции);
					КонецЕсли; 
					
				Иначе
					СтрокаТаблицы.НеПрименено = Истина									
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыЗаНовогоКлиента И ЗначениеЗаполнено(Объект.ПривелКлиент) Тогда
				
				Если МожноНачислитьБонусы Тогда
				
					Если ДокументОплачен(Объект, НовыйПорядокНачисления) И Не СозданоНачислениеПоДокументу(Объект.Ссылка,СтрокаТаблицы.МаркетинговоеМероприятие,Справочники.ПричиныНачисленияБонусныхБаллов.ЗаНовогоКлиента) Тогда
						СоздатьНачислениеБонусов(АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму(),Объект.Ссылка,Объект.ПривелКлиент,СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТаблицы.Действие.СуммаБонусов,"Начислено по акции на основании документа " + Строка(Объект.Номер) + " от " + Строка(Объект.Дата),Справочники.ПричиныНачисленияБонусныхБаллов.ЗаНовогоКлиента);
					КонецЕсли;
					
				Иначе
					СтрокаТаблицы.НеПрименено = Истина				
				КонецЕсли;
				
			КонецЕсли;			
			
		КонецЦикла;
		
		Если СуммаББПрочее > 0 Тогда
			
			Если Не НовыйПорядокНачисления Тогда
				НоваяСтрока = Объект.БонусныеБаллы.Добавить();
				НоваяСтрока.БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
				НоваяСтрока.ДатаНачисления = НачалоДня(Объект.Дата)+3600*24*3;
				НоваяСтрока.СуммаБонусныхБаллов = СуммаББПрочее;
			Иначе
				Если Объект.БонусныеБаллы.Количество() > 0 Тогда
					НоваяСтрока = Объект.БонусныеБаллы[0];
				Иначе
					НоваяСтрока = Объект.БонусныеБаллы.Добавить();
					НоваяСтрока.БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
					НоваяСтрока.ДатаНачисления = НачалоДня(Объект.Дата)+3600*24*3;
				КонецЕсли;
				
				НоваяСтрока.СуммаБонусныхБалловПрочее = СуммаББПрочее; 
				НоваяСтрока.СуммаБонусныхБаллов = НоваяСтрока.СуммаБонусныхБалловЗаСтатус
				+ НоваяСтрока.СуммаБонусныхБалловЗаКП
				+ НоваяСтрока.СуммаБонусныхБалловПрочее;
				
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаАкций = Новый ТаблицаЗначений;
		ПараметрыОтбора = Новый Структура("НеПрименено", Неопределено);
		ТаблицаАкций = ТаблицаПримененныхАкций.Скопировать(ПараметрыОтбора);   
		
		Объект.Акции.Загрузить(ТаблицаАкций);
			
	Иначе
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ЗаказНаДоставкуПодходитПодУсловия(ЗаказНаДоставку) Экспорт
	
	Возврат (ЗаказНаДоставку.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная И
	ЗаказНаДоставку.Статус = Перечисления.СтатусыЗаказовНаДоставку.ВРейсе И ЗаказНаДоставку.Проведен);
	
КонецФункции

Функция ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(АлгоритмАкции,Подразделение,Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка,
		|	МаркетинговыеМероприятияПодразделения.Подразделение КАК Подразделение,
		|	МаркетинговыеМероприятияПодразделения.НомерСтроки КАК НомерСтроки,
		|	МаркетинговыеМероприятия.Алгоритм КАК Алгоритм
		|ПОМЕСТИТЬ ВТ_Мероприятия
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаркетинговыеМероприятия.Подразделения КАК МаркетинговыеМероприятияПодразделения
		|		ПО МаркетинговыеМероприятия.Ссылка = МаркетинговыеМероприятияПодразделения.Ссылка
		|ГДЕ
		|	(МаркетинговыеМероприятияПодразделения.НомерСтроки ЕСТЬ NULL
		|			ИЛИ МаркетинговыеМероприятияПодразделения.Подразделение = &Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Мероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Мероприятия КАК ВТ_Мероприятия
		|ГДЕ
		|	ВТ_Мероприятия.Алгоритм = &Алгоритм
		|	И ВТ_Мероприятия.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Алгоритм", АлгоритмАкции);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ссылка", ПолучитьВсеДействующиеМероприятия(Дата));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	Возврат РезультатЗапроса; 

КонецФункции

Функция ПолучитьВсеДействующиеМероприятия(ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.ДатаОкончания >= &ДатаДокумента
		|	И МаркетинговыеМероприятия.ДатаНачала <= &ДатаДокумента
		|	И МаркетинговыеМероприятия.ВидАкции = &ВидАкции
		|	И МаркетинговыеМероприятия.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидАкции", Перечисления.ВидыАкций.Алгоритм);
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(ДатаДокумента));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
    Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьМероприятияПоАлгоритму(АлгоритмАкции,МассивМероприятий) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Алгоритм = &Алгоритм
	    |	И МаркетинговыеМероприятия.Ссылка В(&МассивСсылок)";
	
	Запрос.УстановитьПараметр("Алгоритм", АлгоритмАкции);
	Запрос.УстановитьПараметр("МассивСсылок", МассивМероприятий);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПодходитПодУсловияОтбораАлгоритма(АлгоритмАкции,Клиент,ТаблицаТоваров,МассивМероприятий) Экспорт
	
	//СтруктураОтвета = Новый Структура("УсловияВыполняются,МаркетинговыеМероприятия",Ложь,"");
	//
	//МероприятияПоАлгоритму = ПолучитьМероприятияПоАлгоритму(АлгоритмАкции,МассивМероприятий);
	//
	//Если АлгоритмАкции = Перечисления.АлгоритмыАкций.ЗаТовар Тогда
	//	Если МероприятияПоАлгоритму.Количество()>0 Тогда
	//		МероприятияПоПартнеру = ПолучитьМероприятияПоОтборуПартнера(Клиент,МероприятияПоАлгоритму);
	//		Если МероприятияПоПартнеру.Количество()>0 Тогда
	//			МероприятияПоНоменклатуре = ПолучитьМероприятияПоОтборуНоменклатуры(ТаблицаТоваров,МероприятияПоПартнеру);
	//			Если МероприятияПоНоменклатуре.Количество()>0 Тогда
	//				СтруктураОтвета.УсловияВыполняются = Истина;
	//				СтруктураОтвета.МаркетинговыеМероприятия = МероприятияПоНоменклатуре;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;

	//Возврат СтруктураОтвета;
КонецФункции

Функция ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Партнер,Товары,МассивМероприятий,ТаблицаПримененныхАкций,ОтборТолькоПоПартнеру = Ложь) Экспорт
	
	МероприятияПоОтборуПартнера = ПолучитьМероприятияПоОтборуПартнера(Партнер,МассивМероприятий);
	//Проверяем подходит ли документ по партнеру из документов оснований
	Если МероприятияПоОтборуПартнера.Количество()>0 Тогда
		
		Если ОтборТолькоПоПартнеру Тогда
			Для каждого СтрокаМероприятие из МероприятияПоОтборуПартнера Цикл
				
				Для каждого СтрокаДействие из СтрокаМероприятие.Ссылка.Действия Цикл
					
					НоваяСтрока = ТаблицаПримененныхАкций.Добавить();
					НоваяСтрока.МаркетинговоеМероприятие = СтрокаМероприятие.Ссылка;
					НоваяСтрока.Действие = СтрокаДействие.Действие;
										
				КонецЦикла;	
			КонецЦикла;
				
			Иначе
				МероприятияПоОтборуНоменклатуры = ПолучитьМероприятияПоОтборуНоменклатуры(Товары,МероприятияПоОтборуПартнера);
				//Проверяем подходит ли документ по товару из документов оснований	
				Если МероприятияПоОтборуНоменклатуры.Количество()>0 Тогда
					
					Для каждого СтрокаМероприятие из МероприятияПоОтборуНоменклатуры Цикл
						
						Для каждого СтрокаДействие из СтрокаМероприятие.Ссылка.Действия Цикл
							
							НоваяСтрока = ТаблицаПримененныхАкций.Добавить();
							НоваяСтрока.МаркетинговоеМероприятие = СтрокаМероприятие.Ссылка;
							НоваяСтрока.Действие = СтрокаДействие.Действие;
							
						КонецЦикла;	
						
					КонецЦикла;	
					
				КонецЕсли;
			КонецЕсли;
			
	КонецЕсли;

	Возврат Новый Структура("ТаблицаПримененныхАкций",ТаблицаПримененныхАкций);
	
КонецФункции

Функция ПолучитьМероприятияПоОтборуНоменклатуры(МассивНоменклатуры, МассивМероприятий) Экспорт
	 		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.ТипОтбора = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоСписку)
		|	И МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|		ПО МаркетинговыеМероприятия.СегментНоменклатуры = НоменклатураСегмента.Сегмент
		|ГДЕ
		|	НоменклатураСегмента.Номенклатура В(&Номенклатура)
		|	И МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбора = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоСегменту)
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбора = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоВсемЭлементам)
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка";

	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Ссылка", МассивМероприятий);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Акции = Новый ТаблицаЗначений;
	Акции.Колонки.Добавить("Ссылка");
	
	Пока РезультатЗапроса.Следующий() Цикл
		Если РезультатЗапроса.Ссылка.ТипОтбора = Перечисления.ТипОтбора.ПоСписку Тогда
			НоменклатураПоАкцииЕсть = Ложь;
			Для каждого СтрокаТоварыАкции из РезультатЗапроса.Ссылка.ТоварыАкции Цикл
				Если ЗначениеЗаполнено(СтрокаТоварыАкции.Номенклатура) Тогда
					НоменклатураПоАкцииЕсть = Не МассивНоменклатуры.Найти(СтрокаТоварыАкции.Номенклатура) = Неопределено;
				ИначеЕсли ЗначениеЗаполнено(СтрокаТоварыАкции.ВидНоменклатуры) Тогда
					НоменклатураПоАкцииЕсть = СоотвествиеВидуНоменклатуры(МассивНоменклатуры,СтрокаТоварыАкции.ВидНоменклатуры); 
				Иначе
					НоменклатураПоАкцииЕсть = СоотвествиеГруппеНоменклатуры(МассивНоменклатуры,СтрокаТоварыАкции.ГруппаНоменклатуры); 
				КонецЕсли;
				Если НоменклатураПоАкцииЕсть Тогда
					НоваяСтрока = Акции.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			НоваяСтрока = Акции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Акции;

КонецФункции

Функция СоотвествиеВидуНоменклатуры(МассивНоменклатуры,ВидНоменклатуры)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)
		|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция СоотвествиеГруппеНоменклатуры(МассивНоменклатуры,ГруппаНоменклатуры)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)
		|	И Номенклатура.Родитель В ИЕРАРХИИ(&Родитель)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);
		
	Возврат Не Запрос.Выполнить().Пустой();

	
КонецФункции

Функция ПолучитьМероприятияПоОтборуПартнера(Партнер,МассивМероприятий) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыСегмента.Сегмент КАК Сегмент
		|ПОМЕСТИТЬ СегментыПартнера
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|ГДЕ
		|	ПартнерыСегмента.Партнер = &Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбораПартнер = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоСегменту)
		|	И ВЫБОР
		|			КОГДА МаркетинговыеМероприятия.Клиент = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|				ТОГДА МаркетинговыеМероприятия.СегментПартнеров В
		|						(ВЫБРАТЬ
		|							СегментыПартнера.Сегмент КАК Ссылка
		|						ИЗ
		|							СегментыПартнера)
		|			ИНАЧЕ МаркетинговыеМероприятия.Клиент = &Клиент
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МаркетинговыеМероприятия.ПартнерыАкции КАК МаркетинговыеМероприятияПартнерыАкции
		|		ПО МаркетинговыеМероприятия.Ссылка = МаркетинговыеМероприятияПартнерыАкции.Ссылка
		|ГДЕ
		|	МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбораПартнер = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоСписку)
		|	И ВЫБОР
		|			КОГДА НЕ МаркетинговыеМероприятияПартнерыАкции.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|				ТОГДА МаркетинговыеМероприятияПартнерыАкции.СегментПартнеров В
		|						(ВЫБРАТЬ
		|							СегментыПартнера.Сегмент КАК Ссылка
		|						ИЗ
		|							СегментыПартнера)
		|			ИНАЧЕ ВЫБОР
		|					КОГДА НЕ МаркетинговыеМероприятияПартнерыАкции.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|						ТОГДА МаркетинговыеМероприятияПартнерыАкции.Партнер = &Клиент
		|					ИНАЧЕ (МаркетинговыеМероприятияПартнерыАкции.Свойство, МаркетинговыеМероприятияПартнерыАкции.Значение) В
		|							(ВЫБРАТЬ
		|								ПартнерыДополнительныеРеквизиты.Свойство КАК Свойство,
		|								ПартнерыДополнительныеРеквизиты.Значение КАК Значение
		|							ИЗ
		|								Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|							ГДЕ
		|								ПартнерыДополнительныеРеквизиты.Ссылка = &Клиент)
		|				КОНЕЦ
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркетинговыеМероприятия.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Ссылка В(&Ссылка)
		|	И МаркетинговыеМероприятия.ТипОтбораПартнер = ЗНАЧЕНИЕ(Перечисление.ТипОтбора.ПоВсемЭлементам)";
	
	Запрос.УстановитьПараметр("Клиент", Партнер);
	Запрос.УстановитьПараметр("Ссылка", МассивМероприятий);
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции	

Функция ПолучитьПроцентБонусовВидЦеныПоНоменклатуре(Мероприятие,Номенклатура,Характеристика,Действие) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	ИмяКолонки = "";
	ИмяРеквизита = "";
	
	Если Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом Тогда
		ИмяКолонки = "Процент";
		ЗначениеДействия = Действие.ПроцентБонусов/100;
	ИначеЕсли Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.УстановитьВидЦены Тогда
		ИмяКолонки = "ВидЦены";
		ЗначениеДействия  = Действие.ВидЦены;		
	КонецЕсли;
	
	
	Если Не ПустаяСтрока(ИмяКолонки) Тогда
		
		Если Мероприятие.ТипОтбора = Перечисления.ТипОтбора.ПоСписку Тогда
			
			Для каждого СтрокаТовары из Мероприятие.ТоварыАкции Цикл
				
				НоменклатураПоАкцииЕсть = Ложь;
				
				Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
					НоменклатураПоАкцииЕсть = СтрокаТовары.Номенклатура = Номенклатура;	
				ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.ВидНоменклатуры) Тогда
					НоменклатураПоАкцииЕсть = СтрокаТовары.ВидНоменклатуры = Номенклатура.ВидНоменклатуры; 
				Иначе
					МассивНоменклатуры = Новый Массив;
					МассивНоменклатуры.Добавить(Номенклатура);
					НоменклатураПоАкцииЕсть = СоотвествиеГруппеНоменклатуры(МассивНоменклатуры,СтрокаТовары.ГруппаНоменклатуры); 
				КонецЕсли;	
				
				Если НоменклатураПоАкцииЕсть Тогда
					
					Если ТипЗнч(СтрокаТовары[ИмяКолонки]) = Тип("Число") Тогда
						ВозвращаемоеЗначение = ?(СтрокаТовары[ИмяКолонки]>0,СтрокаТовары[ИмяКолонки]/100,ЗначениеДействия);
					Иначе
						ВозвращаемоеЗначение = ?(ЗначениеЗаполнено(СтрокаТовары[ИмяКолонки]),СтрокаТовары[ИмяКолонки],ЗначениеДействия);
					КонецЕсли;
					Прервать; 
					
				Иначе
					
					Если ТипЗнч(СтрокаТовары[ИмяКолонки]) = Тип("Число") Тогда
						ВозвращаемоеЗначение = 0;
					Иначе
						ВозвращаемоеЗначение = "";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли Мероприятие.ТипОтбора = Перечисления.ТипОтбора.ПоСегменту Тогда
			Если ЗначениеЗаполнено(Мероприятие.СегментНоменклатуры) Тогда
				ДинамическийСегмент = Мероприятие.СегментНоменклатуры.СпособФормирования=Перечисления.СпособыФормированияСегментов.ФормироватьДинамически;
				Если СегментыСервер.ВходитВСегмент(Номенклатура,Мероприятие.СегментНоменклатуры,Характеристика,ДинамическийСегмент) Тогда
					ВозвращаемоеЗначение = ЗначениеДействия;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВозвращаемоеЗначение =ЗначениеДействия;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьМероприятияПоОтборуПромокод(Промокод,Подразделение,ДатаДокумента=Неопределено) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка,
		|	МаркетинговыеМероприятияПодразделения.Подразделение КАК Подразделение,
		|	МаркетинговыеМероприятияПодразделения.НомерСтроки КАК НомерСтроки,
		|	МаркетинговыеМероприятия.Алгоритм КАК Алгоритм,
		|	МаркетинговыеМероприятия.Промокод КАК Промокод
		|ПОМЕСТИТЬ ВТ_Мероприятия
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаркетинговыеМероприятия.Подразделения КАК МаркетинговыеМероприятияПодразделения
		|		ПО МаркетинговыеМероприятия.Ссылка = МаркетинговыеМероприятияПодразделения.Ссылка
		|ГДЕ
		|	(МаркетинговыеМероприятияПодразделения.НомерСтроки ЕСТЬ NULL
		|			ИЛИ МаркетинговыеМероприятияПодразделения.Подразделение = &Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Мероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Мероприятия КАК ВТ_Мероприятия
		|ГДЕ
		|	ВТ_Мероприятия.Алгоритм = &Алгоритм
		|	И ВТ_Мероприятия.Ссылка В(&Ссылка)
		|	И ВТ_Мероприятия.Промокод = &Промокод";
	
	Запрос.УстановитьПараметр("Промокод", Промокод);
	Запрос.УстановитьПараметр("Алгоритм", Перечисления.АлгоритмыАкций.ЗаПромокод);
	Запрос.УстановитьПараметр("Ссылка", ПолучитьВсеДействующиеМероприятия(?(ДатаДокумента=Неопределено,ТекущаяДата(),ДатаДокумента)));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат РезультатЗапроса;
	
КонецФункции

Процедура СоздатьНачислениеБонусов(БонуснаяПрограммаЛояльности,Документ,Партнер,МаркетинговоеМероприятие,СуммаБонусов,Комментарий,Причина) Экспорт
	
	ДокументНачислениеСписаниеБонусовОбъект = Документы.НачислениеИСписаниеБонусныхБаллов.СоздатьДокумент();
	ДокументНачислениеСписаниеБонусовОбъект.Дата = ТекущаяДата();
	ДокументНачислениеСписаниеБонусовОбъект.МаркетинговоеМероприятие = МаркетинговоеМероприятие;
	ДокументНачислениеСписаниеБонусовОбъект.БонуснаяПрограммаЛояльности = БонуснаяПрограммаЛояльности;
	ДокументНачислениеСписаниеБонусовОбъект.Комментарий = Комментарий;
    ДокументНачислениеСписаниеБонусовОбъект.Причина = Причина;
	ДокументНачислениеСписаниеБонусовОбъект.Документ = Документ;
    ДокументНачислениеСписаниеБонусовОбъект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление;
	ДокументНачислениеСписаниеБонусовОбъект.Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.Исполнен;
    НоваяСтрокаНачисления = ДокументНачислениеСписаниеБонусовОбъект.Начисление.Добавить();
	НоваяСтрокаНачисления.Партнер = Партнер;
	НоваяСтрокаНачисления.Баллы = СуммаБонусов; 
    ДокументНачислениеСписаниеБонусовОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция СозданоНачислениеПоДокументу(Документ,МаркетинговоеМероприятие,Причина) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Основания
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Заказ.Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаДоставкуКлиенту.Ссылка
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
		|ГДЕ
		|	ЗаказНаДоставкуКлиенту.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.ЗаказКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.ЗаказКлиента = Заказ.Ссылка)
		|			И (РеализацияТоваровУслуг.Проведен = ИСТИНА)
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК ЕстьДокумент
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеИСписаниеБонусныхБаллов КАК НачислениеИСписаниеБонусныхБаллов
		|		ПО (ВТ_Основания.Ссылка = НачислениеИСписаниеБонусныхБаллов.Документ)
		|ГДЕ
		|	НачислениеИСписаниеБонусныхБаллов.Проведен = ИСТИНА
		|	И НачислениеИСписаниеБонусныхБаллов.МаркетинговоеМероприятие = &МаркетинговоеМероприятие
		|	И НачислениеИСписаниеБонусныхБаллов.Причина = &Причина";

	
	Запрос.УстановитьПараметр("МаркетинговоеМероприятие", МаркетинговоеМероприятие);
	Запрос.УстановитьПараметр("Причина", Причина);
	Запрос.УстановитьПараметр("Ссылка", Документ);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьНоменклатуруДляРасчета(МассивОснований) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка В(&Ссылка)
		|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ЗаказКлиентаТовары.Номенклатура В ИЕРАРХИИ (&ГрТара)
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.НомерСтроки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка В(&Ссылка)
		|	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ РеализацияТоваровУслугТовары.Номенклатура В ИЕРАРХИИ (&ГрТара)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМТовары.Номенклатура,
		|	ЧекККМТовары.НомерСтроки
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка В(&Ссылка)
		|	И ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&ГрТара)";
	
	Запрос.УстановитьПараметр("ГрТара", Справочники.Номенклатура.НайтиПоКоду("00448      "));
	Запрос.УстановитьПараметр("Ссылка", МассивОснований);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ДокументОплачен(Объект, НовыйПорядокНачисления = Ложь) Экспорт
	
	//Если  Тогда
	//	Если НовыйПорядокНачисления И БонусыАльтерраРезерв.ПолучитьСтрокиИзРеализацийПоЗаказу(Объект.Ссылка).Выгрузить().Количество() > 0 Тогда
	//		Отбор = Новый Структура("ДокументОтгрузки", Объект.Ссылка);
	//		ТаблицаОстатков = РегистрыНакопления.ТоварыКОтгрузке.Остатки(,Отбор);
	//		Возврат ТаблицаОстатков.Количество() = 0; 
	//	Иначе
	//		Возврат ЗначениеЗаполнено(Объект.Кассир);
	//	КонецЕсли;
	//Иначе
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Возврат ЗначениеЗаполнено(Объект.Кассир);
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЧекККМ") Тогда
		Возврат Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЕстьЗапретНаБонусы(Объект, РазрешитьЮЛ = Ложь, НовыйПорядокНачисления = Ложь);    
	
	Запрет = Ложь;
	Если Не БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер, РазрешитьЮЛ) Тогда
		Запрет = Истина;
	КонецЕсли;
	Если НовыйПорядокНачисления Тогда
		Если БонусыАльтерраРезерв.ПроверитьЗапретБонусов(Объект, РазрешитьЮЛ, Ложь) Тогда
			Запрет = Истина;
		КонецЕсли;
	Иначе
		Если БонусыАльтерра.ПроверитьЗапретБонусов(Объект, РазрешитьЮЛ) Тогда
			Запрет = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрет;
КонецФункции

Функция РассчитатьСкидкиНаценкиВДокументе(Объект) 
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Объект, "РеализацияПоЗаказам") Тогда
		СтруктураПараметры.Вставить("РеализацияСверхЗаказа", Объект.РеализацияПоЗаказам)
	КонецЕсли;

	ПримененныеСкидки = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	Объект.СкидкиРассчитаны = Истина;    
	
	Если  ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		Объект.ЭтапыГрафикаОплаты.Очистить();
		ВзаимоРасчетыСервер.ПроверитьЗаполнитьЭтапыГрафикаОплаты(Объект); 
	КонецЕсли;
КонецФункции
#КонецОбласти

#КонецЕсли
