&НаКлиенте
Перем ВыполняетсяЗакрытие;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьПоВидуАкции();
	УстановитьВидимостьПоАлгоритму();
	УстановитьВидимостьПоНоменклатуреОбщаяСтраница();
	УстановитьВидимостьПоНоменклатуре();
	УстановитьВидимостьПоПартнеру();
	УстановитьДоступность();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормыГруппыОсновное

&НаКлиенте
Процедура Док__ВидАкцииПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьПоВидуАкции();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормыГруппыУсловияАкции

&НаКлиенте
Процедура Док_КлиентПриИзмененииПосле(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		Объект.СегментПартнеров="";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_СегментПартнеровПриИзмененииПосле(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СегментПартнеров) Тогда
		 Объект.Клиент="";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_АлгоритмПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьПоАлгоритму();
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТипОтбораПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьПоНоменклатуре();
	ПоказатьИнформациюБезБонусовПриЗакрытии()
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТипОтбора1ПриИзмененииПосле(Элемент)
	УстановитьВидимостьПоНоменклатуреОбщаяСтраница();
КонецПроцедуры

&НаКлиенте
Процедура Док_ТипОтбора2ПриИзмененииПосле(Элемент)
	УстановитьВидимостьПоПартнеру();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Док__ЗагрузитьИзExcelПосле(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект,"ТоварыАкции"); 
	ПараметрыФормы = Новый Структура("ИмяТаблицы,Колонки","Товары","Код,Наименование,Подразделение");
	ОткрытьФорму("Справочник.МаркетинговыеМероприятия.Форма.Док_Форма_ЗагрузкаExel",ПараметрыФормы,ЭтаФорма,,,,Оповещение,);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействия

&НаКлиенте
Процедура Док_ДействияПриАктивизацииСтрокиПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Действия.ТекущиеДанные;
	
	Если Не ТекущаяСтрока = Неопределено Тогда
		Элементы._НадписьДействия.Заголовок = СформироватьСтрокуПоРеквизитамЭлементаСправочника(ТекущаяСтрока.Действие);
	Иначе
		Элементы._НадписьДействия.Заголовок = "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьВидимостьПоНоменклатуре()
		
	Элементы.ТоварыАкции.Видимость = (Объект.ТипОтбора = Перечисления.ТипОтбора.ПоСписку);
    Элементы.СегментНоменклатуры.Видимость = (Объект.ТипОтбора = Перечисления.ТипОтбора.ПоСегменту);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоПартнеру()
		
	Элементы.ПартнерыАкции.Видимость = (Объект.ТипОтбораПартнер = Перечисления.ТипОтбора.ПоСписку);
    Элементы.СегментПартнеров.Видимость = (Объект.ТипОтбораПартнер = Перечисления.ТипОтбора.ПоСегменту);

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	Элементы.Завершено.Доступность = РольДоступна("ПолныеПрава");
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоНоменклатуреОбщаяСтраница()
		
	Элементы.ТоварыАкции1.Видимость = (Объект.ТипОтбора = Перечисления.ТипОтбора.ПоСписку);
    Элементы.СегментНоменклатуры1.Видимость = (Объект.ТипОтбора = Перечисления.ТипОтбора.ПоСегменту);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоАлгоритму()
	
	Элементы.Промокод.Видимость = (Объект.Алгоритм = Перечисления.АлгоритмыАкций.ЗаПромокод);
    Элементы._ГруппаОтборКлиентов.Видимость = Не (Объект.Алгоритм = Перечисления.АлгоритмыАкций.ЗаПромокод);
	Элементы._ГруппаОтборТоваров.Видимость = Не (Объект.Алгоритм = Перечисления.АлгоритмыАкций.ЗаПромокод);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоВидуАкции()
	
	Элементы._ГруппаУсловияАкции.Видимость = (Объект.ВидАкции = Перечисления.ВидыАкций.Алгоритм);
    Элементы._ТоварыАкции.Видимость = НЕ (Объект.ВидАкции = Перечисления.ВидыАкций.Алгоритм);

КонецПроцедуры


&НаСервере
Функция СформироватьСтрокуПоРеквизитамЭлементаСправочника(Действие)
	
	Возврат ?(Не Действие.Пустая(),"Тип - "+Строка(Действие.Тип)+ ?(ЗначениеЗаполнено(Действие.ПроцентБонусов), ", Процент бонусов - " + Строка(Действие.ПроцентБонусов),"") 
	+ ?(ЗначениеЗаполнено(Действие.СтатусУчастникаБонуснойПрограммы), ", Статус участника бонусной программы - " + Строка(Действие.СтатусУчастникаБонуснойПрограммы),"") + ?(ЗначениеЗаполнено(Действие.ВидЦены), ", Вид цены - " + Строка(Действие.ВидЦены),"")
	+ ?(ЗначениеЗаполнено(Действие.СуммаБонусов), ", Сумма бонусов - " + Строка(Действие.СуммаБонусов),"") + ?(ЗначениеЗаполнено(Действие.Причина), ", Причина - " + Строка(Действие.Причина), ""),"");
	
КонецФункции

&НаКлиенте 
Процедура ЗагрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ЗагрузкаЗавершениеСервер(Результат, ДополнительныеПараметры);
КонецПроцедуры 

&НаСервере 
Процедура ЗагрузкаЗавершениеСервер(Результат, ДополнительныеПараметры)
	Если Результат <> Неопределено тогда
		 Объект[ДополнительныеПараметры].Загрузить(Результат.Выгрузить());	
	конецесли;
КонецПроцедуры 

&НаКлиенте
Процедура Док_ДействияПередНачаломДобавленияПосле(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Действия.Количество()=1 Тогда
		Сообщить("Больше одного действия добавить нельзя!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗагрузитьИзExcelТоварыАкцииПосле(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект,"ТоварыАкции"); 
	ПараметрыФормы = Новый Структура("ИмяТаблицы,Колонки","ТоварыАкции","ВидНоменклатуры,ГруппаНоменклатуры,Номенклатура,Процент,ВидЦены");
	ОткрытьФорму("Справочник.МаркетинговыеМероприятия.Форма.Док_Форма_ЗагрузкаExel",ПараметрыФормы,ЭтаФорма,,,,Оповещение,);

КонецПроцедуры

&НаКлиенте
Процедура Док__ЗагрузитьИзExcelПартнерыАкцииПосле(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект,"ПартнерыАкции"); 
	ПараметрыФормы = Новый Структура("ИмяТаблицы,Колонки","ПартнерыАкции","СегментПартнеров,Партнер,Свойство,Значение");
	ОткрытьФорму("Справочник.МаркетинговыеМероприятия.Форма.Док_Форма_ЗагрузкаExel",ПараметрыФормы,ЭтаФорма,,,,Оповещение,);

КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	

	Если Объект.ВидАкции = ПредопределенноеЗначение("Перечисление.ВидыАкций.Алгоритм") Тогда
		
		СообщениеОшибки = "";
		
		Если Объект.Действия.Количество()=0 Тогда
			СообщениеОшибки = СообщениеОшибки + "Укажите действия в табличной части." + Символы.ПС;
		КонецЕсли;
		
		Если Объект.Алгоритм = ПредопределенноеЗначение("Перечисление.АлгоритмыАкций.ЗаПромокод") Тогда
			Если Не ПустаяСтрока(СообщениеОшибки) Тогда
				Сообщить(СообщениеОшибки);
				Отказ = Истина;
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТипОтбора) Тогда
			СообщениеОшибки = СообщениеОшибки + "Укажите тип отбора номенклатуры." + Символы.ПС;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТипОтбораПартнер) Тогда
			СообщениеОшибки = СообщениеОшибки + "Укажите тип отбора партнера." + Символы.ПС;
		КонецЕсли;  
		
		Если ПроверкаЗаполненияТаблицыТоварыАкции() Тогда 
			СообщениеОшибки = СообщениеОшибки + "Присутствуют пустые строки в таблице товары Акции" + Символы.ПС;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СообщениеОшибки) Тогда
			Сообщить(СообщениеОшибки);
			Отказ = Истина;
		КонецЕсли

	КонецЕсли; 
						
КонецПроцедуры  

&НаСервере
Функция ПроверкаЗаполненияТаблицыТоварыАкции()
	
	Для каждого Строка из Объект.ТоварыАкции Цикл 
			Если Строка.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка() 
				И Строка.ГруппаНоменклатуры = Справочники.Номенклатура.ПустаяСсылка() 
				И Строка.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда 
				
					Возврат Истина; 
				КонецЕсли; 
			КонецЦикла;
			Возврат Ложь; 
КонецФункции

#Область ИнформацияПоЦеновымГРуппамБезБонусов

&НаКлиенте
Процедура Док_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ВыполняетсяЗакрытие Тогда
		СообщениеБезБонусов = ПроверитьЦеновыеГруппыБезБонусов(); 
	
		Если СообщениеБезБонусов <> "" Тогда   
			
			СообщениеБезБонусов = 
				"В этом маркетинговом мероприятии присутствует товар, 
				|относящийся к ценовым группам без начисления бонусов:"
				+ СообщениеБезБонусов;

	    	Отказ = Истина;
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), СообщениеБезБонусов, 0, "Бонусы начислены не будут");
	
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Параметры) Экспорт
	ВыполняетсяЗакрытие = Истина;
    Закрыть();
КонецПроцедуры

&НаСервере
Функция ПроверитьЦеновыеГруппыБезБонусов() 
	
	ТекстСообщения = "";
	
	Если Не Объект.ПометкаУдаления И Не Объект.Завершено И Объект.ДатаОкончания >= НачалоДня(ТекущаяДата()) 
		И Объект.Алгоритм = ПредопределенноеЗначение("Перечисление.АлгоритмыАкций.ЗаТовар")
		И Объект.Действия.Количество() > 0  
		И (Объект.Действия[0].Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом 
			Или Объект.Действия[0].Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой) Тогда
		
		Запрос = Новый Запрос;  
		Запрос.Текст = "	
			|ВЫБРАТЬ 
			|	ЦеноваяГруппа,
			|	ДатаОкончанияДействия
			|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусовПоследние
			|ИЗ
			|	РегистрСведений.ЦеновыеГруппыБезБонусов.СрезПоследних(&Дата)
			|;
			|////////////////////////////////////////////////////////////////////////////////     
			|ВЫБРАТЬ 
			|	ЦеноваяГруппа
			|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусов
			|ИЗ
			|	втЦеновыеГруппыБезБонусовПоследние
			|ГДЕ 
			|	ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)  
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ 
			|	ЦеноваяГруппа    
			|ИЗ
			|	втЦеновыеГруппыБезБонусовПоследние
			|ГДЕ 
			|	ДатаОкончанияДействия >= &Дата
			|;";
		
		Если Объект.ТипОтбора = ПредопределенноеЗначение("Перечисление.ТипОтбора.ПоВсемЭлементам") Тогда   
			
			Запрос.Текст = Запрос.Текст + "	
				|ВЫБРАТЬ 
				|    втЦеновыеГруппыБезБонусов.ЦеноваяГруппа,
				|    ЦеновыеГруппы.Наименование КАК ЦеноваяГруппаНаименование		
				|ИЗ 
				|	втЦеновыеГруппыБезБонусов 
				|	СОЕДИНЕНИЕ 
				|		Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
				|		ПО втЦеновыеГруппыБезБонусов.ЦеноваяГруппа = ЦеновыеГруппы.Ссылка";	
			
		Иначе	// Отборы по сегменту и списку
			
			Запрос.Текст = Запрос.Текст + "	
				|ВЫБРАТЬ
				|	 СпрНоменклатура.Ссылка КАК Номенклатура,
				|    втЦеновыеГруппыБезБонусов.ЦеноваяГруппа,
				|    втЦеновыеГруппыБезБонусов.ЦеноваяГруппа.Наименование КАК ЦеноваяГруппаНаименование		
				|ПОМЕСТИТЬ 
				|	втНоменклатураБезБонусов
				|ИЗ 
				|	Справочник.Номенклатура КАК СпрНоменклатура
				|	СОЕДИНЕНИЕ 
				|		втЦеновыеГруппыБезБонусов  
				|	ПО  СпрНоменклатура.ЦеноваяГруппа = втЦеновыеГруппыБезБонусов.ЦеноваяГруппа			
				|;";
			
			
			// Отборы по сегменту
			Если Объект.ТипОтбора = ПредопределенноеЗначение("Перечисление.ТипОтбора.ПоСегменту") Тогда   
				
				Запрос.Текст = Запрос.Текст + "					
					|ВЫБРАТЬ РАЗЛИЧНЫЕ 
					|	Номенклатура   
					|ПОМЕСТИТЬ 
					|	втНоменклатураМероприятия
					|ИЗ 
					|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
					|ГДЕ 
					|	Сегмент = &Сегмент  
					|;";  
				
				Запрос.УстановитьПараметр("Сегмент", Объект.СегментНоменклатуры);
				
			Иначе // Отборы по списку    
				
				Запрос.Текст = Запрос.Текст + "					
					|ВЫБРАТЬ 
					| Номенклатура   
					|ПОМЕСТИТЬ 
					|	втНоменклатураМероприятия
					|ИЗ 
					|	&ТаблицаНоменклатурыМероприятия КАК ТаблицаНоменклатурыМероприятия
					|;";  
				
				ТЗНоменклатурыМероприятия = Новый ТаблицаЗначений;    
				ТЗНоменклатурыМероприятия.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
				
				Для Каждого СтрокаТовары Из Объект.ТоварыАкции Цикл
					
					Если ЗначениеЗаполнено(СтрокаТовары.ВидНоменклатуры) Или ЗначениеЗаполнено(СтрокаТовары.ГруппаНоменклатуры) Тогда
					
						Если ЗначениеЗаполнено(СтрокаТовары.ВидНоменклатуры) Тогда	
							ТЗ = ПолучитьНоменклатуруПоВиду(СтрокаТовары.ВидНоменклатуры); 
						Иначе	
							ТЗ = ПолучитьНоменклатуруПоГруппе(СтрокаТовары.ГруппаНоменклатуры); 	
						КонецЕсли;	
						
						Если ТЗ.Количество() > 0 Тогда
							Для Счетчик = 1 По ТЗ.Количество() Цикл
								ТЗНоменклатурыМероприятия.Вставить(0);	
							КонецЦикла;        
							ТЗНоменклатурыМероприятия.ЗагрузитьКолонку(ТЗ.ВыгрузитьКолонку(0), 0);
						КонецЕсли;
						
					Иначе // Номенклатура
						СтрокаНоменклатурыМероприятия = ТЗНоменклатурыМероприятия.Добавить();
						СтрокаНоменклатурыМероприятия.Номенклатура = СтрокаТовары.Номенклатура;
					КонецЕсли;  
					
				КонецЦикла; 
				
				Запрос.УстановитьПараметр("ТаблицаНоменклатурыМероприятия", ТЗНоменклатурыМероприятия);
				
			КонецЕсли;   
				
			Запрос.Текст = Запрос.Текст + "	
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|    втНоменклатураБезБонусов.ЦеноваяГруппа,
				|    втНоменклатураБезБонусов.ЦеноваяГруппаНаименование		
				|ИЗ 
				|	втНоменклатураМероприятия
				|	СОЕДИНЕНИЕ 
				|		втНоменклатураБезБонусов
				|	ПО втНоменклатураМероприятия.Номенклатура = втНоменклатураБезБонусов.Номенклатура
				|УПОРЯДОЧИТЬ ПО 
				|	втНоменклатураБезБонусов.ЦеноваяГруппаНаименование		
				|;";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл        
			ТекстСообщения = ТекстСообщения + Символы.ПС + Выборка.ЦеноваяГруппаНаименование;
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстСообщения;
КонецФункции	

&НаСервере
Функция ПолучитьНоменклатуруПоВиду(ВидНоменклатуры)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура 
		|ГДЕ
		|	ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
		
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуруПоГруппе(ГруппаНоменклатуры)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура 
		|ГДЕ
		|	Родитель В ИЕРАРХИИ(&ГруппаНоменклатуры)";
	
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);
		
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции 

&НаКлиенте
Процедура Док_ТоварыАкцииПриИзмененииПосле(Элемент)
	ПоказатьИнформациюБезБонусовПриЗакрытии()	
КонецПроцедуры

&НаКлиенте
Процедура Док_СегментНоменклатурыПриИзмененииПосле(Элемент)
	ПоказатьИнформациюБезБонусовПриЗакрытии()
КонецПроцедуры    

&НаКлиенте
Процедура ПоказатьИнформациюБезБонусовПриЗакрытии()
    ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаНачалаПриИзмененииПосле(Элемент)
	Объект.ПлановаяДатаНачала = Объект.ДатаНачала;
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаОкончанияПриИзмененииПосле(Элемент)
	Объект.ПлановаяДатаОкончания = Объект.ДатаОкончания;
КонецПроцедуры


#КонецОбласти

#КонецОбласти

ВыполняетсяЗакрытие = Ложь;
