
&ИзменениеИКонтроль("ПроверитьДатуЗапретаПоТаблицеИзменений")
Процедура Док_ПроверитьДатуЗапретаПоТаблицеИзменений(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ)

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	ШаблонЗапроса = "
	|ВЫБРАТЬ
	|	МИНИМУМ(Таблица.Период) КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.ИмяРегистра КАК ИмяРегистра,
	|	Таблица.РазделДатыЗапрета КАК РазделДатыЗапрета
	|ИЗ
	|	&КоллекцияДанных КАК Таблица
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Организация,
	|	Таблица.РазделДатыЗапрета,
	|	Таблица.ИмяРегистра
	|;
	|";

	ТекстВложенногоЗапроса = "";
	ТекстЗапросаВременныхТаблиц = "";
	ИменаВременныхТаблиц = "";

	ДополнитьТекстЗапросаКонтроля(
	Запрос,
	ТекстВложенногоЗапроса,
	ТекстЗапросаВременныхТаблиц,
	ИменаВременныхТаблиц,
	Механизмы);

	ТекстУничтожитьВт = ЗакрытиеМесяцаСервер.ТестЗапросаУничтоженияВременныхТаблиц(ИменаВременныхТаблиц);

	Если ЗначениеЗаполнено(ТекстВложенногоЗапроса) Тогда // есть хотя бы один контрольный регистр.
		Запрос.Текст = ТекстЗапросаВременныхТаблиц
		+ СтрЗаменить(ШаблонЗапроса, "&КоллекцияДанных", "(" + ТекстВложенногоЗапроса + ")")
		+ ТекстУничтожитьВт;

		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл
			ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();

			НоваяСтрока = ДанныеДляПроверки.Добавить();
			НоваяСтрока.Дата   = НачалоДня(Выборка.Период);
			НоваяСтрока.Объект = Выборка.Организация;
			НоваяСтрока.Раздел = Выборка.РазделДатыЗапрета;

			ОписаниеОшибки = НСтр("ru = 'Изменяемые данные находятся в закрытом периоде.'");
			Движения = Документ.Движения[Выборка.ИмяРегистра];
			#Вставка
			Если ТипЗнч(Движения) = Тип("РегистрНакопленияНаборЗаписей.УслугиКОформлениюОтчетовПринципалу") И 
				(ТипЗнч(Документ) = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ 
				ТипЗнч(Документ) = Тип("ДокументОбъект.ОтчетОРозничныхПродажах") ИЛИ 
				ТипЗнч(Документ) = Тип("ДокументОбъект.КорректировкаРеализации") ИЛИ 
				ТипЗнч(Документ) = Тип("ДокументОбъект.КорректировкаНазначенияТоваров")) Тогда
					Продолжить;
			КонецЕсли;
			#КонецВставки
			Если Движения.ДополнительныеСвойства.Свойство("ПроверкаДатыЗапретаИзменения") 
				И НЕ Движения.ДополнительныеСвойства.ПроверкаДатыЗапретаИзменения Тогда
				Продолжить
			КонецЕсли;
			Если Движения.ДополнительныеСвойства.Свойство("ПропуститьПроверкуЗапретаИзменения") 
				И Движения.ДополнительныеСвойства.ПропуститьПроверкуЗапретаИзменения Тогда
				Продолжить
			КонецЕсли;
			Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, 
				Новый Структура("НоваяВерсия, Данные", Истина, Документ.Движения[Выборка.ИмяРегистра]),
				ОписаниеОшибки) Тогда
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки, ,,,Отказ);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
