
&НаКлиенте
Процедура Загрузить(Команда)
	ОткрытьФорму("РегистрСведений.СтоимостьРазгрузки.Форма.ФормаЗагрузки");
КонецПроцедуры


&НаСервере
Процедура ПоказатьВсеПриИзмененииНаСервере()
		
	Если ЭтаФорма.ПоказатьВсе Тогда 		
		ЭтаФорма.Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "РегистрСведений.СтоимостьРазгрузки.СрезПоследних", "РегистрСведений.СтоимостьРазгрузки"); 
		ЭтаФорма.Список.ОсновнаяТаблица = "РегистрСведений.СтоимостьРазгрузки";  
	Иначе
		ЭтаФорма.Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "РегистрСведений.СтоимостьРазгрузки", "РегистрСведений.СтоимостьРазгрузки.СрезПоследних");
		ЭтаФорма.Список.ОсновнаяТаблица = "РегистрСведений.СтоимостьРазгрузки.СрезПоследних"; 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсеПриИзменении(Элемент)
	ПоказатьВсеПриИзмененииНаСервере();
КонецПроцедуры

