			  
#Область РаботаСДопРеквизитамиНаФорме 

Функция ПолучитьПолеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита) Экспорт 
	
	Список = Форма.Свойства_ОписаниеДополнительныхРеквизитов;
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяРеквизита);
	
	Если ЗначениеЗаполнено(Свойство) Тогда
	    НайденныеСтроки = Список.НайтиСтроки(Новый Структура("Свойство", Свойство));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0];		
		КонецЕсли; 		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначениеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита) Экспорт
	
	ПолеДополнительногоРеквизитаНаФорме = ПолучитьПолеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита);
	
	Если ПолеДополнительногоРеквизитаНаФорме <> Неопределено Тогда
		Возврат Форма[ПолеДополнительногоРеквизитаНаФорме.ИмяРеквизитаЗначение];
	КонецЕсли;
	
КонецФункции

Процедура УстановитьЗначениеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	ПолеДополнительногоРеквизитаНаФорме = ПолучитьПолеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита);
	
	Если ПолеДополнительногоРеквизитаНаФорме <> Неопределено Тогда
		Форма[ПолеДополнительногоРеквизитаНаФорме.ИмяРеквизитаЗначение] = ЗначениеРеквизита;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереместитьДополнительныйРеквизит(Форма, ИмяРеквизита, ИмяГруппы, Доступность = Истина) Экспорт
	
	Попытка
		Поле = ПолучитьПолеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита);
		Группа = Форма.Элементы.Найти(ИмяГруппы); 
		ПолеФормы = Форма.Элементы[Поле.ИмяРеквизитаЗначение];
		Если ПолеФормы <> Неопределено Тогда
			Форма.Элементы.Переместить(ПолеФормы, Группа); 
			ПолеФормы.Доступность = Доступность;
		КонецЕсли; 
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Ошибка при перемещении доп. реквизита '" + ИмяРеквизита + "' в группу '" + ИмяГруппы + "'!");
	КонецПопытки;
	
КонецПроцедуры  

Функция КонтрагентРаботаетВЭДО(Контрагент) экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		|ГДЕ
		|	КонтрагентыДополнительныеРеквизиты.Ссылка = &Контрагент
		|	И КонтрагентыДополнительныеРеквизиты.Свойство.Имя = ""УчастникЭДО""
		|	И КонтрагентыДополнительныеРеквизиты.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
возврат не РезультатЗапроса.Пустой();	

КонецФункции // КонтрагентРаботаетВЭДО()

#КонецОбласти

Функция СуммаПеремещения(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка.ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Количество,
	|	СУММА(ПеремещениеТоваровТовары.Количество * ЦеныНоменклатурыСрезПоследних.Цена) КАК Сумма
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаДокумента, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.Ссылка.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Объект
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Ссылка.ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Количество
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДатаДокумента", объект.Дата);
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		
	
	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	КонецЦикла;
	
	Возврат ВыборкаОбщийИтог.Сумма;
КонецФункции

Функция ПолучитьПользователя() Экспорт
	возврат параметрыСеанса.ТекущийПользователь;
конецфункции	

Процедура УстановкаОтметкиКассы(ОбъектСпис) экспорт
	
	объект=объектСпис.Получитьобъект();
	
	если Объект.Кассир.Пустая() тогда
		Объект.Кассир=ПолучитьПользователя();
		
	иначе		
		Объект.Кассир="";
	конецесли;
	
	объект.Записать();
	
КонецПроцедуры

Функция ПолучитьКассуПоУмолчанию(Организация, Валюта = Неопределено) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Кассы.Ссылка КАК Касса
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Не Кассы.ПометкаУдаления
	|	И (Кассы.Владелец = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (Кассы.ВалютаДенежныхСредств = &Валюта
	|		ИЛИ &Валюта = Неопределено)
	|");
	
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 тогда
		Выборка.Следующий();
		Касса = Выборка.Касса;
	Иначе
		Касса = Справочники.Кассы.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Касса;
	
КонецФункции

Процедура ПроверкаНаОтклонениеОтЦеновыхУсловий(Объект, Отказ) Экспорт	
	МассивСообщений = Новый Массив;
	Соглашение = Объект.Соглашение;
	СоглашениеЗаполнено = ЗначениеЗаполнено(Соглашение);	
	
	Запрос = Новый Запрос;
	если НовоеЦенообразование() тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧТовары.НомерСтроки КАК НомерСтроки,
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Характеристика КАК Характеристика,
		|	ТЧТовары.ВидЦены КАК ВидЦены,
		|	ТЧТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки, 
		|	&ПолеОбособленно КАК Обособленно,
		|	ТЧТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ТЧТовары
		|ГДЕ
		|	НЕ &ПолеОбособленно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТТовары КАК ТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашенияСКлиентамиТовары
		|		ПО (СоглашенияСКлиентамиТовары.Ссылка = &Соглашение)
		|			И ТЧТовары.Номенклатура = СоглашенияСКлиентамиТовары.Номенклатура
		|			И ТЧТовары.Характеристика = СоглашенияСКлиентамиТовары.Характеристика
		|			И (СоглашенияСКлиентамиТовары.Цена > 0)
		|ГДЕ
		|	ТЧТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|	И СоглашенияСКлиентамиТовары.Номенклатура.Ссылка ЕСТЬ NULL
		|;
		|" + ?(СоглашениеЗаполнено, "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Характеристика КАК Характеристика,
		|	ТЧТовары.НомерСтроки КАК НомерСтроки,
		|	ТЧТовары.ВидЦены КАК РеализацияВидЦены,
		|	ТЧТовары.Обособленно КАК Обособленно,  
		|	ВидыЦен.Ссылка КАК СоглашенияВидЦеныОбщая,
		|	МАКСИМУМ(ВидыЦенТовары.Ссылка) КАК СоглашенияТоварыВидЦены,
		|	МАКСИМУМ(ВидыЦенЦеновыеГруппы.Ссылка) КАК СоглашенияЦеновыеГруппыВидЦены,
		|	ТЧТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ТЧТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки
		|ИЗ
		|	ВТТовары КАК ТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК Соглашения
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
		|			ПО Соглашения.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
		|				И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
		|				И (ВидыЦен.РегионПрисутствия = &Регионприсутствия)
		|		ПО (Соглашения.Ссылка = &Соглашение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашенияТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ВидыЦен.Ссылка КАК Ссылка,
		|				ВидыЦен.ГруппаВидовЦен КАК ГруппаВидовЦен
		|			ИЗ
		|				Справочник.ВидыЦен КАК ВидыЦен
		|			ГДЕ
		|				ВидыЦен.ФорматПодразделения = &ФорматПодразделения
		|				И ВидыЦен.РегионПрисутствия = &РегионПрисутствия) КАК ВидыЦенТовары
		|			ПО СоглашенияТовары.ГруппаВидовЦен = ВидыЦенТовары.ГруппаВидовЦен
		|		ПО (СоглашенияТовары.Ссылка = &Соглашение)
		|			И ТЧТовары.Номенклатура = СоглашенияТовары.Номенклатура
		|			И ТЧТовары.Характеристика = СоглашенияТовары.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашенияЦеновыеГруппы
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ВидыЦен.Ссылка КАК Ссылка,
		|				ВидыЦен.ГруппаВидовЦен КАК ГруппаВидовЦен
		|			ИЗ
		|				Справочник.ВидыЦен КАК ВидыЦен
		|			ГДЕ
		|				ВидыЦен.ФорматПодразделения = &ФорматПодразделения
		|				И ВидыЦен.РегионПрисутствия = &РегионПрисутствия) КАК ВидыЦенЦеновыеГруппы
		|			ПО СоглашенияЦеновыеГруппы.ГруппаВидовЦен = ВидыЦенЦеновыеГруппы.ГруппаВидовЦен
		|		ПО (СоглашенияЦеновыеГруппы.Ссылка = &Соглашение)
		|			И ТЧТовары.Номенклатура.ЦеноваяГруппа = СоглашенияЦеновыеГруппы.ЦеноваяГруппа
		|ГДЕ
		|	ТЧТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧТовары.Номенклатура,
		|	ТЧТовары.Характеристика,
		|	ТЧТовары.НомерСтроки,
		|   ТЧТовары.Обособленно,
		|	ТЧТовары.ВидЦены,
		|	ВидыЦен.Ссылка,
		|	ТЧТовары.ПроцентРучнойСкидки,
		|	ТЧТовары.СуммаРучнойСкидки","");
		Запрос.УстановитьПараметр("ФорматПодразделения", Объект.Подразделение.ФорматПодразделения);
		Запрос.УстановитьПараметр("Регионприсутствия", Объект.Подразделение.Регионприсутствия);
	иначе         
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧТовары.НомерСтроки КАК НомерСтроки,
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Характеристика КАК Характеристика,
		|	ТЧТовары.ВидЦены КАК ВидЦены,
		|	&ПолеОбособленно КАК Обособленно,
		|	ТЧТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ТЧТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ТЧТовары
		|ГДЕ
		|	НЕ &ПолеОбособленно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТТовары КАК ТЧТовары
		|ГДЕ
		|	ТЧТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|;
		|" + ?(СоглашениеЗаполнено, "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Характеристика КАК Характеристика,
		|	ТЧТовары.НомерСтроки КАК НомерСтроки,
		|	ТЧТовары.ВидЦены КАК РеализацияВидЦены,
		|	Соглашения.ВидЦен КАК СоглашенияВидЦеныОбщая,
		|	МАКСИМУМ(СоглашенияТовары.ВидЦены) КАК СоглашенияТоварыВидЦены,
		|	МАКСИМУМ(СоглашенияЦеновыеГруппы.ВидЦен) КАК СоглашенияЦеновыеГруппыВидЦены,
		|	ТЧТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ТЧТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки
		|ИЗ
		|	ВТТовары КАК ТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК Соглашения
		|		ПО (Соглашения.Ссылка = &Соглашение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашенияТовары
		|		ПО (СоглашенияТовары.Ссылка = &Соглашение)
		|			И ТЧТовары.Номенклатура = СоглашенияТовары.Номенклатура
		|			И ТЧТовары.Характеристика = СоглашенияТовары.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашенияЦеновыеГруппы
		|		ПО (СоглашенияЦеновыеГруппы.Ссылка = &Соглашение)
		|			И ТЧТовары.Номенклатура.ЦеноваяГруппа = СоглашенияЦеновыеГруппы.ЦеноваяГруппа
		|ГДЕ
		|	ТЧТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧТовары.Номенклатура,
		|	ТЧТовары.Характеристика,
		|	ТЧТовары.НомерСтроки,
		|	ТЧТовары.ВидЦены,
		|	Соглашения.ВидЦен,
		|	ТЧТовары.ПроцентРучнойСкидки,
		|	ТЧТовары.СуммаРучнойСкидки", "");
		
	Конецесли;                              
	если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") тогда
		Запрос.Текст=стрзаменить(Запрос.Текст,"&ПолеОбособленно","ТЧТовары.Обособленно"); 
	иначеесли ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") тогда
		Запрос.Текст=стрзаменить(Запрос.Текст,"&ПолеОбособленно","ТЧТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)");
	иначе
		Запрос.Текст=стрзаменить(Запрос.Текст,"&ПолеОбособленно","ложь"); 
	конецесли;	
	
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	СписокПакетов = Запрос.ВыполнитьПакет();
	Если Не СписокПакетов[1].Пустой() Тогда
		РезультатЗапроса = СписокПакетов[1].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			МассивСообщений.Добавить("Существует отклонение от ценовых условий! Необходимо заполнить реквизит 'Причина отклонения от ценовых условий'! (По строке №" + РезультатЗапроса.НомерСтроки + " не заполнен 'Вид цены')");
		КонецЦикла;
	КонецЕсли;  
	
	Если СоглашениеЗаполнено Тогда
		РезультатЗапроса = СписокПакетов[2].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			Если ЗначениеЗаполнено(РезультатЗапроса.СоглашенияТоварыВидЦены) Тогда 
				//Если РезультатЗапроса.РеализацияВидЦены <> ?(РезультатЗапроса.Обособленно,ПодобратьВидЦеныТСК(РезультатЗапроса.СоглашенияТоварыВидЦены),РезультатЗапроса.СоглашенияТоварыВидЦены)  Тогда 
				Если РезультатЗапроса.РеализацияВидЦены <>РезультатЗапроса.СоглашенияТоварыВидЦены тогда
					МассивСообщений.Добавить("Существует отклонение от ценовых условий! Необходимо заполнить реквизит 'Причина отклонения от ценовых условий'! (По строке №" + РезультатЗапроса.НомерСтроки + " 'Вид цены' отличается от данных по документу Соглашения (Уточнение цен по товарам), " + РезультатЗапроса.РеализацияВидЦены + " <> " + РезультатЗапроса.СоглашенияТоварыВидЦены + ")"); 
				КонецЕсли; 
			ИначеЕсли ЗначениеЗаполнено(РезультатЗапроса.СоглашенияЦеновыеГруппыВидЦены) Тогда 
				Если РезультатЗапроса.РеализацияВидЦены <> РезультатЗапроса.СоглашенияЦеновыеГруппыВидЦены Тогда
					МассивСообщений.Добавить("Существует отклонение от ценовых условий! Необходимо заполнить реквизит 'Причина отклонения от ценовых условий'! (По строке №" + РезультатЗапроса.НомерСтроки + " 'Вид цены' отличается от данных по документу Соглашения (Уточнение цен по ценовым группам), " + РезультатЗапроса.РеализацияВидЦены + " <> " + РезультатЗапроса.СоглашенияЦеновыеГруппыВидЦены + ", Ценовая группа: '" + РезультатЗапроса.Номенклатура.ЦеноваяГруппа + "')"); 
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(РезультатЗапроса.СоглашенияВидЦеныОбщая) Тогда 
				Если РезультатЗапроса.РеализацияВидЦены <> РезультатЗапроса.СоглашенияВидЦеныОбщая Тогда
					МассивСообщений.Добавить("Существует отклонение от ценовых условий! Необходимо заполнить реквизит 'Причина отклонения от ценовых условий'! (По строке №" + РезультатЗапроса.НомерСтроки + " 'Вид цены' отличается от данных по документу Соглашения, " + РезультатЗапроса.РеализацияВидЦены + " <> " + РезультатЗапроса.СоглашенияВидЦеныОбщая + ")"); 	
				КонецЕсли; 
			Иначе
				МассивСообщений.Добавить("Для выбранного в документе Соглашения не заполнен реквизит 'Вид цены'! (Ошибка по строке №" + РезультатЗапроса.НомерСтроки + ")");
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(РезультатЗапроса.ПроцентРучнойСкидки) ИЛИ ЗначениеЗаполнено(РезультатЗапроса.СуммаРучнойСкидки) Тогда
				Если Объект.РаспределитьТранспортныеДистрибуция Тогда                                             
					Если Объект.ПричинаОтклоненияОтЦеновыхУсловий = "" Тогда 
						Объект.ПричинаОтклоненияОтЦеновыхУсловий = "Ручная скидка при распределении транспортных дистрибуция";
					КонецЕсли;
				ИначеЕсли РезультатЗапроса.ПроцентРучнойСкидки <> 0 ИЛИ РезультатЗапроса.СуммаРучнойСкидки <>0 Тогда 
					Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
						МассивСообщений.Добавить("Была поставлена ручная скидка или наценка! Существует отклонение от ценовых условий! Необходимо заполнить реквизит 'Причина отклонения от ценовых условий'!"); 
					Иначе	
						МассивСообщений.Добавить("Существует отклонение от ценовых условий! Необходимо заполнить реквизит 'Причина отклонения от ценовых условий'! (По строке №" + РезультатЗапроса.НомерСтроки + " 'Вид цены' отличается от данных по документу Соглашения, " + РезультатЗапроса.РеализацияВидЦены + " <> " + РезультатЗапроса.СоглашенияВидЦеныОбщая + ")");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивСообщений) Тогда		
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") И 
			ЗначениеЗаполнено(Объект.ЗаказКлиента) И
			ЗначениеЗаполнено(Объект.ЗаказКлиента.ПричинаОтклоненияОтЦеновыхУсловий) Тогда
			Объект.ПричинаОтклоненияОтЦеновыхУсловий = Объект.ЗаказКлиента.ПричинаОтклоненияОтЦеновыхУсловий;
		Иначе
			Для Каждого Сообщение Из МассивСообщений Цикл
				ОбщегоНазначения.СообщитьПользователю(Сообщение);
			КонецЦикла;
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// корректировка
Процедура КорректировкаСкладаДляКорректировкиНазначенияТоваров(Ссылка, Проведен, ПометкаУдаления, НовыйСклад) Экспорт
	Если ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(НовыйСклад) Тогда
		СтарыйСклад = Ссылка.Склад;
		Если ЗначениеЗаполнено(СтарыйСклад) И СтарыйСклад <> НовыйСклад Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
			|ГДЕ
			|	ПриходныйОрдерНаТовары.Распоряжение = &Ссылка
			|	И ПриходныйОрдерНаТовары.Проведен = &Проведен
			|	И ПриходныйОрдерНаТовары.ПометкаУдаления = &ПометкаУдаления";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("Проведен", Проведен);
			Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДокОбъект = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Выборка.Ссылка, Проведен, ПометкаУдаления); 
				Если ЗначениеЗаполнено(ДокОбъект) Тогда
					Попытка
						ДокОбъект.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
					Исключение
						ВызватьИсключение;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			
			ДокОбъект = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Проведен, ПометкаУдаления); 	
			Если ЗначениеЗаполнено(ДокОбъект) Тогда			
				Попытка
					ДокОбъект.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
				Исключение
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьОбъектКорректировки(ДокКорр,ДокР,СтрПост,ВидЗадолженности,ВидКорр)	 
	если СтрПост.Количество()=0 тогда
		Сообщить("Не найдено сопоставление регистра!");
	конецесли;	
	если ДокКорр.Пустая() тогда
		Док=Документы.КорректировкаЗадолженности.СоздатьДокумент();
	иначе
		Док=ДокКорр.ПолучитьОбъект();
	конецесли;	
	
	Док.Дата=ДокР.дата;
	
	если ((ВидЗадолженности="Расход") и (ВидКорр="Клиент")) или ((ВидЗадолженности="Приход") и (ВидКорр="Поставщик")) тогда
		Док.ТипЗадолженности=Перечисления.ТипыЗадолженности.Кредиторская;
		Док.организация=СтрПост.ОрганизацияРеализация;
		Док.Контрагент=СтрПост.КонтрагентРеализация;
		Док.Подразделение=СтрПост.ПодразделениеРеализация;
	иначе
		Док.ТипЗадолженности=Перечисления.ТипыЗадолженности.Дебиторская;
		Док.организация=СтрПост.ОрганизацияПоступление;
		Док.Контрагент=СтрПост.КонтрагентПоступление;
		Док.Подразделение=СтрПост.ПодразделениеПоступление;
	конецесли;
	Док.СтатьяРасходов=СтрПост.СтатьяРасходов;
	Док.Задолженность.Очистить();
	для каждого стрР из ДокР.РасшифровкаПлатежа цикл
		стр=Док.Задолженность.Добавить();
		стр.ВалютаВзаиморасчетов=стрР.ВалютаВзаиморасчетов;
		Стр.Партнер=СтрПост.ПартнерРеализация;
		если ВидКорр="Клиент" тогда
			Стр.ТипРасчетов=Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;	
		иначе
			Стр.ТипРасчетов=Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
		конецесли;
		Стр.Сумма=СтрР.Сумма;
	конеццикла;
	Док.Комментарий="Взаимозачет "+СОКРЛП(ДокР.Ссылка)+" "+СОКРЛП(ДокР.Контрагент)+" на сумму "+ДокР.СуммаДокумента;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	если ВидКорр="Клиент" тогда
		ДокР.Корректировка1=Док.ссылка;
	иначе
		ДокР.Корректировка2=Док.ссылка;
	конецесли;
КонецФункции

Функция ДокументПоступления(ДокументОснования) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ДокументОснования.Ссылка = &ДокументОснования
	|	И ПоступлениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеТоваровУслуг.РеализацияВПоступление = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснования", ДокументОснования.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		ДокументПоступления=ВыборкаДетальныеЗаписи.Ссылка
	иначе
		ДокументПоступления=НЕОПРЕДЕЛЕНО;
	КонецЕсли;
	
	возврат ДокументПоступления;
конецФункции	

Процедура ДвижениеВзаиморасчетовПодразделенияПеремещение(Объект,ТаблицаДвижений,ВидОперации,Подразделение,ПодразделениеКорреспондент) экспорт
	
	Объект.Движения.ВзаиморасчетыСПодразделениями.Записывать=Истина;
	для каждого стр из ТаблицаДвижений цикл
		Движение=Объект.Движения.ВзаиморасчетыСПодразделениями.Добавить();
		Движение.ВидДвижения=Стр.ВидДвижения;
		если Стр.ВидДвижения=ВидДвиженияНакопления.Расход тогда
			Движение.Подразделение=Подразделение;
			Движение.ПодразделениеПолучатель=ПодразделениеКорреспондент;
		иначе
			Движение.Подразделение=ПодразделениеКорреспондент;
			Движение.ПодразделениеПолучатель=Подразделение;
		конецесли;
		Движение.ВидОперации=ВидОперации;
		Движение.Период=Объект.Дата;
		Движение.Сумма=	Стр.Стоимость+Стр.СуммаДопРасходов;
	Конеццикла;
	Объект.Движения.Записать();
	
конецПроцедуры

Процедура ДвижениеВзаиморасчетовПодразделения(Объект,ВидДвижения,ВидОперации,Подразделение,ПодразделениеКорреспондент) экспорт
	Объект.Движения.ВзаиморасчетыСПодразделениями.Записывать=Истина;
	Движение=Объект.Движения.ВзаиморасчетыСПодразделениями.Добавить();
	если ВидДвижения="Расход" тогда
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
	иначе
		Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
	конецесли;
	Движение.Подразделение=Подразделение;
	Движение.ПодразделениеПолучатель=ПодразделениеКорреспондент;
	Движение.ВидОперации=ВидОперации;
	
	Движение.Период=Объект.Дата;
	если ВидДвижения="Расход" тогда
		если типзнч(Объект.ссылка)=тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями") тогда
			Движение.Период=Объект.ДатаПринятия;
		конецесли;	
	конецесли;	
	если ВидДвижения="Приход" тогда
		если типзнч(Объект.ссылка)=тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") тогда
			Движение.Период=Объект.ДатаПринятия;
		конецесли;	
	конецесли;	
	
	если типзнч(Объект.Ссылка)=тип("ДокументСсылка.КорректировкаЗадолженности") тогда
		Движение.Сумма=	Объект.Задолженность.Итог("Сумма");
	иначе
		Движение.Сумма=Объект.СуммаДокумента;
	конецесли;
	Объект.Движения.Записать();
	
конецПроцедуры

Процедура КонтрольОстатков(Объект,Отказ) экспорт
	Возврат;	
КонецПроцедуры	

Процедура КонтрольОстатковПоСебестоимости(Объект, Отказ) Экспорт
	
	Если Отказ ИЛИ Не Константы.КонтролироватьОстаткиТоваровПоСебестоимости.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	Себестоимость.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	Себестоимость.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
		|	Себестоимость.АналитикаУчетаНоменклатуры.СкладскаяТерритория КАК Склад,
		|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Себестоимость.КоличествоКонечныйОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(, , Регистратор, , АналитикаУчетаНоменклатуры В (&МассивАналитики)) КАК Себестоимость
		|ГДЕ
		|	Себестоимость.КоличествоКонечныйОстаток < 0
		|	И Себестоимость.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
		Запрос.УстановитьПараметр("МассивАналитики", Объект.Расхождения.ВыгрузитьКолонку("Номенклатура"));
	Иначе
		Запрос.УстановитьПараметр("МассивАналитики", Объект.ВидыЗапасов.ВыгрузитьКолонку("АналитикаУчетаНоменклатуры"));
	КонецЕсли;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ШаблонСообщения = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
		|Недостаточно на складе %Склад% на %Количество% %Единица% на дату %ДатаДокумента% по себестоимости'");
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристика%",
		НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(-Выборка.Количество));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%",      Строка(Выборка.Склад));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Единица%",    Строка(Выборка.ЕдиницаИзмерения));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДатаДокумента%",    Строка(Объект.Дата));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		ДополнительнаяИнформация(Выборка.Номенклатура, Выборка.Характеристика, Выборка.Назначение, Выборка.Склад, Объект.Дата);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнительнаяИнформация(Номенклатура, Характеристика, Назначение, Склад, ДатаДокумента)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
		|	ЗаказыПоставщикам.Характеристика КАК Характеристика,
		|	ЗаказыПоставщикам.Склад КАК Склад,
		|	ЗаказыПоставщикам.КОформлениюРасход КАК КОформлениюРасход
		|ПОМЕСТИТЬ ВТЗаказыПоставщикам
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(, &ДатаДокумента, , , ) КАК ЗаказыПоставщикам
		|ГДЕ
		|	ЗаказыПоставщикам.КОформлениюПриход <> 0
		|	И ЗаказыПоставщикам.Номенклатура = &Номенклатура
		|	И ЗаказыПоставщикам.Характеристика = &Характеристика
		|	И ЗаказыПоставщикам.Склад = &Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКПоступлению.ДокументПоступления КАК ДокументПоступления,
		|	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлению.Характеристика КАК Характеристика,
		|	ТоварыКПоступлению.Назначение КАК Назначение,
		|	ЗаказыПоставщикам.КОформлениюРасход КАК КОформлениюРасход
		|ПОМЕСТИТЬ ВТИтог
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.ОстаткиИОбороты(, &ДатаДокумента, , , ) КАК ТоварыКПоступлению
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыПоставщикам КАК ЗаказыПоставщикам
		|		ПО (ЗаказыПоставщикам.ЗаказПоставщику = ТоварыКПоступлению.ДокументПоступления)
		|			И (ЗаказыПоставщикам.Номенклатура = ТоварыКПоступлению.Номенклатура)
		|			И (ЗаказыПоставщикам.Характеристика = ТоварыКПоступлению.Характеристика)
		|			И (ЗаказыПоставщикам.Склад = ТоварыКПоступлению.Склад)
		|ГДЕ
		|	ТоварыКПоступлению.КОформлениюПоступленийПоРаспоряжениюРасход + ТоварыКПоступлению.КОформлениюОрдеровРасход <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТоварыКПоступлению.ДокументПоступления КАК ЗаказПоставщику
		|ИЗ
		|	ВТИтог КАК ТоварыКПоступлению
		|ГДЕ
		|	ТоварыКПоступлению.Назначение = &Назначение
		|	И ТоварыКПоступлению.КОформлениюРасход = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыКПоступлению.ДокументПоступления.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТоварыКПоступлению.ДокументПоступления КАК ЗаказПоставщику,
		|	ВЫБОР
		|		КОГДА ПриходныйОрдер.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ТОГДА Приобретение.Ссылка
		|		ИНАЧЕ ПриходныйОрдер.Ссылка
		|	КОНЕЦ КАК НазначениеЗаполнено,
		|	ВЫБОР
		|		КОГДА ПриходныйОрдер.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ТОГДА Приобретение.Ссылка
		|		ИНАЧЕ ПриходныйОрдер.Ссылка
		|	КОНЕЦ КАК НазначениеНеЗаполнено
		|ИЗ
		|	ВТИтог КАК ТоварыКПоступлению
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдер
		|		ПО (ВЫРАЗИТЬ(ПриходныйОрдер.Ссылка.Распоряжение КАК Документ.ЗаказПоставщику).Ссылка = ТоварыКПоступлению.ДокументПоступления)
		|			И (ПриходныйОрдер.Номенклатура = ТоварыКПоступлению.Номенклатура)
		|			И (ПриходныйОрдер.Характеристика = ТоварыКПоступлению.Характеристика)
		|			И (ПриходныйОрдер.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК Приобретение
		|		ПО (Приобретение.Ссылка.ЗаказПоставщику = ТоварыКПоступлению.ДокументПоступления)
		|			И (Приобретение.Номенклатура = ТоварыКПоступлению.Номенклатура)
		|			И (Приобретение.Характеристика = ТоварыКПоступлению.Характеристика)
		|			И (Приобретение.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	ПриходныйОрдер.КоличествоУпаковок = Приобретение.КоличествоУпаковок
		|	И ПриходныйОрдер.Назначение <> Приобретение.Назначение
		|	И ТоварыКПоступлению.КОформлениюРасход <> 0
		|	И (ТоварыКПоступлению.Назначение = &Назначение
		|		ИЛИ ПриходныйОрдер.Назначение = &Назначение
		|		ИЛИ Приобретение.Назначение = &Назначение)
		|	И (ПриходныйОрдер.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		ИЛИ Приобретение.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыКПоступлению.ДокументПоступления.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	СписокПакетов = Запрос.ВыполнитьПакет();
	
	Результат = СписокПакетов[2].Выбрать();
	Если Результат.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По заказу поставщику '" + Результат.ЗаказПоставщику + "' отсутствует приобретение на дату реализации: " + ДатаДокумента, Результат.ЗаказПоставщику);
	КонецЕсли;
	
	Результат = СписокПакетов[3].Выбрать();
	Если Результат.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( 
			"По заказу поставщику '" + Результат.ЗаказПоставщику + "' в '" + 
			Результат.НазначениеЗаполнено + "' назначение указано, а в '" +
			Результат.НазначениеНеЗаполнено + "' назначение отсутствует!", Результат.ЗаказПоставщику);
	КонецЕсли;

КонецПроцедуры

Процедура КонтрольОтгрузки(Объект,Отказ) экспорт
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.Склад КАК Склад,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
	|ГДЕ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки = &ДокументОтгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОтгрузкеОстатки.Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика,
	|	ТоварыКОтгрузкеОстатки.Склад
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) < 0";
	
	Запрос.УстановитьПараметр("ДокументОтгрузки", Объект.ссылка);	
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ШаблонСообщения = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
		|Реализовано больше, чем заказано на складе %Склад% на %Количество% %Единица%'");
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристика%",
		НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(-Выборка.Количество));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%",      Строка(Выборка.Склад));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Единица%",    Строка(Выборка.ЕдиницаИзмерения));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%датадокумента%",    Строка(Объект.Дата));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ,, Отказ);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

Процедура ОтразитьПоследовательностьСебестоимость(Источник, Отказ, РежимПроведения) экспорт   
	
	//Если Не Источник.ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") ИЛИ 
	//	Не Источник.ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаСебестоимостьТоваров") тогда
	//	Возврат;
	//конецесли;
	//
	//ТаблицаДвижений = Источник.ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСебестоимостьТоваров;
	
	ПоследовательностьРасчеты = Источник.ПринадлежностьПоследовательностям.ПроведениеСебестоимость;
	ПоследовательностьРасчеты.Очистить();
	
	//Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПоследовательностьРасчеты.Отбор.Регистратор.Установить(Источник.Ссылка);
	
	НоваяЗапись = ПоследовательностьРасчеты.Добавить();
	НоваяЗапись.Период=Источник.Дата;	
КонецПроцедуры

Процедура УдалитьПоследовательностьСебестоимость(Источник, Отказ) экспорт
	
	ПоследовательностьРасчеты = Источник.ПринадлежностьПоследовательностям.ПроведениеСебестоимость;
	ПоследовательностьРасчеты.Очистить();
	
КонецПроцедуры

Функция ВсеСклады() экспорт
	ЗапросПоСкладам = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	(НЕ Склады.ЭтоГруппа)");
	
	Возврат ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	
КонецФункции

Функция СкладыСДвижениями(Номенклатура) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗапасыИПотребностиОстатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки(
	|			,
	|			Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|				И Номенклатура = &Номенклатура) КАК ЗапасыИПотребностиОстатки
	|ГДЕ
	|	ЗапасыИПотребностиОстатки.ВНаличииОстаток <> 0";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	
КонецФункции 

Функция КлючиНоменклатуры(Ссылка) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикаУчетаНоменклатуры.КлючАналитики
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = АналитикаУчетаНоменклатуры.Номенклатура
	|			И РеализацияТоваровУслугТовары.Характеристика = АналитикаУчетаНоменклатуры.Характеристика
	|			И РеализацияТоваровУслугТовары.Склад = АналитикаУчетаНоменклатуры.МестоХранения
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КлючАналитики");
	
	Возврат Результат;	
КонецФункции

Функция ВодительТС(знач ПользовательИБ=НЕОПРЕДЕЛЕНО) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Водители.Ссылка КАК Водитель
	|ИЗ
	|	Справочник.Водители КАК Водители
	|ГДЕ
	|	Водители.ПользовательИБ = &ПользовательИБ";
	
	Запрос.УстановитьПараметр("ПользовательИБ", ПользовательИБ);
	
	Результат = Запрос.Выполнить();
	
	если не Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Водитель;
	иначе
		Возврат Справочники.Водители.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ТранспортноеСредство(Водитель) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ЗакрепленныеТС.ТранспортноеСредство
	|ИЗ
	|	РегистрСведений.ЗакрепленныеТС КАК ЗакрепленныеТС
	|ГДЕ
	|	ЗакрепленныеТС.Водитель = &Водитель";
	
	Запрос.УстановитьПараметр("Водитель", Водитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
		ТранспортноеСредство = Выборка.ТранспортноеСредство;
	Иначе
		ТранспортноеСредство = Справочники.ТранспортныеСредстваСобственные.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ТранспортноеСредство;	
КонецФункции 

Функция ТопливоПоРасходу(ТранспортноеСредство) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НормыРасходаГСМСрезПоследних.Топливо
	|ИЗ
	|	РегистрСведений.НормыРасходаГСМ.СрезПоследних(, ТранспортноеСредство = &транспортноеСредство) КАК НормыРасходаГСМСрезПоследних";
	
	Запрос.УстановитьПараметр("транспортноеСредство",ТранспортноеСредство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеТоплива = Выборка.Топливо;
	Иначе
		ДанныеТоплива = НЕОПРЕДЕЛЕНО;
	КонецЕсли; 
	
	Возврат ДанныеТоплива;
КонецФункции

Функция СписокНоменклатурыТоплива(ТранспортноеСредство,период) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходаГСМСрезПоследних.Топливо
	|ИЗ
	|	РегистрСведений.НормыРасходаГСМ.СрезПоследних(&Период, ТранспортноеСредство = &ТранспортноеСредство) КАК НормыРасходаГСМСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Топливо");
	Возврат Результат;
КонецФункции

Функция ПолучитьНормуРасхода(Объект) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НормыРасходаГСМСрезПоследних.БазоваяНорма
	|ИЗ
	|	РегистрСведений.НормыРасходаГСМ.СрезПоследних(
	|			&Период,
	|			Топливо = &Топливо
	|				И транспортноеСредство = &ТранспортноеСредство) КАК НормыРасходаГСМСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Топливо", Объект.Топливо);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
		Норма = Выборка.БазоваяНорма;
	Иначе
		Норма = 0;
	КонецЕсли;
	Норма=Норма*?(Объект.ТранспортноеСредство.СпидометрСчетчик=1,КоэффициентЗимы(Объект.Дата),1);
	
	Возврат Норма;
КонецФункции

Функция КоэффициентЗимы(ДатаЛиста)
	коэффициент=1;
	ТекДата=?(ЗначениеЗаполнено(ДатаЛиста),ДатаЛиста,ТекущаяДата());
	если не значениеЗаполнено(Константы.ЗимнийПериодНачало.Получить()) и не значениеЗаполнено(Константы.ЗимнийПериодОкончание.Получить()) тогда
		возврат коэффициент;
	конецесли;
	ДатаН=Константы.ЗимнийПериодНачало.Получить();
	ДатаНачала=Дата(СТРЗАМЕНИТЬ(ГОД(ТекДата),Символы.НПП,"")+ПРАВ(ДатаН,2)+ЛЕВ(ДатаН,2));
	ДатаН=Константы.ЗимнийПериодОкончание.Получить();
	ДатаОкончания=Дата(СТРЗАМЕНИТЬ(ГОД(ТекДата),Символы.НПП,"")+ПРАВ(ДатаН,2)+ЛЕВ(ДатаН,2));
	если ТекДата<ДатаНачала и ТекДата>=ДатаОкончания тогда
		возврат коэффициент;
	иначе
		возврат коэффициент+Константы.ПредельнаяВеличинаЗимнихНадбавок.Получить()/100;
	конецесли;
КонецФункции

Функция СписокТранспортныхСредств(Водитель) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗакрепленныеТС.ТранспортноеСредство
	|ИЗ
	|	РегистрСведений.ЗакрепленныеТС КАК ЗакрепленныеТС
	|ГДЕ
	|	ЗакрепленныеТС.Водитель = &Водитель";
	
	Запрос.УстановитьПараметр("Водитель", Водитель);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТранспортноеСредство");
КонецФункции

#Область ПроцедурыИФункцииФормированияДвиженийПоУчетуДоходовИРасходов

// Процедура формирования движений по регистру "Учет прочих расходов".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьДвижениеПоПутевымЛистам(ЭтотОбъект,ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ВнутреннееПотреблениеТоваровПутевыеЛисты.ПутевойЛист,
	|	ВнутреннееПотреблениеТоваровПутевыеЛисты.ПутевойЛист.РасходФактический КАК Количество,
	|	ВнутреннееПотреблениеТоваровПутевыеЛисты.ПутевойЛист.Топливо КАК Топливо,
	|	ВнутреннееПотреблениеТоваровПутевыеЛисты.ПутевойЛист.Водитель.СкладТоплива КАК Склад
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров.ПутевыеЛисты КАК ВнутреннееПотреблениеТоваровПутевыеЛисты
	|ГДЕ
	|	ВнутреннееПотреблениеТоваровПутевыеЛисты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.ссылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияРасчеты = Движения.ДвижениеТоплива;
	ДвиженияРасчеты.Записывать = Истина;
	ДвиженияРасчеты.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

#КонецОбласти     

Функция ВозвратитьДанныеКонтрагента(Документ)экспорт
	
	Возврат ВозвратДанныхКонтрагента(Документ);
	
КонецФункции

Функция ВозвратДанныхКонтрагента(Документ)
	ДокументИсточник=Документ;
	если ДокументИсточник.Метаданные().имя="ОтчетОРозничныхПродажах" тогда
		СведенияКонтрагента=Новый Структура;
		СведенияКонтрагента.Вставить("Контрагент",Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("0562ed9b-4ca4-11e1-8e7d-001e101f9843")));
		СведенияКонтрагента.Вставить("Партнер",Справочники.Партнеры.НайтиПоНаименованию("ФИЗИЧЕСКОЕ ЛИЦО"));
		СведенияКонтрагента.Вставить("Договор","С покупателем, руб");
		СведенияКонтрагента.Вставить("Склад",ДокументИсточник.Склад);
		Возврат СведенияКонтрагента;	
	конецесли;
	СведенияКонтрагента=Новый Структура;
	СведенияКонтрагента.Вставить("Контрагент",Документ.Контрагент);
	СведенияКонтрагента.Вставить("Партнер",НЕОПРЕДЕЛЕНО);
	СведенияКонтрагента.Вставить("Договор","");
	СведенияКонтрагента.Вставить("Склад",Справочники.Склады.ПустаяСсылка());
	если ДокументИсточник.Метаданные().имя="РеализацияТоваровУслуг" тогда
		СчетФактура=ПродажиСервер.ПараметрыПредставленияСчетаФактуры(ДокументИсточник,ДокументИсточник.Организация);
		ЗначениеСклада=ВозвратитьСклад(ДокументИсточник);
		СведенияКонтрагента.Склад=ЗначениеСклада;
		Если СчетФактура.ТекстСчетФактура="Оформить счет-фактуру" Тогда
			СведенияКонтрагента.Контрагент=Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("0562ed9b-4ca4-11e1-8e7d-001e101f9843"));
			СведенияКонтрагента.Партнер=Справочники.Партнеры.НайтиПоНаименованию("ФИЗИЧЕСКОЕ ЛИЦО");
			
			Стрпоиск="С покупателем, руб";
			СведенияКонтрагента.Договор=стрПоиск;
			
		иначе
			СведенияКонтрагента.Контрагент=ДокументИсточник.Контрагент;
			СведенияКонтрагента.Партнер=ДокументИсточник.Партнер;
		конецесли;	
		
	иначе
		если (Метаданные.Документы[ДокументИсточник.Метаданные().имя].Реквизиты.Найти("ДокументРеализации")<>НЕОПРЕДЕЛЕНО) тогда
			если ДокументИсточник.ДокументРеализации<>НЕОПРЕДЕЛЕНО Тогда
				ДокументИсточник=ДокументИсточник.ДокументРеализации;
				СведенияКонтрагента=ВозвратДанныхКонтрагента(ДокументИсточник);
			конецесли;
			
		Конецесли;	
		
		если (Метаданные.Документы[ДокументИсточник.Метаданные().имя].Реквизиты.Найти("ДокументОснование")<>НЕОПРЕДЕЛЕНО) тогда
			если ДокументИсточник.ДокументОснование<>НЕОПРЕДЕЛЕНО Тогда
				ДокументИсточник=ДокументИсточник.ДокументОснование;
				СведенияКонтрагента=ВозвратДанныхКонтрагента(ДокументИсточник);
			конецесли;
		Конецесли;		
	конецесли;	
	Возврат СведенияКонтрагента;
	
	
КонецФункции

Функция ВозвратитьСклад(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслугТовары.Склад.СкладДляБухгалтерии КАК Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугТовары.Ссылка.Склад.ЭтоГруппа
	|	И РеализацияТоваровУслугТовары.Склад.СкладДляБухгалтерии <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Склад.СкладДляБухгалтерии
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	И НЕ РеализацияТоваровУслуг.Ссылка.Склад.ЭтоГруппа
	|	И РеализацияТоваровУслуг.Склад.СкладДляБухгалтерии <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслугТовары.Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугТовары.Ссылка.Склад.ЭтоГруппа
	|	И РеализацияТоваровУслугТовары.Склад.СкладДляБухгалтерии = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	И НЕ РеализацияТоваровУслуг.Ссылка.Склад.ЭтоГруппа
	|	И РеализацияТоваровУслуг.Склад.СкладДляБухгалтерии = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	если НЕ РезультатЗапроса.Пустой() тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		если Выборка.Следующий() тогда
			Возврат Выборка.Склад;
			
		иначе
			Возврат Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	иначе
		Возврат Справочники.Склады.ПустаяСсылка()
	КонецЕсли;	
КонецФункции

Функция ПроверитьЗеленение(Товары,Склад) экспорт
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Кладовщик,
	|	Товары.Номенклатура
	|ПОМЕСТИТЬ Табл
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Кладовщик = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Табл.Номенклатура
	|ИЗ
	|	Табл КАК Табл
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО Табл.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|ГДЕ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("Склад", Склад);
	Результат = Запрос.ВыполнитьПакет();
	Количество=Результат[1].Выгрузить().Количество();
	возврат количество>0;
КонецФункции

Функция СоздаватьДоговор(Документ,Организация)экспорт
	СчетФактура=ПродажиСервер.ПараметрыПредставленияСчетаФактуры(Документ,Организация);
	возврат СчетФактура.ТекстСчетФактура<>"Оформить счет-фактуру";
КонецФункции

#Область РаспределениеТранспортных

Процедура КонтрольТранспортных(Объект,отказ) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.РаспределитьТранспортные
	|	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.типыНоменклатуры.Услуга)
	|	И РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	если РезультатЗапроса.Пустой() тогда
		ТекстСообщения = "В таблице товаров отсутствуют услуги к распределению!
		|Снимите флажок ""Распределять сумму услуг ...""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ,, Отказ);
	конецесли;
КонецПроцедуры

Процедура РаспределениеТранспортных(Источник) Экспорт
	если Источник.Товары.Итог("Распределять")= 0 и Источник.Товары.Итог("СуммаСНДСРТ")+Источник.Товары.Итог("СуммаНДСРТ")=0 тогда  
		Источник.РаспределитьТранспортные=ложь;
		возврат;
	конецесли;

	СтруктураПараметров = Новый Структура("СуммаТоваров,СуммаУслуг,Коэфф",0,0,0);
	ЗаполнитьПараметрыСтруктуры(СтруктураПараметров,Источник);
	Если Источник.Товары.Итог("Распределять")>0 и СтруктураПараметров.СуммаУслуг=0 тогда 
		ОчиститьТабличныеЧасти(Источник);	
		Источник.РаспределитьТранспортные=ложь;
		возврат;
	конецесли;
	
	Товары=Источник.Товары;
	ИТОГСуммаСНДСРТ=0;
	ИТОГСуммаНДСРТ=0;
	ИТОГСуммаРТ=0;  
		
	Если  Источник.РаспределитьТранспортныеДистрибуция Тогда
		

		Для Каждого Стр Из Товары Цикл 
			
			Коэфф = Стр.СуммаРТ/(Стр.Сумма);
			
			Стр.СуммаСНДСРТ=Стр.СуммаСНДС*Коэфф;
			Стр.СуммаНДСРТ=Стр.СуммаНДС*Коэфф;
			
			Если Стр.Номенклатура.ТипНоменклатуры=перечисления.ТипыНоменклатуры.Услуга тогда
				ОтборУслуг=0;
			Иначе                   
				ОтборУслуг=1;
			КонецЕсли;
			
			ИТОГСуммаСНДСРТ=ИТОГСуммаСНДСРТ+Стр.СуммаСНДСРТ+отборУслуг*Стр.СуммаСНДС;
			ИТОГСуммаНДСРТ=ИТОГСуммаНДСРТ+Стр.СуммаНДСРТ+отборУслуг*Стр.СуммаНДС;
			ИТОГСуммаРТ=ИТОГСуммаРТ+Стр.СуммаРТ+отборУслуг*Стр.Сумма; 
			
			Стр.ЦенаСДоставкойПечать =(Стр.Сумма + Стр.СуммаРТ)/Стр.КоличествоУпаковок; 

		КонецЦикла;		
		
	Иначе
		
		Коэфф = СтруктураПараметров.Коэфф; 
	
		Для каждого стр из Товары цикл 		
			стр.СуммаСНДСРТ=Стр.СуммаСНДС*Коэфф*стр.Распределять;
			стр.СуммаНДСРТ=Стр.СуммаНДС*Коэфф*стр.Распределять;
			стр.СуммаРТ=Стр.Сумма*Коэфф*стр.Распределять; 
			если стр.Номенклатура.ТипНоменклатуры=перечисления.ТипыНоменклатуры.Услуга тогда
				ОтборУслуг=0;
			иначе
				ОтборУслуг=1;
			конецесли;	
			ИТОГСуммаСНДСРТ=ИТОГСуммаСНДСРТ+стр.СуммаСНДСРТ+отборУслуг*стр.СуммаСНДС;
			ИТОГСуммаНДСРТ=ИТОГСуммаНДСРТ+стр.СуммаНДСРТ+отборУслуг*стр.СуммаНДС;
			ИТОГСуммаРТ=ИТОГСуммаРТ+стр.СуммаРТ+отборУслуг*стр.Сумма;
		конеццикла;
	КонецЕсли;	

	
		ТаблДокументаВР=Товары.Выгрузить();
		ТаблДокументаВР.Сортировать("Сумма Убыв");
		для каждого стр из ТаблДокументаВР цикл
			Если стр.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга И стр.Распределять <> 0 Тогда 
				строкаДокумента=Товары.Найти(стр.номерстроки,"НомерСтроки");
				строкаДокумента.СуммаСНДСРТ=стр.СуммаСНДСРТ+Товары.ИТОГ("СуммаСНДС")-ИТОГСуммаСНДСРТ;
				строкаДокумента.СуммаНДСРТ=стр.СуммаНДСРТ+Товары.ИТОГ("СуммаНДС")-ИТОГСуммаНДСРТ;
				строкаДокумента.СуммаРТ=стр.СуммаРТ+Товары.ИТОГ("Сумма")-ИТОГСуммаРТ;
				стр.СуммаСНДСРТ=строкаДокумента.СуммаСНДСРТ;
				стр.СуммаНДСРТ=строкаДокумента.СуммаНДСРТ;
				стр.СуммаРТ=строкаДокумента.СуммаРТ;		
				прервать;
			КонецЕсли;	
		конеццикла;	

	
	Источник.РаспределитьТранспортные= Источник.Товары.Итог("Распределять")>0;
	если ТипЗнч(Источник)=Тип("ДокументОбъект.РеализацияТоваровУслуг") тогда
		ТаблДокументаВР.Свернуть("АналитикаУчетаНоменклатуры,ЗаказКлиента","Количество,СуммаСНДСРТ,СуммаРТ,СуммаНДСРТ");
		для каждого стр из ТаблДокументаВР цикл
			ЗаполнитьСтрокуВидовЗапасов(Стр,Источник);
		конеццикла;	
	конецесли;	
КонецПроцедуры

// для ЭДО
Функция ВозвратитьТаблицу(Значениепараметра,Контекст) экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	если типзнч(ЗначениеПараметра)=тип("ДокументТабличнаяЧасть.РеализацияТоваровУслуг.Товары") тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Реализация.Ссылка КАК Ссылка,
		|	Реализация.НомерСтроки КАК НомерСтроки,
		|	Реализация.Номенклатура КАК Номенклатура,
		|	Реализация.Характеристика КАК Характеристика,
		|	Реализация.Назначение КАК Назначение,
		|	Реализация.Упаковка КАК Упаковка,
		|	Реализация.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Реализация.Количество КАК Количество,
		|	Реализация.ВидЦены КАК ВидЦены,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Реализация.Количество <> 0
		|					И Реализация.Ссылка.РаспределитьТранспортные
		|				ТОГДА (Реализация.Сумма + Реализация.СуммаРТ) / Реализация.Количество
		|			ИНАЧЕ Реализация.Цена
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена,
		|	Реализация.Сумма + Реализация.СуммаРТ КАК Сумма,
		|	Реализация.СтавкаНДС КАК СтавкаНДС,
		|	Реализация.СуммаНДС + Реализация.СуммаНДСРТ КАК СуммаНДС,
		|	Реализация.СуммаСНДС + Реализация.СуммаСНДСРТ КАК СуммаСНДС,
		|	Реализация.КодСтроки КАК КодСтроки,
		|	Реализация.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	Реализация.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	Реализация.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	Реализация.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	Реализация.КлючСвязи КАК КлючСвязи,
		|	Реализация.Склад КАК Склад,
		|	Реализация.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	Реализация.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	Реализация.ЗаказКлиента КАК ЗаказКлиента,
		|	Реализация.СрокПоставки КАК СрокПоставки,
		|	Реализация.Распределять КАК Распределять,
		|	Реализация.Кладовщик КАК Кладовщик,
		|	Реализация.ВодительПогрузчика КАК ВодительПогрузчика,
		|	Реализация.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Реализация.Серия КАК Серия,
		|	Реализация.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Реализация.НоменклатураНабора КАК НоменклатураНабора,
		|	Реализация.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	Реализация.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
		|	Реализация.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
		|	Реализация.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
		|	Реализация.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
		|	Реализация.СуммаНДСРТ КАК СуммаНДСРТ,
		|	Реализация.СуммаРТ КАК СуммаРТ,
		|	Реализация.СуммаСНДСРТ КАК СуммаСНДСРТ,
		|	Реализация.КодТНВЭД КАК КодТНВЭД,
		|	Реализация.ВидЦеныПоСоглашению КАК ВидЦеныПоСоглашению,
		|	Реализация.ВидУточнения КАК ВидУточнения,
		|	Реализация.ЦенаПоСоглашению КАК ЦенаПоСоглашению
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК Реализация
		|ГДЕ
		|	Реализация.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА Реализация.Ссылка.РаспределитьТранспортные
		|				ТОГДА Реализация.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
			Запрос.УстановитьПараметр("Ссылка", Контекст.Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

	иначеесли типзнч(ЗначениеПараметра)=тип("ДокументТабличнаяЧасть.РеализацияТоваровУслуг.ВидыЗапасов") тогда
         
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугВидыЗапасов.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугВидыЗапасов.НомерСтроки КАК НомерСтроки,
		|	РеализацияТоваровУслугВидыЗапасов.Упаковка КАК Упаковка,
		|	РеализацияТоваровУслугВидыЗапасов.КоличествоУпаковок КАК КоличествоУпаковок,
		|	РеализацияТоваровУслугВидыЗапасов.Количество КАК Количество,
		|	РеализацияТоваровУслугВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
		|	РеализацияТоваровУслугВидыЗапасов.СуммаНДС + РеализацияТоваровУслугВидыЗапасов.СуммаНДСРТ КАК СуммаНДС,
		|	РеализацияТоваровУслугВидыЗапасов.СуммаСНДС + РеализацияТоваровУслугВидыЗапасов.СуммаСНДСРТ КАК СуммаСНДС,
		|	РеализацияТоваровУслугВидыЗапасов.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	РеализацияТоваровУслугВидыЗапасов.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	РеализацияТоваровУслугВидыЗапасов.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	РеализацияТоваровУслугВидыЗапасов.ЗаказКлиента КАК ЗаказКлиента,
		|	РеализацияТоваровУслугВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
		|	РеализацияТоваровУслугВидыЗапасов.СуммаНДСРТ КАК СуммаНДСРТ,
		|	РеализацияТоваровУслугВидыЗапасов.СуммаСНДСРТ КАК СуммаСНДСРТ,
		|	РеализацияТоваровУслугВидыЗапасов.КодТНВЭД КАК КодТНВЭД,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА РеализацияТоваровУслугВидыЗапасов.Количество <> 0
		|					И РеализацияТоваровУслугВидыЗапасов.Ссылка.РаспределитьТранспортные
		|				ТОГДА (РеализацияТоваровУслугВидыЗапасов.СуммаСНДС + РеализацияТоваровУслугВидыЗапасов.СуммаСНДСРТ) / РеализацияТоваровУслугВидыЗапасов.Количество
		|			ИНАЧЕ РеализацияТоваровУслугВидыЗапасов.Цена
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК РеализацияТоваровУслугВидыЗапасов
		|ГДЕ
		|	РеализацияТоваровУслугВидыЗапасов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Контекст.Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
иначе
	возврат Значениепараметра; 
	конецесли;

КонецФункции //

Процедура УстановитьСтатусыНаДокументы(СписокДокументов) экспорт

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.ссылка КАК ДокСФ
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка В(&СписокДокументов)";
		
		Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			УстановитьСтатусНаДокумент(ВыборкаДетальныеЗаписи.ДокСФ);
	    конеццикла;

КонецПроцедуры

Процедура УстановитьСтатусНаДокумент(ДокСФ) экспорт
	
	если типзнч(ДокСФ)<>тип("ДокументСсылка.СчетФактураВыданный")  тогда
		возврат;
	конецесли;	                                                  
	если не значениезаполнено(ДокСФ.ДокументОснование) тогда
		возврат;
	конецесли;	
	
	Статус="Выгружен";
	попытка
		ДокументОбъект=ДокСФ.ДокументОснование.ПолучитьОбъект();
		МетаданныеОбъекта=ДокументОбъект.Метаданные();
		если Общегоназначения.ЕстьРеквизитОбъекта("СтатусДокументаВЭДО",МетаданныеОбъекта) и ДокументОбъект.СтатусДокументаВЭДО<>перечисления.СтатусыДокументаЭДО[Статус]  тогда
			ДокументОбъект.СтатусДокументаВЭДО=перечисления.СтатусыДокументаЭДО[Статус];
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		конецесли;
	исключение 	
	конецпопытки;
	
КонецПроцедуры
 
#КонецОбласти 

//Отладка временных таблиц
Функция ПроверитьВрТаб(МенеджерВремТаб,ИмяВремтаб ="",Порядок = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаб;
	Запрос.Текст =
	"ВЫБРАТЬ
	| *
	|ИЗ
	| ВремТаб КАК ВремТаб
	|
	|УПОРЯДОЧИТЬ ПО Порядок";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВремТаб",ИмяВремтаб);
	Если Порядок = "" тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УПОРЯДОЧИТЬ ПО Порядок","");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Порядок",Порядок);
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции

функция ДатаИзмененияВерсииОбъекта(Ссылка) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииОбъектов.ДатаВерсии КАК ДатаВерсии
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВерсии УБЫВ";
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		ДатаИзменения=ВыборкаДетальныеЗаписи.ДатаВерсии;
		если ДатаИзменения<ТекущаяДата()-60*60*24*90 тогда
			подсветкадаты=истина;
		иначе
			подсветкадаты=ложь;
		конецесли;
		СтруктураДаты=новый Структура("ДатаИзменения",ВыборкаДетальныеЗаписи.ДатаВерсии);
		СтруктураДаты.Вставить("Подсветка",подсветкаДаты);
	иначе
		СтруктураДаты=новый Структура("ДатаИзменения",дата('00010101'));
		СтруктураДаты.Вставить("Подсветка",истина);
	Конецесли;
	возврат СтруктураДаты;	
конецфункции	

Функция ПодстановкаГрузоотправителя(Организация,Подразделение) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка
	|ИЗ
	|	РегистрСведений.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане.КПП = Контрагенты.КПП
	|			И РегистрацииВНалоговомОргане.Организация.ИНН = Контрагенты.ИНН
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Подразделение = &Подразделение
	|	И РегистрацииВНалоговомОргане.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат  ВыборкаДетальныеЗаписи.Ссылка;
	иначе
		возврат "";
		
	Конецесли;
КонецФункции

Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	АльтерраОбщегоНазначения.ЗаполнитьПодразделение(Источник);
	АльтерраОбщегоНазначения.ЗаполнитьМенеджераМагазин(Источник);
	
КонецПроцедуры

Процедура ПриКопированииОбъекта(Источник, ОбъектКопирования) Экспорт
	
	АльтерраОбщегоНазначения.ЗаполнитьПодразделение(Источник);
	АльтерраОбщегоНазначения.ЗаполнитьМенеджераМагазин(Источник);
	
КонецПроцедуры

// Вспомогательные
Функция ВводНаОснованииПересчета(ДокументОснования,ПараметрДвижения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПересортицаТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПересортицаТоваровТовары.Характеристика КАК Характеристика,
	|	ПересортицаТоваровТовары.Назначение КАК Назначение,
	|	СУММА(ЕСТЬNULL(ПересортицаТоваровТовары.Количество, 0)) КАК КоличествоРасход,
	|	СУММА(0) КАК КоличествоПриход
	|ПОМЕСТИТЬ ВР_Таб
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	|		ПО (ПересчетТоваров.Ссылка = ПересортицаТоваровТовары.Ссылка.ПересчетТоваров)
	|ГДЕ
	|	ПересчетТоваров.Ссылка = &Ссылка
	|	И ПересортицаТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПересортицаТоваровТовары.Номенклатура,
	|	ПересортицаТоваровТовары.Характеристика,
	|	ПересортицаТоваровТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеНедостачТоваровТовары.Номенклатура,
	|	СписаниеНедостачТоваровТовары.Характеристика,
	|	СписаниеНедостачТоваровТовары.Назначение,
	|	СУММА(ЕСТЬNULL(СписаниеНедостачТоваровТовары.Количество, 0)),
	|	СУММА(0)
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
	|		ПО (ПересчетТоваров.Ссылка = СписаниеНедостачТоваровТовары.Ссылка.ПересчетТоваров)
	|ГДЕ
	|	ПересчетТоваров.Ссылка = &Ссылка
	|	И СписаниеНедостачТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеНедостачТоваровТовары.Номенклатура,
	|	СписаниеНедостачТоваровТовары.Характеристика,
	|	СписаниеНедостачТоваровТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПересортицаТоваровТовары.НоменклатураОприходование,
	|	ПересортицаТоваровТовары.ХарактеристикаОприходование,
	|	ПересортицаТоваровТовары.Назначение,
	|	СУММА(0),
	|	СУММА(ЕСТЬNULL(ПересортицаТоваровТовары.Количество, 0))
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	|		ПО ПересчетТоваров.Ссылка = ПересортицаТоваровТовары.Ссылка.ПересчетТоваров
	|ГДЕ
	|	ПересчетТоваров.Ссылка = &Ссылка
	|	И ПересортицаТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПересортицаТоваровТовары.НоменклатураОприходование,
	|	ПересортицаТоваровТовары.ХарактеристикаОприходование,
	|	ПересортицаТоваровТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура,
	|	ОприходованиеИзлишковТоваровТовары.Характеристика,
	|	ОприходованиеИзлишковТоваровТовары.Назначение,
	|	СУММА(0),
	|	СУММА(ЕСТЬNULL(ОприходованиеИзлишковТоваровТовары.Количество, 0))
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
	|		ПО ПересчетТоваров.Ссылка = ОприходованиеИзлишковТоваровТовары.Ссылка.ПересчетТоваров
	|ГДЕ
	|	ПересчетТоваров.Ссылка = &Ссылка
	|	И ОприходованиеИзлишковТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура,
	|	ОприходованиеИзлишковТоваровТовары.Характеристика,
	|	ОприходованиеИзлишковТоваровТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорчаТоваровТовары.Номенклатура,
	|	ПорчаТоваровТовары.Характеристика,
	|	ПорчаТоваровТовары.Назначение,
	|	СУММА(ЕСТЬNULL(ПорчаТоваровТовары.Количество, 0)),
	|	СУММА(0)
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
	|		ПО ПересчетТоваров.Ссылка = ПорчаТоваровТовары.Ссылка.ПересчетТоваров
	|ГДЕ
	|	ПересчетТоваров.Ссылка = &Ссылка
	|	И ПорчаТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорчаТоваровТовары.Номенклатура,
	|	ПорчаТоваровТовары.Характеристика,
	|	ПорчаТоваровТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорчаТоваровТовары.НоменклатураОприходование,
	|	ПорчаТоваровТовары.ХарактеристикаОприходование,
	|	ПорчаТоваровТовары.Назначение,
	|	СУММА(0),
	|	СУММА(ЕСТЬNULL(ПорчаТоваровТовары.Количество, 0))
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
	|		ПО (ПересчетТоваров.Ссылка = ПорчаТоваровТовары.Ссылка.ПересчетТоваров)
	|ГДЕ
	|	ПересчетТоваров.Ссылка = &Ссылка
	|	И ПорчаТоваровТовары.Ссылка.Проведен 
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорчаТоваровТовары.НоменклатураОприходование,
	|	ПорчаТоваровТовары.ХарактеристикаОприходование,
	|	ПорчаТоваровТовары.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
	|	ПересчетТоваровТовары.Назначение КАК Назначение,
	|	-&НовыйРасчетОтклонения - СУММА(ЕСТЬNULL(ВР_Таб.КоличествоРасход, 0)) КАК Количество
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ВР_Таб
	|		ПО ПересчетТоваровТовары.Номенклатура = ВР_Таб.Номенклатура
	|			И ПересчетТоваровТовары.Характеристика = ВР_Таб.Характеристика
	|			И ПересчетТоваровТовары.Назначение = ВР_Таб.Назначение
	|ГДЕ
	|	ПересчетТоваровТовары.Ссылка = &Ссылка
	|	И -&НовыйРасчетОтклонения - ЕСТЬNULL(ВР_Таб.КоличествоРасход, 0) > 0
	|	И &Приемник = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ПересчетТоваровТовары.Ссылка.НовыйРасчетОтклонения,
	|	ПересчетТоваровТовары.Номенклатура,
	|	ПересчетТоваровТовары.Упаковка,
	|	ПересчетТоваровТовары.Характеристика,
	|	ПересчетТоваровТовары.Количество,
	|	ПересчетТоваровТовары.КоличествоФакт,
	|	ПересчетТоваровТовары.КоличествоПоУчетуВЗонеХранения,
	|	ПересчетТоваровТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПересчетТоваровТовары.Номенклатура,
	|	ПересчетТоваровТовары.Характеристика,
	|	ПересчетТоваровТовары.Назначение,
	|	&НовыйРасчетОтклонения - СУММА(ЕСТЬNULL(ВР_Таб.КоличествоПриход, 0))
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ВР_Таб
	|		ПО ПересчетТоваровТовары.Номенклатура = ВР_Таб.Номенклатура
	|			И ПересчетТоваровТовары.Характеристика = ВР_Таб.Характеристика
	|			И ПересчетТоваровТовары.Назначение = ВР_Таб.Назначение
	|ГДЕ
	|	ПересчетТоваровТовары.Ссылка = &Ссылка
	|	И &Приемник = 2
	|
	|СГРУППИРОВАТЬ ПО
	|	ПересчетТоваровТовары.Ссылка.НовыйРасчетОтклонения,
	|	ПересчетТоваровТовары.Номенклатура,
	|	ПересчетТоваровТовары.Упаковка,
	|	ПересчетТоваровТовары.Характеристика,
	|	ПересчетТоваровТовары.КоличествоФакт,
	|	ПересчетТоваровТовары.Количество,
	|	ПересчетТоваровТовары.КоличествоПоУчетуВЗонеХранения,
	|	ПересчетТоваровТовары.Назначение
	|
	|ИМЕЮЩИЕ
	|	&НовыйРасчетОтклонения - СУММА(ЕСТЬNULL(ВР_Таб.КоличествоПриход, 0)) > 0";
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&НовыйРасчетОтклонения", 
		Документы.ПересчетТоваров.НовыйРасчетОтклонения_ПараметрЗапросаБезУпаковок("ПересчетТоваровТовары"));
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ПересчетТоваровТовары.Упаковка",
		"ПересчетТоваровТовары.Номенклатура"));
	
	Запрос.УстановитьПараметр("Приемник", ПараметрДвижения);
	Запрос.УстановитьПараметр("Ссылка", ДокументОснования);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПроверитьРасхождениеЗаказаИРеализаций(Источник,отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Партнер,
	|	РеализацияТоваровУслуг.Склад,
	|	РеализацияТоваровУслуг.Соглашение,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказ.ЗаказКлиента = РеализацияТоваровУслуг.ЗаказКлиента
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка <> &Ссылка
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказ.ЗаказКлиента.Организация,
	|	ВТ_Заказ.ЗаказКлиента.Контрагент,
	|	ВТ_Заказ.ЗаказКлиента.Партнер,
	|	ВТ_Заказ.ЗаказКлиента.Склад,
	|	ВТ_Заказ.ЗаказКлиента.Соглашение,
	|	ВТ_Заказ.ЗаказКлиента.Договор
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Организация,
	|	ВТ.Контрагент,
	|	ВТ.Партнер,
	|	ВТ.Склад,
	|	ВТ.Соглашение,
	|	ВТ.Договор
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Организация,
	|	ВТ.Контрагент,
	|	ВТ.Договор,
	|	ВТ.Склад,
	|	ВТ.Соглашение,
	|	ВТ.Партнер";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ= РезультатЗапроса.Выгрузить();
	
	НоваяСтрока= ТЗ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник); 
	
	ТЗ.Свернуть("Организация,Контрагент,Договор,Склад,Соглашение,Партнер");
	Если ТЗ.Количество()>1 Тогда
		Сообщить("Есть расхождения между заказом или несколькими реализациями по реквизитам шапки!");
		отказ= Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПараметрыСтруктуры(СтруктураПараметров,Источник)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Сумма,
	|	Товары.Номенклатура,
	|	Товары.Распределять
	|ПОМЕСТИТЬ ВР
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВР.Сумма * ВР.Распределять) КАК СуммаТоваров,
	|	СУММА(ВЫБОР
	|			КОГДА СПР_Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ТОГДА ВР.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаУслуг,
	|	ВЫБОР
	|		КОГДА СУММА(ВР.Сумма * ВР.Распределять) <> 0
	|			ТОГДА СУММА(ВЫБОР
	|						КОГДА СПР_Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|							ТОГДА ВР.Сумма
	|						ИНАЧЕ 0
	|					КОНЕЦ) / СУММА(ВР.Сумма * ВР.Распределять)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Коэфф
	|ИЗ
	|	ВР КАК ВР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СПР_Номенклатура
	|		ПО ВР.Номенклатура = СПР_Номенклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Товары", Источник.Товары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	если  Выборка.Следующий() тогда
		Заполнитьзначениясвойств(Структурапараметров,Выборка);
	конецесли;
	
КонецПроцедуры

Процедура ОчиститьТабличныеЧасти(Источник)
	Для каждого стр из Источник.Товары цикл
		стр.СуммаСНДСРТ=0;
		стр.СуммаНДСРТ=0;
		стр.СуммаРТ=0;
		стр.Распределять=0;
	конеццикла;
	
	если ТипЗнч(Источник)=Тип("ДокументОбъект.РеализацияТоваровУслуг") тогда
		Для каждого стр из Источник.ВидыЗапасов цикл
			стр.СуммаСНДСРТ=0;
			стр.СуммаНДСРТ=0;
		конеццикла;
	конецесли;	
КонецПроцедуры

Процедура ЗаполнитьСтрокуВидовЗапасов(стр,Источник)
	СтруктураПоиска=Новый Структура;
	СтруктураПоиска.Вставить("АналитикаУчетаНоменклатуры",стр.АналитикаУчетаНоменклатуры);
	СтруктураПоиска.Вставить("ЗаказКлиента",стр.ЗаказКлиента);
	КоличествоСтек=стр.Количество;
	СтекСуммаСНДСРТ=стр.СуммаСНДСРТ;
	СтекСуммаНДСРТ=стр.СуммаНДСРТ;
	Для Каждого СтрокаЗапасов Из Источник.ВидыЗапасов.НайтиСтроки(СтруктураПоиска) Цикл
		Если СтрокаЗапасов.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		КоличествоСтек=КоличествоСтек-СтрокаЗапасов.Количество;
		если КоличествоСтек<>0 тогда
			СтрокаЗапасов.СуммаНДСРТ=стр.СуммаНДСРТ/стр.Количество*СтрокаЗапасов.Количество;
			СтрокаЗапасов.СуммаСНДСРТ=стр.СуммаСНДСРТ/стр.Количество*СтрокаЗапасов.Количество;
			СтекСуммаСНДСРТ=СтекСуммаСНДСРТ-СтрокаЗапасов.СуммаСНДСРТ;
			СтекСуммаНДСРТ=СтекСуммаНДСРТ-СтрокаЗапасов.СуммаНДСРТ;
		иначе
			СтрокаЗапасов.СуммаНДСРТ=СтекСуммаНДСРТ;
			СтрокаЗапасов.СуммаСНДСРТ=СтекСуммаСНДСРТ;
		конецесли;
	Конеццикла;	
КонецПроцедуры

Процедура ПодставитьКонтрагентаФизическоеЛицо(Объект) Экспорт   
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Дата >= Дата(2017,05,16) Тогда
		Если Не ДопМодуль.ПроверитьРасчетыПоДоговору(Объект) Тогда
			Если Объект.Контрагент.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо Тогда
				Объект.Контрагент= Справочники.Контрагенты.НайтиПоНаименованию("ФИЗИЧЕСКОЕ ЛИЦО");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьРасчетыПоДоговору(Объект) Экспорт
	Если Не ЗначениеЗаполнено(Объект.Соглашение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда 
		Возврат Объект.Договор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Соглашение.ПорядокРасчетов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Объект.Соглашение.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
КонецФункции

Функция ИдентифицироватьКлиентаПоСМС(Объект,ТекстСМС="") экспорт
	Настройки=ПолучитьНастройкиХранилища("Форма1","НастройкиХранилища.epf");
	если Настройки<>Неопределено и типзнч(Настройки)=тип("Структура") тогда
		если Настройки.свойство("ТекстПроверки") тогда
			если Настройки.ТекстПроверки="" тогда
				ТекстСМС="Ваш код для проверки  - %КодПроверки%";
			иначе
				ТекстСМС=Настройки.ТекстПроверки;
			конецесли;	
		конецесли;
		если Настройки.свойство("ПорогПроверкиИдентификации") тогда
			Возврат Объект.Товары.Итог("Сумма")>=Настройки.ПорогПроверкиИдентификации;
		конецесли;
	конецесли;
	возврат ложь; 
КонецФункции

Процедура ИнформироватьКлиентаПоСМС(Объект,ШаблонСМС="") экспорт
	Настройки=ПолучитьНастройкиХранилища("Форма1","НастройкиХранилища.epf");
	если Настройки<>Неопределено и типзнч(Настройки)=тип("Структура") тогда
		если Настройки.свойство("ПорогОтправкиУведомления") тогда
			если Объект.Товары.Итог("Сумма")>=Настройки.ПорогОтправкиУведомления тогда
				УстановитьПривилегированныйРежим(Истина);
				НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Партнер,Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
				АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона);
				НомераТелефонов = Новый Массив;
				НомераТелефонов.Добавить("+7"+НомерТелефона);
				
				ТекстСообщения=?(Объект.РеализацияПоЗаказам,"По заказу №"+Объект.ЗаказКлиента.Номер+" от "+формат(Объект.ЗаказКлиента.Дата,"ДЛФ=Д"),
				"По накладной №"+Объект.Номер+" от "+формат(Объект.Дата,"ДЛФ=Д"));
				ТекстСообщения=ТекстСообщения+" произведена отгрузка на сумму "+Объект.Товары.Итог("Сумма")+"р.";
				РезультатОтправки = ОтправкаSMS.ОтправитьSMS(НомераТелефонов,ТекстСообщения,,);
				УстановитьПривилегированныйРежим(Ложь);
			конецесли;
		конецесли;
	конецесли;
КонецПроцедуры

// Возвращает email партнера в независимости от вида контактной информации
Функция ПолучитьПочтуПартнера(Партнер)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Партнер,
	|	ПартнерыКонтактнаяИнформацияТелефон.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияТелефон
	|		ПО Партнеры.Ссылка = ПартнерыКонтактнаяИнформацияТелефон.Ссылка
	|			И ПартнерыКонтактнаяИнформацияТелефон.АдресЭП <> """"
	|ГДЕ
	|	Партнеры.Ссылка = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка= РезультатЗапроса.Выбрать();
	
	АдресЭП	= "";
	Если Выборка.Следующий() Тогда
		АдресЭП = Выборка.АдресЭП;
	КонецЕсли;
	
	Возврат АдресЭП;
КонецФункции   

// Возвращает телефон партнера в независимости от вида контактной информации
// в отличие от АльтерраОбщегоНазначения.ПолучитьТелефонПартнера(Партнер), возвращающей теоефон
// только по виду контактной информации Справочники.ВидыКонтактнойИнформации.ТелефонПартнера
Функция ПолучитьТелефонПартнера(Партнер)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Партнер,
	|	ПартнерыКонтактнаяИнформацияТелефон.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияТелефон
	|		ПО Партнеры.Ссылка = ПартнерыКонтактнаяИнформацияТелефон.Ссылка
	|			И ПартнерыКонтактнаяИнформацияТелефон.НомерТелефона <> """"
	|ГДЕ
	|	Партнеры.Ссылка = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка= РезультатЗапроса.Выбрать();
	
	НомерТелефона = "";
	Если Выборка.Следующий() Тогда
		НомерТелефона = Выборка.НомерТелефона;
	КонецЕсли;
	
	Возврат НомерТелефона;
КонецФункции

// Возвращает партнера по телефону в независимости от вида контактной информации
Функция ПолучитьПартнераПоТелефону(Телефон) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &Тип
	|	И НЕ ПартнерыКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|	И ПартнерыКонтактнаяИнформация.НомерТелефона = &НомерТелефона";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("НомерТелефона", Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Партнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Партнер = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;    
	
	Возврат Партнер;
КонецФункции

Функция НастройкиОповещения()
	установитьПривилегированныйРежим(истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УсловияПредоставленияСкидокНаценок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|ГДЕ
	|	УсловияПредоставленияСкидокНаценок.УсловиеПредоставления.ИмяФайла = &ИмяФайла";
	
	Запрос.УстановитьПараметр("ИмяФайла", "УсловияОповещенияКлиентов.epf");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.Ссылка.ПараметрыВнешнейОбработки.Получить();
	иначе
		возврат НЕОПРЕДЕЛЕНО;
	Конецесли;
	установитьПривилегированныйРежим(ложь);
КонецФункции

// Возвращает структуру из настроек хранилища дополнительной обработки.
//
// Параметры:
//	ИмяФайла - поиск элемента справочника по имени файла 
//  ИмяСтруктуры - название структуры в структуре хранилища значений
// Возвращаемое значение:
//	Структура со значениями сохраненных настроек.
//
Функция ПолучитьНастройкиХранилища(ИмяСтруктуры,ИмяФайла="НастройкиХранилища.epf") экспорт
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", имяФайла);		
	СтруктураХранилища=ДополнительнаяОбработка.ХранилищеНастроек.Получить();
	если типзнч(СтруктураХранилища)=тип("Структура") и СтруктураХранилища.Свойство(ИмяСтруктуры) тогда
		Возврат СтруктураХранилища[ИмяСтруктуры] ;
	конецесли;
	возврат неопределено;
КонецФункции

Процедура УстановитьДоступностьПоОтметкеКассыОбщий(Форма) Экспорт 
	
	Если Не ЗначениеЗаполнено(Форма.Объект.Дата) Тогда
		Форма.Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	Если Форма.Объект.Кассир.Пустая() Тогда
		Форма.Элементы.ОтметкаКассы.Заголовок = "Установить отм.кассы";
		Если РольДоступна("Кассир") И НачалоДня(Форма.Объект.Дата) <> НачалоДня(ТекущаяДата()) 
			И ТипЗнч(Форма.Объект.Ссылка) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда 
			ДопМодуль.УстановитьДоступностьФормыПоОтметкеКассы(Форма);
		КонецЕсли;
	Иначе
		Форма.Элементы.ОтметкаКассы.Заголовок = "Снять отм.кассы";
		ДопМодуль.УстановитьДоступностьФормыПоОтметкеКассы(Форма);
	Конецесли;
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда	
		Форма.Элементы.ОтмКассы.Видимость = ЗначениеЗаполнено(Форма.Объект.Кассир);
	КонецЕсли;
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		//Задача № 212178 скроем и посмотрим будет на нее запрос или нет,
		Форма.Элементы.ОтметкаКассы.Видимость = РольДоступна("ПолныеПрава");
	Иначе	
		Форма.Элементы.ОтметкаКассы.Видимость = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ОтметкаКассы");
	КонецЕсли	
	
КонецПроцедуры

Процедура УстановитьДоступностьФормыПоОтметкеКассы(Форма) Экспорт
	
	// Составим список элементов, доступность которых менять не требуется
	СписокИсключенияЭлементов = Новый СписокЗначений;
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ОтметкаКассы);    
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ФормаЗаписать);
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ФормаПровестиИЗакрыть);
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ПодменюЗаполнить);
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ПодменюОтчеты);
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ПодменюЭДО);
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ПодменюСоздатьНаОсновании);
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ПодменюПечать);
	СписокИсключенияЭлементов.Добавить(Форма.Элементы.ФормаОбщаяКомандаИсторияИзменений);
	
	ЭлементыФормы = Новый Массив;
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда	
		ЭлементыФормы.Добавить("Форма_ВводНаОснованииЗаявкаВЕГАИСЛес");
		ЭлементыФормы.Добавить("Форма_ВодНаОсновании_ЛистСогласования");
		ЭлементыФормы.Добавить("УправлениеПрисоединеннымиФайламиОткрытьСписок0");
		ЭлементыФормы.Добавить("ТоварыКонтекстноеМенюКопироватьВБуферОбмена");
		ЭлементыФормы.Добавить("КонтекстноеМенюТоварыОткрытьИнформациюОСкидках");
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда	 
		ЭлементыФормы.Добавить("Форма_ВВодНаОсновании_ЛистСогласования");
		ЭлементыФормы.Добавить("Форма_ВводНаОснованииЗаказНаДоставкуНДСБезНДС");
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ЭлементыФормы.Добавить("Форма_ВводНаОснованииЗаказНаДоставкуОтПоставщика");
		ЭлементыФормы.Добавить("Форма_ВводНаОснованииУстановкаЦенНоменклатуры");
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		ЭлементыФормы.Добавить("ФормаДокументЛистСогласованияСоздатьНаОсновании");
	КонецЕсли;
	Для Каждого Элемент Из ЭлементыФормы Цикл
		Если Форма.Элементы.Найти(Элемент) <> Неопределено Тогда
			СписокИсключенияЭлементов.Добавить(Форма.Элементы.Найти(Элемент));
		КонецЕсли; 
	КонецЦикла;
	
	// Составим список типов элементов, доступность которых менять не требуется
	СписокИсключенияТипов = Новый СписокЗначений;
	СписокИсключенияТипов.Добавить(Тип("ДекорацияФормы"));
	СписокИсключенияТипов.Добавить(Тип("ГруппаФормы"));
	
	// Для всех элементов формы установим их доступность
	Для Каждого ТекЭлемент Из Форма.Элементы Цикл  
		
		// Определим элемент и его тип
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		
		// Уберем доступность всех элементов формы, кроме списка исключений
		Если СписокИсключенияТипов.НайтиПоЗначению(ТипЭлемента) = Неопределено Тогда
			Если СписокИсключенияЭлементов.НайтиПоЗначению(ТекЭлемент) = Неопределено Тогда
				Попытка
					ТекЭлемент.ТолькоПросмотр = Истина;
				Исключение
					ТекЭлемент.Доступность = Ложь;
				КонецПопытки;    
			КонецЕсли;     
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.Элементы.ОтметкаКассы.Видимость = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ОтметкаКассы") ИЛИ РольДоступна("Кассир");
	
КонецПроцедуры

Процедура ЗаполнитьВидЦеныПоСоглашению(Объект) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.ВидЦены КАК ВидЦены
		|ПОМЕСТИТЬ ВР_Док
		|ИЗ
		|	&Товары КАК Товары	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Док.НомерСтроки КАК НомерСтроки,
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.Номенклатура.ЦеноваяГруппа КАК Номенклатура_ЦеноваяГруппа,
		|	Док.Характеристика КАК Характеристика,
		|	Док.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка) КАК ПроизвольныйВидЦен,
		|	Док.ВидЦены.Родитель.Наименование = ""Архив"" КАК СтарыйВидЦен
		|ПОМЕСТИТЬ ВТСтроки
		|ИЗ
		|	ВР_Док КАК Док
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Строки.ПроизвольныйВидЦен
		|					И Строки.СтарыйВидЦен
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоСтарыеВидыЦен,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Строки.ПроизвольныйВидЦен
		|					И НЕ Строки.СтарыйВидЦен
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоНовыеВидыЦен
		|ПОМЕСТИТЬ ВТКоличествоСтрокПоВидамЦен
		|ИЗ
		|	ВТСтроки КАК Строки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
		|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатуры.Цена КАК Цена
		|ПОМЕСТИТЬ ВТЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			(Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					ВТСтроки.Номенклатура,
		|					ВТСтроки.Характеристика
		|				ИЗ
		|					ВТСтроки)) КАК ЦеныНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Строки.НомерСтроки КАК НомерСтроки,
		|	Строки.Номенклатура КАК Номенклатура,
		|	Строки.Характеристика КАК Характеристика,
		|	Строки.ПроизвольныйВидЦен КАК ПроизвольныйВидЦен,
		|	Строки.СтарыйВидЦен КАК СтарыйВидЦен,
		|	ЕСТЬNULL(УточнениеЦеновыеГруппы.ВидЦен, &ВидЦен) КАК ВидЦеныПоСоглашению,
		|	ЕСТЬNULL(УточнениеЦеновыеГруппы.ГруппаВидовЦен, &ГруппаВидовЦен) КАК ГруппаВидовЦенПоСоглашению,
		|	ВЫБОР
		|		КОГДА НЕ УточнениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL
		|			ТОГДА ""По ценовым группам""
		|	КОНЕЦ КАК ВидУточнения_ВидЦен,
		|	ВЫБОР
		|		КОГДА НЕ УточнениеЦеновыеГруппы.ГруппаВидовЦен ЕСТЬ NULL
		|			ТОГДА ""По ценовым группам""
		|	КОНЕЦ КАК ВидУточнения_ГруппаВидовЦен
		|ПОМЕСТИТЬ ВР_ЦеновыеГруппы
		|ИЗ
		|	ВТСтроки КАК Строки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК УточнениеЦеновыеГруппы
		|		ПО (&Соглашение = УточнениеЦеновыеГруппы.Ссылка)
		|			И Строки.Номенклатура.ЦеноваяГруппа = УточнениеЦеновыеГруппы.ЦеноваяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_ЦеновыеГруппы.НомерСтроки КАК НомерСтроки,
		|	ВР_ЦеновыеГруппы.Номенклатура КАК Номенклатура,
		|	ВР_ЦеновыеГруппы.Характеристика КАК Характеристика,
		|	ВР_ЦеновыеГруппы.ПроизвольныйВидЦен КАК ПроизвольныйВидЦен,
		|	ВР_ЦеновыеГруппы.СтарыйВидЦен КАК СтарыйВидЦен,
		|	ЕСТЬNULL(УточнениеТовары.ВидЦены, ВР_ЦеновыеГруппы.ВидЦеныПоСоглашению) КАК ВидЦеныПоСоглашению,
		|	ЕСТЬNULL(УточнениеТовары.ГруппаВидовЦен, ВР_ЦеновыеГруппы.ГруппаВидовЦенПоСоглашению) КАК ГруппаВидовЦенПоСоглашению,
		|	ВЫБОР
		|		КОГДА НЕ УточнениеТовары.ВидЦены ЕСТЬ NULL
		|			ТОГДА ""Уточнение по товарам""
		|		ИНАЧЕ ВР_ЦеновыеГруппы.ВидУточнения_ВидЦен
		|	КОНЕЦ КАК ВидУточнения_ВидЦен,
		|	ВЫБОР
		|		КОГДА НЕ УточнениеТовары.ГруппаВидовЦен ЕСТЬ NULL
		|			ТОГДА ""Уточнение по товарам""
		|		ИНАЧЕ ВР_ЦеновыеГруппы.ВидУточнения_ГруппаВидовЦен
		|	КОНЕЦ КАК ВидУточнения_ГруппаВидовЦен
		|ПОМЕСТИТЬ ВР_Уточнения
		|ИЗ
		|	ВР_ЦеновыеГруппы КАК ВР_ЦеновыеГруппы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК УточнениеТовары
		|		ПО ВР_ЦеновыеГруппы.Номенклатура = УточнениеТовары.Номенклатура
		|			И ВР_ЦеновыеГруппы.Характеристика = УточнениеТовары.Характеристика
		|			И (&Соглашение = УточнениеТовары.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Уточнения.НомерСтроки КАК НомерСтроки,
		|	Уточнения.Номенклатура КАК Номенклатура,
		|	Уточнения.Характеристика КАК Характеристика,
		|	Уточнения.ВидЦеныПоСоглашению КАК ВидЦеныПоСоглашению,
		|	Уточнения.ГруппаВидовЦенПоСоглашению КАК ГруппаВидовЦенПоСоглашению,
		|	Уточнения.ВидУточнения_ВидЦен КАК ВидУточнения_ВидЦен,
		|	Уточнения.ВидУточнения_ГруппаВидовЦен КАК ВидУточнения_ГруппаВидовЦен,
		|	Уточнения.ПроизвольныйВидЦен КАК ПроизвольныйВидЦен,
		|	Уточнения.СтарыйВидЦен КАК СтарыйВидЦен,
		|	КоличествоСтрокПоВидамЦен.КоличествоНовыеВидыЦен = 0 КАК ИспользуютсяТолькоСтарыеЦены,
		|	КоличествоСтрокПоВидамЦен.КоличествоНовыеВидыЦен = 0
		|		ИЛИ КоличествоСтрокПоВидамЦен.КоличествоСтарыеВидыЦен = 0 КАК ИспользуетсяТолькоОдинВидЦен,
		|	КоличествоСтрокПоВидамЦен.КоличествоНовыеВидыЦен = 0
		|		И КоличествоСтрокПоВидамЦен.КоличествоСтарыеВидыЦен = 0 КАК ИспользуютсяТолькоПроизвольныеВидыЦен
		|ПОМЕСТИТЬ ВР_УточненияИтог
		|ИЗ
		|	ВР_Уточнения КАК Уточнения
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТКоличествоСтрокПоВидамЦен КАК КоличествоСтрокПоВидамЦен
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Уточнения.НомерСтроки КАК НомерСтроки,
		|	Уточнения.Номенклатура КАК Номенклатура,
		|	Уточнения.Характеристика КАК Характеристика,
		|	Уточнения.ВидЦеныПоСоглашению КАК ВидЦеныПоСоглашению_ВидЦен,
		|	ВидыЦен.Ссылка КАК ВидЦеныПоСоглашению_ГруппаВидовЦен,
		|	Уточнения.ВидУточнения_ВидЦен КАК ВидУточнения_ВидЦен,
		|	Уточнения.ВидУточнения_ГруппаВидовЦен КАК ВидУточнения_ГруппаВидовЦен,
		|	ВЫБОР
		|		КОГДА Уточнения.ИспользуютсяТолькоПроизвольныеВидыЦен
		|				ИЛИ НЕ Уточнения.ИспользуетсяТолькоОдинВидЦен
		|			ТОГДА ВЫБОР
		|					КОГДА Уточнения.ПроизвольныйВидЦен
		|						ТОГДА ВЫБОР
		|								КОГДА &ДатаДокументаМеньше_28_03_2023
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Уточнения.СтарыйВидЦен
		|								ТОГДА ИСТИНА
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Уточнения.ИспользуютсяТолькоСтарыеЦены
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ИспользоватьСтарыйВидЦен
		|ПОМЕСТИТЬ ВТСтрокиИтог
		|ИЗ
		|	ВР_УточненияИтог КАК Уточнения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
		|		ПО (ВидыЦен.РегионПрисутствия = &РегионПрисутствия)
		|			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
		|			И (ВидыЦен.ГруппаВидовЦен = Уточнения.ГруппаВидовЦенПоСоглашению)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Строки.НомерСтроки КАК НомерСтроки,
		|	Строки.Номенклатура КАК Номенклатура,
		|	Строки.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА Строки.ИспользоватьСтарыйВидЦен
		|			ТОГДА Строки.ВидЦеныПоСоглашению_ВидЦен
		|		ИНАЧЕ Строки.ВидЦеныПоСоглашению_ГруппаВидовЦен
		|	КОНЕЦ КАК ВидЦеныПоСоглашению,
		|	ВЫБОР
		|		КОГДА Строки.ИспользоватьСтарыйВидЦен
		|			ТОГДА Строки.ВидУточнения_ВидЦен
		|		ИНАЧЕ Строки.ВидУточнения_ГруппаВидовЦен
		|	КОНЕЦ КАК ВидУточнения,
		|	ВЫБОР
		|		КОГДА Строки.ИспользоватьСтарыйВидЦен
		|			ТОГДА ЦенаПоСоглашению_ВидЦен.Цена
		|		ИНАЧЕ ЦенаПоСоглашению_ГруппаВидовЦен.Цена
		|	КОНЕЦ КАК ЦенаПоСоглашению
		|ИЗ
		|	ВТСтрокиИтог КАК Строки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныНоменклатуры КАК ЦенаПоСоглашению_ВидЦен
		|		ПО (Строки.Номенклатура = ЦенаПоСоглашению_ВидЦен.Номенклатура)
		|			И (Строки.Характеристика = ЦенаПоСоглашению_ВидЦен.Характеристика)
		|			И (Строки.ВидЦеныПоСоглашению_ВидЦен = ЦенаПоСоглашению_ВидЦен.ВидЦены)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныНоменклатуры КАК ЦенаПоСоглашению_ГруппаВидовЦен
		|		ПО (Строки.Номенклатура = ЦенаПоСоглашению_ГруппаВидовЦен.Номенклатура)
		|			И (Строки.Характеристика = ЦенаПоСоглашению_ГруппаВидовЦен.Характеристика)
		|			И (Строки.ВидЦеныПоСоглашению_ГруппаВидовЦен = ЦенаПоСоглашению_ГруппаВидовЦен.ВидЦены)
		|
		|СГРУППИРОВАТЬ ПО
		|	Строки.НомерСтроки,
		|	Строки.Номенклатура,
		|	Строки.Характеристика,
		|	ВЫБОР
		|		КОГДА Строки.ИспользоватьСтарыйВидЦен
		|			ТОГДА Строки.ВидЦеныПоСоглашению_ВидЦен
		|		ИНАЧЕ Строки.ВидЦеныПоСоглашению_ГруппаВидовЦен
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Строки.ИспользоватьСтарыйВидЦен
		|			ТОГДА Строки.ВидУточнения_ВидЦен
		|		ИНАЧЕ Строки.ВидУточнения_ГруппаВидовЦен
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Строки.ИспользоватьСтарыйВидЦен
		|			ТОГДА ЦенаПоСоглашению_ВидЦен.Цена
		|		ИНАЧЕ ЦенаПоСоглашению_ГруппаВидовЦен.Цена
		|	КОНЕЦ";               
	
	Дата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
		                                  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаДокументаМеньше_28_03_2023", Дата < Дата(2023, 3, 28));
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить( , "НомерСтроки, Номенклатура, Характеристика, ВидЦены"));
	
	Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);    	
	Запрос.УстановитьПараметр("ВидЦен", Объект.Соглашение.ВидЦен);
	Запрос.УстановитьПараметр("ГруппаВидовЦен", Объект.Соглашение.ГруппаВидовЦен);  
	
	Запрос.УстановитьПараметр("РегионПрисутствия", Объект.Склад.Подразделение.РегионПрисутствия);
	Запрос.УстановитьПараметр("ФорматПодразделения", Объект.Склад.Подразделение.ФорматПодразделения);
	
	ТаблицаСоглашения = Запрос.Выполнить().Выгрузить();
	Для Каждого стр Из Объект.Товары Цикл
		Строки = ТаблицаСоглашения.НайтиСтроки(
			Новый Структура("НомерСтроки, Номенклатура, Характеристика", стр.НомерСтроки, стр.Номенклатура, стр.Характеристика));
			
		Если ЗначениеЗаполнено(Строки) тогда
			ЗаполнитьЗначенияСвойств(стр, Строки[0], "ВидЦеныПоСоглашению, ВидУточнения, ЦенаПоСоглашению");	
		КонецЕсли
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаписатьЛог(ТекстСобытия,Примечание) Экспорт
	
	ПользовательДляПроверки = ПолучитьНастройкиХранилища("ВключитьДопПроверкиПоКассовымСменам").КассирДляЛогирования;
	
	Если ПользовательДляПроверки.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (Пользователи.ТекущийПользователь() = ПользовательДляПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	ПолныйПутьКФайлу = "\\TG-Storage01\Alterra - общая\Харина М.А\лог\log";
	Если ПолныйПутьКФайлу <> "" Тогда
		ВремяЗаписи = ТекущаяДата();
		
		СтрокаЗаписи = "[" + Формат(ВремяЗаписи, "ДФ='yyyy/MM/dd HH:mm:ss'") + "]" + Символы.ПС 
		+ "[" + Строка(ТекстСобытия) + "]" + "[Прим: " + Строка(Примечание) + "]"+ Символы.ПС;		
		
		Попытка
			ФайлЛогов = Новый ЗаписьТекста(ПолныйПутьКФайлу, КодировкаТекста.UTF8,,Истина);
			ФайлЛогов.ЗаписатьСтроку(СтрокаЗаписи);
			ФайлЛогов.Закрыть();
		Исключение
			ЗаписьЖурналаРегистрации("ЗаписьВЛог", УровеньЖурналаРегистрации.Ошибка, ТекстСобытия,"Ошибка записи в лог", ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнформированиеВБитриксОПоступленииНаСкладМОЛТМЦ(Ссылка, Товары, Склад, АвторДокумента) Экспорт
	
	Если АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УведомлятьВБитриксОПоступлениях") Тогда
		
		ТекущийОтветственный = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "Подотчетник");
		Если Не ЗначениеЗаполнено(ТекущийОтветственный) Тогда
			ТекущийОтветственный = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТекущийОтветственный");			
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТекущийОтветственный) Тогда
			
			ТекстСообщения = "На склад '" + Склад + "' поступили ТМЦ по документу '" + Ссылка + "'. Автор документа: " + АвторДокумента + Символы.ПС;
			Для Каждого Строка Из Товары Цикл 
				ТекстСообщения = ТекстСообщения + Символы.ПС + "№" + Строка.НомерСтроки + " '" + Строка.Номенклатура + "'  Количество: " + Строка.КоличествоУпаковок + " " + Строка.Упаковка;
			КонецЦикла;                                          
			
			Результат = АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщения, ТекущийОтветственный);
			Если Результат <> Неопределено Тогда 
				ЗаписьЖурналаРегистрации("Информирование в Битрикс о поступлении на склад МОЛ ТМЦ", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Не получилось отправить данные в Битрикс!");
			КонецЕсли;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не получилось отправить данные в Битрикс! Для склада '" + Склад + "' не указан ответственный!");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры                                     

Функция ЕстьСвойствоОбъекта(Объект, ИмяСвойстваОбъекта) Экспорт

   ЕстьСвойство = Ложь;
   СтруктураОбъекта = Новый Структура(ИмяСвойстваОбъекта, Неопределено);
   ЗаполнитьЗначенияСвойств(СтруктураОбъекта, Объект);

   Если СтруктураОбъекта[ИмяСвойстваОбъекта] = Неопределено Тогда
       СтруктураОбъекта[ИмяСвойстваОбъекта] = Ложь;
       ЗаполнитьЗначенияСвойств(СтруктураОбъекта, Объект);
       Если СтруктураОбъекта[ИмяСвойстваОбъекта] <> Ложь Тогда
           ЕстьСвойство = Истина;
       КонецЕсли;
   Иначе
       ЕстьСвойство = Истина;
   КонецЕсли;

   Возврат ЕстьСвойство;// Булево

КонецФункции

#Область ЛогированиеОтчетов
Процедура ЗаписатьЛогиДляОтчета(Отчет, КомпоновщикНастроек) Экспорт	
	
	Комментарий = "";
	ТекДата = ТекущаяДата();     
	ИзвлечьПараметры(КомпоновщикНастроек.ПользовательскиеНастройки.Элементы, КомпоновщикНастроек.Настройки.Отбор.Элементы, Комментарий);                    
	
	Комментарий =                           
	Символы.ПС + "Отчет: " + Отчет +
	Символы.ПС + "Дата: " + ТекДата +
	Символы.ПС + "Пользователь: " + ПользователиКлиентСервер.ТекущийПользователь() +
	Символы.ПС + "Параметры: " + ?(ЗначениеЗаполнено(Комментарий), Комментарий, "(Параметры не заданы)"); 
	
	ЗаписатьЛоги("\\1C-alterra\C$\Bitrix\Log\" + Формат(НачалоНедели(ТекДата), "DF=dd-MM-yyyy") + "_Параметры_отчетов.txt", Ложь, Комментарий);  
КонецПроцедуры

Процедура ИзвлечьПараметры(Параметры, ПараметрыОтбора, Комментарий)	
	Если ЗначениеЗаполнено(Параметры) Тогда
		Для Каждого Параметр Из Параметры Цикл
			Если ТипЗнч(Параметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
				Если Параметр.Использование Тогда
					Комментарий = Комментарий + Символы.ПС + Параметр.Параметр + ": " + ОбработкаЗначений(Параметр.Значение);
				КонецЕсли;
			ИначеЕсли ТипЗнч(Параметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Если Параметр.Использование Тогда                                              
					Попытка
						Комментарий = Комментарий + Символы.ПС + Параметр.ЛевоеЗначение + " " + Параметр.ВидСравнения + " " + ОбработкаЗначений(Параметр.ПравоеЗначение);
					Исключение     
						Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
							Для Каждого ПараметрОтбора Из ПараметрыОтбора Цикл
								Если ПараметрОтбора.ИдентификаторПользовательскойНастройки = Параметр.ИдентификаторПользовательскойНастройки Тогда  
									Комментарий = Комментарий + Символы.ПС + ПараметрОтбора.ЛевоеЗначение + " " + Параметр.ВидСравнения + " " + ОбработкаЗначений(Параметр.ПравоеЗначение);
								КонецЕсли;	
							КонецЦикла;
						КонецЕсли;
					КонецПопытки; 
				КонецЕсли;    
			ИначеЕсли ТипЗнч(Параметр) = Тип("ОтборКомпоновкиДанных") Тогда
				ИзвлечьПараметры(Параметр.Элементы, ПараметрыОтбора, Комментарий);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;                    
КонецПроцедуры

Функция ОбработкаЗначений(Значение)	
	Комментарий = "";
	
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Для Каждого ЭлементСпискаЗначений Из Значение Цикл
			Если ЗначениеЗаполнено(Комментарий) Тогда      
				Комментарий = Комментарий + ", '" + ЭлементСпискаЗначений.Значение + "'";
			Иначе                                                                        
				Комментарий = "'" + ЭлементСпискаЗначений.Значение + "'";
			КонецЕсли; 
		КонецЦикла;
	Иначе
		Комментарий = Комментарий + "'" + Значение + "'";
	КонецЕсли;           
	
	Возврат Комментарий;
КонецФункции

Процедура ЗаписатьЛоги(ПолныйПутьКФайлу, СтираемСтарыеЛоги, Сообщение) Экспорт	
	Попытка                 		   
		ФайлЛогов = Новый ЗаписьТекста(ПолныйПутьКФайлу, КодировкаТекста.UTF8, , Не СтираемСтарыеЛоги);
		ФайлЛогов.ЗаписатьСтроку(Сообщение);
		ФайлЛогов.Закрыть();
	Исключение
		ЗаписьЖурналаРегистрации("ЗаписатьЛоги", УровеньЖурналаРегистрации.Ошибка, ,"Ошибка записи в лог", ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры 

#КонецОбласти          

Функция НайтиФизЛицоПоНаименованию(ФИО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ПометкаУдаления = ЛОЖЬ
	|	И ФизическиеЛица.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ФИО);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Возврат РезультатЗапроса.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция НовоеЦенообразование() экспорт
	
	возврат Константы.НоваяСхемаЦенообразования.Получить();	
	
КонецФункции

Функция НовоеЦенообразованиеЗакупа(ДатаПроверки=НЕОПРЕДЕЛЕНО) экспорт
	ДатаПроверки=?(не значениезаполнено(датапроверки),ТекущаяДата(),ДатаПроверки);
	ДатаПроверки=?(датапроверки=НЕОПРЕДЕЛЕНО,ТекущаяДата(),ДатаПроверки);
	возврат ДатаПроверки>=Константы.ДатаИспользованияНовойСхемыЗакупа.Получить();	
КонецФункции // НовоеЦенообразованиеЗакупа()


Функция ПодобратьВидЦеныТСК(ВидЦены) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыЦен.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.РегионПрисутствия = &РегионПрисутствия
	|	И ВидыЦен.ФорматПодразделения = &ФорматПодразделения
	|	И ВидыЦен.ГруппаВидовЦен = &ГруппаВидовЦен";
	
	Запрос.УстановитьПараметр("ГруппаВидовЦен", ВидЦены.ГруппаВидовЦен);
	Запрос.УстановитьПараметр("РегионПрисутствия", ВидЦены.РегионПрисутствия);
	Запрос.УстановитьПараметр("ФорматПодразделения", Справочники.ФорматыПодразделений.НайтиПоНаименованию("ТСК"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.ссылка;  
	иначе
		Возврат Справочники.ВидыЦен.ПустаяСсылка();
	Конецесли;
	
	
КонецФункции // ПодобратьВидЦены()

Процедура ОбработатьЛистСогласованияПоДокументу(Статус, ДокументСсылка) Экспорт
	Если Статус <> "Подписан" Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛистСогласования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистСогласования КАК ЛистСогласования
	|ГДЕ
	|	ЛистСогласования.Основание = &Основание
	|	И НЕ ЛистСогласования.Аннулирован
	|	И НЕ ЛистСогласования.Исполнен
	|	И ЛистСогласования.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления)";
	
	Запрос.УстановитьПараметр("Основание", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	ТекДата = ТекущаяДата();  
	Если День(ТекДата) >= 1 И День(ТекДата) < 11 Тогда
		ДатаИсполнения = НачалоМесяца(ТекДата) - 1;
	Иначе 
		ДатаИсполнения = ТекДата;
	КонецЕсли;
	
	Пока РезультатЗапроса.Следующий() Цикл
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ДокОбъект.ДатаИсполнения = ДатаИсполнения;
		ДокОбъект.Исполнен = Истина;
		ДокОбъект.Исполнитель = Пользователи.ТекущийПользователь();
		ДокОбъект.ДатаРегистрацииИсполнения = ТекДата;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

Функция ОприходованиеИзлишковТоваров_ПараметрыОткрытияФормы(Объект) Экспорт
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация",   АльтерраОбщегоНазначения.ПолучитьАСКР());
	ПараметрыОткрытияФормы.Вставить("Склад", 		 Объект.Склад);       
	ПараметрыОткрытияФормы.Вставить("Комментарий",   "излишки касса");
	ПараметрыОткрытияФормы.Вставить("СтатьяДоходов", ПланыВидовХарактеристик.СтатьиДоходов.НайтиПоКоду("0А-000003")); // Результаты инвентаризаций (товар)
	ПараметрыОткрытияФормы.Вставить("Товары", 		 ПоместитьВоВременноеХранилище(
		Объект.Товары.Выгрузить( ,"Номенклатура, Характеристика, Цена, Сумма, Серия, СтатусУказанияСерий, Кладовщик"),
		Новый УникальныйИдентификатор));
		
	Возврат ПараметрыОткрытияФормы;
КонецФункции    

#Область ПроверитьВозможностьРучныхСкидкок

Процедура СохранитьПроцентРучнойСкидки(Товары) Экспорт
	Для Каждого Стр Из Товары Цикл
		Стр.ПроцентРучнойСкидки_СтароеЗначение = Стр.ПроцентРучнойСкидки;
		Стр.Номенклатура_СтароеЗначение = Стр.Номенклатура;
	КонецЦикла; 
КонецПроцедуры

Процедура ПроверитьВозможностьРучныхСкидкок(Отказ, Товары, Соглашение)  Экспорт
	
	Если РольДоступна("ПолныеПрава") Тогда //ИЛИ РольДоступна("ОтметкаКассы")  Тогда
		Возврат;
	КонецЕсли;
	
	ОграниченияРучныхСкидок = НастройкиПродажДляПользователейСервер.ОграниченияСкидокНаценок(Соглашение, Пользователи.ТекущийПользователь());
	Если ОграниченияРучныхСкидок.Количество() > 0 Тогда
		стрОграничения =  ОграниченияРучныхСкидок[0]; // Берем любую, т.к. нет деления скидок по ценовым группам
		Если ЗначениеЗаполнено(стрОграничения.МаксимальныйПроцентРучнойСкидки) Тогда
			Для Каждого Стр Из Товары Цикл
				Если ЗначениеЗаполнено(Стр.ПроцентРучнойСкидки) И Стр.ПроцентРучнойСкидки > стрОграничения.МаксимальныйПроцентРучнойСкидки Тогда
					Если Стр.ПроцентРучнойСкидки = Стр.ПроцентРучнойСкидки_СтароеЗначение Тогда
						Если Стр.Номенклатура <> Стр.Номенклатура_СтароеЗначение Тогда
							ОбщегоНазначения.СообщитьПользователю("Для строки #" + Стр.НомерСтроки + " задан процент ручной скидки, превышающий допустимое значение для пользователя! Номенклатура не должна меняться");
							Отказ = Истина;
							Прервать;
						КонецЕсли;
					Иначе
						ОбщегоНазначения.СообщитьПользователю("Для строки #" + Стр.НомерСтроки + " задан процент ручной скидки, превышающий допустимое значение для пользователя! (" + стрОграничения.МаксимальныйПроцентРучнойСкидки + ")");
						Отказ = Истина;
						Прервать;	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти  

Функция ПолучитьРуководителяОтдела(ПользовательСотрудника) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Отдел.Руководитель КАК РуководительОтдела
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Пользователь = &Пользователь
	|	И Сотрудники.Пользователь.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Уволен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Пользователь", ПользовательСотрудника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.РуководительОтдела;
	Иначе
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции   

Функция РольДоступнаОтделАналитики()  Экспорт
	
	Если РольДоступна("ОтделАналитики") ИЛИ РольДоступна("ПолныеПрава") Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//Начисление и списание ББ   

Функция СуммаПревышаетДопустимую(Объект,Сумма = Неопределено, ВходящиеДанные = Неопределено)Экспорт
	
	Сообщение = "";	
	Если Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Списание  Тогда
		Возврат Сообщение;
    КонецЕсли;
	
	Если Сумма = Неопределено Тогда
		Если Объект.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление Тогда 
			Сумма = Объект.Начисление.Итог("Баллы"); 
		КонецЕсли;
	КонецЕсли;
	
	ДопустимаяСуммаУтвержденияББ = ПолучитьКонстанту_ДопустимаяСуммаУтвержденияББ();
	ДопустимаяСуммаУтвержденияББОбменВТЗ = ПолучитьКонстанту_ДопустимаяСуммаУтвержденияББОбменВТЗ(); 

	Если Объект.Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Обмен в ТЗ (по БП)") И Сумма > ДопустимаяСуммаУтвержденияББОбменВТЗ Тогда   
		
		Сообщение = "Для начислений по причине ""Обмен в ТЗ (по БП)"" сумма не должна превышать " + ДопустимаяСуммаУтвержденияББОбменВТЗ + " бб. ";       
		
	ИначеЕсли  Сумма >= ДопустимаяСуммаУтвержденияББ Тогда  
		
		Если ВходящиеДанные = Неопределено Тогда
			МассивУтверждающих = Новый Массив(); 
			МассивУтверждающих.Добавить(Объект.Утверждающий1);
			МассивУтверждающих.Добавить(Объект.Утверждающий2);
		Иначе
			МассивУтверждающих = ПолучитьМассивУтверждающихПоВходящимДанным(ВходящиеДанные);			
		КонецЕсли; 
		
		Если НЕ ЕстьДопУтверждающий(МассивУтверждающих)  Тогда
			Сообщение = "При сумме " + ДопустимаяСуммаУтвержденияББ +  " бб. и более нужно выбрать Утверждающего с правом доп. согласования ББ ";   
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

Функция ПолучитьМассивУтверждающих(ДопУтверждение) Экспорт 
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|   Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Уволен = ЛОЖЬ
	|   И Условие";
	
	Если ДопУтверждение Тогда 
		Условие = "Сотрудники.ДопУтверждениеББ = ИСТИНА";
	Иначе
		Условие = "Сотрудники.Должность.УтверждениеББ = ИСТИНА";
	КонецЕсли;  
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса,"Условие",Условие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивУтверждающих = Новый Массив;
	
	Пока Выборка.Следующий() Цикл	
		МассивУтверждающих.Добавить(Выборка.Сотрудник);	
	КонецЦикла;
	
	Возврат  МассивУтверждающих;
	
КонецФункции

Функция ЕстьДопУтверждающий(МассивУтверждающих) Экспорт
	
	ДопУтверждение = Истина;
	МассивДопУтверждающих = ПолучитьМассивУтверждающих(ДопУтверждение); 
	
	Для Каждого Утв из МассивУтверждающих Цикл
		Если МассивДопУтверждающих.Найти(Утв) <> Неопределено  Тогда   
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;  
	
КонецФункции

Функция ПолучитьМассивУтверждающихПоВходящимДанным(ВходящиеДанные)
	
	МассивУтверждающих = Новый Массив;
	
	Для Ин = 1 По 2 Цикл 
		
		ИмяРеквизита = "Утверждающий" + Ин;
		
		Если ЗначениеЗаполнено(ВходящиеДанные[ИмяРеквизита]) Тогда   
			
			Пользователь = АльтерраВзаимодействиеСБитрикс24.ПолучитьПользователяПоИд(ВходящиеДанные[ИмяРеквизита]);  
			
			Если ЗначениеЗаполнено(Пользователь) Тогда    
				
				УтверждающийСотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователь);
				
				Если ЗначениеЗаполнено(УтверждающийСотрудник) Тогда
					МассивУтверждающих.Добавить(УтверждающийСотрудник); 
				КонецЕсли; 
				
			КонецЕсли;     
			
		КонецЕсли;
		
	КонецЦикла; 
	Возврат  МассивУтверждающих;    
	
КонецФункции

Функция ПолучитьКонстанту_ДопустимаяСуммаУтвержденияББ()Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Константа = Константы.ДопустимаяСуммаУтвержденияББ.Получить();
	УстановитьПривилегированныйРежим(Ложь); 
	
	Возврат Константа;
	
КонецФункции

Функция ПолучитьКонстанту_ДопустимаяСуммаУтвержденияББОбменВТЗ() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Константа = Константы.ДопустимаяСуммаУтвержденияББОбменВТЗ.Получить(); 
	УстановитьПривилегированныйРежим(Ложь); 
	
	Возврат Константа;
	
КонецФункции 

Функция НужноСогласованиеАналитиков(Причина) Экспорт
	
	Если Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Доначисление (по бп)") 
		ИЛИ Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Неверный ценник (по бп)") 
		ИЛИ Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Прочее (по бп)") Тогда
		Возврат  Истина;
	Иначе
		Возврат Ложь;     
	КонецЕсли; 
	
КонецФункции

Функция ЕстьМаркируемыеТовары(Товары) Экспорт 
	
	МассивИсключений = Новый Массив; 
	ОсобенностиУчетаПеречисление = Перечисления.ОсобенностиУчетаНоменклатуры;
	МассивИсключений.Добавить(ОсобенностиУчетаПеречисление.ПустаяСсылка());
	МассивИсключений.Добавить(ОсобенностиУчетаПеречисление.БезОсобенностейУчета);
    МассивИсключений.Добавить(ОсобенностиУчетаПеречисление.Партнером); 
	МассивИсключений.Добавить(ОсобенностиУчетаПеречисление.ОрганизациейПоАгентскойСхеме); 
    МассивИсключений.Добавить(ОсобенностиУчетаПеречисление.ОрганизациейПродавцом); 

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Товары1
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары1.Номенклатура КАК Номенклатура
	|ИЗ
	|	Товары1 КАК Товары1
	|ГДЕ
	|  НЕ Товары1.Номенклатура.ОсобенностьУчета В(&ОсобенностиУчетаИсключение)";
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
	Запрос.УстановитьПараметр("ОсобенностиУчетаИсключение", МассивИсключений);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ОпределитьСклад(Документ) экспорт
	МетаданныеДокумента=Документ.Метаданные();
	если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад",МетаданныеДокумента) тогда
		возврат Документ.Склад;
	конецесли;	
	возврат НЕОПРЕДЕЛЕНО;
КонецФункции	

//Пересчет товаров 

Функция Тип_ТоварПодОстаток(Пересчет) Экспорт 
	
	Если  Пересчет.ТипПересчета = Справочники.ТипыПересчетов.НайтиПоНаименованию("Товар под остаток") Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь; 
	
КонецФункции

Процедура КонтрольОбособленногоОстатка(Объект, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
		|	ЗапасыИПотребностиОстатки.Склад КАК Склад,
		|	ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
		|	Сумма(ЗапасыИПотребностиОстатки.ВНаличииОстаток + ЗапасыИПотребностиОстатки.ЗаказаноОстаток) как Обеспечивается,
		|	Сумма(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток +
		|		ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток + ЗапасыИПотребностиОстатки.КОбеспечениюОстаток +
		|		ЗапасыИПотребностиОстатки.НеОбеспечиватьОстаток) как НужноОбеспечить
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
		|ГДЕ
		|	ЗапасыИПотребностиОстатки.Назначение.Заказ = &Заказ
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыИПотребностиОстатки.Номенклатура,
		|	ЗапасыИПотребностиОстатки.Характеристика,
		|	ЗапасыИПотребностиОстатки.Склад,
		|	ЗапасыИПотребностиОстатки.Назначение
		|Имеющие
		|	Сумма(ЗапасыИПотребностиОстатки.ВНаличииОстаток +
		|		ЗапасыИПотребностиОстатки.ЗаказаноОстаток) > Сумма(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток +
		|		ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток + ЗапасыИПотребностиОстатки.КОбеспечениюОстаток +
		|		ЗапасыИПотребностиОстатки.НеОбеспечиватьОстаток)";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ШаблонСообщения = НСтр("ru = 'Номенклатура: %НоменклатураХарактеристика% Склад: %Склад% Назначение: %Назначение%
			|Заказано для обеспечения больше чем необходимо на %Количество% '");
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристика%",
			НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Назначение%", Строка(Выборка.Назначение));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(Выборка.Обеспечивается-Выборка.НужноОбеспечить));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%",      Строка(Выборка.Склад));
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,Отказ);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ПолучитьКассуККМ() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ НастройкаРМК
		|ИЗ
		|	Справочник.НастройкиРМК КАК Т
		|ГДЕ
		|	Т.РабочееМесто = &РабочееМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Кассы.ПодключаемоеОборудование КАК ККТ,
		|	Кассы.КассаККМ КАК Касса
		|ИЗ
		|	Справочник.НастройкиРМК.КассыККМ КАК Кассы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаРМК КАК НастройкаРМК
		|		ПО (НастройкаРМК.Ссылка = Кассы.Ссылка)
		|ГДЕ
		|	НЕ Кассы.ПодключаемоеОборудование.ПометкаУдаления
		|	И Кассы.ПодключаемоеОборудование.УстройствоИспользуется";
	
	Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

#Область ОтправкаСообщенийВБитрикс
Процедура ОтправитьСообщениеОЗаменеКартинки(ТекстСообщения, Номенклатура, Замечание, АвторЗамечания) Экспорт
	 
	Список = ПолучитьНастройкиХранилища("АдресатПолученияЗапросаОЗаменеКартинки");
	Для каждого Получатель Из Список.СписокПолучателей Цикл
		АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщения + Номенклатура + " (Код - " + Номенклатура.Код + ")" + Символы.ПС + "Замечание: " + Замечание + Символы.ПС + "Автор замечания: " + АвторЗамечания, Получатель.Значение);
	КонецЦикла;	
	 
	АльтерраОбщегоНазначения.СообщитьПользователю( ,"Спасибо за обращение!", ); 
	
КонецПроцедуры

Процедура ОтправитьСообщениеОЗаменеКомплектующих(ПараметрыСообщения) Экспорт
	 
	Список = ПолучитьНастройкиХранилища("АдресатПолученияЗапросаОЗаменеКомплектующих");
	Для каждого Получатель Из Список.СписокПолучателей Цикл
		Если НЕ Получатель = Справочники.Пользователи.ПустаяСсылка() Тогда
			АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ПараметрыСообщения.ТекстСообщения + ПараметрыСообщения.Номенклатура + " (Код - " + ПараметрыСообщения.Номенклатура.Код + ")" + Символы.ПС
																	+ "Комплектующий товар: " + ПараметрыСообщения.КомплектующийТовар + Символы.ПС
																	+ "Вид запроса: " + ПараметрыСообщения.ВидЗапроса + Символы.ПС
																	+ "Замечание: " + ПараметрыСообщения.Замечание + Символы.ПС
																	+ "Автор замечания: " + ПараметрыСообщения.АвторЗамечания,
																	Получатель.Значение);
		КонецЕсли;		
	КонецЦикла;	
	 
	АльтерраОбщегоНазначения.СообщитьПользователю( ,"Спасибо за обращение!", ); 
	
КонецПроцедуры

Процедура ОтправитьСообщениеОРазблокировкеВБитрикс24 (ПараметрыСообщения) Экспорт
	ТекстСообщения = "";
	Если ПараметрыСообщения.Свойство("НомерБлокировки") Тогда
		ТекстСообщения = "Разблокированны товары из блокировки №" + ПараметрыСообщения.НомерБлокировки + Символы.ПС
	Иначе
		ТекстСообщения = "Разблокированы товары без блокировки-основания" + Символы.ПС
	КонецЕсли;
	ТекстСообщения = ТекстСообщения + "Автор разблокировки: " + ПараметрыСообщения.АвторРазблокировки + Символы.ПС
					+ "Список товаров: " + Символы.ПС + ПараметрыСообщения.СписокТоваров;
	Если ПараметрыСообщения.Свойство("Комментарий") Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Комментарий: " + ПараметрыСообщения.Комментарий;
	КонецЕсли;

	Если ПараметрыСообщения.Свойство("Склад") И ПараметрыСообщения.Склад = Справочники.Склады.НайтиПоНаименованию("Склад (Выбор)") Тогда
			
		ТекстСообщения = ТекстСообщения + Символы.ПС + "РуководительСекции: " + ПараметрыСообщения.РуководительСекции;
		Запрос = Новый Запрос;
		Запрос.Текст = "Выбрать Ссылка из Справочник.Сотрудники Где Наименование = &п1 И Уволен = ЛОЖЬ И ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("п1", "Краснова Алёна Александровна");
		Результат = Запрос.Выполнить().Выгрузить();
		Получатель = Результат[0].Ссылка;
		АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщения, Получатель);
	КонецЕсли;	
		
	АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщения, ПараметрыСообщения.РуководительСекции);
	
КонецПроцедуры

#КонецОбласти
	











