
Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.НачислениеУдержаний.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеУдержанийНачисления.Ссылка.Номер КАК Номер,
	|	НачислениеУдержанийНачисления.Ссылка.Дата КАК Дата,
	|	НачислениеУдержанийНачисления.Ссылка.Автор КАК Автор,
	|	НачислениеУдержанийНачисления.Ссылка.Комментарий КАК Комментарий,
	|	НачислениеУдержанийНачисления.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|	НачислениеУдержанийНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(НачислениеУдержанийНачисления.СуммаУдержания) КАК СуммаУдержания,
	|	СУММА(НачислениеУдержанийНачисления.СуммаВозврата) КАК СуммаВозврата,
	|	НачислениеУдержанийНачисления.Ссылка КАК Ссылка,
	|	СУММА(НачислениеУдержанийНачисления.СуммаЗадержки) КАК СуммаЗадержки
	|ИЗ
	|	Документ.НачислениеУдержаний.Начисления КАК НачислениеУдержанийНачисления
	|ГДЕ
	|	НачислениеУдержанийНачисления.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачислениеУдержанийНачисления.Ссылка.Дата,
	|	НачислениеУдержанийНачисления.Ссылка.Автор,
	|	НачислениеУдержанийНачисления.Ссылка.Комментарий,
	|	НачислениеУдержанийНачисления.Ссылка.ПериодНачисления,
	|	НачислениеУдержанийНачисления.Сотрудник,
	|	НачислениеУдержанийНачисления.Ссылка.Номер,
	|	НачислениеУдержанийНачисления.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеУдержанийНачисления.Сотрудник.Наименование
	|ИТОГИ
	|	СУММА(СуммаУдержания),
	|	СУММА(СуммаВозврата),
	|	СУММА(СуммаЗадержки)
	|ПО
	|	Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНачисленияШапка = Макет.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = Макет.ПолучитьОбласть("Начисления");
	ОбластьНачисленияИтого = Макет.ПолучитьОбласть("НачисленияИтого");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьНачисленияИтого.Параметры.Заполнить(Выборка);
		
		Шапка.Параметры.Заполнить(Выборка);
		//Месяц начисления
		Шапка.Параметры.МесяцНачисления= АльтерраОбщегоНазначения.ПолучитьМесяцСтрокой(Выборка.ПериодНачисления);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьНачисленияШапка);
		
		Ном= 1;
		ВыборкаНачисления = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ОбластьНачисления.Параметры.НомерСтроки= Ном;
			ТабДок.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
			Ном= Ном+1;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьНачисленияИтого);
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
