#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НачисленияУдержаний 
	Движения.НачисленияУдержаний.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.НачисленияУдержаний.Добавить();
		Движение.Период = Дата;
		Движение.ПериодНачисления = ПериодНачисления;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Удержание = ТекСтрокаНачисления.Удержание;
		Движение.РегистраторУдержания = ТекСтрокаНачисления.РегистраторУдержания;
		Движение.СуммаЗадержки = ТекСтрокаНачисления.СуммаЗадержки;
		Движение.СуммаУдержания = ТекСтрокаНачисления.СуммаУдержания;
		Движение.СуммаВозврата = ТекСтрокаНачисления.СуммаВозврата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецЕсли