#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОформитьОрдера(Ссылка) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
                        Если Не Ссылка.Проведен Тогда
		Сообщить("Документ не проведен!");
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
			
		Распоряжение = ?(ЗначениеЗаполнено(Ссылка.ЗаказНаСборку),Ссылка.ЗаказНаСборку,Ссылка);
		МассивРаспоряжений = Новый Массив;
		МассивРаспоряжений.Добавить(Распоряжение);
		
		СтруктураПараметровСозданияРасходныхОрдеров = СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
		
		СтруктураПараметровСозданияРасходныхОрдеров.ЗаданиеНаПеревозку = Неопределено;
		СтруктураПараметровСозданияРасходныхОрдеров.Получатель = Ссылка.Склад;
		СтруктураПараметровСозданияРасходныхОрдеров.РаспоряженияНаОтгрузку = МассивРаспоряжений;
		СтруктураПараметровСозданияРасходныхОрдеров.Склад = Ссылка.Склад;
		
		ОформОрдера = СкладыСервер.ПереоформитьРасходныеОрдера(СтруктураПараметровСозданияРасходныхОрдеров);
	    РабочийУчасток = ПолучитьРабочийУчастокПоНакладной(Ссылка);
		
		Для каждого строка из ОформОрдера.ОформленныеОрдера Цикл
			ОрдерОбъект = Строка.РасходныйОрдер.ПолучитьОбъект();
			ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
			ОрдерОбъект.Накладная = Ссылка;  
			Если Не РабочийУчасток = Неопределено Тогда 
				ОрдерОбъект.РабочийУчасток = РабочийУчасток;      
			КонецЕсли;
			Для каждого строка1 из ОрдерОбъект.ОтгружаемыеТовары Цикл
				строка1.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
			КонецЦикла;
			ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		
		Если Не ОформОрдера.ЕстьОшибка Тогда
			Сообщить("Созданы (обновлены) расходные ордера");	
		КонецЕсли;	
		
		НакладнаяЯвляетсяРаспоряжением = ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(Ссылка.ВариантПриемкиТоваров);
		
		РаспоряжениеНаПриемку = ?(НакладнаяЯвляетсяРаспоряжением ИЛИ  НЕ ЗначениеЗаполнено(Ссылка.ЗаказНаСборку),Ссылка, Ссылка.ЗаказНаСборку); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Распоряжение = &Ссылка
		|	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ссылка", РаспоряжениеНаПриемку);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПриходныйОрдер = ВыборкаДетальныеЗаписи.Ссылка;	
		КонецЦикла;
		
		Если ПриходныйОрдер.Пустая() Тогда
			ПриходныйОрдерОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
		Иначе
			ПриходныйОрдерОбъект =  ПриходныйОрдер.ПолучитьОбъект();
		КонецЕсли;
		
		Если ПриходныйОрдерОбъект.Дата = Дата(1,1,1) Тогда
			ПриходныйОрдерОбъект.Дата = ТекущаяДата();
		КонецЕсли;
		
		//Если ПриходныйОрдерОбъект.ДатаПоступления = Дата(1,1,1) Тогда
		//     ПриходныйОрдерОбъект.ДатаПоступления = ТекущаяДата();
		//КонецЕсли;
		
		
		ПриходныйОрдерОбъект.Распоряжение = РаспоряжениеНаПриемку;
		ПриходныйОрдерОбъект.Склад = Ссылка.Склад;
		ПриходныйОрдерОбъект.Отправитель = Ссылка.Склад;
		ПриходныйОрдерОбъект.ХозяйственнаяОперация = Ссылка.ХозяйственнаяОперация;
		ПриходныйОрдерОбъект.Статус= Перечисления.СтатусыПриходныхОрдеров.Принят;
		
		ПриходныйОрдерОбъект.Товары.Очистить();
		
		Если Ссылка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
			ПриходныйОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаСобранныхКомплектов; 
			НоваяСтрока = ПриходныйОрдерОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Ссылка);
		ИначеЕсли Ссылка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
			ПриходныйОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаКомплектующихПослеРазборки; 
			ПриходныйОрдерОбъект.Товары.Загрузить(Ссылка.Товары.Выгрузить());
		КонецЕсли;
		
		ПриходныйОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Созданы (обновлены) приходные ордера");
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить("Ордера не созданы! Описание ошибки: " +ИнформацияОбОшибке().Описание);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
 КонецПроцедуры
 
 Функция ПолучитьРабочийУчастокПоНакладной(Накладная)
	 
	РабочийУчасток = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияОтгрузкиНакладных.РабочийУчасток КАК РабочийУчасток
		|ИЗ
		|	РегистрСведений.СостоянияОтгрузкиНакладных КАК СостоянияОтгрузкиНакладных
		|ГДЕ
		|	СостоянияОтгрузкиНакладных.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Накладная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РабочийУчасток = ВыборкаДетальныеЗаписи.РабочийУчасток;
	КонецЦикла;
	
	Возврат РабочийУчасток;

 КонецФункции          
 
Процедура ПоменятьСтатусыУРасходныхПриходныхОрдеров(Ссылка) Экспорт
	 
	 УстановитьПривилегированныйРежим(Истина);
	 
	 НачатьТранзакцию();
	 Попытка
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
		 |ИЗ
		 |	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		 |ГДЕ
		 |	РасходныйОрдерНаТовары.Накладная = &Ссылка
		 |	И РасходныйОрдерНаТовары.Проведен = ИСТИНА";
		 
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 
		 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		 
		 РасходныйОрдер = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
		 
		 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			 ОрдерОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			 ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен;
			 Для каждого строка1 из ОрдерОбъект.ОтгружаемыеТовары Цикл
				 строка1.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
			 КонецЦикла;
			 ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);	
		 КонецЦикла;
		 
		 НакладнаяЯвляетсяРаспоряжением = ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(Ссылка.ВариантПриемкиТоваров);
		
		РаспоряжениеНаПриемку = ?(НакладнаяЯвляетсяРаспоряжением ИЛИ  НЕ ЗначениеЗаполнено(Ссылка.ЗаказНаСборку),Ссылка, Ссылка.ЗаказНаСборку); 
		
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		 |ИЗ
		 |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		 |ГДЕ
		 |	ПриходныйОрдерНаТовары.Распоряжение = &Ссылка
		 |	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА";
		 
		 Запрос.УстановитьПараметр("Ссылка", РаспоряжениеНаПриемку);
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 
		 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		 
		 ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();
		 
		 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			 ПриходныйОрдер = ВыборкаДетальныеЗаписи.Ссылка;	
		 КонецЦикла;
		 
		 Если Не ПриходныйОрдер.Пустая() Тогда
			 
			 ПриходныйОрдерОбъект =  ПриходныйОрдер.ПолучитьОбъект();
			 ПриходныйОрдерОбъект.Статус= Перечисления.СтатусыПриходныхОрдеров.КПоступлению;
			 ПриходныйОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
			 
		 КонецЕсли;
		 
		 ЗафиксироватьТранзакцию();
	 Исключение
		 ОтменитьТранзакцию();
		 Сообщить("Ошибка: " +ИнформацияОбОшибке().Описание);
	 КонецПопытки;
	 
	 УстановитьПривилегированныйРежим(Ложь);

 КонецПроцедуры
 
Функция ДанныеДляПечатиЭтикеток(МассивДокументов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СборкаТоваровТовары.Номенклатура КАК Номенклатура,
	|	СборкаТоваровТовары.Характеристика КАК Характеристика,
	|	СборкаТоваровТовары.Упаковка КАК Упаковка,
	|	1 КАК Порядок,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваровТовары
	|ГДЕ
	|	СборкаТоваровТовары.Ссылка В(&МассивДокументов)
	|	И ВЫБОР
	|			КОГДА СборкаТоваровТовары.Номенклатура.ИспользованиеХарактеристик В (ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
	|					И СборкаТоваровТовары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаТоваровТовары.Номенклатура,
	|	СборкаТоваровТовары.Характеристика,
	|	СборкаТоваровТовары.Упаковка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.Выполнить();
	
	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", Неопределено);
//	СтруктураДействий.Вставить("ЗаполнитьСклад",       Неопределено);
	СтруктураДействий.Вставить("ЗаполнитьВидЦены",      Неопределено);
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Ложь);
	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЭтикеток");
//	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе",ложь);
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу",истина);
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	СтруктураДействий.Вставить("ПроверкаНаРеквизитыНоменклатуры");
	
	// Подготовка данных для заполенения табличной части обработки печати ценников и этикеток.
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов.Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("ОтгрузкаПоНакладным");     
КонецПроцедуры  

Функция ТекстЗапросаТаблицаКОтгрузкеПоНакладным(Запрос, ТекстыЗапроса, Регистры, Документ)
	
	ИмяРегистра = "ТоварыКОтгрузкеПоНакладным";
	
	Если НЕ (ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) И 
		АльтерраОбщегоНазначения.ОтгрузкаПоНакладным(Документ.Дата,Документ.Склад)) Тогда
		Возврат "";
	КонецЕсли;
			
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыДокумента.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.ЗаказНаСборку В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка))
	|			ТОГДА ДанныеШапки.ЗаказНаСборку
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Заказ,
	|	ТоварыДокумента.Ссылка КАК Накладная,
	|	ДанныеШапки.Склад КАК Получатель,
	|	ДанныеШапки.Склад КАК Склад,
	|	ТоварыДокумента.Номенклатура КАК Номенклатура,
	|	ТоварыДокумента.Характеристика КАК Характеристика,
	|	ТоварыДокумента.Назначение КАК Назначение,
	|	ТоварыДокумента.Серия КАК Серия,
	|	ТоварыДокумента.Количество КАК Количество
	|ПОМЕСТИТЬ ВтТаблицаТоваров
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК ДанныеШапки
	|		ПО ТоварыДокумента.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТоварыДокумента.Ссылка В(&Ссылка)
	|	И ТоварыДокумента.Количество <> 0
	|	И ДанныеШапки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|	И ТоварыДокумента.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Дата,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыДокумента.ЗаказНаСборку В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка))
	|			ТОГДА ТоварыДокумента.ЗаказНаСборку
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Склад,
	|	ТоварыДокумента.Склад,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Назначение,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Количество
	|ИЗ
	|	Документ.СборкаТоваров КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка В(&Ссылка)
	|	И ТоварыДокумента.Количество <> 0
	|	И ТоварыДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И ТоварыДокумента.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.Период КАК Период,
	|	ТаблицаТовары.Склад КАК Склад,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК РабочийУчасток,
	|	ТаблицаТовары.Получатель КАК Получатель,
	|	ТаблицаТовары.Накладная КАК Накладная,
	|	ТаблицаТовары.Заказ КАК Заказ,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК КОтгрузке
	|ИЗ
	|	ВтТаблицаТоваров КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ТаблицаТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И ТаблицаТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

	
КонецФункции

&ИзменениеИКонтроль("ДанныеДокументаДляПроведения")
Функция Док_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт

		Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.СборкаТоваров") Тогда
		ДокументОбъект = Документ;
		ДокументСсылка = Документ.Ссылка;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументСсылка = Документ;
	Иначе
		ДокументОбъект = Неопределено;
		ДокументСсылка = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаЗаказыНаСборку(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДатыПоступленияТоваровОрганизаций(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыОрганизацийКПередаче(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыКОформлениюОтчетовКомитенту(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПартииТоваровОрганизаций(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияНоменклатураНоменклатура(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
		
		#Вставка 
		ТекстЗапросаТаблицаКОтгрузкеПоНакладным(Запрос, ТекстыЗапроса, Регистры, Документ);
		#КонецВставки

		СборкаТоваровЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ЗапланироватьПоступлениеТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ОформитьПриобретениеТоваровПоДвухходовке(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ОформитьПоступлениеТоваровПоДвухходовке(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ЗапланироватьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ОформитьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	
	ПроведениеДокументов.ДобавитьЗапросыСторноДвижений(
		Запрос, ТекстыЗапроса, Регистры, Метаданные.Документы.СборкаТоваров);
	РасчетСебестоимостиПроведениеДокументов.ОтразитьВМеханизмеУчетаЗатратИСебестоимости(
		ДокументСсылка, Запрос, ТекстыЗапроса, Регистры);
		
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);

КонецФункции

#КонецЕсли