#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкаПередачиТоваров(Команда)
	
	ОткрытьФорму("Обработка.НастройкаПередачиТоваровМеждуОрганизациями.Форма", , ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПланСчетовБухгалтерскогоУчета(Команда)
	
	Возврат; // в УТ11 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтавкиНалогаНаПрибыль(Команда)
	
	Возврат; // в УТ11 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУчетныеПолитикиОрганизаций(Команда)
	
	ОткрытьФорму("Справочник.УчетныеПолитикиОрганизаций.ФормаСписка", , ЭтаФорма);

КонецПроцедуры

#Область ГруппыФинансовогоУчета

&НаКлиенте
Процедура ОткрытьГруппыФинансовогоУчетаНоменклатуры(Команда)

	ОткрытьФорму("Справочник.ГруппыФинансовогоУчетаНоменклатуры.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыФинансовогоУчетаРасчетов(Команда)
	
	ОткрытьФорму("Справочник.ГруппыФинансовогоУчетаРасчетов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ТорговыйСбор

&НаКлиенте
Процедура ОткрытьТорговыеТочки(Команда)
	Возврат; // в УТ11 не используется

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьГруппыАналитическогоУчетаНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.ГруппыАналитическогоУчетаНоменклатуры.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементами()
	
	ИспользоватьМеждународныйФинансовыйУчет = Ложь;
	
	//Функциональные опции
	УправлениеПредприятием				   = ПолучитьФункциональнуюОпцию("УправлениеПредприятием");
	ИспользоватьГруппыАналитическогоУчета  = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыАналитическогоУчетаНоменклатуры");
	
	//Право чтения
	ПравоДоступаГруппыАналитическогоУчета   = ПравоДоступа("Просмотр", Метаданные.Справочники.ГруппыАналитическогоУчетаНоменклатуры);
	
	Элементы.ОткрытьГруппыАналитическогоУчетаНоменклатуры.Видимость = ИспользоватьГруппыАналитическогоУчета
		И ПравоДоступаГруппыАналитическогоУчета;
	
КонецПроцедуры

#КонецОбласти

