#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&НаСервере
Процедура ОбновитьСостояниеДокумента(Ссылка) Экспорт  
	
	Если НЕ (Ссылка = Неопределено) Тогда 
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда 
			Если ЗначениеЗаполнено(Ссылка.РабочийУчасток) И Ссылка.РабочийУчасток.ЭлектроннаяОчередь Тогда 
				Структура = Новый Структура; 
				Структура.Вставить("Документ", Ссылка.Накладная); 
				Структура.Вставить("Склад", Ссылка.Склад); 
				Структура.Вставить("Секция", Ссылка.РабочийУчасток);
				Если НЕ ПродажаНаДоставку(Ссылка.Накладная) Тогда  
					ОбновитьЗаписьВРегистре(Структура);	
				КонецЕсли;
			КонецЕсли;    
		Иначе  
			Если НЕ ПродажаНаДоставку(Ссылка) Тогда 
				ОбходСекцийПоДокументу(Ссылка); 
			КонецЕсли;
		КонецЕсли; 	
	КонецЕсли; 	
	
КонецПроцедуры  

&НаСервере
Процедура ОбходСекцийПоДокументу(Ссылка)
	
	ПроверитьИзменениеСклада(Ссылка); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКОтгрузке.Склад КАК Склад,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (ТоварыКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура)
	|			И (ТоварыКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ТоварыКОтгрузке.Регистратор = &Документ
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток.ЭлектроннаяОчередь = Истина"; 
	
	Запрос.УстановитьПараметр("Документ", Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		Структура = Новый Структура; 
		Структура.Вставить("Документ", Ссылка); 
		Структура.Вставить("Склад", Выборка.Склад); 
		Структура.Вставить("Секция", Выборка.Секция); 
		
		ОбновитьЗаписьВРегистре(Структура);
	КонецЦикла;

КонецПроцедуры 

//Если продажа на доставку или передан не Чек/реализация - возврат истина
&НаСервере
Функция ПродажаНаДоставку(Ссылка) 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	  |	Товары.Ссылка КАК Ссылка,
	  |	Товары.Номенклатура КАК Номенклатура
	  |ИЗ
	  |	Документ.ТАБЛИЦА КАК Товары
	  |ГДЕ
	  |	Товары.Ссылка = &Ссылка
	  |	И (Товары.Номенклатура.Наименование ПОДОБНО ""%достав%""
	  |	ИЛИ Товары.Номенклатура.Наименование ПОДОБНО ""%достав%"")"; 
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Запрос.Текст = СтрЗАменить(Запрос.Текст, "ТАБЛИЦА", "РеализацияТоваровУслуг.Товары"); 
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		Запрос.Текст = СтрЗАменить(Запрос.Текст, "ТАБЛИЦА", "ЧекККМ.Товары");
	Иначе
		Возврат Истина; 
	КонецЕсли;    
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		УдалитьЗаписьВРегистре(Ссылка); 
		Возврат Истина;
	Иначе
		Возврат Ложь; 
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ОбновитьЗаписьВРегистре(Структура) 
	УстановитьПривилегированныйРежим(Истина); 
	Запрос = Новый Запрос;
 	Запрос.Текст =   
	"ВЫБРАТЬ
	|	СостояниеОтгрузки.Документ КАК Документ,
	|	СостояниеОтгрузки.Документ.Номер КАК НомерДокумента,
	|	ВЫРАЗИТЬ(СостояниеОтгрузки.Заказ КАК Документ.ЗаказКлиента).ССайта КАК ССайта,
	|	СостояниеОтгрузки.ОтметкаКассы КАК ОтметкаКассы,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СостояниеОтгрузкиДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Заехал)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Заехал,
	|	СостояниеОтгрузки.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|	ВЫБОР
	|		КОГДА СостояниеОтгрузки.Набран = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СостояниеОтгрузки.Набирается = ИСТИНА
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СостояниеОтгрузки.Отгружен = ИСТИНА 
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Выдан)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Состояние,
	|	РасходныйОрдерНаТовары.Статус КАК СтатусОрдера,
	|	СостояниеОтгрузки.Склад КАК Склад,
	|	СостояниеОтгрузки.РабочийУчасток КАК Секция,
	|	ВЫБОР
	|		КОГДА НЕ РасходныйОрдерНаТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА РасходныйОрдерНаТовары.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|						ТОГДА СостояниеОтгрузки.РабочийУчасток
	|					ИНАЧЕ РасходныйОрдерНаТовары.Сотрудник
	|				КОНЕЦ
	|		ИНАЧЕ СостояниеОтгрузки.РабочийУчасток
	|	КОНЕЦ КАК ПолучательУведомления,
	|	ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику КАК ТребуетсяОповещениеКладовщику
	|ИЗ
	|	РегистрСведений.СостоянияОтгрузкиНакладных КАК СостояниеОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОтгрузкиДокумента КАК СостояниеОтгрузкиДокумента
	|		ПО СостояниеОтгрузки.Документ = СостояниеОтгрузкиДокумента.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|		ПО СостояниеОтгрузки.Документ = РасходныйОрдерНаТовары.Накладная
	|			И СостояниеОтгрузки.РабочийУчасток = РасходныйОрдерНаТовары.РабочийУчасток
	|			И (РасходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	|		ПО СостояниеОтгрузки.Документ.Ссылка = ЭлектроннаяОчередьКлиентов.Документ.Ссылка
	|ГДЕ
	|	СостояниеОтгрузки.Документ = &Документ 
	|	И СостояниеОтгрузки.Склад = &Склад
	|   И СостояниеОтгрузки.РабочийУчасток = &Секция
	|
	|СГРУППИРОВАТЬ ПО
	|	СостояниеОтгрузки.Документ.Номер,
	|	ВЫРАЗИТЬ(СостояниеОтгрузки.Заказ КАК Документ.ЗаказКлиента).ССайта,
	|	СостояниеОтгрузки.ОтметкаКассы,
	|	ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику,
	|	СостояниеОтгрузки.ЧастичноОтгружен,
	|	СостояниеОтгрузки.Документ,
	|	СостояниеОтгрузки.Склад,
	|	СостояниеОтгрузки.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА СостояниеОтгрузки.Набран = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СостояниеОтгрузки.Набирается = ИСТИНА
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СостояниеОтгрузки.Отгружен = ИСТИНА 
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Выдан)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РасходныйОрдерНаТовары.Статус,
	|	ВЫБОР
	|		КОГДА НЕ РасходныйОрдерНаТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА РасходныйОрдерНаТовары.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|						ТОГДА СостояниеОтгрузки.РабочийУчасток
	|					ИНАЧЕ РасходныйОрдерНаТовары.Сотрудник
	|				КОНЕЦ
	|		ИНАЧЕ СостояниеОтгрузки.РабочийУчасток
	|	КОНЕЦ";
		
	Запрос.УстановитьПараметр("Склад", Структура.Склад);
	Запрос.УстановитьПараметр("Секция", Структура.Секция);
	Запрос.УстановитьПараметр("Документ", Структура.Документ);
	
	Результат = Запрос.Выполнить(); 
	
	Выборка = Результат.Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Состояние = Перечисления.СтатусыЭлектроннойОчереди.Выдан Тогда  //Если выдан - удаляем такую запись
			УстановитьПривилегированныйРежим(Истина);
			ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
			НаборЗапись = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
					 
			НаборЗапись.Отбор.Документ.Установить(Выборка.Документ); 
			НаборЗапись.Отбор.Склад.Установить(Выборка.Склад);
			НаборЗапись.Отбор.Секция.Установить(Выборка.Секция);
			НаборЗапись.Записать();
		   
			УстановитьПривилегированныйРежим(Ложь); 
		Иначе                                                                      //Иначе обновляем ее состояние
				
			ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
			НаборЗаписьЭО = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
			 
			НаборЗаписьЭО.Отбор.Документ.Установить(Выборка.Документ);
			НаборЗаписьЭО.Отбор.Склад.Установить(Выборка.Склад); 
			НаборЗаписьЭО.Отбор.Секция.Установить(Выборка.Секция);
			НаборЗаписьЭО.Прочитать();
			Если НаборЗаписьЭО.Количество() = 0 Тогда
			    ЗаписьЭО = НаборЗаписьЭО.Добавить();
			    ЗаписьЭО.Документ = Выборка.Документ;
			    ЗаписьЭО.Склад = Выборка.Склад; 
				ЗаписьЭО.Секция = Выборка.Секция;
			Иначе
				ЗаписьЭО = НаборЗаписьЭО[0];
			КонецЕсли;
			ЗаписьЭО.СтатусОрдера = Выборка.СтатусОрдера;  
			ЗаписьЭО.НомерДокумента = Выборка.НомерДокумента; 
			ЗаписьЭО.Состояние = Выборка.Состояние;
			ЗаписьЭО.ЧастичноОтгружен = Выборка.ЧастичноОтгружен;
			ЗаписьЭО.Заехал = Выборка.Заехал;
			ЗаписьЭО.ССайта = Выборка.ССайта;
			ЗаписьЭО.ОтметкаКассы = Выборка.ОтметкаКассы;
			ЗаписьЭО.ТребуетсяОповещениеКладовщику = Выборка.ТребуетсяОповещениеКладовщику;
			ЗаписьЭО.ПолучательУведомления = Выборка.ПолучательУведомления;
			
			НаборЗаписьЭО.Записать();  
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь); 


КонецПроцедуры



&НаСервере
Процедура ПроверитьИзменениеСклада(Документ) 
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
					|	ЭлектроннаяОчередьКлиентов.Склад Как Склад
	                |ИЗ
	                |	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	                |ГДЕ
	                |	ЭлектроннаяОчередьКлиентов.Документ = &Документ
	                |	И ЭлектроннаяОчередьКлиентов.Документ.Склад <> ЭлектроннаяОчередьКлиентов.Склад"; 
	
    Запрос.УстановитьПараметр("Документ", Документ); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		УстановитьПривилегированныйРежим(Истина);
		ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
		НаборЗапись = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
				 
		НаборЗапись.Отбор.Документ.Установить(Документ); 
		НаборЗапись.Отбор.Склад.Установить(Выборка.Склад);
		НаборЗапись.Записать();
	   
		УстановитьПривилегированныйРежим(Ложь); 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьВРегистре(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
	НаборЗапись = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
			 
	НаборЗапись.Отбор.Документ.Установить(Документ);
	НаборЗапись.Записать();
   
	УстановитьПривилегированныйРежим(Ложь);  
КонецПроцедуры

Процедура ПоставитьОтметкуКПП(Ссылка) Экспорт  
	ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
	НаборЗаписьЭО = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
	НаборЗаписьЭО.Отбор.Документ.Установить(Ссылка);     
	НаборЗаписьЭО.Прочитать();
	Если НаборЗаписьЭО.Количество() > 0 Тогда    
        ЗаписьЭО = НаборЗаписьЭО[0];
		ЗаписьЭО.Заехал = Истина;    
		НаборЗаписьЭО.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
