#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьСтатьюДДС(Объект) Экспорт
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
		
		ЗаполнитьТЧРасшифровка(Объект, Статья_ВыдачаВПодотчет());
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу Тогда
		
		Если Объект.СтатьяДвиженияДенежныхСредств <> Статья_ДепонированнаяЗаработнаяПлата() Тогда
			Объект.СтатьяДвиженияДенежныхСредств = Статья_ВыплатаЗаработнойПлатыИзКассы();
		КонецЕсли;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств Тогда
		
		Если НЕ СтатьяРасходов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами(Объект) Тогда
			ЗаполнитьТЧРасшифровка(Объект, Статья_РасчетыСПерсоналомПрочий73());
		КонецЕсли;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
		
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.АрендаНоменклатурыВозврат") Тогда
			Объект.СтатьяДвиженияДенежныхСредств = Статья_ВозвратОбеспечительногоПлатежаЗаАрендуНоменклатуры();
			ЗаполнитьТЧРасшифровка(Объект, Объект.СтатьяДвиженияДенежныхСредств);
		Иначе
			ЗаполнитьТЧРасшифровка(Объект, Статья_ВозвратФизическомуЛицу());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтатьяРасходов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами(Объект) Экспорт
	
	Если ЗначениеЗаполнено(Объект.РасшифровкаПлатежа) И
		Объект.РасшифровкаПлатежа[0].СтатьяРасходов = ПВХСтатьиАктивовПассивов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами() Тогда
		
		ЗаполнитьТЧРасшифровка(Объект, Статья_РасчетыСПерсоналомПрочий76());
		Возврат Истина;
	КонецЕсли;  
	
	Возврат Ложь;
	
КонецФункции

Функция Статья_ВыдачаВПодотчет()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000013"); // ВЫДАЧА В ПОДОТЧЕТ
КонецФункции

Функция Статья_ДепонированнаяЗаработнаяПлата()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("01-000007"); // Депонированная заработная плата (76.04)
КонецФункции

Функция Статья_ВыплатаЗаработнойПлатыИзКассы()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000087"); // ЗАРАБОТНАЯ ПЛАТА / Выплата заработной платы из кассы
КонецФункции                               

Функция Статья_РасчетыСПерсоналомПрочий76()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000188"); // Расчеты с персоналом прочий (76.10)
КонецФункции                         

Функция Статья_РасчетыСПерсоналомПрочий73() Экспорт
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000091"); // Расчеты с персоналом прочий (73)
КонецФункции 

Функция Статья_ВозвратОбеспечительногоПлатежаЗаАрендуНоменклатуры()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000193"); // Возврат обеспечительного платежа за аренду номенклатуры
КонецФункции        

Функция Статья_ВозвратФизическомуЛицу()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000015"); // ВОЗВРАТ ФИЗИЧЕСКОМУ ЛИЦУ
КонецФункции    

Функция ПВХСтатьиАктивовПассивов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами()
	Возврат ПланыВидовХарактеристик.СтатьиАктивовПассивов.НайтиПоКоду("0А-00000005"); // Прочие расчеты с разными дебиторами и кредиторами (76.10)
КонецФункции      

Процедура ЗаполнитьТЧРасшифровка(Объект, Статья) Экспорт
	Для Каждого стрРасшировка Из Объект.РасшифровкаПлатежа Цикл
		стрРасшировка.СтатьяДвиженияДенежныхСредств = Статья;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли
