////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "ТМЦ в эксплуатации".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Параметры подбора ТМЦ в эксплуатации.
// 
// Параметры:
//  Дата - Дата - На какую дату подбираются ТМЦ.
//  Организация - СправочникСсылка.Организации - Отбор ТМЦ по организации.
//  Подразделение - СправочникСсылка.СтруктураПредприятия - Отбор ТМЦ по подразделению.
// 
// Возвращаемое значение:
//  Структура - содержит:
//		* Дата - Дата, Неопределено - На какую дату подбираются ТМЦ.
//		* Организация - СправочникСсылка.Организации, Неопределено - Отбор ТМЦ по организации.
//		* Подразделение - СправочникСсылка.СтруктураПредприятия, Неопределено - Отбор ТМЦ по подразделению.
//		* Номенклатура - СправочникСсылка.Номенклатура, Неопределено - Отбор ТМЦ по номенклатуре.
//		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры, Неопределено - Отбор ТМЦ по характеристике.
//		* Серия - СправочникСсылка.СерииНоменклатуры, Неопределено - Отбор ТМЦ по серии.
//		* СтатусУказанияСерий - Число, Неопределено - Для отбора ТМЦ по серии.
//		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица, Неопределено - Отбор ТМЦ по физ. лицу.
//		* СпособПогашенияСтоимостиБУ - ПеречислениеСсылка.СпособыПогашенияСтоимостиТМЦ, Неопределено - Отбор способу погашения стоимости.
//		* ИнвентарныйНомер - Строка, Неопределено - Отбор ТМЦ по инвентарному номеру.
//		* ИнвентарныйНомерСодержит - Строка, Неопределено - Отбор ТМЦ по совпадению текста в инвентарном номере.
//		* ВыбратьПервые - Число - Выбрать первые записи.
//		* ИнвентарныйУчет - Число, Неопределено - Отбор ТМЦ по признаку инвентарного учета (0 - Любой, 1 - Не ведется, 2 - Ведется).
//		* НазначенныйРесурс - Строка - (Выработан, НеВыработан).
//		* ТекущийРегистратор - ДокументСсылка, Неопределено - Заполняется, если нужно учесть изменение остатков документом.
//		* ДатаНачалаЭксплуатацииС - Дата - Отбор по дате начала эксплуатации.
//		* ДатаНачалаЭксплуатацииПо - Дата - Отбор по дате начала эксплуатации.
//		* ДляДинамическогоСписка - Булево - Истина, если подбор выполняется в дин. списке.
//	
Функция ПараметрыПодбораТМЦВЭксплуатации(Дата = Неопределено, Организация = Неопределено, Подразделение = Неопределено) Экспорт
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата", Дата);
	ПараметрыПодбора.Вставить("Организация", Организация);
	ПараметрыПодбора.Вставить("Подразделение", Подразделение);
	ПараметрыПодбора.Вставить("Номенклатура", Неопределено);
	ПараметрыПодбора.Вставить("Характеристика", Неопределено);
	ПараметрыПодбора.Вставить("Серия", Неопределено);
	ПараметрыПодбора.Вставить("СтатусУказанияСерий", Неопределено);
	ПараметрыПодбора.Вставить("СтатусУказанияСерийОтправитель", Неопределено);
	ПараметрыПодбора.Вставить("ФизическоеЛицо", Неопределено);
	ПараметрыПодбора.Вставить("СпособПогашенияСтоимостиБУ", Неопределено);
	ПараметрыПодбора.Вставить("ТекущийРегистратор", Неопределено);
	ПараметрыПодбора.Вставить("ИнвентарныйНомер", Неопределено);
	ПараметрыПодбора.Вставить("ИнвентарныйНомерСодержит", Неопределено);
	ПараметрыПодбора.Вставить("ВыбратьПервые", 0);	
	ПараметрыПодбора.Вставить("НазначенныйРесурс", Неопределено);	
	ПараметрыПодбора.Вставить("ИнвентарныйУчет", 0);
	ПараметрыПодбора.Вставить("ДатаНачалаЭксплуатацииС", '000101010000');	
	ПараметрыПодбора.Вставить("ДатаНачалаЭксплуатацииПо", '000101010000');	
	ПараметрыПодбора.Вставить("ДляДинамическогоСписка", Ложь);	
	
	Возврат ПараметрыПодбора;
	
КонецФункции

// Параметры заполнения признаков категории эксплуатации.
// 
// Возвращаемое значение:
//  Структура - Параметры заполнения признаков категории эксплуатации:
//		* ЗаполнитьСтатьюРасходов - Булево -
//		* ЗаполнитьСтатьюРасходовДляГрупповогоОС - Булево -
//		* ЗаполнитьСрокЭксплуатации - Булево -
Функция ПараметрыЗаполненияПризнаковКатегорииЭксплуатации() Экспорт

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗаполнитьСтатьюРасходов", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьСтатьюРасходовДляГрупповогоОС", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьСрокЭксплуатации", Ложь);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Для действий ТМЦ в эксплуатации формирует данные описания читаемых и изменяемых полей.
// 
// Параметры:
//  ТекущаяСтрока - см. ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ.ТекущаяСтрока
//  СтруктураДействий - см. ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ.СтруктураДействий
//  КэшированныеЗначения - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения.
//  ДополнительныеПараметрыЗаполнения - Структура - Дополнительные параметры заполнения
//  
// Возвращаемое значение:
// Массив из Структура - Описание читаемых и изменяемых полей:
//  * Имя - Строка - Имя действия в структуре.
//  * ЧитаемыеПоля - Структура - читаемые поля:
//  	** Ключ - Строка - Имя читаемого поля.
//  * ИзменяемыеПоля - Структура - изменяемые поля:
//  	** Ключ - Строка - Имя изменяемого поля.
//
Функция ПоляСтрокиПоДействиям(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, ДополнительныеПараметрыЗаполнения) Экспорт
	
	Действия = Новый Массив();
	
	Если СтруктураДействий.Свойство("ЗаполнитьПризнакиКатегорииЭксплуатации") Тогда
		
		ЧитаемыеПоля = Новый Структура();
		ЧитаемыеПоля.Вставить("КатегорияЭксплуатации");
		
		ИзменяемыеПоля = Новый Структура();
		ИзменяемыеПоля.Вставить("ИнвентарныйУчет");
		ИзменяемыеПоля.Вставить("УчетПоФизЛицам");
		ИзменяемыеПоля.Вставить("УчитыватьВВидеГрупповогоОС");
		ИзменяемыеПоля.Вставить("СпособПогашенияСтоимостиБУ");
		ИзменяемыеПоля.Вставить("СтатьяКапитализацииСтоимостиОС");
		ИзменяемыеПоля.Вставить("СтатьяРасходов");
		ИзменяемыеПоля.Вставить("СрокЭксплуатации");
		
		Действия.Добавить(Новый Структура("Имя,ЧитаемыеПоля,ИзменяемыеПоля",
			"ЗаполнитьПризнакиКатегорииЭксплуатации", ЧитаемыеПоля, ИзменяемыеПоля));
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьПартиюТМЦВЭксплуатации") Тогда
		
		ЧитаемыеПоля = Новый Структура();
		ЧитаемыеПоля.Вставить("Номенклатура");
		ЧитаемыеПоля.Вставить("Характеристика");
		ЧитаемыеПоля.Вставить("ФизическоеЛицо");
		ЧитаемыеПоля.Вставить("КоличествоУпаковок");
		ЧитаемыеПоля.Вставить("Количество");
		ЧитаемыеПоля.Вставить("Упаковка");
		ЧитаемыеПоля.Вставить("КатегорияЭксплуатации");
		ЧитаемыеПоля.Вставить("ИнвентарныйНомер");
		ЧитаемыеПоля.Вставить("Серия");
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ТекущаяСтрока, "СтатусУказанияСерийОтправитель") Тогда
				ЧитаемыеПоля.Вставить("СтатусУказанияСерийОтправитель");
		Иначе
			ЧитаемыеПоля.Вставить("СтатусУказанияСерий");
		КонецЕсли;
		
		ИзменяемыеПоля = Новый Структура();
		ИзменяемыеПоля.Вставить("Партия");
		ИзменяемыеПоля.Вставить("ИнвентарныйУчет");
		ИзменяемыеПоля.Вставить("УчетПоФизЛицам");
		
		Действия.Добавить(Новый Структура("Имя,ЧитаемыеПоля,ИзменяемыеПоля",
			"ЗаполнитьПартиюТМЦВЭксплуатации", ЧитаемыеПоля, ИзменяемыеПоля));
		
	КонецЕсли;
	
	Возврат Действия;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВводОстатковТМЦВЭксплуатации

Функция ЗначенияСвойствЗависимыхРеквизитов_ВводОстатковТМЦВЭксплуатации(Объект, ДопПараметры, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = Ложь;
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.ПервоначальнаяСумма", 
			"ТМЦВЭксплуатацииПервоначальнаяСумма", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ ДопПараметры.СтоимостьСписана;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СтатьяРасходов", 
			"ТМЦВЭксплуатацииСтатьяРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.АналитикаРасходов", 
			"ТМЦВЭксплуатацииАналитикаРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.Сумма", 
			"ТМЦВЭксплуатацииСумма", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СуммаВР", 
			"ТМЦВЭксплуатацииСуммаВР", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СуммаПР", 
			"ТМЦВЭксплуатацииСуммаПР", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

#КонецОбласти


#Область КатегорииЭксплуатации

// 
// Параметры:
//  Объект - СправочникОбъект.КатегорииЭксплуатации, ДанныеФормыСтруктура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_КатегорииЭксплуатации(Объект, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;


	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

#КонецОбласти

#Область ОпределениеСвойствЗависимыхРеквизитовОбъекта

// 
// Параметры:
//  Объект - ДокументОбъект.СписаниеИзЭксплуатации - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_СписаниеИзЭксплуатации(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ВспомогательныеРеквизиты.ИспользоватьУчетПрослеживаемыхТоваров;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Товары.НомерГТД", 
			"ТоварыНомерГТД", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Товары.КоличествоПоРНПТ", 
			"ТоварыКоличествоПоРНПТ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
		
КонецФункции

#КонецОбласти

#Область Прочее

// Формирует новое значение выбора партии ТМЦ.
// 
// Возвращаемое значение:
//  Структура - содержит:
// 		* Номенклатура - СправочникСсылка.Номенклатура -
// 		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры -
// 		* Серия - СправочникСсылка.СерииНоменклатуры -
// 		* Партия - СправочникСсылка.ПартииТМЦВЭксплуатации -
// 		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица -
// 		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности
// 		* ИнвентарныйНомер - Строка -
// 		* Подразделение - СправочникСсылка.СтруктураПредприятия -
// 		* НомерГТД - СправочникСсылка.НомераГТД -
// 		* ИнвентарныйУчет - Булево -
// 		* УчетПоФизЛицам - Булево -
// 		* ОбъемНаработки - Число - 
// 		* ДатаЗавершенияЭксплуатации - Дата -
// 		* Количество - Число -
// 		* КоличествоУпаковок - Число -
// 		* КоличествоПоРНПТ - Число -
Функция НовоеЗначениеВыбора() Экспорт
	
	ЗначениеВыбора = Новый Структура;
	
	ЗначениеВыбора.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("Серия", ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("Партия", ПредопределенноеЗначение("Справочник.ПартииТМЦВЭксплуатации.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("ФизическоеЛицо", ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("НаправлениеДеятельности", ПредопределенноеЗначение("Справочник.НаправленияДеятельности.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("ИнвентарныйНомер", "");
	ЗначениеВыбора.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("НомерГТД", ПредопределенноеЗначение("Справочник.НомераГТД.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("ИнвентарныйУчет", Ложь);
	ЗначениеВыбора.Вставить("УчетПоФизЛицам", Ложь);
	ЗначениеВыбора.Вставить("ОбъемНаработки", 0);
	ЗначениеВыбора.Вставить("ДатаЗавершенияЭксплуатации", '000101010000');
	ЗначениеВыбора.Вставить("Количество", 0);
	ЗначениеВыбора.Вставить("КоличествоУпаковок", 0);
	ЗначениеВыбора.Вставить("КоличествоПоРНПТ", 0);
	
	Возврат ЗначениеВыбора;
	
КонецФункции


// Формирует описание запроса для выбора партии ТМЦ.
// 
// Параметры:
//  Параметры - см. ТМЦВЭксплуатацииКлиентСервер.ПараметрыПодбораТМЦВЭксплуатации.
// 
// Возвращаемое значение:
//  Структура - Описание запроса для выбора партии ТМЦ:
// 		* ТекстЗапроса - Строка - Текст запроса.
// 		* ПараметрыЗапроса - Структура - Параметры запроса.
Функция ОписаниеЗапросаДляВыбораПартииТМЦ_УТ(Параметры) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТМЦ.Ссылка КАК Ссылка
	|
	|ПОМЕСТИТЬ ПартииТМЦ
	|
	|ИЗ
	|	Справочник.ПартииТМЦВЭксплуатации КАК ПартииТМЦ
	|
	|ГДЕ
	|	ПартииТМЦ.ДатаЗавершенияЭксплуатации >= &ОтборДата
	|	И НЕ ПартииТМЦ.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
	|	ТМЦВЭксплуатации.Организация КАК Организация,
	|	ТМЦВЭксплуатации.Подразделение КАК Подразделение,
	|	ТМЦВЭксплуатации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТМЦВЭксплуатации.Номенклатура КАК Номенклатура,
	|	ТМЦВЭксплуатации.Характеристика КАК Характеристика,
	|	ЛОЖЬ КАК ИнвентарныйУчет,
	|	ИСТИНА КАК УчетПоФизЛицам,
	|	ТМЦВЭксплуатации.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТМЦВЭксплуатации.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|
	|	СУММА(ТМЦВЭксплуатации.Количество) КАК Количество
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТовары.Ссылка.Организация КАК Организация,
	|		ТаблицаТовары.Ссылка.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаТовары.Партия.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|		ТаблицаТовары.Количество КАК Количество
	|		
	|	ИЗ
	|		Документ.ВнутреннееПотребление.Товары КАК ТаблицаТовары
	|
	|	ГДЕ
	|		ТаблицаТовары.Партия В
	|			(ВЫБРАТЬ
	|				ПартииТМЦ.Ссылка
	|			ИЗ
	|				ПартииТМЦ КАК ПартииТМЦ)
	|		И ТаблицаТовары.Ссылка.Проведен
	|
	|		И (ТаблицаТовары.Ссылка.Организация = &ОтборОрганизация
	|			ИЛИ &ОтборОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|		И (ТаблицаТовары.Ссылка.Подразделение = &ОтборПодразделение
	|			ИЛИ &ОтборПодразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|		И (&ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо
	|			ИЛИ &ОтборФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|		И (НЕ &ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.Номенклатура = &ОтборНоменклатура
	|				И ТаблицаТовары.Характеристика = &ОтборХарактеристика
	|				И ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаТовары.Ссылка.Организация КАК Организация,
	|		ТаблицаТовары.Ссылка.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаТовары.Партия.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|		ТаблицаТовары.Количество КАК Количество
	|	ИЗ
	|		Документ.ВводОстатковТМЦВЭксплуатации.ТМЦВЭксплуатации КАК ТаблицаТовары
	|
	|	ГДЕ
	|		ТаблицаТовары.Партия В
	|			(ВЫБРАТЬ
	|				ПартииТМЦ.Ссылка
	|			ИЗ
	|				ПартииТМЦ КАК ПартииТМЦ)
	|		И ТаблицаТовары.Ссылка.Проведен
	|
	|		И (ТаблицаТовары.Ссылка.Организация = &ОтборОрганизация
	|			ИЛИ &ОтборОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|		И (ТаблицаТовары.Ссылка.Подразделение = &ОтборПодразделение
	|			ИЛИ &ОтборПодразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|		И (&ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо
	|			ИЛИ &ОтборФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|		И (НЕ &ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.Номенклатура = &ОтборНоменклатура
	|				И ТаблицаТовары.Характеристика = &ОтборХарактеристика
	|				И ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаТовары.Ссылка.Организация КАК Организация,
	|		ТаблицаТовары.Ссылка.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаТовары.Партия.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|		ТаблицаТовары.Количество КАК Количество
	|	ИЗ
	|		Документ.ВводОстатков.ТМЦВЭксплуатации КАК ТаблицаТовары
	|
	|	ГДЕ
	|		ТаблицаТовары.Партия В
	|			(ВЫБРАТЬ
	|				ПартииТМЦ.Ссылка
	|			ИЗ
	|				ПартииТМЦ КАК ПартииТМЦ)
	|		И ТаблицаТовары.Ссылка.Проведен
	|
	|		И (ТаблицаТовары.Ссылка.Организация = &ОтборОрганизация
	|			ИЛИ &ОтборОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|		И (ТаблицаТовары.Ссылка.Подразделение = &ОтборПодразделение
	|			ИЛИ &ОтборПодразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|		И (&ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо
	|			ИЛИ &ОтборФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|		И (НЕ &ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.Номенклатура = &ОтборНоменклатура
	|				И ТаблицаТовары.Характеристика = &ОтборХарактеристика
	|				И ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаТовары.Ссылка.Организация КАК Организация,
	|		ТаблицаТовары.Ссылка.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаТовары.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|		-ТаблицаТовары.Количество КАК Количество
	|		
	|	ИЗ
	|		Документ.ПрочееОприходованиеТоваров.Товары КАК ТаблицаТовары
	|
	|	ГДЕ
	|		ТаблицаТовары.ДатаЗавершенияЭксплуатации >= &ОтборДата
	|		И ТаблицаТовары.Ссылка.Дата <= &ОтборДата
	|		И ТаблицаТовары.Ссылка.Проведен
	|		И ТаблицаТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзЭксплуатации)
	|
	|		И (ТаблицаТовары.Ссылка.Организация = &ОтборОрганизация
	|			ИЛИ &ОтборОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|		И (ТаблицаТовары.Ссылка.Подразделение = &ОтборПодразделение
	|			ИЛИ &ОтборПодразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|		И (&ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо
	|			ИЛИ &ОтборФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|		И (НЕ &ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.Номенклатура = &ОтборНоменклатура
	|				И ТаблицаТовары.Характеристика = &ОтборХарактеристика
	|				И ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо)
	|			
	|	) КАК ТМЦВЭксплуатации
	|
	|СГРУППИРОВАТЬ ПО
	|	ТМЦВЭксплуатации.Организация,
	|	ТМЦВЭксплуатации.Подразделение,
	|	ТМЦВЭксплуатации.ФизическоеЛицо,
	|	ТМЦВЭксплуатации.Номенклатура,
	|	ТМЦВЭксплуатации.Характеристика,
	|	ТМЦВЭксплуатации.НаправлениеДеятельности,
	|	ТМЦВЭксплуатации.ДатаЗавершенияЭксплуатации
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТМЦВЭксплуатации.Количество) > 0";
	
	Если НЕ Параметры.ДляДинамическогоСписка Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Подразделение,
		|	ФизическоеЛицо,
		|	Номенклатура,
		|	Характеристика,
		|	НаправлениеДеятельности";
		
	КонецЕсли;
	
	ОтборДата = ?(
		Параметры.Дата <> Неопределено И Параметры.Дата <> '000101010000', 
		КонецДня(Параметры.Дата) + 1, 
		'000101010000');
	
	ОтборОрганизация = ?(
		Параметры.Организация <> Неопределено, 
		Параметры.Организация, 
		ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));

	ОтборПодразделение = ?(
		Параметры.Подразделение <> Неопределено, 
		Параметры.Подразделение, 
		ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));

	ОтборНоменклатура = ?(
		Параметры.Номенклатура <> Неопределено, 
		Параметры.Номенклатура, 
		ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));

	ОтборХарактеристика = ?(
		Параметры.Характеристика <> Неопределено, 
		Параметры.Характеристика, 
		ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));

	ОтборФизическоеЛицо = ?(
		Параметры.ФизическоеЛицо <> Неопределено, 
		Параметры.ФизическоеЛицо, 
		ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"));
	
	
	ПодборПоДаннымСтроки = 
		Параметры.Номенклатура <> Неопределено
		ИЛИ Параметры.Характеристика <> Неопределено;
	
	Если Параметры.ДляДинамическогоСписка Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ ПЕРВЫЕ 10", "");
	КонецЕсли;
	
	Если Параметры.ВыбратьПервые > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 10", "ПЕРВЫЕ" + " " + Формат(Параметры.ВыбратьПервые, "ЧГ=0;"));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 10", "");
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ОтборДата", ОтборДата);
	ПараметрыЗапроса.Вставить("ОтборОрганизация", ОтборОрганизация);
	ПараметрыЗапроса.Вставить("ОтборПодразделение", ОтборПодразделение);
	ПараметрыЗапроса.Вставить("ОтборНоменклатура", ОтборНоменклатура);
	ПараметрыЗапроса.Вставить("ОтборХарактеристика", ОтборХарактеристика);
	ПараметрыЗапроса.Вставить("ОтборФизическоеЛицо", ОтборФизическоеЛицо);
	ПараметрыЗапроса.Вставить("ПодборПоДаннымСтроки", ПодборПоДаннымСтроки);
	
	ОписаниеЗапросаДляВыбора = Новый Структура("ТекстЗапроса,ПараметрыЗапроса", ТекстЗапроса, ПараметрыЗапроса);
	
	Возврат ОписаниеЗапросаДляВыбора;
	
КонецФункции

#КонецОбласти

#КонецОбласти
