&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ВариантОтправкиЭлектронногоЧекаПартнера = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail Тогда 
		ВариантЧека = "Почта"; 
	ИначеЕсли ВариантОтправкиЭлектронногоЧекаПартнера = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS Тогда 
		ВариантЧека = "Смс";
	ИначеЕсли ВариантОтправкиЭлектронногоЧекаПартнера = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.Бумажный Тогда
    	ВариантЧека =  "Бумажный";
	Иначе
		ВариантЧека = "Бумажный"; 
	КонецЕсли; 

КонецПроцедуры
&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ОбновитьВариантОтправки();
КонецПроцедуры

//Электронные чеки 

&НаКлиенте
Процедура Док_НапечататьЧекВместо(Команда)
	
	   ВариантЧека = "Бумажный"; 
	   ОбновитьВариантОтправки(); 
	   
КонецПроцедуры

&НаКлиенте
Процедура Док_ЭлектронныйЧекНеТребуетсяПосле(Команда)
 
	ВариантЧека = "Фиктивный"; 
	ОбновитьВариантОтправки();	

КонецПроцедуры   

&НаСервере 
Функция ПолучитьПочту(); 
   Возврат АльтерраОбщегоНазначения.ПолучитьПочтуДляОтправкиЧеков(Документ.организация);
КонецФУнкции 


&НаСервере
Функция ПолучитьВариантОтправки(Партнер) 
	Если Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail Тогда 
		Возврат "Почта"; 
	ИначеЕсли Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS Тогда 
		Возврат "Смс";
	ИначеЕсли Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.Бумажный Тогда
    	Возврат "Бумажный";
	Иначе
		Возврат "Бумажный"; 
	КонецЕсли; 
КонецФункции


&НаКлиенте
Процедура Док_КомандаПробитьЧекВместо(Команда)
	
	СФП_МаркерыКлиент.МаркерНачало("Чек: Пробить чек", "Форма наличной оплаты");

	СтрокаВопроса = ""; 
	
	Если ВариантЧека = "Почта" Тогда  
		Если Email <> "" Тогда 
			СтрокаВопроса = "Чек будет отправлен на почту: " + Email + ". Все верно?";
			РозничныеПродажиКлиентСервер.УстановитьАктивныйЭлемент(ЭтотОбъект, Элементы.Email);
			РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(
				ЭтотОбъект,
				ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail"));
			Пробитие = Истина; 
       Иначе
			Сообщить("Введине EMAIL");
			Пробитие = Ложь;
		КонецЕсли;

	ИначеЕсли ВариантЧека = "Смс" Тогда  
		Если (СтрДлина(Телефон) = 14) Тогда 
			СтрокаВопроса = "Чек будет отправлен на телефон: " + Прав(Телефон, 4) + ". Все верно?";
			РозничныеПродажиКлиентСервер.УстановитьАктивныйЭлемент(ЭтотОбъект, Элементы.Email);
			РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(
				ЭтотОбъект,
				ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS")); 
			Пробитие = Истина; 
		Иначе
			Сообщить("Введине Телефон!");
			Пробитие = Ложь;
		КонецЕсли;	
	ИначеЕсли ВариантЧека = "Бумажный" Тогда 	 
		РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(
			ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять"));
		СтрокаВопроса = "Чек будет напечатан. Все верно?";	
		Пробитие = Истина;
	ИначеЕсли ВариантЧека = "Фиктивный" Тогда 	 
		РозничныеПродажиКлиентСервер.УстановитьАктивныйЭлемент(ЭтотОбъект, Элементы.Email);
		РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(
			ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail"));
		Email = ПолучитьПочту(); 
		СтрокаВопроса = "Покупатель отказался от чека. Все верно?"; 
		Пробитие = Истина;
	КонецЕсли; 
	
	Если не пробитие  Тогда 
			Оповещение = Новый ОписаниеОповещения("ОтсутствуетКонтактнаяИнформация", ЭтотОбъект);    
	       	Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Ок", "Ок");
	      	Кнопки.Добавить("НеОтправлять", "Бумажный чек");
	 		ПоказатьВопрос(Оповещение,
		      		"Введите номер телефона или почту клиента!",

		      	Кнопки,
		      	0);  
	Иначе 
			Оповещение = Новый ОписаниеОповещения("ПредПробитие", ЭтотОбъект);    
	       	Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Ок", "Ок");
	      	Кнопки.Добавить("Отмена", "Отмена");
	 		ПоказатьВопрос(Оповещение,
		      	СтрокаВопроса,
		      	Кнопки,
		      	0);  
		
	КонецЕсли;  
КонецПроцедуры  



&НаКлиенте
Процедура ПредПробитие(Результат, Параметры) Экспорт
	Если Результат = "Ок" Тогда
    	СуммаОплатыЧисло = РозничныеПродажиКлиентСервер.ПривестиСтрокуКЧислу(ПолученоНаличными);
		
		ДанныеЭлектронногоЧека = РозничныеПродажиКлиентСервер.ДанныеЭлектронногоЧека(ЭтотОбъект);
		НеобходимостьОбработкиДанных = РозничныеПродажиКлиентСервер.ПроверитьНеобходимостьОбработкиДанныхЭлектронногоЧека(ЭтотОбъект);
		Если НеобходимостьОбработкиДанных.ТребуетсяОбновитьКонтактнуюИнформацию
			Или НеобходимостьОбработкиДанных.ТребуетсяСоздатьПартнера
			Или НеобходимостьОбработкиДанных.ТребуетсяОбновитьВариантОтправкиЭлектронногоЧекаПартнера Тогда
			ДанныеЭлектронногоЧека = ОбработатьДанныеЭлектронногоЧека();
		КонецЕсли;
		
		Если ДанныеЭлектронногоЧека = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		РезультатОплаты = РозничныеПродажиКлиентСервер.СтруктураРезультатаОплаты();
		РезультатОплаты.ПолученоНаличными      = СуммаОплатыЧисло;
		РезультатОплаты.ДанныеЭлектронногоЧека = ДанныеЭлектронногоЧека;
		
		Закрыть(РезультатОплаты);
	КонецЕсли;   
КонецПроцедуры


&НаКлиенте
Процедура ОтсутствуетКонтактнаяИнформация(Результат, Параметры) Экспорт
	Если Результат = "НеОтправлять" Тогда
			 ВариантЧека = "Бумажный"; 
	ОбновитьВариантОтправки();	

	КонецЕсли;   
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьВариантОтправки() 
    Если ВариантЧека = "Почта" Тогда  
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Истина;  
		ОтправкаНаСмс = Ложь; 
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Оранжевый;
		
	ИначеЕсли ВариантЧека = "Смс" Тогда 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Истина;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Телефон.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	ИначеЕсли ВариантЧека = "Бумажный" Тогда 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Ложь;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	ИначеЕсли ВариантЧека = "Фиктивный" Тогда 	 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Оранжевый; 
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Ложь;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура Док_ОтправкаНаСмсПриИзмененииВместо(Элемент)
	ОтправкаНаПочту = не ОтправкаНаСМС; 
	Если ОтправкаНаПочту Тогда 
		ВариантЧека = "Почта"; 
	ИначеЕсли ОтправкаНаСмс Тогда 
		ВариантЧека = "Смс"; 
	КонецЕсли;   
	ОбновитьВариантОтправки(); 
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтправкаНаПочтуПриИзмененииВместо(Элемент)
	ОтправкаНаСМС = не ОтправкаНаПочту; 
	Если ОтправкаНаПочту Тогда 
		ВариантЧека = "Почта"; 
	ИначеЕсли ОтправкаНаСмс Тогда 
		ВариантЧека = "Смс"; 
	КонецЕсли; 
   	ОбновитьВариантОтправки();
КонецПроцедуры
