&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для НомерСтроки = 0 По Объект.Компетенции.Количество() - 1 Цикл
		Элементы.Компетенции.ТекущаяСтрока = НомерСтроки;
		Компетенция = Элементы.Компетенции.ТекущиеДанные.Компетенция;
		Элементы.Компетенции.ТекущиеДанные.ГруппаКомпетенций = ПолучитьГруппуКомпетенции(Компетенция);
	КонецЦикла;
	Элементы.Компетенции.ТекущаяСтрока = 0;
КонецПроцедуры

&НаКлиенте
Процедура КомпетенцииПриИзменении(Элемент)
	Компетенция = Элемент.ТекущиеДанные.Компетенция;
	Элемент.ТекущиеДанные.ГруппаКомпетенций = ПолучитьГруппуКомпетенции(Компетенция);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГруппуКомпетенции(Компетенция)
    Возврат Компетенция.Родитель;
КонецФункции

&НаКлиенте
Процедура ОбновитьДокументы(Команда)
	ОбновитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументыНаСервере()
	РеквизитФормыВЗначение("Объект").ОбновитьДокументы();
КонецПроцедуры
