Процедура ОтправкаСМСОНачисленныхБонусах(ДокСсылка, ИДБизнесПроцесса) Экспорт  
	// Проверить причину «По жалобе» ,«Доначисление» и «Неверный ценник»
	Если ДокСсылка.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление И ПодходящаяПричинаНачисления(ДокСсылка) Тогда	 
		Партнер = ДокСсылка.Начисление[0].Партнер;
		НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Партнер, Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
		Если ЗначениеЗаполнено(НомерТелефона) Тогда
			АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона,,,,,"+7");
			НомераТелефонов = Новый Массив;
			НомераТелефонов.Добавить(НомерТелефона);
			Текст = "Бонусы по обращению ID"+ ИДБизнесПроцесса+ " начислены. Стройтесь с нами";
			Попытка 
				РезультатОтправки = ОтправкаSMS.ОтправитьSMS(НомераТелефонов, Текст);
			Исключение
				ОписаниеОшибки = "Не удалось отправить СМС партнеру "+ Партнер + ". "+ РезультатОтправки.ОписаниеОшибки;
				ЗаписьЖурналаРегистрации("Отправка СМС о начисленных бонусах", УровеньЖурналаРегистрации.Ошибка, , ДокСсылка, ОписаниеОшибки);	 		
			КонецПопытки;			
			Если Не ЗначениеЗаполнено(РезультатОтправки.ОписаниеОшибки) Тогда                     
				// Зарегистрировать в регистре СобытияОбъектовАльтерра    
				Запись = РегистрыСведений.СобытияОбъектовАльтерра.СоздатьМенеджерЗаписи();
				Запись.Период = ТекущаяДата();
				Запись.Объект = ДокСсылка; 
				Запись.Событие = Справочники.СобытияОбъектовАльтерра.ОтправленаСМСклиентуОГотовности; 
				Запись.Записать();
			Иначе
				ОписаниеОшибки = "Не удалось отправить СМС партнеру "+ Партнер + ". "+ РезультатОтправки.ОписаниеОшибки;
				ЗаписьЖурналаРегистрации("Отправка СМС о начисленных бонусах", УровеньЖурналаРегистрации.Ошибка, , ДокСсылка, ОписаниеОшибки);
			КонецЕсли
		Иначе	
			ОписаниеОшибки = "Не удалось отправить СМС партнеру "+ Партнер + ". Номер телефона партнера не указан в карточке";
			ЗаписьЖурналаРегистрации("Отправка СМС о начисленных бонусах", УровеньЖурналаРегистрации.Ошибка, , ДокСсылка, ОписаниеОшибки);
		КонецЕсли	
	КонецЕсли	
КонецПроцедуры	

Функция ПодходящаяПричинаНачисления(ДокСсылка);
    МассивПричин = Новый Массив;     
	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоКоду("000000007");// Доначисление (по бп)
	Если Причина <> Справочники.ПричиныНачисленияБонусныхБаллов.ПустаяСсылка() Тогда  
		МассивПричин.Добавить(Причина);
	КонецЕсли;
	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоКоду("000000006");// По жалобе (по бп)
	Если Причина <> Справочники.ПричиныНачисленияБонусныхБаллов.ПустаяСсылка() Тогда  
		МассивПричин.Добавить(Причина);
	КонецЕсли;
	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоКоду("000000012");// Неверный ценник (по бп)
	Если Причина <> Справочники.ПричиныНачисленияБонусныхБаллов.ПустаяСсылка() Тогда  
		МассивПричин.Добавить(Причина);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеИСписаниеБонусныхБаллов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.НачислениеИСписаниеБонусныхБаллов КАК НачислениеИСписаниеБонусныхБаллов
		|ГДЕ
		|	НачислениеИСписаниеБонусныхБаллов.Проведен
		|	И НачислениеИСписаниеБонусныхБаллов.Причина В(&МассивПричин)
		|	И НачислениеИСписаниеБонусныхБаллов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("МассивПричин", МассивПричин);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Истина
	КонецЕсли;
	Возврат Ложь
КонецФункции	
