#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область КонтрольИзмененийТЧПриНаличииРасходногоОрдера

Функция ПоРеализацииЕстьРасходныйОрдер(Ссылка)
	
	Запрос = Новый Запрос( 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Результат
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК Ордер
		|ГДЕ             
		|	НЕ Ордер.ПометкаУдаления 
		|	И Ордер.Накладная = &Накладная");
	
	Запрос.УстановитьПараметр("Накладная", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат РезультатЗапроса.Следующий();

КонецФункции

Процедура КонтрольИзмененийТЧПриНаличииРасходногоОрдера(Отказ, Объект, ПередЗаписью_ПриЗаписи) Экспорт
	
	Если НЕ Отказ Тогда
		Если ПередЗаписью_ПриЗаписи И // ПередЗаписью 
			ЗначениеЗаполнено(Объект.Ссылка) И
			НЕ Объект.ПометкаУдаления И
			ПоРеализацииЕстьРасходныйОрдер(Объект.Ссылка) Тогда  
			
			Объект.ДополнительныеСвойства.Вставить("КонтрольнаяСуммаТЧбезУслуг", КонтрольнаяСуммаТЧбезУслуг_Запрос(Объект.Ссылка));
			
		ИначеЕсли НЕ ПередЗаписью_ПриЗаписи И // ПриЗаписи 
			Объект.ДополнительныеСвойства.Свойство("КонтрольнаяСуммаТЧбезУслуг") И
			Объект.ДополнительныеСвойства.КонтрольнаяСуммаТЧбезУслуг <> КонтрольнаяСуммаТЧбезУслуг_Запрос(Объект.Ссылка) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По реализации есть расходный ордер. Список товаров был изменен. Обратитесь к складу!",,,,Отказ);
	    КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция КонтрольнаяСуммаТЧбезУслуг_Запрос(Ссылка)
	Запрос = Новый Запрос( 
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.КодСтроки КАК КодСтроки,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Назначение КАК Назначение,
		|	Товары.Упаковка КАК Упаковка,
		|	Товары.Подразделение КАК Подразделение,
		|	Товары.Склад КАК Склад,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Товары.Количество КАК Количество
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
		|ГДЕ
		|	Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И Товары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Товары.НомерСтроки");

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Запрос.Выполнить().Выгрузить());
КонецФункции  

#КонецОбласти

#Область СоздатьРеализациюПоРейсу
 
Функция СоздатьРеализациюПоРейсу(ЗаказНаДоставку, ЗаказКлиента, Рейс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Если ТипЗнч(ЗаказКлиента) <> Тип("ДокументСсылка.ЗаказКлиента") ИЛИ ЕстьРеализацияПоЗаказу(ЗаказКлиента) Тогда
		Возврат Ложь; // наличие ошибки
	Иначе
		ЗаказОбъект = ЗаказКлиента.ПолучитьОбъект();
		ТекДата = ТекущаяДата();
		ИзмененияВЗаказе = Ложь;
		Отказ = Ложь;
		
		Для Каждого стрТовар Из ЗаказОбъект.Товары Цикл
			Если стрТовар.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.Отгрузить И НЕ стрТовар.Отменено Тогда
				стрТовар.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
				стрТовар.ДатаОтгрузки = ТекДата;
				ИзмененияВЗаказе = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ИзмененияВЗаказе Тогда
			Попытка            
				ЗаказОбъект.ДополнительныеСвойства.Вставить("Регламент", Истина);
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отгружен: " + ЗаказОбъект.Ссылка, ЗаказОбъект.Ссылка);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ 'Заказ клиента'",,,,Отказ);
			КонецПопытки;
		КонецЕсли;
		
		Если Не Отказ Тогда
			
			РеализацияОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			Комментарий = "Создан автоматически из: " + Рейс;
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("ВариантОформленияПродажи", Перечисления.ВариантыОформленияПродажи);
			ДанныеЗаполнения.Вставить("ДокументОснование", ЗаказКлиента);
			ДанныеЗаполнения.Вставить("СкладОтгрузки", Неопределено);
			РеализацияОбъект.Заполнить(ДанныеЗаполнения);
			
			РеализацияОбъект.Склад = ЗаказКлиента.Склад;
			РеализацияОбъект.Комментарий = Комментарий;
			РеализацияОбъект.Дата = ТекДата;
			РеализацияОбъект.Менеджер = ЗаказКлиента.Менеджер;
			РеализацияОбъект.Магазин = ЗаказКлиента.Магазин;
			РеализацияОбъект.Кассир = Справочники.Пользователи.ПустаяСсылка();
			РеализацияОбъект.ДатаОтметкиКасса = Дата('00010101');
			
			Если РеализацияОбъект.Товары.Количество() > 0 Тогда 
				Попытка
					РеализацияОбъект.СкидкиРассчитаны = Истина;
					РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ: " + РеализацияОбъект.Ссылка, РеализацияОбъект.Ссылка);
				Исключение                          
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ 'Реализация товаров и услуг'",,,,Отказ);
				КонецПопытки;
				
				Если Не Отказ Тогда
					// Создаем 'Счет-фактура выданный'
				Если НЕ ЗаказКлиента.Контрагент.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.физЛицо") Тогда
					ДанныеСчетаФактуры = Новый Структура;
					ДанныеСчетаФактуры.Вставить("ДокументОснование", РеализацияОбъект.Ссылка);
					ДанныеСчетаФактуры.Вставить("Организация", РеализацияОбъект.Организация);
					ДанныеСчетаФактуры.Вставить("Дата", РеализацияОбъект.Дата);
					
					СчетФактураВыданный = Документы.СчетФактураВыданный.СоздатьДокумент();
					СчетФактураВыданный.Заполнить(ДанныеСчетаФактуры); 
					СчетФактураВыданный.Комментарий = Комментарий;
					Попытка
						СчетФактураВыданный.Записать(РежимЗаписиДокумента.Проведение);
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ: " + СчетФактураВыданный.Ссылка, СчетФактураВыданный.Ссылка);
					Исключение                     
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ 'Счет-фактура выданный'");
					КонецПопытки;
				КонецЕсли;
		
					// Создаем 'Заявка в ЕГАИС Лес'
					Если Документы.ЗаявкаВЕГАИСЛес.ПроверкаНаличияЗаявкиНаСоответствующийДокументПродажи(РеализацияОбъект.Ссылка) Тогда
						ДокЗаявка = Документы.ЗаявкаВЕГАИСЛес.СоздатьДокумент();
						ДокЗаявка.Дата = ТекДата;
						ДокЗаявка.Заполнить(РеализацияОбъект.Ссылка);
						
						Попытка
							ДокЗаявка.Записать(РежимЗаписиДокумента.Проведение);
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ: " + ДокЗаявка.Ссылка, ДокЗаявка.Ссылка);
						Исключение
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ 'Заявка в ЕГАИС Лес'");
						КонецПопытки;
					КонецЕсли;                           
					
					// Создаем 'Лист согласования'
					
					//лист задолженности
					// 1) отгрузка по ТЧ(контрагент физ лицо), с проставлением галочки инкассация в заказе на доставку 
					Если (ЗаказНаДоставку.НужнаИнкассация И ЗаказКлиента.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо) ИЛИ
					// 2) если клиент отгружается по с/ф, и стоит галочка инкассация в заказе на доставку
				    (ЗаказНаДоставку.НужнаИнкассация И ЗначениеЗаполнено(ЗаказКлиента.Договор)) ИЛИ
					// 3) если клиент отгружается по с/ф (контрагент НЕ физлицо), и у него есть договор отсрочки, но выходит за рамки лимита (отгрузка запрещена)
					(ЗначениеЗаполнено(ЗаказКлиента.Договор) И ЗаказКлиента.Контрагент.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо И ПроверкаОграниченияЗадолженности(ЗаказКлиента.Договор, ТекДата)) Тогда
						СоздатьЛистСогласования(Отказ, ТекДата, РеализацияОбъект, Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности, Комментарий);	
					КонецЕсли;
					
					//лист оформления. должен создаваться по документам с договором
					Если ЗначениеЗаполнено(ЗаказКлиента.Договор) Тогда
						СоздатьЛистСогласования(Отказ, ТекДата, РеализацияОбъект, Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления, Комментарий);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Отказ;
	КонецЕсли;
	
КонецФункции

Функция ПроверкаОграниченияЗадолженности(Договор, Дата)
		
	ДанныеДоговора = Новый Структура; 
	ДанныеДоговора.Вставить("ОграничиватьСуммуЗадолженности", Ложь); 
	ДанныеДоговора.Вставить("ДопустимаяСуммаЗадолженности", 0); 
	ДанныеДоговора.Вставить("ВалютаВзаиморасчетов", Неопределено); 
	ДанныеДоговора.Вставить("ЗапрещаетсяПросроченнаяЗадолженность", Ложь); 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ОграничиватьСуммуЗадолженности КАК ОграничиватьСуммуЗадолженности,
	|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности КАК ДопустимаяСуммаЗадолженности,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.ЗапрещаетсяПросроченнаяЗадолженность КАК ЗапрещаетсяПросроченнаяЗадолженность
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор");
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеДоговора = Выборка;
	КонецЕсли;
	
	ПревышенаСумма = Ложь;
	Если ДанныеДоговора.ОграничиватьСуммуЗадолженности Тогда
		ОстатокДопустимогоКредита = ОстатокДопустимогоКредита(Договор, ДанныеДоговора.ДопустимаяСуммаЗадолженности);
		ПревышенаСумма = ОстатокДопустимогоКредита < 0;
	КонецЕсли;
	
	ПревышенСрок = Ложь;
	Если ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность Тогда
		СуммаПросроченнойЗадолженности = СуммаПросроченнойЗадолженности(Договор, Дата);
		ПревышенСрок = СуммаПросроченнойЗадолженности > 0;
	КонецЕсли;
	
	Возврат ПревышенаСумма ИЛИ ПревышенСрок;
		
КонецФункции

Функция ОстатокДопустимогоКредита(Договор, ДопустимыйКредит)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.СуммаОстаток + РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток КАК ОстатокДолга
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|		,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ГДЕ
	|				АналитикаПоПартнерам.Договор = &Договор
	|			)
	|	) КАК РасчетыСКлиентамиОстатки
	|");
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ДопустимыйКредит - Выборка.ОстатокДолга;
	Иначе
		Возврат ДопустимыйКредит;
	КонецЕсли;
	
КонецФункции

Функция СуммаПросроченнойЗадолженности(Договор, ДатаДокумента)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РасчетыСКлиентамиОстатки.ДолгОстаток КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|		,
		|		АналитикаУчетаПоПартнерам В (
		|			ВЫБРАТЬ
		|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
		|			ИЗ
		|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|			ГДЕ
		|				АналитикаПоПартнерам.Договор = &Договор
		|			) И ДатаПлановогоПогашения < &ПериодКонтроляСрокаДолга
		|	) КАК РасчетыСКлиентамиОстатки
		|
		|ГДЕ
		|	РасчетыСКлиентамиОстатки.ДолгОстаток > 0
		|");
		Запрос.УстановитьПараметр("ПериодКонтроляСрокаДолга", НачалоДня(Макс(ТекущаяДатаСеанса(), ДатаДокумента)));
	Иначе
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА РасчетыСКлиентамиОстатки.СуммаОстаток >
		|			РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток ТОГДА
		|		РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток
		|	ИНАЧЕ
		|		РасчетыСКлиентамиОстатки.СуммаОстаток
		|	КОНЕЦ), 0) КАК ПросроченнаяЗадолженность
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(
		|		&ПериодКонтроляСрокаДолга,
		|		АналитикаУчетаПоПартнерам В (
		|			ВЫБРАТЬ
		|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
		|			ИЗ
		|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|			ГДЕ
		|				АналитикаПоПартнерам.Договор = &Договор
		|			)
		|	) КАК РасчетыСКлиентамиОстатки
		|
		|ГДЕ
		|	РасчетыСКлиентамиОстатки.СуммаОстаток > 0
		|	И (РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток) > 0
		|");
		Запрос.УстановитьПараметр("ПериодКонтроляСрокаДолга", Макс(КонецДня(ТекущаяДатаСеанса()), КонецДня(ДатаДокумента)));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПросроченнаяЗадолженность;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЕстьРеализацияПоЗаказу(ЗаказКлиента)
	
	Массив = АльтерраОбщегоНазначения.ПолучитьРеализацииПоЗаказу(ЗаказКлиента);
	Если ЗначениеЗаполнено(Массив) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По заказу '" + ЗаказКлиента + "' уже существует реализация: '" + Массив[0] + "'", Массив[0]);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Процедура СоздатьЛистСогласования(Отказ, ТекДата, РеализацияОбъект, ВидОперации, Комментарий)
	
	ДокЛистСогласования = Документы.ЛистСогласования.СоздатьДокумент();
	ДокЛистСогласования.ДополнительныеСвойства.Вставить("ПрограммноеСозданиеЛиста", Истина);
	
	Документы.ЛистСогласования.ЗаполнитьДанныеПоОснованию(
		РеализацияОбъект.Ссылка, 
		ДокЛистСогласования, 
		ВидОперации);      
	
	Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
		ДокЛистСогласования.Проблема = Справочники.Проблемы.НайтиПоКоду("000000016"); // Реализация (отсутствие оригинала/некорректное оформление -ПАКЕТ ДОКУМЕНТОВ)
	КонецЕсли;
	
	ДокЛистСогласования.Комментарий = Комментарий;

	Попытка
		ДокЛистСогласования.Записать(РежимЗаписиДокумента.Проведение);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ: " + ДокЛистСогласования.Ссылка, ДокЛистСогласования.Ссылка);
	Исключение                                                     
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ 'Лист согласования'");
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

Процедура ПроверкаКорректностиПримененияСкидокВЗаказе(Реализация_Ссылка, ЗаказКлиента, Отказ) Экспорт
	Если Не ЗначениеЗаполнено(Реализация_Ссылка) И ЗначениеЗаполнено(ЗаказКлиента) И Не Отказ Тогда  
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиента.НомерСтроки КАК НомерСтроки,
			|	ЗаказКлиента.Номенклатура КАК Номенклатура,
			|	ЗаказКлиента.СуммаРучнойСкидки + ЗаказКлиента.СуммаАвтоматическойСкидки КАК Скидка
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Ссылка
			|	И ЗаказКлиента.КоличествоУпаковок * ЗаказКлиента.Цена = ЗаказКлиента.Сумма
			|	И ЗаказКлиента.СуммаРучнойСкидки + ЗаказКлиента.СуммаАвтоматическойСкидки <> 0";
		
		Запрос.УстановитьПараметр("Ссылка", ЗаказКлиента);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Количество() <> 0 Тогда
			Пока РезультатЗапроса.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"По строке заказа #" + РезультатЗапроса.НомерСтроки + 
					" скдика (" + РезультатЗапроса.Скидка + ") не учитывается. " +
					"Номенклатура: '" + РезультатЗапроса.Номенклатура + "'");
			КонецЦикла;
		
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&После("ДобавитьКомандыСозданияНаОсновании")
Процедура Док_ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании, Параметры)
	Документы.ЗаказНаДоставкуКлиенту.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);
	Документы.СверкаВзаиморасчетов2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);
	Документы.ПередачаТоваровМеждуОрганизациями.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);
	Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);
	Документы.ОбращениеКлиента.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);
	Документы.ЛистСогласования.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании); 
	//Документы.НачислениеИСписаниеБонусныхБаллов.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);
КонецПроцедуры

&ИзменениеИКонтроль("ДанныеДокументаДляПроведения")
Функция Док_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено)
		
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		ДокументОбъект = Документ;
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументСсылка = Документ;
	КонецЕсли;

	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		СформироватьСуммыДокументаВВалютахУчета(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		
		ТекстЗапросаТаблицаРаспоряженияНаОтгрузку(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаПереданнаяВозвратнаяТара(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаТоварыПереданныеНаКомиссию(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДатыПередачиТоваровНаКомиссию(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаТоварыОрганизацийКПередаче(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаТоварыКОформлениюОтчетовКомитенту(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаВыручкаИСебестоимостьПродаж(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаМатериалыИРаботыВПроизводстве(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияНоменклатураНоменклатура(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияКонтрагентКонтрагент(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаУслугиКОформлениюОтчетовПринципалу(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
#Удаление
		ТекстЗапросаБонусныеБаллы(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
#КонецУдаления
#Вставка
		ИспользуетсяНовыйПорядок = БонусыАльтерраРезерв.ПрименитьНовыйПорядокРаспределенияБонусов(Документ);
		ПоЗаказу = ЗначениеЗаполнено(Документ.ЗаказКлиента);
        ТекстЗапросаБонусныеБаллыСРезервом(Запрос, ТекстыЗапроса, Регистры, ИспользуетсяНовыйПорядок, ПоЗаказу);
		ТекстЗапросаТаблицаКОтгрузкеПоНакладным(Запрос, ТекстыЗапроса, Регистры, Документ);
#КонецВставки
		
		РасчетСебестоимостиПроведениеДокументов.ОтразитьВМеханизмеУчетаЗатратИСебестоимости(ДокументСсылка, Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		
		ОтразитьВУчетеНДС(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		
		РеализацияТоваровУслугЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры, ДопПараметры);
	ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ОтразитьРезерв(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ЗапланироватьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ОформитьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

Функция ТекстЗапросаБонусныеБаллыСРезервом(Запрос, ТекстыЗапроса, Регистры, ИспользуетсяНовыйПорядок, ПоЗаказу)

	ИмяРегистра = "БонусныеБаллы";

	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	//ВтБонусныеБаллы
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтБонусныеБаллы", ТекстыЗапроса) Тогда
		ИмяДопРегистра = "ВтБонусныеБаллы";
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	БонусныеПрограммыЛояльности.Ссылка КАК БонуснаяПрограммаЛояльности
		|ПОМЕСТИТЬ ВТБонусныеПрограммы
		|ИЗ
		|	Справочник.БонусныеПрограммыЛояльности КАК БонусныеПрограммыЛояльности
		|ГДЕ
		|	БонусныеПрограммыЛояльности.Наименование = ""Бонус от ALTERRA""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.ДатаНачисления КАК Период,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.ДатаСписания <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТабличнаяЧасть.ДатаНачисления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаНачалаДействия,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.ДатаСписания <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ТекущаяДата
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаКОбработке,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТБонусныеПрограммы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	&Партнер КАК Партнер,
		|	ТабличнаяЧасть.СуммаБонусныхБаллов КАК Начислено,
		|	ТабличнаяЧасть.СуммаБонусныхБалловЗаСтатус КАК НачисленоСтатус,
		|	Выбор Когда &ЭтоБригадир Тогда 0 Иначе ТабличнаяЧасть.СуммаБонусныхБалловЗаКП Конец КАК НачисленоКП,
		|   Выбор Когда &ЭтоБригадир Тогда ТабличнаяЧасть.СуммаБонусныхБалловЗаКП Иначе 0 Конец КАК НачисленоДопБаллы,
		|	ТабличнаяЧасть.СуммаБонусныхБалловПрочее КАК НачисленоПрочее,
		|	0 КАК КСписанию,
		|	0 КАК ВРезерве
		|ПОМЕСТИТЬ ВтБонусныеБаллы
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.БонусныеБаллы КАК ТабличнаяЧасть,
		|	ВТБонусныеПрограммы КАК ВТБонусныеПрограммы
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И НЕ ТабличнаяЧасть.Ссылка.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК Период,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачалаДействия,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаКОбработке,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВТБонусныеПрограммы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	&Партнер КАК Партнер,
		|	СУММА(ТабличнаяЧасть.СуммаБонусныхБалловКСписаниюВВалюте) КАК Начислено,
		|	0 КАК НачисленоСтатус,
		|	0 КАК НачисленоКП, 
		|   0 КАК НачисленоДопБаллы,
		|	0 КАК НачисленоПрочее,
		|	0 КАК КСписанию,
		|	&Резерв КАК ВРезерве
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТабличнаяЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.БонусныеБаллы КАК БонусныеБаллы
		|		ПО (ТабличнаяЧасть.Ссылка = БонусныеБаллы.Ссылка),
		|	ВТБонусныеПрограммы КАК ВТБонусныеПрограммы
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И ТабличнаяЧасть.СуммаБонусныхБалловКСписаниюВВалюте <> 0
		|	И (НЕ &ПоЗаказу ИЛИ НЕ ТабличнаяЧасть.Ссылка.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТБонусныеПрограммы.БонуснаяПрограммаЛояльности";
		
		Резерв = ?(ИспользуетсяНовыйПорядок И ПоЗаказу, "СУММА(ТабличнаяЧасть.СуммаБонусныхБалловКСписаниюВВалюте)", "0");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Резерв", Резерв);
			
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяДопРегистра);
		
	КонецЕсли;              
   	//-ВтБонусныеБаллы
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	БонусныеБаллы.Период КАК Период,
	|	БонусныеБаллы.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	БонусныеБаллы.ДатаКОбработке КАК ДатаКОбработке,
	|	БонусныеБаллы.ВидДвижения КАК ВидДвижения,
	|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	БонусныеБаллы.Партнер КАК Партнер,
	|	СУММА(БонусныеБаллы.Начислено) КАК Начислено,
	|	СУММА(БонусныеБаллы.НачисленоСтатус) КАК НачисленоСтатус,
	|	СУММА(БонусныеБаллы.НачисленоКП) КАК НачисленоКП,
	|   СУММА(БонусныеБаллы.НачисленоДопБаллы) КАК НачисленоДопБаллы,
	|	СУММА(БонусныеБаллы.НачисленоПрочее) КАК НачисленоПрочее,
	|	СУММА(БонусныеБаллы.КСписанию) КАК КСписанию,
	|	СУММА(БонусныеБаллы.ВРезерве) КАК ВРезерве
	|ИЗ
	|	ВтБонусныеБаллы КАК БонусныеБаллы
	|СГРУППИРОВАТЬ ПО
	|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
	|	БонусныеБаллы.Партнер,
	|	БонусныеБаллы.Период,
	|	БонусныеБаллы.ДатаНачалаДействия,
	|	БонусныеБаллы.ДатаКОбработке,
	|	БонусныеБаллы.ВидДвижения
	|ИМЕЮЩИЕ
	|	СУММА(БонусныеБаллы.Начислено) <> 0
	|	ИЛИ СУММА(БонусныеБаллы.ВРезерве) <> 0";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаКОтгрузкеПоНакладным(Запрос, ТекстыЗапроса, Регистры, Документ)
	
	ИмяРегистра = "ТоварыКОтгрузкеПоНакладным";
	
	Если НЕ (ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) И 
		АльтерраОбщегоНазначения.ОтгрузкаПоНакладным(Документ.Дата,Документ.Склад)) Тогда
		Возврат "";
	КонецЕсли; 
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаТовары.Ссылка.ЗаказКлиента В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|			ТОГДА ТаблицаТовары.Ссылка.ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказКлиента,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК РабочийУчасток,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВтТаблицаТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ТаблицаТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ТаблицаТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И ТаблицаТовары.Ссылка В(&Ссылка)
	|	И ТаблицаТовары.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	ТаблицаТовары.РабочийУчасток КАК РабочийУчасток,
	|	&Партнер КАК Получатель,
	|	&Ссылка КАК Накладная,
	|	ТаблицаТовары.ЗаказКлиента КАК Заказ,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ТаблицаТовары.Количество КАК КОтгрузке
	|ИЗ
	|	ВтТаблицаТоваров КАК ТаблицаТовары";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	// -
	
	Возврат ТекстЗапроса;

	
КонецФункции

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("ОтгрузкаПоНакладным"); 
	МеханизмыДокумента.Добавить("ДвижениеМаркированногоТовара"); 
	
КонецПроцедуры 

&ИзменениеИКонтроль("ОтразитьВУчетеНДС")
Процедура Док_ОтразитьВУчетеНДС(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)

    Если Не УчетНДСУП.ТребуетсяПроведениеПоРегистрамНДС(Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (ДокументОбъект.Статус <> Перечисления.СтатусыРеализацийТоваровУслуг.КПредоплате
			И (ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности
			ИЛИ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтСтрокиТоваров", ТекстыЗапроса) Тогда
		ТекстЗапросаВтСтрокиТоваров(Запрос, ТекстыЗапроса);
	КонецЕсли; 

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтВидыЗапасовРабот", ТекстыЗапроса) Тогда
		ТекстЗапросаВтВидыЗапасовРабот(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЦенности = "
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Грузоотправитель КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Подразделение КАК Подразделение,
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
	|	РеализацияТоваровУслуг.КлиентКонтрагент КАК ПокупательКомиссионногоТовара,
	|	&РеализацияЧерезКомиссионера КАК РеализацияЧерезКомиссионера,
	|	НЕОПРЕДЕЛЕНО КАК ДокументКорректировкиРеализации,
	|	ЛОЖЬ КАК ИсправлениеОшибок,
	|	ЛОЖЬ КАК КорректировкаПоСогласованиюСторон,
	|	ЛОЖЬ КАК РеализацияВРозницу,
	|	УслугиТЧ.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	УслугиТЧ.СтавкаНДС КАК СтавкаНДС,
	|	УслугиТЧ.Номенклатура КАК Номенклатура,
	|	УслугиТЧ.Характеристика КАК Характеристика,
	|	УслугиТЧ.Серия КАК Серия,
	|	УслугиТЧ.НоменклатураПартнера КАК НоменклатураПартнера,	
	|	УслугиТЧ.НоменклатураНабора КАК НоменклатураНабора,
	|	УслугиТЧ.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	"""" КАК Содержание,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ УслугиТЧ.КоличествоУпаковок = 0
	|			ТОГДА УслугиТЧ.Количество
	|		ИНАЧЕ УслугиТЧ.КоличествоУпаковок
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА УслугиТЧ.НоменклатураЕдиницаИзмерения
	|		ИНАЧЕ &ТекстЗапросаЕдиницаИзмеренияУслуги
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	0 КАК КоличествоПоРНПТ,
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК КодТНВЭД,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасов,
	|	УслугиТЧ.НомерСтроки КАК НомерСтроки,
	|	УслугиТЧ.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	УслугиТЧ.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	&НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ДанныеДокументаШапка КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаТовары КАК УслугиТЧ
	|		ПО РеализацияТоваровУслуг.Ссылка = УслугиТЧ.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВидыЗапасовРабот КАК ВидыЗапасов
	|		ПО УслугиТЧ.Ссылка = ВидыЗапасов.Ссылка
	|			И УслугиТЧ.АналитикаУчетаНоменклатуры = ВидыЗапасов.АналитикаУчетаНоменклатуры
	|ГДЕ
	|	УслугиТЧ.НоменклатураТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), 
	|											ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	// Обычные работы учитываются в этом запросе. А прослеживаемые в следующем, т.е. из ТЧ Виды запасов.
	|	И ВидыЗапасов.Ссылка ЕСТЬ NULL
#Вставка
	|	И не РеализацияТоваровУслуг.РаспределитьТранспортные 
#КонецВставки	
	// это условие необходимо сохранить именно таким, в целях сохранения быстродействия на СУБД Postgresql
	|	И ВЫБОР
	|			КОГДА НЕ УслугиТЧ.Ссылка ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.ХозяйственнаяОперация,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Договор,
	|	РеализацияТоваровУслуг.Грузоотправитель,
	|	РеализацияТоваровУслуг.Грузополучатель,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Подразделение,
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.КлиентКонтрагент,
	|	&РеализацияЧерезКомиссионера,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВидыЗапасовТЧ.ОбъектРасчетов,
	|	РеализацияТоваровУслуг.НалогообложениеНДС,
	|	ВидыЗапасовТЧ.СтавкаНДС,
	|	ВидыЗапасовТЧ.АналитикаУчетаНоменклатурыНоменклатура,
	|	ВидыЗапасовТЧ.АналитикаУчетаНоменклатурыХарактеристика,
	|	ВидыЗапасовТЧ.АналитикаУчетаНоменклатурыСерия,
	|	СтрокиТоваров.НоменклатураПартнера,	
	|	ВидыЗапасовТЧ.АналитикаУчетаНаборовНоменклатураНабора,
	|	ВидыЗапасовТЧ.АналитикаУчетаНаборовХарактеристикаНабора,
	|	"""",
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ИЛИ ВидыЗапасовТЧ.КоличествоУпаковок = 0
	|			ТОГДА ВидыЗапасовТЧ.Количество
	|		ИНАЧЕ ВидыЗапасовТЧ.КоличествоУпаковок
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВидыЗапасовТЧ.АналитикаУчетаНоменклатураНоменклатураЕдиницаИзмерения
	|		ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВидыЗапасовТЧ.КоличествоПоРНПТ,
	|	ВидыЗапасовТЧ.НомерГТД,
	|	ВидыЗапасовТЧ.КодТНВЭД,
	|	ВидыЗапасовТЧ.ВидЗапасов,
	|	СтрокиТоваров.НомерСтроки,
	|	ВидыЗапасовТЧ.ИдентификаторСтроки,
	|	ВидыЗапасовТЧ.ИдентификаторСтроки,
	|	&НастройкаХозяйственнойОперации
	|ИЗ
	|	ДанныеДокументаШапка КАК РеализацияТоваровУслуг
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаВидыЗапасов КАК ВидыЗапасовТЧ
	|		ПО РеализацияТоваровУслуг.Ссылка = ВидыЗапасовТЧ.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСтрокиТоваров КАК СтрокиТоваров
	|		ПО ВидыЗапасовТЧ.Ссылка = СтрокиТоваров.Ссылка
	|			И ВидыЗапасовТЧ.АналитикаУчетаНоменклатуры = СтрокиТоваров.АналитикаУчетаНоменклатуры
	|			И ВидыЗапасовТЧ.АналитикаУчетаНаборов = СтрокиТоваров.АналитикаУчетаНаборов
	|			И ВидыЗапасовТЧ.Упаковка = СтрокиТоваров.Упаковка
	|			И ВидыЗапасовТЧ.Цена = СтрокиТоваров.Цена
	|
	|ГДЕ
	|	ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.ВернутьМногооборотнуюТару
	|				ТОГДА ВидыЗапасовТЧ.АналитикаУчетаНоменклатурыНоменклатураТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	// это условие необходимо сохранить именно таким, в целях сохранения быстродействия на СУБД Postgresql
	|	И ВЫБОР
	|			КОГДА НЕ ВидыЗапасовТЧ.Ссылка ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|		КОНЕЦ";
	
	ТекстЦенности = СтрЗаменить(
		ТекстЦенности,
		"&ТекстЗапросаЕдиницаИзмеренияУслуги",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Ссылка",
			"УслугиТЧ.Упаковка",
			"УслугиТЧ.Номенклатура"));
	ТекстЦенности = СтрЗаменить(
		ТекстЦенности,
		"&ТекстЗапросаЕдиницаИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Ссылка",
			"ВидыЗапасовТЧ.Упаковка",
			"ВидыЗапасовТЧ.АналитикаУчетаНоменклатуры.Номенклатура"));
	ТекстЦенности = СтрЗаменить(
		ТекстЦенности,
		"&РеализацияЧерезКомиссионера",
		КомиссионнаяТорговляСервер.ТекстЗапросаРеализацияЧерезКомиссионера("РеализацияТоваровУслуг.Ссылка.ХозяйственнаяОперация"));
	
	УчетНДСУП.ОтразитьРеализациюКлиенту(Запрос, ТекстыЗапроса, Регистры, ТекстЦенности);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПараметрыИнициализации")
Процедура Док_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

    Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ДанныеДокументаТовары.ЗаказКлиентаЭтоЗаказКакСчет, НЕОПРЕДЕЛЕНО) КАК ЭтоЗаказКакСчет
	|ПОМЕСТИТЬ ДанныеДокументаТовары
	|ИЗ
	|	ДанныеДокументаТаблицаТовары КАК ДанныеДокументаТовары
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                КАК Ссылка,
	|	ДанныеДокумента.Организация           КАК Организация,
	|	ДанныеДокумента.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ДанныеДокумента.Статус                КАК Статус,
	|	ДанныеДокумента.Партнер               КАК Партнер,
	|	ДанныеДокумента.Контрагент            КАК Контрагент,
	|	ДанныеДокумента.КлиентПартнер         КАК КлиентПартнер,
	|	ДанныеДокумента.КлиентКонтрагент      КАК КлиентКонтрагент,
	|	ДанныеДокумента.КлиентДоговор         КАК КлиентДоговор,
	|	ДанныеДокумента.КонтрагентУчастникЕАЭС КАК КонтрагентУчастникЕАЭС,
	|	ДанныеДокумента.КонтрагентНеРезидент  КАК КонтрагентНеРезидент,
	|	ДанныеДокумента.Дата                  КАК Период,
	|	ДанныеДокумента.ДатаПереходаПраваСобственности   КАК ДатаПереходаПраваСобственности,
	|	ДанныеДокумента.ЗаказКлиента          КАК ЗаказКлиента,
	|	ДанныеДокумента.Валюта                КАК Валюта,
	|	ДанныеДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение         КАК Подразделение,
	|	ДанныеДокумента.ВариантОбособленногоУчетаТоваров КАК ВариантОбособленногоУчетаТоваров,
	|	ДанныеДокумента.Склад                 КАК Склад,
	|	ДанныеДокумента.ДатаРаспоряжения      КАК ДатаРаспоряжения,
	|	ДанныеДокумента.ЦенаВключаетНДС       КАК ЦенаВключаетНДС,
	|	ДанныеДокумента.ВалютаВзаиморасчетов  КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.РеализацияПоЗаказам   КАК РеализацияПоЗаказу,
	|	ДанныеДокумента.Соглашение            КАК Соглашение,
	|	ДанныеДокумента.ФормаОплаты           КАК ФормаОплаты,
	|	ДанныеДокумента.Договор               КАК Договор,
	|	ДанныеДокумента.ВестиРасчетыЧерезКонечныхПокупателей КАК ВестиРасчетыЧерезКонечныхПокупателей,
	|	ДанныеДокумента.НалогообложениеНДС    КАК НалогообложениеНДС,
	|	ДанныеДокумента.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	ДанныеДокумента.ТребуетсяЗалогЗаТару      КАК ТребуетсяЗалогЗаТару,
	|	ДанныеДокумента.Менеджер                  КАК Менеджер,
	|	ДанныеДокумента.ГруппаФинансовогоУчета    КАК ГруппаФинансовогоУчета,
	|	ДанныеДокумента.Сделка                    КАК Сделка,
	|	ДанныеДокумента.ОбособленныйУчетТоваровПоСделке КАК ОбособленныйУчетТоваровПоСделке,
	|	ДанныеДокумента.ЭтоПередачаНаКомиссию  КАК ЭтоПередачаНаКомиссию,
	|	ДанныеДокумента.ДопустимаяСуммаЗадолженности КАК ДопустимаяСуммаЗадолженности,
	|	ДанныеДокумента.Номер                  КАК Номер,
	|	ДанныеДокумента.СуммаДокумента         КАК СуммаДокумента,
	|	ДанныеДокумента.Комментарий            КАК Комментарий,
	|	ДанныеДокумента.ПометкаУдаления        КАК ПометкаУдаления,
	|	ДанныеДокумента.Проведен               КАК Проведен,
#Вставка
	|	ДанныеДокумента.Кассир        	       КАК Кассир,
	|	ДанныеДокумента.Магазин        	       КАК Магазин,
#КонецВставки
	|	ДанныеДокумента.Автор                  КАК Автор,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НастройкиХозяйственныхОпераций.Ссылка   КАК НастройкаХозяйственнойОперации,
	|	ЕСТЬNULL(ДанныеДокументаТовары.ЭтоЗаказКакСчет, НЕОПРЕДЕЛЕНО) КАК ЭтоЗаказКакСчет,
	|	ДанныеДокумента.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности
	|
	|ИЗ
	|	ДанныеДокументаШапка КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|		ПО ДанныеДокумента.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаТовары
	|		ПО ИСТИНА
	|";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета",           Реквизиты.ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",               Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("Статус",                                   ?(ЗначениеЗаполнено(Реквизиты.Статус), Реквизиты.Статус, Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено));
	Запрос.УстановитьПараметр("ЦенаВключаетНДС",                          ?(Реквизиты.ЦенаВключаетНДС, 0, 1));
	Запрос.УстановитьПараметр("РеализацияПоНесколькимЗаказам",            ?(Не ЗначениеЗаполнено(Реквизиты.ЗаказКлиента), Истина, Ложь));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",                    ?(ЗначениеЗаполнено(Реквизиты.ХозяйственнаяОперация), Реквизиты.ХозяйственнаяОперация, Перечисления.ХозяйственныеОперации.РеализацияКлиенту));
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета",
		ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));
	Запрос.УстановитьПараметр("ИспользоватьПродажуАгентскихУслуг",        ПолучитьФункциональнуюОпцию("ИспользоватьПродажуАгентскихУслуг"));
	Запрос.УстановитьПараметр("СписокТиповСАналитикойПодразделение",      ПродажиСервер.ТипыНоменклатурыСАналитикойПодразделение());
	
	ПустоеЗначениеЗаказа = ПустыеЗначенияЗаказов();
	Запрос.УстановитьПараметр("ПустоеЗначениеЗаказа", ПустоеЗначениеЗаказа);
	
	Если ЗначениеЗаполнено(Реквизиты.Договор) Тогда
		ШаблонСтроки = "ru = 'По договору ""%1""'"; // @НСтр
		ИнформацияПоДоговору = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, Реквизиты.Договор);
	КонецЕсли;
	Запрос.УстановитьПараметр("ИнформацияПоДоговору",             ИнформацияПоДоговору);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",          ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДокументСсылка)));
	Запрос.УстановитьПараметр("НомерНаПечать",                    ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	Запрос.УстановитьПараметр("НоваяАрхитектураВзаиморасчетов",   ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов"));
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения",  Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	Запрос.УстановитьПараметр("Партнер",                          Реквизиты.Партнер);
#Удаление
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности",      Реквизиты.БонуснаяПрограммаЛояльности);
#КонецУдаления
#Вставка
	БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	Запрос.УстановитьПараметр("ЧекПробит", ЗначениеЗаполнено(Реквизиты.Кассир)); 
	Запрос.УстановитьПараметр("ЭтоБригадир", АльтерраОбщегоНазначения.ЭтоБригадир(Реквизиты.Партнер));
	Запрос.УстановитьПараметр("ПоЗаказу", ЗначениеЗаполнено(Реквизиты.ЗаказКлиента));
#КонецВставки
	Запрос.УстановитьПараметр("ТекущаяДата",                      ТекущаяУниверсальнаяДата());
	Запрос.УстановитьПараметр("РеализацияЧерезКомиссионера",      КомиссионнаяТорговляСервер.РеализацияЧерезКомиссионера(Реквизиты.ХозяйственнаяОперация));
	
	Если ЗначениеЗаполнено(Реквизиты.Договор)
	 И (Реквизиты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
		ИЛИ Реквизиты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности) Тогда
		Запрос.УстановитьПараметр("АналитикаПартнерВТоварахВПути", АналитикаПартнерВТоварахВПути(Запрос));
	Иначе
		Запрос.УстановитьПараметр("АналитикаПартнерВТоварахВПути", Истина);
	КонецЕсли;
	Если Реквизиты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда
		Запрос.УстановитьПараметр("РазделУчетаКомиссионныйТоварВПути", РазделУчетаКомиссионныйТоварВПути(Запрос));
	Иначе
		Запрос.УстановитьПараметр("РазделУчетаКомиссионныйТоварВПути", Неопределено);
	КонецЕсли;
	
	Если Реквизиты.ЭтоЗаказКакСчет = Неопределено Тогда
		Запрос.УстановитьПараметр("ИспользоватьРасширенныеВозможностиЗаказаКлиента",
			ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента"));
	Иначе
		Запрос.УстановитьПараметр("ИспользоватьРасширенныеВозможностиЗаказаКлиента", Не Реквизиты.ЭтоЗаказКакСчет);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипыНалогообложенияНДСНеоблагаемые", УчетНДСУП.ТипыНалогообложенияНДСНеоблагаемые());
	
	УчетНДСУП.УстановитьПараметрыЗапросаСтавкиНДС(Запрос.Параметры, Запрос.Параметры.Организация, Запрос.Параметры.Период);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);

	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);

КонецПроцедуры 

&ИзменениеИКонтроль("ПолучитьРезультатЗапросаПоОстаткамЗаказов")
Функция Док_ПолучитьРезультатЗапросаПоОстаткамЗаказов(ДанныеОтбора, ПараметрыЗаполнения, СкладРеализации, МассивЗаказов)

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("МассивЗаказов",             МассивЗаказов);
	Запрос.УстановитьПараметр("Партнер",                   ДанныеОтбора.Партнер);
	Запрос.УстановитьПараметр("Контрагент",                ДанныеОтбора.Контрагент);
	Запрос.УстановитьПараметр("Договор",                   ДанныеОтбора.Договор);
	Запрос.УстановитьПараметр("Организация",               ДанныеОтбора.Организация);
	Запрос.УстановитьПараметр("Сделка",                    ДанныеОтбора.Сделка);
	Запрос.УстановитьПараметр("Соглашение",                ДанныеОтбора.Соглашение);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов",      ДанныеОтбора.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("НалогообложениеНДС",        ДанныеОтбора.НалогообложениеНДС);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС",           ДанныеОтбора.ЦенаВключаетНДС);
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ДанныеОтбора.ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару",      ДанныеОтбора.ТребуетсяЗалогЗаТару);
	Запрос.УстановитьПараметр("ПорядокРасчетов",           ДанныеОтбора.ПорядокРасчетов);
	Запрос.УстановитьПараметр("Регистратор",               ДанныеОтбора.Ссылка);
	Запрос.УстановитьПараметр("СкладРеализации",           СкладРеализации);
	Запрос.УстановитьПараметр("ОтобратьПоЗаказу",          МассивЗаказов <> Неопределено);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",     ДанныеОтбора.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("ТекущаяДата",               НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ИспользоватьСоглашенияСКлиентами",
	ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("НаправлениеДеятельности",        ДанныеОтбора.НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ИспользоватьНаправленияДеятельности",
	ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности"));
	НалогообложениеНДСЭкспорт = ДанныеОтбора.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт
	Или ДанныеОтбора.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг
	Или ДанныеОтбора.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров;
	Запрос.УстановитьПараметр("НалогообложениеНДСЭкспорт", НалогообложениеНДСЭкспорт);

	ИспользоватьРасширенныеВозможностиЗаказаКлиента = Неопределено;
	ПараметрыЗаполнения.Свойство("ИспользоватьРасширенныеВозможностиЗаказаКлиента",
	ИспользоватьРасширенныеВозможностиЗаказаКлиента);
	Если ИспользоватьРасширенныеВозможностиЗаказаКлиента = Неопределено Тогда
		ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	КонецЕсли;
	Запрос.УстановитьПараметр("ЭтоЗаказКакСчет", Не ИспользоватьРасширенныеВозможностиЗаказаКлиента);

	ХозяйственныеОперацииРаспоряжений = Новый Массив();

	Если ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту
		Или ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет 
		Или ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда

		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя);
		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);

	ИначеЕсли ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию  Тогда

		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);

	КонецЕсли;

	Запрос.УстановитьПараметр("ХозяйственныеОперацииРаспоряжений", ХозяйственныеОперацииРаспоряжений);

	ВариантОформления = Неопределено;
	ПараметрыЗаполнения.Свойство("ВариантОформления", ВариантОформления);

	МассивВариантовОформления = Новый Массив;
	Если ЗначениеЗаполнено(ВариантОформления) Тогда
		МассивВариантовОформления.Добавить(ВариантОформления);
	Иначе
		МассивВариантовОформления.Добавить(Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);
		МассивВариантовОформления.Добавить(Перечисления.ВариантыОформленияПродажи.АктНаПередачуПрав);
	КонецЕсли;

	Запрос.УстановитьПараметр("МассивВариантовОформления", МассивВариантовОформления);

	РеализацияТоваровУслугЛокализация.УстановитьПараметрыОсобенностиУчетаНоменклатуры(ПараметрыЗаполнения, Запрос.Параметры);

	Если ТипЗнч(ДанныеОтбора) = Тип("Структура") 
		И ДанныеОтбора.Свойство("ТоварыРеализации") Тогда
		Запрос.УстановитьПараметр("ТоварыРеализации", ДанныеОтбора.ТоварыРеализации);
	Иначе
		ТоварыРеализации = Новый ТаблицаЗначений;
		ТоварыРеализации.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
		ТоварыРеализации.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТоварыРеализации.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТоварыРеализации.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
		ТоварыРеализации.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		ТоварыРеализации.Колонки.Добавить("СуммаВзаиморасчетов", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТоварыРеализации.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
		ТоварыРеализации.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ТоварыРеализации.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ТоварыРеализации.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
		ТоварыРеализации.Колонки.Добавить("КоличествоВЗаказе", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		ТоварыРеализации.Колонки.Добавить("Цена", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
		ТоварыРеализации.Колонки.Добавить("Сумма", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаНДС", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаСНДС", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("ПроцентРучнойСкидки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2)));
		ТоварыРеализации.Колонки.Добавить("СуммаРучнойСкидки", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("ПроцентАвтоматическойСкидки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2)));
		ТоварыРеализации.Колонки.Добавить("СуммаАвтоматическойСкидки", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаБонусныхБалловКСписанию", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаБонусныхБалловКСписаниюВВалюте", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаНачисленныхБонусныхБалловВВалюте", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("НоменклатураНабора", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТоварыРеализации.Колонки.Добавить("ХарактеристикаНабора", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТоварыРеализации.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
		ТоварыРеализации.Колонки.Добавить("КлючСвязи", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));

		Запрос.УстановитьПараметр("ТоварыРеализации", ТоварыРеализации);
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТоварыРеализации.КодСтроки КАК ЧИСЛО(10, 0)) КАК КодСтроки,
	|	ТоварыРеализации.ЗаказКлиента КАК ЗаказКлиента,
	|	ВЫРАЗИТЬ(ТоварыРеализации.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТоварыРеализации.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ТоварыРеализации.Количество КАК Количество,
	|	ВЫРАЗИТЬ(ТоварыРеализации.Склад КАК Справочник.Склады) КАК Склад,
	|	ТоварыРеализации.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТоварыРеализации.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
	|	ТоварыРеализации.Серия КАК Серия,
	|	ТоварыРеализации.ВидЦены КАК ВидЦены,
	|	ТоварыРеализации.Цена КАК Цена,
	|	ТоварыРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыРеализации.Сумма КАК Сумма,
	|	ТоварыРеализации.СуммаНДС КАК СуммаНДС,
	|	ТоварыРеализации.СуммаСНДС КАК СуммаСНДС,
	|	ТоварыРеализации.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТоварыРеализации.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТоварыРеализации.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТоварыРеализации.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	ТоварыРеализации.НоменклатураНабора КАК НоменклатураНабора,
	|	ТоварыРеализации.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТоварыРеализации.Подразделение КАК Подразделение,
	|	ТоварыРеализации.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ ВтТоварыРеализации
	|ИЗ
	|	&ТоварыРеализации КАК ТоварыРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыРеализации.КодСтроки КАК КодСтроки,
	|	ВтТоварыРеализации.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтТоварыРеализации.Номенклатура КАК Номенклатура,
	|	ВтТоварыРеализации.Характеристика КАК Характеристика,
	|	СУММА(ВтТоварыРеализации.Количество) КАК Количество,
	|	ВтТоварыРеализации.Серия КАК Серия,
	|	ВтТоварыРеализации.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ВтТоварыРеализацииПоЗаказу
	|ИЗ
	|	ВтТоварыРеализации КАК ВтТоварыРеализации
	|ГДЕ
	|	ВтТоварыРеализации.КодСтроки <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТоварыРеализации.КодСтроки,
	|	ВтТоварыРеализации.ЗаказКлиента,
	|	ВтТоварыРеализации.Номенклатура,
	|	ВтТоварыРеализации.Характеристика,
	|	ВтТоварыРеализации.Серия,
	|	ВтТоварыРеализации.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Регистратор КАК ЗаказКлиента,
	|	&ПорядокРасчетов КАК ПорядокРасчетов,
	|	ТоварыРеализации.Номенклатура КАК Номенклатура,
	|	ТоварыРеализации.Характеристика КАК Характеристика,
	|	ТоварыРеализации.КодСтроки КАК КодСтроки,
	|	ТоварыРеализации.Количество КАК Количество,
	|	ТоварыРеализации.Сумма КАК СуммаВзаиморасчетов,
	|	ТоварыРеализации.Склад КАК Склад,
	|	ТоварыРеализации.НомерСтроки КАК НомерСтроки,
	|	ТоварыРеализации.Упаковка КАК Упаковка,
	|	ТоварыРеализации.Серия КАК Серия,
	|	ТоварыРеализации.ВидЦены КАК ВидЦены,
	|	ТоварыРеализации.Количество КАК КоличествоВЗаказе,
	|	ТоварыРеализации.Цена КАК Цена,
	|	ТоварыРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыРеализации.Сумма КАК Сумма,
	|	ТоварыРеализации.СуммаНДС КАК СуммаНДС,
	|	ТоварыРеализации.СуммаСНДС КАК СуммаСНДС,
	|	ТоварыРеализации.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТоварыРеализации.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТоварыРеализации.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТоварыРеализации.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	ТоварыРеализации.НоменклатураНабора КАК НоменклатураНабора,
	|	ТоварыРеализации.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТоварыРеализации.Подразделение КАК Подразделение,
	|	ТоварыРеализации.КлючСвязи КАК КлючСвязи,
	|	СправочникНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
	|	СправочникНоменклатуры.КодТНВЭД КАК КодТНВЭД,
	|	Склады.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|		И Склады.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата КАК ИспользуетсяОрдернаяСхемаПриОтгрузке
	|ПОМЕСТИТЬ ВтТоварыРеализацииБезЗаказа
	|ИЗ
	|	ВтТоварыРеализации КАК ТоварыРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатуры
	|		ПО (СправочникНоменклатуры.Ссылка = ТоварыРеализации.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО (Склады.Ссылка = ТоварыРеализации.Склад)
	|ГДЕ
	|	ТоварыРеализации.КодСтроки = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.ЭтоЗаказКакСчет КАК ЭтоЗаказКакСчет
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
	|			ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
	|					И ЗаказКлиента.Контрагент = &Контрагент
	|					И ЗаказКлиента.Договор = &Договор
	|					И ЗаказКлиента.Организация = &Организация
	|					И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
	|					И ЗаказКлиента.Сделка = &Сделка
	|					И (ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
	|						ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
	|					И ВЫБОР
	|						КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|						ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
	|					КОНЕЦ = &НалогообложениеНДС
	|					И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.ЭтоЗаказКакСчет
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
	|			ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
	|					И ЗаказКлиента.Контрагент = &Контрагент
	|					И ЗаказКлиента.Договор = &Договор
	|					И ЗаказКлиента.Организация = &Организация
	|					И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
	|					И ЗаказКлиента.Сделка = &Сделка
	|					И (ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
	|						ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
	|					И ВЫБОР
	|						КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|						ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
	|					КОНЕЦ = &НалогообложениеНДС
	|					И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказы.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказы.Характеристика КАК Характеристика,
	|	ТаблицаЗаказы.КодСтроки КАК КодСтроки,
	|	ТаблицаЗаказы.Склад КАК Склад,
	|	ТаблицаЗаказы.Серия КАК Серия,
	|	СправочникНоменклатуры.КодТНВЭД КАК КодТНВЭД,
	|	СУММА(ТаблицаЗаказы.КОформлению) КАК Количество,
	|	СУММА(ТаблицаЗаказы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ТаблицаОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияОбороты.Распоряжение КАК ЗаказКлиента,
	|		РаспоряженияОбороты.Номенклатура КАК Номенклатура,
	|		РаспоряженияОбороты.Характеристика КАК Характеристика,
	|		РаспоряженияОбороты.КодСтроки КАК КодСтроки,
	|		РаспоряженияОбороты.Склад КАК Склад,
	|		РаспоряженияОбороты.Серия КАК Серия,
	|		РаспоряженияОбороты.КОформлениюОборот КАК КОформлению,
	|		РаспоряженияОбороты.СуммаОборот КАК Сумма
	|	ИЗ
	|		РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(
	|				,
	|				,
	|				,
	|				(Распоряжение, &ЭтоЗаказКакСчет) В
	|						(ВЫБРАТЬ
	|							ВТЗаказы.Ссылка,
	|							ВТЗаказы.ЭтоЗаказКакСчет
	|						ИЗ
	|							ВТЗаказы)
	|					И ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|							ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
	|									ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|						ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|					КОНЕЦ
	|					И Номенклатура.ВариантОформленияПродажи В (&МассивВариантовОформления)
	|					И (&НеОтбиратьПоОсобенностямУчета
	|						ИЛИ Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))) КАК РаспоряженияОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РаспоряженияДвижения.Распоряжение,
	|		РаспоряженияДвижения.Номенклатура,
	|		РаспоряженияДвижения.Характеристика,
	|		РаспоряженияДвижения.КодСтроки,
	|		РаспоряженияДвижения.Склад,
	|		РаспоряженияДвижения.Серия,
	|		-РаспоряженияДвижения.КОформлению,
	|		-РаспоряженияДвижения.Сумма
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РаспоряженияНаОтгрузку КАК РаспоряженияДвижения
	|	ГДЕ
	|		РаспоряженияДвижения.Регистратор = &Регистратор
	|		И (РаспоряженияДвижения.Распоряжение, &ЭтоЗаказКакСчет) В
	|				(ВЫБРАТЬ
	|					ВТЗаказы.Ссылка,
	|					ВТЗаказы.ЭтоЗаказКакСчет
	|				ИЗ
	|					ВТЗаказы)
	|		И РаспоряженияДвижения.Активность
	|		И ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|					ТОГДА РаспоряженияДвижения.Склад В ИЕРАРХИИ (&СкладРеализации)
	|							ИЛИ РаспоряженияДвижения.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИНАЧЕ РаспоряженияДвижения.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|			КОНЕЦ
	|		И РаспоряженияДвижения.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|		И (&НеОтбиратьПоОсобенностямУчета
	|				ИЛИ РаспоряженияДвижения.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказКлиентаТовары.Ссылка,
	|		ЗаказКлиентаТовары.Номенклатура,
	|		ЗаказКлиентаТовары.Характеристика,
	|		ЗаказКлиентаТовары.КодСтроки,
	|		ЗаказКлиентаТовары.Склад,
	|		ЗаказКлиентаТовары.Серия,
	|		ЗаказКлиентаТовары.Количество,
	|		ЗаказКлиентаТовары.СуммаСНДС
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		(ЗаказКлиентаТовары.Ссылка, &ЭтоЗаказКакСчет, ИСТИНА) В
	|				(ВЫБРАТЬ
	|					ВТЗаказы.Ссылка,
	|					ВТЗаказы.ЭтоЗаказКакСчет,
	|					ВТЗаказы.ЭтоЗаказКакСчет
	|				ИЗ
	|					ВТЗаказы)
	|		И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|		И (&НеОтбиратьПоОсобенностямУчета
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
	|		И НЕ ЗаказКлиентаТовары.Отменено
	|		И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
	|		И ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|					ТОГДА ЗаказКлиентаТовары.Склад В ИЕРАРХИИ (&СкладРеализации)
	|							ИЛИ ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИНАЧЕ ЗаказКлиентаТовары.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказКлиентаТовары.Ссылка,
	|		ЗаказКлиентаТовары.Номенклатура,
	|		ЗаказКлиентаТовары.Характеристика,
	|		ЗаказКлиентаТовары.КодСтроки,
	|		ЗаказКлиентаТовары.Склад,
	|		ЗаказКлиентаТовары.Серия,
	|		ЗаказКлиентаТовары.Количество,
	|		ЗаказКлиентаТовары.СуммаСНДС
	|	ИЗ
	|		Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		(ЗаказКлиентаТовары.Ссылка, &ЭтоЗаказКакСчет, ИСТИНА) В
	|				(ВЫБРАТЬ
	|					ВТЗаказы.Ссылка,
	|					ВТЗаказы.ЭтоЗаказКакСчет,
	|					ВТЗаказы.ЭтоЗаказКакСчет
	|				ИЗ
	|					ВТЗаказы)
	|		И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|		И (&НеОтбиратьПоОсобенностямУчета
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
	|		И НЕ ЗаказКлиентаТовары.Отменено
	|		И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления) КАК ТаблицаЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатуры
	|		ПО (СправочникНоменклатуры.Ссылка = ТаблицаЗаказы.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказы.ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура,
	|	ТаблицаЗаказы.Характеристика,
	|	ТаблицаЗаказы.КодСтроки,
	|	ТаблицаЗаказы.Склад,
	|	ТаблицаЗаказы.Серия,
	|	СправочникНоменклатуры.КодТНВЭД
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаЗаказы.КОформлению) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	КодСтроки,
	|	ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	ЗаказТовары.Ссылка.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
	|	ТаблицаОстатки.Количество КАК Количество,
	|	ТаблицаОстатки.Сумма КАК СуммаВзаиморасчетов,
	|	ТаблицаОстатки.Склад КАК Склад,
	|	ЕСТЬNULL(НакладнаяТовары.Количество, 0) КАК КоличествоВНакладной,
	|	ЗаказТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказТовары.Ссылка.Сделка КАК Сделка,
	|	ЗаказТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) КАК Упаковка,
	|	ЗаказТовары.Серия КАК Серия,
	|	ЗаказТовары.ВидЦены КАК ВидЦены,
	|	ЗаказТовары.Количество КАК КоличествоВЗаказе,
	|	ЗаказТовары.Цена КАК Цена,
	|	ЗаказТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &НалогообложениеНДСЭкспорт
	|			ТОГДА ТаблицаОстатки.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК КодТНВЭД,
	|	ЗаказТовары.Сумма КАК Сумма,
	|	ЗаказТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказТовары.СуммаСНДС КАК СуммаСНДС,
	|	ЗаказТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ЗаказТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ЗаказТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЗаказТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки, 
#Удаление
	|	ЗаказТовары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ЗаказТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ЗаказТовары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте, 
#КонецУдаления
	|	ЗаказТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЗаказТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	ЗаказТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЗаказТовары.Подразделение КАК Подразделение,
	|	ЗаказТовары.КлючСвязи КАК КлючСвязи,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1)
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаОстатки.Количество / ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1) КАК КоличествоУпаковок,
	|	ЗаказТовары.СрокПоставки КАК СрокПоставки,
	|	ЗаказТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ВЫБОР
	|		КОГДА ЗаказТовары.Обособленно
	|			ТОГДА ТаблицаОстатки.ЗаказКлиента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	ЗаказТоварыСклад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|		И ЗаказТоварыСклад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата КАК ОрдернаяСхемаПриОтгрузке,
	|	ВЫБОР
	|		КОГДА ЗаказТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЗаказТоварыСклад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|				И ЗаказТоварыСклад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата 
#Удаление
	|	КОНЕЦ КАК ПроверятьОтгрузку 
#КонецУдаления
#Вставка                                  
	|	КОНЕЦ КАК ПроверятьОтгрузку,  
	|	(ЗаказТовары.СуммаНачисленныхБонусныхБалловВВалюте*ТаблицаОстатки.Количество)/ЗаказТовары.Количество КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	(ЗаказТовары.СуммаБонусныхБалловКСписаниюВВалюте*ТаблицаОстатки.Количество)/ЗаказТовары.Количество КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	(ЗаказТовары.СуммаБонусныхБалловКСписанию*ТаблицаОстатки.Количество)/ЗаказТовары.Количество КАК СуммаБонусныхБалловКСписанию,
	|	ЗаказТовары.Распределять
#КонецВставки
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказТовары
	|		ПО ТаблицаОстатки.Номенклатура = ЗаказТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ЗаказТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ЗаказТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = ЗаказТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК ЗаказТоварыСклад
	|		ПО (ЗаказТоварыСклад.Ссылка = ЗаказТовары.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыРеализацииПоЗаказу КАК НакладнаяТовары
	|		ПО ТаблицаОстатки.Номенклатура = НакладнаяТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = НакладнаяТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = НакладнаяТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = НакладнаяТовары.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента,
	|	Заказ.ПорядокРасчетов,
	|	ТаблицаОстатки.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка),
	|	ТаблицаОстатки.Характеристика,
	|	ТаблицаОстатки.КодСтроки,
	|	ТаблицаОстатки.Количество,
	|	ТаблицаОстатки.Сумма,
	|	ТаблицаОстатки.Склад,
	|	ЕСТЬNULL(НакладнаяТовары.Количество, 0),
	|	ЗаказТовары.НомерСтроки,
	|	Заказ.Сделка,
	|	ЗаказТовары.ДатаОтгрузки,
	|	ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка),
	|	ЗаказТовары.Серия,
	|	ЗаказТовары.ВидЦены,
	|	ЗаказТовары.Количество,
	|	ЗаказТовары.Цена,
	|	ЗаказТовары.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &НалогообложениеНДСЭкспорт
	|			ТОГДА ТаблицаОстатки.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЗаказТовары.Сумма,
	|	ЗаказТовары.СуммаНДС,
	|	ЗаказТовары.СуммаСНДС,
	|	ЗаказТовары.ПроцентРучнойСкидки,
	|	ЗаказТовары.СуммаРучнойСкидки,
	|	ЗаказТовары.ПроцентАвтоматическойСкидки,
	|	ЗаказТовары.СуммаАвтоматическойСкидки, 
#Удаление
	|	ЗаказТовары.СуммаБонусныхБалловКСписанию,
	|	ЗаказТовары.СуммаБонусныхБалловКСписаниюВВалюте,
	|	ЗаказТовары.СуммаНачисленныхБонусныхБалловВВалюте, 
#КонецУдаления
	|	ЗаказТовары.Номенклатура.ТипНоменклатуры,
	|	ЗаказТовары.НоменклатураНабора,
	|	ЗаказТовары.ХарактеристикаНабора,
	|	ЗаказТовары.Подразделение,
	|	ЗаказТовары.КлючСвязи,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1)
	|	КОНЕЦ,
	|	ТаблицаОстатки.Количество / ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1),
	|	ЗаказТовары.СрокПоставки,
	|	ЗаказТовары.ВариантОбеспечения,
	|	ВЫБОР
	|		КОГДА ЗаказТовары.Обособленно
	|			ТОГДА ТаблицаОстатки.ЗаказКлиента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЗаказТовары.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|		И ЗаказТовары.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата,
	|	ВЫБОР
	|		КОГДА ЗаказТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЗаказТовары.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|				И ЗаказТовары.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
#Удаление		
	|	КОНЕЦ
#КонецУдаления
#Вставка 		
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0
#КонецВставки
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказТовары
	|		ПО ТаблицаОстатки.Номенклатура = ЗаказТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ЗаказТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ЗаказТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = ЗаказТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК Заказ
	|		ПО (Заказ.Ссылка = ЗаказТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыРеализацииПоЗаказу КАК НакладнаяТовары
	|		ПО ТаблицаОстатки.Номенклатура = НакладнаяТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = НакладнаяТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = НакладнаяТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = НакладнаяТовары.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыРеализации.ЗаказКлиента,
	|	ТоварыРеализации.ПорядокРасчетов,
	|	ТоварыРеализации.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка),
	|	ТоварыРеализации.Характеристика,
	|	ТоварыРеализации.КодСтроки,
	|	ТоварыРеализации.Количество,
	|	ТоварыРеализации.Сумма,
	|	ТоварыРеализации.Склад,
	|	ТоварыРеализации.Количество,
	|	ТоварыРеализации.НомерСтроки,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТоварыРеализации.Упаковка,
	|	ТоварыРеализации.Серия,
	|	ТоварыРеализации.ВидЦены,
	|	0,
	|	ТоварыРеализации.Цена,
	|	ТоварыРеализации.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &НалогообложениеНДСЭкспорт
	|			ТОГДА ТоварыРеализации.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТоварыРеализации.Сумма,
	|	ТоварыРеализации.СуммаНДС,
	|	ТоварыРеализации.СуммаСНДС,
	|	ТоварыРеализации.ПроцентРучнойСкидки,
	|	ТоварыРеализации.СуммаРучнойСкидки,
	|	ТоварыРеализации.ПроцентАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаАвтоматическойСкидки,
#Удаление		
	|	ТоварыРеализации.СуммаБонусныхБалловКСписанию,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТоварыРеализации.СуммаНачисленныхБонусныхБалловВВалюте, 
#КонецУдаления
    |	ТоварыРеализации.ТипНоменклатуры,
	|	ТоварыРеализации.НоменклатураНабора,
	|	ТоварыРеализации.ХарактеристикаНабора,
	|	ТоварыРеализации.Подразделение,
	|	ТоварыРеализации.КлючСвязи,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
	|	КОНЕЦ,
	|	ТоварыРеализации.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	ТоварыРеализации.ИспользуетсяОрдернаяСхемаПриОтгрузке,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТоварыРеализации.ИспользуетсяОрдернаяСхемаПриОтгрузке  
#Удаление			
	|	КОНЕЦ
#КонецУдаления     
#Вставка
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0
#КонецВставки
	|ИЗ
	|	ВтТоварыРеализацииБезЗаказа КАК ТоварыРеализации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОстатки.ЗаказКлиента,
	|	ЗаказТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивЗаказов)
	|	И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И ЗаказКлиентаТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиентаТовары.НомерСтроки
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивЗаказов)
	|	И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И ЗаказКлиентаТовары.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыОтгрузки
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
	|						ИЛИ ЗаказКлиента.Ссылка = &Регистратор
	|			ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
	|					И ЗаказКлиента.Контрагент = &Контрагент
	|					И ЗаказКлиента.Договор = &Договор
	|					И ЗаказКлиента.Организация = &Организация
	|					И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
	|					И ЗаказКлиента.Сделка = &Сделка
	|					И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|						ИЛИ ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов)
	|					И ВЫБОР
	|						КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|						ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
	|					КОНЕЦ = &НалогообложениеНДС
	|					И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|				ТОГДА ЗаказКлиента.Склад В ИЕРАРХИИ (&СкладРеализации)
	|						ИЛИ ЗаказКлиента.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ЗаказКлиента.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|					ИЛИ ВЫРАЗИТЬ(ЗаказКлиента.Склад КАК Справочник.Склады).ЭтоГруппа
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаявкаНаВозвратТоваровОтКлиента.Ссылка В (&МассивЗаказов)
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Ссылка = &Регистратор
	|			ИНАЧЕ ЗаявкаНаВозвратТоваровОтКлиента.Партнер = &Партнер
	|					И ЗаявкаНаВозвратТоваровОтКлиента.Контрагент = &Контрагент
	|					И ЗаявкаНаВозвратТоваровОтКлиента.Договор = &Договор
	|					И ЗаявкаНаВозвратТоваровОтКлиента.Организация = &Организация
	|					И ЗаявкаНаВозвратТоваровОтКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Соглашение = &Соглашение)
	|					И ЗаявкаНаВозвратТоваровОтКлиента.Сделка = &Сделка
	|					И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Валюта = &ВалютаВзаиморасчетов)
	|					И ЗаявкаНаВозвратТоваровОтКлиента.НалогообложениеНДС = &НалогообложениеНДС
	|					И ЗаявкаНаВозвратТоваровОтКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И ЗаявкаНаВозвратТоваровОтКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|				ТОГДА ЗаявкаНаВозвратТоваровОтКлиента.Склад В ИЕРАРХИИ (&СкладРеализации)
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ЗаявкаНаВозвратТоваровОтКлиента.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА РеализацияТоваровУслуг.Ссылка В (&МассивЗаказов)
	|						ИЛИ РеализацияТоваровУслуг.Ссылка = &Регистратор
	|			ИНАЧЕ РеализацияТоваровУслуг.Партнер = &Партнер
	|					И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|					И РеализацияТоваровУслуг.Договор = &Договор
	|					И РеализацияТоваровУслуг.Организация = &Организация
	|					И РеализацияТоваровУслуг.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ РеализацияТоваровУслуг.Соглашение = &Соглашение)
	|					И РеализацияТоваровУслуг.Сделка = &Сделка
	|					И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|						ИЛИ РеализацияТоваровУслуг.Валюта = &ВалютаВзаиморасчетов)
	|					И РеализацияТоваровУслуг.НалогообложениеНДС = &НалогообложениеНДС
	|					И РеализацияТоваровУслуг.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И РеализацияТоваровУслуг.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ РеализацияТоваровУслуг.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|	И РеализацияТоваровУслуг.Ссылка = &Регистратор
	|	И ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|				ТОГДА РеализацияТоваровУслуг.Склад В ИЕРАРХИИ (&СкладРеализации)
	|						ИЛИ РеализацияТоваровУслуг.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ РеализацияТоваровУслуг.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НоменклатураСВариантомОформления
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|	И (&НеОтбиратьПоОсобенностямУчета
	|			ИЛИ Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	(ЗаказКлиента.Ссылка, &ЭтоЗаказКакСчет) В
	|			(ВЫБРАТЬ
	|				ВТЗаказы.Ссылка,
	|				ВТЗаказы.ЭтоЗаказКакСчет
	|			ИЗ
	|				ВТЗаказы)
	|	И ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|				ТОГДА ЗаказКлиента.Склад В ИЕРАРХИИ (&СкладРеализации)
	|						ИЛИ ЗаказКлиента.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ЗаказКлиента.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказы.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказы.Характеристика КАК Характеристика,
	|	ТаблицаЗаказы.Склад КАК Склад,
	|	ТаблицаЗаказы.ОрдернаяСхемаПриОтгрузке КАК ОрдернаяСхемаПриОтгрузке,
	|	ТаблицаЗаказы.Серия КАК Серия,
	|	ТаблицаЗаказы.Назначение КАК Назначение,
	|	СУММА(ТаблицаЗаказы.КоличествоСобирается) КАК КоличествоСобирается,
	|	СУММА(ТаблицаЗаказы.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ЗаказКлиента,
	|		ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|		ТоварыКОтгрузкеОстатки.Склад КАК Склад,
	|		ВЫБОР
	|			КОГДА ТоварыКОтгрузкеОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|					И ТоварыКОтгрузкеОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ОрдернаяСхемаПриОтгрузке,
	|		ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|		ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
	|		ТоварыКОтгрузкеОстатки.СобираетсяПриход КАК КоличествоСобирается,
	|		ТоварыКОтгрузкеОстатки.КОтгрузкеРасход + ТоварыКОтгрузкеОстатки.СобраноПриход КАК Количество
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
	|				,
	|				,
	|				,
	|				,
	|				ДокументОтгрузки В
	|						(ВЫБРАТЬ
	|							ДокументыОтгрузки.Ссылка
	|						ИЗ
	|							ДокументыОтгрузки)
	|					И ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|							ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
	|									ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|						ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|					КОНЕЦ
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураСВариантомОформления.Ссылка
	|						ИЗ
	|							НоменклатураСВариантомОформления)) КАК ТоварыКОтгрузкеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
	|		ТоварыКОтгрузкеОстатки.Номенклатура,
	|		ТоварыКОтгрузкеОстатки.Характеристика,
	|		ТоварыКОтгрузкеОстатки.Склад,
	|		(ТоварыКОтгрузкеОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|			И ТоварыКОтгрузкеОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата),
	|		ТоварыКОтгрузкеОстатки.Серия,
	|		ТоварыКОтгрузкеОстатки.Назначение,
	|		ТоварыКОтгрузкеОстатки.СобираетсяПриход,
	|		- ТоварыКОтгрузкеОстатки.КОтгрузкеПриход
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
	|				,
	|				,
	|				Регистратор,
	|				,
	|				ДокументОтгрузки В
	|						(ВЫБРАТЬ
	|							ДокументыОтгрузки.Ссылка
	|						ИЗ
	|							ДокументыОтгрузки)
	|					И ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|							ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
	|									ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|						ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|					КОНЕЦ
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураСВариантомОформления.Ссылка
	|						ИЗ
	|							НоменклатураСВариантомОформления)) КАК ТоварыКОтгрузкеОстатки
	|	ГДЕ ТоварыКОтгрузкеОстатки.Регистратор ССЫЛКА Документ.АктОРасхожденияхПослеОтгрузки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказыОстатки.Распоряжение,
	|		ЗаказыОстатки.Номенклатура,
	|		ЗаказыОстатки.Характеристика,
	|		ЗаказыОстатки.Склад,
	|		ВЫБОР
	|			КОГДА ЗаказыОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|					И ЗаказыОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ЗаказыОстатки.Серия,
	|		ВЫБОР
	|			КОГДА ЗаказТовары.Обособленно
	|				ТОГДА ЗаказТовары.Ссылка.Назначение
	|			КОГДА ЗаказТоварыЗамена.Обособленно
	|				ТОГДА ЗаказТоварыЗамена.Ссылка.Назначение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		КОНЕЦ,
	|		0,
	|		ЗаказыОстатки.КОформлениюОборот
	|	ИЗ
	|		РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(
	|				,
	|				,
	|				РЕГИСТРАТОР,
	|				Распоряжение В
	|						(ВЫБРАТЬ
	|							ЗаказКлиента.Ссылка
	|						ИЗ
	|							ЗаказКлиента)
	|					И ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|							ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
	|									ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|						ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|					КОНЕЦ
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураСВариантомОформления.Ссылка
	|						ИЗ
    |							НоменклатураСВариантомОформления)
	|					И ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход)) КАК ЗаказыОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказТовары
	|			ПО ЗаказыОстатки.Номенклатура = ЗаказТовары.Номенклатура
	|				И ЗаказыОстатки.Характеристика = ЗаказТовары.Характеристика
	|				И ЗаказыОстатки.КодСтроки = ЗаказТовары.КодСтроки
	|				И ЗаказыОстатки.Распоряжение = ЗаказТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказТоварыЗамена
	|			ПО ЗаказыОстатки.Номенклатура = ЗаказТоварыЗамена.Номенклатура
	|				И ЗаказыОстатки.Характеристика = ЗаказТоварыЗамена.Характеристика
	|				И ЗаказыОстатки.КодСтроки = ЗаказТоварыЗамена.КодСтроки
	|				И ЗаказыОстатки.Распоряжение = ЗаказТоварыЗамена.Ссылка
	|	ГДЕ
	|		ЗаказыОстатки.Регистратор <> &Регистратор) КАК ТаблицаЗаказы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказы.ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура,
	|	ТаблицаЗаказы.Характеристика,
	|	ТаблицаЗаказы.Склад,
	|	ТаблицаЗаказы.ОрдернаяСхемаПриОтгрузке,
	|	ТаблицаЗаказы.Серия,
	|	ТаблицаЗаказы.Назначение
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаЗаказы.Количество) > 0
	|		ИЛИ СУММА(ТаблицаЗаказы.КоличествоСобирается) > 0)";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"НакладнаяТовары.Упаковка",
	"НакладнаяТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЗаказТовары.Упаковка",
	"ЗаказТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки3",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ТоварыРеализации.Упаковка",
	"ТоварыРеализации.Номенклатура"));

	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.ВыполнитьПакет();

КонецФункции

&ИзменениеИКонтроль("ЗаполнитьПоОстаткамЗаказов")
Процедура Док_ЗаполнитьПоОстаткамЗаказов(ДанныеОтбора, Товары, СкидкиНаценки, НачислениеБонусныхБаллов, СкладРеализации, МассивЗаказов, ПараметрыЗаполнения, ШтрихкодыУпаковок)

	ВариантОформления = Неопределено;
	ОтображатьСообщение = Истина;
	ПодборПоЗаказамОрдерам = Ложь;
	ПараметрыОформления    = Неопределено;
	ОрдернаяСхемаПриОтгрузке = Ложь;
	ИспользоватьРасширенныеВозможностиЗаказаКлиента = Неопределено;
	Если Товары.Количество() > 0 Тогда
		Колонки = Товары[0];
	Иначе
		Колонки = Товары.Выгрузить().Колонки;
	КонецЕсли;
	ЕстьРеквизитНоменклатураНабора = ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Колонки, "НоменклатураНабора");
	ЕстьРеквизитИндексНабора = ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Колонки, "ИндексНабора");

	ПараметрыЗаполнения.Свойство("ВариантОформления", ВариантОформления);
	Если ПараметрыЗаполнения.Свойство("ОтображатьСообщение") Тогда 
		ОтображатьСообщение = ПараметрыЗаполнения.ОтображатьСообщение;
	КонецЕсли;
	Если ПараметрыЗаполнения.Свойство("ПодборПоЗаказамОрдерам") Тогда 
		ПодборПоЗаказамОрдерам = ПараметрыЗаполнения.ПодборПоЗаказамОрдерам;
	КонецЕсли;
	Если ПараметрыЗаполнения.Свойство("ПараметрыОформления", ПараметрыОформления) Тогда
		Если ПараметрыОформления <> Неопределено Тогда
			ЗаполнениеПоЗаказам = ПараметрыОформления.ПоЗаказам;
			ЗаполнениеПоОрдерам = ПараметрыОформления.ПоОрдерам;
		КонецЕсли;
	КонецЕсли;

	Если Не ПараметрыЗаполнения.Свойство("ОрдернаяСхемаПриОтгрузке", ОрдернаяСхемаПриОтгрузке) Тогда 
		ОрдернаяСхемаПриОтгрузке = СкладыСервер.ЕстьОрдерныйНаОтгрузкуСклад(, , СкладРеализации);
	КонецЕсли;

	Если Не ПараметрыЗаполнения.Свойство("ИспользоватьРасширенныеВозможностиЗаказаКлиента",
		ИспользоватьРасширенныеВозможностиЗаказаКлиента) Тогда
		ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	КонецЕсли;

	ПроверятьПорядокРасчетов = Истина;

	Если ПараметрыЗаполнения.Свойство("ПроверятьПорядокРасчетов") Тогда 
		ПроверятьПорядокРасчетов = ПараметрыЗаполнения.ПроверятьПорядокРасчетов;
	КонецЕсли;

	// Данные по остаткам товаров заказа
	РезультатЗапросаПоОстаткамЗаказов = ПолучитьРезультатЗапросаПоОстаткамЗаказов(
	ДанныеОтбора,
	ПараметрыЗаполнения,
	СкладРеализации,
	МассивЗаказов);

	Если РезультатЗапросаПоОстаткамЗаказов[5].Пустой() 
		И РезультатЗапросаПоОстаткамЗаказов[6].Пустой() 
		И ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента")
		И ОтображатьСообщение Тогда

		ТекстОшибки = ПродажиСервер.ТекстОшибкиНетТоваровДоступныхДляОтгрузки(ВариантОформления);
		ВызватьИсключение ТекстОшибки;

	КонецЕсли;

	МассивЗаказовКлиентов = Новый Массив();
	МассивПорядковРасчетов = Новый Массив();
	ВыборкаТовары = РезультатЗапросаПоОстаткамЗаказов[5].Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		Если МассивЗаказовКлиентов.Найти(ВыборкаТовары.ЗаказКлиента) = Неопределено Тогда
			МассивЗаказовКлиентов.Добавить(ВыборкаТовары.ЗаказКлиента);
		КонецЕсли;
		Если ПроверятьПорядокРасчетов
			И ЗначениеЗаполнено(ВыборкаТовары.ПорядокРасчетов)
			И МассивПорядковРасчетов.Найти(ВыборкаТовары.ПорядокРасчетов) = Неопределено Тогда
			МассивПорядковРасчетов.Добавить(ВыборкаТовары.ПорядокРасчетов);
		КонецЕсли;
	КонецЦикла;

	Если МассивЗаказов = Неопределено
		И ПроверятьПорядокРасчетов 
		И МассивПорядковРасчетов.Количество() > 1 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='У найденных заказов отличается поле ""Порядок расчетов""'"));
		Возврат;
	КонецЕсли;

	// Получение таблицы скидок/наценок
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СкидкиНаценки.Ссылка КАК ЗаказКлиента,
	|	СкидкиНаценки.КлючСвязи КАК КлючСвязи,
	|	СкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	СкидкиНаценки.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаказКлиента.СкидкиНаценки КАК СкидкиНаценки
	|ГДЕ
	|	СкидкиНаценки.Ссылка В (&МассивЗаказовКлиентов)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	СкидкиНаценки.Ссылка КАК ЗаказКлиента,
	|	СкидкиНаценки.КлючСвязи КАК КлючСвязи,
	|	СкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	СкидкиНаценки.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.СкидкиНаценки КАК СкидкиНаценки
	|ГДЕ
	|	СкидкиНаценки.Ссылка В (&МассивЗаказовКлиентов)
	|";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивЗаказовКлиентов", МассивЗаказовКлиентов);
	СкидкиНаценкиЗаказа = Запрос.Выполнить().Выгрузить();

	// Очистка таблицы скидок/наценок текущего объекта
	СкидкиНаценки.Очистить();

	ИспользоватьБонусныеПрограммыЛояльности = ПолучитьФункциональнуюОпцию("ИспользоватьБонусныеПрограммыЛояльности");

	Если ИспользоватьБонусныеПрограммыЛояльности Тогда

		// Получение таблицы бонусных баллов
		ТекстЗапроса =
		"ВЫБРАТЬ 
		|	ТабличнаяЧасть.Ссылка КАК ЗаказКлиента,
		|	ТабличнаяЧасть.КлючСвязи КАК КлючСвязи,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов КАК ВалютаКонвертацииБонусов,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту КАК КурсКонвертацииБонусовВВалюту,
	    |	ДОБАВИТЬКДАТЕ(ТабличнаяЧасть.ДатаНачисления, ДЕНЬ,
		|		РАЗНОСТЬДАТ(
		|			НАЧАЛОПЕРИОДА(ТабличнаяЧасть.Ссылка.Дата, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		|			ДЕНЬ)
		|	) КАК ДатаНачисления,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.ДатаСписания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТабличнаяЧасть.ДатаСписания
		|		ИНАЧЕ
		|			ДОБАВИТЬКДАТЕ(
		|				ТабличнаяЧасть.ДатаСписания,
		|				ДЕНЬ,
		|				РАЗНОСТЬДАТ(
		|					НАЧАЛОПЕРИОДА(ТабличнаяЧасть.Ссылка.Дата, ДЕНЬ),
		|					НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		|					ДЕНЬ))
		|	КОНЕЦ КАК ДатаСписания,
		|	ТабличнаяЧасть.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЗаказКлиента.НачислениеБонусныхБаллов КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка В (&МассивЗаказовКлиентов)
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.Ссылка,
		|	ТабличнаяЧасть.КлючСвязи,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту,
		|	ТабличнаяЧасть.ДатаНачисления,
		|	ТабличнаяЧасть.ДатаСписания,
		|	ТабличнаяЧасть.СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.НачислениеБонусныхБаллов КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка В (&МассивЗаказовКлиентов)
		|";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("МассивЗаказовКлиентов", МассивЗаказовКлиентов);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		НачислениеБонусныхБалловЗаказа = Запрос.Выполнить().Выгрузить();

		БонуснаяПрограммаЛояльности = Новый Структура("БонуснаяПрограммаЛояльности, 
		|ВалютаКонвертацииБонусов, 
		|КурсКонвертацииБонусовВВалюту,
		|СтруктураКурсовВалютыКонвертации");

		БонусныеПрограммыЛояльности = НачислениеБонусныхБалловЗаказа.Скопировать();

		БонусныеПрограммыЛояльности.Свернуть("БонуснаяПрограммаЛояльности, 
		|ВалютаКонвертацииБонусов, 
		|КурсКонвертацииБонусовВВалюту");

		Если БонусныеПрограммыЛояльности.Количество() > 1
			И ОтображатьСообщение Тогда

			ТекстОшибки = НСтр("ru='Обнаружены разные программы лояльности для начисления бонусных баллов. Заказы 
			|с разными бонусными программами лояльности не могут быть отгружены в одном документе.'");
			ВызватьИсключение ТекстОшибки;
		ИначеЕсли БонусныеПрограммыЛояльности.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(БонуснаяПрограммаЛояльности, БонусныеПрограммыЛояльности[0]);

			БонуснаяПрограммаЛояльности.СтруктураКурсовВалютыКонвертации = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов, 
			ТекущаяДатаСеанса(),
			ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеОтбора.Организация));

		КонецЕсли;

	КонецЕсли;

	// Очистка таблицы бонусных баллов текущего объекта
	НачислениеБонусныхБаллов.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаказовКлиентов", МассивЗаказовКлиентов);
	Запрос.УстановитьПараметр("ВалютаДокумента",       ДанныеОтбора.Валюта);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ТаблицаЗаказов.Дата, ДЕНЬ) КАК Дата,
	|	ТаблицаЗаказов.Ссылка КАК ЗаказКлиента,
	|	ТаблицаЗаказов.Валюта КАК Валюта,
	|	ТаблицаЗаказов.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаказов.Валюта <> &ВалютаДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПересчитатьВВалютуДокумента,
	|	ТаблицаЗаказов.ЭтоЗаказКакСчет КАК ЭтоЗаказКакСчет
	|ИЗ
	|	Документ.ЗаказКлиента КАК ТаблицаЗаказов
	|ГДЕ
	|	ТаблицаЗаказов.Ссылка В(&МассивЗаказовКлиентов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТаблицаЗаказов.Дата, ДЕНЬ),
	|	ТаблицаЗаказов.Ссылка,
	|	ТаблицаЗаказов.Валюта,
	|	ТаблицаЗаказов.ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаказов.Валюта <> &ВалютаДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТаблицаЗаказов.ЭтоЗаказКакСчет КАК ЭтоЗаказКакСчет
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ТаблицаЗаказов
	|ГДЕ
	|	ТаблицаЗаказов.Ссылка В(&МассивЗаказовКлиентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ОбъединеннаяТаблицаЗаказов.Дата, ДЕНЬ) КАК Дата,
	|	ОбъединеннаяТаблицаЗаказов.Валюта КАК Валюта,
	|	ОбъединеннаяТаблицаЗаказов.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТаблицаЗаказов.Дата, ДЕНЬ) КАК Дата,
	|		ТаблицаЗаказов.Валюта КАК Валюта,
	|		ТаблицаЗаказов.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|	ИЗ
	|		Документ.ЗаказКлиента КАК ТаблицаЗаказов
	|	ГДЕ
	|		ТаблицаЗаказов.Ссылка В(&МассивЗаказовКлиентов)
	|		И ТаблицаЗаказов.Валюта <> &ВалютаДокумента
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТаблицаЗаказов.Дата, ДЕНЬ),
	|		ТаблицаЗаказов.Валюта,
	|		ТаблицаЗаказов.Организация.ВалютаРегламентированногоУчета
	|	ИЗ
	|		Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ТаблицаЗаказов
	|	ГДЕ
	|		ТаблицаЗаказов.Ссылка В(&МассивЗаказовКлиентов)
	|		И ТаблицаЗаказов.Валюта <> &ВалютаДокумента) КАК ОбъединеннаяТаблицаЗаказов";

	МассивРезультатов = Запрос.ВыполнитьПакет();

	РезультатРеквизитыЗаказов = МассивРезультатов[0]; // РезультатЗапроса
	РезультатВыборка = МассивРезультатов[1]; // РезультатЗапроса

	РеквизитыЗаказов = РезультатРеквизитыЗаказов.Выбрать();

	ТаблицаКурсовВалют = Новый ТаблицаЗначений;
	ТаблицаКурсовВалют.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаКурсовВалют.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаКурсовВалют.Колонки.Добавить("КурсЧислитель", Новый ОписаниеТипов("Число"));
	ТаблицаКурсовВалют.Колонки.Добавить("КурсЗнаменатель", Новый ОписаниеТипов("Число"));

	Выборка = РезультатВыборка.Выбрать();

	Пока Выборка.Следующий() Цикл

		НоваяСтрока = ТаблицаКурсовВалют.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);

		Если ПараметрыЗаполнения.Свойство("КурсЧислитель") И НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.КурсЧислитель) Тогда
			КурсыВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(Выборка.Валюта, Выборка.Дата, Выборка.ВалютаРегламентированногоУчета);
			НоваяСтрока.КурсЧислитель = КурсыВалюты.КурсЧислитель;
			НоваяСтрока.КурсЗнаменатель = КурсыВалюты.КурсЗнаменатель;
		Иначе
			НоваяСтрока.КурсЧислитель = ПараметрыЗаполнения.КурсЧислитель;
			НоваяСтрока.КурсЗнаменатель = ПараметрыЗаполнения.КурсЗнаменатель;
		КонецЕсли;

	КонецЦикла;

	Если ТаблицаКурсовВалют.Количество() > 0 Тогда
		СтруктураКурсовНовойВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ДанныеОтбора.Валюта, ТекущаяДатаСеанса(),
		ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеОтбора.Организация));
	КонецЕсли;

	ПорядокОформления = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();

	ЗаполнятьПоОрдеру = 
	(ПорядокОформления = Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаОрдера
	И Не ПодборПоЗаказамОрдерам
	И ИспользоватьРасширенныеВозможностиЗаказаКлиента);

	Если ПараметрыОформления <> Неопределено Тогда
		ЗаполнятьПоОрдеру = ЗаполнениеПоОрдерам И НЕ ЗаполнениеПоЗаказам;
	КонецЕсли;

	ОтгруженныеМарки = Неопределено;
	ОтгруженныеТовары = РезультатЗапросаПоОстаткамЗаказов[10].Выгрузить();

	Если ОрдернаяСхемаПриОтгрузке Тогда

		РеализацияТоваровУслугЛокализация.СформироватьОтгруженныеМарки(МассивЗаказовКлиентов, ОтгруженныеМарки);
		РеализацияТоваровУслугЛокализация.ИсключитьРеализованныеМарки(МассивЗаказовКлиентов, ОтгруженныеМарки);

	КонецЕсли;

	ПроверитьСклады = Неопределено;
	ПараметрыЗаполнения.Свойство("ПроверитьСклады", ПроверитьСклады);

	ВыборкаТовары.Сбросить();
	Пока ВыборкаТовары.Следующий() Цикл

		НайденныеОтгруженныеМарки = Неопределено;

		Если ЗначениеЗаполнено(ПроверитьСклады) Тогда
			СкладыПоСсылке = ПроверитьСклады.Получить(ВыборкаТовары.ЗаказКлиента);
			Если СкладыПоСсылке <> Неопределено
				И СкладыПоСсылке.Найти(ВыборкаТовары.Склад) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		КоличествоКОтгрузке = ВыборкаТовары.Количество;
		ЗаполнениеПоОрдеру = ЗаполнятьПоОрдеру И ВыборкаТовары.ПроверятьОтгрузку;
		Если ЗаполнениеПоОрдеру Тогда

			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("ЗаказКлиента", ВыборкаТовары.ЗаказКлиента);
			ПараметрыПоиска.Вставить("Номенклатура", ВыборкаТовары.Номенклатура);
			ПараметрыПоиска.Вставить("Характеристика", ВыборкаТовары.Характеристика);
			ПараметрыПоиска.Вставить("Склад", ВыборкаТовары.Склад);
			ПараметрыПоиска.Вставить("Серия", ВыборкаТовары.Серия);
			ПараметрыПоиска.Вставить("Назначение", ВыборкаТовары.Назначение);

			НайденныеСтроки = ОтгруженныеТовары.НайтиСтроки(ПараметрыПоиска);

			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;

			ОтгруженнаяСтрока = НайденныеСтроки[0];

			Если ОтгруженнаяСтрока.Количество > 0 Тогда

				Если НЕ ОтгруженныеМарки = Неопределено Тогда
					ПараметрыПоискаМарок = Новый Структура();
					ПараметрыПоискаМарок.Вставить("ЗаказКлиента", ПараметрыПоиска.ЗаказКлиента);
					ПараметрыПоискаМарок.Вставить("Номенклатура", ПараметрыПоиска.Номенклатура);
					ПараметрыПоискаМарок.Вставить("Характеристика", ПараметрыПоиска.Характеристика);
					ПараметрыПоискаМарок.Вставить("Склад", ПараметрыПоиска.Склад);
					ПараметрыПоискаМарок.Вставить("Серия", ПараметрыПоиска.Серия);

					НайденныеОтгруженныеМарки = ОтгруженныеМарки.НайтиСтроки(ПараметрыПоискаМарок);
				КонецЕсли; 

				Если ОтгруженнаяСтрока.Количество < ВыборкаТовары.Количество Тогда
					КоличествоКОтгрузке = ОтгруженнаяСтрока.Количество;
					ОтгруженнаяСтрока.Количество = 0;
				Иначе
					КоличествоКОтгрузке = ВыборкаТовары.Количество;
					ОтгруженнаяСтрока.Количество = ОтгруженнаяСтрока.Количество - ВыборкаТовары.Количество;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;

		КонецЕсли;

		СтавкаНДСТовара = ВыборкаТовары.СтавкаНДС;

		ПересчитатьСуммы = (КоличествоКОтгрузке <> ВыборкаТовары.КоличествоВЗаказе);

		ИсключитьСвойства = "Количество";

		Если ПересчитатьСуммы Тогда
			// Если необходимо пересчитать суммы, то перечисленные реквизиты будут пересчитаны на основе суммы взаиморасчетов.
			ИсключитьСвойства = ИсключитьСвойства + ", Сумма, СуммаНДС, СуммаАвтоматическойСкидки, СуммаРучнойСкидки";
		КонецЕсли;

		СтрокаТаб = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаб, ВыборкаТовары, , ИсключитьСвойства);
		СтрокаТаб.СтавкаНДС = СтавкаНДСТовара;

		СтрокаТаб.Количество = КоличествоКОтгрузке;

		СтрокаТаб.КоличествоУпаковок = КоличествоКОтгрузке / ВыборкаТовары.Коэффициент;

		Если ПодборПоЗаказамОрдерам Тогда

			СтрокаТаб.КоличествоВЗаказе = ?(ВыборкаТовары.КодСтроки <> 0, КоличествоКОтгрузке, 0);
			СтрокаТаб.КоличествоУпаковокВЗаказе = ?(ВыборкаТовары.КодСтроки<> 0, КоличествоКОтгрузке, 0) / ВыборкаТовары.Коэффициент;

			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("ЗаказКлиента", ВыборкаТовары.ЗаказКлиента);
			ПараметрыПоиска.Вставить("Номенклатура", ВыборкаТовары.Номенклатура);
			ПараметрыПоиска.Вставить("Характеристика", ВыборкаТовары.Характеристика);
			ПараметрыПоиска.Вставить("Склад", ВыборкаТовары.Склад);
			ПараметрыПоиска.Вставить("Серия", ВыборкаТовары.Серия);
			ПараметрыПоиска.Вставить("Назначение", ВыборкаТовары.Назначение);

			НайденныеСтроки = ОтгруженныеТовары.НайтиСтроки(ПараметрыПоиска);

			Если НайденныеСтроки.Количество() > 0 Тогда

				ОтгруженнаяСтрока = НайденныеСтроки[0];

				Если ОтгруженнаяСтрока.КоличествоСобирается > 0 Тогда
					СтрокаТаб.КоличествоСобирается = ОтгруженнаяСтрока.КоличествоСобирается / ВыборкаТовары.Коэффициент;
					ОтгруженнаяСтрока.КоличествоСобирается = 0;
				КонецЕсли;

				Если ОтгруженнаяСтрока.Количество > 0 Тогда
					Если ОтгруженнаяСтрока.Количество <= ВыборкаТовары.Количество Тогда
						СтрокаТаб.КоличествоВОрдере = ОтгруженнаяСтрока.Количество;
						СтрокаТаб.КоличествоУпаковокВОрдере = ОтгруженнаяСтрока.Количество / ВыборкаТовары.Коэффициент;
						ОтгруженнаяСтрока.Количество = 0;
						ОтгруженныеТовары.Удалить(ОтгруженнаяСтрока);
					Иначе
						СтрокаТаб.КоличествоВОрдере = ВыборкаТовары.Количество;
						СтрокаТаб.КоличествоУпаковокВОрдере =ВыборкаТовары.Количество / ВыборкаТовары.Коэффициент;
						ОтгруженнаяСтрока.Количество = ОтгруженнаяСтрока.Количество - ВыборкаТовары.Количество;
					КонецЕсли;

					Если НЕ ОтгруженныеМарки = Неопределено И СтрокаТаб.ОрдернаяСхемаПриОтгрузке Тогда
						ПараметрыПоискаМарок = Новый Структура();
						ПараметрыПоискаМарок.Вставить("ЗаказКлиента", ПараметрыПоиска.ЗаказКлиента);
						ПараметрыПоискаМарок.Вставить("Номенклатура", ПараметрыПоиска.Номенклатура);
						ПараметрыПоискаМарок.Вставить("Характеристика", ПараметрыПоиска.Характеристика);
						ПараметрыПоискаМарок.Вставить("Склад", ПараметрыПоиска.Склад);
						ПараметрыПоискаМарок.Вставить("Серия", ПараметрыПоиска.Серия);

						НайденныеОтгруженныеМарки = ОтгруженныеМарки.НайтиСтроки(ПараметрыПоискаМарок);
					КонецЕсли; 

					Если СтрокаТаб.КоличествоУпаковокВОрдере > 0 И Не НайденныеОтгруженныеМарки = Неопределено Тогда
						ОсталосьРаспределитьМарок = СтрокаТаб.КоличествоУпаковокВОрдере;
						Для каждого Марка Из НайденныеОтгруженныеМарки Цикл
							Если ОсталосьРаспределитьМарок = 0 Тогда
								Прервать;
							КонецЕсли; 

							СтрокаТабМарки = ШтрихкодыУпаковок.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаТабМарки, СтрокаТаб);
							СтрокаТабМарки.ШтрихкодУпаковки = Марка.ШтрихкодУпаковки;
							СтрокаТабМарки.ИзОрдера = Истина;

							ОсталосьРаспределитьМарок = ОсталосьРаспределитьМарок  - 1;
							ОтгруженныеМарки.Удалить(Марка);
						КонецЦикла; 
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если СтрокаТаб.КоличествоУпаковок > 0 И Не НайденныеОтгруженныеМарки = Неопределено Тогда
				ОсталосьРаспределитьМарок = СтрокаТаб.КоличествоУпаковок;
				Для каждого Марка Из НайденныеОтгруженныеМарки Цикл
					Если ОсталосьРаспределитьМарок = 0 Тогда
						Прервать;
					КонецЕсли; 

					СтрокаТабМарки = ШтрихкодыУпаковок.Добавить();
					СтрокаТабМарки.ШтрихкодУпаковки = Марка.ШтрихкодУпаковки;

					ОсталосьРаспределитьМарок = ОсталосьРаспределитьМарок  - 1;
					ОтгруженныеМарки.Удалить(Марка);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;

		Если ПересчитатьСуммы Тогда
			Если ЗаполнениеПоОрдеру Тогда
				СтрокаТаб.СуммаВзаиморасчетов = СтрокаТаб.СуммаВзаиморасчетов * КоличествоКОтгрузке / ВыборкаТовары.Количество;
			КонецЕсли;
			СтрокаТаб.СуммаСНДС = СтрокаТаб.СуммаВзаиморасчетов;
		КонецЕсли;

		РеквизитыЗаказов.Сбросить();
		ЗаказНайден = РеквизитыЗаказов.НайтиСледующий(СтрокаТаб.ЗаказКлиента, "ЗаказКлиента");

		ПараметрыОтбора = Новый Структура("Валюта,Дата", РеквизитыЗаказов.Валюта, РеквизитыЗаказов.Дата);
		КурсВалюты = ТаблицаКурсовВалют.НайтиСтроки(ПараметрыОтбора);

		Если ЗаказНайден И РеквизитыЗаказов.ПересчитатьВВалютуДокумента Тогда

			Если КурсВалюты.Количество() = 1 Тогда

				СтрокаТаб.Цена = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				СтрокаТаб.Цена,
				КурсВалюты[0],
				СтруктураКурсовНовойВалюты);
				СтрокаТаб.СуммаСНДС = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				СтрокаТаб.СуммаСНДС,
				КурсВалюты[0],
				СтруктураКурсовНовойВалюты);
				ПересчитатьСуммы = Истина;
			КонецЕсли;

		КонецЕсли;

		КоэффициентПересчетаСкидки = ?(ПересчитатьСуммы, СтрокаТаб.Количество / ?(ВыборкаТовары.КоличествоВЗаказе<>0,ВыборкаТовары.КоличествоВЗаказе,1), 1);
		Если КоэффициентПересчетаСкидки <> 1 Тогда
			СтрокаТаб.СуммаАвтоматическойСкидки = ОКР(ВыборкаТовары.СуммаАвтоматическойСкидки * КоэффициентПересчетаСкидки,2);
			СтрокаТаб.СуммаРучнойСкидки = ОКР(ВыборкаТовары.СуммаРучнойСкидки * КоэффициентПересчетаСкидки,2);

			СтрокаТаб.СуммаБонусныхБалловКСписанию = ОКР(ВыборкаТовары.СуммаБонусныхБалловКСписанию * КоэффициентПересчетаСкидки,2);
			СтрокаТаб.СуммаБонусныхБалловКСписаниюВВалюте = ОКР(ВыборкаТовары.СуммаБонусныхБалловКСписаниюВВалюте * КоэффициентПересчетаСкидки,2);
			СтрокаТаб.СуммаНачисленныхБонусныхБалловВВалюте = ОКР(ВыборкаТовары.СуммаНачисленныхБонусныхБалловВВалюте * КоэффициентПересчетаСкидки,2);
		КонецЕсли;

		Если ЗаказНайден И ПересчитатьСуммы Тогда

			Ценообразование.ПересчитатьСуммыВСтрокеПоСуммеСНДС(
			СтрокаТаб, 
			РеквизитыЗаказов.ЦенаВключаетНДС,
			СтрокаТаб.ПроцентАвтоматическойСкидки<>0,
			СтрокаТаб.ПроцентРучнойСкидки<>0,
			РеквизитыЗаказов.ПересчитатьВВалютуДокумента);

			Если ЗаказНайден И РеквизитыЗаказов.ПересчитатьВВалютуДокумента И КурсВалюты.Количество() = 1 Тогда
				СтрокаТаб.СуммаАвтоматическойСкидки = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				СтрокаТаб.СуммаАвтоматическойСкидки,
				КурсВалюты[0],
				СтруктураКурсовНовойВалюты);
				СтрокаТаб.СуммаРучнойСкидки = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				СтрокаТаб.СуммаРучнойСкидки,
				КурсВалюты[0],
				СтруктураКурсовНовойВалюты);
				СтрокаТаб.СуммаБонусныхБалловКСписаниюВВалюте = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				СтрокаТаб.СуммаБонусныхБалловКСписаниюВВалюте,
				КурсВалюты[0],
				СтруктураКурсовНовойВалюты);
				СтрокаТаб.СуммаНачисленныхБонусныхБалловВВалюте = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				СтрокаТаб.СуммаНачисленныхБонусныхБалловВВалюте,
				КурсВалюты[0],
				СтруктураКурсовНовойВалюты);
			КонецЕсли;
		КонецЕсли;

		// Формирование табличной части скидок
		СуммаКРаспределению = СтрокаТаб.СуммаАвтоматическойСкидки;

		Если СтрокаТаб.КлючСвязи <> 0 Тогда
			Для Каждого СтрокаСкидкиЗаказа Из СкидкиНаценкиЗаказа.НайтиСтроки(Новый Структура("ЗаказКлиента,КлючСвязи", СтрокаТаб.ЗаказКлиента, СтрокаТаб.КлючСвязи)) Цикл

				СтрокаСкидки = СкидкиНаценки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСкидки, СтрокаСкидкиЗаказа);
				СтрокаСкидки.Сумма = КоэффициентПересчетаСкидки * СтрокаСкидки.Сумма;

				Если ЗаказНайден И РеквизитыЗаказов.ПересчитатьВВалютуДокумента И КурсВалюты.Количество() > 0 Тогда
					СтрокаСкидки.Сумма = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
					СтрокаСкидки.Сумма,
					КурсВалюты[0],
					СтруктураКурсовНовойВалюты);
					СуммаКРаспределению = СуммаКРаспределению - СтрокаСкидки.Сумма;
				КонецЕсли;

			КонецЦикла;
		КонецЕсли;

		Если ЗаказНайден И РеквизитыЗаказов.ПересчитатьВВалютуДокумента И СуммаКРаспределению <> 0 Тогда
			СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
		КонецЕсли;

		Если ИспользоватьБонусныеПрограммыЛояльности Тогда

			// Формирование табличной начисление бонусных баллов
			СуммаКРаспределению = СтрокаТаб.СуммаНачисленныхБонусныхБалловВВалюте;
			Если ЗаказНайден
				И ЗначениеЗаполнено(БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов)
				И ДанныеОтбора.Валюта <> БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов Тогда

				СуммаКРаспределению = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				СуммаКРаспределению,
				СтруктураКурсовНовойВалюты,
				БонуснаяПрограммаЛояльности.СтруктураКурсовВалютыКонвертации);

			КонецЕсли;

			Если СуммаКРаспределению <> 0
				И ЗначениеЗаполнено(БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту) Тогда

				СуммаКРаспределению = СуммаКРаспределению / БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту;
			КонецЕсли;

			Если СтрокаТаб.КлючСвязи <> 0 Тогда
				Для Каждого СтрокаБонусныеБаллыЗаказа Из НачислениеБонусныхБалловЗаказа.НайтиСтроки(Новый Структура("ЗаказКлиента,КлючСвязи", СтрокаТаб.ЗаказКлиента, СтрокаТаб.КлючСвязи)) Цикл

					СтрокаБонусныеБаллы = НачислениеБонусныхБаллов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаБонусныеБаллы, СтрокаБонусныеБаллыЗаказа);
					СтрокаБонусныеБаллы.СуммаБонусныхБаллов = КоэффициентПересчетаСкидки * СтрокаБонусныеБаллы.СуммаБонусныхБаллов;

					СуммаКРаспределению = СуммаКРаспределению - СтрокаБонусныеБаллы.СуммаБонусныхБаллов;

				КонецЦикла;
#Вставка
//Возникает ошибка если найденная СтрокаБонусныеБаллы = Неопределено
				Если ЗаказНайден И СуммаКРаспределению <> 0 И СтрокаБонусныеБаллы <> Неопределено Тогда
					СтрокаБонусныеБаллы.СуммаБонусныхБаллов = СтрокаБонусныеБаллы.СуммаБонусныхБаллов + СуммаКРаспределению;
				КонецЕсли;
#КонецВставки
			КонецЕсли;

#Удаление
			Если ЗаказНайден И СуммаКРаспределению <> 0 Тогда
				СтрокаБонусныеБаллы.СуммаБонусныхБаллов = СтрокаБонусныеБаллы.СуммаБонусныхБаллов + СуммаКРаспределению;
			КонецЕсли;
#КонецУдаления

		КонецЕсли;

		Если ЕстьРеквизитНоменклатураНабора 
			И ЕстьРеквизитИндексНабора
			И ЗначениеЗаполнено(СтрокаТаб.НоменклатураНабора) Тогда
			СтрокаТаб.ИндексНабора = 1;
		КонецЕсли;

	КонецЦикла;

	Если (ПодборПоЗаказамОрдерам ИЛИ ЗаполнятьПоОрдеру) И ОтгруженныеТовары.Количество()>0 Тогда 

	    КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
		ОбрабатываемыеСтроки = Новый Массив;

		Для каждого ОтгруженнаяСтрока Из ОтгруженныеТовары Цикл

			Если ЗначениеЗаполнено(ПроверитьСклады) Тогда
				СкладыПоСсылке = ПроверитьСклады.Получить(ОтгруженнаяСтрока.ЗаказКлиента);
				Если СкладыПоСсылке <> Неопределено
					И СкладыПоСсылке.Найти(ОтгруженнаяСтрока.Склад) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			Если ОтгруженнаяСтрока.Количество > 0 Тогда //Если отгрузили больше

				ПараметрыПоиска = Новый Структура;
				ПараметрыПоиска.Вставить("Номенклатура", ОтгруженнаяСтрока.Номенклатура);
				ПараметрыПоиска.Вставить("Характеристика", ОтгруженнаяСтрока.Характеристика);
				ПараметрыПоиска.Вставить("Склад", ОтгруженнаяСтрока.Склад);
				ПараметрыПоиска.Вставить("Серия", ОтгруженнаяСтрока.Серия);
				ПараметрыПоиска.Вставить("Назначение", ОтгруженнаяСтрока.Назначение);

				Если ТипЗнч(ОтгруженнаяСтрока.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
					ПараметрыПоиска.Вставить("ЗаказКлиента",ОтгруженнаяСтрока.ЗаказКлиента)
				КонецЕсли;

				НайденныеСтроки = Товары.НайтиСтроки(ПараметрыПоиска);

				Если ПодборПоЗаказамОрдерам Тогда

					Если НайденныеСтроки.Количество() > 0 Тогда
						СтрокаТаб = НайденныеСтроки[0];
						СтрокаТаб.КоличествоУпаковокВОрдере = СтрокаТаб.КоличествоУпаковокВОрдере + ОтгруженнаяСтрока.Количество
						* (СтрокаТаб.КоличествоУпаковокВОрдере / СтрокаТаб.Количество);
						СтрокаТаб.КоличествоВОрдере = СтрокаТаб.КоличествоВОрдере + ОтгруженнаяСтрока.Количество;
					Иначе
						СтрокаТаб = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаб, ОтгруженнаяСтрока);
						СтрокаТаб.КоличествоВОрдере = ОтгруженнаяСтрока.Количество;
						СтрокаТаб.КоличествоУпаковокВОрдере = ОтгруженнаяСтрока.Количество;
					КонецЕсли;

				ИначеЕсли ОтгруженнаяСтрока.ОрдернаяСхемаПриОтгрузке Тогда

					Если НайденныеСтроки.Количество() > 0 Тогда
						СтрокаТаб = НайденныеСтроки[0];
						СтрокаТаб.КоличествоУпаковок = СтрокаТаб.КоличествоУпаковок + ОтгруженнаяСтрока.Количество
						* (СтрокаТаб.КоличествоУпаковок / СтрокаТаб.Количество);
						СтрокаТаб.Количество = СтрокаТаб.Количество + ОтгруженнаяСтрока.Количество;

						Ценообразование.ПересчитатьСуммыВСтроке(
						СтрокаТаб, 
						Истина,
						Ложь,
						Истина,
						ДанныеОтбора.ЦенаВключаетНДС);

						ОбрабатываемыеСтроки.Добавить(СтрокаТаб);

					Иначе
						СтрокаТаб = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаб, ОтгруженнаяСтрока);
						СтрокаТаб.Количество = ОтгруженнаяСтрока.Количество;
						СтрокаТаб.КоличествоУпаковок = ОтгруженнаяСтрока.Количество;
					КонецЕсли;

				КонецЕсли;

			КонецЕсли;
		КонецЦикла;
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			ОбрабатываемыеСтроки,
			СтруктураДействий,
			Товары,
			КэшированныеЗначения);
		
	КонецЕсли;

КонецПроцедуры

Функция ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект) экспорт
	ИмяРегистра = "ДвижениеМаркированногоТовара";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Штрихкоды.Ссылка.Склад КАК Склад,
	|	Штрихкоды.Ссылка.Организация КАК Организация,
	|	Штрихкоды.ШтрихкодУпаковки КАК Штрихкод,
	|	ШтрихкодыУпаковка.Ссылка КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.ШтрихкодУпаковки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА Штрихкоды.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
	|				ТОГДА ложь
	|			ИНАЧЕ истина
	|		КОНЕЦ";	
	
  	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецЕсли

&ИзменениеИКонтроль("ТекстЗапросаДанныеДокументаШапка")
Процедура Док_ТекстЗапросаДанныеДокументаШапка(СписокЗапросов)

	ТекстЗапросаШапка = "ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ДанныеДокумента.Статус КАК Статус,
	|	ДанныеДокумента.Партнер КАК Партнер,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.КлиентПартнер КАК КлиентПартнер,
	|	ДанныеДокумента.Грузоотправитель КАК Грузоотправитель,
	|	ДанныеДокумента.Грузополучатель КАК Грузополучатель,
	|	ДанныеДокумента.КлиентКонтрагент КАК КлиентКонтрагент,
	|	ДанныеДокумента.КлиентДоговор КАК КлиентДоговор,
	|	ЕСТЬNULL(ДанныеДокумента.Контрагент.СтранаРегистрации.УчастникЕАЭС, ЛОЖЬ) КАК КонтрагентУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокумента.Контрагент.ЮрФизЛицо,
	|			ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентНеРезидент,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ДатаПереходаПраваСобственности КАК ДатаПереходаПраваСобственности,
	|	ДанныеДокумента.ЗаказКлиента КАК ЗаказКлиента,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(ДанныеДокумента.Подразделение.ВариантОбособленногоУчетаТоваров,
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка)) КАК ВариантОбособленногоУчетаТоваров,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.Дата КАК ДатаРаспоряжения,
	|	ДанныеДокумента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ДанныеДокумента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.РеализацияПоЗаказам КАК РеализацияПоЗаказам,
	|	ДанныеДокумента.Соглашение КАК Соглашение,
	|	ДанныеДокумента.ФормаОплаты КАК ФормаОплаты,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ЕСТЬNULL(ДанныеДокумента.Договор.ВестиРасчетыЧерезКонечныхПокупателей, ЛОЖЬ) КАК
	|		ВестиРасчетыЧерезКонечныхПокупателей,
	|	ДанныеДокумента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДанныеДокумента.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	ДанныеДокумента.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
	|	ДанныеДокумента.Менеджер КАК Менеджер,
	|	ДанныеДокумента.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеДокумента.Сделка КАК Сделка,
	|	ЕСТЬNULL(ДанныеДокумента.Сделка.ОбособленныйУчетТоваровПоСделке, ЛОЖЬ) КАК ОбособленныйУчетТоваровПоСделке,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПередачаНаКомиссию,
	|	ЕСТЬNULL(ДанныеДокумента.Договор.ДопустимаяСуммаЗадолженности, 0) КАК ДопустимаяСуммаЗадолженности,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокумента.Проведен КАК Проведен,
#Вставка
	|	ДанныеДокумента.Кассир        	       КАК Кассир,
	|	ДанныеДокумента.Магазин        	       КАК Магазин,
	|   ДанныеДокумента.РаспределитьТранспортные КАК РаспределитьТранспортные,
#КонецВставки
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ДанныеДокумента.СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре,
	|	ДанныеДокумента.ОбъектРасчетовУпр КАК ОбъектРасчетовУпр,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДокумента.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	ДанныеДокумента.ПорядокРасчетов КАК ПорядокРасчетов
	|ПОМЕСТИТЬ ДанныеДокументаШапка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";

	СписокЗапросов.Добавить(ТекстЗапросаШапка);

КонецПроцедуры


#Область АвтоопределениеДистрибуция

Процедура КонтрольУслугиДоставкиПриНеполнойОтгрузке(Объект)  Экспорт
	УслугаДоставки =  АльтерраОбщегоНазначения.УслугаДоставкиСНДС();
	СтрокаРеализации = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", УслугаДоставки)); 
	Если СтрокаРеализации.Количество() > 0 Тогда	
		СтоимостьДоставкиРеализация = Объект.Товары.Итог("СуммаРТ");
		Если СтрокаРеализации[0].Сумма <>  СтоимостьДоставкиРеализация Тогда
			СтоимостьДоставкиРеализация = Объект.Товары.Итог("СуммаРТ"); 
			АльтерраОбщегоНазначения.ИзменитьУслугуДоставки(Объект, СтоимостьДоставкиРеализация);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

  #КонецОбласти

