#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Перед("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Договор");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
КонецПроцедуры

&Перед("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполненияПеред(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АрендаНоменклатурыВозврат") Тогда
		Документы.АрендаНоменклатурыВозврат.ЗаполнитьДокументРеализацияПоОснованию(ЭтотОбъект, ДанныеЗаполнения);	
		Возврат;
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполненияПосле(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПрибытиеНаОтгрузку = ТекущаяДатаСеанса();//RSSIB 04.07.15
	Менеджер = Пользователи.ТекущийПользователь();
	Грузоотправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "Грузоотправитель");
	
	Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
		ДанныеЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказКлиента,
			"КомментарийДляСклада, Менеджер, ИспользуетсяДоговор, ПодразделениеМенеджера, ОтделМенеджера");
		КомментарийДляСклада = ДанныеЗаказа.КомментарийДляСклада;
		Менеджер = ДанныеЗаказа.Менеджер;
		ПодразделениеМенеджера = ДанныеЗаказа.ПодразделениеМенеджера;
		ОтделМенеджера = ДанныеЗаказа.ОтделМенеджера;
		ИспользуетсяДоговор = ДанныеЗаказа.ИспользуетсяДоговор;
		ДопМодуль.ПроверкаНаОтклонениеОтЦеновыхУсловий(ЭтотОбъект, Ложь);
	КонецЕсли;	
	Если не ЗначениеЗаполнено(СтатусДокументаВЭДО) Тогда
		если допМодуль.КонтрагентРаботаетВЭДО(Контрагент) тогда   
			СтатусДокументаВЭДО = Перечисления.СтатусыДокументаЭДО.ГотовКОтправке;
		иначе
			СтатусДокументаВЭДО = Перечисления.СтатусыДокументаЭДО.НеВыгружен;
		конецесли;
	КонецЕсли;
	
	ПеречислениеМестоОплаты = Перечисления.МестоОплаты; 
	Если ЭтотОбъект.МестоОплаты = ПеречислениеМестоОплаты.ПустаяСсылка() Тогда
		МестоОплаты = ПеречислениеМестоОплаты.Касса;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(ПодразделениеМенеджера) и Не ЗначениеЗаполнено(ОтделМенеджера)Тогда
		ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Менеджер); 
		ОтделМенеджера = ПолучитьОтделМенеджера(Менеджер);
	КонецЕсли; 
	
КонецПроцедуры  

&После("ЗаполнитьДокументНаОснованииЗаказаКлиента")
Процедура Док_ЗаполнитьДокументНаОснованииЗаказаКлиента(Знач ДокументОснование, Знач СкладОтгрузки, ВариантОформления, РеквизитыЗаказа, ПараметрыОформления)
	ТипОснования = ТипЗнч(ДокументОснование);
	Если ТипОснования = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Нарезка.Загрузить(ДокументОснование.Нарезка.Выгрузить());
		БонусныеБаллы.Загрузить(ДокументОснование.БонусныеБаллы.Выгрузить());
		
		//Отметка кассы
		Кассир= ДокументОснование.Кассир;
		ДатаОтметкиКасса= ДокументОснование.ДатаОтметкиКасса;
		
		//Акции
		Промокод = ДокументОснование.Промокод;
		ПривелКлиент = ДокументОснование.ПривелКлиент;
		
		//Информация по сайту
		ССайта = ДокументОснование.ССайта;
		ПередатьНаСайт = ДокументОснование.ПередатьНаСайт;
		
		СпособВводаКлиента = ДокументОснование.СпособВводаКлиента;
		
		//АвтоопределениеДистрибуция
		РаспределитьТранспортныеДистрибуция = ДокументОснование.РаспределитьТранспортныеДистрибуция;
		Если РаспределитьТранспортныеДистрибуция Тогда
		   ЗаполнитьРеквизитыРаспределенияТранспортныхДистрибуция(ДокументОснование);
	   КонецЕсли;
	   //
	КонецЕсли;
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Отказ=АльтерраОбщегоНазначения.ПроверкаБлокировкиУслуги(Дата,Товары);  
	Отказ = АльтерраОбщегоНазначения.ПроверкаУслугБезНДСВместеСТоваром(Дата, Товары, Контрагент, Договор);
	
	Документы.РеализацияТоваровУслуг.КонтрольИзмененийТЧПриНаличииРасходногоОрдера(Отказ, ЭтотОбъект, Истина);
	Документы.РеализацияТоваровУслуг.ПроверкаКорректностиПримененияСкидокВЗаказе(Ссылка, ЗаказКлиента, Отказ);
	ДопМодуль.ПодставитьКонтрагентаФизическоеЛицо(ЭтотОбъект);
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;


	
	ДанныеСсылка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Кассир, СуммаДокумента, Склад"); 
	КассирПоСсылкеЗаполнен = ЗначениеЗаполнено(ДанныеСсылка.Кассир);
	Если (КассирПоСсылкеЗаполнен И (КассирПоСсылкеЗаполнен = ЗначениеЗаполнено(Кассир)))
		И Не (ДополнительныеСвойства.Свойство("Регламент")
			ИЛИ РольДоступна("ПроводитьПриОтметкеКассы")
			ИЛИ РольДоступна("ПолныеПрава"))
		Тогда
			ОбщегоНазначения.СообщитьПользователю("Установлена отметка кассы!");
			Отказ = Истина;
	КонецЕсли;
	
	//проверяем есть ли согласованный рей и сбрасываем согласование, если сумма изменилась
	Если СуммаДокумента <> ДанныеСсылка.СуммаДокумента И Не Отказ И ЗначениеЗаполнено(Ссылка) Тогда
		Рейс = Документы.ЗаданиеНаПеревозкуРейс.ПолучитьРейсПоДокументуПродажи(Ссылка);
		Если ЗначениеЗаполнено(Рейс) И Рейс.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
			Если Рейс.Согласован Тогда
				РейсОбъект = Рейс.ПолучитьОбъект();
				РейсОбъект.Согласован = Ложь;
				РейсОбъект.Записать();
				ОбщегоНазначения.СообщитьПользователю("Снято согласование у " + Рейс, Рейс);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Из доп модуля
	Если РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		ДопМодуль.РаспределениеТранспортных(ЭтотОбъект);
	КонецЕсли;
	//ДопМодуль.ПодставитьКонтрагентаФизическоеЛицо(ЭтотОбъект);
	
	// Для изменяения даты заявки в ЕГАИС Лес на дату установки кассы при установке отметки кассы на реализацию	
	Если Не ЗначениеЗаполнено(ДанныеСсылка.Кассир) И ЗначениеЗаполнено(Кассир) И ЗначениеЗаполнено(Ссылка) Тогда 
		УстановкаОтметки = Истина;
	Иначе
		УстановкаОтметки = Ложь;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("УстановкаОтметки", УстановкаОтметки);

	Если Не ЗначениеЗаполнено(Кассир) Тогда 
		СуммаПоСекциям = РСОбщийМодульВызовСервера.ПолучитьСуммуПоСекциям(Ссылка);
		Если СуммаПоСекциям <> СуммаДокумента ИЛИ ДанныеСсылка.Склад <> Склад Тогда  
			ДополнительныеСвойства.Вставить("ЗаписыватьШтрихкодыПоСекциямДокумента", Истина);	
        КонецЕсли;
	КонецЕсли;
	
	Справочники.МаркетинговыеМероприятия.РасчетПоМаркетинговымМероприятиям(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(Кассир) Тогда
		ДопМодуль.ЗаполнитьВидЦеныПоСоглашению(ЭтотОбъект);
	КонецЕсли;
	                
	Если Не Отказ И 
		(ЭтоНовый() ИЛИ Дата > Дата(2021, 8, 4)) И
		Не ЗначениеЗаполнено(Кассир) И
		Не Склад.Транзит И 
		Не ЗначениеЗаполнено(ПричинаОтклоненияОтЦеновыхУсловий) И 
		РежимЗаписи = РежимЗаписиДокумента.Проведение И
		(Не ЗначениеЗаполнено(ЗаказКлиента) ИЛИ Не ЗаказКлиента.ТоварПодЗаказ)
	Тогда
		ДопМодуль.ПроверкаНаОтклонениеОтЦеновыхУсловий(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
		Если Комментарий = "Создан из помощника продаж" Тогда
			АдресДоставки = "";
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПодразделениеМенеджера) и Не ЗначениеЗаполнено(ОтделМенеджера) Тогда
		ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Менеджер); 
		ОтделМенеджера = ПолучитьОтделМенеджера(Менеджер);
	КонецЕсли;
	
КонецПроцедуры

&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	Кассир="";
	Касса="";
	ККМ=ЛОЖЬ;
	ДатаОтметкиКасса= Неопределено;
	Менеджер= Пользователи.ТекущийПользователь();
	Комментарий= "";
	КартаЛояльности= Неопределено;
	Очередь= Неопределено;
	если допМодуль.КонтрагентРаботаетВЭДО(Контрагент) тогда   
		СтатусДокументаВЭДО = Перечисления.СтатусыДокументаЭДО.ГотовКОтправке;
	иначе
		СтатусДокументаВЭДО = Перечисления.СтатусыДокументаЭДО.НеВыгружен;
	конецесли;
	РаспределитьТранспортные= Ложь;
	РеализацияВМинус= Ложь;
	ПрибытиеНаОтгрузку= Неопределено;
	РеализацияВОкно= Ложь;
	ПричинаПеределки= Неопределено;
	Грузоотправитель= Склад.Грузоотправитель;
	Нарезка.Очистить();
	ПередатьНаСайт = Ложь;
	ССайта = Ложь;
	
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.Кладовщик = ПустойПользователь;
		БонусыАльтерраРезерв.ОчиститьБонусыПоСтроке(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&Перед("ОбработкаПроведения")                                            
Процедура Док_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Накладная = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Если Не ОбменДанными.Загрузка Или Не АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава") Тогда
			КонтрольРеализации = Константы.КонтролироватьРеализации.Получить();
			Если КонтрольРеализации Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТЧ.Номенклатура КАК Номенклатура,
				|	ТЧ.КоличествоУпаковок КАК КоличествоРеализация
				|ПОМЕСТИТЬ ДокТЧ
				|ИЗ
				|	&ТЧ КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура КАК Номенклатура,
				|	РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок КАК КоличествоОрдер
				|   Поместить ВТ_Ордер
				|ИЗ
				|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
				|ГДЕ
				|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
				|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить)
				|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Накладная = &Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура,
				|	РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДокТЧ.Номенклатура КАК Номенклатура,
				|	ДокТЧ.КоличествоРеализация КАК КоличествоРеализация,
				|	ЕСТЬNULL(ВТ_Ордер.КоличествоОрдер, 0) КАК КоличествоОрдер
				|ИЗ
				|	ДокТЧ КАК ДокТЧ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ордер КАК ВТ_Ордер
				|		ПО (ДокТЧ.Номенклатура = ВТ_Ордер.Номенклатура)";
				
				Запрос.УстановитьПараметр("ТЧ", Товары);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				
				Выборка = РезультатЗапроса.Выбрать();
				
				ТекстСообщения = "";
				Пока Выборка.Следующий() Цикл
					Если Выборка.КоличествоРеализация < Выборка.КоличествоОрдер Тогда
						ТекстСообщения = ТекстСообщения + "Для позиции " + Выборка.Номенклатура + " количество указано меньше, чем в ордерах на " + (Выборка.КоличествоОрдер - Выборка.КоличествоРеализация) + " " + Выборка.Номенклатура.ЕдиницаИзмерения + Символы.ПС;
					КонецЕсли; 
				КонецЦикла;
				
				Если ТекстСообщения <> "" Тогда
					Сообщить(ТекстСообщения + "Проведение документа невозможно");
					Отказ = Истина;
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&После("ОбработкаПроведения")                      
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ОбменДанными.Загрузка И ЭтотОбъект.Дата > ТекущаяДата() Тогда
		ОбщегоНазначения.СообщитьПользователю("Запрещено проводить будующей датой!", ЭтотОбъект, "Дата", , Отказ);	
		Отказ = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
		ДопМодуль.ПроверитьРасхождениеЗаказаИРеализаций(ЭтотОбъект,отказ);
	КонецЕсли;
	//Проверяем. Если проведение до установки отметки кассы и при установке - тогда попадаем в контроль. 
	//При снятии отметки кассы - обходим его. 
	Если ЭтотОбъект.ДатаОтметкиКасса = Дата("00010101000000") ИЛИ не ЭтотОбъект.Кассир.Пустая() Тогда                                  
		ДопМодуль.КонтрольОстатковПоСебестоимости(ЭтотОбъект,Отказ);
	КонецЕсли; 
	
	БонусыАльтерра.КонтрольОстатковПоБонуснымБалалм(Ссылка, Отказ);
	
	ТаблицаДвиженийДетализацияБонусныхБаллов = БонусыАльтерра.ПолучитьТаблицуДетализацияБонусныхБаллов(ЭтотОбъект, Отказ);
	Если ТаблицаДвиженийДетализацияБонусныхБаллов.Количество() > 0 Тогда
		Движения.ДетализацияБонусныхБаллов.Загрузить(ТаблицаДвиженийДетализацияБонусныхБаллов);
		Движения.ДетализацияБонусныхБаллов.Записать();
	КонецЕсли;
	
	СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если ЗначениеЗаполнено(Склад) И 
		ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И 
		Склад.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
		Склад.ОтправкаУведомлений = Истина 
		Тогда 
		ОтправкаУведомленийПодрядчику();
	КонецЕсли;  
	
	РегистрыСведений.СостоянияОтгрузкиНакладных.ОбновитьСостояниеОтгрузкиНакладной(ЭтотОбъект,Склад);
	
	РегистрыСведений.ЭлектроннаяОчередьКлиентов.ОбновитьСостояниеДокумента(Ссылка); 
	
КонецПроцедуры
                       
Процедура ОтправкаУведомленийПодрядчику()
	ПовторнаяОтправка = Ложь; 
	УведомлениеОтправлено = Ложь; 
	Запрос = Новый Запрос; 
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобытияДокументовАльтерраСрезПоследних.Документ КАК Документ,
	|	СобытияДокументовАльтерраСрезПоследних.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.СобытияДокументовАльтерра.СрезПоследних(, Событие = &Событие1) КАК СобытияДокументовАльтерраСрезПоследних
	|ГДЕ
	|	СобытияДокументовАльтерраСрезПоследних.Документ = &Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ 
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобытияДокументовАльтерраСрезПоследних.Документ,
	|	СобытияДокументовАльтерраСрезПоследних.Событие
	|ИЗ
	|	РегистрСведений.СобытияДокументовАльтерра.СрезПоследних(, Событие = &Событие2) КАК СобытияДокументовАльтерраСрезПоследних
	|ГДЕ
	|	СобытияДокументовАльтерраСрезПоследних.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ",Ссылка);
	Запрос.УстановитьПараметр("Событие1",Перечисления.СобытияДокументов.УведомлениеПодрядчику); 
	Запрос.УстановитьПараметр("Событие2",Перечисления.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Событие = Перечисления.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику Тогда
			ПовторнаяОтправка = Истина;
		КонецЕсли;
		Если Выборка.Событие = Перечисления.СобытияДокументов.УведомлениеПодрядчику Тогда
			УведомлениеОтправлено = Истина; 
		КонецЕсли;
	КонецЦикла; 
	 
	СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если ЗначениеЗаполнено(Склад) И 
		ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И 
		Склад.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
		Склад.ОтправкаУведомлений = Истина 
		Тогда 
			Если УведомлениеОтправлено = Ложь Тогда 
				ОтправитьСМСиEmail("0");//Если это первое перемещение на транзитный склад со статусом "Принято", который надо уведомлять - то отправляем уведомление. Код "0" означает первую отправку документа 
			Иначе
				Если ПовторнаяОтправка Тогда 
					ОтправитьСМСиEmail("1");//Повторная отправка
				КонецЕсли;
				
			КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьСМСиEmail(код)


	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ должен быть записан!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		ОбщегоНазначения.СообщитьПользователю("Номер документа должен быть указан!");
		Возврат;
	КонецЕсли;
	
	ФайлОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатные формы перемещения", Истина);
	ФайлОбработка2 = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатные формы перемещения", Истина);

	Если Не ЗначениеЗаполнено(ФайлОбработка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка! Не найдена доп. обработка 'Печатные формы перемещения'..");
		Возврат;
	КонецЕсли;
	МассивСкладов = Новый Массив; 
	Если код = "0" или код ="1" Тогда
		УведомленияПодрядчикуПочта = Склад.EMAILподрядчика;
		УведомленияПодрядчикуТелефон =Склад.ТелефонПодрядчика;
		МассивСкладов.Добавить(Склад); 
		МассивСкладов.Добавить(Склад.ДопСкладПодрядчика); 
		ДопПочта = Склад.ДопEMAILподрядчика; 
	КонецЕсли; 	
		
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВыводитьСумму", Истина);
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Ссылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(Ссылка);
	
	ДвоичныеДанные = ФайлОбработка.ХранилищеОбработки.Получить();
	ФайлОбработка = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ФайлОбработка);
	
	ДвоичныеДанные2 = ФайлОбработка2.ХранилищеОбработки.Получить();
	ФайлОбработка2 = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные2.Записать(ФайлОбработка2);

	
	СуммаИтог = 0;
	ТабличныйДокумент = ВнешниеОбработки.Создать(ФайлОбработка).СформироватьПечатнуюФормуНакладнаяРеализацииПодрядчику(МассивДокументов, ОбъектыПечати, ПараметрыПечати, СуммаИтог);
	ФайлТабДок = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ФайлТабДок, ТипФайлаТабличногоДокумента.XLSX);
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТабДок));
	
	ТабличныйДокумент2 = ВнешниеОбработки.Создать(ФайлОбработка2).СформироватьПечатнуюФормуВедомостьОстатковНаСкладах(Ссылка, МассивСкладов, "1");
	ФайлТабДок2 = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент2.Записать(ФайлТабДок2, ТипФайлаТабличногоДокумента.XLSX);
	АдресВХ2 = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТабДок2));

	
	
	
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище","Ведомость по остаткам на складе" + ".xlsx", АдресВХ2));

	
	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("Кому", УведомленияПодрядчикуПочта);
	Если код = "0" Тогда //1 реализовация со склада поставщика
		МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище", "Списание ТМЦ с " + Склад + " "+ номер +  ".xlsx", АдресВХ));
		ПараметрыОтправки.Вставить("Тема", "Альтерра списание ТМЦ с " + Склад);
		ПараметрыОтправки.Вставить("Тело", "С вашего склада '" + Склад +" от "+ ТекущаяДата() + "' сделано списание на сумму " + СуммаИтог + "₽. ТМЦ №" + Номер + ". Документы прилагаются.");
	КонецЕсли;
	Если код = "1" Тогда //Повторное проведение реализации с изменением товарной части  
		МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище", "Изменение списания ТМЦ на " + Склад + " "+ номер +  ".xlsx", АдресВХ));
		ПараметрыОтправки.Вставить("Тема", "Альтерра изменение списания ТМЦ с " + Склад);
		ПараметрыОтправки.Вставить("Тело", "На вашем складе '" + Склад + "' " + ТекущаяДата() + " изменился состав списания ТМЦ №" + Номер + " новая сумма по документу: " + СуммаИтог +  "руб. Документы прилагаются.");
	КонецЕсли;
	

	ПараметрыОтправки.Вставить("Кодировка", КодировкаТекста.UTF8);
	ПараметрыОтправки.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыОтправки.Вставить("Вложения", МассивФайлов);
	
	РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
	Если ЗначениеЗАполнено(ДопПочта) Тогда 
		ПараметрыОтправки.Кому = ДопПочта; 
		РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
	КонецЕслИ; 
	
	
	Если ЗначениеЗаполнено(РезультатОтправкиEmail) И ТипЗнч(РезультатОтправкиEmail) = Тип("Строка") Тогда	
		НомерТелефонаПартнера = АльтерраОбщегоНазначения.ПолчитьТелефонБезКода(УведомленияПодрядчикуТелефон);
		Если СтрДлина(НомерТелефонаПартнера) = 10 Тогда
			СтрокаНомерТелефона = "+7" + Строка(НомерТелефонаПартнера);
			СтатусОшибки = Ложь;
			Если код = "0" Тогда //1 Перемещение на транзит поставщика
				АльтерраОбщегоНазначения.ОтправитьСМС(СтрокаНомерТелефона, "Со скл '" + Склад + " списаны ТМЦ по док " + Номер + " на " +СуммаИтог + "₽. Отпр.'" + УведомленияПодрядчикуПочта + "'", СтатусОшибки);
			КонецЕсли;
			Если код = "1" Тогда //Повторное перемещение на транзит поставщика 
				АльтерраОбщегоНазначения.ОтправитьСМС(СтрокаНомерТелефона, "Изм. по док " +Номер + " на скл '" + Склад + "' нов. сумма " + СуммаИтог +  "р. Отпр. '" + УведомленияПодрядчикуПочта + "'", СтатусОшибки);
			КонецЕсли;
		
	
			Если Не СтатусОшибки Тогда
				ОбщегоНазначения.СообщитьПользователю("Сообщения на E-mail адрес и телефон успешно отправлены!");
				
			Иначе 
				ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на телефон. На E-mail адрес сообщение успешно отправлено!");
			КонецЕсли;
		Иначе 
			ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на телефон. На E-mail адрес сообщение успешно отправлено!");
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на E-mail адрес..");
	КонецЕсли;
	УдалитьФайлы(ФайлОбработка2);
	УдалитьФайлы(ФайлТабДок2);
	УдалитьИзВременногоХранилища(АдресВХ2);

	УдалитьФайлы(ФайлОбработка);
	УдалитьФайлы(ФайлТабДок);
	УдалитьИзВременногоХранилища(АдресВХ);
	Если КОД = "0" Тогда 
		События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
		События.Отбор.Документ.Установить(Ссылка); 
		События.Отбор.Событие.Установить(Перечисления.СобытияДокументов.УведомлениеПодрядчику); 
			
		НовоеСобытие = События.Добавить();
		НовоеСобытие.Документ = Ссылка;
		НовоеСобытие.Событие = Перечисления.СобытияДокументов.УведомлениеПодрядчику;
		НовоеСобытие.Период = ТекущаяДата(); 
		События.Записать();
	КонецЕсли;
	
	Если Код = "1" Тогда 
		  НаборЗаписей=РегистрыСведений.СобытияДокументовАльтерра.СоздатьМенеджерЗаписи();
          НаборЗаписей.Период = дата;
          НаборЗаписей.Документ = Ссылка;
          НаборЗаписей.Событие = Перечисления.СобытияДокументов.ТребуетсяПовторноеУведомлениеПодрядчику;
          НаборЗаписей.Прочитать();
          НаборЗаписей.Удалить();
		  
		  
		  События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
	      События.Отбор.Документ.Установить(Ссылка); 
		  События.Отбор.Событие.Установить(Перечисления.СобытияДокументов.УведомлениеПодрядчикуВысланоПовторно); 
	
		
		  НовоеСобытие = События.Добавить();
		  НовоеСобытие.Документ = Ссылка;
		  НовоеСобытие.Событие = Перечисления.СобытияДокументов.УведомлениеПодрядчикуВысланоПовторно;
		  НовоеСобытие.Период = ТекущаяДата(); 
		  События.Записать();

	КонецЕсли;
КонецПроцедуры	

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	РСОбщийМодульВызовСервера.УдалениеСвязанныхДанныхПоРегистрамСведений(ЭтотОбъект, Отказ);
	
	Документы.ЗаданиеНаПеревозкуРейс.ПроверитьЧтоНетРейсовИлизаказовНаДоставку(ЭтотОбъект, Отказ);
	
	АльтерраОбщегоНазначения.КонтрольОтметкиКассы(ЭтотОбъект, Отказ);       
	
	РегистрыСведений.СостоянияОтгрузкиНакладных.УдалениеЗаписейВРегистре(ЭтотОбъект); 
	
	РегистрыСведений.ЭлектроннаяОчередьКлиентов.УдалитьЗаписьВРегистре(Ссылка); 
КонецПроцедуры

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;      
	
	//Если Реализация по заказу и стоит отметка кассы на Заказе клиента не создаем/не обновляем заявку Лес ЕГАИС
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента) Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента.Кассир) Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.Проведен Тогда
		Документы.ЗаявкаВЕГАИСЛес.СозданиеОбновлениеЗаявкиЛесЕГАИСРеализации(ЭтотОбъект);
	Иначе 
		// При отмене проведения реализации, отменяем проведение заявки Лес ЕГАИС.
		Документы.ЗаявкаВЕГАИСЛес.ОтменитьПроведениеЗаявкиЕГАИСЛес(Ссылка);
	КонецЕсли;
	
	// При пометке на удаление реализации, помечаем заявку Лес ЕГАИС
	Если ЭтотОбъект.ПометкаУдаления ИЛИ (НЕ ЭтотОбъект.ПометкаУдаления И НЕ ЭтотОбъект.Проведен) Тогда
		Документы.ЗаявкаВЕГАИСЛес.ПометкаНаУдалениеЗаявкиЕГАИСЛес(Ссылка);
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления И НЕ ЗначениеЗаполнено(ЭтотОбъект.Кассир) Тогда	   
		
		ЛистыСогласования = ЛистыСогласованияСервер.ПолучитьЛистыСогласования(Ссылка);
		Пока ЛистыСогласования.Следующий() Цикл
			ЛистОбъект = ЛистыСогласования.Ссылка.ПолучитьОбъект();    
			ЛистОбъект.Согласован = Ложь;     
			ЛистОбъект.Аннулирован = Истина;
			ЛистОбъект.ПользовательАннулировал = Пользователи.ТекущийПользователь();
			ЛистОбъект.ДатаРегистрацииАннулирования = ТекущаяДата();
			ЛистОбъект.ПричинаАнулирования = "Удаление документа основания";
			ЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	КонецЕсли;
	
	Если Не Отказ Тогда		
		Если ЗначениеЗаполнено(Сделка) Тогда
			ПартнерВСделку = ?(Партнер=Сделка.Партнер,Неопределено,Партнер);
			КонтрагентВСделку = ?(Контрагент=Сделка.Контрагент,Неопределено,Контрагент);
			Справочники.СделкиСКлиентами.НазваниеСделки(Сделка, ПартнерВСделку, КонтрагентВСделку);
		КонецЕсли;
	КонецЕсли;
	
	Документы.РеализацияТоваровУслуг.КонтрольИзмененийТЧПриНаличииРасходногоОрдера(Отказ, ЭтотОбъект, Ложь);
	
КонецПроцедуры

&ИзменениеИКонтроль ("ЗаполнитьУсловияПродажПоСоглашению")
Процедура Док_ЗаполнитьУсловияПродажПоСоглашению()
	
	УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина, Истина);
	ЗаполнитьУсловияПродаж(УсловияПродаж);
	
	ПараметрыЗаполнения = Документы.РеализацияТоваровУслуг.ПараметрыЗаполненияНалогообложенияНДСПродажи(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
	
	ПересчитатьСуммуСУчетомРучнойСкидки = Новый Структура("Очищать", Ложь);
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЭтотОбъект));
	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки", "КоличествоУпаковок");
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", ПересчитатьСуммуСУчетомРучнойСкидки);
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", Дата);
	ПараметрыЗаполнения.Вставить("Организация", Организация);
	ПараметрыЗаполнения.Вставить("Валюта", Валюта);
	ПараметрыЗаполнения.Вставить("Соглашение", Соглашение);
	ПараметрыЗаполнения.Вставить("НалогообложениеНДС", НалогообложениеНДС);
	ПараметрыЗаполнения.Вставить("ВозвращатьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, СтавкаНДС, ВидЦены, СрокПоставки");
	#Вставка     
	если ДопМодуль.НовоеЦенообразование() тогда
		ПараметрыЗаполнения.Вставить("Подразделение",Подразделение);
	конецесли;
	#КонецВставки
	
	ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
		Товары, // Табличная часть
		, // Массив строк или структура отбора
		ПараметрыЗаполнения,
		СтруктураДействий);
		
	БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    		= Организация;
	СтруктураПараметров.БанковскийСчет		= БанковскийСчетОрганизации;
	БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		АдресДоставки = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(Партнер);
	КонецЕсли;
	
КонецПроцедуры
&После("ИнициализироватьДокумент")
Процедура Док_ИнициализироватьДокумент(ДанныеЗаполнения, ПерезаполнятьСтавкуНДС)
	//Тимашков 290421
	Если ЭтоНовый() Тогда
		ДатаСоздания=ТекущаяДата();
	КонецЕсли;
	//Тимашков 290421
КонецПроцедуры

&После("ПередУдалением")
Процедура Док_ПередУдалением(Отказ)
	ДопМодульСервер.ПроверитьНаличиеРасходногоОрдераНаТовары(Ссылка, Отказ);
КонецПроцедуры

#Область АвтоопределениеДистрибуция
Процедура ЗаполнитьРеквизитыРаспределенияТранспортныхДистрибуция(Заказ) 
	
	Тариф = Заказ.Тариф;
	ТарифЗаКг = Заказ.ТарифЗаКг;
	ОбъектДоставки = Заказ.ОбъектДоставки;   
	
	ТоварыЗаказа = Заказ.Товары;
		
    Отбор = Новый Структура("КодСтроки",1);
	Для Каждого Стр Из Товары Цикл 
	   Отбор.КодСтроки = Стр.КодСтроки;	
	   МассивСтрок = ТоварыЗаказа.НайтиСтроки(Отбор);
       Если МассивСтрок.Количество() > 0 Тогда  
			ЗаполнитьЗначенияСвойств(Стр,МассивСтрок[0],"ЦенаСДоставкойПечать,Компенсация,СуммаНДСРТ,СуммаРТ,СуммаСНДСРТ,Распределять");
	   КонецЕсли;	
	КонецЦикла;
	Документы.РеализацияТоваровУслуг.КонтрольУслугиДоставкиПриНеполнойОтгрузке(ЭтотОбъект);
КонецПроцедуры
	
#КонецОбласти

&НаСервере
Функция ПолучитьОтделМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение.Наименование КАК Отдел
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО (ДополнительныеСведения.Объект = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ДополнительныеСведения.Свойство.Наименование = ""Отделы (Пользователи)""";
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Отдел;
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подразделение;
КонецФункции


#КонецЕсли

