#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНазначение = Параметры.ЭтоНазначение;
	Если ЭтоНазначение Тогда
		Заголовок = НСтр("ru = 'Назначить роли'");
		Элементы.Применить.Заголовок = НСтр("ru = 'Назначить роли'");
	Иначе
		Заголовок = НСтр("ru = 'Снять роли'");
		Элементы.Применить.Заголовок = НСтр("ru = 'Снять роли'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)

	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("Сборщик",   Сборщик);
	СтруктураВозврата.Вставить("Курьер",    Курьер);
	СтруктураВозврата.Вставить("Диспетчер", Диспетчер);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти
