#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Внутренняя") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТелефонКлиента");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&Вместо("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	Документы.ЗаказНаДоставкуКлиенту.ЗаполнитьДанныеПоОснованию(Основание, ЭтотОбъект);

КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Ссылка.Пустая()И Проведен И Ссылка.Интервал = Интервал Тогда
		ДополнительныеСвойства.Вставить("ИзменитьПериодИнтервала",Ложь);   
	Иначе 
		ДополнительныеСвойства.Вставить("ИзменитьПериодИнтервала",Истина);   
	КонецЕсли;

	СФП_МаркерыСервер.МаркерНачало("Заказ на доставку (проведение)", ЭтотОбъект.Номер);
	
	//Проверка на полную дибильность
	Документы.ЗаказНаДоставкуКлиенту.ПроверитьНаДублиОснований(ЭтотОбъект, Отказ);
	//Проверка чтобы не попадали перемещения в розничные доставки и наоборот
	Документы.ЗаказНаДоставкуКлиенту.ПроверитьНаТипыДокументов(ЭтотОбъект, Отказ);
	
	ПроверкаТелефонныхНомеров(Отказ);
		
	//Проверка наличия товара и заявки Егаис Лес (Задача № 49625)
	ТекстПроверкиЕгаис = Документы.ЗаданиеНаПеревозкуРейс.ПроверитьНаличиеТовараИЗаявкиЕГАИСЛес(ЭтотОбъект, Отказ);
	Если Не ПустаяСтрока(ТекстПроверкиЕгаис) Тогда
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПроверкиЕгаис);
		Отказ = Истина;	
	КонецЕсли;
	
	Если Не ЭкспрессДоставка И Не ЗначениеЗаполнено(Интервал) Тогда
		Сообщить("Не заполнен интервал!");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ОбращениеСТоваромНаДовоз(ЭтотОбъект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В обращении клиента нет товара для довоза или дополнительной реализации");
		Отказ = Истина; 
	КонецЕсли;
	
	Если Не Отказ Тогда 
		
	   Если Не РольДоступна("ПолныеПрава") И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда		
		Если Не Проведен И Не ПометкаУдаления Тогда
			Сообщить("Запрещено распроводить документ!");
			Отказ= Истина;
		КонецЕсли;
	   КонецЕсли; 
		
		Документы.ЗаказНаДоставкуКлиенту.ПерезаполнитьРеквизитыЗаказа(ЭтотОбъект);
		
		//По контрагенту НОВЭКС отпускаем без услуги доставки
		ЭтоКонтрагентИсключение = Документы.ЗаказНаДоставкуКлиенту.ЭтоКонтрагентИсключение(Контрагент);
		Если Не РольДоступна("ПолныеПрава") И (СтоимостьДоставки+СтоимостьДоставкиСНДС) <= 0 И Не ПометкаУдаления И Не ЭтоКонтрагентИсключение И Не ЗначениеЗаполнено(Акция) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Стоимость доставки равна нулю! Возможно нет услуги доставки в документах продажи. Или не заполнена  Акция!");
			Отказ = Истина;
		КонецЕсли;		
		
		Если Не РольДоступна("ПолныеПрава") И ДоставкаСРазгрузкой И (Разгрузка+РазгрузкаСНДС) <= 0 И Не ПометкаУдаления Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Стоимость разгрузки равна нулю! Возможно нет услуги разгрузки в документах продажи!");
			Отказ = Истина;
		КонецЕсли;	
		
		Если Не РольДоступна("ПолныеПрава") И (СтоимостьДоставки+Разгрузка)>0 И (СтоимостьДоставкиСНДС+РазгрузкаСНДС)>0 И Не ПометкаУдаления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе не может быть одновременно услуги с НДС и Без НДС!");
			Отказ = Истина;
	    КонецЕсли;

		РасчетРазгрузки = УправлениеЛогистикойСервер.РасчетРазгрузкиДействуетНаДату(Дата);
		Если ДоставкаСРазгрузкой И РасчетРазгрузки Тогда
			Если Не РольДоступна("ПолныеПрава") И (Этаж = 0 ИЛИ Не ЗначениеЗаполнено(ВариантРазгрузки)) И Не ПометкаУдаления Тогда
			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены параметры разгрузки!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Справочники.МаркетинговыеМероприятия.РасчетПоМаркетинговымМероприятиям(ЭтотОбъект);
	КонецЕсли;
	
	КритерииCовместимостиСТипамиТСЗаполнение(Отказ);
	
	Если Не Отказ И Не ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Партнер) И ТипЗнч(Партнер) = Тип("СправочникСсылка.Партнеры") Тогда
		Контрагент = АльтерраОбщегоНазначения.ПолучитьЕдинственногоКонтрагента(Партнер);
	КонецЕсли; 
	

	
	
	
КонецПроцедуры

Функция ОбращениеСТоваромНаДовоз(ЭтотОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ОбращениеКлиента.ДополнительнаяРеализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
		|				И ОбращениеКлиентаТоварыДляДовоза.НомерСтроки ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьТоварыДляДовоза
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбращениеКлиента КАК ОбращениеКлиента
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбращениеКлиента.ТоварыДляДовоза КАК ОбращениеКлиентаТоварыДляДовоза
		|			ПО (ОбращениеКлиентаТоварыДляДовоза.Ссылка = ОбращениеКлиента.Ссылка)
		|		ПО ЗаказНаДоставкуКлиентуОснования.Документ = ОбращениеКлиента.Ссылка
		|ГДЕ
		|	ЗаказНаДоставкуКлиентуОснования.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(ЗаказНаДоставкуКлиентуОснования.Документ) = ТИП(Документ.ОбращениеКлиента)";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЕстьТоварыДляДовоза;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ОбращениеСТоваромНаДовоз(ЭтотОбъект)()


Процедура ПроверкаТелефонныхНомеров(Отказ)
	
	Если Не Отказ Тогда 
		Если СтрДлина(АльтерраОбщегоНазначения.ПолчитьТелефонБезКода(ТелефонКлиентаНаВыгрузке)) <> 10 Тогда
			ОбщегоНазначения.СообщитьПользователю("Неверно заполнен 'Телефон клиента (на выгрузке)'");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ВидДоставки <> Перечисления.ВидыДоставокДоКлиента.Внутренняя И
			СтрДлина(АльтерраОбщегоНазначения.ПолчитьТелефонБезКода(ТелефонКлиента)) <> 10 Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Неверно заполнен 'Телефон клиента'");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура КритерииCовместимостиСТипамиТСЗаполнение(Отказ)
	
	Если Не Отказ Тогда
		КритерииCовместимостиСТипамиТС.Очистить();
		ТипТС = Справочники.ТипыТранспортныхСредств.ПустаяСсылка();
		
		Если ЗначениеЗаполнено(Основания) Тогда
			Критерии = УправлениеЛогистикойСервер.ПодборКритериевДляТиповТС(Основания.ВыгрузитьКолонку("Документ"));
			Если ЗначениеЗаполнено(Критерии) Тогда
				Для Каждого Критерий Из Критерии Цикл
					НС = КритерииCовместимостиСТипамиТС.Добавить();
					НС.Критерий = Критерий;
				КонецЦикла;	
				ТипТС = УправлениеЛогистикойСервер.ОпределениеТипаТСДляЗаказаНаДоставку(Критерии);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, Режим)
	
	//Проверим нет ли заказов на доставку ещё в каких то рейсах
	Если НЕ ТранзитЧерезСкладТранзита Тогда
		Выборка = Документы.ЗаказНаДоставкуКлиенту.ПроверитьЧтоПоДокументамПродажиЕстьДругиеЗаказы(ЭтотОбъект);
		Пока Выборка.Следующий() Цикл
			Если Не ОбменДанными.Загрузка И ТипЗнч(Выборка.ДокументПродажи) <> Тип("ДокументСсылка.ОбращениеКлиента") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ: "+Выборка.ДокументПродажи+" присутствует в другом заказе: "+Выборка.ЗаказНаДоставку, Выборка.ЗаказНаДоставку, "ОснованияДокумент", "Основания.Документ");
				Отказ= Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// проверяем, что по ОПТ-Рубцовск и АСК-Р услуга доставки или разгрузки не должна быть доступна к оформлению по 1СК
	Если Организация.Префикс = "АК" или Организация.Префикс = "ЛЛ" Тогда // АСК-Р или ОПТ-Рубцовск
		Организация1СК = Справочники.Организации.НайтиПоРеквизиту("ИНН", "2208056528");
		НаименованиеОрганизации = Организация.Наименование;
		Для Каждого СтрокаТЧ Из Основания Цикл
			ДокументОснование = СтрокаТЧ.Документ; 
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОбращениеКлиента")И ДокументОснование.Проведен И НЕ ДокументОснование.ПометкаУдаления Тогда
				Если НЕ ЗначениеЗаполнено(ДокументОснование.ТоварыДляДовоза) И НЕ ЗначениеЗаполнено(ДокументОснование.ДополнительнаяРеализация) Тогда
					Сообщить("По обращению "+ДокументОснование.Ссылка+" нет товара для довоза");
					Если НЕ РольДоступна("ПолныеПрава") Тогда
						Отказ = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ДокументОснование.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
				ТЧТовары = ДокументОснование.Товары;
				Для Каждого СтрокаТЧТовары Из ТЧТовары Цикл
					Товар = СтрокаТЧТовары.Номенклатура;
					
					Если Товар.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга 
					 И Товар.Принципал = Организация1СК Тогда
						АльтерраОбщегоНазначения.СообщитьПользователю(, "По организации " + НаименованиеОрганизации + " нельзя использовать услуги по «1СК». Заказ на доставку не проведен");
						
						Отказ = Истина;
						Прервать;
						
					КонецЕсли;		
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	МаркетинговыеМероприятия.Наименование = &Наименование
		|			И МаркетинговыеМероприятия.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", "Обмен/довоз");	
	Запрос.УстановитьПараметр("Ссылка", Акция);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЕстьОбращениеКлиента = Ложь; 
		Для Каждого СтрокаТЧ из Основания Цикл
			ДокОснование = СтрокаТЧ.Документ;
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ОбращениеКлиента") И ДокОснование.Проведен И НЕ ДокОснование.ПометкаУдаления Тогда
				Если НЕ ЗначениеЗаполнено(ДокОснование.ТоварыДляДовоза) И НЕ ЗначениеЗаполнено(ДокОснование.ДополнительнаяРеализация) Тогда
					Сообщить("По обращению "+ДокОснование.Ссылка+" нет товара для довоза");
					Если НЕ РольДоступна("ПолныеПрава") Тогда
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Альтерра_ИдентификаторыОбъектовБ24.Идентификатор КАК Идентификатор
					|ИЗ
					|	РегистрСведений.Альтерра_ИдентификаторыОбъектовБ24 КАК Альтерра_ИдентификаторыОбъектовБ24
					|ГДЕ
					|	Альтерра_ИдентификаторыОбъектовБ24.Объект = &Объект";
				
				Запрос.УстановитьПараметр("Объект", ДокОснование);	
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.Идентификатор <> Неопределено Тогда
						 ЕстьОбращениеКлиента = Истина;
					КонецЕсли;	
				КонецЦикла; 
				
			КонецЕсли;
		КонецЦикла;	
		
		Если НЕ ЕстьОбращениеКлиента Тогда
			Сообщить("Вы не можете воспользоваться акцией ""Обмен/довоз"", т.к. нет обращения клиента");
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;		
		
	КонецЦикла;
	
	Если Партнер <> Справочники.Партнеры.РозничныйПокупатель Тогда	
		НеиспользованныеДокументы = Документы.ЗаказНаДоставкуКлиенту.ЕщёДокументыПродажиЗаСегодня(ЭтотОбъект);
		Если НеиспользованныеДокументы.Количество() > 0 Тогда
			Для Каждого ДокСсылка из НеиспользованныеДокументы Цикл
				 ОбщегоНазначения.СообщитьПользователю("Есть неиспользованные документы. Перейдите в "+ДокСсылка, ДокСсылка);
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	
			
	Если Дата > Дата(2017,07,25)  И Не Отказ Тогда
		//ЗаказыКДоставке
		Движения.ЗаказыКДоставке.Записывать = Истина;
		Для Каждого ТекСтрокаОснования Из Основания Цикл
			Движение = Движения.ЗаказыКДоставке.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ЗаказНаДоставку = Ссылка;
			Движение.ДокументПродажи = ТекСтрокаОснования.Документ;
			Движение.Количество = 1;
		КонецЦикла;
	КонецЕсли;
	
	СформироватьДвиженияВИспользованиеИнтерваловДоставки();
	
	СФП_МаркерыСервер.МаркерКонец("Заказ на доставку (проведение)");   
	
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗаказыКДоставке.ДокументПродажи КАК ДокументПродажи,
	|	ЗаказыКДоставке.Рейс КАК Рейс
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставке КАК ЗаказыКДоставке
	|ГДЕ
	|	ЗаказыКДоставке.ВидДвижения = &ВидДвижения
	|	И ЗаказыКДоставке.ЗаказНаДоставку = &ЗаказНаДоставку";
	
	Запрос.УстановитьПараметр("ЗаказНаДоставку", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		АльтерраОбщегоНазначения.СообщитьПользователю(ВыборкаДетальныеЗаписи.Рейс, "По заказу существует активный рейс: "+ВыборкаДетальныеЗаписи.Рейс);
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры 

Процедура СформироватьДвиженияВИспользованиеИнтерваловДоставки() 
	
	   				
	Если ДополнительныеСвойства.ИзменитьПериодИнтервала Тогда
		ДатаВыбораИнтервала = ТекущаяДата();  
	Иначе
		НаборЗаписей = РегистрыНакопления.ИспользованиеИнтерваловДоставки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Прочитать(); 
		ДатаВыбораИнтервала = ?(НаборЗаписей.Количество() = 0,ТекущаяДата(),НаборЗаписей[0].Период);
	КонецЕсли;
	
	    Движения.ИспользованиеИнтерваловДоставки.Записывать = Истина;
		Движение = Движения.ИспользованиеИнтерваловДоставки.Добавить();

		Движение.Период = ДатаВыбораИнтервала;
	    Движение.ДатаИспользования = ПрибытиеНаОтгрузку;
		Движение.Интервал = Интервал;	
		Движение.ВидДоставки = ВидДоставки;
		Движение.Подразделение = Подразделение; 
		
		Если ДоставкаСРазгрузкой  Тогда 
			Движение.КоличествоСРазгрузкой = 1;
			Движение.ДляРазгрузки = Истина;
		Иначе
			Движение.Количество = 1; 
			Движение.ДляРазгрузки = Ложь;
		КонецЕсли;
	
КонецПроцедуры


#КонецЕсли