#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОтразитьСостояниеЗаказа")
Процедура Док_ОтразитьСостояниеЗаказа(Заказы, УдалениеПроведения = Ложь, Ошибки = Неопределено)  
	
	Очередь  = неопределено; 
	
	Если ТипЗнч(Заказы) = Тип("Массив") Тогда
		МассивСсылок = Заказы;
	ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(Заказы) Тогда
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Заказы);
	Иначе
		
		МассивСсылок = Новый Массив();
		Если Заказы.ДополнительныеСвойства.Свойство("МассивЗависимыхЗаказовКлиентов") Тогда
			МассивСсылок = Новый Массив(Заказы.ДополнительныеСвойства.МассивЗависимыхЗаказовКлиентов);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	Если УдалениеПроведения Тогда
		
		Для Каждого СтрокаСсылка Из МассивСсылок Цикл
			Набор = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
			Набор.Отбор.Заказ.Установить(СтрокаСсылка);
			Набор.Записать(Истина);
		КонецЦикла;
		
		Возврат
		
	КонецЕсли;
	
	Для Каждого СтрокаСсылка Из МассивСсылок Цикл	
	    Если СтрокаСсылка.Метаданные().Реквизиты.Найти("КоммерческоеПредложение") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
	
		Если СтрокаСсылка.КоммерческоеПредложение Тогда
			
			НеВсеОтменены = Ложь;
			ТЧТовары = СтрокаСсылка.Товары;
			Для Каждого СтрокаТЧ Из ТЧТовары Цикл
				Если СтрокаТЧ.Отменено = Ложь Тогда
					НеВсеОтменены = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НеВсеОтменены Тогда
				Продолжить;
			КонецЕсли;	
			
			ОтборЗаказ = Новый Структура;
			ОтборЗаказ.Вставить("Заказ", СтрокаСсылка);
		
			Выборка = РегистрыСведений.СостоянияЗаказовКлиентов.Выбрать(ОтборЗаказ);
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Состояние <> Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
				
					Набор = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
					Набор.Отбор.Заказ.Установить(СтрокаСсылка);
					
					СтрокаНабора = Набор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
					СтрокаНабора.Состояние = Перечисления.СостоянияЗаказовКлиентов.Закрыт;
			
					Попытка
						Если Очередь <> Неопределено Тогда
							ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
						Иначе
							Набор.Записать(Истина);
						КонецЕсли;
					Исключение
						Если ТипЗнч(СтрокаСсылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
							ТекстСообщения = НСтр("ru = 'Не удалось отразить состояние заказа клиента: %Ссылка% по причине: %Причина%'");
							ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", СтрокаСсылка);
							ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
							ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
								Метаданные.Документы.ЗаказКлиента, СтрокаСсылка, ТекстСообщения);
						КонецЕсли;
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
