
&НаКлиенте
Процедура Док_ПровестиПосле(Команда)
		ОбщегоНазначенияУТКлиент.ПровестиДокументы(Элементы.ЗагруженныеДокументы, Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтменаПроведенияПосле(Команда)
	ОбщегоНазначенияУТКлиент.ОтменаПроведения(Элементы.ЗагруженныеДокументы, Заголовок);
КонецПроцедуры

&НаСервере
Процедура Док_ЗаменитьЭквайераПослеНаСервере()   
	ТаблицаДокументов = ПолучитьТЗИзДинамическогоСписка();
	Для Каждого ТекущийДокумент Из ТаблицаДокументов Цикл 
		Если СтрНайти(ТекущийДокумент.НазначениеПлатежа,"Платеж СБП") > 0 ИЛИ  СтрНайти(ТекущийДокумент.НазначениеПлатежа,"/ F") > 0
			 ИЛИ  СтрНайти(ТекущийДокумент.НазначениеПлатежа,"согл. в СБП") > 0 Тогда 
			 
			ДокументСБП = Документы.ПоступлениеБезналичныхДенежныхСредств.НайтиПоНомеру(ТекущийДокумент.Номер,ТекущийДокумент.Дата);
			Если Не ДокументСБП.Пустая() И Не ДокументСБП.Проведен Тогда 
				ДокументОбъект = ДокументСБП.ПолучитьОбъект(); 
				ДокументОбъект.Контрагент = Объект.Эквайер;
				ДокументОбъект.БанковскийСчетКонтрагента = Объект.СчетЭквайера;
				ДокументОбъект.ДоговорЭквайринга = Объект.ДоговорЭквайринга;
				ДокументОбъект.Записать();
			КонецЕсли;	 
		КонецЕсли;	
	КонецЦикла;	 
	Элементы.ЗагруженныеДокументы.Обновить(); 
	Сообщить("Документы обновлены.");
КонецПроцедуры     

&НаКлиенте
Процедура Док_ЗаменитьЭквайераПосле(Команда)
	Если ЗначениеЗаполнено(Объект.Эквайер) И ЗначениеЗаполнено(Объект.СчетЭквайера)  И ЗначениеЗаполнено(Объект.ДоговорЭквайринга) Тогда
		Док_ЗаменитьЭквайераПослеНаСервере();                                                	
	Иначе 
		Сообщить("Для замены Эквайер, Счет эквайера и Договор эквайринга должны быть заполнены!!!");
	КонецЕсли;	
КонецПроцедуры     

&НаСервере
Функция ПолучитьТЗИзДинамическогоСписка()
 
	Схема = Элементы.ЗагруженныеДокументы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.ЗагруженныеДокументы.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Возврат ТЗ;
 
КонецФункции

&НаКлиенте
Процедура Док_ДоговорЭквайрингаНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;      
	Если ЗначениеЗаполнено(Объект.Эквайер) Тогда
		ПараметрыОтбора.Вставить("Контрагент", Объект.Эквайер); 
		ПараметрыОтбора.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Действует"));
	КонецЕсли;	
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Ложь);

	ОткрытьФорму("Справочник.ДоговорыЭквайринга.ФормаВыбора",ПараметрыФормы,Элементы.ДоговорЭквайринга);
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗагрузитьДокументыПеред(Команда)
	СФП_МаркерыКлиент.МаркерНачало("Загрузка выписки из банка");
КонецПроцедуры
