#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда


&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не (АльтерраОбщегоНазначения._РольДоступна("Бухгалтер") ИЛИ
		АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава")) Тогда	
		если  ДокументыОснования.Количество()>0 тогда
		РазницаВДнях = (НачалоДня(Дата) - НачалоДня(ДокументыОснования[0].ДокументОснование.Дата)) / (60 * 60 * 24);
		Если РазницаВДнях>5 Тогда
			Сообщить("Разница между датой документа и датой основания не может быть больше 5 дней!");
			Отказ = Истина;
		КонецЕсли;                                   
		конецесли;
		
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ПерезаполнитьТаблицуТоваров(ТаблицаТовары, Реализация)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КорректировкаРеализации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДанныеПоследнейКорректировки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументовСторноИсправление
	|		ПО (КорректировкаРеализации.Ссылка = РеестрДокументовСторноИсправление.СторнируемыйДокумент)
	|			И (РеестрДокументовСторноИсправление.Проведен)
	|			И (НЕ РеестрДокументовСторноИсправление.ДополнительнаяЗапись)
	|ГДЕ
	|	КорректировкаРеализации.Проведен
	|	И КорректировкаРеализации.ВидКорректировки <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара)
	|	И КорректировкаРеализации.ВидКорректировки <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)
	|	И КорректировкаРеализации.ДокументОснование = &Реализация
	|	И РеестрДокументовСторноИсправление.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаРеализации.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТовары.Сумма) КАК Сумма,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаТовары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоследнейКорректировки КАК ДанныеПоследнейКорректировки
	|		ПО (ТаблицаТовары.Ссылка = ДанныеПоследнейКорректировки.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	СУММА(ТаблицаТовары.Сумма + ТаблицаТовары.СуммаРТ),
	|	ТаблицаТовары.СтавкаНДС,
	|	СУММА(ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаНДСРТ)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоследнейКорректировки КАК ДанныеПоследнейКорректировки
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДанныеПоследнейКорректировки.Ссылка ЕСТЬ NULL
	|	И ТаблицаТовары.Ссылка = &Реализация
	|	И ВЫБОР
	|			КОГДА ТаблицаТовары.Ссылка.РаспределитьТранспортные
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.СтавкаНДС
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура,
	|	СчетФактураВыданныйТовары.ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураВыданныйТовары.Характеристика КАК Характеристика,
	|	СчетФактураВыданныйТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	СчетФактураВыданныйТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	СчетФактураВыданныйТовары.Содержание КАК Содержание,
	|	СчетФактураВыданныйТовары.ТипЗапасов КАК ТипЗапасов,
	|	СчетФактураВыданныйТовары.КодТНВЭД КАК КодТНВЭД,
	|	СчетФактураВыданныйТовары.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетФактураВыданныйТовары.Количество КАК Количество,
	|	СчетФактураВыданныйТовары.КоличествоУвеличение КАК КоличествоУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоУменьшение КАК КоличествоУменьшение,
	|	СчетФактураВыданныйТовары.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйТовары.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураВыданныйТовары.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураВыданныйТовары.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураВыданныйТовары.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	СчетФактураВыданныйТовары.НомерСтрокиПриПечати КАК НомерСтрокиПриПечати,
	|	СчетФактураВыданныйТовары.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	|	СчетФактураВыданныйТовары.Серия КАК Серия,
	|	СчетФактураВыданныйТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СчетФактураВыданныйТовары.НоменклатураПартнера КАК НоменклатураПартнера
	|ПОМЕСТИТЬ СчетФактураВыданныйТовары
	|ИЗ
	|	&Товары КАК СчетФактураВыданныйТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура,
	|	СчетФактураВыданныйТовары.ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураВыданныйТовары.Характеристика КАК Характеристика,
	|	СчетФактураВыданныйТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	СчетФактураВыданныйТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	СчетФактураВыданныйТовары.Содержание КАК Содержание,
	|	СчетФактураВыданныйТовары.ТипЗапасов КАК ТипЗапасов,
	|	СчетФактураВыданныйТовары.КодТНВЭД КАК КодТНВЭД,
	|	СчетФактураВыданныйТовары.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетФактураВыданныйТовары.Количество КАК Количество,
	|	СчетФактураВыданныйТовары.КоличествоУвеличение КАК КоличествоУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоУменьшение КАК КоличествоУменьшение,
	|	СчетФактураВыданныйТовары.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйТовары.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураВыданныйТовары.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураВыданныйТовары.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураВыданныйТовары.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	СчетФактураВыданныйТовары.НомерСтрокиПриПечати КАК НомерСтрокиПриПечати,
	|	СчетФактураВыданныйТовары.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	|	СчетФактураВыданныйТовары.Серия КАК Серия,
	|	СчетФактураВыданныйТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СчетФактураВыданныйТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	СчетФактураВыданныйТовары КАК СчетФактураВыданныйТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходныеДанные КАК КорректировкаРеализацииТовары
	|		ПО СчетФактураВыданныйТовары.Номенклатура = КорректировкаРеализацииТовары.Номенклатура
	|			И СчетФактураВыданныйТовары.Характеристика = КорректировкаРеализацииТовары.Характеристика";  
	
	Запрос.УстановитьПараметр("Реализация", Реализация); 
	Запрос.УстановитьПараметр("Товары", ТаблицаТовары);  
	Возврат Запрос.Выполнить().Выгрузить();  
	
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьТаблицуТоваров")
Процедура Док_ЗаполнитьТаблицуТоваров(РезультатЗаполнения) Экспорт
	
	Если Не (Исправление
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПервичныйДокумент")) Тогда
		СчетФактураОснование = РезультатЗаполнения.СчетФактураОснование;
	КонецЕсли;
	Корректировочный = РезультатЗаполнения.Корректировочный;
	Товары.Загрузить(РезультатЗаполнения.Товары);
		
	#Вставка 
	Если ДокументыОснования.Количество() > 0 Тогда
		Если ТипЗнч(ДокументыОснования[0].ДокументОснование)= Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
			КорректировкаРеализации = ДокументыОснования[0].ДокументОснование; 
			Реализация = КорректировкаРеализации.ДокументОснование; 
			Если Реализация.РаспределитьТранспортные Тогда 
				Товары.Загрузить(ПерезаполнитьТаблицуТоваров(Товары, Реализация)); 
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	#КонецВставки
	#Вставка
	Если ДокументыОснования.Количество() > 0 Тогда
		Если ТипЗнч(ДокументыОснования[0].ДокументОснование)= Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда 
			ВозвратТоваровОтКлиента = ДокументыОснования[0].ДокументОснование; 
			Реализация = ВозвратТоваровОтКлиента.ДокументРеализации; 
			Если Реализация.РаспределитьТранспортные Тогда 
				Товары.Загрузить(ПерезаполнитьТаблицуТоваровВозврат(Товары, Реализация)); 
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	#КонецВставки
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.СчетФактураВыданный);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаСервере
Функция ПерезаполнитьТаблицуТоваровВозврат(ТаблицаТовары, Реализация)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТоваровОтКлиента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДанныеВозвратов
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументовСторноИсправление
	|		ПО ВозвратТоваровОтКлиента.Ссылка = РеестрДокументовСторноИсправление.СторнируемыйДокумент
	|			И (РеестрДокументовСторноИсправление.Проведен)
	|			И (НЕ РеестрДокументовСторноИсправление.ДополнительнаяЗапись)
	|ГДЕ
	|	ВозвратТоваровОтКлиента.Проведен
	|	И ВозвратТоваровОтКлиента.ДокументРеализации = &Реализация
	|	И РеестрДокументовСторноИсправление.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ВозвратТоваровОтКлиентаТовары.Характеристика КАК Характеристика,
	|	СУММА(ВозвратТоваровОтКлиентаТовары.Сумма) КАК Сумма,
	|	ВозвратТоваровОтКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВозвратТоваровОтКлиентаТовары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ТоварыВозврата
	|ИЗ
	|	ДанныеВозвратов КАК ДанныеВозвратов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
	|		ПО ДанныеВозвратов.Ссылка = ВозвратТоваровОтКлиентаТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура,
	|	ВозвратТоваровОтКлиентаТовары.Характеристика,
	|	ВозвратТоваровОтКлиентаТовары.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Сумма + ТаблицаТовары.СуммаРТ КАК Сумма,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаНДСРТ КАК СуммаНДС
	|ПОМЕСТИТЬ ДанныеРеализацииТранспортные
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Реализация
	|	И ВЫБОР
	|			КОГДА ТаблицаТовары.Ссылка.РаспределитьТранспортные
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРеализацииТранспортные.Номенклатура КАК Номенклатура,
	|	ДанныеРеализацииТранспортные.Характеристика КАК Характеристика,
	|	ДанныеРеализацииТранспортные.Сумма - ЕСТЬNULL(ТоварыВозврата.Сумма, 0) КАК Сумма,
	|	ДанныеРеализацииТранспортные.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеРеализацииТранспортные.СуммаНДС - ЕСТЬNULL(ТоварыВозврата.СуммаНДС, 0) КАК СуммаНДС
	|ПОМЕСТИТЬ ДанныеКорректировки
	|ИЗ
	|	ДанныеРеализацииТранспортные КАК ДанныеРеализацииТранспортные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВозврата КАК ТоварыВозврата
	|		ПО ДанныеРеализацииТранспортные.Номенклатура = ТоварыВозврата.Номенклатура
	|			И ДанныеРеализацииТранспортные.Характеристика = ТоварыВозврата.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура,
	|	СчетФактураВыданныйТовары.ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураВыданныйТовары.Характеристика КАК Характеристика,
	|	СчетФактураВыданныйТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	СчетФактураВыданныйТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	СчетФактураВыданныйТовары.Содержание КАК Содержание,
	|	СчетФактураВыданныйТовары.ТипЗапасов КАК ТипЗапасов,
	|	СчетФактураВыданныйТовары.КодТНВЭД КАК КодТНВЭД,
	|	СчетФактураВыданныйТовары.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетФактураВыданныйТовары.Количество КАК Количество,
	|	СчетФактураВыданныйТовары.КоличествоУвеличение КАК КоличествоУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоУменьшение КАК КоличествоУменьшение,
	|	СчетФактураВыданныйТовары.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйТовары.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураВыданныйТовары.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураВыданныйТовары.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураВыданныйТовары.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	СчетФактураВыданныйТовары.НомерСтрокиПриПечати КАК НомерСтрокиПриПечати,
	|	СчетФактураВыданныйТовары.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	|	СчетФактураВыданныйТовары.Серия КАК Серия,
	|	СчетФактураВыданныйТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СчетФактураВыданныйТовары.НоменклатураПартнера КАК НоменклатураПартнера
	|ПОМЕСТИТЬ СчетФактураВыданныйТовары
	|ИЗ
	|	&Товары КАК СчетФактураВыданныйТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйТовары.ПредыдущийСчетФактура КАК ПредыдущийСчетФактура,
	|	СчетФактураВыданныйТовары.ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураВыданныйТовары.Характеристика КАК Характеристика,
	|	СчетФактураВыданныйТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	СчетФактураВыданныйТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	СчетФактураВыданныйТовары.Содержание КАК Содержание,
	|	СчетФактураВыданныйТовары.ТипЗапасов КАК ТипЗапасов,
	|	СчетФактураВыданныйТовары.КодТНВЭД КАК КодТНВЭД,
	|	СчетФактураВыданныйТовары.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетФактураВыданныйТовары.Количество КАК Количество,
	|	СчетФактураВыданныйТовары.КоличествоУвеличение КАК КоличествоУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоУменьшение КАК КоличествоУменьшение,
	|	СчетФактураВыданныйТовары.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйТовары.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураВыданныйТовары.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураВыданныйТовары.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураВыданныйТовары.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	СчетФактураВыданныйТовары.НомерСтрокиПриПечати КАК НомерСтрокиПриПечати,
	|	СчетФактураВыданныйТовары.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	|	СчетФактураВыданныйТовары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	|	СчетФактураВыданныйТовары.Серия КАК Серия,
	|	СчетФактураВыданныйТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	СчетФактураВыданныйТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ДанныеКорректировки.Сумма КАК Сумма,
	|	ДанныеКорректировки.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеКорректировки.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	СчетФактураВыданныйТовары КАК СчетФактураВыданныйТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКорректировки КАК ДанныеКорректировки
	|		ПО СчетФактураВыданныйТовары.Номенклатура = ДанныеКорректировки.Номенклатура
	|			И СчетФактураВыданныйТовары.Характеристика = ДанныеКорректировки.Характеристика
	|";


	Запрос.УстановитьПараметр("Реализация", Реализация); 
	Запрос.УстановитьПараметр("Товары", ТаблицаТовары);  
    	ЗапросТест = Запрос.Выполнить(); 
	Возврат Запрос.Выполнить().Выгрузить();  
	
КонецФункции

#КонецЕсли
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
