&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Печать
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры
// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
//-

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры


&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	Объект.ПериодНачисления = НачалоМесяца(Объект.ПериодНачисления);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСторно(Команда)
	ЗаполнитьСторноНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСторноНаСервере()
	ЗаполнитьУдержания();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУдержания()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ.Сотрудник
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(НачисленияУдержанийОбороты.СуммаЗадержкиОборот) КАК СуммаЗадержки,
		|	СУММА(НачисленияУдержанийОбороты.СуммаУдержанияОборот) КАК СуммаУдержания,
		|	СУММА(НачисленияУдержанийОбороты.СуммаВозвратаОборот) КАК СуммаВозврата,
		|	СУММА(ЕСТЬNULL(НачисленияУдержанийОбороты.СуммаЗадержкиОборот, 0) - ЕСТЬNULL(НачисленияУдержанийОбороты.СуммаВозвратаОборот, 0)) КАК СуммаСторно,
		|	ВТ.Сотрудник КАК Сотрудник,
		|	НачисленияУдержанийОбороты.Удержание,
		|	НачисленияУдержанийОбороты.РегистраторУдержания КАК РегистраторУдержания
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержаний.Обороты(
		|				,
		|				,
		|				,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ВТ.Сотрудник
		|					ИЗ
		|						ВТ КАК ВТ)) КАК НачисленияУдержанийОбороты
		|		ПО ВТ.Сотрудник = НачисленияУдержанийОбороты.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Сотрудник,
		|	НачисленияУдержанийОбороты.Удержание,
		|	НачисленияУдержанийОбороты.РегистраторУдержания
		|
		|ИМЕЮЩИЕ
		|СУММА(НачисленияУдержанийОбороты.СуммаСторноОборот) <> СУММА(ЕСТЬNULL(НачисленияУдержанийОбороты.СуммаЗадержкиОборот, 0) - ЕСТЬNULL(НачисленияУдержанийОбороты.СуммаВозвратаОборот, 0))";
	
	Запрос.УстановитьПараметр("ТЗ", Объект.Начисления.Выгрузить(,"Сотрудник"));
	//Запрос.УстановитьПараметр("Удержание", ТекущиеДанные.Удержание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Начисления.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры
