#Область НовоеЦенообразование

Функция ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению_НЦ(ИмяТаблицы, ИмяВременнойТаблицыТоваров)
	
	ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
	               |	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВременнаяТаблицаТовары.Характеристика КАК Характеристика,
	               |	ВременнаяТаблицаТовары.Упаковка КАК Упаковка,
	               |	ВременнаяТаблицаТовары.Валюта КАК Валюта,
	               |	&СтавкаНДС КАК СтавкаНДС,
	               |	&ПолеВидаЦен КАК ВидЦены,
	               |	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(СоглашениеТовары.Цена, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1) * ВЫБОР
	               |		КОГДА ВременнаяТаблицаТовары.Валюта <> СоглашениеШапка.Валюта
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.КурсЗнаменатель, 0) > 0
	               |							И ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.КурсЧислитель, 0) > 0
	               |							И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
	               |							И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
	               |						ТОГДА КурсыСрезПоследнихВалютаСоглашения.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаСоглашения.КурсЗнаменатель)
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СоглашениеТовары.СрокПоставки, 0) > 0
	               |			ТОГДА СоглашениеТовары.СрокПоставки
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЕСТЬNULL(СоглашениеЦеновыеГруппы.СрокПоставки, 0) > 0
	               |					ТОГДА СоглашениеЦеновыеГруппы.СрокПоставки
	               |				ИНАЧЕ СоглашениеШапка.СрокПоставки
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СрокПоставки,
	               |	ВидыЦен.Ссылка КАК ВидЦеныСоглашение,
	               |	ВидыЦенТовары.Ссылка КАК ВидЦеныТовары,
	               |	ВидыЦенЦеновыеГруппы.Ссылка КАК ВидЦеныЦеновыеГруппы
	               |ПОМЕСТИТЬ ИмяТаблицы
	               |ИЗ
	               |	&ИмяВременнойТаблицыТоваров КАК ВременнаяТаблицаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенТовары
	               |			ПО СоглашениеТовары.ГруппаВидовЦен = ВидыЦенТовары.ГруппаВидовЦен
	               |				И (ВидыЦенТовары.ФорматПодразделения = &ФорматПодразделения)
	               |				И (ВидыЦенТовары.РегионПрисутствия = &регионПрисутствия)
	               |		ПО (СоглашениеТовары.Ссылка = &Соглашение)
	               |			И ВременнаяТаблицаТовары.Номенклатура = СоглашениеТовары.Номенклатура
	               |			И ВременнаяТаблицаТовары.Характеристика = СоглашениеТовары.Характеристика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
	               |		ПО (СоглашениеШапка.Ссылка = &Соглашение)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО (СправочникНоменклатура.Ссылка = ВременнаяТаблицаТовары.Номенклатура)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенЦеновыеГруппы
	               |			ПО СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ВидыЦенЦеновыеГруппы.ГруппаВидовЦен
	               |				И (ВидыЦенЦеновыеГруппы.ФорматПодразделения = &ФорматПодразделения)
	               |				И (ВидыЦенЦеновыеГруппы.РегионПрисутствия = &регионПрисутствия)
	               |		ПО (СоглашениеШапка.Ссылка = СоглашениеЦеновыеГруппы.Ссылка)
	               |			И (СправочникНоменклатура.Ссылка.ЦеноваяГруппа = СоглашениеЦеновыеГруппы.ЦеноваяГруппа)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК КурсыСрезПоследнихВалютаДокумента
	               |		ПО (КурсыСрезПоследнихВалютаДокумента.Валюта = ВременнаяТаблицаТовары.Валюта)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК КурсыСрезПоследнихВалютаСоглашения
	               |		ПО (КурсыСрезПоследнихВалютаСоглашения.Валюта = СоглашениеШапка.Валюта)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(
	               |				&Дата,
	               |				(Страна = &СтранаРегистрации
	               |					ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							Т.Номенклатура
	               |						ИЗ
	               |							&ИмяВременнойТаблицыТоваров КАК Т)) КАК СтавкиНДСНоменклатуры
	               |		ПО ВременнаяТаблицаТовары.Номенклатура = СтавкиНДСНоменклатуры.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Дата, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
	               |		ПО (ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	               |		ПО (СоглашениеШапка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен)
	               |			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	               |			И (ВидыЦен.РегионПрисутствия = &регионПрисутствия)
					|;
					|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ИмяТаблицы", "ПОМЕСТИТЬ " + ИмяТаблицы);

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяВременнойТаблицыТоваров", ИмяВременнойТаблицыТоваров);

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&СтавкаНДС",
		УчетНДСУП.ТекстЗапросаСтавкаНДС(
			"&НалогообложениеНДС",
			"ВременнаяТаблицаТовары.Номенклатура",
			"&ВозвращатьМногооборотнуюТару"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ВременнаяТаблицаТовары.Упаковка",
			"ВременнаяТаблицаТовары.Номенклатура"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки3",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"СоглашениеТовары.Упаковка",
			"СоглашениеТовары.Номенклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ПолеВидаЦен",
	ПолеВидаЦены());
	Возврат ТекстЗапроса
	
КонецФункции


Функция ПолеВидаЦены(тип=1) экспорт
    если тип=1 тогда
	Поле =
	" 		ВЫБОР
	|			КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			КОГДА СоглашениеТовары.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|					И СоглашениеТовары.ГруппаВидовЦен ЕСТЬ НЕ NULL 
	|				ТОГДА ВидыЦенТовары.Ссылка
	|			КОГДА (СоглашениеТовары.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|					ИЛИ СоглашениеТовары.ГруппаВидовЦен ЕСТЬ NULL)
	|					И СоглашениеЦеновыеГруппы.ГруппаВидовЦен ЕСТЬ НЕ NULL 
	|					И СоглашениеЦеновыеГруппы.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|				ТОГДА ВидыЦенЦеновыеГруппы.Ссылка
	|			КОГДА (СоглашениеТовары.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|					ИЛИ СоглашениеТовары.ГруппаВидовЦен ЕСТЬ NULL)
	|					И (СоглашениеЦеновыеГруппы.ГруппаВидовЦен ЕСТЬ NULL
	|						ИЛИ СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка))
	|					И СоглашениеШапка.ГруппаВидовЦен <> ЗНАЧЕНИЕ(Справочник.ГруппировкиВидовЦен.ПустаяСсылка)
	|				ТОГДА ВидыЦен.Ссылка
	|		КОНЕЦ ";    
иначеесли тип =2 тогда
	Поле =
	" 		ВЫБОР
	|		КОГДА ЕСТЬNULL(ВидыЦенТовары.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ВидыЦенТовары.Ссылка
	|		КОГДА ЕСТЬNULL(ВидыЦенЦеновыеГруппы.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ВидыЦенЦеновыеГруппы.Ссылка
	|		ИНАЧЕ ЕСТЬNULL(&ВидЦенСоглашение, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|	КОНЕЦ ";
	конецесли;
	возврат поле;

КонецФункции // ПолеВидаЦены()

Функция ПолучитьЦенуПартнера(Объект) экспорт
	
	если ДопМодуль.НовоеЦенообразованиеЗакупа(Объект.дата) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЦенПоставщиков.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
		|		ПО ВидыЦенПоставщиков.ГруппаВидовЦен = СоглашенияСПоставщиками.ГруппаВидовЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО ВидыЦенПоставщиков.РегионПрисутствия = СтруктураПредприятия.РегионПрисутствия
		|			И ВидыЦенПоставщиков.ФорматПодразделения = СтруктураПредприятия.ФорматПодразделения
		|ГДЕ
		|	СоглашенияСПоставщиками.Ссылка = &Соглашение
		|	И СтруктураПредприятия.Ссылка = &Подразделение
		|	И ВидыЦенПоставщиков.Владелец = &Партнер";
		
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
		Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		если ВыборкаДетальныеЗаписи.Следующий() тогда
			возврат ВыборкаДетальныеЗаписи.Ссылка;
		Конецесли;
		
	иначе         
		возврат Объект.Соглашение.ВидЦеныПоставщика;
	конецесли;
	
КонецФункции // ПолучитьЦенуПартнера()

Функция ЗаполнитьЦеныПоЦенамПоставщиков(ТабличнаяЧасть, ВыделенныеСтроки, ПараметрыЗаполнения, СтруктураДействий = Неопределено, КэшированныеЗначения = Неопределено) Экспорт
	
	ЦеныЗаполнены = Ложь;
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Параметры заполнения не указаны'");
	КонецЕсли;
	
	// Получение структуры параметров по умолчанию
	Параметры = Новый Структура(
		"ПоляЗаполнения,  ДругиеИменаКолонок",
		"Цена", Новый Структура);
	ОбщегоНазначенияУТКлиентСервер.ДополнитьСтруктуру(Параметры, ПараметрыЗаполнения, Истина);
	
	// Получение выгрузки по табличной части
	Таблица = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
		ТабличнаяЧасть,
		ВыделенныеСтроки,
		"НомерСтроки, Номенклатура",
		Неопределено,
		Параметры.ДругиеИменаКолонок);
	
	// Получение запроса
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Параметры.Дата), Параметры.Дата, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("Регион", Параметры.Регион);
 	Запрос.УстановитьПараметр("ГруппаВидовЦен", Константы.ГруппаВидовЦенДляСклада.Получить());

	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.Номерстроки КАК Номерстроки,
	               |	Таблица.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВР_Таблица
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_Таблица.Номерстроки КАК Номерстроки,
	               |	ВР_Таблица.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(ЦеныНоменклатурыПоставщиков.Период) КАК Период
	               |ПОМЕСТИТЬ ВР_ЗаписиЦен
	               |ИЗ
	               |	ВР_Таблица КАК ВР_Таблица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК ЦеныНоменклатурыПоставщиков
	               |		ПО ВР_Таблица.Номенклатура = ЦеныНоменклатурыПоставщиков.Номенклатура
	               |			И (ЦеныНоменклатурыПоставщиков.Период <= &Дата)
	               |			И (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика.РегионПрисутствия = &Регион)
	               |			И (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика.ГруппаВидовЦен = &ГруппаВидовЦен)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВР_Таблица.Номерстроки,
	               |	ВР_Таблица.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_ЗаписиЦен.Номерстроки КАК Номерстроки,
	               |	ВР_ЗаписиЦен.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ЦеныНоменклатурыПоставщиков.Цена, 0) КАК Цена
	               |ИЗ
	               |	ВР_ЗаписиЦен КАК ВР_ЗаписиЦен
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК ЦеныНоменклатурыПоставщиков
	               |		ПО ВР_ЗаписиЦен.Номенклатура = ЦеныНоменклатурыПоставщиков.Номенклатура
	               |			И ВР_ЗаписиЦен.Период = ЦеныНоменклатурыПоставщиков.Период
	               |			И (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика.РегионПрисутствия = &Регион)
	               |			И (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика.ГруппаВидовЦен = &ГруппаВидовЦен)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЦеныЗаполнены;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура(Параметры.ПоляЗаполнения);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
		СтрокаТЧ = ТабличнаяЧасть[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);
		Если СтруктураДействий <> Неопределено Тогда
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, КэшированныеЗначения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьЦены")
Функция Док_ЗаполнитьЦены(ТабличнаяЧасть, ВыделенныеСтроки, ПараметрыЗаполнения, СтруктураДействий)

	ЦеныЗаполнены = Ложь;

	ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ПараметрыЗаполнения.Дата);

	Если ПараметрыЗаполнения = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Параметры заполнения не указаны'");
		Возврат ЦеныЗаполнены;
	КонецЕсли;

	КэшированныеЗначения = Неопределено;

	ИмяКолонкиУпаковка = "Упаковка";
	Если ПараметрыЗаполнения.Свойство("ИмяКолонкиУпаковка") Тогда
		ИмяКолонкиУпаковка = ПараметрыЗаполнения.ИмяКолонкиУпаковка;
	КонецЕсли;

	// Получение структуры параметров по умолчанию
	Параметры = НовыйПараметрыЗаполненияЗаполнитьЦены();
	ОбщегоНазначенияУТКлиентСервер.ДополнитьСтруктуру(Параметры, ПараметрыЗаполнения, Истина);

	// Проверки входящих данных
	Если Не ЗначениеЗаполнено(Параметры.Соглашение) И Не ЗначениеЗаполнено(Параметры.ВидЦены) И Не ЗначениеЗаполнено(Параметры.Партнер) Тогда
		Возврат ЦеныЗаполнены;
	ИначеЕсли Не ЗначениеЗаполнено(Параметры.Валюта) Тогда
		Возврат ЦеныЗаполнены;
	КонецЕсли;

	НаличиеКолонокТаблицы = НаличиеКолонокТаблицы(ТабличнаяЧасть,
	"КоличествоУпаковок,
	|КодСтроки,
	|ЗаказКлиента,
	|Серия,
	|Цена,
	|ВидЦены");

	ДополнительныеКолонки  = "";
	ЕстьКоличествоУпаковок = НаличиеКолонокТаблицы.КоличествоУпаковок;
	ЕстьСерия = НаличиеКолонокТаблицы.Серия;
	ЕстьКодСтроки = НаличиеКолонокТаблицы.КодСтроки И НаличиеКолонокТаблицы.ЗаказКлиента;
	ЕстьЦена = НаличиеКолонокТаблицы.Цена;
	ЕстьВидЦены = НаличиеКолонокТаблицы.ВидЦены;

	Если ЕстьКоличествоУпаковок Тогда
		ДополнительныеКолонки = ?(Параметры.РассчитыватьНаборы, "," + "Количество, КоличествоУпаковок, НоменклатураНабора, ХарактеристикаНабора", "");
	Иначе
		ДополнительныеКолонки = ?(Параметры.РассчитыватьНаборы, "," + "Количество, НоменклатураНабора, ХарактеристикаНабора", "");
	КонецЕсли;

	Если ЕстьСерия Тогда
		ДополнительныеКолонки = ""+ ДополнительныеКолонки + ", Серия";
	КонецЕсли;

	// Получение выгрузки по табличной части
	Таблица = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
	ТабличнаяЧасть,
	ВыделенныеСтроки,
	"НомерСтроки, Номенклатура, Характеристика, " + ИмяКолонкиУпаковка + ДополнительныеКолонки,
	Параметры.КолонкиПоЗначению,
	Параметры.ДругиеИменаКолонок);

	МаксимальныйИндексСтроки = 0;
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		Если СтрокаТЧ.НомерСтроки > МаксимальныйИндексСтроки Тогда
			МаксимальныйИндексСтроки = СтрокаТЧ.НомерСтроки;
		КонецЕсли;
	КонецЦикла;

	КоэффициентыПропорциональностиРасчетаЦенНаборов = Неопределено;
	ДанныеПоКоличествуНаборов = Неопределено;
	Если Параметры.РассчитыватьНаборы Тогда

		Если НЕ ЕстьКоличествоУпаковок Тогда
			Таблица.Колонки.Добавить("КоличествоУпаковок", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
			Для Каждого СтрокаТЧ Из Таблица Цикл
				СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.Количество;
			КонецЦикла;
		КонецЕсли;

		КоэффициентыПропорциональностиРасчетаЦенНаборов = НаборыСервер.КоэффициентыРаспределения(Таблица, Параметры);
		ДанныеПоКоличествуНаборов = КоличествоНаборов(Таблица);

		Наборы = КоэффициентыПропорциональностиРасчетаЦенНаборов.Скопировать();
		Наборы.Свернуть("НоменклатураНабора, ХарактеристикаНабора");
		Индекс = МаксимальныйИндексСтроки;
		Для Каждого Строка Из Наборы Цикл

			Индекс = Индекс + 1;

			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.НомерСтроки         = Индекс;
			НоваяСтрока.Номенклатура        = Строка.НоменклатураНабора;
			НоваяСтрока.Характеристика      = Строка.ХарактеристикаНабора;
			НоваяСтрока[ИмяКолонкиУпаковка] = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		КонецЦикла;

		Таблица.Колонки.Удалить("Количество");
		Таблица.Колонки.Удалить("КоличествоУпаковок");

	КонецЕсли;

	Если ИспользуетсяЦенообразование25 И Не ЕстьСерия Тогда
		Таблица.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	КонецЕсли;

	// Получение запроса
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Параметры.Дата), Параметры.Дата, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Валюта", Параметры.Валюта);
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.ПустаяСсылка());

	ИменаКолонок = ИменаКолонокВременнойТаблицыТоваров();
	ИменаКолонок.ИмяКолонкиНомерСтроки = 	"НомерСтроки";
	ИменаКолонок.ИмяКолонкиСерия = 			"Серия";
	ИменаКолонок.ИмяКолонкиУпаковка = 		ИмяКолонкиУпаковка;

	Если ИспользуетсяЦенообразование25 Тогда
		Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыТоваров2_5("", "втТаблицаТовары", ИменаКолонок);
	Иначе
		Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыТоваров("", "втТаблицаТовары", ИменаКолонок);
	КонецЕсли;

	НеОчищатьПроизвольныеЦены = Ложь;
	Если ЗначениеЗаполнено(Параметры.ВидЦены) Тогда

		Запрос.УстановитьПараметр("ВидЦены", Параметры.ВидЦены);
		Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());

		Если ИспользуетсяЦенообразование25 Тогда
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦен2_5("втТаблицаЦены", "втТаблицаТовары", Истина);
		Иначе
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦен("втТаблицаЦены", "втТаблицаТовары", Истина);
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|;
		|ВЫБРАТЬ
		|	втТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	втТаблицаЦены.ВидЦены КАК ПолеВидЦеныНаЗамену,
		|	втТаблицаЦены.Цена КАК ПолеЦенаНаЗамену
		|ИЗ
		|	втТаблицаТовары КАК втТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаЦены КАК втТаблицаЦены
		|		ПО (втТаблицаЦены.НомерСтроки = втТаблицаТовары.НомерСтроки)";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПолеЦенаНаЗамену", Параметры.ПолеЦена);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПолеВидЦеныНаЗамену", Параметры.ПолеВидЦены);

	ИначеЕсли ЗначениеЗаполнено(Параметры.Соглашение) Тогда

		НеОчищатьПроизвольныеЦены = ЕстьЦена И ЕстьВидЦены;

		Запрос.УстановитьПараметр("Соглашение", Параметры.Соглашение);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("НалогообложениеНДС", Параметры.НалогообложениеНДС);
		Запрос.УстановитьПараметр("ВозвращатьМногооборотнуюТару", Параметры.ВозвращатьМногооборотнуюТару);
		Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());

		Если ИспользуетсяЦенообразование25 Тогда

			ВидыЦенСоглашения = ВидыЦенПартнера(Параметры.Соглашение);
			Если ВидыЦенСоглашения.Количество() = 0 Тогда
				Возврат ЦеныЗаполнены;
			КонецЕсли;

			Запрос.УстановитьПараметр("ВидыЦен", ВидыЦенСоглашения);
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению2_5("втТаблицаТовары");
		Иначе
#Удаление			
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению("втТаблицаЦеныПоСоглашению", "втТаблицаТовары");
#КонецУдаления
#Вставка
			если ПараметрыЗаполнения.Свойство("Подразделение") и значениезаполнено(ПараметрыЗаполнения.Подразделение) тогда
				Запрос.УстановитьПараметр("ФорматПодразделения", ПараметрыЗаполнения.Подразделение.ФорматПодразделения);
				Запрос.УстановитьПараметр("РегионПрисутствия", ПараметрыЗаполнения.Подразделение.РегионПрисутствия);
				Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению_НЦ("втТаблицаЦеныПоСоглашению", "втТаблицаТовары");
			иначе	
				Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоСоглашению("втТаблицаЦеныПоСоглашению", "втТаблицаТовары");	
			конецесли;
#КонецВставки  
			Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦен("втТаблицаЦеныПоВидуЦен", "втТаблицаЦеныПоСоглашению", Ложь);
			Запрос.Текст = Запрос.Текст + "
			|;
			|ВЫБРАТЬ
			|	втТаблицаЦеныПоСоглашению.НомерСтроки КАК НомерСтроки,
			|	втТаблицаЦеныПоСоглашению.ВидЦены КАК ВидЦены,
			|	втТаблицаЦеныПоСоглашению.СтавкаНДС КАК СтавкаНДС,
			|	втТаблицаЦеныПоСоглашению.СрокПоставки КАК СрокПоставки,
			|	ВЫБОР
			|		КОГДА втТаблицаЦеныПоСоглашению.Цена = 0
			|			ТОГДА втТаблицаЦеныПоВидуЦен.Цена
			|		ИНАЧЕ втТаблицаЦеныПоСоглашению.Цена
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	втТаблицаЦеныПоСоглашению КАК втТаблицаЦеныПоСоглашению
			|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаЦеныПоВидуЦен КАК втТаблицаЦеныПоВидуЦен
			|		ПО (втТаблицаЦеныПоВидуЦен.НомерСтроки = втТаблицаЦеныПоСоглашению.НомерСтроки)";
		КонецЕсли;

		УчетНДСУП.УстановитьПараметрыЗапросаСтавкиНДС(Запрос.Параметры, Параметры.Организация, Параметры.Дата);

	ИначеЕсли Параметры.Свойство("Партнер") И ЗначениеЗаполнено(Параметры.Партнер) И ИспользуетсяЦенообразование25 Тогда

		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
		Запрос.УстановитьПараметр("Организация", ?(Параметры.Свойство("Организация"), Параметры.Организация, Справочники.Организации.ПустаяСсылка()));
		Запрос.УстановитьПараметр("НалогообложениеНДС", ?(Параметры.Свойство("НалогообложениеНДС"), Параметры.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ПустаяСсылка()));
		Запрос.УстановитьПараметр("ВозвращатьМногооборотнуюТару", ?(Параметры.Свойство("ВозвращатьМногооборотнуюТару"), Параметры.ВозвращатьМногооборотнуюТару, Ложь));
		Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());

		Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапросаВременнойТаблицыЦенПоПартнеру2_5("втТаблицаТовары");
		ВидыЦенПартнера = ВидыЦенПартнера(Параметры.Партнер);
		Если ВидыЦенПартнера.Количество() = 0 Тогда
			Возврат ЦеныЗаполнены;
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидыЦен", ВидыЦенПартнера);

		УчетНДСУП.УстановитьПараметрыЗапросаСтавкиНДС(Запрос.Параметры, Параметры.Организация, Параметры.Дата);

	Иначе

		Возврат ЦеныЗаполнены;

	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЦеныЗаполнены;
	КонецЕсли;

	ОбрабатываемыеСтроки = Новый Массив;
	ОбрабатываемыеСтрокиСУчетомПогрешности = Новый Массив;
	Погрешности = Новый Соответствие();

	СтруктураЗаполнения = Новый Структура(Параметры.ПоляЗаполнения);
	ЕстьЗаполнениеЦены = СтруктураЗаполнения.Свойство("Цена");

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		// Расчет цен комплектующих набора
		Если Выборка.НомерСтроки > МаксимальныйИндексСтроки Тогда

			НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки));
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;

			Отбор = Новый Структура;
			Отбор.Вставить("НоменклатураНабора", НайденныеСтроки[0].Номенклатура);
			Отбор.Вставить("ХарактеристикаНабора", НайденныеСтроки[0].Характеристика);

			НайденныеСтроки = КоэффициентыПропорциональностиРасчетаЦенНаборов.НайтиСтроки(Отбор); // Массив из СтрокаТабличнойЧасти

			КоличествоНаборов = 1;
			ДанныеПоКоличествуНаборовНайденныеСтроки = ДанныеПоКоличествуНаборов.НайтиСтроки(Отбор);
			Если ДанныеПоКоличествуНаборовНайденныеСтроки.Количество() > 0 Тогда
				КоличествоНаборов = ДанныеПоКоличествуНаборовНайденныеСтроки[0].КоличествоМинимум;
			КонецЕсли;

			ОбщаяСтоимость = 0;
			СуммаКРаспределению = Выборка.Цена * КоличествоНаборов;

			СлужебнаяТЧ = Новый ТаблицаЗначений;
			СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
			СлужебнаяТЧ.Колонки.Добавить("Количество");
			СлужебнаяТЧ.Колонки.Добавить("Стоимость");
			Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл

				СтрокаТЧ = ТабличнаяЧасть[ТекущаяСтрока.НомерСтроки - 1];

				Если ЕстьКодСтроки И СтрокаТЧ.КодСтроки <> 0 Тогда
					Продолжить;
				КонецЕсли;

				Стоимость = ТекущаяСтрока.Цена;
				Количество = ?(ЕстьКоличествоУпаковок, СтрокаТЧ.КоличествоУпаковок, СтрокаТЧ.Количество);

				НоваяСтрока = СлужебнаяТЧ.Добавить();
				НоваяСтрока.СтрокаТЧ   = СтрокаТЧ;
				НоваяСтрока.Стоимость  = Стоимость;
				НоваяСтрока.Количество = Количество;

				ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;

			КонецЦикла;
			СлужебнаяТЧ.Сортировать("Количество УБЫВ");

			НомерСтроки = 0;
			КоличествоСтрок = СлужебнаяТЧ.Количество();
			Для Каждого ТекущаяСтрока Из СлужебнаяТЧ Цикл

				СтрокаТЧ = ТекущаяСтрока.СтрокаТЧ;
				Стоимость = ТекущаяСтрока.Стоимость;
				Количество = ТекущаяСтрока.Количество;

				НомерСтроки = НомерСтроки + 1;

				ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);

				Если Количество <> 0 И ОбщаяСтоимость <> 0 Тогда
					СтрокаТЧ.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению) / Количество, 2);
				Иначе
					СтрокаТЧ.Цена = 0;
				КонецЕсли;

				ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
				СуммаКРаспределению = СуммаКРаспределению - СтрокаТЧ.Цена * Количество;

				Погрешность = 0;
				Если НомерСтроки = КоличествоСтрок Тогда
					Погрешность = СуммаКРаспределению;
				КонецЕсли;

				Если СтруктураДействий <> Неопределено Тогда
					Погрешности.Вставить(СтрокаТЧ, Погрешность);
					ОбрабатываемыеСтрокиСУчетомПогрешности.Добавить(СтрокаТЧ);
				КонецЕсли;

			КонецЦикла;

		Иначе

			ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
			Если ТипЗнч(ТабличнаяЧасть) <> Тип("ТаблицаЗначений") Тогда
				СтрокаТЧ = ТабличнаяЧасть[Выборка.НомерСтроки - 1];
			Иначе
				НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки));
				Если НайденныеСтроки.Количество() > 0 Тогда
					СтрокаТЧ = НайденныеСтроки[0];
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			Если НеОчищатьПроизвольныеЦены И ЕстьЗаполнениеЦены
				И Не ЗначениеЗаполнено(Выборка.ВидЦены) И Не ЗначениеЗаполнено(Выборка.Цена)
				И Не ЗначениеЗаполнено(СтрокаТЧ.ВидЦены) И ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
				// Не подобралась цена. В ТЧ установлена произвольная. Не перезаполняем.
				Продолжить;
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);

			Если СтруктураДействий <> Неопределено Тогда
				ОбрабатываемыеСтроки.Добавить(СтрокаТЧ);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если СтруктураДействий <> Неопределено Тогда

		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		ТабличнаяЧасть,
		КэшированныеЗначения);

		Если ОбрабатываемыеСтрокиСУчетомПогрешности.Количество() Тогда
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомПогрешностиОкругления",
			Новый Структура("ПогрешностиПоСтрокам", Погрешности));

			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			ОбрабатываемыеСтрокиСУчетомПогрешности,
			СтруктураДействий,
			ТабличнаяЧасть,
			КэшированныеЗначения);
		КонецЕсли;

	КонецЕсли;

	Возврат Истина;

КонецФункции


#КонецОбласти
