
&После("ПриСозданииНаСервере")
&НаСервере
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ЗавершитьРедактирование.Заголовок = "Завершить редактирование";
КонецПроцедуры

&ИзменениеИКонтроль("ЗакрытьИСформировать")
&НаКлиенте
Процедура Док_ЗакрытьИСформировать(Команда)
	Если МодальныйРежим Или РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс
		Или ВладелецФормы = Неопределено Тогда
		Закрыть(Истина);
		Возврат;
	КонецЕсли;

	РезультатВыбора = ОтчетыКлиентСервер.ПараметрыОбновленияФормыОтчета(
		ВариантыОтчетовСлужебныйКлиентСервер.ИмяСобытияФормыНастроек());
	РезультатВыбора.КомпоновщикНастроекКД = Отчет.КомпоновщикНастроек;
	РезультатВыбора.ВариантМодифицирован = ВариантМодифицирован;
	РезультатВыбора.ПользовательскиеНастройкиМодифицированы = ВариантМодифицирован Или ПользовательскиеНастройкиМодифицированы;
	#Удаление
	РезультатВыбора.Переформировать = Истина;
	#КонецУдаления

	Если РезультатВыбора.ПользовательскиеНастройкиМодифицированы Тогда
		РезультатВыбора.СброситьПользовательскиеНастройки = Истина;
	КонецЕсли;

	ОповеститьОВыборе(РезультатВыбора);
КонецПроцедуры
