#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Номенклатура;
	КонецЕсли;  
	
	Если Параметры.Свойство("ЗаказПоставщику") Тогда
		ЗаказПоставщику = Параметры.ЗаказПоставщику;
	КонецЕсли; 
	
	Если Параметры.Свойство("ПриходныйОрдерНаТовары") Тогда
		ПриходныйОрдерНаТовары = Параметры.ПриходныйОрдерНаТовары;
	КонецЕсли; 
		 
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Элементы.ГруппаФотоТовара.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаКоманды.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
		
		Элементы.Декорация1.Шрифт  = Новый Шрифт(Элементы.Декорация1.Шрифт, , , , , , , 115);
		Элементы.Выбрать.Шрифт = Новый Шрифт(Элементы.Выбрать.Шрифт, , , , , , , 115);
		Элементы.НовыйШтрихкод.ШрифтЗаголовка = Новый Шрифт(Элементы.НовыйШтрихкод.ШрифтЗаголовка, , , , , , , 115);
		Элементы.НовыйШтрихкод.Шрифт = Новый Шрифт(Элементы.НовыйШтрихкод.Шрифт, , , , , , , 115);  
		Элементы.ДобавитьШКиЗакрыть.Шрифт = Новый Шрифт(Элементы.ДобавитьШКиЗакрыть.Шрифт, , , , , , , 110);
		Элементы.ПродолжитьБезДобавленияШтрихкода.Шрифт = Новый Шрифт(Элементы.ПродолжитьБезДобавленияШтрихкода.Шрифт, , , , , , , 110);
	#КонецЕсли

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
	    Если ЭтаФорма.ВводДоступен() Тогда
			Кнопки = КнопкиОповещения();
			ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСпособДобавленияФото", Этаформа), "Загрузите фото.", Кнопки);	
		КонецЕсли;
	#Иначе
		ДобавитьФото();
	#КонецЕсли
			
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьШКиЗакрыть(Команда)

	ДобавитьШКСервер(НовыйШтрихкод, Номенклатура);
	ЗакрытьФорму();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьБезДобавленияШтрихкода(Команда)
	
	ЗакрытьФорму();
	
КонецПроцедуры    

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция КнопкиОповещения()
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Отмена");
	Кнопки.Добавить("С телефона");
	Кнопки.Добавить("Камера");
	
	Возврат Кнопки;
	
КонецФункции 

&НаКлиенте
Процедура ВыбратьСпособДобавленияФото(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "Камера" Тогда
		СделатьФотоКамерой();
	ИначеЕсли 
		РезультатВопроса = "С телефона" Тогда
		ДобавитьФото();
	Иначе
		Возврат;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФото()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.Фильтр = "Все картинки (*.jpg;*.jpeg;*.tif;*.png)"
		+ "|*.jpg;*.jpeg;*.tif;*.png|";
	Диалог.МножественныйВыбор = Истина;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	Если Диалог.Выбрать() Тогда 
		МассивФайлов = Диалог.ВыбранныеФайлы;
		Сч = 0;
		Для каждого Файл Из МассивФайлов Цикл 
			ВыбранныйФайл = Новый Файл(Файл); 
            ДвоичныеДанные = Новый ДвоичныеДанные(ВыбранныйФайл.ПолноеИмя); 
			#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
			    ПредставлениеФайла = ВыбранныйФайл.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
				РасширениеФайла = СтрРазделить(ПредставлениеФайла, ".");
				Расширение = РасширениеФайла[РасширениеФайла.Количество() - 1];
			#Иначе
				Расширение = ВыбранныйФайл.Расширение;
			#КонецЕсли
			Попытка
				ДобавитьНовыйПрисоединенныйФайл(ДвоичныеДанные, Расширение);
				Сч = Сч + 1;
			Исключение
			КонецПопытки;
		КонецЦикла;
		ПоказатьПредупреждение( , "Загружено " + Сч + " из " + МассивФайлов.Количество() + " файлов", 1);
		
		Элементы.ГруппаФотоТовара.Видимость = Ложь;
		Элементы.ГруппаШК.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура СделатьФотоКамерой()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		ДанныеМультимедиа = Неопределено;
		
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда	
			ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок(, Новый РазрешениеКамерыУстройства(1920, 2400) , 100, , ТипПодсветкиКамеры.Включена);	
		Иначе    
			Сообщить(НСтр("ru = 'Съемка фото не поддерживается.'", "ru"));
		КонецЕсли; 
		
		Если ДанныеМультимедиа <> Неопределено Тогда
			Попытка
				ДобавитьНовыйПрисоединенныйФайл(ДанныеМультимедиа.ПолучитьДвоичныеДанные(), ДанныеМультимедиа.РасширениеФайла);
				ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершение", Этаформа), "Изображение успешно загружено." + Символы.ПС + "Добавить новый снимок?", РежимДиалогаВопрос.ДаНет, 0.1);
			Исключение
				Ошибка = ИнформацияОбОшибке();
				ПодробнаяОшибка = ПодробноеПредставлениеОшибки(Ошибка);
				Сообщить(ПодробнаяОшибка);
			КонецПопытки;
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СделатьФотоКамерой();
	Иначе 
		Элементы.ГруппаФотоТовара.Видимость = Ложь;
		Элементы.ГруппаШК.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыйПрисоединенныйФайл(ДвоичныеДанные, Расширение)
	
	УстановитьПривилегированныйРежим(Истина); 
	
	СчетчикФото = СчетчикФото + 1;
	ПриходныйОрдер = ?(ЗначениеЗаполнено(ПриходныйОрдерНаТовары), "_" + СтрЗаменить(Строка(ПриходныйОрдерНаТовары), ":", "."), "");
	Имя = "Неоп.товар" + ПриходныйОрдер + " (" + СчетчикФото + ")";
 	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.Автор = ПараметрыСеанса.ТекущийПользователь.Наименование;
	ПараметрыФайла.ВладелецФайлов = ЗаказПоставщику; 
	ПараметрыФайла.ИмяБезРасширения = Имя;
	ПараметрыФайла.РасширениеБезТочки = Расширение;
	РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВХранилище);	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьШКСервер(НовыйШтрихкод, Номенклатура)
	
	МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Штрихкод = НовыйШтрихкод;
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Записать(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Закрыть(Номенклатура);
	
КонецПроцедуры

#КонецОбласти
