
Функция ВводНаОснованииКлиент (ОписаниеКоманды, Параметры) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, Параметры);
	
	ПараметрКоманды = Параметры.МассивСсылок[0];
	
	// Выбор команд
	Если Параметры.ОписаниеКоманды.Идентификатор = "ПриобретениеТоваровУслуг_ПорчаТоваров" тогда
		
		ФормаДок = ПолучитьФорму("Документ.ПорчаТоваров.ФормаОбъекта");
		ДанныеФормы = ФормаДок.Объект;
		ВводНаОснованииДополнительноСервер.ЗаполнитьДокументПорчиНаОснованииДокументаПоступления(ПараметрКоманды,ДанныеФормы);
		КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
		ФормаДок.Открыть();
		
	ИначеЕсли Параметры.ОписаниеКоманды.Идентификатор = "ПриобретениеТоваровУслуг_ЛистСогласования" тогда 
		
		ФормаДок = ПолучитьФорму("Документ.ЛистСогласования.ФормаОбъекта");
		ДанныеФормы = ФормаДок.Объект;
		ВводНаОснованииДополнительноСервер.ЗаполнитьДокументЛистСогласованияНаОснованииДокументаПоступления(ПараметрКоманды,ДанныеФормы);
		КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
		ФормаДок.Открыть();   
		
	ИначеЕсли Параметры.ОписаниеКоманды.Идентификатор = "ПриобретениеТоваровУслуг_ПередачаТоваровМеждуОрганизациями" тогда 
		
		ФормаДок = ПолучитьФорму("Документ.ПередачаТоваровМеждуОрганизациями.ФормаОбъекта");
		ДанныеФормы = ФормаДок.Объект;
		ВводНаОснованииДополнительноСервер.ЗаполнитьДокументПередачиНаОснованииДокументаПоступления(ПараметрКоманды,ДанныеФормы);
		КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
		ФормаДок.ОбновитьОтображениеДанных();
		ФормаДок.Открыть(); 
		
	ИначеЕсли Параметры.ОписаниеКоманды.Идентификатор = "ПриобретениеТоваровУслуг_ЗаказНаДоставкуОтПоставщика" тогда
		
		ФормаДок = ПолучитьФорму("Документ.ЗаказНаДоставкуОтПоставщика.ФормаОбъекта");
		ДанныеФормы = ФормаДок.Объект;
		ВводНаОснованииДополнительноСервер.ЗаполнитьДокументЗаказНаДоставкуОтПоставщикаНаОснованииДокументаПоступления(ПараметрКоманды,ДанныеФормы);
		КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
		ФормаДок.Открыть(); 
		
	ИначеЕсли Параметры.ОписаниеКоманды.Идентификатор = "ПеремещениеТоваров_ВозвратТоваровМеждуОрганизациями" тогда
		
		ФормаДок = ПолучитьФорму("Документ.ВозвратТоваровМеждуОрганизациями.ФормаОбъекта");
		ДанныеФормы = ФормаДок.Объект;
		ВводНаОснованииДополнительноСервер.ЗаполнитьДокументВозвратТоваровМеждуОрганизациямиНаОснованииДокументаПеремещениеТоваров(ПараметрКоманды,ДанныеФормы);
		КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
		ФормаДок.Открыть();
		
	ИначеЕсли Параметры.ОписаниеКоманды.Идентификатор = "ЗаказНаДоставкуОтПоставщика_ЗаказПоставщику" Тогда
		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Параметры.МассивСсылок);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДокументыОснованияАдресХранилища", АдресВременногоХранилища);
		ОткрытьФорму("Документ.ЗаказНаДоставкуОтПоставщика.Форма.СозданиеЗаявокНаДоставкуОтПоставщика", ПараметрыФормы);
		
	конецесли;
конецФункции	
