#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СторнированиеУдержаний") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"СторнированиеУдержаний", НСтр("ru = 'Сторнирование удержаний'"), СформироватьПечатнуюФорму(МассивОбъектов));
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросФормированиеПечатнойФормы(СсылкаНаДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СторнированиеУдержанийНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(СторнированиеУдержанийНачисления.СуммаЗадержки) КАК СуммаЗадержки,
	|	СУММА(СторнированиеУдержанийНачисления.СуммаУдержания) КАК СуммаУдержания,
	|	СУММА(СторнированиеУдержанийНачисления.СуммаВозврата) КАК СуммаВозврата,
	|	СУММА(СторнированиеУдержанийНачисления.СуммаСторно) КАК СуммаСторно,
	|	СторнированиеУдержанийНачисления.Ссылка.Ссылка КАК Ссылка,
	|	СторнированиеУдержанийНачисления.Ссылка.Номер КАК Номер,
	|	СторнированиеУдержанийНачисления.Ссылка.Дата КАК Дата,
	|	СторнированиеУдержанийНачисления.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|	СторнированиеУдержанийНачисления.Ссылка.Автор КАК Автор,
	|	СторнированиеУдержанийНачисления.Ссылка.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.СторнированиеУдержаний.Начисления КАК СторнированиеУдержанийНачисления
	|ГДЕ
	|	СторнированиеУдержанийНачисления.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СторнированиеУдержанийНачисления.Сотрудник,
	|	СторнированиеУдержанийНачисления.Ссылка.Ссылка,
	|	СторнированиеУдержанийНачисления.Ссылка.Номер,
	|	СторнированиеУдержанийНачисления.Ссылка.Дата,
	|	СторнированиеУдержанийНачисления.Ссылка.ПериодНачисления,
	|	СторнированиеУдержанийНачисления.Ссылка.Автор,
	|	СторнированиеУдержанийНачисления.Ссылка.Комментарий
	|
	|УПОРЯДОЧИТЬ ПО
	|	СторнированиеУдержанийНачисления.Сотрудник.Наименование
	|ИТОГИ
	|	СУММА(СуммаЗадержки),
	|	СУММА(СуммаУдержания),
	|	СУММА(СуммаВозврата),
	|	СУММА(СуммаСторно)
	|ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	
	Возврат Выборка;
КонецФункции


Функция СформироватьПечатнуюФорму  (СсылкаНаДокумент) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетОбработки = ПолучитьМакет("СторнированиеУдержаний");
	
	ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("Заголовок");
	ОбластьНачисленияШапка = МакетОбработки.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = МакетОбработки.ПолучитьОбласть("Начисления");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	
Для каждого Ссылка из СсылкаНаДокумент Цикл			
		Выборка = ЗапросФормированиеПечатнойФормы(Ссылка.Ссылка);
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьНачисленияШапка.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьНачисления.Параметры,Выборка);
	 		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,Выборка);	
			ТабличныйДокумент.Очистить();
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок,Выборка.Уровень());

		ТабличныйДокумент.Вывести(ОбластьНачисленияШапка);
		Ном=1;
		ВыборкаНачисления = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ОбластьНачисления.Параметры.НомерСтроки= Ном;
			ТабличныйДокумент.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
				Ном=Ном+1;

		КонецЦикла;
	ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьПодвал);

		
	КонецЦикла;

		КонецЦикла;
	Возврат ТабличныйДокумент;

КонецФункции

#КонецЕсли


