&НаСервере
Процедура Спр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПраваДляИзменения = ПроверитьПрава();
	
	Элементы.ОграничениеВыбораСегмента.Доступность = ПраваДляИзменения;
	Элементы.Сформировать.Доступность = ПраваДляИзменения;
	Элементы.ПроверятьНаВхождениеПриСозданииНового.Доступность = ПраваДляИзменения; 
	Элементы.ЗапретОтгрузки.Доступность = ПраваДляИзменения;
	Элементы.ОграничениеВыбораСегмента.Доступность = ПраваДляИзменения; 
	Элементы.ВыгружатьНаСайт.Доступность = ПраваДляИзменения;   
	
	Если Элементы.Найти("РазрешитьРедактированиеРеквизитовОбъекта") <> Неопределено Тогда
		Элементы.РазрешитьРедактированиеРеквизитовОбъекта.Доступность = ПраваДляИзменения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПрава() 
	Возврат (рольДоступна("ПолныеПрава") или рольДоступна("ДобавлениеИзменениеСегментовПартнеров_ОтделАналитики"));
КонецФункции	

&НаКлиенте
&После("УправлениеДоступностью")
Процедура Док_УправлениеДоступностью()
	ПраваДляИзменения = ПроверитьПрава(); 
	Элементы.ПроверятьНаВхождениеПриСозданииНового.Доступность = ПраваДляИзменения; 
КонецПроцедуры

