		  
#Область ОбработчикиСобытийФормы		  
		  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьНачальныеЗначения();
	УстановитьТекстЗапросаСписка();
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если Тип(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") И ИсточникВыбора.ИмяФормы = "РегистрСведений.ЦеновыеГруппыБезБонусов.Форма.ФормаЗагрузки" Тогда
		Элементы.Список.Обновить();
	КонецЕсли
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФильтрПоЗаписямПриИзменении(Элемент)
	Элементы.ФильтрПоДате.Доступность = ?(ФильтрПоЗаписям  = "НаДату", Истина, Ложь);
	УстановитьТекстЗапросаСписка();
КонецПроцедуры 

&НаКлиенте
Процедура ФильтрПоДатеПриИзменении(Элемент)
	УстановитьТекстЗапросаСписка();	
КонецПроцедуры  

#КонецОбласти   


#Область ОбработчикиСобытийТабличнойЧастиФормы

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)    
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные.ДатаНачалаДействия < НачалоДня(ТекущаяДата())  Тогда
		Отказ = Истина;
		Сообщить("Данные за прошедший период не удаляются");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;  
	
	Если ТекущиеДанные.ДатаНачалаДействия <= НачалоДня(ТекущаяДата()) Тогда
		
		Отказ = Истина;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончанияДействия) И ТекущиеДанные.ДатаОкончанияДействия <= НачалоДня(ТекущаяДата()) Тогда 
			Сообщить("Данные за прошедший период не редактируются")			
		Иначе
			СтруктураЗаписи = Новый Структура("Период, ЦеноваяГруппа", ТекущиеДанные.ДатаНачалаДействия, ТекущиеДанные.ЦеноваяГруппа);
			МассивСтруктураЗаписи = Новый Массив;
			МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
			КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.ЦеновыеГруппыБезБонусов", МассивСтруктураЗаписи);
			                              
			Параметрыформы = Новый Структура;
			Параметрыформы.Вставить("Ключ", КлючЗаписи);                            
			Параметрыформы.Вставить("ЗапретИзмененияДатыНачала", Истина);                            
			ОткрытьФорму("РегистрСведений.ЦеновыеГруппыБезБонусов.ФормаЗаписи", Параметрыформы);      
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Загрузить(Команда)  
	Если ПравоИзмененияРегистра() Тогда	
		ОткрытьФорму("РегистрСведений.ЦеновыеГруппыБезБонусов.Форма.ФормаЗагрузки", , ЭтаФорма);
	Иначе
		Сообщить("Нет права на внесение изменений")
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьНачальныеЗначения() 
	ФильтрПоЗаписям  = "НаДату";
	ФильтрПоДате = ТекущаяДата();
КонецПроцедуры  

&НаСервере
Процедура УстановитьТекстЗапросаСписка();     
	
	ПоказыватьНаДату = ФильтрПоЗаписям  = "НаДату";
	Список.ОсновнаяТаблица = ?(ПоказыватьНаДату, "РегистрСведений.ЦеновыеГруппыБезБонусов.СрезПоследних", "РегистрСведений.ЦеновыеГруппыБезБонусов"); 
	Список.ДинамическоеСчитываниеДанных = Истина;	
	
	ИсходныйТекст = "
	|ВЫБРАТЬ                                         
	|	Период, 	
	|	Период КАК ДатаНачалаДействия, 
	|	ДатаОкончанияДействия,
	|	ЦеноваяГруппа, 
	|   &Дата
	|ИЗ   
	|	%ВыборИзРегистра 
	|ГДЕ	
	|	ВЫБОР 
	|		КОГДА &НаДату И ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)	
	|		ТОГДА ДатаОкончанияДействия >= &Дата
	|		ИНАЧЕ Истина
	|	КОНЕЦ"; 
	 
	ИсходныйТекст = СтрЗаменить(ИсходныйТекст, "%ВыборИзРегистра", 
		?(ПоказыватьНаДату, "РегистрСведений.ЦеновыеГруппыБезБонусов.СрезПоследних(&Дата) КАК НачалоПериода", "РегистрСведений.ЦеновыеГруппыБезБонусов КАК НачалоПериода"));
	
	Список.ТекстЗапроса = ИсходныйТекст;
	Список.Параметры.УстановитьЗначениеПараметра("НаДату", ?(ПоказыватьНаДату, Истина, Ложь));
	Список.Параметры.УстановитьЗначениеПараметра("Дата", ФильтрПоДате);
КонецПроцедуры                           

&НаСервере
Функция ПравоИзмененияРегистра()
	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ЦеновыеГруппыБезБонусов);
КонецФункции
#КонецОбласти



