#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Перед("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);	
КонецПроцедуры

&После("ПередУдалением")
Процедура Док_ПередУдалением(Отказ)
	ДопМодульСервер.ПроверитьНаличиеРасходногоОрдераНаТовары(Ссылка, Отказ);
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	РегистрыСведений.СостоянияОтгрузкиНакладных.ОбновитьСостояниеОтгрузкиНакладной(ЭтотОбъект,Склад);

КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	
	РегистрыСведений.СостоянияОтгрузкиНакладных.УдалениеЗаписейВРегистре(ЭтотОбъект);

КонецПроцедуры

#КонецЕсли


