
&НаКлиенте
Процедура ТоварыКоличествоФактПриИзменении(Элемент)
ПересчитатьРасхожденияПланаИФакта();	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда 
		ДокументОснование = Параметры.Документ;
	КонецЕсли;

	Товары.Загрузить(ЗаполнитьТабличнуюЧасть(ДокументОснование));
	
	ЗаполнитьРасхождения();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьТабличнуюЧасть(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.КодСтроки КАК КодСтроки,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	0 КАК КоличествоФакт,
		|	0 КАК КоличествоБрак
		|ПОМЕСТИТЬ ВТ_ТоварыПоОснованию
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|	И ЗаказПоставщикуТовары.Отменено = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.КодСтроки,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Характеристика,
		|	ПеремещениеТоваровТовары.КоличествоУпаковок,
		|	0,
		|	0
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыПоОснованию.КодСтроки КАК КодСтроки,
		|	ВТ_ТоварыПоОснованию.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыПоОснованию.Характеристика КАК Характеристика,
		|	СУММА(ВТ_ТоварыПоОснованию.КоличествоУпаковок) КАК Количество,
		|	СУММА(ВТ_ТоварыПоОснованию.КоличествоФакт) КАК КоличествоФакт,
		|	СУММА(ВТ_ТоварыПоОснованию.КоличествоБрак) КАК КоличествоБрак
		|ИЗ
		|	ВТ_ТоварыПоОснованию КАК ВТ_ТоварыПоОснованию
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыПоОснованию.КодСтроки,
		|	ВТ_ТоварыПоОснованию.Номенклатура,
		|	ВТ_ТоварыПоОснованию.Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	Возврат РезультатЗапроса;	
	
КонецФункции

&НаСервере
Процедура ВыбратьОтменитьВсеНаСервере(ВыбратьИлиОтменитьЗначение)
	ТЗ = Товары.Выгрузить();
	ТЗ.ЗаполнитьЗначения(ВыбратьИлиОтменитьЗначение,"Выбрать");
	Товары.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеИлиОтменитьВыборПриИзменении(Элемент)
	ВыбратьОтменитьВсеНаСервере(ВыбратьВсеИлиОтменитьВыбор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоФактПоПлану(Команда)
	 ВывестиВопросОбработкаВыбранныхИлиВсех("ЗаполнениеКоличестваФактическогоПоПлановому");
	 ЗаполнитьРасхождения();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВопросОбработкаВыбранныхИлиВсех(ВыбранныйВариантДействий)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбранныхИлиВсех", ЭтотОбъект,ВыбранныйВариантДействий);
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(КодВозвратаДиалога.Нет,"Выбранные");
	СписокЗначений.Добавить(КодВозвратаДиалога.Да,"Все");
	СписокЗначений.Добавить(КодВозвратаДиалога.Отмена,"Отменить");
	
    ПоказатьВопрос(Оповещение,"Обработать выбранные строки или все?",СписокЗначений, 0,КодВозвратаДиалога.Да); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбранныхИлиВсех(Результат, Параметры) Экспорт
	
	ОбработкаТолькоВыбранных = Ложь;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьВыбранныйВариантОформления(ОбработкаТолькоВыбранных,Параметры);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОбработкаТолькоВыбранных = Истина;
		ОбработатьВыбранныйВариантОформления(ОбработкаТолькоВыбранных,Параметры);		
	КонецЕсли;	
 
КонецПроцедуры

Процедура ОбработатьВыбранныйВариантОформления(ОбработкаТолькоВыбранных,ВыбранныйВариантДействий)
	
	Если ВыбранныйВариантДействий = "ЗаполнениеКоличестваФактическогоПоПлановому" Тогда  
		Для каждого Строка из Товары Цикл
			Если ОбработкаТолькоВыбранных Тогда
				Если Строка.Выбрать Тогда
					Строка.КоличествоФакт = Строка.Количество;
				КонецЕсли;
			Иначе
				Строка.КоличествоФакт = Строка.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ВыбранныйВариантДействий = "ОчищениеКоличестваФакт" Тогда  
		Для каждого Строка из Товары Цикл
			Если ОбработкаТолькоВыбранных Тогда
				Если Строка.Выбрать Тогда
					Строка.КоличествоФакт = 0;
				КонецЕсли;
			Иначе
				Строка.КоличествоФакт = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ВыбранныйВариантДействий = "ОчищениеКоличестваБрак" Тогда  
		Для каждого Строка из Товары Цикл
			Если ОбработкаТолькоВыбранных Тогда
				Если Строка.Выбрать Тогда
					Строка.КоличествоБрак = 0;
				КонецЕсли;
			Иначе
				Строка.КоличествоБрак = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКоличествоФакт(Команда)
	ВывестиВопросОбработкаВыбранныхИлиВсех("ОчищениеКоличестваФакт");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьРасхожденияПланаИФакта()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока.Количество > ТекущаяСтрока.КоличествоФакт Тогда
			ТекущаяСтрока.Расхождение = ТекущаяСтрока.Количество - ТекущаяСтрока.КоличествоФакт;
			ТекущаяСтрока.Описание = "Недостачи";
		ИначеЕсли ТекущаяСтрока.Количество < ТекущаяСтрока.КоличествоФакт Тогда
			ТекущаяСтрока.Расхождение = ТекущаяСтрока.КоличествоФакт - ТекущаяСтрока.Количество;
			ТекущаяСтрока.Описание = "Излишки";
		Иначе
			ТекущаяСтрока.Расхождение = 0;
			ТекущаяСтрока.Описание = "";
	КонецЕсли;

	Если ТекущаяСтрока.КоличествоБрак > 0 Тогда
			ТекущаяСтрока.Описание = ТекущаяСтрока.Описание + ?(ПустаяСтрока(ТекущаяСтрока.Описание) = Истина, "Брак", ", Брак");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерезаполнитьТабличнуюЧасть(Команда)
	
	ПерезаполнитьТабличнуюЧастьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТабличнуюЧастьНаСервере()
	
	Товары.Загрузить(ЗаполнитьТабличнуюЧасть(ДокументОснование));
	
	ЗаполнитьРасхождения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКоличествоБрак(Команда)
	ВывестиВопросОбработкаВыбранныхИлиВсех("ОчищениеКоличестваБрак");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасхождения()
	
	Для каждого Строка из Товары Цикл
			
		Если Строка.Количество > Строка.КоличествоФакт Тогда
			Строка.Расхождение = Строка.Количество - Строка.КоличествоФакт;
			Строка.Описание = "Недостачи";
		ИначеЕсли Строка.Количество < Строка.КоличествоФакт Тогда
			Строка.Расхождение = Строка.КоличествоФакт - Строка.Количество;
			Строка.Описание = "Излишки";
		Иначе
			Строка.Расхождение = 0;
			Строка.Описание = "";
		КонецЕсли;
		
		Если Строка.КоличествоБрак > 0 Тогда
			Строка.Описание = Строка.Описание + ?(ПустаяСтрока(Строка.Описание) = Истина, "Брак", ", Брак");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоБракПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если ТекущаяСтрока.КоличествоБрак > 0 Тогда
			ТекущаяСтрока.Описание = ТекущаяСтрока.Описание + ?(ПустаяСтрока(ТекущаяСтрока.Описание) = Истина, "Брак", ", Брак");
		Иначе
			Если ТекущаяСтрока.Количество > ТекущаяСтрока.КоличествоФакт Тогда
			ТекущаяСтрока.Описание = "Недостачи";
		ИначеЕсли ТекущаяСтрока.Количество < ТекущаяСтрока.КоличествоФакт Тогда
			ТекущаяСтрока.Описание = "Излишки";
	КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоступление(Команда)
	
	ЗаполнитьПоступлениеНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоПоФакту(Команда)
	
	ЗаполнитьПоступлениеНаСервере(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоступлениеНаСервере(ПоФакту=Ложь)
	
	ТоварыКПоступлению.Очистить();
	
	Для каждого Строка из Товары Цикл
		
		НоваяСтрокаПоступления = ТоварыКПоступлению.Добавить();
	    ЗаполнитьЗначенияСвойств(НоваяСтрокаПоступления,Строка);
		Если ПоФакту Тогда
	      НоваяСтрокаПоступления.Количество = Строка.КоличествоФакт;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьНедостачи(Команда)
	ЗаполнитьНедостачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНедостачиНаСервере()
	
	ТоварыКПеремещениюНедостачи.Очистить();
	
	Для каждого Строка из Товары Цикл
		
		Если Строка.Количество > Строка.КоличествоФакт Тогда
			
			НоваяСтрока = ТоварыКПеремещениюНедостачи.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.Количество = Строка.Расхождение;
		
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьБракНаСервере()
	ТоварыКПеремещениюБрак.Очистить();
	
	Для каждого Строка из Товары Цикл
		
		Если Строка.КоличествоБрак > 0 Тогда
			
			НоваяСтрока = ТоварыКПеремещениюБрак.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.Количество = Строка.КоличествоБрак;
		
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьБрак(Команда)
	ЗаполнитьБракНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриобретениеТоваровИУслуг(Команда)
	
	Если ТоварыКПоступлению.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("Поступление");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;
		
КонецПроцедуры

Процедура ПолучитьТЗТовары(ИмяТабличнаяЧасть)
ТоварыИзменитьВПеремещении.Очистить();	
	
Если ИмяТабличнаяЧасть = "ТоварыКПоступлению" Тогда	
ТоварыИзменитьВПеремещении.Загрузить(ТоварыКПоступлению.Выгрузить());
КонецЕсли;

Если ИмяТабличнаяЧасть = "ТоварыКПеремещениюНедостачи" Тогда
ТоварыИзменитьВПеремещении.Загрузить(ТоварыКПеремещениюНедостачи.Выгрузить());
КонецЕсли;

Если ИмяТабличнаяЧасть = "Товары" Тогда
ТоварыИзменитьВПеремещении.Загрузить(Товары.Выгрузить());
КонецЕсли;

Если ИмяТабличнаяЧасть = "ТоварыКПеремещениюБрак" Тогда
ТоварыИзменитьВПеремещении.Загрузить(ТоварыКПеремещениюБрак.Выгрузить());
КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура СоздатьПеремещениеНаСкладНедостачи(Команда)
	
	Если ТоварыКПеремещениюНедостачи.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеНедостачи");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеремещениеНаСкладБрак(Команда)
	
	Если ТоварыКПеремещениюБрак.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеБрак");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредварительныеДанные(Команда)
	ЗаполнитьПоступлениеНаСервере(Истина);
	ЗаполнитьНедостачиНаСервере();
    ЗаполнитьБракНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиОбработать(Команда)
	
	ЗаполнитьПоступлениеНаСервере(Ложь);
	ЗаполнитьНедостачиНаСервере();
    ЗаполнитьБракНаСервере();
		
	Если ТоварыКПоступлению.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("Поступление");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;

	Если ТоварыКПеремещениюНедостачи.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеНедостачи");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;

	Если ТоварыКПеремещениюБрак.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеБрак");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;

	Закрыть(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Элементы.СозданиеПриобретениеТоваровИУслуг.Видимость=Истина;
		Элементы.ТоварыИзменитьПеремещение.Видимость=Ложь;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Элементы.СозданиеПриобретениеТоваровИУслуг.Видимость=Ложь;
		Элементы.ТоварыИзменитьПеремещение.Видимость=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПеремещение(Команда)
	ЗаполнитьТаблицу();
	Закрыть(ТоварыИзменитьВПеремещении);
КонецПроцедуры

Функция ПолучитьСозданныйДокумент(ТипДокумента)
Если ТипДокумента = "Поступление" Тогда
ТЗ = ТоварыКПоступлению.Выгрузить();
ссылкаНаДок = Альтерра_СкладСервер.СоздатьПриобретениеТоваровУслуг(ДокументОснование, ТЗ);
КонецЕсли;
Если ТипДокумента = "ПеремещениеНедостачи" Тогда
ТЗ = ТоварыКПеремещениюНедостачи.Выгрузить();
СсылкаНаПеремещение = Альтерра_СкладСервер.СоздатьПеремещениеНедостачиБрак(ДокументОснование, ТЗ, Ложь,Истина);
ссылкаНаДок = СсылкаНаПеремещение.Недостачи;
КонецЕсли;
Если ТипДокумента = "ПеремещениеБрак" Тогда
ТЗ = ТоварыКПеремещениюБрак.Выгрузить();
СсылкаНаПеремещение = Альтерра_СкладСервер.СоздатьПеремещениеНедостачиБрак(ДокументОснование, ТЗ, Истина,Ложь);
ссылкаНаДок = СсылкаНаПеремещение.Брак;
КонецЕсли;
Возврат ссылкаНаДок;
КонецФункции


&НаКлиенте
Процедура АвтоматическиОбработатьПоФакту(Команда)
	ЗаполнитьПоступлениеНаСервере(Истина);
    ЗаполнитьБракНаСервере();
		
	Если ТоварыКПоступлению.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("Поступление");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;
	
	Если ТоварыКПеремещениюБрак.Количество() > 0 Тогда
		ссылкаНаДок = ПолучитьСозданныйДокумент("ПеремещениеБрак");
		ОткрытьЗначение(ссылкаНаДок);
	Иначе
		Сообщить("Пустая табличная часть!");
	КонецЕсли;
	
	Закрыть(Истина);

КонецПроцедуры


&НаКлиенте
Процедура ОтменитьНепоставленныеСтроки(Команда)
	Закрыть(Истина);
КонецПроцедуры

Процедура ЗаполнитьТаблицу()
	
	Если ДокументОснование.ПеремещениеПоЗаказам Тогда
		Для каждого Строка из Товары Цикл
			ПараметрыОтбора = Новый Структура("КодСтроки",Строка.КодСтроки);
			НайденныеСтроки = ДокументОснование.Товары.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()<>0 Тогда
				Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
					Если Строка.КоличествоФакт > 0 Тогда
						Если НайденнаяСтрока.Количество <= Строка.КоличествоФакт Тогда
                            НоваяСтрока1 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
						Если НайденнаяСтрока.Количество < Строка.КоличествоФакт Тогда
							НоваяСтрока2 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока2,НайденнаяСтрока);
							НоваяСтрока2.КодСтроки = 0;
							НоваяСтрока2.Количество = Строка.КоличествоФакт - НайденнаяСтрока.Количество;
							НоваяСтрока2.КоличествоУпаковок = Строка.КоличествоФакт - НайденнаяСтрока.Количество;
						КонецЕсли;
					Иначе
						    НоваяСтрока1 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
							НоваяСтрока1.Количество = Строка.КоличествоФакт;
							НоваяСтрока1.КоличествоУпаковок = Строка.КоличествоФакт;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе
				НоваяСтрока = ТоварыИзменитьВПеремещении.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				НоваяСтрока.КодСтроки = 0;
				НоваяСтрока.Количество = Строка.КоличествоФакт;
				НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого Строка из Товары Цикл
			ПараметрыОтбора = Новый Структура("Номенклатура,Характеристика",Строка.Номенклатура,Строка.Характеристика);
			НайденныеСтроки = ДокументОснование.Товары.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()<>0 Тогда
				Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
					Если Строка.КоличествоФакт > 0 Тогда
						Если НайденнаяСтрока.Количество <= Строка.КоличествоФакт Тогда
                            НоваяСтрока1 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
						Если НайденнаяСтрока.Количество < Строка.КоличествоФакт Тогда
							НоваяСтрока2 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока2,НайденнаяСтрока);
							НоваяСтрока2.КодСтроки = 0;
							НоваяСтрока2.Количество = Строка.КоличествоФакт - НайденнаяСтрока.Количество;
							НоваяСтрока2.КоличествоУпаковок = Строка.КоличествоФакт - НайденнаяСтрока.Количество;
						КонецЕсли;
					    Иначе
						    НоваяСтрока1 = ТоварыИзменитьВПеремещении.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
							НоваяСтрока1.Количество = Строка.КоличествоФакт;
							НоваяСтрока1.КоличествоУпаковок = Строка.КоличествоФакт;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе
				НоваяСтрока = ТоварыИзменитьВПеремещении.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				НоваяСтрока.КодСтроки = 0;
				НоваяСтрока.Количество = Строка.КоличествоФакт;
				НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
   		

КонецПроцедуры