      
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьКарту()
	КартаЯндекс = ПолучитьТекстМакета();
	ГеокодированиеКлиент.УстановитьНачальныеКоординаты(Неопределено, КартаЯндекс); 
	ГеокодированиеКлиент.УстановитьКлючЯндекс(КартаЯндекс);
КонецПроцедуры       

&НаСервере            
Функция ПолучитьТекстМакета()
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЯндексУказатьАдрес").ПолучитьТекст();
КонецФункции                
                                   
&НаКлиенте
Процедура КартаЯндексПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Если ДанныеСобытия.Event.currentTarget.ParamFor1C_Address <> Неопределено И ДанныеСобытия.Event.currentTarget.ParamFor1C_Cords <> Неопределено Тогда
		Адрес = ДанныеСобытия.Event.currentTarget.ParamFor1C_Address;
		Широта = ДанныеСобытия.Event.currentTarget.ParamFor1C_Cords["0"];
		Долгота = ДанныеСобытия.Event.currentTarget.ParamFor1C_Cords["1"];
		Координаты = "" + Широта + "     " + Долгота;
	Иначе
		Адрес = "";
		Широта = 0;
		Долгота = 0;
		Координаты = "";
	КонецЕсли;
КонецПроцедуры     

&НаКлиенте
Процедура ПередатьВДокумент(Команда)	
	Закрыть(Адрес);
КонецПроцедуры

