&После("ПриСозданииНаСервере")
Процедура Док_ПриСозданииНаСервереПосле(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	СписокФорм = Новый Соответствие();
	НастройкиПоиска = ДопМодуль.ПолучитьНастройкиХранилища("НастройкиВидимостьПоиска");
	Если НастройкиПоиска <> НЕОПРЕДЕЛЕНО И НастройкиПоиска.Свойство("ТаблицаНастройки") Тогда
		стрТаблицы = НастройкиПоиска.ТаблицаНастройки.Найти(Форма.ИмяФормы);
		Если стрТаблицы <> НЕОПРЕДЕЛЕНО Тогда
			Форма.Элементы[стрТаблицы.Список].ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Нет; 
			Форма.Элементы[стрТаблицы.Список].ПоискПриВводе = ПоискВТаблицеПриВводе.НеИспользовать;
			Если стрТаблицы.ЭлементыПоиска = "" Тогда
				Форма.Элементы.СписокНайти.Видимость = Ложь; 
				Форма.Элементы.СписокОтменитьПоиск.Видимость = Ложь;
			Иначе
				МассивКоманд = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(стрТаблицы.ЭлементыПоиска);
				Для Каждого Эл Из МассивКоманд Цикл
					Форма.Элементы[Эл].Видимость = Ложь;
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
