

//адрес сервера sbp.gazprombank.ru
// порт 9443
//прокси https
Функция ПолучитьПараметрыСоединения(АдресСервера = "sbp.gazprombank.ru" , Порт=9443, Логин=Неопределено, Пароль=Неопределено, ИспользоватьSSL=Истина, ИДУстройства="") Экспорт
	//СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	//Если СтруктураНастроек.Свойство("АдресСервера") Тогда
	//	АдресСервера = СтруктураНастроек.АдресСервера;
	//КонецЕсли;
	
	ПараметрыПодключения = Новый Структура;
	
	ПараметрыПодключения.Вставить("Логин", Логин);	
	ПараметрыПодключения.Вставить("Пароль",	Пароль);	
	ПараметрыПодключения.Вставить("АдресСервера", АдресСервера);	 
	ПараметрыПодключения.Вставить("Порт", Порт);	
	ПараметрыПодключения.Вставить("ИспользоватьSSL", ИспользоватьSSL);	
	ПараметрыПодключения.Вставить("ИДУстройства", ИДУстройства);
	ПараметрыПодключения.Вставить("Таймаут", 0);
	
	Возврат ПараметрыПодключения;
КонецФункции

Функция ПолучитьHTTPСоединение(ПараметрыПодключения) Экспорт
	
	ssl = ?(ПараметрыПодключения.ИспользоватьSSL,Новый ЗащищенноеСоединениеOpenSSL,НЕОПРЕДЕЛЕНО);
	
	Соединение = Новый HTTPСоединение(
	ПараметрыПодключения.АдресСервера, 
	ПараметрыПодключения.Порт, 
	ПараметрыПодключения.Логин, 
	ПараметрыПодключения.Пароль, 
	ПолучениеФайловИзИнтернета.ПолучитьПрокси("https"), 
	ПараметрыПодключения.Таймаут, 
	ssl  
	);
	
	Возврат Соединение;
КонецФункции

Функция ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, ТипЗапроса="GET", Заголовки=Неопределено, Данные=Неопределено) Экспорт
	ЕстьОшибка= Ложь;
	Если НЕ АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда
		Возврат "Попытка работы с СБП Газпромбанка в тестовой базе";
	КонецЕсли;	
	
	Попытка
		HTTPЗапрос= Новый HTTPЗапрос(АдресЗапроса); 
		Если ТипЗнч(Заголовки) = Тип("Соответствие") Тогда
			Для каждого Заголовок из Заголовки Цикл
				HTTPЗапрос.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
			КонецЦикла;
		КонецЕсли;
		
		HTTPЗапрос.УстановитьТелоИзСтроки(Данные);
		
		Если ТипЗапроса="GET" Тогда
			Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="POST" Тогда
			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="PUT" Тогда
			Ответ = HTTPСоединение.Записать(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="DELETE" Тогда
			Ответ = HTTPСоединение.Удалить(HTTPЗапрос);
		КонецЕсли;
				
		ОтветТело= Ответ.ПолучитьТелоКакСтроку();
		
		ДанныеОтвета= ДесериализоватьИзJSON(ОтветТело);  
		
		Текст= СтрШаблон("Выполнен %1 запрос %2 с данными %3. Ответ %4", ТипЗапроса, АдресЗапроса, Данные, ОтветТело);
		ЗаписьЖурналаРегистрации("СБП Газпромбанк", УровеньЖурналаРегистрации.Информация,,,Текст);

	Исключение
		Инфо = ИнформацияОбОшибке();
		Текст= СтрШаблон("Ошибка выполнения %1 запроса: %2. %3", ТипЗапроса, АдресЗапроса, Инфо.Описание);
		Возврат Текст;

	КонецПопытки;
	
	Возврат ДанныеОтвета;
КонецФункции 

Функция СериализоватьВJSON(Данные) Экспорт   
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, ,Истина));
		ЗаписатьJSON(ЗаписьJSON, Данные);
		ПараметрыJSON = ЗаписьJSON.Закрыть();
		Возврат ПараметрыJSON;
	Исключение
		Сообщить("Ошибка JSON");
		Возврат "{}";
	КонецПопытки;
КонецФункции

Функция ДесериализоватьИзJSON(СтрокаJSON) Экспорт  
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);   
	Результат = Неопределено;
	Результат = ПрочитатьJSON(ЧтениеJSON,, "dateTime, dateTimeSbpMsg", ФорматДатыJSON.ISO);	
	ЧтениеJSON.Закрыть();
	
    Возврат Результат;
КонецФункции

Функция ПолучитьОбработку() Экспорт
	
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "СБПГазпромбанк");		
		
	Возврат ДополнительнаяОбработка;
	
КонецФункции

Функция ПолучитьСтруктуруХранилищаНастроек(ДополнительнаяОбработка=Неопределено) Экспорт
	
	ОписаниеОшибки = "";	
	Если ДополнительнаяОбработка=Неопределено Тогда
		ДополнительнаяОбработка = ПолучитьОбработку();
	Конецесли;
	Если НЕ ДополнительнаяОбработка.Пустая() Тогда
		
		НастройкиХранилища = ДополнительнаяОбработка.ХранилищеНастроек.Получить();		
		
		Если НастройкиХранилища <> Неопределено Тогда
			Возврат НастройкиХранилища;
		Иначе	
			ОписаниеОшибки = "Настройки выполнения не заданы";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции



Функция АктивацияКассовойСсылки(ДанныеЗаполнения) Экспорт
	Данные = Новый Структура;
	Данные.Вставить("qrcId", ДанныеЗаполнения.qrcId);
	Данные.Вставить("amount", ДанныеЗаполнения.amount);
	Если ДанныеЗаполнения.Свойство("paymentPurpose") Тогда
		Данные.Вставить("paymentPurpose", ДанныеЗаполнения.paymentPurpose);
	КонецЕсли;
	Данные.Вставить("currency", "RUB");
	Если ДанныеЗаполнения.Свойство("qrTtl") Тогда
		Данные.Вставить("qrTtl", ДанныеЗаполнения.qrTtl);
    КонецЕсли;
	//Данные.Вставить("sign",""); 
		
	ДанныеJSON = СериализоватьВJSON(Данные);
	
	ПараметрыПодключения = ПолучитьПараметрыСоединения();
	HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");
	//Заголовки.Вставить("Authorization", "");  //Логин и пароль закодированные согласно Basic auth
	//Заголовки.Вставить("login", "");          //Логин выданный ТСП 
	//Заголовки.Вставить("password", "");
	АдресЗапроса = "/merchant/payment/v1/cash-activate-qrc/params";
	Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
	
	Возврат Ответ;
	//обработка ответа на стороне формы сбп
	//Если ТипЗнч(Ответ) = Тип("Структура") Тогда
	//	Если Ответ.Свойство("data") тогда
	//		qrcId = Ответ.data.qrcId;
	//		paramsId = Ответ.data.paramsId;	
	//		amount = Ответ.data.amount;
	//		currency = Ответ.data.currency;
	//		Если Ответ.data.Свойство("paymentPurpose") Тогда
	//			paymentPurpose = Ответ.data.paymentPurpose;
	//		КонецЕсли;
	//		
	//	Иначе
	//		КодОшибки = Ответ.code;
	//		ТекстОшибки = Ответ.message;
	//	КонецЕсли;		 
	//ИначеЕсли ТипЗнч(Ответ) = Тип("Строка") Тогда
	//    //сообщить ошибку из ответа
	//КонецЕсли;	
	
КонецФункции   

Функция ДеактивацияКассовойСсылки(qrcId) Экспорт 
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
	    Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
			Данные = Новый Структура;
			Данные.Вставить("qrcId", qrcId);
			//Данные.Вставить("sign",""); 
				
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-type", "application/json");
			
            Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль);
			АдресЗапроса = "/merchant/payment/v1/cash-deactivate-qrc/params";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);	 
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;
	
КонецФункции

Функция ЗапросСтатусаКассовойСсылкиРасш(qrcId, paramsId)  Экспорт           
	//СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	ПараметрыПодключения = ПолучитьПараметрыСоединения();
	HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
	АдресЗапроса = СтрШаблон("/merchant/payment/v1/cash-register-qrc/%1/%2", qrcId, paramsId);
	Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "GET");
	Возврат Ответ;
	//Если ТипЗнч(Ответ) = Тип("Структура") Тогда
	//	Если Ответ.Свойство("data") тогда
	//		cashRegisterQrcStatus = Неопределено;
	//		trxStatus = Неопределено;  
	//		amount = Неопределено;
	//		Ответ.data.Свойство("cashRegisterQrcStatus", cashRegisterQrcStatus); 
	//		Ответ.data.Свойство("trxStatus", trxStatus);
	//		Ответ.data.Свойство("amount", amount); 
	//		timestamp = Неопределено; 
	//		trxId = Неопределено;
	//		payerId = Неопределено;
	//		kzo = Неопределено;
	//		Ответ.data.Свойство("timestamp", timestamp); 
	//		Ответ.data.Свойство("trxId", trxId);
	//		Ответ.data.Свойство("payerId", payerId);
	//		Ответ.data.Свойство("kzo", kzo);

	//	Иначе
	//		КодОшибки = Ответ.code;
	//		ТекстОшибки = Ответ.message;
	//	КонецЕсли;
	//	 
	//ИначеЕсли ТипЗнч(Ответ) = Тип("Строка") Тогда
	//    //сообщить ошибку из ответа
	//КонецЕсли;
	
КонецФункции      

Функция ЗапросСтатусаКассовойСсылкиОсн(qrcId)   Экспорт
	Данные = Новый Структура;
	МассивДанных = Новый Массив;
	МассивДанных.Добавить(qrcId);
	Данные.Вставить("qrcIds", МассивДанных);
	//Данные.Вставить("sign",""); 
		
	ДанныеJSON = СериализоватьВJSON(Данные);
	
	ПараметрыПодключения = ПолучитьПараметрыСоединения();
	HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");
	//Заголовки.Вставить("Authorization", "");  //Логин и пароль закодированные согласно Basic auth
	//Заголовки.Вставить("login", "");          //Логин выданный ТСП 
	//Заголовки.Вставить("password", "");
	АдресЗапроса = "/merchant/qrc-status";
	Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);	
	Возврат Ответ;
	//Если ТипЗнч(Ответ) = Тип("Структура") Тогда
	//	transactionId = Ответ.transactionId;
	//	Если Ответ.Свойство("data") тогда
	//		qrcId = Ответ.data.qrcId;
	//		code = Ответ.data.code;
	//		message = Ответ.data.message;
	//		status = Неопределено; 
	//		trxId = Неопределено; 
	//		Ответ.data.Свойство("status", status);
	//		Ответ.data.Свойство("trxId", trxId);			
	//	Иначе
	//		КодОшибки = Ответ.code;
	//		ТекстОшибки = Ответ.message;
	//	КонецЕсли;
	//	//sign = Ответ.sign;
	//	//request_sign = Ответ.request_sign;
	//ИначеЕсли ТипЗнч(Ответ) = Тип("Строка") Тогда
	//    //сообщить ошибку из ответа
	//КонецЕсли;
	
КонецФункции

Функция Rollback(qrcId) Экспорт    // аварийный возврат
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
	    Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
			Данные = Новый Структура;
			Данные.Вставить("qrcId", qrcId); 
			//Данные.Вставить("sign",""); 
			
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения); 
						
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-type", "application/json");
			
			Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль);
			
			АдресЗапроса = "/merchant/transfer/rollback";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;
	
КонецФункции

Функция ПолучениеИнформацииОВозврате(confirmTransactionId)  Экспорт   // /operation/info
	
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
		Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
			Данные = Новый Структура;
			Данные.Вставить("transactionId", confirmTransactionId); //транзакция подтвержения возврата
			//Данные.Вставить("sign",""); 
			
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения); 
						
			Заголовки = Новый Соответствие; 
			Заголовки.Вставить("Content-type", "application/json");
			
			Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль);

			АдресЗапроса = "/operation/info";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;
	
КонецФункции


Функция ПодготовкаВозврата(ДанныеЗаполнения)  Экспорт
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
		Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
			Данные = Новый Структура;
			Данные.Вставить("transactionId", ДанныеЗаполнения.transactionId); //транзакция, по которой будет проведен возврат
			Данные.Вставить("amount", ДанныеЗаполнения.amount); 
			Данные.Вставить("currency", "RUB"); 
			Если ДанныеЗаполнения.Свойство("comment") Тогда
				Данные.Вставить("comment", ДанныеЗаполнения.comment);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("recipientBankId") Тогда
				Данные.Вставить("recipientBankId", ДанныеЗаполнения.recipientBankId);
			КонецЕсли;
			//Данные.Вставить("callbackMerchantNotifications", "");
			//Данные.Вставить("sign",""); 
			
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения); 
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-type", "application/json");
			
			Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль);

			АдресЗапроса = "/merchant/transfer/return/prepare";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;
	
КонецФункции

Функция ПодтверждениеВозврата(prepareTransactionId)  Экспорт
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
		Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
	
			Данные = Новый Структура;
			Данные.Вставить("transactionId", prepareTransactionId); //транзакция подготовки возврата
			//Данные.Вставить("sign",""); 
			
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения); 
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-type", "application/json");
			
			Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль); 
			
			АдресЗапроса = "/merchant/transfer/return/confirm";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;

	
КонецФункции

Функция ПолучитьУчастниковСБП() Экспорт
	ПараметрыПодключения = ПолучитьПараметрыСоединения();
	HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
	АдресЗапроса = "/merchant/v2/transfer/banks";
	Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "GET");
	Возврат Ответ;
	
	//Данные = "{""code"": ""000"", ""message"": ""Запрос обработан успешно"", ""transactionId"": ""003665567575"", ""members"": [{""memberId"": ""100000000202"", ""memberName"": ""Norvik Bank"", ""memberNameRus"": ""Норвик Банк""}, {""memberId"": ""100000000201"", ""memberName"": ""BANK KREMLYOVSKIY"", ""memberNameRus"": ""Банк Кремлевский""}, {""memberId"": ""100000000200"", ""memberName"": ""JSCB SLAVIA"", ""memberNameRus"": ""АКБ СЛАВИЯ""}]}";
	//ДанныеОтвета = ДесериализоватьИзJSON(Данные);
	//Возврат ДанныеОтвета;
	
КонецФункции


Процедура ЗаписьIDТранзакцииВРегистрСБП(ДокументСсылка, IDТранзакции, СБП = Ложь) Экспорт
	
	//запись ID в регистр
	НаборЗаписей = РегистрыСведений.ДанныеБезналичныхОплат.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОплаты.Установить(ДокументСсылка);
	НаборЗаписей.Очистить();
	ЗаписьВРегистр = НаборЗаписей.Добавить();
	ЗаписьВРегистр.ДокументОплаты = ДокументСсылка;
	ЗаписьВРегистр.IDТранзакции = IDТранзакции;
	ЗаписьВРегистр.СБП = СБП;
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

Функция ПолучитьДанныеТранзакции(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеБезналичныхОплат.IDТранзакции КАК IDТранзакции,
		|	ДанныеБезналичныхОплат.СБП КАК СБП
		|ИЗ
		|	РегистрСведений.ДанныеБезналичныхОплат КАК ДанныеБезналичныхОплат
		|ГДЕ
		|	ДанныеБезналичныхОплат.ДокументОплаты = &ДокументОплаты";
	Запрос.УстановитьПараметр("ДокументОплаты", ДокументСсылка);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("IDТранзакции", Выборка.IDТранзакции);
		СтруктураДанных.Вставить("СБП", Выборка.СБП);
		Возврат СтруктураДанных;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции 

Функция БылаОперацияСБП(IDТранзакции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеБезналичныхОплат.СБП КАК СБП
		|ИЗ
		|	РегистрСведений.ДанныеБезналичныхОплат КАК ДанныеБезналичныхОплат
		|ГДЕ
		|	ДанныеБезналичныхОплат.IDТранзакции = &IDТранзакции";
	Запрос.УстановитьПараметр("IDТранзакции", IDТранзакции);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СБП;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 

Функция ПолучитьТерминалСБППоУмолчанию() Экспорт
	Возврат Справочники.ЭквайринговыеТерминалы.НайтиПоНаименованию("СБП Газпромбанк");
КонецФункции 

Функция ПолучитьКассовуюСсылкуДляКассыККМ(КассаККМ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	КассовыеСсылкиСБП.КассаККМ КАК КассаККМ,
					|	КассовыеСсылкиСБП.ИдентификаторСсылки КАК ИдентификаторСсылки,
					|	КассовыеСсылкиСБП.КассоваяСсылкаНаОплату КАК КассоваяСсылкаНаОплату
					|ИЗ
					|	РегистрСведений.КассовыеСсылкиСБП КАК КассовыеСсылкиСБП
					|ГДЕ
					|	КассовыеСсылкиСБП.КассаККМ = &КассаККМ";
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("grcId", Выборка.ИдентификаторСсылки);
		СтруктураВозврата.Вставить("payload", Выборка.КассоваяСсылкаНаОплату);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
    УстановитьПривилегированныйРежим(Ложь);

	
КонецФункции

Функция ПолучитьКассовуюСсылкуДляТерминалаКассы(КассаККМ, Терминал = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	КассовыеСсылкиСБП.КассаККМ КАК КассаККМ,
					|	КассовыеСсылкиСБП.ИдентификаторСсылки КАК ИдентификаторСсылки,
					|	КассовыеСсылкиСБП.КассоваяСсылкаНаОплату КАК КассоваяСсылкаНаОплату
					|ИЗ
					|	РегистрСведений.КассовыеСсылкиСБП КАК КассовыеСсылкиСБП
					|ГДЕ
					|	КассовыеСсылкиСБП.КассаККМ = &КассаККМ
					|   И &Терминал";
	Если Терминал <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Терминал", "КассовыеСсылкиСБП.ЭквайринговыйТерминал = &Терминал");
		Запрос.УстановитьПараметр("Терминал", Терминал);
	Иначе
		Запрос.УстановитьПараметр("Терминал", Истина);
	КонецЕсли;
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("grcId", Выборка.ИдентификаторСсылки);
		СтруктураВозврата.Вставить("payload", Выборка.КассоваяСсылкаНаОплату);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
    УстановитьПривилегированныйРежим(Ложь);

	
КонецФункции

Процедура ОбработатьОплатуВЧекККМ(РезультатВыполнения, Объект)  Экспорт
	
	ОплатыСБП = ОплатыСБП(Объект.ОплатаПлатежнымиКартами);
	Для Каждого СтрокаОплатыСБП Из ОплатыСБП Цикл
		Объект.ОплатаПлатежнымиКартами.Удалить(СтрокаОплатыСБП);
	КонецЦикла; 
	
	СтрокаСБП = Объект.ОплатаПлатежнымиКартами.Добавить();
	СтрокаСБП.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей");
	СтрокаСБП.Сумма = РезультатВыполнения.СуммаОперации;
	СтрокаСБП.СсылочныйНомер = РезультатВыполнения.ИдентификаторОплаты;
	ТерминалСБП = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
	СтрокаСБП.ДоговорПодключения = ТерминалСБП.Владелец;
	СтрокаСБП.ЭквайринговыйТерминал = ТерминалСБП;
	СтрокаСБП.СтатусОплатыСБП = ПредопределенноеЗначение("Перечисление.ТипыСтатусовОплатыСБП.Выполнена");
	
КонецПроцедуры 

Процедура ОбработатьОплатуВЧекККМНаВозврат(РезультатВыполнения, Объект)  Экспорт
	
	НомерСтрокиОплатыСБП = Неопределено; 
		
	ОплатыСБП = ОплатыСБП(Объект.ОплатаПлатежнымиКартами);
	Если ОплатыСБП.Количество() > 0 Тогда
		НомерСтрокиОплатыСБП = ОплатыСБП[0].НомерСтроки;
		Объект.ОплатаПлатежнымиКартами[НомерСтрокиОплатыСБП - 1].ОплатаОтменена = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ЧекККМ) Тогда
		СтрокаСБП = Объект.ОплатаПлатежнымиКартами.Добавить();
		СтрокаСБП.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей");
		СтрокаСБП.Сумма = РезультатВыполнения.СуммаОперации;
		ТерминалСБП = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
		СтрокаСБП.ДоговорПодключения = ТерминалСБП.Владелец;
		СтрокаСБП.ЭквайринговыйТерминал = ТерминалСБП;  
		СтрокаСБП.ЭквайринговыйТерминал = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
		СтрокаСБП.ОплатаОтменена = Истина;
	КонецЕсли;
		
		

КонецПроцедуры

Процедура ОбработатьОплатуВЭквайринге(РезультатВыполнения, Объект)  Экспорт
		
	Объект.ОплатаВыполнена = Истина;
	Объект.ИдентификаторОплатыСБП = РезультатВыполнения.ИдентификаторОплаты;
	ТерминалСБП = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
	Объект.ЭквайринговыйТерминал = ТерминалСБП;
	Объект.ДоговорЭквайринга = ТерминалСБП.Владелец; 
		

КонецПроцедуры 

Функция ОплатыСБП(ОплатаПлатежнымиКартами)
	
	ОтборОплатыСБП = Новый Структура("ВидОплаты", ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей"));
	Возврат ОплатаПлатежнымиКартами.НайтиСтроки(ОтборОплатыСБП);
	
КонецФункции






