
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После ("ЗаполнитьТаблицуЗапросов")
Процедура Док_ЗаполнитьТаблицуЗапросов(ТаблицаЗапросов, ИмяКритерияОтбора, ДопДокументы, ДопПоляШапки, УчитыватьТЧВДопДокументах = Ложь,ТолькоАктуальные = Ложь) Экспорт

	Для Каждого СтрокаТаб Из ТаблицаЗапросов Цикл
			СтрокаТаб.ТекстЗапросаВыборка=стрзаменить(СтрокаТаб.ТекстЗапросаВыборка,"Неопределено КАК _ФДНомер","ЕСТЬNULL(ЖФОпераций.НомерЧекаККМ,0) КАК _ФДНомер");
			СтрокаТаб.ТекстЗапросаВыборка=стрзаменить(СтрокаТаб.ТекстЗапросаВыборка,"Неопределено КАК _ФискальныйПризнак","ЕСТЬNULL(ЖФОпераций.ФискальныйПризнак,Неопределено) КАК _ФискальныйПризнак");
			СтрокаТаб.ТекстЗапросаВыборка=стрзаменить(СтрокаТаб.ТекстЗапросаВыборка,"Неопределено КАК _ЗаводскойНомерФН","ЕСТЬNULL(ЖФОпераций.ЗаводскойНомерФН,Неопределено) КАК _ЗаводскойНомерФН");
			СтрокаТаб.ТекстЗапросаВыборка=стрзаменить(СтрокаТаб.ТекстЗапросаВыборка,"= ТаблицаОтбора.Документ","= ТаблицаОтбора.Документ
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ЖФОпераций
			|			ПО ТаблицаОтбора.Документ = ЖФОпераций.ДокументОснование");	  
		ДобавитьОтборПоНоменклатуре(СтрокаТаб);	
			
	КонецЦикла;

КонецПроцедуры  

Процедура ДобавитьОтборПоНоменклатуре(СтрокаТаб)     
	ТекстОтбора="";НачалоОтбора=истина;
	//для каждого стр из Метаданные.Документы[СтрокаТаб.ИмяДокумента].Реквизиты   цикл
	//	если стр.Имя="Номенклатура" тогда
	//		ДобавитьУсловие(ТекстОтбора,1,СтрокаТаб.ИмяДокумента);
	//	конецесли;	
	//конеццикла;
	если СтрокаТаб.ИмяДокумента="ОбращениеКлиента" тогда
		возврат;
	конецесли;	
	для каждого ТабЧасть из       Метаданные.Документы[СтрокаТаб.ИмяДокумента].ТабличныеЧасти цикл
		для каждого стр из ТабЧасть.Реквизиты цикл
			если стр.Имя="Номенклатура" тогда
				ДобавитьУсловие(ТекстОтбора,2,СтрокаТаб.ИмяДокумента,НачалоОтбора,Табчасть.имя);
			конецесли;	
		конеццикла;	
	конеццикла;	
	
	если ТекстОтбора="" тогда
		Текстотбора="не &отбор";
	конецесли;	
		если найти(СтрокаТаб.ТекстЗапросаВыборка,"ГДЕ")<>0 тогда
			СтрокаТаб.ТекстЗапросаВыборка=стрзаменить(СтрокаТаб.ТекстЗапросаВыборка, "ГДЕ ","ГДЕ "+ТекстОтбора); 
		иначе 
			СтрокаТаб.ТекстЗапросаВыборка=СтрокаТаб.ТекстЗапросаВыборка+ "
			|ГДЕ "+ТекстОтбора+" ";
		конецесли;	              
	
КонецПроцедуры

Процедура ДобавитьУсловие(Текст,режим,ИмяДокумента,НачалоОтбора,Табчасть=НЕОПРЕДЕЛЕНО) 
	если режим=1 тогда
		// Текст=Текст+?(Текст="(",""," или ")+"(&Отбор и ТаблицаШапки.Номенклатура=&Номенклатура)"; 
	иначеесли режим =2 тогда
		Текст=Текст+?(НачалоОтбора,""," или ")+"
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Документ."+ИмяДокумента+"."+ТабЧасть+" КАК ТаблЧасть
		|			ГДЕ
		|				(ТаблицаШапки.Ссылка = ТаблЧасть.Ссылка и не &Отбор)
		|				Или (ТаблицаШапки.Ссылка = ТаблЧасть.Ссылка и 
		|				  &отбор и ТаблЧасть.Номенклатура = &Номенклатура))"; 
		НачалоОтбора=Ложь;
	конецесли;	 
КонецПроцедуры


&После ("ДобавитьДополнительныеПоляШапки")
Процедура Док_ДобавитьДополнительныеПоляШапки(ТекстЗапроса, МетаданныеДокумента, ДопПоляШапки)

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КАК ИдентификаторКартинки", "КАК ИдентификаторКартинки,
	|	Неопределено КАК _ФДНомер,
	|	Неопределено КАК _ФискальныйПризнак,
	|	Неопределено КАК _ЗаводскойНомерФН");

КонецПроцедуры


&ИзменениеИКонтроль("ЗаполнитьТаблицуЗапросов")
Процедура Док_ЗаполнитьТаблицуЗапросов1(ТаблицаЗапросов, ИмяКритерияОтбора, ДопДокументы, ДопПоляШапки, УчитыватьТЧВДопДокументах, ТолькоАктуальные)

	ДеревоДокументов = Новый ДеревоЗначений;
	ДеревоДокументов.Колонки.Добавить("Документ");
	ДеревоДокументов.Колонки.Добавить("СтруктураДанных");
	ДеревоДокументов.Колонки.Добавить("ТабличнаяЧасть");
	ДеревоДокументов.Колонки.Добавить("ТекстУсловия");

#Удаление
	Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора[ИмяКритерияОтбора].Состав Цикл
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
	МассивДокументов = Новый Массив;
	
	Если ИмяКритерияОтбора = "ДокументыПоПартнеру" Тогда
		Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора.ДокументыПоПартнеру.Состав Цикл
			МассивДокументов.Добавить(ЭлементСостава);
		КонецЦикла;
		Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора.ДокументыПоПартнеруАльтерра.Состав Цикл
			МассивДокументов.Добавить(ЭлементСостава);
		КонецЦикла;
	Иначе
		МассивДокументов = Метаданные.КритерииОтбора[ИмяКритерияОтбора].Состав;
	КонецЕсли;
	
	Для Каждого ЭлементСостава Из МассивДокументов Цикл

#КонецВставки

		СтруктураДанных = СтруктураДанных(ЭлементСостава.ПолноеИмя());

		Если Не ПравоДоступа("Чтение", СтруктураДанных.Метаданные) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(СтруктураДанных.Метаданные) Тогда
			Продолжить;
		КонецЕсли;

		КореньДокумента = ДеревоДокументов.Строки.Найти(СтруктураДанных.Метаданные, "Документ", Ложь);
		Если КореньДокумента = Неопределено Тогда

			КореньДокумента = ДеревоДокументов.Строки.Добавить();
			КореньДокумента.Документ = СтруктураДанных.Метаданные;

		КонецЕсли;

		СтрокаШапкаТЧ = КореньДокумента.Строки.Найти(СтруктураДанных.ИмяТаблЧасти, "ТабличнаяЧасть", Ложь);
		Если СтрокаШапкаТЧ = Неопределено Тогда

			СтрокаШапкаТЧ = КореньДокумента.Строки.Добавить();
			СтрокаШапкаТЧ.ТабличнаяЧасть = СтруктураДанных.ИмяТаблЧасти;

		КонецЕсли;

		СтрокаДанных = СтрокаШапкаТЧ.Строки.Добавить();
		СтрокаДанных.СтруктураДанных = СтруктураДанных;

	КонецЦикла;

	ШаблонУсловияШапки = " %ПутьКТаблицеРеквизита%.%ПолеПараметрШапки% = &Параметр ";
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаШапки.Ссылка              КАК Документ
	|	ПОМЕСТИТЬ ВтТаблицаОтбора
	|ИЗ
	|	&ИмяТаблицыШапки КАК ТаблицаШапки
	|ГДЕ
	|	ТаблицаШапки.Дата >= НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
	|	И (ТаблицаШапки.Дата <= КОНЕЦПЕРИОДА(&ОкончаниеПериода, ДЕНЬ) ИЛИ &ОкончаниеПериода = ДатаВремя(1,1,1))
	|	И (&ТекстУсловия)
	|";
	ШаблонУсловияДляТЧ = " ТаблицаСтрок.%ПолеПараметрТЧ% = &Параметр ";
	ШаблонУсловияТЧ    = 
	" 1 В
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|	ИЗ
	|		Документ.%ИмяТаблицыТЧ% КАК ТаблицаСтрок
	|	ГДЕ
	|		ТаблицаСтрок.Ссылка = %УсловиеНаСсылкуВТЧ%
	|		И ( %УсловиеНаСтрокиТЧ% )
	|	)";

	Для Каждого СтрокаКорня Из ДеревоДокументов.Строки Цикл

		ТекстУсловийПоДокументу = "";
		// Цикл по реквизитам и табличным частям одного документа
		Для Каждого СтрокаРеквизитТЧ Из СтрокаКорня.Строки Цикл

			ТекстУсловия = "";
			// Условие на поле в ТЧ.
			Если Не ПустаяСтрока(СтрокаРеквизитТЧ.ТабличнаяЧасть) Тогда

				ВремТекст = "";
				// Цикл по табличным частям
				Для Каждого СтрокаТЧ Из СтрокаРеквизитТЧ.Строки Цикл

					ВремТекст = ВремТекст + ?(ПустаяСтрока(ВремТекст),"", " ИЛИ ")
					+ СтрЗаменить(ШаблонУсловияДляТЧ, "%ПолеПараметрТЧ%", СтрокаТЧ.СтруктураДанных.ИмяРеквизита);

				КонецЦикла;

				ТекстУсловия = СтрЗаменить(ШаблонУсловияТЧ, "%ИмяТаблицыТЧ%", СтрокаКорня.Документ["Имя"] + "." + СтрокаРеквизитТЧ.ТабличнаяЧасть);
				ТекстУсловия = СтрЗаменить(ТекстУсловия, "%УсловиеНаСтрокиТЧ%", ВремТекст);

			Иначе // Условие по шапке

				// Цикл по реквизитам
				Для Каждого СтрокаТЧ Из СтрокаРеквизитТЧ.Строки Цикл

					ТекстУсловия = ТекстУсловия + ?(ПустаяСтрока(ТекстУсловия),"", " ИЛИ ")
					+ СтрЗаменить(ШаблонУсловияШапки, "%ПолеПараметрШапки%", СтрокаТЧ.СтруктураДанных.ИмяРеквизита);

				КонецЦикла;

			КонецЕсли;

			Если ТолькоАктуальные Тогда

				Если СтрокаКорня.Документ.Имя = "ЗаказКлиента" Тогда
					ВремТекстУсловия = СтрЗаменить(ШаблонУсловияТЧ, "%ИмяТаблицыТЧ%", "ЗаказКлиента.Товары");
					ВремТекстУсловия = СтрЗаменить(ВремТекстУсловия, "%УсловиеНаСтрокиТЧ%", ("НЕ ТаблицаСтрок.Отменено"));
					ТекстУсловия = ТекстУсловия + ?(ПустаяСтрока(ТекстУсловия),"", " И ") + ВремТекстУсловия;
				Иначе

					CRMЛокализация.ДополнитьУсловиеЗапросаПоАктуальностиДокумента(СтрокаКорня.Документ.Имя, ТекстУсловия);

				КонецЕсли;
			КонецЕсли;

			Если Не ПустаяСтрока(ТекстУсловия) Тогда

				ДобавитьТекстВСтроку(ТекстУсловийПоДокументу, ТекстУсловия, " ИЛИ ");

			КонецЕсли;
		КонецЦикла;

		Если Не ПустаяСтрока(ТекстУсловийПоДокументу) Тогда

			ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ИмяТаблицыШапки", "Документ." + СтрокаКорня.Документ.Имя);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстУсловия", ТекстУсловийПоДокументу);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПутьКТаблицеРеквизита%", "ТаблицаШапки");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеНаСсылкуВТЧ%", " ТаблицаШапки.Ссылка");

			ДобавитьДополнительныеПоляШапки(ТекстЗапроса,СтрокаКорня.Документ, ДопПоляШапки);
			ДобавитьЗапросВТаблицу(ТаблицаЗапросов, СтрокаКорня.Документ, ТекстЗапроса);

			СтрокаКорня.ТекстУсловия = ТекстУсловийПоДокументу;

		КонецЕсли;
	КонецЦикла;

	// В запрос добавляются документы, которые в критерий не входят, но имеют ссылку
	// на документ, который входит в критерий по реквизиту шапки.

	ШаблонУсловияСтрокиТЧ = 
	"1 В
	|	(ВЫБРАТЬ
	|		1
	|	ИЗ
	|		Документ.%ИмяДокумента% КАК ТабличнаяЧасть%ИмяТабЧасти%
	|	ГДЕ
	|		ТабличнаяЧасть%ИмяТабЧасти%.Ссылка = ТаблицаШапки.Ссылка
	|		И (&ТекстУсловия)
	|)";
	МассивУсловий      = Новый Массив;
	СоответствиеПолей  = Новый Соответствие;

	Для Каждого Документ Из ДопДокументы Цикл
		Если Не ПравоДоступа("Чтение", Документ) Тогда
			Продолжить;
		КонецЕсли;

		МассивУсловий.Очистить();
		СоответствиеПолей.Очистить();

		Для Каждого Реквизит Из Документ.Реквизиты Цикл
			Для Каждого СтрокаДерева Из ДеревоДокументов.Строки Цикл

				// Проверка, что документ-основание содержит нужную ссылку только в шапке.
				Если Не РеквизитСодержитТип(Реквизит, "ДокументСсылка." + СтрокаДерева.Документ["Имя"])
					Или Не РеквизитТолькоВШапке(СтрокаДерева) Тогда
					Продолжить;
				КонецЕсли;

				МассивСтруктур = СоответствиеПолей.Получить(Реквизит);
				Если МассивСтруктур = Неопределено Тогда

					МассивСтруктур = Новый Массив;
					СоответствиеПолей.Вставить(Реквизит, МассивСтруктур);

				КонецЕсли;

				МассивСтруктур.Добавить(Новый Структура("Документ, ТекстУсловия",
				СтрокаДерева.Документ,
				СтрокаДерева.ТекстУсловия));
			КонецЦикла;
		КонецЦикла;

		Для Каждого КлючИЗначение Из СоответствиеПолей Цикл
			Для Каждого ЭлементСтруктура Из КлючИЗначение.Значение Цикл

				Если РеквизитСоставной(КлючИЗначение.Ключ) Тогда
					ПутьКТаблицеРеквизита = "ВЫРАЗИТЬ(ТаблицаШапки." + КлючИЗначение.Ключ["Имя"] +" КАК Документ." + ЭлементСтруктура.Документ["Имя"] + ")";
				Иначе
					ПутьКТаблицеРеквизита = "ТаблицаШапки." + КлючИЗначение.Ключ.Имя;
				КонецЕсли;

				ВремТекст = ЭлементСтруктура.ТекстУсловия;
				ВремТекст = СтрЗаменить(ВремТекст, "%ПутьКТаблицеРеквизита%", ПутьКТаблицеРеквизита);
				ВремТекст = СтрЗаменить(ВремТекст, "%ПолеПараметр%", КлючИЗначение.Ключ.Имя);
				ВремТекст = СтрЗаменить(ВремТекст, "%УсловиеНаСсылкуВТЧ%", "ТаблицаШапки." + КлючИЗначение.Ключ.Имя);
				МассивУсловий.Добавить(ВремТекст);

			КонецЦикла;
		КонецЦикла;

		// По табличным частям
		Если УчитыватьТЧВДопДокументах Тогда
			Для Каждого ТабЧасть Из Документ.ТабличныеЧасти Цикл

				СоответствиеПолей.Очистить();
				Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл
					Для Каждого СтрокаДерева Из ДеревоДокументов.Строки Цикл

						Если Не РеквизитСодержитТип(Реквизит, "ДокументСсылка." + СтрокаДерева.Документ.Имя)
							Или НЕ РеквизитТолькоВШапке(СтрокаДерева) Тогда
							Продолжить;
						КонецЕсли;

						МассивСтруктур = СоответствиеПолей.Получить(Реквизит);
						Если МассивСтруктур = Неопределено Тогда

							МассивСтруктур = Новый Массив;
							СоответствиеПолей.Вставить(Реквизит, МассивСтруктур);

						КонецЕсли;
						МассивСтруктур.Добавить(Новый Структура("Документ, ТекстУсловия",
						СтрокаДерева.Документ,
						СтрокаДерева.ТекстУсловия));
					КонецЦикла;
				КонецЦикла;

				// Построение условия по табличной части.
				Если СоответствиеПолей.Количество() > 0 Тогда
					ВремТекст = "";
					Для Каждого КлючИЗначение Из СоответствиеПолей Цикл
						Для Каждого ТекСтруктура Из КлючИЗначение.Значение Цикл

							Если РеквизитСоставной(КлючИЗначение.Ключ) Тогда
								ПутьКТаблице = "ВЫРАЗИТЬ(ТабличнаяЧасть%ИмяТабЧасти%." + КлючИЗначение.Ключ.Имя +" КАК Документ." + ТекСтруктура.Документ["Имя"] + ")";
							Иначе
								ПутьКТаблице = "ТабличнаяЧасть%ИмяТабЧасти%." + КлючИЗначение.Ключ.Имя;
							КонецЕсли;

							ТекстУсловия = СтрЗаменить(ТекСтруктура.ТекстУсловия, "%ПутьКТаблицеРеквизита%", ПутьКТаблице);
							ТекстУсловия = СтрЗаменить(ТекстУсловия, "%УсловиеНаСсылкуВТЧ%", "ТабличнаяЧасть%ИмяТабЧасти%." + КлючИЗначение.Ключ.Имя);
							ТекстУсловия = СтрЗаменить(ТекстУсловия, "%ИмяТабЧасти%",         ТабЧасть.Имя);

							ДобавитьТекстВСтроку(ВремТекст, ТекстУсловия, " ИЛИ ");

						КонецЦикла;
					КонецЦикла;

					ВремТекст = СтрЗаменить(ШаблонУсловияСтрокиТЧ, "&ТекстУсловия", ВремТекст);
					ВремТекст = СтрЗаменить(ВремТекст, "%ИмяДокумента%", Документ.Имя + "." + ТабЧасть.Имя);
					ВремТекст = СтрЗаменить(ВремТекст, "%ИмяТабЧасти%", ТабЧасть.Имя);

					МассивУсловий.Добавить(ВремТекст);

				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если МассивУсловий.Количество() > 0 Тогда

			ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ИмяТаблицыШапки",  "Документ." + Документ.Имя);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстУсловия", СтрокаИзМассиваСтрок(МассивУсловий, " ИЛИ "));

			ДобавитьДополнительныеПоляШапки(ТекстЗапроса, Документ, ДопПоляШапки);
			ДобавитьЗапросВТаблицу(ТаблицаЗапросов, Документ, ТекстЗапроса);

		КонецЕсли;

	КонецЦикла;

	ШаблонЗапроса = 
	"ВЫБРАТЬ &ПостфиксВыбрать,
	|	ТаблицаШапки.Ссылка              КАК Документ,
	|	&СтрокаДопПолей,
	|	ТаблицаШапки.Номер               КАК Номер,
	|	ТаблицаШапки.Дата                КАК Дата,
	|	ТИПЗНАЧЕНИЯ(ТаблицаШапки.Ссылка) КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаШапки.Проведен ТОГДА
	|			0
	|		КОГДА ТаблицаШапки.ПометкаУдаления ТОГДА
	|			1
	|		ИНАЧЕ 2
	|	КОНЕЦ                        КАК ИдентификаторКартинки
	|ИЗ
	|	&ИмяТаблицыШапки КАК ТаблицаШапки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаОтбора КАК ТаблицаОтбора ПО ТаблицаШапки.Ссылка = ТаблицаОтбора.Документ
	|";
	Для Каждого СтрокаТаб Из ТаблицаЗапросов Цикл

		ВремТекст= СтрЗаменить(ШаблонЗапроса, "&ИмяТаблицыШапки",  "Документ." + СтрокаТаб.ИмяДокумента);
		ДобавитьДополнительныеПоляШапки(ВремТекст, Метаданные.Документы[СтрокаТаб.ИмяДокумента], ДопПоляШапки);

		СтрокаТаб.ТекстЗапросаВыборка = ВремТекст;

	КонецЦикла;

КонецПроцедуры

#КонецЕсли
