
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		
		Если ЗначениеЗаполнено(Вес) Тогда
			Наименование = ?(Вес % 1000 = 0, ("До " + Вес/1000 + "т"), ("До " + Вес + "кг"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Длина) Тогда
			Наименование = Наименование + ?(ЗначениеЗаполнено(Наименование), ", до ", "До ") + Длина + "м";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объем) Тогда
			Наименование = Наименование + ?(ЗначениеЗаполнено(Наименование), ", до ", "До ") + Объем + "м3";
		КонецЕсли;

	КонецЕсли;
	
	//Наименование = "До " + ?(Вес % 1000 = 0, ("" + Вес/1000 + "т, "), ("" + Вес + "кг, ")) + "до " + Длина + "м, до " + Объем + "м3";
КонецПроцедуры
