
&НаСервере
Процедура ОП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	_Коэфф1=1;
	_Коэфф2=1;
	_МинМах2=1;
	_операция1=1;
	_операция2=1;
КонецПроцедуры

&НаКлиенте
Процедура ОП__ПоУсловиюПриИзмененииПосле(Элемент)
	ПриИзмененииПереключателяИндикатораОбеспечения("_ПоУсловию");
КонецПроцедуры

&НаКлиенте
&Вместо ("ПриИзмененииПереключателяИндикатораОбеспечения")
Процедура оп_ПриИзмененииПереключателяИндикатораОбеспечения(ВыбранныйИндикатор)
	
	Любой =          0;
	СрочноКЗаказу =  0;
	БлизкоКЗаказу =  0;
	КОтменеЗаказа =  0;
	МеньшеПоловины = 0;
	БольшеПоловины = 0;
	Избыток =        0;
	
	// изменение
	_ПоУсловию=      0;
	
	ЭтаФорма[ВыбранныйИндикатор] = 1;
	
	ПросмотрЭлПоУсловию=?(_ПоУсловию=1,ложь,истина); 	
	Элементы._Коэфф1.ТолькоПросмотр=ПросмотрЭлПоУсловию;
	Элементы._Коэфф2.ТолькоПросмотр=ПросмотрЭлПоУсловию;
	Элементы._операция1.ТолькоПросмотр=ПросмотрЭлПоУсловию;
	Элементы._операция2.ТолькоПросмотр=ПросмотрЭлПоУсловию;
	Элементы._МинМах1.ТолькоПросмотр=ПросмотрЭлПоУсловию;
	Элементы._МинМах2.ТолькоПросмотр=ПросмотрЭлПоУсловию;
	
КонецПроцедуры

&НаКлиенте
Процедура ОП_ВыбратьВместо(Команда)
	если _ПоУсловию=0 тогда
		КодУровняЗапаса =
			?(Любой = 1,            0,
			?(СрочноКЗаказу = 1,    1,
			?(БлизкоКЗаказу = 1,    2,
			?(КОтменеЗаказа = 1,    3,
			?(МеньшеПоловины = 1,   4,
			?(БольшеПоловины = 1,   5,
			?(Избыток = 1,          6, Неопределено)))))));
		
		ВыбранноеЗначение = Новый Структура("КодУровняЗапаса", КодУровняЗапаса);
	иначе
		формула=""+_Коэфф1+"*"+Элементы._МинМах1.ТекстРедактирования+Элементы._операция1.ТекстРедактирования+"остаток"+
		Элементы._операция2.ТекстРедактирования+Элементы._МинМах2.ТекстРедактирования+"*"+_Коэфф2;
		ВыбранноеЗначение = Новый Структура("УровеньЗапасаПоУсловию", Формула);
	конецесли;
	
	ОповеститьОВыборе(ВыбранноеЗначение);
	
КонецПроцедуры
