// расчет по СКД

// Осуществляет формирование новой СКД.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных - Схема компоновки данных.
//
Функция СформироватьНовуюСхемуКомпоновкиДанных() Экспорт
	
	СКД                         = Новый СхемаКомпоновкиДанных;
	Источник                    = СКД.ИсточникиДанных.Добавить();
	Источник.Имя                = "ИсточникДанныхПоказатели";
	Источник.ТипИсточникаДанных = "Local";
	НаборДанных                 = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя             = "ДанныеПоказателя";
	НаборДанных.Запрос          =
	 "ВЫБРАТЬ
	 |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	 |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	 |	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Склад,
	 |	0 КАК МинимальноеКоличествоЗапаса,
	 |	0 КАК МаксимальноеКоличествоЗапаса
	 |{ГДЕ
	 |	(ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)).* КАК Номенклатура,
	 |	(ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)).* КАК Характеристика,
	 |	(ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)).* КАК Склад}" ;
		
	НаборДанных.ИсточникДанных = "ИсточникДанныхПоказатели";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Ложь;
	
	ОбязательныеПоля = ПолучитьОбязательныеПоляСхемыКомпоновкиДанных();
	
	Для Каждого ОбязательноеПоле Из ОбязательныеПоля Цикл
		
		НовоеПоле             = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Поле        = ОбязательноеПоле.Ключ;
		НовоеПоле.ПутьКДанным = ОбязательноеПоле.Ключ;
		НовоеПоле.ТипЗначения = ОбязательноеПоле.Значение;
		
	КонецЦикла;
	
	Возврат СКД;

КонецФункции
// Возвращает структуру с синонимом и схемой компоновки
// данных по имени макета
//
// Параметры:
//	Ссылка - СправочникСсылка.ВидыЦены - ссылка на вид цены
//	ИмяМакета - Строка - имя макета, из которого необходимо получить описание и схему
//
// Возвращаемое значение:
//	Структура - описание и схема компоновки данных
//
Функция ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(Ссылка, ИмяМакета = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Описание",                  "");
	ВозвращаемоеЗначение.Вставить("СхемаКомпоновкиДанных",     Неопределено);
	ВозвращаемоеЗначение.Вставить("НастройкиКомпоновкиДанных", Неопределено);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	оп_АлгоритмыОбеспеченияПотребностей.ХранилищеСхемыКомпоновкиДанных КАК ХранилищеСхемыКомпоновкиДанных,
	|	оп_АлгоритмыОбеспеченияПотребностей.ХранилищеНастроекКомпоновкиДанных КАК ХранилищеНастроекКомпоновкиДанных
	|ИЗ
	|	Справочник.оп_АлгоритмыОбеспеченияПотребностей КАК оп_АлгоритмыОбеспеченияПотребностей
	|ГДЕ
	|	оп_АлгоритмыОбеспеченияПотребностей.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
		
		ВозвращаемоеЗначение.Описание = ИмяМакета;
		Если Выборка.Следующий() Тогда
			
			СхемаКомпоновкиДанных = Выборка.ХранилищеСхемыКомпоновкиДанных.Получить();
			Если СхемаКомпоновкиДанных = Неопределено Тогда
				ВозвращаемоеЗначение.СхемаКомпоновкиДанных = СформироватьНовуюСхемуКомпоновкиДанных();
				ВозвращаемоеЗначение.НастройкиКомпоновкиДанных = Неопределено;
			Иначе
				ВозвращаемоеЗначение.СхемаКомпоновкиДанных = СхемаКомпоновкиДанных;
				ВозвращаемоеЗначение.НастройкиКомпоновкиДанных = Выборка.ХранилищеНастроекКомпоновкиДанных.Получить();
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.Описание = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).Макеты.Найти(ИмяМакета).Синоним;
		ВозвращаемоеЗначение.СхемаКомпоновкиДанных = Справочники.оп_ПоказателиРасчета.ПолучитьМакет(ИмяМакета);
		Если Выборка.Следующий() Тогда
			ВозвращаемоеЗначение.НастройкиКомпоновкиДанных = Выборка.ХранилищеНастроекКомпоновкиДанных.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
// Возвращает имена и типы полей, которые должны обязательно присутствовать.
// в СКД, используемой для заполнения цен по данным ИБ.
//
// Возвращаемое значение:
//	 Соответствие - В ключах содержатся имена полей. В значениях - типы полей.
//
Функция ПолучитьОбязательныеПоляСхемыКомпоновкиДанных() Экспорт
	
	Поля = Новый Соответствие;
	
	Поля.Вставить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Поля.Вставить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Поля.Вставить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	Поля.Вставить("МинимальноеКоличествоЗапаса",   Новый ОписаниеТипов("Число"));
	Поля.Вставить("МаксимальноеКоличествоЗапаса",   Новый ОписаниеТипов("Число"));
	
	Возврат Поля;
	
КонецФункции
// Проверяет схему компоновки данных на соответствие ограничениям, необходимым
// для ее использования при расчете цен.
//
// Параметры:
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема, которую необходимо проверить.
//  СообщениеОбОшибке     - Строка - содержит вводную часть сообщения об ошибке.
//
// Возвращаемое значение:
//  Булево - Истина, если проверка пройдена успешно.
//
Функция ПроверитьСхемуКомпоновкиДанных(СхемаКомпоновкиДанных, СообщениеОбОшибке = Неопределено) Экспорт
	
	Поля = ПолучитьОбязательныеПоляСхемыКомпоновкиДанных();
	
	Возврат ПроверитьСхемуКомпоновкиДанныхПоОбязательнымПолям(СхемаКомпоновкиДанных, Поля, СообщениеОбОшибке);
	
КонецФункции
// Проверяет схему компоновки данных на соответствие ограничениям, необходимым
// для ее использования при расчете цен
//
// Параметры:
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема, которую необходимо проверить.
//  СообщениеОбОшибке     - Строка - Строка, содержит вводную часть сообщения об ошибке.
//
// Возвращаемое значение:
//  Булево - Истина, если проверка пройдена успешно.
//
Функция ПроверитьСхемуКомпоновкиДанныхПоОбязательнымПолям(СхемаКомпоновкиДанных, Поля, СообщениеОбОшибке = Неопределено) Экспорт
	
	Результат = Истина;
	
	Если СхемаКомпоновкиДанных <> Неопределено И СхемаКомпоновкиДанных.НаборыДанных.Количество() = 1 Тогда
		
		РабочийНаборДанных = СхемаКомпоновкиДанных.НаборыДанных[0];
		
		Для Каждого Поле Из Поля Цикл
			Если Не ПроверитьПолеНабораДанныхСКД(РабочийНаборДанных, Поле.Ключ, Поле.Значение, СообщениеОбОшибке) Тогда
				Результат = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(ЗначениеЗаполнено(СообщениеОбОшибке), СообщениеОбОшибке + ": ", "") 
			+ НСтр("ru='Схема компоновки данных для заполнения показателя должна содержать один набор данных.'"));
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// Проверяет набор данных СКД, что он содержит заданное поле соответствующего типа
//
// Параметры:
//  НаборДанных         - набор данных, который необходимо проверить
//  ИмяПоля             - Строка, содержащее имя поля
//  ТипЗначения         - ОписаниеТипов, тип который должно иметь поле СКД
//  СообщениеОбОшибке   - Строка, содержит вводную часть сообщения об ошибке
//
// Возвращаемое значение:
//  Булево - Истина, если набор данных содержит требуемое поле.
//
Функция ПроверитьПолеНабораДанныхСКД(НаборДанных, ИмяПоля, ТипЗначения, СообщениеОбОшибке = Неопределено)
	
	Поле = НаборДанных.Поля.Найти(ИмяПоля);
	
	Если Поле = Неопределено Тогда
		Результат = Ложь;
	Иначе
		ТипыПоля       = Поле.ТипЗначения.Типы();
		ДопустимыеТипы = ТипЗначения.Типы();
		
		Результат = Истина;
		Если Поле <> Неопределено И ТипыПоля.Количество() = ДопустимыеТипы.Количество() Тогда
			
			Для Каждого Тип Из ДопустимыеТипы Цикл
				Если ТипыПоля.Найти(Тип) = Неопределено Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(ЗначениеЗаполнено(СообщениеОбОшибке), СообщениеОбОшибке + ": ", "") 
			+ СтрЗаменить(СтрЗаменить(НСтр("ru='Схема компоновки данных для заполнения показателя должна содержать поле ""%ИмяПоля%"" с типом значения ""%ТипЗначения%"".'"), "%ИмяПоля%", ИмяПоля), "%ТипЗначения%", ТипЗначения));
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции
// Добавляет выбранное поле в группировку компоновки
//
Процедура ДобавитьВыбранноеПолеСКД(ГруппировкаКомпоновкиДанных, Поле) Экспорт
	
	ВыбранноеПоле               = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных(Поле);
	ВыбранноеПоле.Использование = Истина;
	
КонецПроцедуры




// расчет по формеле
Функция РезультатРасчета(СтруктураПараметров,БазовыеПараметры,АлгоритмРасчета,типформулы) экспорт
	Показатели= АлгоритмРасчета.Показатели;
	если типформулы=0 тогда
		Формула=АлгоритмРасчета.ФормулаМакс;
		видформулы=АлгоритмРасчета.ВидФормулыМакс;
	иначе
		Формула=АлгоритмРасчета.ФормулаМин;
		видформулы=АлгоритмРасчета.ВидФормулыМин;
	конецесли;
	
	если пустаястрока(Формула) тогда
		возврат 0;
	конецесли;	
	Результат=0;
	ФормулаСтр=ВРЕГ(СТРОКА(Формула));
	ФормулаПоказ=ФормулаСТР;
	для каждого стр из Базовыепараметры цикл
		если найти(ФормулаСТР,ВРЕГ(стр.Ключ))>0 тогда
			ФормулаСТР=стрзаменить(ФормулаСТР,ВРЕГ(стр.Ключ),"БазовыеПараметры."+стр.ключ);
			ФормулаПоказ=стрзаменить(ФормулаПоказ,ВРЕГ(стр.Ключ),стр.значение);
		конецесли;
	конеццикла;	
	сч=0;
	ФормулаСТР=стрзаменить(ФормулаСТР,"КОНЕЦЦИКЛА","сч=сч+1; если сч>10000 тогда Сообщить (""Зацикливание""); прервать; конецесли; конеццикла");
	
	к=1;
	для каждого пок из Показатели цикл
		
		если найти(ФормулаСТР,ВРЕГ(Пок.Показатель.идентификатор))>0 тогда
			СтрокаПоказателя=ВРЕГ(Пок.Показатель.идентификатор);
				если ПоказательСПараметром(Пок.Показатель) тогда
							
				пока найти(ФормулаСТР,ВРЕГ(СтрокаПоказателя)+"[")>0 цикл
					РазделительН=найти(ФормулаСТР,ВРЕГ(СтрокаПоказателя));
					ФормулаПоказателя=СРЕД(Формуластр,РазделительН);
					РазделительК=Найти(ФормулаПоказателя,"]");
					ПоказательСПараметром=СРЕД(ФормулаПоказателя,1,РазделительК);
					// если 0 - ошибка
					//	РазделительН=РазделительН+стрдлина(СтрокаПоказателя);
					ПараметрСТР=СТРЗАМЕНИТЬ(ПоказательСПараметром,СтрокаПоказателя,"");
					ПараметрСТР=СТРЗАМЕНИТЬ(ПараметрСТР,"[","");
					ПараметрСТР=СТРЗАМЕНИТЬ(ПараметрСТР,"]","");
					//	СтруктураПараметров.ДопПараметрДата=началомесяца(ЗначениеПараметра);
					если видформулы=0 тогда
						ЗначениеПараметра=Вычислить(ПараметрСТР); 
						значениепоказателя=ЗначениеПоказателяИзСтроки(СтрокаПоказателя,СтруктураПараметров,ЗначениеПараметра);
						значениепоказателя=стрзаменить(значениепоказателя,Символы.нпп,"");
						Значениепоказателя=Стрзаменить(Значениепоказателя,",",".");
						ФормулаСТР=СтрЗаменить(ФормулаСТР,ПоказательСПараметром,значениепоказателя);
					иначе
						СтруктураПараметров.Вставить("П"+строка(к),Пок.Показатель.идентификатор);
						ФункцияСтр="ЗначениеПоказателяИзСтроки("+"СтруктураПараметров.П"+строка(к)+",СтруктураПараметров,"+ПараметрСтр+")";
						ФормулаСТР=СтрЗаменить(ФормулаСТР,ПоказательСПараметром,ФункцияСтр);
					конецесли;
					
				конеццикла;
				
			иначе
				значениепоказателя=ЗначениеПоказателяИзСтроки(СтрокаПоказателя,СтруктураПараметров);
				Значениепоказателя=Стрзаменить(Значениепоказателя,",",".");
				Значениепоказателя=Стрзаменить(Значениепоказателя,Символы.НПП,"");
				
				ФормулаСТР=СтрЗаменить(ФормулаСТР,ВРЕГ(Пок.Показатель.идентификатор),значениепоказателя);
				ФормулаПоказ=СтрЗаменить(ФормулаПоказ,ВРЕГ(Пок.Показатель.идентификатор),значениепоказателя);
			конецесли;	
		конецесли;
		к=к+1;
	конеццикла;	
	попытка
	если видформулы=0 тогда
		Результат=вычислить(формулаСТР);
	иначе
		
		Выполнить(формулаСТР);
		
	конецесли; 
		исключение
	  Сообщить("Ошибка в формуле расчета на алгоритме "+АлгоритмРасчета+" ,"+"по товару "+СтруктураПараметров.Номенклатура+": "+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	конецпопытки;
	Возврат Результат;
КонецФункции

Функция ПоказательСпараметром(Показатель)

	 возврат Показатель.ИспользоватьДату;

КонецФункции // ПоказательСпараметром()

Функция ЗначениеПоказателяИзСтроки(СтрПоказатель,СтруктураПараметров,ДопПараметр=неопределено)
	если ДопПараметр<>НЕОПРЕДЕЛЕНО тогда 
	ДопПараметрДата=началомесяца(ДопПараметр);
	конецесли;
	ПоказательСправочник=Справочники.оп_ПоказателиРасчета.НайтиПоРеквизиту("Идентификатор",СтрПоказатель);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	оп_РезультатРасчетаПоказателей.РезультатЧисло КАК РезультатЧисло
	|ИЗ
	|	РегистрСведений.оп_РезультатРасчетаПоказателей КАК оп_РезультатРасчетаПоказателей
	|ГДЕ
	|	оп_РезультатРасчетаПоказателей.Показатель = &Показатель
	|	И оп_РезультатРасчетаПоказателей.Характеристика = &Характеристика
	|	и оп_РезультатРасчетаПоказателей.Номенклатура = &Номенклатура
	|	И оп_РезультатРасчетаПоказателей.Склад = &Склад
	|	И оп_РезультатРасчетаПоказателей.ДопПараметрДата = &ДопПараметрДата";
	
	Запрос.УстановитьПараметр("ДопПараметрДата", ДопПараметрДата);
	Запрос.УстановитьПараметр("Номенклатура", СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Показатель",ПоказательСправочник );
	Запрос.УстановитьПараметр("Склад", СтруктураПараметров.Склад);
	Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
	
	если не ПоказательСправочник.ИспользоватьСклады тогда
		Запрос.Текст=Стрзаменить(Запрос.Текст,"И оп_РезультатРасчетаПоказателей.Склад = &Склад","");
	конецесли;
	если не ПоказательСправочник.ИспользоватьХарактеристики тогда
		Запрос.Текст=Стрзаменить(Запрос.Текст,"И оп_РезультатРасчетаПоказателей.Характеристика = &Характеристика","");
	конецесли;
	если не ПоказательСправочник.ИспользоватьДату тогда
		Запрос.Текст=Стрзаменить(Запрос.Текст,"И оп_РезультатРасчетаПоказателей.ДопПараметрДата = &ДопПараметрДата","");
	конецесли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.РезультатЧисло;
	иначе	
		возврат ПоказательСправочник.ЗначениеПоУмолчанию;
	Конецесли;

КонецФункции // ЗначениеПоказателяИзСтроки()

Процедура РасчетДанныхСтроки(СтрокаЗапасов,ДополнительныеПараметры=Неопределено) экспорт
	ПараметрыТовара=Новый Структура();
	ПараметрыТовара.Вставить("Номенклатура",Строказапасов.Номенклатура);
	ПараметрыТовара.Вставить("Характеристика",Строказапасов.Характеристика);
	ПараметрыТовара.Вставить("Склад",Строказапасов.Склад);
	
	Алгоритм=СтрокаЗапасов.АлгоритмРасчета;
	БазовыеПараметры=Новый Структура();
	БазовыеПараметры.Вставить("ТекущаяДата",ТекущаяДата());
	БазовыеПараметры.Вставить("СрокПоставки",Строказапасов.СрокПоставки);
	БазовыеПараметры.Вставить("ОбеспечиваемыйПериод",Строказапасов.ОбеспечиваемыйПериод);
	БазовыеПараметры.Вставить("ДатаПоставки",Строказапасов.ДатаПоставки);
	БазовыеПараметры.Вставить("МаксЗапас",Строказапасов.МаксимальныйЗапас);
	БазовыеПараметры.Вставить("МинЗапас",Строказапасов.МинимальныйЗапас);
	БазовыеПараметры.Вставить("ОстатокНаСкладе",Число(Строказапасов.Остаток));
	БазовыеПараметры.Вставить("ЗаказыКПоступлению",Строказапасов.ЗаказыКПоступлению);  
	если ДополнительныеПараметры<>Неопределено тогда
		если ДополнительныеПараметры.Свойство("ИспользоватьТренд") тогда
			если ДополнительныеПараметры.ИспользоватьТренд тогда
				БазовыеПараметры.Вставить("ТрендПараметр",Строказапасов.ТрендПараметр);  
			иначе
				БазовыеПараметры.Вставить("ТрендПараметр",0);  	   
			конецесли; 
		конецесли; 	
		если ДополнительныеПараметры.Свойство("ИспользоватьПеремещения") тогда
			БазовыеПараметры.Вставить("ИспользоватьПеремещения",ДополнительныеПараметры.ИспользоватьПеремещения);	
		конецесли;
	конецесли;
	СтрокаЗапасов.МаксимальныйЗапас=РезультатРасчета(ПараметрыТовара,БазовыеПараметры,Алгоритм,0);	
	СтрокаЗапасов.МинимальныйЗапас=РезультатРасчета(ПараметрыТовара,БазовыеПараметры,Алгоритм,1);	
	
Конецпроцедуры // РасчетДанныхСтроки()
