
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
    Объект.Партнер = Параметры.Партнер;
    Склад=Параметры.Склад;
	ИнициализироватьТабличныйДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	МакетЗаполненияПоВнешнемуИсточнику = Обработки.ЗагрузкаТоваровИзВнешнихФайлов.ПолучитьМакет("МакетЗаявкиКлиентов");
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Очистить();  
	
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаявку(Команда)
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C2").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C3").Текст);
	
	Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	если СопоставленыДанныеТабличногоДокументаСДаннымиИБ()	 тогда 
		ОбработатьТаблицуЗаявок();
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг3;
	иначе
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг2;
	конецесли;	
	
КонецПроцедуры

&НаСервере
Функция СопоставленыДанныеТабличногоДокументаСДаннымиИБ()
	
	ТоварыДляЗаявки.Очистить(); 
	ТоварыНеСопоставленные.Очистить();
	НомерСтроки = 2 ;
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ЗаполненыНоменклатураАртикул=ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст)
	или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст);
	Пока ЗаполненыНоменклатураАртикул Цикл     
		Артикул=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст;  
		НоменклатураПартнера=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст;  
		НоменклатураПартнераСсылка="";
		если значениезаполнено(Артикул) тогда
			НоменклатураПартнераСсылка=Справочники.НоменклатураКонтрагентов.НайтиПоРеквизиту("Артикул",Артикул,,Объект.Партнер);
		иначеесли значениезаполнено(НоменклатураПартнера) тогда
			НоменклатураПартнераСсылка=Справочники.НоменклатураКонтрагентов.НайтиПоНаименованию(НоменклатураПартнера,истина,,Объект.Партнер);
		конецесли;
		Количество=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C3").Текст;
		если значениезаполнено(НоменклатураПартнераСсылка) тогда  
			Стр=ТоварыДляЗаявки.Добавить();
			Стр.НоменклатураПартнера=НоменклатураПартнераСсылка;
			Стр.Номенклатура=НоменклатураПартнераСсылка.Номенклатура;
			стр.Количество=ПривестиКЧислу(Количество);
		иначе
			стр=ТоварыНеСопоставленные.Добавить();
			стр.Артикул=Артикул;
			стр.НоменклатураСтрока=НоменклатураПартнера; 
			стр.Количество=ПривестиКЧислу(Количество);
		конецесли;	
		НомерСтроки = НомерСтроки+1 ;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		ЗаполненыНоменклатураАртикул=ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст)
		или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст);

	конеццикла;	                                   
	
	возврат  ТоварыНеСопоставленные.Количество()=0;
	
КонецФункции               

&НаКлиентеНаСервереБезКонтекста
Функция ПривестиКЧислу(ЗначениеДляПриведения)
	мТипов = Новый Массив;
	мТипов.Добавить(Тип("Число"));
	мТипов.Добавить(Тип("ОписаниеТипов"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(мТипов);
	ПриведенноеЗначение = ОписаниеТиповЧ.ПривестиЗначение(ЗначениеДляПриведения);
	
	Возврат ПриведенноеЗначение;
КонецФункции // ПривестиКЧислу()


&НаКлиентеНаСервереБезКонтекста
Функция ПрисвоитьЧисловоеЗначение(Приемник, СтрокаИсточникЧисловогоЗначения, АбсолютныйНомерСтроки, НазваниеКолонки, ВысотаШапки = 0)
	Успех = Истина;
	
	ЗначениеДляПриведения = СтрЗаменить(СтрокаИсточникЧисловогоЗначения, " ", "");
	Если ЗначениеЗаполнено(ЗначениеДляПриведения) Тогда
		мТипов = Новый Массив;
		мТипов.Добавить(Тип("Число"));
		мТипов.Добавить(Тип("ОписаниеТипов"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(мТипов);
		ПриведенноеЗначение = ОписаниеТиповЧ.ПривестиЗначение(ЗначениеДляПриведения);
		Если Не ПриведенноеЗначение = Неопределено Тогда
			Приемник = ПриведенноеЗначение;			
		Иначе
			Успех = Ложь;
			ТекстОшибки = НСтр("ru='В строке %НомерСтроки%, колонке ""%Колонка%"" введено значение ""%Значение%"", не являющееся числом.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", АбсолютныйНомерСтроки-ВысотаШапки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Колонка%", НазваниеКолонки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Значение%", СтрокаИсточникЧисловогоЗначения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;	
	Иначе
		Приемник = 0;
	КонецЕсли;
	
	Возврат Успех;
КонецФункции

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	ДобавитьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруНаСервере()
	ошибокнет=истина;         
	УстановитьПривилегированныйРежим(истина);
	для каждого стр из ТоварыНеСопоставленные цикл
		если значениезаполнено(стр.Номенклатура) и не значениезаполнено(стр.НоменклатураПартнера) тогда
			попытка      
				Спр=Справочники.НоменклатураКонтрагентов.СоздатьЭлемент(); 
				Спр.Владелец=Объект.Партнер;
				Спр.Артикул=стр.Артикул;
				Спр.Наименование=стр.НоменклатураСтрока;  
				Спр.НаименованиеНоменклатуры=стр.НоменклатураСтрока;  
				спр.Номенклатура=стр.Номенклатура;
				//спр.ОбменДанными.Загрузка=истина;
				Спр.Записать();
				стр.НоменклатураПартнера=Спр.ссылка;
			исключение	
				ошибокнет=Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
					?(Спр.ДополнительныеСвойства.Свойство("ОбнаруженоДублированиеКлючевыхЗначений"), Спр.ДополнительныеСвойства.ОбнаруженоДублированиеКлючевыхЗначений, Неопределено));
			конецпопытки;	
		конецесли;
	конеццикла;	         
	УстановитьПривилегированныйРежим(ложь);
	если ошибокнет тогда    
		//для Индекс=0 по ТоварыНеСопоставленные.Количество() цикл 
		//	если  ТоварыНеСопоставленные.Количество()=0 тогда
		//		прервать;
		//	конецесли;	
		//	если значениезаполнено(стр.Номенклатура) тогда
		//		СтрТовары=ТоварыДляЗаявки.Добавить();
		//		заполнитьзначениясвойств(стрТовары,стр);  
		//		ТоварыНеСопоставленные.Удалить(Индекс);
		//		Индекс=Индекс-1;
		//	конецесли;	
		//конеццикла;	   
		
		ВсегоСтрок=ТоварыНеСопоставленные.Количество();        
		сч=1;        
		пока сч<=ВсегоСтрок цикл        
			стр=ТоварыНеСопоставленные.Получить(сч-1);
			если значениезаполнено(стр.Номенклатура) тогда
				СтрТовары=ТоварыДляЗаявки.Добавить();
				заполнитьзначениясвойств(стрТовары,стр);  
				ТоварыНеСопоставленные.Удалить(сч-1);
				ВсегоСтрок = ВсегоСтрок -1;
			Иначе
				сч=сч+1;
			КонецЕсли;    
		Конеццикла;
		ОбработатьТаблицуЗаявок();
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг3;
	конецесли;	
КонецПроцедуры   

Процедура ОбработатьТаблицуЗаявок()

	
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.НоменклатураПартнера КАК НоменклатураПартнера,
		|	Таблица.Количество КАК Количество
		|ПОМЕСТИТЬ ВР_таблица
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_таблица.Номенклатура КАК Номенклатура,
		|	ВР_таблица.НоменклатураПартнера КАК НоменклатураПартнера,
		|	ВР_таблица.Количество КАК Количество,
		|	ВР_таблица.Количество КАК КоличествоУпаковок,
		|	ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток КАК ДоступныйОстаток,
		|	ВЫБОР
		|		КОГДА ВР_таблица.Количество > ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0)
		|			ТОГДА ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) - ВР_таблица.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК нехватка,
		|	ВР_таблица.Количество > ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) КАК Нехватает
		|ИЗ
		|	ВР_таблица КАК ВР_таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(
		|				,
		|				Склад = &Склад
		|					И Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ЗапасыИПотребностиОстатки
		|		ПО ВР_таблица.Номенклатура = ЗапасыИПотребностиОстатки.Номенклатура";
			
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Таблица", ТоварыДляЗаявки.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	ТоварыДляЗаявки.Загрузить(РезультатЗапроса.Выгрузить());


КонецПроцедуры


&НаКлиенте
Процедура ПропуститьНоменклатуру(Команда)       
	    ОбработатьТаблицуЗаявок();
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг3;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)        
	если Элементы.Шаги.ТекущаяСтраница.Имя="Шаг3" тогда 
		если ТоварыНеСопоставленные.Количество()>0 Тогда
			Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг2;  
		иначе      
			Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг1;  
		конецесли;
	иначеесли Элементы.Шаги.ТекущаяСтраница.Имя="Шаг2" тогда
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг1;  
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТовары(Команда)
		АдресТоваровВХранилище = ПоместитьТоварыВХранилище();
		Закрыть(АдресТоваровВХранилище);
КонецПроцедуры

&НаСервере
Функция ТаблицаСВариантамиОбеспечения()
	ТаблицаРезультата=ТоварыДляЗаявки.Выгрузить();
	ТаблицаРезультата.Очистить();
	для каждого стр из ТоварыДляЗаявки цикл  

		стр.Склад = Склад; 
		стр.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.СоСклада;
		если стр.ДоступныйОстаток=0 тогда
			стр.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.НеТребуется; 
		иначеесли стр.Количество>стр.ДоступныйОстаток Тогда
			Нехватка=стр.Количество-стр.ДоступныйОстаток;
			стр.Количество=стр.ДоступныйОстаток;
			стр.КоличествоУпаковок=стр.ДоступныйОстаток;
			ДобавленнаяСтрока=ТаблицаРезультата.Добавить();
			заполнитьЗначенияСвойств(ДобавленнаяСтрока,стр); 
			ДобавленнаяСтрока.Количество=Нехватка;
			ДобавленнаяСтрока.КоличествоУпаковок=Нехватка;
			ДобавленнаяСтрока.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.НеТребуется;  
		конецесли;      
		ДобавленнаяСтрока=ТаблицаРезультата.Добавить();
		заполнитьЗначенияСвойств(ДобавленнаяСтрока,стр);		
	конеццикла;	
   Возврат ТаблицаРезультата;
КонецФункции


&НаСервере
Функция ПоместитьТоварыВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаСВариантамиОбеспечения());
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	  Закрыть();
КонецПроцедуры
