#Область ОбработчикиСобытийФормы
&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Родитель") И Параметры.Родитель = "ФормаБлокировки"
		И Параметры.Свойство("Номенклатура") И Параметры.Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()
		И Параметры.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры
		Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	СправочникХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
		|	СправочникХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникХарактеристикиНоменклатуры.Наименование КАК Наименование,
		|	СправочникХарактеристикиНоменклатуры.НаименованиеПолное КАК НаименованиеПолное,
		|	СправочникХарактеристикиНоменклатуры.Принципал КАК Принципал,
		|	СправочникХарактеристикиНоменклатуры.Контрагент КАК Контрагент,
		|	СправочникХарактеристикиНоменклатуры.ДополнительныеРеквизиты.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Свойство КАК Свойство,
		|		Значение КАК Значение,
		|		ТекстоваяСтрока КАК ТекстоваяСтрока
		|	) КАК ДополнительныеРеквизиты,
		|	СправочникХарактеристикиНоменклатуры.Предопределенный КАК Предопределенный,
		|	СправочникХарактеристикиНоменклатуры.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	(ЗапасыИПотребность.ВНаличииОстаток - ЗапасыИПотребность.РезервироватьНаСкладеОстаток) КАК Остаток
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК СправочникХарактеристикиНоменклатуры
		|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО (ВариантыКомплектацииНоменклатуры.Владелец = &Номенклатура)
		|			И (ВариантыКомплектацииНоменклатуры.Характеристика = СправочникХарактеристикиНоменклатуры.Ссылка)
		|			И (ВариантыКомплектацииНоменклатуры.Основной)}
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(,
		|			Номенклатура = &Номенклатура
		|			И Склад = &Склад
		|			И Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ЗапасыИПотребность
		|		ПО ЗапасыИПотребность.Характеристика = СправочникХарактеристикиНоменклатуры.Ссылка
		|ГДЕ
		|	(ЗапасыИПотребность.ВНаличииОстаток - ЗапасыИПотребность.РезервироватьНаСкладеОстаток) > 0 И
		|	(СправочникХарактеристикиНоменклатуры.Владелец =  &Номенклатура)	
		|{ГДЕ
		|	(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)) В (&ВариантыРасчетаЦеныНабора)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Поле2,
		|	ВариантыКомплектацииНоменклатуры.СодержитУслуги,
		|	ВариантыКомплектацииНоменклатуры.СодержитТовары}";

		Если Параметры.Свойство("Склад") И Параметры.Склад = Справочники.Склады.ПустаяСсылка() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите склад в окне блокировки или в отборе таблицы для вывода дотсупных позиций только по одному складу.");
		КонецЕсли;
		
		Список.ТекстЗапроса = ТекстЗапроса;
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
		Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
	КонецЕсли; 
КонецПроцедуры
#КонецОбласти