#Область ПеременныеФормы
&НаКлиенте
Перем БылаОшибкаНаКарточке; // Для выдачи второй попытки сканирования товара
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Сотрудник = Параметры.Сотрудник;
		Объект.Сотрудник = Сотрудник;
		Объект.Склад = Сотрудник.Склад;
		Повтор = ?(Параметры.Свойство("Повтор"), Истина, Ложь);
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.ВРаботе");
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Точка = Объект.ТочкаПересчетаОбучение;
			
		ИначеЕсли Параметры.Свойство("ТочкаПересчетаОбучение") И ЗначениеЗаполнено(Параметры.ТочкаПересчетаОбучение) Тогда
			Точка = Параметры.ТочкаПересчетаОбучение;
			
		Иначе
		    Точка = Неопределено;
		КонецЕсли; 
		
		Объект.ТочкаПересчетаОбучение = ПолучитьТочкуДляИзучения(Сотрудник, Повтор, Точка);
		ТекущаяСтрока = 0;
		
	Иначе
		ТекущаяСтрока = Объект.ПоследняяОткрытаяСтрока;
	КонецЕсли;
	
	ВремяНачала = ТекущаяДата();
	ЭтаФорма.Заголовок = Объект.ТочкаПересчетаОбучение.Наименование;   
	
	//Подключение оповещений из очереди 
	
	Сотрудник = Объект.Сотрудник;

	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = Сотрудник.ОповещенияИзОчереди; 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;     
	ИнтервалОповещений = Инт;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ИнициализироватьСканер();
	
	ЗаполнитьРеквизитыПоТекущейСтроке(ТекущаяСтрока); 
	
	Если ОповещенияИзОчереди Тогда
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли;
	ИнициализироватьСканер();
	
КонецПроцедуры
#КонецОбласти


#Область КомандыФормы
&НаКлиенте
Процедура Далее(Команда)
	
	Если Комментарий = "" Тогда
		Сообщить("Заполните комментарий");
	Иначе
		Проверено = Истина;
		ПереходКСледующейКарточке();
		Проверено = Ложь;
	КонецЕсли;  
	
КонецПроцедуры
                                
&НаКлиенте
Процедура Пауза(Команда) 
	
	Объект.ПоследняяОткрытаяСтрока = ТекущаяСтрока;
	ОтключитьСканер();
	ЗаписатьВремя();
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);        
	ПровестиДокумент();
	ЭтаФорма.Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбучение(Команда) 
	
	УстановитьСтатус();
	ОтключитьСканер();
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаСервере
Процедура ПровестиДокумент()
	УстановитьПривилегированныйРежим(Истина);
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КСледующейГруппе(Команда) 
	

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сотрудник", Объект.Сотрудник);
	ЭтаФорма.Закрыть();
	ОткрытьФорму("Документ.ИзучениеАссортимента.Форма.ФормаДокументаТСД", ПараметрыФормы);  
	
КонецПроцедуры

&НаКлиенте
Процедура Повторить(Команда) 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Повтор", Истина);
	ПараметрыФормы.Вставить("Сотрудник", Объект.Сотрудник);
	ПараметрыФормы.Вставить("ЗначениеКопирования", Объект.Ссылка); 
	ЭтаФорма.Закрыть();
	ОткрытьФорму("Документ.ИзучениеАссортимента.Форма.ФормаДокументаТСД", ПараметрыФормы);  
	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура ЗаписатьВремя()
	Объект.ВремяВСекундах = Объект.ВремяВСекундах + Число((ТекущаяДата() - ВремяНачала));
КонецПроцедуры

Функция ПолучитьТочкуДляИзучения(Сотрудник, ПовторноеИзучение, Точка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзучениеАссортимента.ТочкаПересчетаОбучение КАК ТочкаПересчетаОбучение
		|ПОМЕСТИТЬ ВТ_Изучено
		|ИЗ
		|	Документ.ИзучениеАссортимента КАК ИзучениеАссортимента
		|ГДЕ
		|	ИзучениеАссортимента.Сотрудник = &Сотрудник
		|	И НЕ ИзучениеАссортимента.ПометкаУдаления
		|	И ИзучениеАссортимента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИзученияАссортимента.Завершено)
		|{ГДЕ
		|	(ИзучениеАссортимента.ТочкаПересчетаОбучение = &Точка) КАК Повтор}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ВидыНоменклатуры.Ссылка КАК Вид,
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение КАК Точка,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция
		|ПОМЕСТИТЬ ВТ_Виды
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ПО РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыНаСкладахОстатки.Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В(&РабочийУчасток)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение КАК Точка
		|ПОМЕСТИТЬ ВТ_Точка
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение.ЭтоТочка
		|	И (НЕ ВидыНоменклатуры.ТочкаПересчетаОбучение В
		|					(ВЫБРАТЬ
		|						ВТ_Изучено.ТочкаПересчетаОбучение
		|					ИЗ
		|						ВТ_Изучено КАК ВТ_Изучено)
		|			ИЛИ &ПовторноеИзучение)
		|	И (НЕ &ПовторноеИзучение
		|			ИЛИ ВидыНоменклатуры.ТочкаПересчетаОбучение В (&Точка))
		|	И ВидыНоменклатуры.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Виды.Вид
		|			ИЗ
		|				ВТ_Виды КАК ВТ_Виды)
		|	И ВидыНоменклатуры.ТочкаПересчетаОбучение.Порядок <> 168
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение.Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Виды.Номенклатура КАК Номенклатура,
		|	ВТ_Виды.Характеристика КАК Характеристика,
		|	ВТ_Виды.Ячейка КАК Ячейка,
		|	ВТ_Виды.Точка КАК Точка,
		|	ВТ_Виды.Секция КАК Секция
		|ИЗ
		|	ВТ_Виды КАК ВТ_Виды
		|ГДЕ
		|	ВТ_Виды.Точка В
		|			(ВЫБРАТЬ
		|				ВТ_Точка.Точка
		|			ИЗ
		|				ВТ_Точка)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("РабочийУчасток", Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток"));
	Запрос.УстановитьПараметр("ПовторноеИзучение", ПовторноеИзучение);
	Запрос.УстановитьПараметр("Точка", ?(ПовторноеИзучение, Точка, Неопределено));
	
	УстановитьПривилегированныйРежим(Истина);
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаТочка = МассивРезультатов[2].Выгрузить()[0][0];
	
	СформироватьТабЧасть(МассивРезультатов[3].Выгрузить());
	
	Возврат ВыборкаТочка;

КонецФункции

Процедура СформироватьТабЧасть(ТЗ)
	
	ТаблицаТоваров = ПолучитьТоварыПоСекции(ТЗ);
	КоличествоТоваров = ТаблицаТоваров.Количество();
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	МассивСтрок = Новый Массив;
	КоличествоСтрок = ?(КоличествоТоваров < 20, КоличествоТоваров, 20); //изменить
	Пока МассивСтрок.Количество() < КоличествоСтрок Цикл
		НомерСтроки = ГСЧ.СлучайноеЧисло(0, КоличествоТоваров-1);
		Если МассивСтрок.Найти(ТаблицаТоваров[НомерСтроки]) = Неопределено Тогда
			МассивСтрок.Добавить(ТаблицаТоваров[НомерСтроки]);
		КонецЕсли;
	КонецЦикла;
	ВременнаяТЗ = ТаблицаТоваров.Скопировать(МассивСтрок);
	ВременнаяТЗ.Сортировать("Ячейка Возр, Номенклатура Возр");
	Объект.Ассортимент.Загрузить(ВременнаяТЗ);   
	
КонецПроцедуры

Функция ПолучитьТоварыПоСекции(ТЗ)
	
	Секции = ТЗ.Скопировать();
	Секции.Свернуть("Секция");
	КоличествоСекций = Секции.Количество();
	Если КоличествоСекций > 1 Тогда
		ГСЧ = Новый ГенераторСлучайныхЧисел;
		НомерСтроки = ГСЧ.СлучайноеЧисло(0, КоличествоСекций-1);
	Иначе
		НомерСтроки = 0;
	КонецЕсли;
	Секция = Секции[НомерСтроки].Секция;
	Объект.Секция = Секция;
	Отбор = Новый Структура;
    Отбор.Вставить("Секция", Секция);
	КопияТЗ = ТЗ.Скопировать(Отбор);
	Возврат КопияТЗ;   
	
КонецФункции

Процедура ПолучитьАдресКартинки(Номенклатура)
	
	ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ФайлКартинки");
	Если ЗначениеЗаполнено(ФайлКартинки) Тогда
		Попытка
			АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ЭтотОбъект.УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Исключение
		    АдресКартинки = "";
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗавершениеОбучения();
	
	Элементы.ГруппаИзученияКарточки.Видимость = Ложь;
	Элементы.ГруппаКомандЗавершение.Видимость = Истина;
	
	УстановитьСтатус();
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.Завершено") Тогда
		Элементы.Декорация1.Заголовок = "Поздравляем, группа изучена.";
		Элементы.Повторить.Видимость = Ложь;
	Иначе
		Элементы.Декорация1.Заголовок = "Группа не изучена.";
	КонецЕсли;
	ЗаписатьВремя();
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма); 
	ПровестиДокумент();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьСтатус();
	
	ПараметрыОтбора = Новый Структура("Проверено", Ложь);
	ЕстьОшибки = Объект.Ассортимент.НайтиСтроки(ПараметрыОтбора);
	
	Если ЕстьОшибки.Количество() = 0 Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.Завершено");
	Иначе
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.НеИзучено");
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПереходКСледующейКарточке()
	
	ЗаполнитьПройденнуюСтрокуТЧ(ТекущаяСтрока);
	ТекущаяСтрока = ТекущаяСтрока + 1;
	Объект.ПоследняяОткрытаяСтрока = ТекущаяСтрока;

	Если ТекущаяСтрока < Объект.Ассортимент.Количество() Тогда
		ЗаполнитьРеквизитыПоТекущейСтроке(ТекущаяСтрока);
		ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	Иначе
		ПоказатьЗавершениеОбучения();
	КонецЕсли;
	ЭтаФорма.ОбновитьОтображениеДанных();  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПройденнуюСтрокуТЧ(НомерСтроки) 
	
	СтрокаТЧ = Объект.Ассортимент[НомерСтроки];
	СтрокаТЧ.Комментарий = Комментарий;
	СтрокаТЧ.Проверено = Проверено;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоТекущейСтроке(НомерСтроки)
	
	СтрокаТЧ 		= Объект.Ассортимент[НомерСтроки];
	Номенклатура	= СтрокаТЧ.Номенклатура;
	Ячейка 			= СтрокаТЧ.Ячейка;
	Характеристика 	= СтрокаТЧ.Характеристика;
	Проверено 		= СтрокаТЧ.Проверено;
	Комментарий 	= СтрокаТЧ.Комментарий;
	ПолучитьАдресКартинки(Номенклатура); 
	
КонецПроцедуры

#КонецОбласти


#Область РаботаСоСканером

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Сообщить("Точка1");
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		//Сообщить("Точка2");
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") Тогда 
			//Сообщить("Точка3");
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 = Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			//Сообщить("Точка4");
			Данные = ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Штрихкод1);
			Штрихкод = Данные.Штрихкод;
			//Сообщить(Данные.Штрихкод);
			Если ПустаяСтрока(Штрихкод) Тогда
				ПоказатьПредупреждение(, "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!", 5);
				//Сообщить("Точка5");
				Возврат;
			КонецЕсли;
			//Сообщить("Точка6");
			ОбработатьШтрихкод(Штрихкод);
			//Сообщить("Точка7");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер() 
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли  
	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрихкод(Команда)
	
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			ПоказатьПредупреждение(, "Сканирование не поддерживается!", 5);
		КонецЕсли;
	#КонецЕсли  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат И ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
		    СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		Если Не ПустаяСтрока(Штрихкод) Тогда
			ОбработатьШтрихкод(Штрихкод);
		Иначе
			ПоказатьПредупреждение(, "Не удалось прочитать штрихкод! Считайте штрихкод еще раз", 5);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)
	
	РезультатСканирования = ПолучитьДанныеПоШтрикоду(Штрихкод, Номенклатура, Характеристика, Ячейка);
	Если Не РезультатСканирования Тогда
		Сигнал();
		#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Отсканирован неверно!", "ru-RU");
			КонецЕсли;
		#КонецЕсли
		
		Если БылаОшибкаНаКарточке = Неопределено ИЛИ БылаОшибкаНаКарточке = Ложь Тогда
			БылаОшибкаНаКарточке = Истина;
			ПоказатьПредупреждение(, "Вы неверно нашли товар! Внимательно сверьте наименование товара и отсканируйте нужный",,"Товар отсканирован неверно");
			Ошибка = "Первая попытка: Отсканирован неверно";
			Комментарий = ?(Комментарий = "", Ошибка, Комментарий + Символы.ПС + Ошибка);
		Иначе
			БылаОшибкаНаКарточке = Ложь;
			ПоказатьПредупреждение(, "Разберите ошибку с наставником по окончанию сборки",,"Товар отсканирован неверно");
			Ошибка = "Вторая попытка: Отсканирован неверно";
			Комментарий = ?(Комментарий = "", Ошибка, Комментарий + Символы.ПС + Ошибка);
		КонецЕсли;
	Иначе
		БылаОшибкаНаКарточке = Ложь;
		Проверено = Истина;
	КонецЕсли;
	
	Если БылаОшибкаНаКарточке = Неопределено ИЛИ БылаОшибкаНаКарточке = Ложь Тогда
		ПереходКСледующейКарточке();
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоШтрикоду(Штрихкод, Номенклатура, Характеристика, Ячейка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Ответ
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Ячейки
	               |		ПО Штрихкоды.Номенклатура = Ячейки.Номенклатура
	               |ГДЕ
	               |	Штрихкоды.Штрихкод = &Штрихкод
	               |	И Штрихкоды.Номенклатура = &Номенклатура
	               |	И Штрихкоды.Характеристика = &Характеристика
	               |	И Ячейки.Ячейка = &Ячейка";	
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти      


#Область Оповещения 
Функция СекцииСотрудника()
	Возврат Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
КонецФункции


&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
				
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда   
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды, ОткрытьОчередь",Сотрудник,"Отгрузка", Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника()); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника());
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
   	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти

