
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	ДопМодуль.КонтрольОстатков(ЭтотОбъект,Отказ);  

	//РаспределениеТранспортных+
	Если Не Отказ Тогда
		ПерераспределениеТранспортных()
	КонецЕсли	
	//РаспределениеТранспортных-

КонецПроцедуры

&После("ПередУдалением")
Процедура Док_ПередУдалением(Отказ)
	ДопМодульСервер.ПроверитьНаличиеРасходногоОрдераНаТовары(Ссылка, Отказ);
КонецПроцедуры  

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	Если Не Отказ И ПометкаУдаления И Не ОбменДанными.Загрузка Тогда 
		Документы.КорректировкаПриобретения.ОтправитьИнформациюВЧат_ИзменениеПриходныхДокументовВЗакрытомПериоде(
			Организация,
			Дата, 
			"Удален документ " + Ссылка);
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//РаспределениеТранспортных+
	 ТЗРасхожденияДо = ЭтотОбъект.Ссылка.Расхождения.Выгрузить();	
	 ТЗРасхожденияПосле = ЭтотОбъект.Расхождения.Выгрузить();   
	 РезультатСравнения = ОбщегоНазначенияУТ.СравнитьТаблицыЗначений(ТЗРасхожденияДо, ТЗРасхожденияПосле, Истина); 
	 Если РезультатСравнения.Количество() > 0 Тогда  // было распровдение/проведение/изменение ТЧ расхождений
		 ЭтотОбъект.ДополнительныеСвойства.Вставить("РасхожденияИзменились", Истина); 
	 КонецЕсли	 		
	//РаспределениеТранспортных- 
	 
КонецПроцедуры             

 #Область РаспределениеТранспортных      
 Процедура ПерераспределениеТранспортных()
	
  	ДатаЗапускаАвтоматическогоРаспределения = Документы.РейсОтПоставщика.ПолучитьНастройкиОбработкиРаспределения();
	Если ДатаЗапускаАвтоматическогоРаспределения <> Дата(1, 1, 1) И ЭтотОбъект.Дата >= ДатаЗапускаАвтоматическогоРаспределения Тогда
			Отклонение = ПроцентОтклоненияОтПриобретения(ЭтотОбъект.Ссылка, ЭтотОбъект.ДокументОснование);	
			Если ЭтотОбъект.ДополнительныеСвойства.Свойство("РасхожденияИзменились") И ЭтотОбъект.ДополнительныеСвойства.РасхожденияИзменились Тогда
				Если ПроверитьЕстьЛиРаспределение(ЭтотОбъект.ДокументОснование, ДатаЗапускаАвтоматическогоРаспределения) Тогда
						Отклонение = ПроцентОтклоненияОтПриобретения(ЭтотОбъект.Ссылка, ЭтотОбъект.ДокументОснование);
						Если  Отклонение.ПроцентСуммы > 5 ИЛИ Отклонение.ПроцентВеса > 5 ИЛИ Отклонение.ПроцентОбъема > 5 Тогда
							ТекстОшибки = "Отклонение от приобретения " + ЭтотОбъект.ДокументОснование + " >5% и есть распределение транспортных затрат. Проверьте необходимость перераспределения сумм.";  
							ОтправитьСообщениеВЧатБитрикс(ТекстОшибки);
							ТекстОшибки = "Отклонения: Сумма: " + Окр(?(Отклонение.ПроцентСуммы < 0, -Отклонение.ПроцентСуммы, Отклонение.ПроцентСуммы),2)
							+" Вес: " + Окр(?(Отклонение.ПроцентВеса < 0, -Отклонение.ПроцентВеса,Отклонение.ПроцентВеса),2)
							+" Объем: " + Окр(?(Отклонение.ПроцентОбъема < 0, -Отклонение.ПроцентОбъема, Отклонение.ПроцентОбъема),2)+ " %";
							ОтправитьСообщениеВЧатБитрикс(ТекстОшибки);
						КонецЕсли;	
				КонецЕсли
			КонецЕсли	
		КонецЕсли
		
КонецПроцедуры                                                                 

Функция ПроверитьЕстьЛиРаспределение(ДокументПриобретения, ДатаЗапускаАвтоматическогоРаспределения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка.Дата >= &ДатаНачалаРаспределения
		|	И ПриобретениеТоваровУслугТовары.Ссылка.Дата >= &ПоследниеТриМесяца
		|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен
		|	И ПриобретениеТоваровУслугТовары.АналитикаРасходов = &АналитикаРасходов";
	
	Запрос.УстановитьПараметр("АналитикаРасходов", ДокументПриобретения);
	Запрос.УстановитьПараметр("ДатаНачалаРаспределения", ДатаЗапускаАвтоматическогоРаспределения);
	Запрос.УстановитьПараметр("ПоследниеТриМесяца", ТекущаяДата() - (60*60*24*90)); // 3 мес СС
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина
	КонецЦикла;

	Возврат Ложь	
	
КонецФункции

Функция ПроцентОтклоненияОтПриобретения(КоректировкаПриобретения, ДокументОснование)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаПриобретенияТовары.Номенклатура КАК Номенклатура,
		|	СУММА(КорректировкаПриобретенияТовары.Сумма) КАК СуммаКорректировка,
		|	СУММА(КорректировкаПриобретенияТовары.КоличествоУпаковок * &ТекстЗапросаВесНоменклатуры1) КАК ВесКорректировка,
		|	СУММА(КорректировкаПриобретенияТовары.КоличествоУпаковок * &ТекстЗапросаОбъемНоменклатуры1) КАК ОбъемКорректировка,
		|	NULL КАК СуммаПриобретение,
		|	NULL КАК ВесПриобретение,
		|	NULL КАК ОбъемПриобретение
		|ПОМЕСТИТЬ ВесОбъемСумма
		|ИЗ
		|	Документ.КорректировкаПриобретения.Товары КАК КорректировкаПриобретенияТовары
		|ГДЕ
		|	КорректировкаПриобретенияТовары.Ссылка = &СсылкаКорректировка
		|	И КорректировкаПриобретенияТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаПриобретенияТовары.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслугТовары.Номенклатура,
		|	NULL,
		|	NULL,
		|	NULL,
		|	СУММА(ПриобретениеТоваровУслугТовары.Сумма),
		|	СУММА(ПриобретениеТоваровУслугТовары.КоличествоУпаковок * &ТекстЗапросаВесНоменклатуры2),
		|	СУММА(ПриобретениеТоваровУслугТовары.КоличествоУпаковок * &ТекстЗапросаОбъемНоменклатуры2)
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка = &СсылкаПриобретение
		|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровУслугТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ВесОбъемСумма.СуммаКорректировка, 0)) КАК СуммаКорректировка,
		|	СУММА(ЕСТЬNULL(ВесОбъемСумма.СуммаПриобретение, 0)) КАК СуммаПриобретение,
		|	СУММА(ЕСТЬNULL(ВесОбъемСумма.ВесКорректировка, 0)) КАК ВесКорректировка,
		|	СУММА(ЕСТЬNULL(ВесОбъемСумма.ОбъемКорректировка, 0)) КАК ОбъемКорректировка,
		|	СУММА(ЕСТЬNULL(ВесОбъемСумма.ВесПриобретение, 0)) КАК ВесПриобретение,
		|	СУММА(ЕСТЬNULL(ВесОбъемСумма.ОбъемПриобретение, 0)) КАК ОбъемПриобретение
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ВесОбъемСумма КАК ВесОбъемСумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	100 - ВЫБОР
		|		КОГДА ИтоговаяТаблица.СуммаКорректировка = 0
		|				ИЛИ ИтоговаяТаблица.СуммаПриобретение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ИтоговаяТаблица.СуммаКорректировка / ИтоговаяТаблица.СуммаПриобретение * 100
		|	КОНЕЦ КАК ПроцентСуммы,
		|	100 - ВЫБОР
		|		КОГДА ИтоговаяТаблица.ВесКорректировка = 0
		|				ИЛИ ИтоговаяТаблица.ВесПриобретение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ИтоговаяТаблица.ВесКорректировка / ИтоговаяТаблица.ВесПриобретение * 100
		|	КОНЕЦ КАК ПроцентВеса,
		|	100 - ВЫБОР
		|		КОГДА ИтоговаяТаблица.ОбъемКорректировка = 0
		|				ИЛИ ИтоговаяТаблица.ОбъемПриобретение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ИтоговаяТаблица.ОбъемКорректировка / ИтоговаяТаблица.ОбъемПриобретение * 100
		|	КОНЕЦ КАК ПроцентОбъема
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица";
	
	
	Запрос.УстановитьПараметр("СсылкаПриобретение", ДокументОснование);
	Запрос.УстановитьПараметр("СсылкаКорректировка", КоректировкаПриобретения);    
	
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"КорректировкаПриобретенияТовары.Номенклатура.ЕдиницаИзмерения",
	"КорректировкаПриобретенияТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаОбъемНоменклатуры1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
	"КорректировкаПриобретенияТовары.Номенклатура.ЕдиницаИзмерения",
	"КорректировкаПриобретенияТовары.Номенклатура"));
	
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения",
	"ПриобретениеТоваровУслугТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаОбъемНоменклатуры2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
	"ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения",
	"ПриобретениеТоваровУслугТовары.Номенклатура"));

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	ПроцентРасхождений = Новый Структура();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	   ПроцентРасхождений.Вставить("ПроцентСуммы", ?(ВыборкаДетальныеЗаписи.ПроцентСуммы < 0, -ВыборкаДетальныеЗаписи.ПроцентСуммы, ВыборкаДетальныеЗаписи.ПроцентСуммы));
	   ПроцентРасхождений.Вставить("ПроцентВеса", ?(ВыборкаДетальныеЗаписи.ПроцентВеса < 0, -ВыборкаДетальныеЗаписи.ПроцентВеса, ВыборкаДетальныеЗаписи.ПроцентВеса));
	   ПроцентРасхождений.Вставить("ПроцентОбъема", ?(ВыборкаДетальныеЗаписи.ПроцентОбъема < 0, -ВыборкаДетальныеЗаписи.ПроцентОбъема, ВыборкаДетальныеЗаписи.ПроцентОбъема));
	КонецЦикла;
	
	Возврат ПроцентРасхождений;
	
КонецФункции	

Процедура ОтправитьСообщениеВЧатБитрикс(ТекстСообщения)
	IDЧата = "Chat107769";
	Результат = АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитриксПоИДЧата(ТекстСообщения, IDЧата);
	Если Результат <> Неопределено Тогда 
		Если Результат.Свойство("ОписаниеОшибки") Тогда
				ЗаписьЖурналаРегистрации("Информирование в Битрикс об ошибках автораспределения транспортных", УровеньЖурналаРегистрации.Ошибка,,, Результат.ОписаниеОшибки);
			Иначе
				ЗаписьЖурналаРегистрации("Информирование в Битрикс об ошибках автораспределения транспортных", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			КонецЕсли;	
		Иначе
		ЗаписьЖурналаРегистрации("Не получилось отправить данные об ошибках автораспределения транспортных в Битрикс!", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#КонецЕсли


