
&НаСервере
Процедура Обр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ПередаватьОбновитьНаСайте = Ложь;
	Элементы.Добавочный.Видимость= Ложь;
	Если Параметры.Свойство("ОбновитьТелефонНаСайте") Тогда
	    Элементы.ОбновитьНаСайте.Видимость = Истина;
	    ПередаватьОбновитьНаСайте = Истина;
	    ОбновитьНаСайте = Параметры.ОбновитьТелефонНаСайте; 
	    Элементы.НомерТелефона.Маска = ("9999999999");
	Иначе 
		Элементы.ОбновитьНаСайте.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Обр_КомандаОКПеред(Команда)
	ПривестиКФорматуНомерТелефона();
КонецПроцедуры

&НаКлиенте
Процедура Обр_НомерТелефонаПриИзмененииПеред(Элемент)
	ПривестиКФорматуНомерТелефона();
КонецПроцедуры

&НаКлиенте
Процедура ПривестиКФорматуНомерТелефона()
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона, , Представление, КодСтраны, КодГорода);
	Модифицированность = Истина;
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ПодтвердитьИЗакрыть")
Процедура Док_ПодтвердитьИЗакрыть(Результат, ДополнительныеПараметры)

	// При немодифицированности работает "отмена".

	Если Модифицированность Тогда
   
		ЕстьОшибкиЗаполнения = Ложь;
		// Смотрим, надо ли проверять на корректность.
		Если ПроверятьКорректность Тогда

			МодульРаботаСАдресамиКлиент = Неопределено;
			Если ИспользоватьДополнительныеПроверки Тогда
				МодульРаботаСАдресамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСАдресамиКлиент");
			КонецЕсли;

			ПоляТелефона = УправлениеКонтактнойИнформациейКлиентСервер.СтруктураПолейТелефона();
			ПоляТелефона.КодГорода     = КодГорода;
			ПоляТелефона.КодСтраны     = КодСтраны;    
			ПоляТелефона.НомерТелефона = НомерТелефона;
			ПоляТелефона.Представление = Представление;
			ПоляТелефона.Добавочный    = Добавочный;
			ПоляТелефона.Комментарий   = Комментарий;  
			Если ВводитьНомерПоМаске Тогда
				ПоляТелефона.НомерТелефона = НомерТелефонаПоМаске;
			КонецЕсли;	

			СписокОшибок = УправлениеКонтактнойИнформациейКлиентСервер.ОшибкиЗаполненияТелефона(ПоляТелефона, МодульРаботаСАдресамиКлиент);

			ЕстьОшибкиЗаполнения = СписокОшибок.Количество() > 0;
		КонецЕсли;
		Если ЕстьОшибкиЗаполнения Тогда
			СообщитьОбОшибкахЗаполнения(СписокОшибок);
			Возврат;
		КонецЕсли;

		Результат = РезультатВыбора();
     #Вставка 
     Если ПередаватьОбновитьНаСайте Тогда
		Результат.Вставить("ОбновитьТелефонНаСайте",ОбновитьНаСайте);
	 КонецЕсли;
     #КонецВставки 
		СброситьМодифицированностьПриВыборе();
		ОповеститьОВыборе(Результат);

	ИначеЕсли Комментарий <> КопияКомментария Тогда
		// Изменен только комментарий, пробуем вернуть обновленное.
		Результат = РезультатВыбораТолькоКомментария();

		СброситьМодифицированностьПриВыборе();
		ОповеститьОВыборе(Результат);

	Иначе
		Результат = Неопределено;
	КонецЕсли;  
	  
	 
	Если (МодальныйРежим Или ЗакрыватьПриВыборе) И Открыта() Тогда
		СброситьМодифицированностьПриВыборе();
		Закрыть(Результат);
	КонецЕсли;

КонецПроцедуры


