
&ИзменениеИКонтроль("ПолучитьИнформациюОТовареПриПродаже")
Процедура Док_ПолучитьИнформациюОТовареПриПродаже(Форма) Экспорт

	Если Не Форма.ОтображатьОстатки Тогда
		Возврат;
	КонецЕсли;

	ОстаткиПоСкладам = Форма.ОстаткиТоваров.ПолучитьЭлементы();
	ОстаткиПоСкладам.Очистить();
	
	Если Форма.РежимПодбораБезСуммовыхПараметров И Не Форма.ОтображатьОстатки Тогда
		Возврат;
	КонецЕсли;
	
	ХарактеристикиИспользуются = Форма.ТекущаяСтрокаНоменклатуры.ХарактеристикиИспользуются;
	ЭтоТовар = Форма.ТекущаяСтрокаНоменклатуры.ЭтоТовар;
	
	Если Не ЭтоТовар 
			ИЛИ (Форма.НавигацияПоХарактеристикам И 
			Не ЗначениеЗаполнено(Форма.ТекущаяСтрокаХарактеристик.Характеристика))Тогда
		Возврат;
	КонецЕсли;

	Валюта = Форма.Валюта;
	Соглашение = Форма.Соглашение;

	#Вставка
	если не ДопМодуль.НовоеЦенообразование() тогда
    #КонецВставки
	Если Форма.НавигацияПоХарактеристикам Тогда
		
		Если Не ЗначениеЗаполнено(Форма.ТекущаяСтрокаХарактеристик.Характеристика) Тогда
			Возврат;
		КонецЕсли;
		
		ИнформацияОТоваре = ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Форма.ТекущаяСтрокаХарактеристик.Характеристика, Соглашение, Валюта, Форма.Склады, Форма.ВидыЦен);
		
	Иначе
    #Удаление
		ИнформацияОТоваре = ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Неопределено, Соглашение, Валюта, Форма.Склады, Форма.ВидыЦен);

	КонецЕсли;
	#КонецУдаления
	#Вставка
			ИнформацияОТоваре = ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Неопределено, Соглашение, Валюта,
			// + Альтерра
			// Форма.Склады, 
			ДопМодуль.СкладыСДвижениями(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура),
			Форма.ВидыЦен);
		КонецЕсли;
	иначе
		Если Форма.НавигацияПоХарактеристикам Тогда
			Если Не ЗначениеЗаполнено(Форма.ТекущаяСтрокаХарактеристик.Характеристика) Тогда
				Возврат;
			КонецЕсли;
			ИнформацияОТоваре = ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара_НЦ(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Форма.ТекущаяСтрокаХарактеристик.Характеристика, Соглашение, Валюта, Форма.Склады, Форма.ВидыЦен,Форма.Подразделение);
	Иначе
			ИнформацияОТоваре = ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара_НЦ(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Неопределено, Соглашение, Валюта,
			// +Альтерра
			// Форма.Склады, 
			ДопМодуль.СкладыСДвижениями(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура),
			Форма.ВидыЦен,
			Форма.Подразделение);
		КонецЕсли;
	конецесли;
	#КонецВставки
    ЦенаПродажиТовара = ИнформацияОТоваре.Цена;
	
	НаименованиеУпаковкиЕдиницыИзмерения = ?(ЗначениеЗаполнено(ЦенаПродажиТовара.Упаковка), 
		Строка(ЦенаПродажиТовара.Упаковка), 
		Строка(ЦенаПродажиТовара.ЕдиницаИзмерения));
	
	Для Каждого СтрокаТбл Из ИнформацияОТоваре.ТекущиеОстатки Цикл
		
		СтрокаОстаткиПоСкладам = ОстаткиПоСкладам.Добавить();
		
		СтрокаОстаткиПоСкладам.Период = Форма.ТекущаяДатаСеанса;
		СтрокаОстаткиПоСкладам.ПериодОписание = НСтр("ru = 'Сейчас'");
		СтрокаОстаткиПоСкладам.Доступно = СтрокаТбл.Свободно;
		СтрокаОстаткиПоСкладам.Запас = СтрокаТбл.Запас;
		
		СтрокаОстаткиПоСкладам.ЗапасОписание = ОписаниеКоличестваВСтрокеОстатка(
			СтрокаОстаткиПоСкладам.Запас,
			НаименованиеУпаковкиЕдиницыИзмерения,
			ХарактеристикиИспользуются,
			Форма.НавигацияПоХарактеристикам);
		
		СтрокаОстаткиПоСкладам.ДоступноОписание = ОписаниеКоличестваВСтрокеОстатка(
			СтрокаОстаткиПоСкладам.Доступно,
			НаименованиеУпаковкиЕдиницыИзмерения,
			ХарактеристикиИспользуются,
			Форма.НавигацияПоХарактеристикам);
		
		#Вставка
		//СтрокаОстаткиПоСкладам.ВНаличии = СтрокаТбл.ВНаличии;  
		//СтрокаОстаткиПоСкладам.ВНаличииОписание = ОписаниеКоличестваВСтрокеОстатка(
		//	СтрокаОстаткиПоСкладам.ВНаличии,
		//	НаименованиеУпаковкиЕдиницыИзмерения,
		//	ХарактеристикиИспользуются,
		//	Форма.НавигацияПоХарактеристикам);
		СтрокаОстаткиПоСкладам.Запас = СтрокаТбл.Запас;  
			СтрокаОстаткиПоСкладам.ЗапасОписание = ОписаниеКоличестваВСтрокеОстатка(
			СтрокаОстаткиПоСкладам.Запас,
			НаименованиеУпаковкиЕдиницыИзмерения,
			ХарактеристикиИспользуются,
			Форма.НавигацияПоХарактеристикам);
		#КонецВставки

		СтрокаОстаткиПоСкладам.Склад = СтрокаТбл.Склад;
		СтрокаОстаткиПоСкладам.СкладОписание = Строка(СтрокаТбл.Склад);
		СтрокаОстаткиПоСкладам.СкладДоступенДляВыбора = СкладДоступенДляВыбора(Форма, СтрокаОстаткиПоСкладам.Склад);

		ПланируемыеОстаткиПоДатам = СтрокаОстаткиПоСкладам.ПолучитьЭлементы();
			
		ЕстьПланируемыеОстатки = Ложь;
		Для Каждого СтрокаТбл Из ИнформацияОТоваре.ПланируемыеОстатки Цикл
			
			Если Не (СтрокаТбл.Склад = СтрокаОстаткиПоСкладам.Склад) Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьПланируемыеОстатки = Истина;
			
			СтрокаПланируемыеОстаткиПоДатам = ПланируемыеОстаткиПоДатам.Добавить();
			
			СтрокаПланируемыеОстаткиПоДатам.Период = СтрокаТбл.Период;
			СтрокаПланируемыеОстаткиПоДатам.ПериодОписание = Формат(СтрокаТбл.Период, "ДЛФ=D");
			СтрокаПланируемыеОстаткиПоДатам.Доступно = СтрокаТбл.Доступно;
			СтрокаПланируемыеОстаткиПоДатам.Запас = СтрокаТбл.Запас;
			
			СтрокаПланируемыеОстаткиПоДатам.ЗапасОписание = ОписаниеКоличестваВСтрокеОстатка(
				СтрокаПланируемыеОстаткиПоДатам.Запас,
				НаименованиеУпаковкиЕдиницыИзмерения,
				ХарактеристикиИспользуются,
				Форма.НавигацияПоХарактеристикам);
			
			СтрокаПланируемыеОстаткиПоДатам.ДоступноОписание = ОписаниеКоличестваВСтрокеОстатка(
				СтрокаПланируемыеОстаткиПоДатам.Доступно,
				НаименованиеУпаковкиЕдиницыИзмерения,
				ХарактеристикиИспользуются,
				Форма.НавигацияПоХарактеристикам);

			СтрокаПланируемыеОстаткиПоДатам.Склад = СтрокаТбл.Склад;
			СтрокаПланируемыеОстаткиПоДатам.СкладОписание = "";
			СтрокаПланируемыеОстаткиПоДатам.СкладДоступенДляВыбора = СкладДоступенДляВыбора(Форма, СтрокаПланируемыеОстаткиПоДатам.Склад);
			
		КонецЦикла;
		
		#Вставка
		СкладПродажи= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОстаткиПоСкладам.Склад, "СкладПродажи");		
		Если СтрокаОстаткиПоСкладам.Доступно <= 0 И Не ЕстьПланируемыеОстатки ИЛИ Не СкладПродажи Тогда
		#КонецВставки
		#Удаление
		Если СтрокаОстаткиПоСкладам.Запас = 0 И Не ЕстьПланируемыеОстатки Тогда
		#КонецУдаления
			ОстаткиПоСкладам.Удалить(СтрокаОстаткиПоСкладам);	
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

