////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции, управляющие настройками системы (локализация)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытий_ПанельСправочниковНСИ_КлассификаторыНоменклатуры

Процедура ОбработкаНавигационнойСсылкиФормы__КлассификаторыНоменклатуры(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОКВЭД" Тогда
		ОткрытьФорму("Справочник.КлассификаторВидовЭкономическойДеятельности.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьВидыАлкогольнойПродукции" Тогда
		ОткрытьФорму("Справочник.ВидыАлкогольнойПродукции.ФормаСписка", , Форма);
	КонецЕсли;
	// ИнтеграцияГИСМ
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьВидыМехаГИСМ" Тогда
		ОткрытьФорму("Справочник.ВидыМехаГИСМ.ФормаСписка",,Форма);
	КонецЕсли;
	// Конец ИнтеграцияГИСМ
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОбщероссийскийКлассификаторПродукции" Тогда
		ОткрытьФорму("Справочник.ОбщероссийскийКлассификаторПродукции.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьКлассификаторОКПД2" Тогда
		ОткрытьФорму("Справочник.КлассификаторОКПД2.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьКлассификаторОКВЭД2" Тогда
		ОткрытьФорму("Справочник.КлассификаторОКВЭД2.ФормаСписка", , Форма);
	КонецЕсли;
	//-- Локализация
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Закупки

Процедура ОбработкаНавигационнойСсылкиФормы_Закупки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_Закупки(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Казначейство

Процедура ОбработкаНавигационнойСсылкиФормы_Казначейство(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация

	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастроитьИнтеграциюСмартвей" Тогда
		ОповещениеОЗакрытии = Новый ОписаниеОповещения(
			"ОповещениеОЗакрытииНастроитьИнтеграциюСмартвей", ЭтотОбъект, Новый Структура("Форма", Форма));
		ОткрытьФорму("Обработка.ПанельАдминистрированияУТ.Форма.НастроитьИнтеграциюСмартвей",, Форма,,,, ОповещениеОЗакрытии);
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

//++ Локализация
Процедура ОповещениеОЗакрытииФЗ275(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма; // ФормаКлиентскогоПриложения 
	Элемент = Форма.Элементы.ДекорацияНастроитьПоддержкаБанковскогоИКазначейскогоСопровожденияГосконтрактов; // ПолеФормы
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДополнительныеПараметры, "ПоддержкаБанковскогоИКазначейскогоСопровожденияГосконтрактов") Тогда
	
		Если ДополнительныеПараметры.ПоддержкаБанковскогоИКазначейскогоСопровожденияГосконтрактов Тогда
			СтрокаЗаголовка = НСтр("ru = 'Поддержка банковского и казначейского сопровождения госконтрактов (используется)'");
		Иначе
			СтрокаЗаголовка = НСтр("ru = 'Поддержка банковского и казначейского сопровождения госконтрактов (не используется)'");
		КонецЕсли;
		Элемент.Заголовок = Новый ФорматированнаяСтрока(СтрокаЗаголовка,,,, "НастроитьПоддержка275ФЗ");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеОЗакрытииНастроитьИнтеграциюСмартвей(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма; // ФормаКлиентскогоПриложения 
	Элемент = Форма.Элементы.ИнтеграцияСмартвей; // ПолеФормы
	
	Если ДополнительныеПараметры.ИспользоватьИнтеграциюСоСмартвей Тогда
		СтрокаЗаголовка = НСтр("ru = 'Интеграция с сервисом бронирования Smartway (используется)'");
	Иначе
		СтрокаЗаголовка = НСтр("ru = 'Интеграция с сервисом бронирования Smartway (не используется)'");
	КонецЕсли;
	Элемент.Заголовок = Новый ФорматированнаяСтрока(СтрокаЗаголовка,,,, "НастроитьИнтеграциюСмартвей");
	
	Элемент.Доступность = Форма.НаборКонстант.НоваяАрхитектураВзаиморасчетов
			ИЛИ ДополнительныеПараметры.ИспользоватьИнтеграциюСоСмартвей;
	Форма.Элементы.ГруппаКомментарийИспользованияСмартвей.Видимость = Не Элемент.Доступность;
	
КонецПроцедуры
//-- Локализация

// Обработчик изменения реквизита формы
// 
// Параметры:
//     Элемент - ПолеФормы - Изменившийся реквизит
//     Форма - ФормаКлиентскогоПриложения - Форма настроек "Казначейства"
//
Процедура ПриИзмененииРеквизита_Казначейство(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

//++ Локализация
Процедура НачалоВыбораЭлементовФормы_Казначейство(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма) Экспорт
	
	Элементы = Форма.Элементы;

	
КонецПроцедуры
	

//-- Локализация
#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_НастройкиНоменклатуры

Процедура ОбработкаНавигационнойСсылкиФормы_НастройкиНоменклатуры(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ОткрытьНастройкиСертификатовНоменклатуры(ФормаВладелец) Экспорт 
	
	//++ Локализация 
	ОткрытьФорму("Обработка.ПанельАдминистрированияУТ.Форма.НастройкиСертификатовНоменклатуры",,ФормаВладелец,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//-- Локализация	

КонецПроцедуры

Процедура ПриИзмененииРеквизита_НастройкиНоменклатуры(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

// Дополняется коллекцию параметров изменения расписания регламентного задания.
//
// Параметры:
//	Форма - см. Обработка.ПанельАдминистрированияУТ.Форма.НастройкиНоменклатуры.
//	ИмяКоманды - Строка - имя команды, инициализировавшей изменение расписания регламентного задания.
//	ПараметрыЗадания - Структура - коллекция параметров изменения расписания регламентного задания.
//
Процедура ДополнитьПараметрыИзмененияРасписанияРегламентногоЗадания_НастройкиНоменклатуры(Форма, ИмяКоманды, ПараметрыЗадания) Экспорт
	
	//++ Локализация
	Если ИмяКоманды = Форма.Команды.ОткрытьНастройкуРасписанияОбновленияСтатусовСертификатовНоменклатурыРосаккредитации.Имя Тогда
		ИмяРеквизитаИдентификатор	= "ОбновлениеСтатусовСертификатовНоменклатурыРосаккредитацииИдентификатор";
		ИмяРеквизитаРасписание		= "ОбновлениеСтатусовСертификатовНоменклатурыРосаккредитацииРасписание";
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания.Вставить("Идентификатор", Форма[ИмяРеквизитаИдентификатор]);
	ПараметрыЗадания.Вставить("ИмяРеквизитаРасписание", ИмяРеквизитаРасписание);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_НачальноеЗаполнение

Процедура ОбработкаНавигационнойСсылкиФормы_НачальноеЗаполнение(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	
	

	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_НачальноеЗаполнение(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Продажи

Процедура ОбработкаНавигационнойСсылкиФормы_Продажи(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьПараметрыПодключенияЕГАИС" Тогда
		ОткрытьФорму("РегистрСведений.НастройкиОбменаЕГАИС.ФормаСписка", , ЭтотОбъект);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьМобильныеПриложения" Тогда
		ОткрытьФорму("Справочник.ВерсииМобильныхПриложений.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьМобильныеКомпьютеры" Тогда
		ОткрытьФорму("Справочник.МобильныеКомпьютеры.ФормаСписка", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройкиКомпонентыОбменаДаннымиСКПК" Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкиКомпонентыОбменаДаннымиСКПК", , Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройкиТорговыхПредставителей" Тогда
		ОткрытьФорму("ПланОбмена.МобильноеПриложениеТорговыйПредставитель.ФормаСписка",
			Новый Структура("НеОтображатьЭтотУзел", Истина),
			Форма);
	КонецЕсли;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройкиФЗ54" Тогда
		ОткрытьФорму("Обработка.ПанельАдминистрированияУТ.Форма.ФЗ54", , Форма);
	КонецЕсли;
	//-- Локализация
	Возврат;
КонецПроцедуры

// Обработчик при изменении реквизита
//
// Параметры:
//  Элемент - ВсеЭлементыФормы
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ПриИзмененииРеквизита_Продажи(Элемент, Форма) Экспорт
	//++ Локализация
	
	Если Элемент.Имя = "АдресСервисаНСПК"
		Или Элемент.Имя = "КлючДоступаНСПК"
		Или Элемент.Имя = "ПроксиСерверНСПК"
		Или Элемент.Имя = "ПроксиПортНСПК"
		Или Элемент.Имя = "ПроксиПользовательНСПК"
		Или Элемент.Имя = "ПроксиПарольНСПК" Тогда
		РозничныеПродажиКлиентЛокализация.ПанельАдминистрированияУТПродажиПараметрыПодключенияНСПКПриИзменении(Форма);
	КонецЕсли;
	
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_Предприятие

Процедура ОбработкаНавигационнойСсылкиФормы_Предприятие(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	//++ Локализация
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_Предприятие(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура ИмяФормыПодбораВалютыИзКлассификатора_Предприятие(ФормаОбработки) Экспорт
	
	//++ Локализация
	ФормаОбработки = "Обработка.ЗагрузкаКурсовВалют.Форма.ПодборВалютИзКлассификатора";
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_ФинансовыйРезультат

Процедура ОбработкаНавигационнойСсылкиФормы_ФинансовыйРезультат(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ДопНастройкиУчетаСебестоимости" Тогда
		ОткрытьФорму("Обработка.ПанельАдминистрированияУТ.Форма.ДопНастройкиУчетаСебестоимости", , Форма);
	КонецЕсли;
	//-- Локализация
	Возврат;
КонецПроцедуры

Процедура ПриИзмененииРеквизита_ФинансовыйРезультат(Элемент, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_СкладИДоставка

Процедура ПриИзмененииРеквизита_СкладИДоставка(Элемент, Форма) Экспорт
	//++ Локализация
	// ЭлектронноеВзаимодействие.СервисДоставки
	Если Элемент.Имя = "ИспользоватьУправлениеДоставкой" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, "Константа_ИспользоватьСервис1СДоставка");
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.СервисДоставки
	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_ПанельАдминистрированияУТ_НастройкиРМКИОборудования

// Общий метод для обработки команд формы см. Обработка.ПанельАдминистрированияУТ.Форма.НастройкиРМКИОборудования
// 
// Параметры:
//  Команда - КомандаФормы - 
//  Форма - ФормаКлиентскогоПриложения -
//
Процедура ОбработкаКоманды_НастройкиРМКИОборудования(Команда, Форма) Экспорт
	
	//++ Локализация
	Если Команда = Форма.Команды.ОткрытьОфлайнОборудование Тогда
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
		
		ОткрытьФорму("Справочник.ОфлайнОборудование.ФормаСписка", , Форма);
	КонецЕсли;
	//-- Локализация
	
	Возврат;
КонецПроцедуры

#КонецОбласти


#КонецОбласти