
&ИзменениеИКонтроль("ПриИзмененииЭлемента")
Процедура Док_ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	Если Элемент = "Подключаемый_ОбработатьВводШтрихкода" Тогда 
		
		ДополнительныеПараметры.РезультатОбработкиШтрихкода = ШтрихкодированиеОбщегоНазначенияИС.ОбработатьВводШтрихкода(
			Форма, 
			ДополнительныеПараметры.ДанныеШтрихкода,
			ДополнительныеПараметры.КэшированныеЗначения,
			ДополнительныеПараметры.ПараметрыСканирования);
		
	ИначеЕсли Элемент = "Подключаемый_ВыполнитьДействие" Тогда 
		
		ПараметрыОбработкиВыбора    = ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьПараметрыОбработкиВыбора(
			ДополнительныеПараметры.РезультатВыбора,
			ДополнительныеПараметры.РезультатОбработкиШтрихкода,
			ДополнительныеПараметры.КэшированныеЗначения);
		
		ДополнительныеПараметры.РезультатОбработкиШтрихкода = ШтрихкодированиеИС.ВыполнитьДействие(
			Форма,
			ДополнительныеПараметры.Действие,
			ПараметрыОбработкиВыбора);
		
	ИначеЕсли Элемент = "ОбработатьДанныеШтрихкода" Тогда
		
		ДанныеШтрихкода       = ДополнительныеПараметры.ДанныеШтрихкода;
		КэшированныеЗначения  = ДополнительныеПараметры.КэшированныеЗначения;
		ПараметрыСканирования = ДополнительныеПараметры.ПараметрыСканирования;
		
		РезультатОбработкиШтрихкода = ШтрихкодированиеОбщегоНазначенияИС.ОбработатьВводШтрихкода(
			Форма, ДанныеШтрихкода, КэшированныеЗначения, ПараметрыСканирования);
		ДополнительныеПараметры.Вставить("РезультатОбработкиШтрихкода", РезультатОбработкиШтрихкода);
		
	ИначеЕсли Элемент = "ОбработкаКодаМаркировкиВыполнитьДействиеСервер" Тогда
		
		РезультатВыбора             = ДополнительныеПараметры.РезультатВыбора;
		РезультатОбработкиШтрихкода = ДополнительныеПараметры.РезультатОбработкиШтрихкода;
		КэшированныеЗначения        = ДополнительныеПараметры.КэшированныеЗначения;
		Действие                    = ДополнительныеПараметры.Действие;
		
		ПараметрыОбработкиВыбора    = ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьПараметрыОбработкиВыбора(РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения);
		РезультатОбработкиШтрихкода = ШтрихкодированиеИС.ВыполнитьДействие(Форма, Действие, ПараметрыОбработкиВыбора);
		ДополнительныеПараметры.РезультатОбработкиШтрихкода = РезультатОбработкиШтрихкода;
		
	ИначеЕсли Элемент = "ОбработкаКодаМаркировкиВыполнитьДействиеЗавершениеСервер" Тогда
		
		ДополнительныеПараметры.РезультатОбработкиШтрихкода.ДобавленныеСтроки = Новый Массив;
		ДополнительныеПараметры.РезультатОбработкиШтрихкода.ИзмененныеСтроки = Новый Массив;
		
	КонецЕсли;
	
	#Вставка   
	
	ПроизводимДействияИС = Истина;
	
	Если НЕ ДополнительныеПараметры = Неопределено И Не ТипЗнч(ДополнительныеПараметры) = Тип("Массив") Тогда
		
		Если ДополнительныеПараметры.Свойство("ЕстьМаркируемыеТовары")Тогда  
			
			Если Не ДополнительныеПараметры.ЕстьМаркируемыеТовары Тогда
				ПроизводимДействияИС = Ложь;	
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ПроизводимДействияИС Тогда
		
	#КонецВставки 
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		СобытияФормИСПереопределяемый.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС") <> Неопределено Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("СобытияФормЕГАИС");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС") <> Неопределено Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("СобытияФормВЕТИС");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ") <> Неопределено Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("СобытияФормГИСМ");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП") <> Неопределено Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("СобытияФормИСМП");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЗЕРНО") <> Неопределено Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("СобытияФормЗЕРНО");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("САТУРН") <> Неопределено Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("СобытияФормСАТУРН");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	#Вставка 
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры
