
#Область ПрограммныйИнтерфейс

Процедура ПослеНачалаРаботыСистемы(ПараметрыРаботыКлиента) Экспорт
	
	Если НЕ ПараметрыРаботыКлиента.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыРаботыКлиента.ИспользуетсяТелефония Тогда
		Возврат;
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.11.0") < 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		
		Если ПараметрыРаботыКлиента.Свойство("ПредложитьИспользованиеСистемыВзаимодействия") Тогда
			ПодключитьОбработчикОжидания("ПредложитьИспользованиеСистемыВзаимодействия", 180, Истина);
		ИначеЕсли ПараметрыРаботыКлиента.Свойство("ПредложитьРегистрациюСистемыВзаимодействия") Тогда
			ПодключитьОбработчикОжидания("ПредложитьРегистрациюСистемыВзаимодействия", 180, Истина);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыРаботыКлиента.Свойство("СлужебныйЖурналЗвонков") ИЛИ ПараметрыРаботыКлиента.СлужебныйЖурналЗвонков = Неопределено Тогда
		ПодключитьОбработчикОжидания("СоздатьСлужебныйЖурналЗвонковСистемыВзаимодействия", 60, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ПодключитьОбработчикНовыхСообщенийСистемыВзаимодействия", 10, Истина);
	КонецЕсли;
	
	Если ПараметрыРаботыКлиента.Свойство("ОбновитьЖурналЗвонков") Тогда
		ТелефонияВызовСервера.ОбновитьЖурналЗвонков();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредложитьРегистрацияИнформационнойБазыСистемыВзаимодействия(ЕстьПравоРегистрации) Экспорт
	
	Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьПравоРегистрации Тогда
		ДействиеПриНажатии = "e1cib/command/Обработка.РегистрацияВСистемеВзаимодействияУНФ.Команда.РегистрацияВзаимодействий";
	Иначе
		ДействиеПриНажатии = Новый ОписаниеОповещения("ПредложитьРегистрацияИнформационнойБазыСистемыВзаимодействияНетПрав", ТелефонияКлиент);
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(
		НСтр("ru='Автоматическая обработка звонков с системой взаимодействия'"),
		ДействиеПриНажатии,
		НСтр("ru='Без дополнительных нажатий программа покажет уведомления о входящих звонках и автоматически откроет карточку клиента!'"),
		БиблиотекаКартинок.БизнесПроцесс,
		СтатусОповещенияПользователя.Важное
	);
	
КонецПроцедуры

Процедура ПредложитьРегистрацияИнформационнойБазыСистемыВзаимодействияНетПрав(ДополнительныеПараметры) Экспорт
	
	ПоказатьПредупреждение(, НСтр("ru='Нет прав для регистрации информационной базы в системе взаимодействия.
		|Обратитесь к администратору.
		|
		|Для регистрации: Еще больше возможностей — CRM — Автоматическая обработка звонков'"));
	
КонецПроцедуры

Процедура ОбработчикНажатияОповещенияОВходящемЗвонке(ДополнительныеПараметры) Экспорт
	
	ОткрытьФорму("Обработка.РабочееМестоОператораCallЦентра.Форма.Форма",Новый Структура("ДанныеЗвонка",ДополнительныеПараметры),,Новый УникальныйИдентификатор());
	
КонецПроцедуры

Функция ПоддерживаютсяВызовы() Экспорт
	
#Если МобильныйКлиент Тогда
	Возврат СредстваТелефонии.ПоддерживаетсяНаборНомера();
#Иначе
	Возврат УправлениеНебольшойФирмойПовтИсп.ИспользуетсяТелефония();
#КонецЕсли
	
КонецФункции

Процедура ПозвонитьПоНомеру(НомерТелефона, Контакт = Неопределено, КонтактРодитель = Неопределено, Событие = Неопределено) Экспорт
	
	Перем Ошибка;
	Перем СтрокаПояснения;
		
	ТелефонияВызовСервера.ПозвонитьПоНомеру(НомерТелефона, Событие, Ошибка, СтрокаПояснения);
		
КонецПроцедуры

Процедура ПрослушатьЗаписьРазговора(ИдентификаторЗвонкаВАТС) Экспорт
	
	Ошибка = Неопределено;
	Результат = ТелефонияВызовСервера.СсылкаНаЗаписьРазговора(ИдентификаторЗвонкаВАТС, Ошибка);
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Запись данного разговора отсутствует.'"));
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохраненияФайла.Диалог.Расширение = Результат.Расширение;
		ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, Результат.СсылкаНаДвоичныеДанныеФайла, Результат.ИмяФайла, ПараметрыСохраненияФайла);
	Иначе
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

