#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВременнаяТаблицаТоварыПоддерживаемогоЗапаса() Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпособыМетодыОбеспечения.Номенклатура КАК Номенклатура,
		|	СпособыМетодыОбеспечения.Характеристика КАК Характеристика,
		|	СпособыМетодыОбеспечения.Склад КАК Склад,
		|	СпособыМетодыОбеспечения.МинимальноеКоличествоЗапаса КАК МинимальноеКоличествоЗапаса,
		|	СпособыМетодыОбеспечения.МаксимальноеКоличествоЗапаса КАК МаксимальноеКоличествоЗапаса,
		|	СпособыМетодыОбеспечения.МетодОбеспеченияПотребностей КАК МетодОбеспеченияПотребностей,
		|	СпособыМетодыОбеспечения.УпаковкаЗаказа КАК УпаковкаЗаказа
		|ПОМЕСТИТЬ ВтТоварыПоддерживаемогоЗапаса
		|ИЗ
		|	РегистрСведений.СпособыМетодыОбеспечения КАК СпособыМетодыОбеспечения
		|ГДЕ
		|	СпособыМетодыОбеспечения.МетодОбеспеченияПотребностей <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
		|	И СпособыМетодыОбеспечения.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И (СпособыМетодыОбеспечения.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ИЛИ СпособыМетодыОбеспечения.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|{ГДЕ
		|	СпособыМетодыОбеспечения.Номенклатура.* КАК Номенклатура,
		|	СпособыМетодыОбеспечения.Характеристика.* КАК Характеристика,
		|	СпособыМетодыОбеспечения.Склад.* КАК Склад}";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецЕсли
