#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ВернутьКлассТовара(Номенклатура,Подразделение) экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ABC.Класс КАК Класс
		|ИЗ
		|	РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.СрезПоследних КАК ABC
		|ГДЕ
		|	ABC.Номенклатура = &Номенклатура
		|	И ABC.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.Класс; 
	иначе
		возврат Перечисления.ABCКлассификация_Альтерра.ПустаяСсылка();
	Конецесли;
	
КонецФункции // ВернутьКлассТовара()
	
	
#КонецЕсли
