
&НаКлиенте
&После("ОбработкаОповещения")
Процедура Док_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_ПорчаТоваров" Тогда
		СформироватьОтчет();
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ВывестиДокументОприходованиеИзлишков")
Процедура Док_ВывестиДокументОприходованиеИзлишков(СтрокаДействия, Макет, Описание)

	Если НеВыводитьВОтчет("ВывестиДокументОприходованиеИзлишков", СтрокаДействия.Основание) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПоискаСкладов = Новый Структура("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы);
	НайденныеСтроки        = СтрокаДействия.ДействияСклады.НайтиСтроки(ПараметрыПоискаСкладов);
	МассивСкладовСписания  = Новый Массив;
	Для Каждого СтрокаСоСписанием Из НайденныеСтроки Цикл

		Если МассивСкладовСписания.Найти(СтрокаСоСписанием.Склад) = Неопределено Тогда
			МассивСкладовСписания.Добавить(СтрокаСоСписанием.Склад);
		КонецЕсли;

	КонецЦикла;

	Для Каждого СкладСписания Из МассивСкладовСписания Цикл

		Описание.Склад = СкладСписания;
		Описание.ВыводитьСклад = (МассивСкладовСписания.Количество() > 1);

		МассивОформленныхДокументов = Новый Массив;

		ОформленныеДокументы = ОснованияОприходования.НайтиСтроки(Новый Структура("Основание, Склад",
		СтрокаДействия.Основание,
		СкладСписания));
#Удаление
		Если ОформленныеДокументы.Количество() = 0 Тогда

			МассивОформленныхДокументов.Добавить(Новый Структура("ОформляемыйДокумент, Склад",
			Документы.ОприходованиеИзлишковТоваров.ПустаяСсылка(),
			СкладСписания));

		Иначе

			Для Каждого ОформленныйДокумент Из ОформленныеДокументы Цикл

				МассивОформленныхДокументов.Добавить(ОформленныйДокумент.Оприходование);

			КонецЦикла;

		КонецЕсли;
		
		ВывестиДокументКОформлению("ОприходованиеИзлишковТоваров",
		1,
		Макет,
		МассивОформленныхДокументов,,,
		Описание);
#КонецУдаления
#Вставка
		ДоступноОформление = ЕстьТоварыКОформлениюИзлишки(Описание.АктОРасхождениях,Описание.ОснованиеАкта);
		
		Если ОформленныеДокументы.Количество() <> 0 Тогда
			Для Каждого ОформленныйДокумент Из ОформленныеДокументы Цикл
				МассивОформленныхДокументов.Добавить(ОформленныйДокумент.Оприходование);
			КонецЦикла;
		КонецЕсли;
		
		Если ДоступноОформление Тогда
			МассивОформленныхДокументов.Добавить(Новый Структура("ОформляемыйДокумент, Склад",
																Документы.ОприходованиеИзлишковТоваров.ПустаяСсылка(),
																СкладСписания));
		КонецЕсли;
															
		Если МассивОформленныхДокументов.Количество() > 0 ИЛИ ДоступноОформление Тогда
			Если ТаблицаСтрокДляПорчи.Количество() > 0 Тогда
				Описание.Вставить("ВозможноОформлениеПорчи", Истина);
			КонецЕсли;
			ВывестиДокументКОформлению("ОприходованиеИзлишковТоваров",
										1,
										Макет,
										МассивОформленныхДокументов,,,
										Описание);
			
		КонецЕсли;
#КонецВставки

	КонецЦикла;

	МассивОформленныхДокументов = Новый Массив;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ВывестиДокументСписаниеНедостачТоваров")
Процедура Док_ВывестиДокументСписаниеНедостачТоваров(СтрокаДействия, Макет, Описание)

	Если НеВыводитьВОтчет("ВывестиДокументСписаниеНедостачТоваров", СтрокаДействия.Основание) Тогда
		Возврат;
	КонецЕсли;

	ХозяйственнаяОперация = ?(ТипЗнч(СтрокаДействия.Основание) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение"),
	Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи,
	Неопределено);

	ПараметрыПоискаСкладов = Новый Структура("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы);
	НайденныеСтроки = СтрокаДействия.ДействияСклады.НайтиСтроки(ПараметрыПоискаСкладов);
	МассивСкладовСписания = Новый Массив;
	Для Каждого СтрокаСоСписанием Из НайденныеСтроки Цикл

		Если МассивСкладовСписания.Найти(СтрокаСоСписанием.Склад) = Неопределено Тогда
			МассивСкладовСписания.Добавить(СтрокаСоСписанием.Склад);
		КонецЕсли;

	КонецЦикла;

	Для Каждого СкладСписания Из МассивСкладовСписания Цикл

		Описание.Склад = СкладСписания;
		Описание.ВыводитьСклад = (МассивСкладовСписания.Количество() > 1);

		МассивОформленныхДокументов = Новый Массив;

		ОформленныеДокументы = ОснованияСписанияНедостач.НайтиСтроки(Новый Структура("Основание, Склад",
		СтрокаДействия.Основание,
		СкладСписания));
#Удаление
		Если ОформленныеДокументы.Количество() = 0 Тогда

			МассивОформленныхДокументов.Добавить(Новый Структура("ОформляемыйДокумент, Склад",
			Документы.СписаниеНедостачТоваров.ПустаяСсылка(),
			СкладСписания));

		Иначе

			Для Каждого ОформленныйДокумент Из ОформленныеДокументы Цикл

				МассивОформленныхДокументов.Добавить(ОформленныйДокумент.Списание);

			КонецЦикла;

		КонецЕсли;
		
		
		ВывестиДокументКОформлению(
		"СписаниеНедостачТоваров",
		1,
		Макет,
		МассивОформленныхДокументов,
		ХозяйственнаяОперация,,
		Описание);
#КонецУдаления
#Вставка		
        ДоступноОформление = ЕстьТоварыКОформлениюНедостачи(Описание.АктОРасхождениях,Описание.ОснованиеАкта);
		Если ОформленныеДокументы.Количество() <> 0 Тогда
			Для Каждого ОформленныйДокумент Из ОформленныеДокументы Цикл
				МассивОформленныхДокументов.Добавить(ОформленныйДокумент.Списание);
			КонецЦикла;
		КонецЕсли;
		
		Если ДоступноОформление Тогда
			МассивОформленныхДокументов.Добавить(Новый Структура("ОформляемыйДокумент, Склад",
																Документы.СписаниеНедостачТоваров.ПустаяСсылка(),
																СкладСписания));
		КонецЕсли;
		
		Если МассивОформленныхДокументов.Количество() > 0 ИЛИ ДоступноОформление Тогда
			Если ТаблицаСтрокДляПорчи.Количество() > 0 Тогда
				Описание.Вставить("ВозможноОформлениеПорчи", Истина);
			КонецЕсли;
			ВывестиДокументКОформлению("СписаниеНедостачТоваров",
										1,
										Макет,
										МассивОформленныхДокументов,
										ХозяйственнаяОперация,,
										Описание);
			
		КонецЕсли;
		
#КонецВставки
       
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВывестиДокументПорчаТоваров(СтрокаДействия, Макет, Описание)
	
	Если НеВыводитьВОтчет("ВывестиДокументПорчаТоваров", СтрокаДействия.Основание) Тогда
		Возврат;
	КонецЕсли;

	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваров;

	ПараметрыПоискаСкладов = Новый Структура("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы);
	НайденныеСтроки = СтрокаДействия.ДействияСклады.НайтиСтроки(ПараметрыПоискаСкладов);
	МассивСкладовСписания = Новый Массив;
	Для Каждого СтрокаСоСписанием Из НайденныеСтроки Цикл

		Если МассивСкладовСписания.Найти(СтрокаСоСписанием.Склад) = Неопределено Тогда
			МассивСкладовСписания.Добавить(СтрокаСоСписанием.Склад);
		КонецЕсли;

	КонецЦикла;

	Для Каждого СкладСписания Из МассивСкладовСписания Цикл

		Описание.Склад = СкладСписания;
		Описание.ВыводитьСклад = (МассивСкладовСписания.Количество() > 1);

		МассивОформленныхДокументов = Новый Массив;

		ОформленныеДокументы = ОснованияПорчиТоваров.НайтиСтроки(Новый Структура("Основание, Склад",
		СтрокаДействия.Основание,
		СкладСписания));
		
        ДоступноОформление = ЕстьТоварыКОформлениюПорчи(Описание.ОснованиеАкта);
		Если ОформленныеДокументы.Количество() <> 0 Тогда
			Для Каждого ОформленныйДокумент Из ОформленныеДокументы Цикл
				МассивОформленныхДокументов.Добавить(ОформленныйДокумент.Порча);
			КонецЦикла;
		КонецЕсли;
		
		Если ДоступноОформление Тогда
			МассивОформленныхДокументов.Добавить(Новый Структура("ОформляемыйДокумент, Склад",
																Документы.ПорчаТоваров.ПустаяСсылка(),
																СкладСписания));
		КонецЕсли;
		
		Если МассивОформленныхДокументов.Количество() > 0 ИЛИ ДоступноОформление Тогда
			Описание.Вставить("ВозможноОформлениеПорчи", Истина);
			ВывестиДокументКОформлению("ПорчаТоваров",
										1,
										Макет,
										МассивОформленныхДокументов,
										ХозяйственнаяОперация,,
										Описание);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьТоварыКОформлениюИзлишки(АктОРасхождениях,ОснованиеАкта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
		|	ТаблицаСтрокПорчи.НоменклатураОприходование КАК Номенклатура,
		|	ТаблицаСтрокПорчи.ХарактеристикаОприходование КАК Характеристика,
		|	ТаблицаСтрокПорчи.НазначениеОприходование КАК Назначение,
		|	ТаблицаСтрокПорчи.СерияОприходование КАК Серия,
		|	ТаблицаСтрокПорчи.Количество КАК Количество,
		|	ТаблицаСтрокПорчи.ОстатокОприходование КАК ОстатокОприходование
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаСтрокПорчи КАК ТаблицаСтрокПорчи
		|ГДЕ
		|	ТаблицаСтрокПорчи.ОснованиеОприходование = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Характеристика КАК Характеристика,
		|	ВТ.Назначение КАК Назначение,
		|	ВТ.Серия КАК Серия,
		|	СУММА(ВТ.Количество) КАК Количество,
		|	СУММА(ВТ.ОстатокОприходование) КАК ОстатокОприходование
		|ПОМЕСТИТЬ ТаблицаПорчи
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Номенклатура,
		|	ВТ.Характеристика,
		|	ВТ.Назначение,
		|	ВТ.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура КАК Номенклатура,
		|	АктОРасхожденияхПослеПриемкиТовары.Характеристика КАК Характеристика,
		|	АктОРасхожденияхПослеПриемкиТовары.Назначение КАК Назначение,
		|	АктОРасхожденияхПослеПриемкиТовары.Серия КАК Серия,
		|	СУММА(АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковок - АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковокПоДокументу) КАК Количество
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
		|ГДЕ
		|	АктОРасхожденияхПослеПриемкиТовары.Ссылка = &Ссылка
		|	И АктОРасхожденияхПослеПриемкиТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы)
		|	И АктОРасхожденияхПослеПриемкиТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура,
		|	АктОРасхожденияхПослеПриемкиТовары.Характеристика,
		|	АктОРасхожденияхПослеПриемкиТовары.Назначение,
		|	АктОРасхожденияхПослеПриемкиТовары.Серия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОприходованиеИзлишковТоваровТовары.Номенклатура,
		|	ОприходованиеИзлишковТоваровТовары.Характеристика,
		|	ОприходованиеИзлишковТоваровТовары.Назначение,
		|	ОприходованиеИзлишковТоваровТовары.Серия,
		|	-СУММА(ОприходованиеИзлишковТоваровТовары.Количество)
		|ИЗ
		|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
		|ГДЕ
		|	ОприходованиеИзлишковТоваровТовары.Ссылка.Основание = &Основание
		|	И ОприходованиеИзлишковТоваровТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ОприходованиеИзлишковТоваровТовары.Номенклатура,
		|	ОприходованиеИзлишковТоваровТовары.Характеристика,
		|	ОприходованиеИзлишковТоваровТовары.Назначение,
		|	ОприходованиеИзлишковТоваровТовары.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблица.Характеристика КАК Характеристика,
		|	ВременнаяТаблица.Назначение КАК Назначение,
		|	ВременнаяТаблица.Серия КАК Серия,
		|	СУММА(ВременнаяТаблица.Количество) - СУММА(ЕСТЬNULL(ТаблицаПорчи.Количество, 0)) + СУММА(ЕСТЬNULL(ТаблицаПорчи.ОстатокОприходование, 0)) КАК Количество
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорчи КАК ТаблицаПорчи
		|		ПО ВременнаяТаблица.Номенклатура = ТаблицаПорчи.Номенклатура
		|			И ВременнаяТаблица.Характеристика = ТаблицаПорчи.Характеристика
		|			И ВременнаяТаблица.Назначение = ТаблицаПорчи.Назначение
		|			И ВременнаяТаблица.Серия = ТаблицаПорчи.Серия
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.Номенклатура,
		|	ВременнаяТаблица.Характеристика,
		|	ВременнаяТаблица.Назначение,
		|	ВременнаяТаблица.Серия
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВременнаяТаблица.Количество) - СУММА(ЕСТЬNULL(ТаблицаПорчи.Количество, 0)) + СУММА(ЕСТЬNULL(ТаблицаПорчи.ОстатокОприходование, 0)) > 0
		|";
	
	Запрос.УстановитьПараметр("Основание", ОснованиеАкта);
	Запрос.УстановитьПараметр("Ссылка", АктОРасхождениях);
	Запрос.УстановитьПараметр("ТаблицаСтрокПорчи", ТаблицаСтрокДляПорчи.Выгрузить());
	
	Результат = Запрос.Выполнить();
		
	Если Не Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ЕстьТоварыКОформлениюНедостачи(АктОРасхождениях,ОснованиеАкта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
		|	ТаблицаСтрокПорчи.Номенклатура Как Номенклатура,
		|	ТаблицаСтрокПорчи.Характеристика КАК Характеристика,
		|	ТаблицаСтрокПорчи.Назначение КАК Назначение,
		|	ТаблицаСтрокПорчи.Серия КАК Серия,
		|	ТаблицаСтрокПорчи.Количество КАК Количество,
		|	ТаблицаСтрокПорчи.ОстатокСписание КАК ОстатокСписание
		|   ПОМЕСТИТЬ ТаблицаПорчи
		|ИЗ
		|	&ТаблицаСтрокПорчи КАК ТаблицаСтрокПорчи
		|ГДЕ
		|	ТаблицаСтрокПорчи.Основание = &Основание
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура КАК Номенклатура,
		|	АктОРасхожденияхПослеПриемкиТовары.Характеристика КАК Характеристика,
		|	АктОРасхожденияхПослеПриемкиТовары.Назначение КАК Назначение,
		|	АктОРасхожденияхПослеПриемкиТовары.Серия КАК Серия,
		|	СУММА(АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковокПоДокументу - АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковок) КАК Количество
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
		|ГДЕ
		|	АктОРасхожденияхПослеПриемкиТовары.Ссылка = &Ссылка
		|	И АктОРасхожденияхПослеПриемкиТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы)
		|	И АктОРасхожденияхПослеПриемкиТовары.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура,
		|	АктОРасхожденияхПослеПриемкиТовары.Характеристика,
		|	АктОРасхожденияхПослеПриемкиТовары.Назначение,
		|	АктОРасхожденияхПослеПриемкиТовары.Серия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СписаниеНедостачТоваровТовары.Номенклатура,
		|	СписаниеНедостачТоваровТовары.Характеристика,
		|	СписаниеНедостачТоваровТовары.Назначение,
		|	СписаниеНедостачТоваровТовары.Серия,
		|	-СУММА(СписаниеНедостачТоваровТовары.Количество)
		|ИЗ
		|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
		|ГДЕ
		|	СписаниеНедостачТоваровТовары.Ссылка.Основание = &Основание
		|	И СписаниеНедостачТоваровТовары.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеНедостачТоваровТовары.Номенклатура,
		|	СписаниеНедостачТоваровТовары.Характеристика,
		|	СписаниеНедостачТоваровТовары.Назначение,
		|	СписаниеНедостачТоваровТовары.Серия
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблица.Характеристика КАК Характеристика,
		|	ВременнаяТаблица.Назначение КАК Назначение,
		|	ВременнаяТаблица.Серия КАК Серия,
		|	СУММА(ВременнаяТаблица.Количество) - СУММА(isnull(ТаблицаПорчи.Количество, 0)) + СУММА(isnull(ТаблицаПорчи.ОстатокСписание, 0)) КАК Количество
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|   ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорчи КАК ТаблицаПорчи
		|   	ПО ВременнаяТаблица.Номенклатура = ТаблицаПорчи.Номенклатура
		|       	И ВременнаяТаблица.Характеристика = ТаблицаПорчи.Характеристика
		|           И ВременнаяТаблица.Назначение = ТаблицаПорчи.Назначение
		|           И ВременнаяТаблица.Серия = ТаблицаПорчи.Серия
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.Номенклатура,
		|	ВременнаяТаблица.Характеристика,
		|	ВременнаяТаблица.Назначение,
		|	ВременнаяТаблица.Серия
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВременнаяТаблица.Количество) - СУММА(isnull(ТаблицаПорчи.Количество, 0)) + СУММА(isnull(ТаблицаПорчи.ОстатокСписание, 0)) > 0";

	Запрос.УстановитьПараметр("Основание", ОснованиеАкта);
	Запрос.УстановитьПараметр("Ссылка", АктОРасхождениях);
	Запрос.УстановитьПараметр("ТаблицаСтрокПорчи", ТаблицаСтрокДляПорчи.Выгрузить());
	
	Результат = Запрос.Выполнить();
		
	Если Не Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ЕстьТоварыКОформлениюПорчи(ОснованиеАкта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ПОМЕСТИТЬ ТаблицаПорчи
	|ИЗ
	|	&ТаблицаСтрокПорчи КАК ТаблицаСтрокПорчи
	|
	|;
	|///////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаПорчи.Номенклатура КАК Номенклатура,
	|	ТаблицаПорчи.Характеристика КАК Характеристика,
	|	ТаблицаПорчи.Назначение КАК Назначение,
	|	ТаблицаПорчи.Серия КАК Серия,
	|	ТаблицаПорчи.ОстатокПорча КАК Остаток
	|ИЗ
	|	ТаблицаПорчи КАК ТаблицаПорчи
	|ГДЕ
	|	ТаблицаПорчи.Основание = &Основание
	|	И ТаблицаПорчи.ОстатокПорча > 0";

	Запрос.УстановитьПараметр("ТаблицаСтрокПорчи", ТаблицаСтрокДляПорчи.Выгрузить());
	Запрос.УстановитьПараметр("Основание", ОснованиеАкта);
	
	Результат = Запрос.Выполнить();
		
	Если Не Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

	
КонецФункции

&НаСервере
&Вместо("ВывестиДокументКОформлению")
Процедура Док_ВывестиДокументКОформлению(ВидДокумента, Уровень, Макет,
	                                 МассивОформленныхДокументов,
	                                 ХозяйственнаяОперация = Неопределено,
	                                 ВыводитьШапкуОформленныеДокументы = Истина,
	                                 Описание = Неопределено)
									 
	ОбластьПустаяСтрока       = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьТонкаяПустаяСтрока = Макет.ПолучитьОбласть("ТонкаяПустаяСтрока");
	ОбластьШапкаДокумента     = Макет.ПолучитьОбласть("ШапкаУровень"   + Строка(Уровень));
	ОбластьЛегендаДокумента   = Макет.ПолучитьОбласть("ЛегендаУровень" + Строка(Уровень));
	ОбластьСтрокаДокумента    = Макет.ПолучитьОбласть("СтрокаУровень"  + Строка(Уровень));
	
	ЖирныйШрифтTahoma9                 = Новый Шрифт("Tahoma", 9, Истина, Ложь,   Истина);
	ОбычныйШрифтTahoma9                = Новый Шрифт("Tahoma", 9, Ложь,   Ложь,   Истина);
	ЖирныйШрифтTahoma8                 = Новый Шрифт("Tahoma", 8, Ложь,   Истина, Ложь);
	
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	ОбластьШапкаДокумента.Параметры.Текст = ТекстШапки(ВидДокумента, Описание, ХозяйственнаяОперация);
	ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
	
	Если ВыводитьЛегенду Тогда
		ТабличныйДокумент.Вывести(ОбластьТонкаяПустаяСтрока);
		ОбластьЛегендаДокумента.Параметры.Текст = ТекстЛегенды(ВидДокумента, ХозяйственнаяОперация);
		ТабличныйДокумент.Вывести(ОбластьЛегендаДокумента);
		ТабличныйДокумент.Вывести(ОбластьТонкаяПустаяСтрока);
	КонецЕсли;
	
	//строки
	
	ВыведеныОформленныеДокументы = Ложь;
	
	Для Каждого ЭлементМассива Из МассивОформленныхДокументов Цикл
		
		Если ТипЗнч(ЭлементМассива) <> Тип("Структура") И ЗначениеЗаполнено(ЭлементМассива) Тогда
			
			ЦветЧерный = Новый Цвет(0, 0, 0);
			
			Если Не ВыведеныОформленныеДокументы И ВыводитьШапкуОформленныеДокументы Тогда
				ОбластьСтрокаДокумента.Параметры.Текст = Строка(НСтр("ru = 'Оформленные документы:'"));
				ОбластьСтрокаДокумента.Области["СтрокаУровень" + Строка(Уровень)].ЦветТекста = ЦветЧерный;
				ОбластьСтрокаДокумента.Области["СтрокаУровень" + Строка(Уровень)].Шрифт = ЖирныйШрифтTahoma8;
				ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
				ТабличныйДокумент.Вывести(ОбластьТонкаяПустаяСтрока);
			КонецЕсли;
			
			ОбластьСтрокаДокумента.Параметры.Текст = Строка(ЭлементМассива);
			ОбластьСтрокаДокумента.Области["СтрокаУровень" + Строка(Уровень)].ЦветТекста = ЦветЧерный;
			ОбластьСтрокаДокумента.Области["СтрокаУровень" + Строка(Уровень)].Шрифт = ОбычныйШрифтTahoma9;
			
			ВыведеныОформленныеДокументы = Истина;
			
			ОбластьСтрокаДокумента.Параметры.Данные = ЭлементМассива;
			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Описание <> Неопределено Тогда
		
		ИспользоватьГиперссылку = Ложь;
		Если Описание.ИмяКоманды = "Изменить" Тогда
			
			Результат = РасхожденияСервер.ДокументОснованиеСоответствуетАкту(Описание.АктОРасхождениях, Описание.ОснованиеАкта);
			Если Результат.СостояниеДокумента = "ТребуютсяИзменения" Тогда
				ЦветНадписи = ЦветаСтиля.ГиперссылкаЦвет;
				ТекстГиперссылки = НСтр("ru = 'Изменить'");
				ИспользоватьГиперссылку = Истина;
			ИначеЕсли Результат.СостояниеДокумента = "ИзмененияНеТребуются" Тогда
				ЦветНадписи = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
				ТекстГиперссылки = НСтр("ru = 'Изменения не требуются'");
			ИначеЕсли Результат.СостояниеДокумента = "ИзмененияВыполнены" Тогда
				ЦветНадписи = ЦветаСтиля.РезультатУспехЦвет;
				ТекстГиперссылки = НСтр("ru = 'Изменения выполнены'");
			ИначеЕсли Результат.СостояниеДокумента = "ОснованиеНеСоответствуетАкту" Тогда
				ЦветНадписи = ЦветаСтиля.ПоясняющийОшибкуТекст;
				ТекстГиперссылки = НСтр("ru = 'Основание не соответствует акту'");
			КонецЕсли;
			
		ИначеЕсли Описание.ИмяКоманды = "Оформить" Тогда
			
			ЦветНадписи = ЦветаСтиля.ГиперссылкаЦвет;
			ТекстГиперссылки = НСтр("ru = 'Оформить'");
			ИспользоватьГиперссылку = Истина;
			
		ИначеЕсли Описание.ИмяКоманды = "Подтвердить" Тогда	
			
			Если Описание.СтатусЭДО = "Получен" Тогда
				
				Если ЕстьПравоОбменаЭДО Тогда
				
					ЦветНадписи = ЦветаСтиля.ГиперссылкаЦвет;
					ТекстГиперссылки = НСтр("ru = 'Подтвердить'");
					ИспользоватьГиперссылку = Истина;
				
				Иначе
					
					ЦветНадписи = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
					ТекстГиперссылки = НСтр("ru = 'Вам недоступно подтверждение электронного документа.'");
					
				КонецЕсли;
				
			ИначеЕсли Описание.СтатусЭДО = "УтверждениеВОбработке" Тогда
				
				ЦветНадписи = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
				ТекстГиперссылки = НСтр("ru = 'Подтверждение инициировано.'");
				
			ИначеЕсли Описание.СтатусЭДО = "Утвержден" Тогда
				
				ЦветНадписи = ЦветаСтиля.РезультатУспехЦвет;
				ТекстГиперссылки = НСтр("ru = 'Электронный документ подтвержден.'");
				
			ИначеЕсли Описание.СтатусЭДО = "ОтклонениеВОбработке" Тогда
				
				ЦветНадписи = ЦветаСтиля.ПоясняющийОшибкуТекст;
				ТекстГиперссылки = НСтр("ru = 'Инициировано отклонение электронного документа, что не соответствует выбранному способу отработки расхождений'");
				
			ИначеЕсли Описание.СтатусЭДО = "Отклонен" Тогда
				
				ЦветНадписи = ЦветаСтиля.ПоясняющийОшибкуТекст;
				ТекстГиперссылки = НСтр("ru = 'Электронный документ отклонен, что не соответствует выбранному способу отработки расхождений'");
				
			КонецЕсли;
			
		ИначеЕсли Описание.ИмяКоманды = "Отклонить" Тогда
			
			Если Описание.СтатусЭДО = "Получен" Тогда
				
				Если ЕстьПравоОбменаЭДО Тогда
				
					ЦветНадписи = ЦветаСтиля.ГиперссылкаЦвет;
					ТекстГиперссылки = НСтр("ru = 'Отклонить'");
					ИспользоватьГиперссылку = Истина;
				
				Иначе
					
					ЦветНадписи = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
					ТекстГиперссылки = НСтр("ru = 'Вам недоступно отклонение электронного документа.'");
					
				КонецЕсли;
				
			ИначеЕсли Описание.СтатусЭДО = "УтверждениеВОбработке" Тогда
				
				ЦветНадписи = ЦветаСтиля.ПоясняющийОшибкуТекст;
				ТекстГиперссылки = НСтр("ru = 'Инициировано подтверждение электронного документа, что не соответствует выбранному способу отработки расхождений.'");
				
			ИначеЕсли Описание.СтатусЭДО = "Утвержден" Тогда
				
				ЦветНадписи = ЦветаСтиля.ПоясняющийОшибкуТекст;
				ТекстГиперссылки = НСтр("ru = 'Электронный документ подтвержден, что не соответствует выбранному способу отработки расхождений'");
				
			ИначеЕсли Описание.СтатусЭДО = "ОтклонениеВОбработке" Тогда
				
				ЦветНадписи = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
				ТекстГиперссылки = НСтр("ru = 'Инициировано отклонение электронного документа.'");
				
			ИначеЕсли Описание.СтатусЭДО = "Отклонен" Тогда
				
				ЦветНадписи = ЦветаСтиля.РезультатУспехЦвет;
				ТекстГиперссылки = НСтр("ru = 'Электронный документ отклонен.'");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если (ВыведеныОформленныеДокументы И Описание.ИмяКоманды = "Изменить")
			Или (Описание.ИмяКоманды = "Оформить" И Не ВыведеныОформленныеДокументы)
			// +Альтерра
			ИЛИ (Описание.ИмяКоманды = "Оформить" И ((ВидДокумента = "СписаниеНедостачТоваров" 
					И ЕстьТоварыКОформлениюНедостачи(Описание.АктОРасхождениях,Описание.ОснованиеАкта)) 
			ИЛИ (ВидДокумента = "ОприходованиеИзлишковТоваров" 
						И ЕстьТоварыКОформлениюИзлишки(Описание.АктОРасхождениях,Описание.ОснованиеАкта))
			ИЛИ (ВидДокумента = "ПорчаТоваров" И ЕстьТоварыКОформлениюПорчи(Описание.ОснованиеАкта))))
			// -
			Или Описание.ИмяКоманды = "Отклонить"
			Или Описание.ИмяКоманды = "Подтвердить" Тогда
		
			Если ИспользоватьГиперссылку Тогда
				Если Уровень = 1 Тогда
					ИмяОбласти = "СтрокаУровень1";
				Иначе
					ИмяОбласти = "СтрокаУровень2";
				КонецЕсли;
			Иначе
				Если Уровень = 1 Тогда
					ИмяОбласти = "СтрокаУровень1БезГиперссылки";
				Иначе
					ИмяОбласти = "СтрокаУровень2БезГиперссылки";
				КонецЕсли;
			КонецЕсли;
		
		
			ОбластьСтрокаДокумента = Макет.ПолучитьОбласть(ИмяОбласти);
			ОбластьСтрокаДокумента.Параметры.Текст = ТекстГиперссылки;
			
			Если ИспользоватьГиперссылку Тогда
				
				ОбластьСтрокаДокумента.Параметры.Данные = Новый Структура(
					"Описание, Данные, ИмяКоманды", Описание, ЭлементМассива, Описание.ИмяКоманды);
				
				ОбластьСтрокаДокумента.Области[ИмяОбласти].Шрифт = ЖирныйШрифтTahoma9;
				ОбластьСтрокаДокумента.Области[ИмяОбласти].ЦветТекста = ЦветНадписи;
				
			Иначе
				
				ОбластьСтрокаДокумента.Области[ИмяОбласти].ЦветТекста = ЦветНадписи;
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаДокумента);
		
		КонецЕсли;

	КонецЕсли;
	
	МассивОформленныхДокументов.Очистить();
									 
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СформироватьОтчет")
Процедура Док_СформироватьОтчет()

	ЕстьОшибки = Ложь;

	ТабличныйДокумент.Очистить();
	Макет = Обработки.РаботаСАктамиРасхождений.ПолучитьМакет("ОформляемыеДокументы");

	ВыборкаШапка = ТекстЗапросаШапкаАктаОРасхождениях();

	Если Не ЗначениеЗаполнено(ВыборкаШапка) Тогда
		ВывестиОшибку(НСтр("ru = 'Данные документа недоступны'"), Макет);
		Возврат;
	КонецЕсли;

	Если ВыборкаШапка.ЕстьОшибкиПроведение Тогда
		ВывестиОшибку(НСтр("ru = 'Документ не проведен. Оформление документов по результатам приемки невозможно.'"), Макет);
		Возврат;
	КонецЕсли;

	Если ВыборкаШапка.ЕстьОшибкиСтатус Тогда       
		#Удаление
		ВывестиОшибку(НСтр("ru = 'Для оформления документов по результатам расхождений необходимо перевести документ в статус ""Отрабатывается"" или ""Отработано"".'"), Макет);
		#КонецУдаления
		#Вставка
		ВывестиОшибку(НСтр("ru = 'Для оформления документов по результатам расхождений необходимо перевести документ в статус ""Отрабатывается"" или ""Отработано""  или ""Претензия"".'"), Макет);
		#КонецВставки
		Возврат;
	КонецЕсли;

	ВыведенныеДокументы = Новый ТаблицаЗначений;
	ВыведенныеДокументы.Колонки.Добавить("Имя");
	ВыведенныеДокументы.Колонки.Добавить("Ссылка");
	ВыведенныеДокументы.Колонки.Добавить("ДополнительныйПараметр");

	СпособОтраженияРасхождений   = ВыборкаШапка.СпособОтраженияРасхождений;
	ХозяйственнаяОперацияАкта    = ВыборкаШапка.ХозяйственнаяОперация;
	ТипОснованияАктаОРасхождении = ВыборкаШапка.ТипОснованияАктаОРасхождении;

	ПраваДоступаНаТаблицы        = Новый Структура;
	СоответствиеНаборовДанных    = Новый Соответствие;

	Если Не ЗначениеЗаполнено(СпособОтраженияРасхождений) Тогда 

		ВывестиОшибку(НСтр("ru = 'В акте приемки не задан способ отражения расхождений'"), Макет);
		Возврат;

	КонецЕсли;

	Если ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеОтгрузки") Тогда

		Если РасхожденияКлиентСервер.ТипОснованияРеализацияТоваровУслуг(ТипОснованияАктаОРасхождении) Тогда

			ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеРеализации();

		ИначеЕсли РасхожденияКлиентСервер.ТипОснованияВозвратПоставщику(ТипОснованияАктаОРасхождении) Тогда

			ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеВозвратаПоставщику();

		ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПередачаТоваровХранителю(ТипОснованияАктаОРасхождении)
			ИЛИ РасхожденияКлиентСервер.ТипОснованияПередачаНаКомиссию(ТипОснованияАктаОРасхождении) Тогда

			ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеПередачиТоваровХранителю();

		Иначе

			ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеОтгрузкиТоваровСХранения();

		КонецЕсли;

	ИначеЕсли ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеПриемки") Тогда

		ПраваДоступаНаТаблицы.Вставить("ЧтениеОприходованиеИзлишковТоваров", ПравоДоступа("Чтение", Метаданные.Документы.ОприходованиеИзлишковТоваров));
		ПраваДоступаНаТаблицы.Вставить("ДобавлениеСписаниеЗадолженности", ПравоДоступа("Добавление", Метаданные.Документы.КорректировкаЗадолженности));
		ПраваДоступаНаТаблицы.Вставить("ЧтениеСписаниеНедостачТоваров", ПравоДоступа("Чтение", Метаданные.Документы.СписаниеНедостачТоваров));

		Если ТипОснованияАктаОРасхождении = Перечисления.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг Тогда
			
			ПраваДоступаНаТаблицы.Вставить("ЧтениеЗаказПоставщику", ПравоДоступа("Чтение", Метаданные.Документы.ЗаказПоставщику));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеСписаниеЗадолженности", ПравоДоступа("Чтение", Метаданные.Документы.КорректировкаЗадолженности));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеПриобретениеТоваровУслуг", ПравоДоступа("Чтение", Метаданные.Документы.ПриобретениеТоваровУслуг));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеКорректировкаПриобретения", ПравоДоступа("Чтение", Метаданные.Документы.КорректировкаПриобретения));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеВозвратТоваровПоставщику", ПравоДоступа("Чтение", Метаданные.Документы.ВозвратТоваровПоставщику));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеСписаниеРасхожденийПоступлениеПриобретение", ПравоДоступа("Чтение", Метаданные.Документы.СписаниеРасхожденийПоступлениеПриобретение));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеПретензий", ПравоДоступа("Чтение", Метаданные.Справочники.Претензии));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеКорректировкаЗадолженности", ПравоДоступа("Чтение", Метаданные.Документы.КорректировкаЗадолженности));
			
			Если ЗакупкиСервер.ЭтоХозяйственнаяОперацияРаздельнойЗакупки(ХозяйственнаяОперацияАкта) Тогда
				ПраваДоступаНаТаблицы.Вставить("ЧтениеПоступленияТоваровНаСклад", ПравоДоступа("Чтение", Метаданные.Документы.ПоступлениеТоваровНаСклад));
			Иначе
				ПраваДоступаНаТаблицы.Вставить("ЧтениеПоступленияТоваровНаСклад", Ложь);
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеПоступленияТоваров(ПраваДоступаНаТаблицы, СоответствиеНаборовДанных);
			
		#Вставка
			ПраваДоступаНаТаблицы.Вставить("ЧтениеПорчаТоваров", ПравоДоступа("Чтение", Метаданные.Документы.ПорчаТоваров));
			
			Если ПраваДоступаНаТаблицы.ЧтениеПорчаТоваров Тогда
				
				ТекстЗапроса = ТекстЗапроса + РасхожденияКлиентСервер.Док_ТекстЗапросаОбъединить();
				
				ТекстЗапроса = ТекстЗапроса + "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПорчаТоваров.Ссылка КАК Порча,
				|	ПорчаТоваров.Склад КАК Склад,
				|	ПорчаТоваров.ДокументОснование КАК Основание
				|ИЗ
				|	Действия КАК Действия
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПорчаТоваров КАК ПорчаТоваров
				|		ПО (ПорчаТоваров.Проведен)
				|			И Действия.Основание = ПорчаТоваров.ДокументОснование
				|			И Действия.Склад     = ПорчаТоваров.Склад
				|";
				
				ТекущийНомер = 0;
				Для каждого Номер Из СоответствиеНаборовДанных Цикл
					ТекущееЗначение = Номер.Значение;
					ТекущийНомер = ?(ТекущееЗначение > ТекущийНомер, ТекущееЗначение, ТекущийНомер);
				КонецЦикла;
				СоответствиеНаборовДанных.Вставить("ОснованияПорчиТоваров", ТекущийНомер + 1);
				
			КонецЕсли;
			
			МВТ_Порча = Новый МенеджерВременныхТаблиц;
			ЗапросПорча = Новый Запрос;
			ЗапросПорча.МенеджерВременныхТаблиц = МВТ_Порча;
			ЗапросПорча.Текст = ТекстЗапросаОпределитьНеобходимостьСозданияПорчи();
			ЗапросПорча.УстановитьПараметр("АктОРасхождениях", АктОРасхождениях);
//			РезультатЗапросаПорча = ЗапросПорча.ВыполнитьПакетСПромежуточнымиДанными();
			Док_РаспределитьДействия(ЗапросПорча.ВыполнитьПакетСПромежуточнымиДанными())
			//ТаблицаСтрокДляПорчи.Загрузить(РезультатЗапросаПорча[3].Выгрузить());
#КонецВставки

		ИначеЕсли ТипОснованияАктаОРасхождении = Перечисления.ТипыОснованияАктаОРасхождении.ПриемкаТоваровНаХранение
			Тогда
			
			ЧтениеЗаказПоставщику = ПравоДоступа("Чтение", Метаданные.Документы.ЗаказПоставщику);
			
			ПраваДоступаНаТаблицы.Вставить("ЧтениеЗаказПоставщику", ЧтениеЗаказПоставщику);
			ПраваДоступаНаТаблицы.Вставить("ЧтениеОтгрузкаТоваровСХранения",
							ПравоДоступа("Чтение", Метаданные.Документы.ОтгрузкаТоваровСХранения));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеПриемкаТоваровНаХранение",
							ПравоДоступа("Чтение", Метаданные.Документы.ПриемкаТоваровНаХранение));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеСписаниеЗадолженности", Ложь);
			
			ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеПриемкиТоваровНаХранение(ПраваДоступаНаТаблицы,
												СоответствиеНаборовДанных);
			
		ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПоступлениеТоваровОтХранителя(ТипОснованияАктаОРасхождении)
			Или ТипОснованияАктаОРасхождении = Перечисления.ТипыОснованияАктаОРасхождении.ВозвратОтКомиссионера Тогда
			
			ПраваДоступаНаТаблицы.Вставить("ЧтениеПередач",
							ПравоДоступа("Чтение", Метаданные.Документы.ПередачаТоваровХранителю));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеПоступлениеТоваровОтХранителя",
							ПравоДоступа("Чтение", Метаданные.Документы.ПоступлениеТоваровОтХранителя));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеСписаниеЗадолженности", Ложь);
			
			ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеВозвратаОтХранителя(ПраваДоступаНаТаблицы, СоответствиеНаборовДанных);
			
		Иначе

			ПраваДоступаНаТаблицы.Вставить("ЧтениеРеализаций", ПравоДоступа("Чтение", Метаданные.Документы.РеализацияТоваровУслуг));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеСписаниеЗадолженности", ПравоДоступа("Чтение", Метаданные.Документы.КорректировкаЗадолженности));
			ПраваДоступаНаТаблицы.Вставить("ЧтениеВозвратТоваровОтКлиента", ПравоДоступа("Чтение", Метаданные.Документы.ВозвратТоваровОтКлиента));

			ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеВозвратаОтКлиента(ПраваДоступаНаТаблицы, СоответствиеНаборовДанных);

		КонецЕсли;

	ИначеЕсли ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда

		ПраваДоступаНаТаблицы.Вставить("ЧтениеОприходованиеИзлишковТоваров", ПравоДоступа("Чтение", Метаданные.Документы.ОприходованиеИзлишковТоваров));
		ПраваДоступаНаТаблицы.Вставить("ЧтениеСписаниеНедостачТоваров", ПравоДоступа("Чтение", Метаданные.Документы.СписаниеНедостачТоваров));

		ТекстЗапроса = ТекстЗапросаАктОРасхожденияхПослеПеремещения(ПраваДоступаНаТаблицы, СоответствиеНаборовДанных);

	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("АктОРасхождениях",            АктОРасхождениях);
	Запрос.УстановитьПараметр("СпособОтраженияРасхождений",  СпособОтраженияРасхождений);
	Если ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеПриемки") 
		И ТипОснованияАктаОРасхождении = Перечисления.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг Тогда
		ЗапросИзлишки = Новый Запрос;
		ЗапросИзлишки.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТоварыКОформлениюИзлишковНедостач.Регистратор
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач КАК ТоварыКОформлениюИзлишковНедостач
		|ГДЕ
		|	ТоварыКОформлениюИзлишковНедостач.Регистратор = &Ссылка";
		ЗапросИзлишки.УстановитьПараметр("Ссылка", АктОРасхождениях);
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = ЗапросИзлишки.Выполнить();
		ЭтоАктОРасхождениях2_5_12 = Не РезультатЗапроса.Пустой();
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		ЭтоАктОРасхождениях2_5_12 = Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ЭтоАктОРасхождениях2_5_12", ЭтоАктОРасхождениях2_5_12);
	Запрос.УстановитьПараметр("ИспользоватьЗаявкиНаВозврат", ИспользоватьЗаявкиНаВозврат);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	#Удаление
	Если РезультатЗапроса[1].Пустой() Тогда
		ВывестиОшибку(НСтр("ru = 'По результатам приемки не выявлено расхождений, требующих оформления документов'"), Макет);
		Возврат;
	КонецЕсли;
	#КонецУдаления
	#Вставка
	Если РезультатЗапроса[1].Пустой() И ТаблицаСтрокДляПорчи.Количество() = 0 Тогда
		ВывестиОшибку(НСтр("ru = 'По результатам приемки не выявлено расхождений, требующих оформления документов'"), Макет);
		Возврат;
	КонецЕсли;
	#КонецВставки
		
	ЗаполнитьТаблицуДействий(АктОРасхождениях, РезультатЗапроса);
	ЗаполнитьТаблицыСозданныхДокументов(РезультатЗапроса, ТипОснованияАктаОРасхождении, СоответствиеНаборовДанных);

	МассивОформленныхДокументов = Новый Массив;
	ОФормляемыеДокументыПоАкту  = НовыйОформляемыеДокументыПоАкту();

	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустаяСтрока"));
	Область = Макет.ПолучитьОбласть("АктОРасхождениях");
	Область.Параметры.АктОРасхождениях = АктОРасхождениях;
	ТабличныйДокумент.Вывести(Область);

	// тут либо реализация либо возврат товаров поставщику
	ВыводитьГруппуОснование = (Действия.Количество() > 1 
	                           И ХозяйственнаяОперацияАкта <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	
	Для Каждого СтрокаДействия Из Действия Цикл
		
		Если ВыводитьГруппуОснование Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустаяСтрока"));
			
			Область = Макет.ПолучитьОбласть("Основание");
			Область.Параметры.Основание = СтрокаДействия.Основание;
			ТабличныйДокумент.Вывести(Область);
			
			ТабличныйДокумент.НачатьГруппуСтрок("Основание");
			
		КонецЕсли;
		
		ХозяйственнаяОперация = Неопределено;
		
		Если ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеОтгрузки") Тогда
			
			ВывестиСтрокиДействийПоАктуПослеОтгрузки(СтрокаДействия, Макет, ТипОснованияАктаОРасхождении);
			
		ИначеЕсли ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеПриемки") Тогда
			
			ВывестиСтрокиДействийПоАктуПослеПриемки(СтрокаДействия, Макет, ТипОснованияАктаОРасхождении, ПраваДоступаНаТаблицы);
			
			
		ИначеЕсли ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда
			
			ВывестиСтрокиДействийПоАктуПослеПеремещения(СтрокаДействия, Макет, ТипОснованияАктаОРасхождении, ПраваДоступаНаТаблицы);
			
		КонецЕсли;
		
		Если ВыводитьГруппуОснование Тогда
			
			ТабличныйДокумент.ЗакончитьГруппуСтрок();
			
		КонецЕсли;
		
	КонецЦикла;

	// Вывод оформляемых документов вне групп документов оснований (основанием является акт о расхождении).
	ОФормляемыеДокументыПоАкту.Сортировать("ВидДокумента");
	
	Для Каждого ОформляемыйВид Из ОФормляемыеДокументыПоАкту Цикл
		ВывестиДокументКОформлению(ОформляемыйВид.ВидДокумента, 1, Макет, ОформляемыйВид.ОформляемыеДокументы,
			ХозяйственнаяОперация, Истина,
			ОформляемыйВид.Описание);
	КонецЦикла;
	
	Если ТабличныйДокумент.ВысотаТаблицы <= 2 Тогда
		ТекстОшибки = НСтр("ru = 'Вам недоступно для оформления ни одного документа.'");
		Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
			ТекстОшибки = ТекстОшибки + " " + НСтр("ru = 'Возможно нет необходимых прав.'");
		КонецЕсли;
		ОбластьОшибка = Макет.ПолучитьОбласть("СтрокаОшибка");
		ОбластьОшибка.Параметры.ТекстОшибки = ТекстОшибки;
		ТабличныйДокумент.Вывести(ОбластьОшибка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаОпределитьНеобходимостьСозданияПорчи()
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика КАК Характеристика,
	|	АктОРасхожденияхПослеПриемкиТовары.Назначение КАК Назначение,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество КАК Количество,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена КАК Цена,
	|	АктОРасхожденияхПослеПриемкиТовары.Действие КАК Действие,
	|	АктОРасхожденияхПослеПриемкиТовары.ДокументОснование КАК ДокументОснование,
	|	АктОРасхожденияхПослеПриемкиТовары.Склад КАК Склад,
	|	АктОРасхожденияхПослеПриемкиТовары.ПоВинеСтороннейКомпании КАК ПоВинеСтороннейКомпании,
	|	АктОРасхожденияхПослеПриемкиТовары.Серия КАК Серия
	|ПОМЕСТИТЬ Оприходование
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка = &АктОРасхождениях
	|	И АктОРасхожденияхПослеПриемкиТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДругогоКачества.НоменклатураБрак КАК НоменклатураБрак,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика КАК Характеристика,
	|	АктОРасхожденияхПослеПриемкиТовары.Назначение КАК Назначение,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Количество КАК Количество,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена КАК Цена,
	|	АктОРасхожденияхПослеПриемкиТовары.Действие КАК Действие,
	|	АктОРасхожденияхПослеПриемкиТовары.ДокументОснование КАК ДокументОснование,
	|	АктОРасхожденияхПослеПриемкиТовары.Склад КАК Склад,
	|	АктОРасхожденияхПослеПриемкиТовары.ПоВинеСтороннейКомпании КАК ПоВинеСтороннейКомпании,
	|	АктОРасхожденияхПослеПриемкиТовары.Серия КАК Серия
	|ПОМЕСТИТЬ Исходная
	|ИЗ
	|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|		ПО ТоварыДругогоКачества.Номенклатура = АктОРасхожденияхПослеПриемкиТовары.Номенклатура
	|ГДЕ
	|	ТоварыДругогоКачества.Номенклатура.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый)
	|	И ТоварыДругогоКачества.НоменклатураБрак В
	|			(ВЫБРАТЬ
	|				Оприходование.Номенклатура
	|			ИЗ
	|				Оприходование)
	|	И АктОРасхожденияхПослеПриемкиТовары.Ссылка = &АктОРасхождениях
	|	И АктОРасхожденияхПослеПриемкиТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Исходная.Номенклатура КАК Номенклатура,
	|	Исходная.Характеристика КАК Характеристика,
	|	Исходная.Назначение КАК Назначение,
	|	Исходная.Количество КАК Количество,
	|	Исходная.Действие КАК Действие,
	|	Исходная.ДокументОснование КАК ОснованиеСписание,
	|	Исходная.Серия КАК Серия,
	|	Исходная.Склад КАК СкладСписание,
	|	Исходная.ПоВинеСтороннейКомпании КАК ПоВинеСтороннейКомпанииСписание,
	|	Оприходование.Номенклатура КАК НоменклатураОприходование,
	|	Оприходование.Характеристика КАК ХарактеристикаОприходование,
	|	Оприходование.Назначение КАК НазначениеОприходование,
	|	Исходная.Количество КАК КоличествоОприходование,
	|	Оприходование.Цена КАК Цена,
	|	Оприходование.Действие КАК ДействиеОприходование,
	|	Оприходование.ДокументОснование КАК ОснованиеОприходование,
	|	Оприходование.Серия КАК СерияОприходование,
	|	Оприходование.Склад КАК СкладОприходование,
	|	Оприходование.ПоВинеСтороннейКомпании КАК ПоВинеСтороннейКомпанииОприходование
	|ПОМЕСТИТЬ Порча
	|ИЗ
	|	Исходная КАК Исходная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Оприходование КАК Оприходование
	|		ПО Исходная.НоменклатураБрак = Оприходование.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Порча.Номенклатура КАК Номенклатура,
	|	Порча.Характеристика КАК Характеристика,
	|	Порча.Назначение КАК Назначение,
	|	Порча.Серия КАК Серия,
	|	Порча.Действие КАК Действие,
	|	Порча.ОснованиеСписание КАК Основание,
	|	Порча.СкладСписание КАК Склад,
	|	Порча.ПоВинеСтороннейКомпанииСписание КАК ПоВинеСтороннейКомпании,
	|	Порча.ОснованиеСписание.ПоступлениеПоЗаказам КАК ПоЗаказам,
	|	Порча.Количество КАК Количество,
	|	СУММА(ЕСТЬNULL(Списание.Количество, 0)) КАК Списано,
	|	СУММА(ЕСТЬNULL(ПорчаТоваровТовары.Количество, 0)) КАК СписаноПорча,
	|	0 КАК ОстатокСписание,
	|	Порча.НоменклатураОприходование КАК НоменклатураОприходование,
	|	Порча.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
	|	Порча.НазначениеОприходование КАК НазначениеОприходование,
	|	Порча.СерияОприходование КАК СерияОприходование,
	|	Порча.ДействиеОприходование КАК ДействиеОприходование,
	|	Порча.ОснованиеОприходование КАК ОснованиеОприходование,
	|	Порча.СкладОприходование КАК СкладОприходование,
	|	Порча.ПоВинеСтороннейКомпанииОприходование КАК ПоВинеСтороннейКомпанииОприходование,
	|	Порча.ОснованиеОприходование.ПоступлениеПоЗаказам КАК ПоЗаказамОприходование,
	|	СУММА(0) КАК КоличествоОприходование,
	|	СУММА(ЕСТЬNULL(Оприходование.Количество, 0)) КАК Оприходовано,
	|	СУММА(ЕСТЬNULL(ПорчаТоваровТовары.Количество, 0)) КАК ОприходованоПорча,
	|	0 КАК ОстатокОприходование,
	|	Порча.Цена КАК Цена,
	|	СУММА(0) КАК ОстатокПорча
	|ИЗ
	|	Порча КАК Порча
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеНедостачТоваров.Товары КАК Списание
	|		ПО (Списание.Ссылка.Проведен)
	|			И (Порча.ОснованиеСписание = Списание.Ссылка.Основание)
	|			И (Порча.СкладСписание = Списание.Ссылка.Склад)
	|			И (Порча.Номенклатура = Списание.Номенклатура)
	|			И (Порча.Характеристика = Списание.Характеристика)
	|			И (Порча.Назначение = Списание.Назначение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеИзлишковТоваров.Товары КАК Оприходование
	|		ПО (Оприходование.Ссылка.Проведен)
	|			И (Порча.ОснованиеОприходование = Оприходование.Ссылка.Основание)
	|			И (Порча.СкладОприходование = Оприходование.Ссылка.Склад)
	|			И (Порча.НоменклатураОприходование = Оприходование.Номенклатура)
	|			И (Порча.ХарактеристикаОприходование = Оприходование.Характеристика)
	|			И (Порча.НазначениеОприходование = Оприходование.Назначение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
	|		ПО (ПорчаТоваровТовары.Ссылка.Проведен)
	|			И (Порча.ОснованиеСписание = ПорчаТоваровТовары.Ссылка.ДокументОснование)
	|			И (Порча.ОснованиеОприходование = ПорчаТоваровТовары.Ссылка.ДокументОснование)
	|			И (Порча.Номенклатура = ПорчаТоваровТовары.Номенклатура)
	|			И (Порча.НоменклатураОприходование = ПорчаТоваровТовары.НоменклатураОприходование)
	|			И (Порча.Характеристика = ПорчаТоваровТовары.Характеристика)
	|			И (Порча.ХарактеристикаОприходование = ПорчаТоваровТовары.ХарактеристикаОприходование)
	|			И (Порча.Назначение = ПорчаТоваровТовары.Назначение)
	|			И (Порча.Серия = ПорчаТоваровТовары.Серия)
	|
	|СГРУППИРОВАТЬ ПО
	|	Порча.Номенклатура,
	|	Порча.Характеристика,
	|	Порча.Назначение,
	|	Порча.Серия,
	|	Порча.Действие,
	|	Порча.ОснованиеСписание,
	|	Порча.СкладСписание,
	|	Порча.ПоВинеСтороннейКомпанииСписание,
	|	Порча.ОснованиеСписание.ПоступлениеПоЗаказам,
	|	Порча.НоменклатураОприходование,
	|	Порча.ХарактеристикаОприходование,
	|	Порча.НазначениеОприходование,
	|	Порча.СерияОприходование,
	|	Порча.ДействиеОприходование,
	|	Порча.ОснованиеОприходование,
	|	Порча.СкладОприходование,
	|	Порча.ПоВинеСтороннейКомпанииОприходование,
	|	Порча.ОснованиеОприходование.ПоступлениеПоЗаказам,
	|	Порча.Цена,
	|	Порча.Количество,
	|	Порча.КоличествоОприходование
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура Док_РаспределитьДействия(РезультатЗапроса)
	
	ТаблицаОприходавание = РезультатЗапроса[0].Выгрузить();
	ТаблицаДействий = РезультатЗапроса[3].Выгрузить();
	
	Для Каждого Стр Из ТаблицаОприходавание Цикл
		
		НеобходимоОприходовать = Стр.Количество;
		
		Отбор = Новый Структура("НоменклатураОприходование", Стр.Номенклатура);
		Отбор.Вставить("НоменклатураОприходование", Стр.Номенклатура);
		Отбор.Вставить("ХарактеристикаОприходование", Стр.Характеристика);
		Отбор.Вставить("НазначениеОприходование", Стр.Назначение);
		Отбор.Вставить("СкладОприходование", Стр.Склад);
		
		СтрокиДействий = ТаблицаДействий.НайтиСтроки(Отбор);
		
		ИндексыСтрок = СтрокиДействий.Количество()-1;
		
		ВсегоОприходовано = 0;
		
		Если ИндексыСтрок >= 0 Тогда
			Для Каждого СтрДействия Из СтрокиДействий Цикл
				//ВсегоОприходовано = ВсегоОприходовано + СтрДействия.Оприходовано + СтрДействия.ОприходованоПорча;
				ВсегоОприходовано = ВсегоОприходовано + СтрДействия.Оприходовано/(ИндексыСтрок + 1) + СтрДействия.ОприходованоПорча;
			КонецЦикла;
		КонецЕсли;	
		
		НеобходимоОприходовать = НеобходимоОприходовать - ВсегоОприходовано;
		
		Для Индекс = -ИндексыСтрок По 0 Цикл
			
			СтрокаДействия = СтрокиДействий[-Индекс];
			
			ДоступноДляПорчиОсновная = Макс(СтрокаДействия.Количество - СтрокаДействия.Списано - СтрокаДействия.СписаноПорча, 0);
			ДоступноДляПорчиПриходуемая = Макс(НеобходимоОприходовать - СтрокаДействия.ОприходованоПорча, 0);
			
			ДоступноДляПорчи = Мин(ДоступноДляПорчиОсновная, ДоступноДляПорчиПриходуемая);
			
			ОстатокПорча = Мин(НеобходимоОприходовать, ДоступноДляПорчи);

			СтрокаДействия.ОстатокПорча = ОстатокПорча;
			СтрокаДействия.КоличествоОприходование = ОстатокПорча;
			СтрокаДействия.ОстатокСписание = ДоступноДляПорчиОсновная - ОстатокПорча;
			НеобходимоОприходовать = НеобходимоОприходовать - СтрокаДействия.ОстатокПорча;

			Если Индекс = 0 И НеобходимоОприходовать > 0 Тогда
				СтрокаДействия.ОстатокОприходование = НеобходимоОприходовать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаСтрокДляПорчи.Загрузить(ТаблицаДействий);
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ТекстЗапросаШапкаАктаОРасхождениях")
Функция Док_ТекстЗапросаШапкаАктаОРасхождениях()

	Запрос = Новый Запрос;
	Если ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеОтгрузки") Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктОРасхожденияхПослеОтгрузки.Ссылка,
		|	АктОРасхожденияхПослеОтгрузки.Статус,
		|	АктОРасхожденияхПослеОтгрузки.СпособОтраженияРасхождений,
		|	АктОРасхожденияхПослеОтгрузки.ТипОснованияАктаОРасхождении,
		|	ВЫБОР
		|		КОГДА АктОРасхожденияхПослеОтгрузки.Проведен
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиПроведение,
		|	ВЫБОР
		|		КОГДА АктОРасхожденияхПослеОтгрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению)
		|			ИЛИ АктОРасхожденияхПослеОтгрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	АктОРасхожденияхПослеОтгрузки.ХозяйственнаяОперация
		|ИЗ
		|	Документ.АктОРасхожденияхПослеОтгрузки КАК АктОРасхожденияхПослеОтгрузки
		|ГДЕ
		|	АктОРасхожденияхПослеОтгрузки.Ссылка = &АктОРасхождениях";
		
	ИначеЕсли ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктОРасхожденияхПослеПеремещения.Ссылка,
		|	АктОРасхожденияхПослеПеремещения.Статус,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов) КАК СпособОтраженияРасхождений,
		|	Неопределено КАК ТипОснованияАктаОРасхождении,
		|	ВЫБОР
		|		КОГДА АктОРасхожденияхПослеПеремещения.Проведен
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиПроведение,
		|	ВЫБОР
		|		КОГДА АктОРасхожденияхПослеПеремещения.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению)
		|			ИЛИ АктОРасхожденияхПослеПеремещения.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	АктОРасхожденияхПослеПеремещения.ХозяйственнаяОперация
		|ИЗ
		|	Документ.АктОРасхожденияхПослеПеремещения КАК АктОРасхожденияхПослеПеремещения
		|ГДЕ
		|	АктОРасхожденияхПослеПеремещения.Ссылка = &АктОРасхождениях";
		
	ИначеЕсли  ТипЗнч(АктОРасхождениях) = Тип("ДокументСсылка.АктОРасхожденияхПослеПриемки") Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктОРасхожденияхПослеПриемки.Ссылка,
		|	АктОРасхожденияхПослеПриемки.Статус,
		|	АктОРасхожденияхПослеПриемки.СпособОтраженияРасхождений,
		|	АктОРасхожденияхПослеПриемки.ТипОснованияАктаОРасхождении,
		|	ВЫБОР
		|		КОГДА АктОРасхожденияхПослеПриемки.Проведен
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиПроведение,
		|	ВЫБОР
		|		КОГДА АктОРасхожденияхПослеПриемки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению)
		|			ИЛИ АктОРасхожденияхПослеПриемки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	АктОРасхожденияхПослеПриемки.ХозяйственнаяОперация
		|ИЗ
		|	Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
		|ГДЕ
		|	АктОРасхожденияхПослеПриемки.Ссылка = &АктОРасхождениях";
		
	КонецЕсли;
	
	#Вставка
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	"АктОРасхожденияхПослеПриемки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению)",
	"АктОРасхожденияхПослеПриемки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению) ИЛИ АктОРасхожденияхПослеПриемки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Претензия)");
	#КонецВставки
	
	Запрос.УстановитьПараметр("АктОРасхождениях", АктОРасхождениях);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	ВыборкаШапка.Следующий();
	
	Возврат ВыборкаШапка;

КонецФункции

&НаСервере
&После("ВывестиСтрокиДействийПоАктуПослеПриемки")
Процедура Док_ВывестиСтрокиДействийПоАктуПослеПриемки(СтрокаДействия, Макет, ТипОснованияАктаОРасхождении, ПраваДоступаНаТаблицы)
	
	Если ПраваДоступаНаТаблицы.Свойство("ЧтениеПорчаТоваров") Тогда
		Если ПраваДоступаНаТаблицы.ЧтениеПорчаТоваров Тогда
			
			Описание = СтруктурыОписанияВыводимогоВОтчетДействия();
			
			Описание.ОснованиеАкта    = СтрокаДействия.Основание;
			Описание.АктОРасхождениях = АктОРасхождениях;
			Описание.ИмяКоманды       = "Оформить";
			Описание.ВариантДействия  = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы;
			Описание.СпособОтражения  = Перечисления.СпособыОтраженияАктовОРасхожденияПослеПоступления.ИсправлениеПервичныхДокументов;
			
			ВывестиДокументПорчаТоваров(СтрокаДействия, Макет, Описание);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ВывестиСтрокиДействийПоАктуПослеПеремещения")
Процедура Док_ВывестиСтрокиДействийПоАктуПослеПеремещения(СтрокаДействия, Макет, ТипОснованияАктаОРасхождении, ПраваДоступаНаТаблицы)

	ИспользоватьИсправлениеДокументов = ПолучитьФункциональнуюОпцию("ИспользоватьИсправлениеДокументов");

	Если Не ИспользоватьИсправлениеДокументов
		И СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка) <> Неопределено Тогда
			
			// Выводим перемещение, которое надо уменьшить.  (КнопкаИзменений)
			// Выводить команду на создание нового перемещения на доперемещение недоперемещенного. (КомандаГиперссылка  ).
			
			Описание = Новый Структура;
			Описание.Вставить("ОснованиеАкта", СтрокаДействия.Основание);
			Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
			Описание.Вставить("ИмяКоманды", "Изменить");
			Описание.Вставить("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка);
			Описание.Вставить("СпособОтражения", СпособОтраженияРасхождений);
			
			ВывестиИсправлениеПеремещенияТоваров(
				СтрокаДействия,
				Макет,
				Описание);
				
				
			Описание = Новый Структура;
			Описание.Вставить("ОснованиеАкта", СтрокаДействия.Основание);
			Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
			Описание.Вставить("ИмяКоманды", "Оформить");
			Описание.Вставить("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка);
			Описание.Вставить("СпособОтражения", СпособОтраженияРасхождений);
				
			ВывестиДокументПеремещениеТоваров(
				СтрокаДействия,
				Макет,
				Описание);
			
	КонецЕсли;

	Если ИспользоватьИсправлениеДокументов
		И СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка) <> Неопределено Тогда
			
			// Выводим команду на создание корректировки перемещения, которое надо уменьшить.  (КнопкаИзменений)
			// Выводить команду на создание нового перемещения на доперемещение недоперемещенного. (КомандаГиперссылка  ).
			
			Описание = Новый Структура;
			Описание.Вставить("ОснованиеАкта", СтрокаДействия.Основание);
			Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
			Описание.Вставить("ИмяКоманды", "Оформить");
			Описание.Вставить("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка);
			Описание.Вставить("СпособОтражения", СпособОтраженияРасхождений);
			
			ВывестиКорректировкуПеремещенияТоваров(
				СтрокаДействия,
				Макет,
				Описание);
				
				
			Описание = Новый Структура;
			Описание.Вставить("ОснованиеАкта", СтрокаДействия.Основание);
			Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
			Описание.Вставить("ИмяКоманды", "Оформить");
			Описание.Вставить("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка);
			Описание.Вставить("СпособОтражения", СпособОтраженияРасхождений);
				
			ВывестиДокументПеремещениеТоваров(
				СтрокаДействия,
				Макет,
				Описание,
				Ложь,
				ИспользоватьИсправлениеДокументов);
			
	КонецЕсли;

	Если Не ИспользоватьИсправлениеДокументов
		И СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется) <> Неопределено Тогда
		
		// Если есть заказы:
		//  Выводим перемещение, которое надо уменьшить (КнопкаИзменений).
		//  Выводим заказ на перемещение, в котором строки подлежат отмене. (КомандаГиперссылка ).
		// Если нет заказов:
		//  Выводим перемещение, которое надо уменьшить (КнопкаИзменений).
		
		Описание = Новый Структура;
		Описание.Вставить("ОснованиеАкта", СтрокаДействия.Основание);
		Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
		Описание.Вставить("ИмяКоманды", "Изменить");
		Описание.Вставить("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется);
		Описание.Вставить("СпособОтражения", СпособОтраженияРасхождений);
		
		ВывестиИсправлениеПеремещенияТоваров(
			СтрокаДействия,
			Макет,
			Описание);
			
		Если СтрокаДействия.ПоЗаказам Тогда
			ТабличныйДокумент.НачатьГруппуСтрок();
			
			Описание = Новый Структура;
			Описание.Вставить("ОснованиеАкта", СтрокаДействия.Основание);
			Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
			Описание.Вставить("ИмяКоманды", "Оформить");
			Описание.Вставить("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется);
			Описание.Вставить("СпособОтражения", СпособОтраженияРасхождений);
			
			ВывестиДокументЗаказНаПеремещение(СтрокаДействия, Макет, Описание);
			ТабличныйДокумент.ЗакончитьГруппуСтрок();
		КонецЕсли;
			
	КонецЕсли;

	Если ИспользоватьИсправлениеДокументов
		И СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется) <> Неопределено Тогда
		
		// Если есть заказы:
		//  Выводим команду на создание корректировки перемещения, которое надо уменьшить. (КнопкаИзменений).
		//  Выводим заказ на перемещение, в котором строки подлежат отмене. (КомандаГиперссылка ).
		// Если нет заказов:
		//  Выводим команду на создание корректировки перемещения, которое надо уменьшить. (КнопкаИзменений).
		
		Описание = Новый Структура;
		Описание.Вставить("ОснованиеАкта", СтрокаДействия.Основание);
		Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
		Описание.Вставить("ИмяКоманды", "Оформить");
		Описание.Вставить("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется);
		Описание.Вставить("СпособОтражения", СпособОтраженияРасхождений);
		
		ВывестиКорректировкуПеремещенияТоваров(
			СтрокаДействия,
			Макет,
			Описание);
			
		Если СтрокаДействия.ПоЗаказам Тогда
			ТабличныйДокумент.НачатьГруппуСтрок();
			
			Описание = Новый Структура;
			Описание.Вставить("ОснованиеАкта", СтрокаДействия.Основание);
			Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
			Описание.Вставить("ИмяКоманды", "Оформить");
			Описание.Вставить("ВариантДействия", Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется);
			Описание.Вставить("СпособОтражения", СпособОтраженияРасхождений);
			
			ВывестиДокументЗаказНаПеремещение(СтрокаДействия, Макет, Описание);
			ТабличныйДокумент.ЗакончитьГруппуСтрок();
		КонецЕсли;
			
	КонецЕсли;

	Если Не ИспользоватьИсправлениеДокументов
		И СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного) <> Неопределено Тогда
		
		// Создание нового перемещения на товары сверх заказа (КомандаГиперссылка)
		// Оформление перемещения на возврат переперемещенного. (КомандаГиперссылка).
		
		Описание = Новый Структура;
		Описание.Вставить("ОснованиеАкта",    СтрокаДействия.Основание);
		Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
		Описание.Вставить("ИмяКоманды",       "Изменить");
		Описание.Вставить("ВариантДействия",  Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного);
		Описание.Вставить("СпособОтражения",  СпособОтраженияРасхождений);
		
		ВывестиИсправлениеПеремещенияТоваров(
			СтрокаДействия,
			Макет,
			Описание);
			
		Описание = Новый Структура;
		Описание.Вставить("ОснованиеАкта",        СтрокаДействия.Основание);
		Описание.Вставить("АктОРасхождениях",     АктОРасхождениях);
		Описание.Вставить("ИмяКоманды",           "Оформить");
		Описание.Вставить("ВариантДействия",      Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного);
		Описание.Вставить("СпособОтражения",      СпособОтраженияРасхождений);
		Описание.Вставить("ПеремещениеНаВозврат", Истина);
			
		ВывестиДокументПеремещениеТоваров(СтрокаДействия, Макет, Описание, Истина);
		
	КонецЕсли;

	Если ИспользоватьИсправлениеДокументов
		И СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного) <> Неопределено Тогда
		
		// Выводим команду на создание корректировки перемещения, которое надо увеличить (КнопкаИзменений).
		// Оформление перемещения на возврат переперемещенного. (КомандаГиперссылка).
		
		Описание = Новый Структура;
		Описание.Вставить("ОснованиеАкта",    СтрокаДействия.Основание);
		Описание.Вставить("АктОРасхождениях", АктОРасхождениях);
		Описание.Вставить("ИмяКоманды",       "Оформить");
		Описание.Вставить("ВариантДействия",  Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного);
		Описание.Вставить("СпособОтражения",  СпособОтраженияРасхождений);
		
		ВывестиКорректировкуПеремещенияТоваров(
			СтрокаДействия,
			Макет,
			Описание);
			
		Описание = Новый Структура;
		Описание.Вставить("ОснованиеАкта",        СтрокаДействия.Основание);
		Описание.Вставить("АктОРасхождениях",     АктОРасхождениях);
		Описание.Вставить("ИмяКоманды",           "Оформить");
		Описание.Вставить("ВариантДействия",      Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного);
		Описание.Вставить("СпособОтражения",      СпособОтраженияРасхождений);
		Описание.Вставить("ПеремещениеНаВозврат", Истина);
			
		ВывестиДокументПеремещениеТоваров(СтрокаДействия, Макет, Описание, Истина, ИспользоватьИсправлениеДокументов);
		
	КонецЕсли;

	Если Не ИспользоватьИсправлениеДокументов
		И СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного) <> Неопределено Тогда
		
		//  Выводим перемещение, которое надо увеличить (КнопкаИзменений).
		
		Описание = Новый Структура;
		Описание.Вставить("ОснованиеАкта",        СтрокаДействия.Основание);
		Описание.Вставить("АктОРасхождениях",     АктОРасхождениях);
		Описание.Вставить("ИмяКоманды",           "Изменить");
		Описание.Вставить("ВариантДействия",      Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного);
		Описание.Вставить("СпособОтражения",      СпособОтраженияРасхождений);
		
		ВывестиИсправлениеПеремещенияТоваров(СтрокаДействия, Макет, Описание);
		
	КонецЕсли;
	
	Если ИспользоватьИсправлениеДокументов
		И СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного) <> Неопределено Тогда
		
		//  Выводим перемещение, которое надо увеличить (КнопкаИзменений).
		
		Описание = Новый Структура;
		Описание.Вставить("ОснованиеАкта",        СтрокаДействия.Основание);
		Описание.Вставить("АктОРасхождениях",     АктОРасхождениях);
		Описание.Вставить("ИмяКоманды",           "Оформить");
		Описание.Вставить("ВариантДействия",      Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного);
		Описание.Вставить("СпособОтражения",      СпособОтраженияРасхождений);
		
		ВывестиКорректировкуПеремещенияТоваров(СтрокаДействия, Макет, Описание);
		
	КонецЕсли;
	
    #Удаление
	Если СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана) <> Неопределено Тогда
		
		Если ПраваДоступаНаТаблицы.ЧтениеСписаниеНедостачТоваров Тогда
			
			Описание = СтруктурыОписанияВыводимогоВОтчетДействия();
			
			Описание.ОснованиеАкта    = СтрокаДействия.Основание;
			Описание.АктОРасхождениях = АктОРасхождениях;
			Описание.ИмяКоманды       = "Оформить";
			Описание.ВариантДействия  = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана;
			Описание.СпособОтражения  = СпособОтраженияРасхождений;
			
			ВывестиДокументСписаниеНедостачТоваровПеремещениеТоваров(СтрокаДействия, Макет, Описание);
			
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДействия.ВариантыДействий.НайтиПоЗначению(Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПерепоставленноеДарится) <> Неопределено Тогда
		
		Если ПраваДоступаНаТаблицы.ЧтениеОприходованиеИзлишковТоваров Тогда
			
			Описание = СтруктурыОписанияВыводимогоВОтчетДействия();
			
			Описание.ОснованиеАкта    = СтрокаДействия.Основание;
			Описание.АктОРасхождениях = АктОРасхождениях;
			Описание.ИмяКоманды       = "Оформить";
			Описание.ВариантДействия  = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПерепоставленноеДарится;
			Описание.СпособОтражения  = СпособОтраженияРасхождений;
			
			ВывестиДокументОприходованиеИзлишковПеремещениеТоваров(СтрокаДействия, Макет, Описание);
			
		КонецЕсли;
	КонецЕсли;
    #КонецУдаления
КонецПроцедуры

&НаСервере
&Вместо("ТекстШапки")
Функция Док_ТекстШапки(ТипДокумента, Описание, ХозяйственнаяОперация)
	
	Если ТипДокумента = "КорректировкаРеализации" Тогда
		Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ИсправлениеОшибок Тогда
			ТекстШапки = НСтр("ru = 'Документ ""Корректировка реализации (исправление ошибок)""'");
		ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон Тогда
			ТекстШапки = НСтр("ru = 'Документ ""Корректировка реализации (по согласованию сторон)""'");
		ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПерепоставленногоТовара Тогда
			ТекстШапки = НСтр("ru = 'Документ ""Корректировка реализации (реализация перепоставленного товара)""'");
		ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратНедопоставленногоТовара Тогда
			ТекстШапки = НСтр("ru = 'Документ ""Корректировка реализации (возврат недопоставленного товара)""'");
		КонецЕсли;
	ИначеЕсли ТипДокумента = "ПорчаТоваров" Тогда
		ПредставлениеОбъекта = НСтр("ru = 'Порча товаров'");
		ТекстШапки = СтрШаблон(НСтр("ru = 'Документ ""%1"" '"), ПредставлениеОбъекта);
	ИначеЕсли ТипДокумента = "КорректировкаПриобретения" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Корректировка поступления""'");
	ИначеЕсли ТипДокумента = "ИсправлениеРеализации" Тогда
		ТекстШапки = НСтр("ru = 'Отразить расхождения в документе ""Реализация товаров и услуг""'");
	ИначеЕсли ТипДокумента = "ИсправлениеВозвратаТоваровПоставщику" Тогда
		ТекстШапки = НСтр("ru = 'Отразить расхождения в документе ""Возврат товаров поставщику""'");
	ИначеЕсли ТипДокумента = "ОтгрузкаТоваровСХранения" Тогда
			ПредставлениеОбъекта = НСтр("ru = 'Отгрузка товаров с хранения'");
		ТекстШапки = СтрШаблон(НСтр("ru = 'Документ ""%1"" для довозврата недовозращенного товара'"), ПредставлениеОбъекта);
	ИначеЕсли ТипДокумента = "ОтгрузкаТоваровСХраненияПоПриемке" Тогда
			ПредставлениеОбъекта = НСтр("ru = 'Отгрузка товаров с хранения'");
		ТекстШапки = СтрШаблон(НСтр("ru = 'Документ ""%1"" для возврата перепоставленного товара'"), ПредставлениеОбъекта);
	ИначеЕсли ТипДокумента = "ИсправлениеОтгрузкаТоваровСХранения" Тогда
			ПредставлениеОбъекта = НСтр("ru = 'Отгрузка товаров с хранения'");
		ТекстШапки = СтрШаблон(НСтр("ru = 'Отразить расхождения в документе ""%1""'"), ПредставлениеОбъекта);
	ИначеЕсли ТипДокумента = "ИсправлениеПередачи" Тогда
		Обработчик = Документы.ПередачаТоваровХранителю.ОбработчикДействий(ХозяйственнаяОперацияАкта);
		ТекстШапки = СтрШаблон(НСтр("ru = 'Отразить расхождения в документе ""%1""'"), Обработчик.ПредставлениеОбъекта());
	ИначеЕсли ТипДокумента = "ИсправлениеПередачиНаКомиссию" Тогда
		ТекстШапки = НСтр("ru = 'Отразить расхождения в документе ""Передача на комиссию""'");
	ИначеЕсли ТипДокумента = "ПередачаТоваровХранителю" Тогда
		Обработчик = Документы.ПередачаТоваровХранителю.ОбработчикДействий(ХозяйственнаяОперацияАкта);
		ТекстШапки = СтрШаблон(НСтр("ru = 'Документ ""%1"" для передачи недопоставленного товара'"), Обработчик.ПредставлениеОбъекта());
	ИначеЕсли ТипДокумента = "ПередачаТоваровНаКомиссию" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Передача товаров на комиссию"" для передачи недопоставленного товара'");
	ИначеЕсли ТипДокумента = "ПриемкаТоваровНаХранениеДопоставкаПоПриемке" Тогда
			ПредставлениеОбъекта = НСтр("ru = 'Приемка товаров на хранение'");
		ТекстШапки = СтрШаблон(НСтр("ru = 'Документ ""%1"" для поступления недопоставленного товара'"), ПредставлениеОбъекта);
	ИначеЕсли ТипДокумента = "ПриемкаТоваровНаХранение" Тогда
			ПредставлениеОбъекта = НСтр("ru = 'Приемка товаров на хранение'");
		ТекстШапки = СтрШаблон(НСтр("ru = 'Документ ""%1"" для поступления перепоставленного товара'"), ПредставлениеОбъекта);
	ИначеЕсли ТипДокумента = "ИсправлениеВозвратаТоваровОтХранителя" Тогда
		Обработчик = Документы.ПоступлениеТоваровОтХранителя.ОбработчикДействий(ХозяйственнаяОперацияАкта);
		ТекстШапки = СтрШаблон(НСтр("ru = 'Отразить расхождения в документе ""%1""'"), Обработчик.ПредставлениеОбъекта());
	ИначеЕсли ТипДокумента = "ИсправлениеВозвратаОтКомиссионера" Тогда
		ТекстШапки = НСтр("ru = 'Отразить расхождения в документе ""Поступление товаров от комиссионера""'");
	ИначеЕсли ТипДокумента = "ВозвратТоваровОтХранителяДовозврат" Тогда
		Обработчик = Документы.ПоступлениеТоваровОтХранителя.ОбработчикДействий(ХозяйственнаяОперацияАкта);
		ТекстШапки = СтрШаблон(НСтр("ru = 'Документ ""%1"" по недовозвращенным товарам'"), Обработчик.ПредставлениеОбъекта());
	ИначеЕсли ТипДокумента = "ВозвратТоваровОтКомиссионераДовозврат" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Поступление товаров от комиссионера"" по недовозвращенным товарам'");
	ИначеЕсли ТипДокумента = "ВозвратТоваровОтХранителяВозвратХранителю" Тогда
		ПредставлениеДокумента = НСтр("ru = 'Передача товаров хранителю'");
		Если ХозяйственнаяОперацияАкта = Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5 Тогда
			ПредставлениеДокумента = НСтр("ru = 'Передача сырья переработчику'");
		КонецЕсли;
		ТекстШапки = СтрШаблон(НСтр("ru = 'Документ ""%1"" по излишне возвращенным товарам'"), ПредставлениеДокумента);
	ИначеЕсли ТипДокумента = "ВозвратТоваровОтКомиссионераВозвратКомиссионеру" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Передача товаров комиссионеру"" по излишне возвращенным товарам'");
	ИначеЕсли ТипДокумента = "ИсправлениеВозвратаТоваровОтКлиента" Тогда
		ТекстШапки = НСтр("ru = 'Отразить расхождения в документе ""Возврат товаров от клиента""'");
	ИначеЕсли ТипДокумента = "ИсправлениеПеремещенияТоваров" Тогда
		ТекстШапки = НСтр("ru = 'Отразить расхождения в документе ""Перемещение товаров""'");
	ИначеЕсли ТипДокумента = "КорректировкаПеремещенияТоваров" Тогда
		ТекстШапки = НСтр("ru = 'Ввести корректировку документа ""Перемещение товаров""'");
	ИначеЕсли ТипДокумента = "ДокументВозврата" Тогда
		Если ИспользоватьЗаявкиНаВозврат Тогда
			ТекстШапки = НСтр("ru = 'Документ ""Заявка на возврат товаров от клиента"" по перепоставленным товарам к возврату'");
		Иначе
			ТекстШапки = НСтр("ru = 'Документ ""Возврат товаров от клиента"" по перепоставленным товарам к возврату'");
		КонецЕсли;
	ИначеЕсли ТипДокумента = "ДокументВозвратаПередачи" Тогда
		Если ИспользоватьЗаявкиНаВозврат
		   Тогда
			ТекстШапки = НСтр("ru = 'Документ ""Заявка на возврат товаров от клиента"" по перепоставленным товарам к возврату'");
		Иначе
			ТекстШапки = НСтр("ru = 'Документ ""Поступление товаров от хранителя"" по перепоставленным товарам к возврату'");
		КонецЕсли;
	ИначеЕсли ТипДокумента = "ДокументВозвратаКомиссионера" Тогда
		Если ИспользоватьЗаявкиНаВозврат Тогда
			ТекстШапки = НСтр("ru = 'Документ ""Заявка на возврат товаров от комиссионера"" по перепоставленным товарам к возврату'");
		Иначе
			ТекстШапки = НСтр("ru = 'Документ ""Поступление товаров от комиссионера"" по перепоставленным товарам к возврату'");
		КонецЕсли;
	ИначеЕсли ТипДокумента = "ВозвратТоваровОтКлиентаДовозврат" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Возврат товаров от клиента"" по недовозвращенным товарам'");
	ИначеЕсли ТипДокумента = "ЗаказКлиента" Тогда
		ТекстШапки = НСтр("ru = 'Отменить строки документов ""Заказ клиента"" по недопоставленным товарам'");
	ИначеЕсли ТипДокумента = "ЗаказПоставщику" Тогда
		ТекстШапки = НСтр("ru = 'Отменить строки документов ""Заказ поставщику"" по недопоставленным товарам'");
	ИначеЕсли ТипДокумента = "ЗаказНаПеремещение" Тогда
		ТекстШапки = НСтр("ru = 'Отменить строки документов ""Заказ на перемещение"" по недопоставленным товарам'");
	ИначеЕсли ТипДокумента = "ЗаказПередачи" Тогда
		Обработчик = Документы.ПередачаТоваровХранителю.ОбработчикДействий(ХозяйственнаяОперацияАкта);	
		ТекстШапки = СтрШаблон(НСтр("ru = 'Отменить строки документов ""%1"" по недопоставленным товарам'"), Обработчик.СинонимЗаказа());
	ИначеЕсли ТипДокумента = "ИсправлениеЗаявкаНаВозвратТоваров" Тогда
		ТекстШапки = НСтр("ru = 'Отменить строки документов ""Заявка на возврат товаров от клиента"" по недостачам при возврате'");
	ИначеЕсли ТипДокумента = "ИсправлениеЗаявкаНаВозвратТоваровПередачи" Тогда
		Обработчик = Документы.ПоступлениеТоваровОтХранителя.ОбработчикДействий(ХозяйственнаяОперацияАкта);
		ТекстШапки = СтрШаблон(НСтр("ru = 'Отменить строки документов ""%1"" по недостачам при возврате'"), Обработчик.СинонимЗаказа());
	ИначеЕсли ТипДокумента = "ИсправлениеЗаявкаНаВозвратОтКомиссионера" Тогда
		ТекстШапки = НСтр("ru = 'Отменить строки документов ""Заявка на возврат товаров от комиссионера"" по недостачам при возврате'");
	ИначеЕсли ТипДокумента = "РеализацияТоваровИУслуг" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Реализация товаров и услуг"" для реализации недопоставленного товара'");
	ИначеЕсли ТипДокумента = "РеализацияТоваровИУслугПоВозвратуОтКлиента" Тогда 
		ТекстШапки = НСтр("ru = 'Документ ""Реализация товаров и услуг"" для реализации излишков возврата от клиента'");
	ИначеЕсли ТипДокумента = "ВозвратТоваровПоставщику" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Возврат товаров поставщику"" для довозврата недовозращенного товара'");
	ИначеЕсли ТипДокумента = "ПриобретениеТоваровУслуг" Тогда 
		ТекстШапки = НСтр("ru = 'Документ ""Приобретение товаров и услуг"" для поступления перепоставленного товара'");
	ИначеЕсли ТипДокумента = "ПриобретениеТоваровУслугДопоставкаПоПоступлению" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Приобретение товаров и услуг"" для поступления недопоставленного товара'");
	ИначеЕсли ТипДокумента = "ПоступлениеТоваровДопоставкаПоПоступлению" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Поступление товаров"" для поступления недопоставленного товара'");
	ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Перемещение товаров"" на допоставку недопоставленного товара'");
	ИначеЕсли ТипДокумента = "ПеремещениеТоваровВозврат" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Перемещение товаров"" на возврат перепоставленного товара'");
	ИначеЕсли ТипДокумента = "СписаниеНедостачТоваров" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Списание недостач товаров"" для списания непризнанных недостач'");
	ИначеЕсли ТипДокумента = "КорректировкаЗадолженности" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Корректировка задолженности"" для отражения задолженности сторонней компании'");
	ИначеЕсли ТипДокумента = "ОприходованиеИзлишковТоваров" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Оприходование излишков товаров"" для оприходования излишков поставленных товаров'");
	ИначеЕсли ТипДокумента = "ИсправлениеПоступления" Тогда
		ТекстШапки = НСтр("ru = 'Отразить расхождения в документе ""Приобретение товаров и услуг""'");
	ИначеЕсли ТипДокумента = "ИзменениеПоступленияТоваров" Тогда
		ТекстШапки = НСтр("ru = 'Отразить расхождения в документе ""Поступление товаров на склад""'");
	ИначеЕсли ТипДокумента = "КорректировкаПоступленияТоваров" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Поступление товаров на склад""'");
	ИначеЕсли ТипДокумента = "КорректировкаПоступленияТоваровИсправления" Тогда
		ТекстШапки = НСтр("ru = 'Ввести корректировку документа ""Поступление товаров на склад""'");
	ИначеЕсли ТипДокумента = "ИсправлениеПриемкиТоваровНаХранение" Тогда
			ПредставлениеОбъекта = НСтр("ru = 'Приемка товаров на хранение'");
		ТекстШапки = СтрШаблон(НСтр("ru = 'Отразить расхождения в документе ""%1""'"), ПредставлениеОбъекта);
	ИначеЕсли ТипДокумента = "ВозвратТоваровПоставщикуПоПоступлению" Тогда
		ТекстШапки = НСтр("ru = 'Документ ""Возврат товаров поставщику"" для возврата перепоставленного товара'");
	КонецЕсли;
	
	Если ТипДокумента = "СписаниеНедостачТоваров"
		Или ТипДокумента = "ОприходованиеИзлишковТоваров"   
		Или ТипДокумента = "ПоступлениеТоваровДопоставкаПоПоступлению"
		Или ТипДокумента = "ОтгрузкаТоваровСХраненияПоПриемке"
		Или ТипДокумента = "ВозвратТоваровПоставщикуПоПоступлению" Тогда
		
		Если Описание.ВыводитьСклад Тогда
			
			СтрокаСклад = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'для склада ""%1"".'"), Описание.Склад);
			ТекстШапки = ТекстШапки + " " + СтрокаСклад;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипДокумента = "ЭлектронныйДокументПодтверждение" Тогда
		ТекстШапки = НСтр("ru = 'Подтвердить полученный электронный документ'");
	ИначеЕсли ТипДокумента = "ЭлектронныйДокументОтклонение" Тогда
		ТекстШапки = НСтр("ru = 'Отклонить полученный электронный документ'");	
	КонецЕсли;
	
	Возврат ТекстШапки;
	
	Результат = ПродолжитьВызов(ТипДокумента, Описание, ХозяйственнаяОперация);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Док_ТабличныйДокументВыборПосле(Элемент, Область, СтандартнаяОбработка)
	
	Если ТипЗнч(Область.Расшифровка) = Тип("Структура") 
		И Область.Расшифровка.ИмяКоманды = "Оформить"
		И ТипЗнч(Область.Расшифровка.Описание) = Тип("Структура")
	Тогда
		Описание = Область.Расшифровка.Описание;
		
		Если Описание.Свойство("ВозможноОформлениеПорчи") Тогда
			
			ОснованиеАкта = Описание.ОснованиеАкта;
			ЭтаФорма_ID = ЭтаФорма.УникальныйИдентификатор;
			ТипДокумента = ТипЗнч(Область.Расшифровка.Данные.ОформляемыйДокумент);
			
			ЭтоПорча = ТипДокумента = Тип("ДокументСсылка.ПорчаТоваров");
			ЭтоОприходование = ТипДокумента = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров");
			ЭтоСписание = ТипДокумента = Тип("ДокументСсылка.СписаниеНедостачТоваров");
			
			
			СоответствиеДанных = Новый Соответствие;
			СоответствиеДанных.Вставить("Порча товаров (создание)", Тип("ДокументСсылка.ПорчаТоваров"));
			СоответствиеДанных.Вставить("Оприходование излишков товаров (создание)", Тип("ДокументСсылка.ОприходованиеИзлишковТоваров"));
			СоответствиеДанных.Вставить("Списание недостач товаров (создание)", Тип("ДокументСсылка.СписаниеНедостачТоваров"));
			
			ОткрытыеОкна = ПолучитьОкна();
			
			Для Каждого ОкноФормы Из ОткрытыеОкна Цикл
				
				Если СоответствиеДанных.Получить(ОкноФормы.Заголовок) <> ТипДокумента Тогда
					Продолжить;
				КонецЕсли;
				
				СодержимоеФормы = ОкноФормы.ПолучитьСодержимое();
				
				Если СодержимоеФормы <> Неопределено
					И СодержимоеФормы.ВладелецФормы <> Неопределено
					И СодержимоеФормы.ВладелецФормы.УникальныйИдентификатор = ЭтаФорма_ID 
					И Не ЗначениеЗаполнено(СодержимоеФормы.Объект.Ссылка) 
				Тогда
				
				    ДокОбъект = СодержимоеФормы.Объект;
					ТЧТовары = ДокОбъект.Товары;
					
					Если ЭтоОприходование Тогда
						Док_СвернутьСтрокиДляОприходования();
						ТаблицаИсточник = ТаблицаСтрокДляОприходования;
					Иначе
						ТаблицаИсточник = ТаблицаСтрокДляПорчи;
					КонецЕсли;
					
					ОтборОснование = Новый Структура("Основание", ОснованиеАкта);
					НайденныеСтроки = ТаблицаИсточник.НайтиСтроки(ОтборОснование);
					
					Если НайденныеСтроки.Количество() Тогда
						
						Если ЭтоПорча Тогда
							ЗаполнитьЗначенияСвойств(ДокОбъект, ПолучитьСтруктуруДанныхИзАкта());
							ТЧТовары.Очистить();
						КонецЕсли;
						
						Для каждого СтрокаТаблицы Из НайденныеСтроки Цикл
							
							Если ЭтоПорча И ОкноФормы.Заголовок = "Порча товаров (создание)" И СтрокаТаблицы.ОстатокПорча > 0 Тогда
								
								ТЧТоварыНоваяСтрока = ТЧТовары.Добавить();
								ЗаполнитьЗначенияСвойств(ТЧТоварыНоваяСтрока, СтрокаТаблицы);
								ТЧТоварыНоваяСтрока.Количество = СтрокаТаблицы.ОстатокПорча;
								
							ИначеЕсли ЭтоОприходование ИЛИ ЭтоСписание Тогда
								
								ДополнениеИмениКолонки = "";
								ИмяКолонкиОстатка = "Остаток";
								КоличествоПоСтроке = 0;
								
								Если ЭтоОприходование Тогда
									ДополнениеИмениКолонки = "Оприходование";
									ИмяКолонкиОстатка = ИмяКолонкиОстатка + ДополнениеИмениКолонки;
									КоличествоПоСтроке = СтрокаТаблицы.ОстатокОприходование;
								Иначе
									ИмяКолонкиОстатка = ИмяКолонкиОстатка + "Списание";
									КоличествоПоСтроке = СтрокаТаблицы.ОстатокСписание;
								КонецЕсли;
								
								СтруктураОтбора = Новый Структура;
								СтруктураОтбора.Вставить("Номенклатура", СтрокаТаблицы["Номенклатура" + ДополнениеИмениКолонки]);
								СтруктураОтбора.Вставить("Характеристика", СтрокаТаблицы["Характеристика" + ДополнениеИмениКолонки]);
								СтруктураОтбора.Вставить("Назначение", СтрокаТаблицы["Назначение" + ДополнениеИмениКолонки]);
								СтруктураОтбора.Вставить("Серия", СтрокаТаблицы["Серия" + ДополнениеИмениКолонки]);
								
								НайденныеСтроки = ТЧТовары.НайтиСтроки(СтруктураОтбора);
								
								Если НайденныеСтроки.Количество() > 0 Тогда
									Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
										Если СтрокаТаблицы[ИмяКолонкиОстатка] = 0 Тогда
											ТЧТовары.Удалить(НайденнаяСтрока);
										Иначе
											НайденнаяСтрока.Количество = КоличествоПоСтроке;	
										КонецЕсли;
										
									КонецЦикла;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
					Если ЭтоОприходование И ЗначениеЗаполнено(ДокОбъект.ВидЦены) И ТЧТовары.Количество() > 0 Тогда
						ЗаполнитьЦеныДляОприходования(ДокОбъект);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док_СвернутьСтрокиДляОприходования()
	
	ТаблицаСтрок = ТаблицаСтрокДляПорчи.Выгрузить();
	ТаблицаСтрок.Свернуть("НоменклатураОприходование, ХарактеристикаОприходование, 
							|НазначениеОприходование, СерияОприходование, Основание", "ОстатокОприходование");
							
	ТаблицаСтрокДляОприходования.Загрузить(ТаблицаСтрок);
							
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныДляОприходования(Объект)
	ПараметрыЗаполнения = Новый Структура;
	КолонкиПоЗначению = Новый Структура("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	
	ПараметрыЗаполнения.Вставить("Дата",				Объект.Дата);
	ПараметрыЗаполнения.Вставить("Валюта",				Объект.Валюта);
	ПараметрыЗаполнения.Вставить("ВидЦены",				Объект.ВидЦены);
	ПараметрыЗаполнения.Вставить("КолонкиПоЗначению",	КолонкиПоЗначению);
	
	СтруктураДействий = Новый Структура("ПересчитатьСумму", "Количество");
	
	ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(Объект.Товары,,ПараметрыЗаполнения,СтруктураДействий);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДанныхИзАкта()
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Дата", ТекущаяДата());
	СтруктураДанных.Вставить("Организация", АктОРасхождениях.Организация);
	СтруктураДанных.Вставить("АналитикаРасходов", АктОРасхождениях.Подразделение);
	СтруктураДанных.Вставить("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0А-000659"));
	
	Возврат СтруктураДанных;
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруОтбораСтрок(СтрокаОтбора, ТипДокумента)
	ДополнениеИмениКолонки = "";
	Если ТипДокумента = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда
		ДополнениеИмениКолонки = "Оприходование";
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Номенклатура", СтрокаОтбора["Номенклатура" + ДополнениеИмениКолонки]);
	СтруктураОтбора.Вставить("Характеристика", СтрокаОтбора["Характеристика" + ДополнениеИмениКолонки]);
	СтруктураОтбора.Вставить("Назначение", СтрокаОтбора["Назначение" + ДополнениеИмениКолонки]);
	СтруктураОтбора.Вставить("Серия", СтрокаОтбора["Серия" + ДополнениеИмениКолонки]);
	
	Возврат СтруктураОтбора;
КонецФункции


