&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьЭлементовФорм();
	ЗаполнитьПоказателиОстаткаТоплива();    
	
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры      

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды     

&НаСервере
Процедура ВидимостьЭлементовФорм()
	Элементы.ГруппаСпидометр.Видимость=Объект.ТранспортноеСредство.УчитыватьПоказанияСпидометра;
	//Элементы.ГруппаДвижениеГорючего.Видимость=Объект.Водитель.УчитыватьОстатокТоплива;
	Элементы.ГруппаОстатокГорючего.Видимость=Объект.Водитель.УчитыватьОстатокТоплива;
	Элементы.ГруппаОбновитьГСМ.Видимость=Объект.Водитель.УчитыватьОстатокТоплива;
	Элементы.СпидометрВозвращение.ТолькоПросмотр=не Объект.ИзменитьПоказания;
КонецПроцедуры
&НаСервере
Процедура ПересчетПоказателейНаСервере(режим=0)
	если Режим =1 тогда
		Объект.СпидометрНачало=Документы.ПутевойЛист.ПоказаниеСпидометра(Объект,Объект.ТранспортноеСредство);	
	конецесли;
	Объект.СпидометрВозвращение=Объект.СпидометрНачало+Объект.Маршруты.Итог("Пройдено");
	Объект.РасходПоНорме=Объект.НормаРасхода*Объект.ТранспортноеСредство.СпидометрСчетчик/100*Объект.Маршруты.Итог("Пройдено");
	Объект.РасходФактический=Объект.РасходПоНорме;
КонецПроцедуры
&НаКлиенте
Процедура МаршрутыПройденоПриИзменении(Элемент)
	ПересчетПоказателейНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ПодставитьЗначения();
КонецПроцедуры
&НаСервере
Процедура ПодставитьЗначения()
	Объект.ТранспортноеСредство="";
	Объект.Топливо="";
	Объект.НормаРасхода=0;
	Объект.ТранспортноеСредство=ДопМодуль.ТранспортноеСредство(Объект.Водитель);
	если не ЗначениеЗаполнено(Объект.Механик) тогда
		Объект.Механик=Объект.ТранспортноеСредство.Механик;
	конецесли;	
	ПриИзмененииТСНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ТранспортноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	стандартнаяОбработка=ложь;
	если ЗНАЧЕНИЕЗАПОЛНЕНО(Объект.Водитель) тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ДопМодуль.СписокТранспортныхСредств(Объект.Водитель));
		если ДанныеВыбора.Количество()=0 тогда
			ТекстСообщения = НСтр("ru='За водителем %ФИО% не закреплено ни одного транспортного средства!'");
			ТекстСообщения=СтрЗаменить(ТекстСообщения,"%ФИО%",Объект.Водитель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			Объект.Ссылка,
			);
		конецесли;	
		
	иначе
		ТекстСообщения = НСтр("ru='Не заполнен водитель транспортного средства!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,
		Объект.Ссылка,
		);
	конецесли;	
	
КонецПроцедуры
&НаКлиенте
Процедура ТопливоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	стандартнаяОбработка=ложь;
	если ЗНАЧЕНИЕЗАПОЛНЕНО(Объект.транспортноесредство) тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ДопМодуль.СписокноменклатурыТоплива(объект.ТранспортноеСредство,Объект.Дата));
		если ДанныеВыбора.Количество()=0 тогда
			ТекстСообщения = НСтр("ru='Для транспортного средства %ТС% не введены нормы расхода топлива на дату %Дата%'");
			ТекстСообщения=СТРЗАМЕНИТЬ(ТекстСообщения,"%ТС%",Объект.транспортноесредство);
			ТекстСообщения=СТРЗАМЕНИТЬ(ТекстСообщения,"%Дата%",Объект.Дата);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			Объект.Ссылка,
			);
		конецесли;	
		
	иначе
		ТекстСообщения = НСтр("ru='Не заполнено транспортное средство!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,
		Объект.Ссылка,
		);
		
	конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказанияСчетчика(Команда)
	ПересчетПоказателейНаСервере(1);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПоказанияПриИзменении(Элемент)
	ВидимостьЭлементовФорм();	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьПоказателиОстаткаТоплива()
	если Объект.Водитель.УчитыватьОстатокТоплива тогда
		Объект.ОстатокПриВыезде=Документы.ПутевойЛист.ОстатокГСМ(Объект,Объект.Водитель.СкладТоплива,Объект.Топливо);
		ПересчетОстаткаТоплива();
	конецесли;	
КонецПроцедуры
&НаСервере
Процедура ПересчетОстаткаТоплива()
	Объект.ОстатокПриВозвращении=Объект.ОстатокПриВыезде-Объект.РасходФактический;
КонецПроцедуры
&НаКлиенте
Процедура РасходФактическийПриИзменении(Элемент)
	ПересчетОстаткаТоплива();
КонецПроцедуры
&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ПриИзмененииТСНаСервере();	
КонецПроцедуры
&НаКлиенте
Процедура ТопливоПриИзменении(Элемент)
	УстановитьНормуРасхода();
	ЗаполнитьПоказателиОстаткаТоплива();
КонецПроцедуры
&НаСервере
Процедура УстановитьНормуРасхода()
	Объект.НормаРасхода=0;
	Объект.НормаРасхода=ДопМодуль.ПолучитьНормуРасхода(Объект);
КонецПроцедуры
&НаСервере
Процедура ПриИзмененииТСНаСервере()
	Объект.Топливо="";
	Объект.НормаРасхода=0;

	ДанныеТоплива=ДопМодуль.ТопливоПоРасходу(Объект.ТранспортноеСредство);
	если ДанныеТоплива<>НЕОПРЕДЕЛЕНО тогда
		Объект.Топливо=ДанныеТоплива;
		Объект.НормаРасхода=ДопМодуль.ПолучитьНормуРасхода(Объект);
	конецесли;	
КонецПроцедуры


&НаКлиенте
Процедура МаршрутыПослеУдаления(Элемент)
ПересчетПоказателейНаСервере(1);	
КонецПроцедуры


&НаКлиенте
Процедура МаршрутыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ПересчетПоказателейНаСервере(1);	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОстаткиГСМ(Команда)
ЗаполнитьПоказателиОстаткаТоплива();	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьНормуРасхода();
КонецПроцедуры

