&НаКлиенте 
Перем НужноЗакрыватьФорму; 
&НаКлиенте 
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка) 
	Если НЕ НужноЗакрыватьФорму = Истина Тогда
	    Отказ = Истина; 
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, "Вы действительно хотите закрыть окно?", РежимДиалогаВопрос.ДаНет); 
	КонецЕсли; 
КонецПроцедуры 
&НаКлиенте 
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да 
		Тогда НужноЗакрыватьФорму = Истина; 
		Закрыть(); 
	Иначе 
		НужноЗакрыватьФорму = Неопределено; 
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Процедура ГотовоНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НачатьТранзакцию();
		НовоеВзаимодействие = Документы.ТелефонныйЗвонок.СоздатьДокумент();
		СсылкаНового = Документы.ТелефонныйЗвонок.ПолучитьСсылку();
		НовоеВзаимодействие.УстановитьСсылкуНового(СсылкаНового);
		СсылкаНовогоВзаимодействия = НовоеВзаимодействие.ПолучитьСсылкуНового();
		НовоеВзаимодействие.Дата = ТекущаяДата();
		НовоеВзаимодействие.АбонентКонтакт = Клиент;
		НовоеВзаимодействие.АбонентКакСвязаться = СокрЛП(Телефон);
		ПредставлениеАбонента = СокрЛП(КонтактноеЛицо);
		Если ЗначениеЗаполнено(ПредставлениеАбонента) Тогда
			ПредставлениеАбонента = ПредставлениеАбонента + "("+СокрЛП(Клиент)+")";
		Иначе
			ПредставлениеАбонента = СокрЛП(Клиент);
		КонецЕсли;
		НовоеВзаимодействие.АбонентПредставление = ПредставлениеАбонента;
		НовоеВзаимодействие.Входящий = Истина;
		НовоеВзаимодействие.Тема = "Звонок в Call-центр";
		НовоеВзаимодействие.Описание = "Причины звонка: " + ПолучитьПричиныЗвонка();
		НовоеВзаимодействие.Автор = Пользователи.ТекущийПользователь();
		НовоеВзаимодействие.Записать(РежимЗаписиДокумента.Запись);
		
		СтруктураДляЗаписи = ВзаимодействияКлиентСервер.СтруктураРеквизитовВзаимодействияДляЗаписи(, СсылкаНовогоВзаимодействия, , , );
	
		ВзаимодействияВызовСервера.ЗаписьРегистрРеквизитыВзаимодействия(СсылкаНовогоВзаимодействия, СтруктураДляЗаписи);
        ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	Если Не (Заявка ИЛИ НаличиеЦена ИЛИ АктСверкиОплатаУточнить) Тогда
	Сообщить("Не выбрана ни одна причина звонка!");
Иначе
	ГотовоНаСервере();
	НужноЗакрыватьФорму = Истина;
	ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	НужноЗакрыватьФорму = Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Телефон = Параметры.НомерТелефона;
	Если ЗначениеЗаполнено(Параметры.СтруктураКлиентов) Тогда
		Клиент = Параметры.СтруктураКлиентов.Партнер;
		КонтактноеЛицо = Параметры.СтруктураКлиентов.КонтактноеЛицо;
		Контрагент = Параметры.СтруктураКлиентов.Контрагент;
	КонецЕсли;
	Заголовок = "Входящий звонок от " + Телефон;
КонецПроцедуры

&НаСервере
Функция ПолучитьПричиныЗвонка()
Причины = "";
Причины = ?(Заявка, "Заявка","");
Если ПустаяСтрока(Причины) Тогда
	Если НаличиеЦена Тогда
		Причины = "Наличие, цена";
	Иначе
		Причины = "";
	КонецЕсли;
Иначе
	Если НаличиеЦена Тогда
		Причины = Причины + "; Наличие, цена";
	КонецЕсли;
КонецЕсли;
Если ПустаяСтрока(Причины) Тогда
	Если АктСверкиОплатаУточнить Тогда
		Причины = "Акт-сверки, оплата, уточнить";
	Иначе
		Причины = "";
	КонецЕсли;
Иначе
	Если АктСверкиОплатаУточнить Тогда
		Причины = Причины + "; Акт-сверки, оплата, уточнить";
	КонецЕсли;
КонецЕсли;
Возврат Причины;
КонецФункции

&НаСервере
Процедура ИсправитьТелефонПозжеНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НоваяЗадача=Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.Автор = Пользователи.ТекущийПользователь();
		НоваяЗадача.Исполнитель = Пользователи.ТекущийПользователь();
		Новаязадача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
		Новаязадача.СрокИсполнения = ТекущаяДата()+86400;
		Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
			НоваяЗадача.Наименование = "Изменить номер " + СокрЛП(Телефон) +" у контактного лица " + СокрЛП(КонтактноеЛицо);
			НоваяЗадача.Предмет = КонтактноеЛицо.Ссылка;
		Иначе
			НоваяЗадача.Наименование = "Изменить номер " + СокрЛП(Телефон) +" у клиента " + СокрЛП(Клиент);
		    НоваяЗадача.Предмет = Клиент.Ссылка;
		КонецЕсли;
		НоваяЗадача.Описание = Комментарий;
		НоваяЗадача.Записать();
	Исключение
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьТелефонПозже(Команда)
	Если Не (Заявка ИЛИ НаличиеЦена ИЛИ АктСверкиОплатаУточнить) Тогда
	Сообщить("Не выбрана ни одна причина звонка!");
    Иначе
	ИсправитьТелефонПозжеНаСервере();
	ГотовоНаСервере();
	НужноЗакрыватьФорму = Истина;
	ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьТелефон(Команда)
		
	НомерТелефонаВБуферОбмена();
	
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда 
		ПараметрФормыПартнера = Новый Структура("Ключ", КонтактноеЛицо);
		ПолучитьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаОбъекта", ПараметрФормыПартнера).Открыть();
	Иначе
		ПараметрФормыПартнера = Новый Структура("Ключ", Клиент);
		ПолучитьФорму("Справочник.Партнеры.ФормаОбъекта", ПараметрФормыПартнера).Открыть();
	КонецЕсли;

	НужноЗакрыватьФорму = Истина;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент1Создание(Элемент, СтандартнаяОбработка)
	НомерТелефонаВБуферОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Заявка = Истина;
	НаличиеЦена=Истина;
	АктСверкиОплатаУточнить = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Заявка = Ложь;
	НаличиеЦена=Ложь;
	АктСверкиОплатаУточнить = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаВБуферОбмена()
	Телефон_ = Телефон;
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(Телефон_);
	HTML = Новый COMОбъект("htmlfile");
	HTML.parentWindow.clipboardData.setData("Text",Телефон_);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникПродаж(Команда)
  ФормаЗаписи = ПолучитьФорму("Обработка.ПомощникПродаж.Форма.Форма");
  СтруктураСвойств = Новый Структура;
  СтруктураСвойств.Вставить("Партнер",Клиент);
  ЗаполнитьЗначенияСвойств(ФормаЗаписи.Объект,СтруктураСвойств,"Партнер",);
  ФормаЗаписи.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказКлиента(Команда)
  ФормаЗаписи = ПолучитьФорму("Документ.ЗаказКлиента.Форма.ФормаДокумента");
  СтруктураСвойств = Новый Структура;
  СтруктураСвойств.Вставить("Партнер",Клиент);
  ЗаполнитьЗначенияСвойств(ФормаЗаписи.Объект,СтруктураСвойств,"Партнер",);
  ФормаЗаписи.Открыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьСоглашение()
КартаЛояльности = АльтерраОбщегоНазначения.ПолучитьКартуЛояльности(Клиент);
СоглашениеКлиента = АльтерраОбщегоНазначения.ПолучитьСоглашениеПоУмолчанию(Клиент,Неопределено,КартаЛояльности);
Возврат СоглашениеКлиента;
КонецФункции

&НаКлиенте
Процедура СкопироватьНомерТелефона(Команда)
	НомерТелефонаВБуферОбмена();
КонецПроцедуры



