&НаКлиенте
Процедура ВыборОбъектДоставки(Результат, ДопПараметры) Экспорт
	Объект.АдресНаПогрузке= Результат;
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьАдресПогрузки(Команда)

	ПараметрыФормы= Новый Структура("Владелец", Объект.Партнер);
	ОповещениеОвыборе= Новый ОписаниеОповещения("ВыборОбъектДоставки", ЭтотОбъект);
	ОткрытьФорму("Справочник.ОбъектыДоставки.Форма.Док_ФормаВыбораКарта", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОвыборе);
	
КонецПроцедуры

#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяНаВыгрузкеС);
	ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяНаВыгрузкеПо);
	ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяНаПогрузкеС);
	ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяНаПогрузкеПо);
	
	ОбновитьДинамическийСписок();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ИмеетПолныеПрава() Тогда
		Элементы.Организация.ТолькоПросмотр= Ложь;
		Элементы.Партнер.ТолькоПросмотр= Ложь;
		Элементы.Подразделение.ТолькоПросмотр= Ложь;
		Элементы.Контрагент.ТолькоПросмотр= Ложь;
	КонецЕсли;
	
	Элементы.Транзит.ТолькоПросмотр= ЗначениеЗаполнено(Объект.Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
	ОбновитьНадписи();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораАдреса(Результат, Параметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.АдресДоставки=  Результат.Представление;
		Объект.Широта=  Результат.Широта;
		Объект.Долгота=  Результат.Долгота;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьДоступность();
	ОбновитьНадписи();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура ОснованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьДанныеПоОснованиямНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПослеУдаления(Элемент)
	ОбновитьДанныеПоОснованиямНаСервере();
	ОбновитьНадписи();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаКарты Тогда
		ИнициализироватьКарту();
	Иначе
		ОбновитьДинамическийСписок();
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОбновитьДинамическийСписок()
	мОснование= Новый Массив;
	Для Каждого стрОснование Из Объект.Основания Цикл
		мОснование.Добавить(стрОснование.Документ);
	КонецЦикла;
	ГруппаУслугДоставки= АльтерраОбщегоНазначения.ПолучитьГруппуУслугДоставкиОбщую();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "МассивДокументов", мОснование, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Рейсы, "Ссылка", Объект.Ссылка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РейсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Документ= Элементы.Рейсы.ТекущиеДанные.Рейс;
	ОткрытьФорму("Документ.РейсОтПоставщика.ФормаОбъекта", Новый Структура("Ключ", Документ), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОтПоставщикаНаПогрузкеПриИзменении(Элемент)
	ИнтервалНаПогрузкеПриИзмененииСервер();
КонецПроцедуры
&НаСервере
Процедура ИнтервалНаПогрузкеПриИзмененииСервер()
	Если ЗначениеЗаполнено(Объект.ИнтервалНаПогрузке) Тогда
		Объект.ВремяНаПогрузкеС= Объект.ИнтервалНаПогрузке.ВремяС;
		Объект.ВремяНаПогрузкеПо= Объект.ИнтервалНаПогрузке.ВремяПО;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ИнтервалОтПоставщикаНаПогрузкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ПараметрыФормы= Новый Структура("Контрагент", Объект.Контрагент);
	ОповещениеОвыборе= Новый ОписаниеОповещения("ВыборИнтервалаНаПогрузке", ЭтотОбъект);
	ОткрытьФорму("Справочник.ИнтервалыДоставкиОтПоставщикаНаПогрузке.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОвыборе);
КонецПроцедуры
&НаКлиенте
Процедура ВыборИнтервалаНаПогрузке(Результат, ДопПараметры) Экспорт
	Объект.ИнтервалНаПогрузке= Результат;
	ИнтервалНаПогрузкеПриИзмененииСервер();
КонецПроцедуры





&НаКлиенте
Процедура ИнтервалОтПоставщикаНаВыгрузкеПриИзменении(Элемент)
	ИнтервалНаВыгрузкеПриИзмененииСервер();
КонецПроцедуры
&НаСервере
Процедура ИнтервалНаВыгрузкеПриИзмененииСервер()
	Если ЗначениеЗаполнено(Объект.ИнтервалНаВыгрузке) Тогда
		Объект.ВремяНаВыгрузкеС= Объект.ИнтервалНаВыгрузке.ВремяС;
		Объект.ВремяНаВыгрузкеПо= Объект.ИнтервалНаВыгрузке.ВремяПО;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ИнтервалОтПоставщикаНаВыгрузкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ПараметрыФормы= Новый Структура("Подразделение", Объект.Подразделение);
	ОповещениеОвыборе= Новый ОписаниеОповещения("ВыборИнтервалаНаВыгрузке", ЭтотОбъект);
	ОткрытьФорму("Справочник.ИнтервалыДоставкиОтПоставщикаНаВыгрузке.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОвыборе);
КонецПроцедуры
&НаКлиенте
Процедура ВыборИнтервалаНаВыгрузке(Результат, ДопПараметры) Экспорт
	Объект.ИнтервалНаВыгрузке= Результат;
	ИнтервалНаВыгрузкеПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПередНачаломИзменения(Элемент, Отказ)
	Отказ= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФилиалВыгрузкиПриИзменении(Элемент)
	Объект.АдресНаВыгрузке= АльтерраОбщегоНазначения.ПолучитьАдресФилиала(Объект.ФилиалВыгрузки);
КонецПроцедуры

&НаКлиенте
Процедура ТранзитПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры
#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПоказатьДвижения(Команда)
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", Новый Структура("Документ", Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОснование(Команда)
	ДокументОснование= Элементы.Основания.ТекущиеДанные.Документ;
	АльтерраОбщегоНазначенияКлиент.ОткрытьДокументПоступления(ДокументОснование, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСсылкуБитрикс(Команда)
	ОповещениеУстановитьСсылкуБитрикс= Новый ОписаниеОповещения("УстановитьСсылкуБитриксЗавершение", ЭтотОбъект);
	ПоказатьВводСтроки(ОповещениеУстановитьСсылкуБитрикс, "", "Вставьте ссылку на задачу в Битрикс24");
КонецПроцедуры
&НаКлиенте
Процедура УстановитьСсылкуБитриксЗавершение(СтрокаВвода, ДопПараметры) Экспорт
	Если не ПустаяСтрока(СтрокаВвода) Тогда
		Объект.СсылкаБитрикс= СтрокаВвода;
		ЭтаФорма.Модифицированность= Истина;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура СсылкаБитриксНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ЗапуститьПриложение(Объект.СсылкаБитрикс);
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПерезаполнитьШапку();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПерезаполнитьШапку();
КонецПроцедуры

#КонецОбласти

#Область Доставка
Процедура ЗаполнитьСписокВыбораПоляВремени(ПолеВводаФормы, Интервал = 3600) Экспорт
	
	ПолеВводаФормы.СписокВыбора.Очистить();
	
	НачалоРабочегоДня      = '00010101000000';
	ОкончаниеРабочегоДня   = '00010101220000';
	
	ВремяСписка = НачалоРабочегоДня;
	ТекДата= Дата(0001,01,01, Час(ТекущаяДата()), Минута(ТекущаяДата()), 01);
	Пока ВремяСписка <= ОкончаниеРабочегоДня Цикл
		//Пропускаем прошедшие интервалы
		Если ВремяСписка <  ТекДата Тогда
			ВремяСписка = ВремяСписка + Интервал;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВремяСписка) Тогда
			ПолеВводаФормы.СписокВыбора.Добавить(ВремяСписка + 1, "00:00"); // непустое значение
		Иначе
			ПолеВводаФормы.СписокВыбора.Добавить(ВремяСписка, Формат(ВремяСписка,"ДФ=ЧЧ:мм"));
		КонецЕсли;
		
		ВремяСписка = ВремяСписка + Интервал;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ИмяРеквизитаАдресаДоставки = Элемент.Имя;
	
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	Элемент,
	Объект[ИмяРеквизитаАдресаДоставки],
	Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	АдресДоставкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = ЛОЖЬ;
//	ПараметрыФормы= Новый Структура("АдресНаПогрузке", Объект.АдресНаПогрузке);
///	ОповещениеОвыборе= Новый ОписаниеОповещения("ВыборОбъектДоставки", ЭтотОбъект);
//	ОткрытьФорму("Справочник.ОбъектыДоставки.ФормаЭлемента", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОвыборе);
  ИмяРеквизита = Элемент.Имя;
	
	ИменаРеквизитовАдресовДоставки = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки("");
	
	ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставки = ИмяРеквизита;
	ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначение = ИмяРеквизита + "Значение";
	ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначенияПолей = ИмяРеквизита + "ЗначенияПолей";
	
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	Элемент,
	Объект,
	ИменаРеквизитовАдресовДоставки,
	СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);
	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы);
	
	ДоставкаТоваров.ЗаполнитьРеквизитыДоставки(Элементы, ИмяЭлементаФормы, Объект)
	
КонецПроцедуры
#КонецОбласти

#Область Функционал
&НаСервере
Процедура ОбновитьДанныеПоОснованиямНаСервере()
	Если Объект.Основания.Количество() = 1 Тогда 
		Основание= Объект.Основания[0].Документ;
		Документы.ЗаказНаДоставкуОтПоставщика.ЗаполнитьДанныеПоОснованию(Основание, Объект);
	КонецЕсли;
	Документы.ЗаказНаДоставкуОтПоставщика.ОбновитьИтогиПоОснованиям(Объект);
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьШапку()
	Документы.ЗаказНаДоставкуОтПоставщика.ОбновитьРеквизитыДоставки(Объект);
	
	Документы.ЗаказНаДоставкуОтПоставщика.ОбновитьИтогиПоОснованиям(Объект);
КонецПроцедуры

&НаСервере
Функция ИмеетПолныеПрава() 
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Элементы.АдресНаВыгрузке.ТолькоПросмотр= Не Объект.Транзит;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписи()
	Если Объект.МаксимальнаяДлина >= 6 И Объект.МаксимальнаяДлина < 12 Тогда
		НадписьНегабарит = "Внимание 6-ти метровый  негабарит";
	ИначеЕсли Объект.МаксимальнаяДлина >= 12 Тогда
		НадписьНегабарит = "Внимание 12-ти метровый  негабарит";
	Иначе
		НадписьНегабарит= "";
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ИнициализацияКарты

&НаКлиенте
Процедура ИнициализироватьКарту()
	КартаЯндекс= "";
	КартаЯндекс= ПолучитьТекстМакета();
	ГеокодированиеКлиент.УстановитьНачальныеКоординаты(Объект.Подразделение, КартаЯндекс);
КонецПроцедуры
&НаСервере
Функция ПолучитьТекстМакета()
	Макет= ПолучитьОбщийМакет("МакетЯндексКарты");
	стрМакет = Макет.ПолучитьТекст();
	
	Документы.ЗаказНаДоставкуОтПоставщика.УбратьПодстановкиИзКода(стрМакет);
	
	Возврат стрМакет;
КонецФункции

&НаКлиенте
Процедура ОчиститьКарту(Команда)
	ИнициализироватьКарту();
КонецПроцедуры
#КонецОбласти

#Область Карта
&НаКлиенте
Процедура ПостроитьМаршрут(Команда)
		//Маршрут
	ПараметрыМаршрута= ПолучитьМассивАдресов();
	ЯндексКарта= Элементы.КартаЯндекс;	
	Элементы.КартаЯндекс.document.getElementById("WebClientOperation").value = "calcRouter(" + ПараметрыМаршрута + ")";
	Элементы.КартаЯндекс.document.getElementById("WebClient").click();
КонецПроцедуры
&НаКлиенте
Функция ПолучитьМассивАдресов()
	Результат = "";
	
	Результат = Результат + "[""" +Объект.АдресНаПогрузке;
	
	Результат = Результат + """,""" + Объект.АдресНаВыгрузке;

	Результат= Результат + """]";
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СФП_МаркерыКлиент.МаркерНачало("Заказ на доставку от поставщика: Проведение из формы", Объект.Номер);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти


#Область ЭТрН

&НаКлиенте
Процедура ОбновитьЭТрННажатие(Элемент)  
	ОбновитьКомандыЭТрН();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьКомандыЭТрН();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыЭТрН()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		УдалитьДинамическиеДекорацииЭТрН();
	
		//Запрос = Новый Запрос;
		//Запрос.Текст =	
		//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Накладная.Ссылка) КАК Идентификатор,
		//	|	ПРЕДСТАВЛЕНИЕ(Накладная.Ссылка) КАК НакладнаяПредставление
		//	|ИЗ
		//	|	Документ.Saby_ТранспортнаяНакладная.ЗаказыНаДоставкуОтПоставщика КАК Накладная
		//	|ГДЕ
		//	|	Накладная.Заказ = &Заказ
		//	|	И НЕ Накладная.Ссылка.ПометкаУдаления";

		//Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);

		//Выборка = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	Элемент = Элементы.Добавить("Накладная" + СтрЗаменить(Строка(Выборка.Идентификатор), "-", "_"), Тип("ДекорацияФормы"), Элементы.ДинамическиеДекорацииЭТрН); 
		//	Элемент.Вид = ВидДекорацииФормы.Надпись;
		//	Элемент.Заголовок = Выборка.НакладнаяПредставление;
		//	Элемент.Гиперссылка = Истина;
		//	Элемент.Ширина = 45;
		//	Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		//	Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		//	Элемент.УстановитьДействие("Нажатие", "ОткрытьСсылкуЭТрН"); 
		//КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДинамическиеДекорацииЭТрН()    
	Массив = Элементы.ДинамическиеДекорацииЭТрН.ПодчиненныеЭлементы;
	Если ЗначениеЗаполнено(Массив) Тогда
		Элементы.Удалить(Массив[0]);
		УдалитьДинамическиеДекорацииЭТрН();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылкуЭТрН(Элемент)  
	//ПоказатьЗначение(, СсылкаЭТрН(СтрЗаменить(СтрЗаменить(Элемент.Имя, "_", "-"), "Накладная", "")));
КонецПроцедуры

//&НаСервере
//Функция СсылкаЭТрН(УИД)  
//	Возврат Документы.Saby_ТранспортнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
//КонецФункции

#КонецОбласти




