#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ТаблицаИнструкций = ПереченьИнструкций();
	
	Для каждого СтрокаТаблицы Из ТаблицаИнструкций Цикл
		ЭлементСправочника = НайтиПоКоду(СтрокаТаблицы.Код);
		Если Не ЗначениеЗаполнено(ЭлементСправочника) Тогда
			НовыйЭлемент = СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаТаблицы);
			НовыйЭлемент.Описание = СтрокаТаблицы.Наименование;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПереченьИнструкций()
	
	Таблица = Новый ТаблицаЗначений();
	
	ДобавитьКолонки(Таблица, "Код, НеДопускаетсяСовместноеИспользование, Наименование");
	// =================================================================================================================
	ДобавитьЗапись(Таблица, "SDVA", "CHQB,HOLD",                НСтр("ru = 'Средства должны быть зачислены клиенту бенефициару той же датой валютирования'"));
	ДобавитьЗапись(Таблица, "INTC", "CHQB,HOLD",                НСтр("ru = 'Платеж является внутрикорпоративным, то есть перевод средств между двумя компаниями, принадлежащими к одной группе (например, между филиалом и головной организацией)'"));
	ДобавитьЗапись(Таблица, "REPA", "CHQB,CORT,HOLD",           НСтр("ru = 'Платеж имеет связанную ссылку на электронный платеж (e-Payments), который клиент-плательщик направил бенефициару с использованием электронных систем связи, ссылка предназначена для банка бенефициара'"));
	ДобавитьЗапись(Таблица, "CORT", "CHQB,HOLD,REPA",           НСтр("ru = 'Оплата по сделке (по форексной сделке, по сделке с ценными бумагами)'"));
	ДобавитьЗапись(Таблица, "HOLD", "CHQB,CORT,INTC,REPA,SDVA", НСтр("ru = 'Оплата по предъявлению документа, удостоверяющего личность клиента бенефициара'"));
	ДобавитьЗапись(Таблица, "CHQB", "CORT,HOLD,INTC,REPA,SDVA", НСтр("ru = 'Оплата клиенту бенефициару должна быть произведена только чеком'"));
	ДобавитьЗапись(Таблица, "PHOB", "TELB",                     НСтр("ru = 'Просьба известить/связаться с бенефициаром (поле 59a) о поступлении средств по телефону'"));
	ДобавитьЗапись(Таблица, "TELB", "PHOB",                     НСтр("ru = 'Просьба известить/связаться с бенефициаром (поле 59a) о поступлении средств по наиболее эффективному средству электронной связи'"));
	ДобавитьЗапись(Таблица, "PHON", "TELE",                     НСтр("ru = 'Просьба известить банк бенефициара (поле 57а) о поступлении средств по телефону'"));
	ДобавитьЗапись(Таблица, "TELE", "PHON",                     НСтр("ru = 'Просьба известить банк бенефициара (поле 57а) о поступлении средств по наиболее эффективному средству электронной связи'"));
	ДобавитьЗапись(Таблица, "PHOI", "TELI",                     НСтр("ru = 'Просьба известить банк-посредник (поле 56а) о поступлении средств по телефону'"));
	ДобавитьЗапись(Таблица, "TELI", "PHOI",                     НСтр("ru = 'Просьба известить банк-посредник (поле 56а) о поступлении средств по наиболее эффективному средству электронной связи'"));
	
	Возврат Таблица
	
КонецФункции

Процедура ДобавитьКолонки(Таблица, Колонки)
	
	ОбщегоНазначенияУТ.ДобавитьКолонки(Таблица, Колонки);
	
КонецПроцедуры

Процедура ДобавитьЗапись(Таблица, Значение1, Значение2, Значение3)
	
	ОбщегоНазначенияУТ.ДобавитьЗапись(Таблица, Значение1, Значение2, Значение3);

КонецПроцедуры

#КонецОбласти

#КонецЕсли