#Область ПрограммныйИнтерфейс

// Формирует список шаблонов заданий очереди.
//
// см. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
//
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец ЭлектронноеВзаимодействие
	
	
	ИнтеграцияЕГАИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияВЕТИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияИСМП.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияЗЕРНО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияСАТУРН.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// КонецРаспознаваниеДокументов
	
	//-- Локализация
	
КонецПроцедуры

// Заполняет соответствие имен методов их псевдонимам для вызова из очереди заданий.
//
// см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	//++ Локализация

	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец ЭлектронноеВзаимодействие
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССайтом.ИмяМетода);
	ИнтеграцияСЯндексМаркетСервер.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	
	
	ИнтеграцияСАТУРН.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияЕГАИС.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияВЕТИС.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияИСМП.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияЗЕРНО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	

	ИнтеграцияСМаркетплейсомOzonСервер.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	ИнтеграцияСЯндексМаркетСервер.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// КонецРаспознаваниеДокументов
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти