  #Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ВремяСохраненияДокументов=Константы.ВремяСохраненияДокументов.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("Секции") Тогда
		СекцииСотрудника.ЗагрузитьЗначения(Параметры.Секции);
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийСотрудникТСД") Тогда
		ТекущийСотрудникТСД = Параметры.ТекущийСотрудникТСД;
	КонецЕсли;
	
	ДоступныеЯчейкиНастройкаСписка();
	
	Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда
		
		ТипРаспоряжения = ТипЗнч(Объект.Распоряжение); 
		
		Элементы._ЗаблокироватьВсёНаПересортицу.Видимость = ?(ТипРаспоряжения = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ ТипРаспоряжения = Тип("ДокументСсылка.ЗаказНаПеремещение"),Истина,Ложь);
		
		Элементы._ЗаблокироватьВсёНаБракОтПокупателей.Видимость = ?(ТипРаспоряжения = Тип("ДокументСсылка.ЧекККМВозврат") ИЛИ ТипРаспоряжения = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ ТипРаспоряжения = Тип("ДокументСсылка.КорректировкаРеализации"),Истина,Ложь);
		
	КонецЕсли;
	
	ЗаполнитьПлановоеКоличество();
	
	ЗаполнитьТоварыЯчейка();  
	
	//Подключение оповещений из очереди 
	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = Объект.Сотрудник.ОповещенияИзОчереди; 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;
	Для каждого Стр Из СекцииСотрудника Цикл
		ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
		Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
			Инт = ЗнчИнтервала;
		КонецЕсли; 
	КонецЦикла; 
	ИнтервалОповещений = Инт;   
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ИнициализироватьСканер();
	
	УстановитьОформлениеФормыДокумента();
	ЗаполнитьПлановоеКоличествоВТаблице();
	
	ОтображатьХарактеристики = Ложь;
	
	УстановитьВидимостьХарактеристик();
	
	Если ВремяСохраненияДокументов > 0 Тогда
		ПодключитьОбработчикОжидания("ОбработатьОжидание", ВремяСохраненияДокументов, Ложь);
	КонецЕсли;
	
	Если ОповещенияИзОчереди Тогда 
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли; 
			
	//Маркировка + 
	АктуализироватьМаркировку();
	//Маркировка -
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		//+Альтерра
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 =  Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			
			Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.НовыйШтрихкод Тогда
				НовыйШтрихкод = "";
				Если ТипЗнч(Параметр) = Тип("Строка") Тогда
					НовыйШтрихкод = Параметр;
				КонецЕсли;
			ИначеЕсли Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь И Элементы._ВыборЯчейки.Видимость = Истина Тогда
				
				ОбработатьШтрихкод(ШтрихКод1[0]);
			Иначе 
				//Маркировка +	   
				//ПроверитьУпаковку(ШтрихКод1);
				СтруктураКодаМаркировки = Неопределено;
				ЭтоКодМаркировки = МаркировкаАльтерра.ЭтоКодМаркировки(ШтрихКод1);
				Если  Элементы.ГруппаУдалениеТовараСМаркировкой.Видимость = Истина И  Не ЭтоКодМаркировки Тогда     					
					Сообщить("Отсканированный код не является кодом маркировки!");
					Возврат;
				КонецЕсли;	                       
				Если ЭтоКодМаркировки Тогда 
					СтруктураКодаМаркировки = МаркировкаАльтерра.ПолучитьСтруктуруКодаМаркировки(ШтрихКод1[0]);
					Штрихкод1[0] = СтруктураКодаМаркировки.СоставКодаМаркировки.EAN; 
				КонецЕсли; 
				ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Штрихкод1),СтруктураКодаМаркировки);
			КонецЕсли;
			//Маркировка -	
			
		КонецЕсли;
		//-
	КонецЕсли;
	// Конец ПодключаемоеОборудование  
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	//ЗаполнитьСлужебныеРеквизитыТЧТовары();
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	ПроверитьНеобходимостьЗапускаБП_Клиент();
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПринудительноЗакрытьФорму = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
	ОтключитьСканер();
	
	Если ВремяСохраненияДокументов > 0 Тогда
		ОтключитьОбработчикОжидания("ОбработатьОжидание");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДопМодульКлиент.ОчиститьСтрокиСНулевымКоличеством(Объект.Товары, Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят"), КэшированныеЗначения); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицы

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;
		
		Если типзнч(ТекущаяСтрокаТСД) <> Тип("Неопределено") Тогда
			
			ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
			ЭлементСписка.Маркировка = МаркировкаАльтерра.НоменклатураПодлежитМаркировке(ЭлементСписка.Номенклатура);
			
			Номенклатура = "";
			Характеристика = "";
			ПоУчету = 0;
			Количество = 0;
			Комментарий = "";
			Ячейка = "";
			НоваяЯчейка = "";
			НовыйШтрихкод = "";
			
			Если ЭлементСписка <> Неопределено Тогда
				Элементы._РедактированиеДокументаНаТСД.Видимость=Ложь;
				Элементы._РедактированиеСтрокиНаТСД.Видимость=Истина;
				Номенклатура = ЭлементСписка.Номенклатура;
				Характеристика = ЭлементСписка.Характеристика;
				Количество = ЭлементСписка.КоличествоУпаковок;
				ПоУчету = ЭлементСписка.КоличествоПлан;
				Комментарий = ЭлементСписка.Комментарий;
				ПолучитьЯчейку(Номенклатура, Объект.Склад);
				//Маркировка+
				Элементы.ПоФакту.ТолькоПросмотр = ЭлементСписка.Маркировка; 
				//Маркировка-
			Конецесли;
			
		Иначе
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
			КонецЕсли;
			Сообщить("Штрихкод не найден!");
		КонецЕсли;
		
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Отказ=Истина;
		
		Элементы._РедактированиеДокументаНаТСД.Видимость=Ложь;
		Элементы._ВыборНоменклатуры.Видимость = Истина;
		
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;	
	ТоварыВыбор_Обработка(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор_Обработка(ВызовИзОбработчика)
	
	Если типзнч(ТекущаяСтрокаТСД) <> Тип("Неопределено") Тогда
		
		ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
		ЭлементСписка.Маркировка = МаркировкаАльтерра.НоменклатураПодлежитМаркировке(ЭлементСписка.Номенклатура);
		
		Номенклатура = "";
		Характеристика = "";
		Количество = 0;
		ПоУчету = 0;
		Комментарий = "";
		Ячейка = "";
		НоваяЯчейка = "";
		НовыйШтрихкод = "";
		АдресКартинки="";
		
		Если ЭлементСписка <> Неопределено Тогда
			Если ВызовИзОбработчика Тогда
				Элементы._РедактированиеДокументаНаТСД.Видимость=Ложь; 
			Иначе   
				Элементы._ВыборНоменклатуры.Видимость = Ложь;
			Конецесли; 
			
			Элементы._РедактированиеСтрокиНаТСД.Видимость = Истина;
			
			Номенклатура = ЭлементСписка.Номенклатура;
			Характеристика = ЭлементСписка.Характеристика;
			Количество = ЭлементСписка.КоличествоУпаковок;
			ПоУчету = ЭлементСписка.КоличествоПлан;
			Комментарий = ЭлементСписка.Комментарий;
			ПолучитьЯчейку(Номенклатура, Объект.Склад);
			ПолучитьАдресКартинки(Номенклатура);
			//Маркировка+
			Элементы.ПоФакту.ТолькоПросмотр = ЭлементСписка.Маркировка;
			//Маркировка-
		Конецесли;
		
	Иначе
		Сообщить("Штрихкод не найден!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура _ВернутьсяКТЧ(Команда)
	
	ЗаполнитьПризнакРасхождение();
	
	Элементы._РедактированиеДокументаНаТСД.Видимость=Истина;
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь;
	Элементы.ГруппаУдалениеТовараСМаркировкой.Видимость = Ложь;
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ВзятьВРаботу(Команда)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ВРаботе"); 
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	
	Если Не Объект.Проведен Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.КПоступлению");
	КонецЕсли;
	
	УстановитьОформлениеФормыДокумента();
	ЗаполнитьПлановоеКоличествоВТаблице();
	ЗаполнитьТоварыЯчейка();
	
	ТолькоРасхождения = Истина;
	
	ЗаполнитьПризнакРасхождение();
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		ПроверкаФайловЗаказа();
	#КонецЕсли 
	
	Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(ПредопределенноеЗначение("Перечисление.СобытияРаботыТСД.Документ"),,Объект.Ссылка);
	
	Элементы.ГруппаУдалениеТовараСМаркировкой.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)	
	
	Если ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ЕстьСкан = ПроверитьПрикрепленныеФайлыПоПрефиксу("Scan_");
		
		Если Не ЕстьСкан И Объект.НомерВходящегоДокумента = "" Тогда
			Сообщить("Заполните номер, дату вх документа и загрузите скан вх документа");
			Возврат;
		ИначеЕсли Не ЕстьСкан Тогда
			Сообщить("Загрузите скан вх. документа");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.НомерВходящегоДокумента = "" Тогда
		Сообщить("Заполните номер и дату вх. документа");
		Возврат;
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят");
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	Сообщить("Создан " + Строка(Объект.Ссылка) + " в статусе " + Строка(Объект.Статус));
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ТребуетсяОбработка");
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.КПоступлению");
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура _ВернутьНаДоработку(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ВРаботе"); 
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
	УстановитьОформлениеФормыДокумента();
	ЗаполнитьПлановоеКоличествоВТаблице();
	ЗаполнитьТоварыЯчейка();
	
КонецПроцедуры

&НаКлиенте
Процедура _ИзменитьЯчейку(Команда)
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь;
	Элементы._ВыборЯчейки.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура _ПрисвоитьШК(Команда)
	СоздатьШК(НовыйШтрихкод);
КонецПроцедуры

#Область НеопознанныйТовар

&НаКлиенте
Процедура _НеопознанныйТовар(Команда)
	
	НеопознанныйТовар = ПолучитьНеопознанныйТовар(Объект.Склад, Объект.Номер);
	Если ЗначениеЗаполнено(НеопознанныйТовар) Тогда
		Если ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Оповещение = Новый ОписаниеОповещения("ДобавитьНеопознанныйТоварЗавершение", ЭтотОбъект); 
			
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("Номенклатура", НеопознанныйТовар);
			ПараметрыФормы.Вставить("ЗаказПоставщику", Объект.Распоряжение); 
			ПараметрыФормы.Вставить("ПриходныйОрдерНаТовары", Объект.Ссылка);

			ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.Док_НеопознаннаяНоменклатура", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ДобавитьНеопознанныйТоварЗавершение(НеопознанныйТовар, Неопределено);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить неопознанный товар");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНеопознанныйТовар(Склад, Номер)
	Возврат Документы.ПриходныйОрдерНаТовары.ПолучитьНеопознанныйТовар(Склад, Номер);
КонецФункции

&НаКлиенте
Процедура ДобавитьНеопознанныйТоварЗавершение(НеопознанныйТовар, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(НеопознанныйТовар) Тогда
		НоваяСтрока = Объект.Товары.Добавить();
		ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		НоваяСтрока.Номенклатура = НеопознанныйТовар;
		ВвестиЧисло(Количество, "Введите количество");
		НоваяСтрока.КоличествоУпаковок = Количество;
		НоваяСтрока.Количество = Количество;
	КонецЕсли;
КонецПроцедуры

// Запуск БП

&НаКлиенте
Процедура ПроверитьНеобходимостьЗапускаБП_Клиент()
	Если ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят") Тогда
		Если ПроверитьНеобходимостьЗапускаБП(Объект.Ссылка) Тогда  
    		ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект), 
				"В документе присутствует ""Неопознанная номенклатура"", запустить БП в Битриксе?", 
				РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПроверитьНеобходимостьЗапускаБП(Ссылка)
	Возврат Документы.ПриходныйОрдерНаТовары.ПроверитьНеобходимостьЗапускаБП(Ссылка);  
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗапуститьБпПоНеопознаннойНоменклатуре(Объект.Ссылка, Объект.Распоряжение, Объект.РабочийУчасток);	
	КонецЕсли;	
КонецПроцедуры 

&НаСервереБезКонтекста 
Процедура ЗапуститьБпПоНеопознаннойНоменклатуре(Ссылка, Распоряжение, РабочийУчасток)
	Документы.ПриходныйОрдерНаТовары.ЗапуститьБпПоНеопознаннойНоменклатуре(Ссылка, Распоряжение, РабочийУчасток);  
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Док__СоздатьОграниченноГодныйВместо(Команда)
	Док__СоздатьОграниченноГодныйВместоНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура Док__СоздатьОграниченноГодныйВместоНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Справочники.Номенклатура.СоздатьОграниченноГодныйТовар(Номенклатура);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаблокироватьВсёНаПересортицуПосле(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят");
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
	ЗаблокироватьВсёНаСервере("Брак на складе");
	
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаблокироватьВсёНаБракОтПокупателейПосле(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят");
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
	ЗаблокироватьВсёНаСервере("Брак от покупателей");
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоЯчейке(Команда)
	СортироватьСтроки("ТоварыЯчейка", "Возр");
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВесу(Команда)
	
	Действия = Новый Структура();
	Действия.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	Действия.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	Действия.Вставить("ПересчитатьВесОбъем");
	Для каждого Строка Из Объект.Товары Цикл
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Строка, Действия, КэшированныеЗначения);
		Строка.Вес = Строка.КоличествоПлан*Строка.ВесУпаковки;
	КонецЦикла; 
	
	СортироватьСтроки("ТоварыВес", "УБЫВ");
	Элементы.ТоварыВес.Видимость = Ложь;
	Элементы.ТоварыВесУпаковки.Видимость = Ложь;
	Элементы.ТоварыЯчейка.Видимость = Истина;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура СортироватьСтроки(ИмяКолонки, Направление)
	ИмяКолонкиНаправление = СтрЗаменить(Элементы[ИмяКолонки].ПутьКДанным, "Объект.Товары.","") + " " + Направление; 
	
	Объект.Товары.Сортировать(ИмяКолонкиНаправление);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОформлениеФормыДокумента()
	
	СтатусПриемки = Объект.Статус;
	
	Если СтатусПриемки = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.КПоступлению") Тогда
		
		УстановитьДоступность(Истина,Ложь,Ложь,Ложь,Ложь);
		
	ИначеЕсли СтатусПриемки = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ВРаботе") Тогда
		
		УстановитьДоступность(Ложь,Истина,Истина,Истина,Ложь);
		
	ИначеЕсли СтатусПриемки = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ТребуетсяОбработка") Тогда
		
		УстановитьДоступность(Истина,Ложь,Ложь,Ложь,Ложь);
		
	ИначеЕсли СтатусПриемки = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят") Тогда
		
		УстановитьДоступность(Ложь,Ложь,Ложь,Ложь,Истина);			
	КонецЕсли;
	
	Элементы.ТоварыХарактеристика.Видимость = ОтображатьХарактеристики;
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность(КнопкаВзятьВРаботу,КнопкаОтложить,КнопкаОтменить, КнопкаЗавершить,КнопкаВернуть)
	Элементы.ВзятьВРаботу.Видимость=КнопкаВзятьВРаботу;
	Элементы.СообщитьОбОшибке.Видимость=КнопкаВзятьВРаботу;
	Элементы.Отложить.Видимость=КнопкаОтложить;
	Элементы.Отменить.Видимость=КнопкаОтменить;
	Элементы.ВернутьНаДоработку.Видимость=КнопкаВернуть;
	Элементы.Завершить.Видимость=КнопкаЗавершить;
КонецПроцедуры

#Область ЗаполнениеИИнициализация

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТЧТовары(Перенумеровать = Истина, КэшированныеЗначения = Неопределено)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьВесОбъем");
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	
	// Для заполнения признака ШтрихкодНеОпределен получим данные по штрихкодам
	ТЗШтрихкоды = Объект.Товары.Выгрузить(,"Штрихкод");
	ТЗШтрихкоды.Свернуть("Штрихкод");
	МассивШтрихкодов = ТЗШтрихкоды.ВыгрузитьКолонку("Штрихкод");
	
	КешированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(КешированныеЗначения, МассивШтрихкодов);
	
	Если Объект.Товары.НайтиСтроки(Новый Структура("ЭтоУпаковочныйЛист", Истина)).Количество() > 0 Тогда
		Документы.УпаковочныйЛист.ДополнитьДанныеПоШтрихкодам(КешированныеЗначения, МассивШтрихкодов);
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТовМестаТребуетсяОбработка");
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Штрихкод)
			Или ЗначениеЗаполнено(КешированныеЗначения.Штрихкоды[СтрокаТЧ.Штрихкод])
			И КешированныеЗначения.Штрихкоды[СтрокаТЧ.Штрихкод].Количество() > 0 Тогда
			СтрокаТЧ.ШтрихкодНеОпределен = 0;
		Иначе
			СтрокаТЧ.ШтрихкодНеОпределен = 1;
		КонецЕсли;
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПлановоеКоличество()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Распоряжение", Объект.Распоряжение);
	Запрос.УстановитьПараметр("Отправитель", Объект.Отправитель);
	Запрос.УстановитьПараметр("РабочийУчасток", Объект.РабочийУчасток);
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Объект.Дата));
	Иначе
		Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДата());
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлению.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыКПоступлению.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТоварыКПоступлению.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	СУММА(ТоварыКПоступлению.Количество) КАК КоличествоПлан
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	|		ТоварыКПоступлению.Характеристика КАК Характеристика,
	|		ТоварыКПоступлению.Назначение КАК Назначение,
	|		ТоварыКПоступлению.КОформлениюОрдеровОстаток - ТоварыКПоступлению.ПринимаетсяОстаток КАК Количество
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Остатки(
	|				&ДатаОстатков,
	|				ДокументПоступления = &Распоряжение
	|					И Отправитель = &Отправитель
	|					И Склад = &Склад) КАК ТоварыКПоступлению
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКПоступлению.Номенклатура,
	|		ТоварыКПоступлению.Характеристика,
	|		ТоварыКПоступлению.Назначение,
	|		ВЫБОР
	|			КОГДА ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ТоварыКПоступлению.КОформлениюОрдеров
	|			ИНАЧЕ ТоварыКПоступлению.КОформлениюОрдеров
	|		КОНЕЦ - ВЫБОР
	|			КОГДА ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ТоварыКПоступлению.Принимается
	|			ИНАЧЕ ТоварыКПоступлению.Принимается
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|	ГДЕ
	|		ТоварыКПоступлению.Регистратор = &Ссылка
	|		И ТоварыКПоступлению.Активность
	|		И ТоварыКПоступлению.Склад = &Склад
	|		И ТоварыКПоступлению.ДокументПоступления = &Распоряжение) КАК ТоварыКПоступлению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (ТоварыКПоступлению.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочийУчасток
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКПоступлению.Номенклатура,
	|	ТоварыКПоступлению.Характеристика,
	|	ТоварыКПоступлению.Назначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыКПоступлению.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТоварыКПоступлению.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыКПоступлению.Количество) > 0";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	ТоварыПоРаспоряжению.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов,СтруктураКодаМаркировки = Неопределено)
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, СтруктураДействийСДобавленнымиСтроками);
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, СтруктураДействийСИзмененнымиСтроками);
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = Новый Структура;
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	//СтруктураДействий.ПараметрыУказанияСерий                 = ПараметрыУказанияСерий;
	СтруктураДействий.ТолькоТовары                           = Истина;
	СтруктураДействий.ШтрихкодыВТЧ                           = Истина;
	//СтруктураДействий.УчитыватьУпаковочныеЛисты              = ИспользоватьУпаковочныеЛисты;
	СтруктураДействий.ДействияСНеизвестнымиШтрихкодами       = "НетДействий";
	СтруктураДействий.СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = СтруктураДействийСоСтрокамиИзУпаковочныхЛистов;
	СтруктураДействий.ОтработатьИзменениеУпаковочныхЛистов   = Истина;
	//СтруктураДействий.ТекущийУпаковочныйЛист                 = УпаковочныйЛистРодитель;
	ЭтоВозвратНепринятых = (Объект.СкладскаяОперация = ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ВозвратНепринятыхТоваров"));
	СтруктураДействий.ЗаполнятьНазначения                    = Не ЭтоВозвратНепринятых;  
	
	СтароеКоличествоСтрок = Объект.Товары.Количество();
	
	ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
	
	//Маркировка + 
	СтруктураДействий.Вставить("СтруктураКодаМаркировки",СтруктураКодаМаркировки); 
	//Маркировка -   
	Если СтароеКоличествоСтрок <> Объект.Товары.Количество() Тогда    
		Если  Элементы.ГруппаУдалениеТовараСМаркировкой.Видимость  Тогда 
			//Сообщить("Товар не присутствует в ордере");
			ОбработатьШтрихкодыИтог(СтруктураДействий);	
			Возврат;
		КонецЕсли;
   		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОбработатьШтрихкодыДалее", ЭтотОбъект, СтруктураДействий), 
			"Выбранный товар не найден в ордере. Добавить его?", 
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьШтрихкодыИтог(СтруктураДействий);		
	КонецЕсли;
	
КонецПроцедуры  


&НаКлиенте
Процедура ОбработатьШтрихкодыДалее(Результат, СтруктураДействий) Экспорт 

	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьШтрихкодыИтог(СтруктураДействий); 
	Иначе
		Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
			Объект.Товары.Удалить(Объект.Товары.НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока));
		КонецЕсли;
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодыИтог(СтруктураДействий)
	 
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
	КонецЕсли;
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		ТекущаяСтрокаТСД = СтруктураДействий.ТекущаяСтрока; 

		ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
	    ИндексСтроки = Объект.Товары.Индекс(ЭлементСписка);
                                                         		
		Если типзнч(ЭлементСписка) <> Тип("Неопределено") Тогда 	
			//Маркировка +	
			ЭлементСписка.Маркировка = Ложь;
			СтруктураКодаМаркировки = СтруктураДействий.СтруктураКодаМаркировки;
			
			Если СтруктураКодаМаркировки = Неопределено Тогда  
				
				Если МаркировкаАльтерра.НоменклатураПодлежитМаркировке(ЭлементСписка.Номенклатура) Тогда
					ЭлементСписка.Маркировка = Истина;
					
					ПоказатьВопрос(Новый ОписаниеОповещения("ВопросСканированияКМ", ЭтотОбъект, ЭлементСписка), 
			       "Отсканировать код маркировки?",РежимДиалогаВопрос.ДаНет);   
					
  				КонецЕсли;
		    Иначе  	
				  ЭлементСписка.Маркировка = Истина; 
				
				   СтруктураНоменклатуры = Новый Структура("Номенклатура,Серия,Характеристика", ЭлементСписка.Номенклатура,ЭлементСписка.Серия,ЭлементСписка.Характеристика); 
				   СсылкаНаШтрихкодМаркировки = МаркировкаАльтерра.ПолучитьСсылкуНаШтрихкодМаркируемогоТовара(СтруктураКодаМаркировки,СтруктураНоменклатуры);
				   ИдентификаторСтрокиМаркировка =  ПолучитьСтрокуШтрихкодыУпаковок(СсылкаНаШтрихкодМаркировки); 	
				  
				   ВидПродукции = МаркировкаАльтерра.ОпределитьВидПродукции(ЭлементСписка.Номенклатура,СтруктураКодаМаркировки.ВидыПродукции);
               
			       ДанныеСтрокиМаркировки = Новый Структура("ЭлементСписка,СсылкаНаШтрихкодМаркировки,ИдентификаторСтрокиМаркировка,МассивКодовМаркировкиЧЗ,ВидПродукции",
			       ЭлементСписка,СсылкаНаШтрихкодМаркировки,ИдентификаторСтрокиМаркировка,СтруктураКодаМаркировки.МассивКодовМаркировкиЧЗ,ВидПродукции);  
				   
			       	Если  Элементы.ГруппаУдалениеТовараСМаркировкой.Видимость Тогда 
			       			
                	  Если ИдентификаторСтрокиМаркировка  = Неопределено   Тогда
	  		              Сообщить("Код маркировки не найден в документе");
		                  ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 1; 
		                  ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;  
		                  Если ЭлементСписка.КоличествоУпаковок = 0 Тогда 
		              	    Объект.Товары.Удалить(ИндексСтроки);
		                  КонецЕсли; 
		                  Возврат;
                	  Иначе	 
		                 ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 2; 
		                 ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;
		                 Если ЭлементСписка.КоличествоУпаковок = 0 Тогда 
			                Объект.Товары.Удалить(ИндексСтроки);
		                 КонецЕсли;
		                 Объект.ШтрихкодыУпаковок.Удалить(ДанныеСтрокиМаркировки.ИдентификаторСтрокиМаркировка); 
		                 Сообщить("Код маркировки успешно удален из ордера!");
		                 Возврат;
                	  КонецЕсли;
                	  
				   КонецЕсли;

		           ОбработатьСтрокуСМаркировкой(ДанныеСтрокиМаркировки);
		           ЗаполнитьПризнакРасхождение();
		КонецЕсли;
				
			//Маркировка -
			
			Если ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоПлан Тогда
				
				Элементы._РедактированиеДокументаНаТСД.Видимость=Истина;
				Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь;
				
				ЗаполнитьПризнакРасхождение();
				
			ИначеЕсли НЕ Элементы.ГруппаУдалениеТовараСМаркировкой.Видимость Тогда 
				
				Элементы._РедактированиеДокументаНаТСД.Видимость=Ложь;
				Элементы._РедактированиеСтрокиНаТСД.Видимость=Истина;
				Элементы.ПоФакту.ТолькоПросмотр = ЭлементСписка.Маркировка;
				
				Номенклатура = ЭлементСписка.Номенклатура;
				Характеристика = ЭлементСписка.Характеристика;
				Количество = ЭлементСписка.КоличествоУпаковок;
				ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;
				ПоУчету = ЭлементСписка.КоличествоПлан;
				Комментарий = ЭлементСписка.Комментарий;
				ПолучитьЯчейку(Номенклатура, Объект.Склад);
				ПолучитьАдресКартинки(Номенклатура);
				
				НоваяЯчейка = "";
				НовыйШтрихкод = "";
				
			КонецЕсли;
		Иначе
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
			КонецЕсли;
			Сообщить("Штрихкод не найден!");
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(ШтрихКод1) 
	
	СсылкаНаЯчейку = ПолучитьЯчейкуПоШтрихкоду(ШтрихКод1); 
	Если СсылкаНаЯчейку <> Неопределено Тогда
		ДоступныеЯчейки.Отбор.Элементы.Очистить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейки, "Ссылка", СсылкаНаЯчейку, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		Сообщить("Ячейка не найдена!");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ПолучитьЯчейкуПоШтрихкоду(ШтрихКод1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда	
		Возврат ВыборкаДетальныеЗаписи.Ссылка;   
	Иначе 
		Возврат Неопределено; 
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,СтруктураДействий,КэшированныеЗначения);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		СтруктураДействийСТекущейСтрокой = Новый Структура;
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
		СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьВесОбъем");
		
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока);
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействийСТекущейСтрокой, КэшированныеЗначения);
	КонецЕсли;
	
	
	ПересчитатьКоличествоМест();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Прочее

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(Форма, Действия)
	
	Действия.Вставить("ПересчитатьКоличествоЕдиниц");
	
КонецФункции

&НаСервере
Процедура ПересчитатьКоличествоМест()
	
	УпаковочныеЛистыСервер.ПересчитатьКоличествоМест(ЭтаФорма, Объект.Товары)
	
КонецПроцедуры

Процедура ПолучитьЯчейку(НоменклатураСсылка, СкладСсылка)
	Документы.ПриходныйОрдерНаТовары.ПолучитьЯчейку(НоменклатураСсылка, СкладСсылка, Ячейка);	
КонецПроцедуры

&НаКлиенте
Процедура ПоФактуПриИзменении(Элемент) 
		
	ИзменитьКоличествоВСтрокеПоИдентификатору(ТекущаяСтрокаТСД,Количество,Комментарий);
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД); 

	Если МаркировкаАльтерра.НоменклатураПодлежитМаркировке(ТекущаяСтрока.Номенклатура) Тогда    
		
	  КоличествоКМ = ПолучитьКоличествоКодовМаркировки(ТекущаяСтрока.Номенклатура);  
	  
	  Если  КоличествоКМ > Количество Тогда 
	    Количество  = КоличествоКМ;
		ТекущаяСтрока.КоличествоУпаковок = КоличествоКМ; 
		ТекущаяСтрока.Количество = КоличествоКМ;
	  КонецЕсли;
	  
    КонецЕсли;
		
	СтруктураДействий = Новый Структура;
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект,СтруктураДействий);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоВСтрокеПоИдентификатору(Идентификатор,Количество,ТекстКоммент)
	СтрокаИзменения = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	СтрокаИзменения.КоличествоУпаковок = Количество;
	СтрокаИзменения.Количество = Количество;
	СтрокаИзменения.Комментарий = ТекстКоммент; 
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	ИзменитьКоличествоВСтрокеПоИдентификатору(ТекущаяСтрокаТСД,Количество,Комментарий);
КонецПроцедуры

Функция ИзменитьЯчейку()	
	Возврат Документы.ПриходныйОрдерНаТовары.ИзменитьЯчейку(Номенклатура, Объект.Склад, Ячейка, НоваяЯчейка);	
КонецФункции

Процедура СоздатьШК(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК НоменклатураПредставление,
	|	ШтрихкодыНоменклатуры.Характеристика.Наименование КАК ХарактеристикаПредставление,
	|	ШтрихкодыНоменклатуры.Упаковка.Наименование КАК УпаковкаПредставление
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для номенклатуры %Номенклатура%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Номенклатура%", """" + Выборка.НоменклатураПредставление + """"
		+ ?(ЗначениеЗаполнено(Выборка.Характеристика), " " + НСтр("ru='с характеристикой'") + " """ + Выборка.ХарактеристикаПредставление + """", "")
		+ ?(ЗначениеЗаполнено(Выборка.Упаковка), " " + НСтр("ru='в упаковке'") + " """ + Выборка.УпаковкаПредставление + """", ""));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Сообщить();
		
	Иначе
		МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Штрихкод = Штрихкод;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Характеристика = Характеристика;
		
		МенеджерЗаписи.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Штрихкод записан!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЯчейкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Истина;
	Элементы._ВыборЯчейки.Видимость = Ложь;
	
	НоваяЯчейка = Элементы.ДоступныеЯчейки.ТекущиеДанные.Ссылка;
	Если ИзменитьЯчейку() Тогда
		ПолучитьЯчейку(Номенклатура, Объект.Склад);	
		Сообщить("Ячейка изменена!");
	Иначе
		Ячейка = "";
		Сообщить("При измененеии ячейки произошли проблемы! Ячейка не изменена!");
	КонецЕсли;
	ДоступныеЯчейки.Отбор.Элементы.Очистить();
    ДоступныеЯчейкиНастройкаСписка();
КонецПроцедуры     

 &НаСервере 
Процедура ДоступныеЯчейкиНастройкаСписка()
 
Если СекцииСотрудника.Количество()>0 Тогда
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейки, "РабочийУчасток", СекцииСотрудника.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке,,Истина);	
ИначеЕсли ЗначениеЗаполнено(Объект.РабочийУчасток) Тогда
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейки, "РабочийУчасток", Объект.РабочийУчасток, ВидСравненияКомпоновкиДанных.Равно,,Истина);	
КонецЕсли;

 
КонецПроцедуры
 
&НаСервере
Процедура НоменклатураПриИзмененииСервер(КэшированныеЗначения)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	СтруктураДействийСТекущейСтрокой = Новый Структура;
	СтруктураДействийСТекущейСтрокой.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействийСТекущейСтрокой.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействийСТекущейСтрокой.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	УпаковочныеЛистыСервер.НоменклатураУпаковочныйЛистПриИзменении(ЭтаФорма, Объект.Товары,
	"ТоварыНоменклатура", КэшированныеЗначения, СтруктураДействийСТекущейСтрокой);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКачествоНоменклатуры(Команда)
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь;
	Элементы._ВыборНК.Видимость = Истина;
	
	ИзменитьКачествоСервер();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьКачествоСервер() 		
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПоНоменклатуре, "Номенклатура", Номенклатура, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Истина;
	Элементы._ВыборНК.Видимость = Ложь;
	
	НоменклатураНК = Элементы.Список.ТекущиеДанные.НоменклатураБрак;
	
	ВвестиЧисло(Количество,"Введите количество");
	НоваяСтрока = Объект.Товары.Добавить();
	ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	НоваяСтрока.Номенклатура = НоменклатураНК; 
	НоваяСтрока.КоличествоУпаковок = Количество;
	НоваяСтрока.Количество = Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатура1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	НовыйТовар = Элементы.СписокНоменклатура1.ТекущиеДанные.Ссылка; 
	СтруктураПоиска = Новый Структура("Номенклатура", НовыйТовар);

	МассивСтрок = Объект.Товары.НайтиСтроки(СтруктураПоиска);
	Если ЗначениеЗаполнено(МассивСтрок) Тогда 
		Строка = МассивСтрок[0];
		ТекущаяСтрокаТСД = Строка.ПолучитьИдентификатор(); 
	    Строка.Маркировка = МаркировкаАльтерра.НоменклатураПодлежитМаркировке(Строка.Номенклатура);      
	    ТоварыВыбор_Обработка(Ложь);
	Иначе		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОповещениеОНовомТоваре", ЭтотОбъект, СтруктураПоиска), 
			"Выбранный товар не найден в ордерах. Добавить его?", 
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОНовомТоваре(Результат, СтруктураДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Номенклатура = СтруктураДопПараметры.Номенклатура;
		Характеристика = "";
		ПоУчету = 0;
		Количество = 0;
		Комментарий = "";
		Ячейка = "";
		НоваяЯчейка = "";
		НовыйШтрихкод = "";
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура; 
		
		ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор(); 
		
		Элементы._РедактированиеСтрокиНаТСД.Видимость = Истина;
		Элементы._ВыборНоменклатуры.Видимость = Ложь;
	КонецЕсли;	
 
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьВсёНаСервере(ПричинаБлокировки) 
	Обработки.РабочееМестоКладовщикаАльтерра.ЗаблокироватьВсёНаСервере(ПричинаБлокировки, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановоеКоличествоВТаблице()
	
	Для каждого Строка из ТоварыПоРаспоряжению Цикл
		МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Назначение",Строка.Номенклатура,Строка.Характеристика,Строка.Назначение));
		Для каждого СтрокаМассив из МассивСтрок Цикл
			СтрокаМассив.КоличествоПлан = Строка.КоличествоПлан;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОжидание() Экспорт
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаСтрокаРедактирования = Элементы._РедактированиеСтрокиНаТСД.Видимость;
	
	Если АктивнаСтрокаРедактирования Тогда
		НомерСтроки = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД).НомерСтроки;
	КонецЕсли;
	
	Если ИзменениеТабличнойЧасти() Тогда
		
		ЭтаФорма.Прочитать();
		ЗаполнитьПлановоеКоличествоВТаблице();
		ЗаполнитьПризнакРасхождение();
		ЗаполнитьТоварыЯчейка();
		
		Если АктивнаСтрокаРедактирования Тогда
			ТекущаяСтрокаТСД = Объект.Товары[НомерСтроки-1].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзменениеТабличнойЧасти()
	
	Попытка
		Если Не Объект.Ссылка.Пустая()Тогда
			Если АльтерраОбщегоНазначения.ТабличнаяЧастьИзменилась(Объект.Ссылка.Товары.Выгрузить(),Объект.Товары.Выгрузить()) Тогда
				ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
				ДокументОбъект.Товары.Загрузить(Объект.Товары.Выгрузить());
				//Маркировка
				ДокументОбъект.ШтрихкодыУпаковок.Загрузить(Объект.ШтрихкодыУпаковок.Выгрузить());
				//Маркировка -
				УстановитьПривилегированныйРежим(Истина);
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект,истина);
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОтображатьХарактеристики(Команда)
	ОтображатьХарактеристики = Не ОтображатьХарактеристики;
	УстановитьВидимостьХарактеристик();	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьХарактеристик()
	Элементы.ТоварыХарактеристика.Видимость =ОтображатьХарактеристики;
	Элементы.Характеристика.Видимость=ОтображатьХарактеристики;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныеШапки()
	Если ЗначениеЗаполнено(Объект.ВходящийДокумент) Тогда
		Элементы.Загрузить.Видимость = Ложь;
		Элементы.ОчиститьСкан.Видимость = Истина;
	Иначе
		Элементы.Загрузить.Видимость = Истина;
		Элементы.ОчиститьСкан.Видимость = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТолькоРасхождения(Команда)
	ТолькоРасхождения = Не ТолькоРасхождения;
	ЗаполнитьПризнакРасхождение();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакРасхождение()
	
	Для Каждого СтрТабл Из Объект.Товары Цикл
		СтрТабл.Расхождение = СтрТабл.КоличествоУпаковок <> СтрТабл.КоличествоПлан;
	КонецЦикла;
	
	Если ТолькоРасхождения Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Расхождение",Истина);
	Иначе
		Элементы.Товары.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьАдресКартинки(Номенклатура)
	Документы.ПриходныйОрдерНаТовары.ПолучитьАдресКартинки(Номенклатура, ЭтотОбъект.УникальныйИдентификатор, АдресКартинки);  
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеЗаменаИзображения(Команда)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда  
		Замечание = "";  
		ОтправительСообщения = ?(ЗначениеЗаполнено(Объект.Сотрудник), Объект.Сотрудник, Альтерра_СкладСервер.ТекущийСотрудник()); 
		Если ВвестиСтроку(Замечание, "Текст замечания (что не так)") Тогда
			Если Замечание <> "" Тогда
				ДопМодуль.ОтправитьСообщениеОЗаменеКартинки("Замените изображение у номенклатуры - ", Номенклатура, Замечание, ОтправительСообщения); 
			Иначе
				 ОбщегоНазначенияКлиент.СообщитьПользователю("Для отправки запроса на замену картинки товара необходимо заполнить 'Текст замечания'!");
			КонецЕсли;
		Иначе 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для отправки запроса на замену картинки товара необходимо заполнить 'Текст замечания'!");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
			глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
			глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыЯчейка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|ГДЕ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура В(&Номенклатура)
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Товары.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для каждого Строка Из Объект.Товары Цикл
			Если Строка.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура Тогда
				Строка.Ячейка = ВыборкаДетальныеЗаписи.Ячейка;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры


#Область ДобавлениеФото
Функция КнопкиОповещения()
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Отмена");
	Кнопки.Добавить("С телефона");
	Кнопки.Добавить("Камера");
	
	Возврат Кнопки;
	
КонецФункции 

&НаКлиенте
Процедура ПроверкаФайловЗаказа()
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Если ЭтаФорма.ВводДоступен() Тогда
			Если ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда //И Не ПроверитьПрикрепленныеФайлыПоПрефиксу("ФотоТС_") _____ Проверка убрана по задаче
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ИмяКоманды", "ДобавитьФотоТС");
				
				Кнопки = КнопкиОповещения();
				
				ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСпособДобавленияФото", Этаформа, ДополнительныеПараметры), "Загрузите фото транспортного средства перед выгрузкой.", Кнопки);
				
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСпособДобавленияФото(РезультатВопроса, ДополнительныеПараметры) Экспорт
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Если РезультатВопроса = "Камера" Тогда
			Если ДополнительныеПараметры.ИмяКоманды =  "ДобавитьФотоТС" Тогда 
				СделатьФотоКамерой(ДополнительныеПараметры.ИмяКоманды);
			Иначе
				СделатьФотоКамерой(ДополнительныеПараметры.ИмяКоманды);
			КонецЕсли;
		ИначеЕсли 
			РезультатВопроса = "С телефона" Тогда
			ДобавитьФотоИзГалереи(ДополнительныеПараметры.ИмяКоманды);
		Иначе
			Если ДополнительныеПараметры.ИмяКоманды = "ДобавитьФотоТС" Тогда
				ЭтаФорма.Закрыть();
			Иначе
				Возврат;
			КонецЕсли; 
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ТипЗнч(Объект.Распоряжение) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Сообщить("Ордер создан не на основании заказа");
		Возврат;
	КонецЕсли; 
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Данные не записаны!");
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "ДобавитьСканДокумента" 
		И (Объект.НомерВходящегоДокумента = "" Или Объект.ДатаВходящегоДокумента = Дата("00010101")) Тогда
		Сообщить("Заполните номер и дату вх. документа");
		Возврат;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКоманды", Команда.Имя);
	
	Кнопки = КнопкиОповещения();
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСпособДобавленияФото", Этаформа, ДополнительныеПараметры), "Загрузите фото.", Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьФотоКамерой(ИмяКоманды)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		ДанныеМультимедиа = Неопределено;
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда	
			ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок(,, 100,,ТипПодсветкиКамеры.Включена);
		Иначе    
			Сообщить(НСтр("ru = 'Съемка фото не поддерживается.'", "ru"));
		КонецЕсли; 
		
		
		Если ДанныеМультимедиа <> Неопределено Тогда
			Попытка
				СоздатьНовыйФайл(ДанныеМультимедиа.ПолучитьДвоичныеДанные(), ДанныеМультимедиа.РасширениеФайла, ИмяКоманды);
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды); 
				ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершение", Этаформа, ДополнительныеПараметры), "Изображение успешно загружено." + Символы.ПС + "Добавить новый снимок?", РежимДиалогаВопрос.ДаНет, 0.1);
			Исключение
				Ошибка = ИнформацияОбОшибке();
				ПодробнаяОшибка = ПодробноеПредставлениеОшибки(Ошибка);
				Сообщить(ПодробнаяОшибка);
			КонецПопытки;
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФотоИзГалереи(ИмяКоманды)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Фильтр = "Все картинки (*.jpg;*.jpeg;*.tif;*.png)"
		+ "|*.jpg;*.jpeg;*.tif;*.png|";
		Диалог.МножественныйВыбор = Истина;
		// Диалог.Каталог = КаталогБиблиотекиМобильногоУстройства(ТипКаталогаБиблиотекиМобильногоУстройства.Картинки);
		
		Если Диалог.Выбрать() Тогда
			МассивФайлов = Диалог.ВыбранныеФайлы;
			Сч = 0;
			Для каждого Файл Из МассивФайлов Цикл
				Фото = Новый Файл(Файл); 
				Данные = Новый ДвоичныеДанные(Фото.ПолноеИмя);
				ПредставлениеФайла = Фото.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
				РасширениеФайла = СтрРазделить(ПредставлениеФайла, ".");
				Расширение = РасширениеФайла[РасширениеФайла.Количество()-1];
				Попытка
					СоздатьНовыйФайл(Данные,Расширение,ИмяКоманды);
					Сч = Сч + 1;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			ПоказатьПредупреждение(, "Загружено " + Сч + " из " + МассивФайлов.Количество() + " файлов", 1);
		Иначе
			ПроверкаФайловЗаказа();
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СделатьФотоКамерой(ДополнительныеПараметры.ИмяКоманды);
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйФайл(Данные,Расширение,Команда)
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяПапки =  СтрЗаменить(СтрЗаменить(Строка(Объект.Ссылка), ":", "_"), " ", "_");
	
	Если Не ЗначениеЗаполнено(Справочники.ЗаказПоставщикуПрисоединенныеФайлы.НайтиПоНаименованию(ИмяПапки, Истина)) Тогда
		ГруппаОрдера = Справочники["ЗаказПоставщикуПрисоединенныеФайлы"].СоздатьГруппу();
		ГруппаОрдера.ВладелецФайла = Объект.Распоряжение;
		ГруппаОрдера.Наименование = ИмяПапки;
		ГруппаОрдера.Записать();
	КонецЕсли;
	ИмяПапкиОрдера = Справочники.ЗаказПоставщикуПрисоединенныеФайлы.НайтиПоНаименованию(ИмяПапки, Истина);
	
	Имя = ПолучитьИмяФайла();
	
	Если Команда = "ДобавитьСканДокумента" Тогда
		ИмяФайла = "Scan_" + Имя;
	КонецЕсли;
	
	Если Команда = "ДобавитьФотоТовара" Тогда
		Наименование = СтрРазделить(Строка(Номенклатура), " ");
		ЭлементМассива = 0;
		НоваяСтрока = "";
		Пока ЭлементМассива < 4 Цикл
			НоваяСтрока = НоваяСтрока + Наименование[ЭлементМассива] + "_";
			ЭлементМассива = ЭлементМассива + 1;
		КонецЦикла;
		ИмяФайла = Имя + "_"
		+ СтрЗаменить(НоваяСтрока, ",", "")
		+ Строка(Формат(ТекущаяДата(),"ДФ=dd.MM.yy"));
	КонецЕсли;
	
	Если Команда = "ДобавитьФотоТС" Тогда
		ИмяФайла  = "ФотоТС_" + Имя;
	КонецЕсли; 
	
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Данные);
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.Автор = ПараметрыСеанса.ТекущийПользователь.Наименование;
	ПараметрыФайла.ВладелецФайлов = Объект.Распоряжение;
	ПараметрыФайла.ГруппаФайлов = ИмяПапкиОрдера; 
	ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
	ПараметрыФайла.РасширениеБезТочки = Расширение;
	РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВХранилище);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

Функция ПолучитьИмяФайла()
	Имя = СтрЗаменить(Строка(Объект.Склад), " ", "_") + "_" 
	+ СтрЗаменить(Строка(Объект.Отправитель), " ", "_") + "_" 
	+ СтрЗаменить(Строка(Объект.ДатаВходящегоДокумента), ":", "_") + "_" 
	+ Объект.НомерВходящегоДокумента;
	
	ЗапрещенныеСимволы = "/\[]:;|=?*<>" + Символ(34);
	Для Сч=1 По СтрДлина(Имя) Цикл
		Символ = Сред(Имя, Сч, 1);
		Если СтрНайти(ЗапрещенныеСимволы, Символ) Тогда 
			Имя = СтрЗаменить(Имя,Символ,"");
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Имя;
Конецфункции

Функция ПроверитьПрикрепленныеФайлыПоПрефиксу(Префикс)
	Если ЗначениеЗаполнено(Справочники.ЗаказПоставщикуПрисоединенныеФайлы.НайтиПоНаименованию(Префикс + ПолучитьИмяФайла(), Истина)) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
#КонецОбласти

#КонецОбласти


#Область Оповещения 
&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
		
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда   
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ТребуетсяОбработка");     
		ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина); 
		ОбработатьОжидание();
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды, ОткрытьОчередь",Объект.Сотрудник,"Отгрузка", Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	РабочиеУчастки.Ссылка КАК Ссылка,
	|	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
	|ИЗ
	|	Справочник.РабочиеУчастки КАК РабочиеУчастки
	|ГДЕ
	|	РабочиеУчастки.Ссылка В(&Секции)
	|	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника()); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
	|ИЗ
	|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
	|ГДЕ
	|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
	|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника());
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
		КлиентовВОчереди = 0;
	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Объект.Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры 

Функция СекцииСотрудника()
	Возврат Объект.Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
КонецФункции

#КонецОбласти 

&НаКлиенте
Процедура СчитатьШтрикодКамера(Команда)
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Штрихкод); 
		МассивСсылок.Добавить(Неопределено);
		ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(МассивСсылок));		

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибке(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СообщитьОбОшибке_ПослеЗакрытияВопроса(КодВозвратаДиалога.Да, Истина);
	Иначе
    	ПоказатьВопрос(
			Новый ОписаниеОповещения("СообщитьОбОшибке_ПослеЗакрытияВопроса", ЭтотОбъект), 
			"Записать документ?", 
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибке_ПослеЗакрытияВопроса(Результат, ОбъектЗаписан) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ОбъектЗаписан <> Истина Тогда 
			Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ТребуетсяОбработка");
			Попытка
				ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);
			Исключение   
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
		СписокОрдеров = Новый Массив;
		СписокОрдеров.Добавить(Объект.Ссылка);
		
		ОткрытьФорму(
			"Обработка.РабочееМестоКладовщикаАльтерра.Форма.ФормаПриемПоРейсу_СообщитьОбОшибке", 
			Новый Структура("СписокОрдеров, ТекущийСотрудникТСД", СписокОрдеров, ТекущийСотрудникТСД), 
			ЭтаФорма,
			,
			,
			, 
			Новый ОписаниеОповещения("СообщитьОбОшибкеЗавершение", ЭтаФорма), 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;	
 
КонецПроцедуры
	
&НаКлиенте 
Процедура СообщитьОбОшибкеЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(Результат) = Тип("Строка") И ЗначениеЗаполнено(Результат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
	КонецЕсли;
КонецПроцедуры

#Область Маркировка   

 &НаСервере
 Функция ПолучитьСтрокуШтрихкодыУпаковок(CcылкаНаШтрихкод) 
	
	Строка = Объект.ШтрихкодыУпаковок.Выгрузить().Найти(CcылкаНаШтрихкод,"ШтрихкодУпаковки");
	Если Строка = Неопределено Тогда
		Возврат Неопределено;
	Иначе                                   
		Возврат Строка.НомерСтроки - 1;
	КонецЕсли;
	
КонецФункции  

 &НаСервере
 Процедура АктуализироватьМаркировку()
	
    ОбработанныеТовары = МаркировкаАльтерра.АктуализироватьМаркировку(Объект.Товары);
    Если ОбработанныеТовары = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
	Объект.Товары.Загрузить(ОбработанныеТовары);
	 
 КонецПроцедуры 

 &НаКлиенте
 Процедура ТоварыПередУдалением(Элемент,Отказ) 

	 ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
	 ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	 ЭлементСписка.Маркировка = МаркировкаАльтерра.НоменклатураПодлежитМаркировке(ЭлементСписка.Номенклатура);
	 Если ЭлементСписка.Маркировка и ЭлементСписка.КоличествоУпаковок > 0 Тогда                                                        
		 КоличествоКМ =  ПолучитьКоличествоКодовМаркировки(ЭлементСписка.Номенклатура);  
		 Если КоличествоКМ > 0 Тогда  
			 //ЭлементСписка.КоличествоУпаковок = КоличествоКМ; 
			 Отказ = Истина;
			 Элементы.ГруппаУдалениеТовараСМаркировкой.Видимость = Истина; 
			 Элементы._РедактированиеДокументаНаТСД.Видимость=Ложь;
		 КонецЕсли;
	 КонецЕсли;
	 
 КонецПроцедуры  
 
&НаКлиенте
Процедура ОбработатьСтрокуСМаркировкой(ДанныеСтрокиМаркировки)
	
	ЭлементСписка = ДанныеСтрокиМаркировки.ЭлементСписка;
	ИндексСтроки = Объект.Товары.Индекс(ЭлементСписка);	
	
	Если ДанныеСтрокиМаркировки.ИдентификаторСтрокиМаркировка  = Неопределено Тогда  
				
		Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.Приемка");  
		
		РезультатПроверки = МаркировкаАльтерра.ПроверкаЧЗ(ДанныеСтрокиМаркировки.МассивКодовМаркировкиЧЗ,ДанныеСтрокиМаркировки.ВидПродукции,Операция);
		СообщениеОбОшибках = РезультатПроверки.СообщениеОбОшибках;
 
		Если РезультатПроверки.КодВалидный Тогда
			НС = Объект.ШтрихкодыУпаковок.Добавить();
			НС.ШтрихкодУпаковки = ДанныеСтрокиМаркировки.СсылкаНаШтрихкодМаркировки;
		Иначе
			СообщениеОбОшибках = СообщениеОбОшибках + "
			|Товар будет добавлен без КМ!";
		КонецЕсли;
		
		Если СообщениеОбОшибках  <> "" Тогда  
			Сообщить(СообщениеОбОшибках);
		КонецЕсли;
	
	Иначе 
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдаленияКМ", ЭтотОбъект, ДанныеСтрокиМаркировки), 
		"Код маркировки уже присутствует в документе. Удалить КМ?",РежимДиалогаВопрос.ДаНет); 	
	КонецЕсли;  				
	
КонецПроцедуры	

&НаКлиенте
Процедура ВопросСканированияКМ(Результат, ЭлементСписка) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда  
		ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 1;
		ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;
		Маркировка = Истина;
	Иначе 
	    Маркировка = Ложь;	
	КонецЕсли;
	
	Если Элементы._РедактированиеСтрокиНаТСД.Видимость  Тогда
		Элементы.ПоФакту.ТолькоПросмотр = Маркировка; 
		Количество = ЭлементСписка.КоличествоУпаковок;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере 
Функция ПолучитьКоличествоКодовМаркировки(Номенклатура)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ШтрихкодыУпаковокТоваров.Ссылка) КАК КоличествоКМ,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Номенклатура = &Номенклатура
		|	И ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковок)
		|
		|СГРУППИРОВАТЬ ПО
		|	ШтрихкодыУпаковокТоваров.Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", Объект.ШтрихкодыУпаковок.Выгрузить(,"ШтрихкодУпаковки"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КоличествоКМ;
	Иначе  
		Возврат 0;
	КонецЕсли;
	

КонецФункции

&НаСервере
Функция  ПроверитьУпаковку(ШтрихкодыМассив)  
	
	Штрихкоды = Новый Массив;
	
	Штрихкоды.Добавить(Новый Структура("Штрихкод",ШтрихкодыМассив[0])); 
	
		
	ДанныеДляТСД = Новый Структура;
	ДанныеДляТСД.Вставить("Штрихкоды",                         Штрихкоды);
	ДанныеДляТСД.Вставить("ПараметрыСканирования",             (Новый Структура("ДопустимыеВидыПродукции,СохранятьКодыМаркировкиВПулИСМП",Неопределено, Ложь)));
	ДанныеДляТСД.Вставить("СоответствиеШтрихкодовСтрокДерева", неопределено);
	ДанныеДляТСД.Вставить("ДополнительныеПараметры",           неопределено);
	
  	
	ПараметрыЛогирования = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
	ЛогированиеЗапросовИС.ВключитьЛогированиеЗапросов(ПараметрыЛогирования,, Истина);
	ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыЛогирования);
	
	Результат = ГрупповаяОбработкаШтрихкодовИС.РезультатЗагрузкиШтрихкодовИзТСД();
	
	ГрупповаяОбработкаШтрихкодовИС.ДополнитьУпорядочитьДанныеТСД(ДанныеДляТСД.Штрихкоды);
	
	ДанныеШтрихкодов            = Новый Массив();
	КешДанныхРазбора            = Новый Соответствие();
	МассивПропущенныхШтрихкодов = Новый Массив();
	
	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.РасширеннаяДетализация = ДанныеДляТСД.ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП;
	
	ОбщиеНастройкиРазбора = РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки(
		ДанныеДляТСД.ПараметрыСканирования.ДопустимыеВидыПродукции, Ложь);
	
	НастройкиРазбораКодаМаркировки = Новый Структура;
	НастройкиРазбораКодаМаркировки.Вставить("Кеш",              РазборКодаМаркировкиИССлужебныйКлиентСервер.ИнициализироватьНастройкиИспользующиеРезультатыПредыдущихРазборов());
	НастройкиРазбораКодаМаркировки.Вставить("Общие",            ОбщиеНастройкиРазбора);
	НастройкиРазбораКодаМаркировки.Вставить("Пользовательские", ПользовательскиеПараметрыРазбораКодаМаркировки);
	
	Для Каждого СтрокаДанныхТСД Из ДанныеДляТСД.Штрихкоды Цикл
		
		СтрокаДанныхТСД.Вставить("ШтрихкодСОшибкой",        Ложь);
		СтрокаДанныхТСД.Вставить("НормализованныйШтрихкод", СтрокаДанныхТСД.Штрихкод);
		СтрокаДанныхТСД.Вставить("Уровень",                 0);
		
		Штрихкод      = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.Base64ВШтрихкод(СтрокаДанныхТСД.Штрихкод);
		ДанныеРазбора = ГрупповаяОбработкаШтрихкодовИС.ВидУпаковкиИПредставлениеШтрихкодаУпрощенныйРазбор(
			Штрихкод,
			ДанныеДляТСД.ПараметрыСканирования.ДопустимыеВидыПродукции,
			КешДанныхРазбора,
			НастройкиРазбораКодаМаркировки);
		
		Если ДанныеРазбора.ВидУпаковки = Неопределено И Не ДанныеРазбора.КодМаркировкиСоответствуетНесколькимШаблонам Тогда
			
			Штрихкод = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(Штрихкод, "");
			
			ОбщегоНазначенияИС.СообщитьПользователюВФорму(
				УникальныйИдентификатор,
				СтрШаблон(
					НСтр("ru = 'Код %1 не является штрихкодом потребительской, групповой или логистической
					           |упаковки продукции, поддерживаемой ГИС МТ.'"),
					Штрихкод));
			
			МассивПропущенныхШтрихкодов.Добавить(СтрокаДанныхТСД);
			Продолжить;
			
		КонецЕсли;
	КонецЦикла;	

КонецФункции

&НаКлиенте
Процедура ВопросУдаленияКМ(Результат, ДанныеСтрокиМаркировки) Экспорт
	ЭлементСписка = ДанныеСтрокиМаркировки.ЭлементСписка;
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Объект.ШтрихкодыУпаковок.Удалить(ДанныеСтрокиМаркировки.ИдентификаторСтрокиМаркировка); 
		ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 2;
		ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;
		Сообщить("Код маркировки успешно удален из ордера!");
	Иначе 
		ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 1;   
		ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;	  
	КонецЕсли;
	Если Элементы._РедактированиеСтрокиНаТСД.Видимость Тогда
		Количество = ЭлементСписка.КоличествоУпаковок;
	КонецЕсли;	
КонецПроцедуры

 #КонецОбласти
