  
&НаКлиенте
Процедура Док_ВладелецПриИзмененииПосле(Элемент) 
	Если ЗначениеЗаполнено(Объект.Владелец) И ВладелецКонкурент(Объект.Владелец) Тогда
		Объект.ЦенаВключаетНДС = Истина;
		Объект.ДоступноДляПродажиКлиентам = Истина;
		Объект.ДоступноДляЗакупки = Ложь;
	КонецЕсли;
	Название = "";
	Если ЗначениеЗаполнено(Объект.ГруппаВидовЦен) Тогда
		Название = Название + (Объект.ГруппаВидовЦен);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегионПрисутствия) Тогда
		Название = Название+"_" + (Объект.РегионПрисутствия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ФорматПодразделения) Тогда
		Название = Название +"_"+ (Объект.ФорматПодразделения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Название = Название+"_" + (Объект.Владелец);
	КонецЕсли;
	Объект.Наименование = Название;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВладелецКонкурент(Владелец)
	Возврат Владелец.Парсинг;
КонецФункции

&НаКлиенте
Процедура Док_ГруппаВидовЦенПриИзмененииПосле(Элемент)
	Название = "";
	Если ЗначениеЗаполнено(Объект.ГруппаВидовЦен) Тогда
		Название = Название + (Объект.ГруппаВидовЦен);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегионПрисутствия) Тогда
		Название = Название+"_" + (Объект.РегионПрисутствия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ФорматПодразделения) Тогда
		Название = Название +"_"+ (Объект.ФорматПодразделения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Название = Название+"_" + (Объект.Владелец);
	КонецЕсли;
	Объект.Наименование = Название;
КонецПроцедуры

&НаКлиенте
Процедура Док_РегионПрисутствияПриИзмененииПосле(Элемент)
	Название = "";
	Если ЗначениеЗаполнено(Объект.ГруппаВидовЦен) Тогда
		Название = Название + (Объект.ГруппаВидовЦен);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегионПрисутствия) Тогда
		Название = Название+"_" + (Объект.РегионПрисутствия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ФорматПодразделения) Тогда
		Название = Название +"_"+ (Объект.ФорматПодразделения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Название = Название+"_" + (Объект.Владелец);
	КонецЕсли;
	Объект.Наименование = Название;
КонецПроцедуры

&НаКлиенте
Процедура Док_ФорматПодразделенияПриИзмененииПосле(Элемент)
	Название = "";
	Если ЗначениеЗаполнено(Объект.ГруппаВидовЦен) Тогда
		Название = Название + (Объект.ГруппаВидовЦен);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегионПрисутствия) Тогда
		Название = Название+"_" + (Объект.РегионПрисутствия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ФорматПодразделения) Тогда
		Название = Название +"_"+ (Объект.ФорматПодразделения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Название = Название+"_" + (Объект.Владелец);
	КонецЕсли;
	Объект.Наименование = Название;
КонецПроцедуры


