
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) <> Тип("Массив") Тогда
		МассивДокументов = Новый Массив();
		МассивДокументов.Добавить(ПараметрКоманды);
	Иначе
		МассивДокументов = ПараметрКоманды;
	КонецЕсли; 
	
	ОписаниеПроцедурыЗавершения= Новый ОписаниеОповещения("Печать", ЭтотОбъект, МассивДокументов);
	УправлениеПечатьюКлиент.ПроверитьПроведенностьДокументов(ОписаниеПроцедурыЗавершения, МассивДокументов, ПараметрыВыполненияКоманды.Источник);
КонецПроцедуры

&НаКлиенте
Процедура Печать(Результат, МассивДокументов) Экспорт 
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ПутевойЛист",
	"ПутевойЛистБОт01092023",
	МассивДокументов,
	,
	Неопределено
	);
КонецПроцедуры
