//Отборы
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОрганизация));
КонецПроцедуры

&НаКлиенте
Процедура ОтборОсновнойМенеджерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ОсновнойМенеджер", ОтборОсновнойМенеджер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОсновнойМенеджер));
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Автор", ОтборАвтор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборАвтор));
КонецПроцедуры

&НаКлиенте
Процедура ОтборИсполненПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Исполнен", ОтборИсполнен, ВидСравненияКомпоновкиДанных.Равно,, ОтборИсполнен);
КонецПроцедуры
//Отборы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Параметры.Свойство("Основание") Тогда
		Если ЗначениеЗаполнено(Параметры.Основание) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Основание", Параметры.Основание, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Параметры.Основание));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
