
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СОтбором") Тогда
		Список.ТекстЗапроса ="
			|ВЫБРАТЬ
			|	ДоплатыПоВнутреннимЗатратамРейса.Наименование КАК Наименование,
			|	ДоплатыПоВнутреннимЗатратамРейса.Код КАК Код	
			|ИЗ Справочник.ДоплатыПоВнутреннимЗатратамРейса КАК ДоплатыПоВнутреннимЗатратамРейса
			|Внутреннее Соединение РегистрСведений.СтоимостьДопТочкиИВнутреннихЗатрат КАК СтоимостьДопТочкиИВнутреннихЗатрат
			|ПО СтоимостьДопТочкиИВнутреннихЗатрат.Тариф = ДоплатыПоВнутреннимЗатратамРейса.Ссылка
			|Где СтоимостьДопТочкиИВнутреннихЗатрат.Подразделение = &Подразделение 
			|СГруппировать ПО
			|	ДоплатыПоВнутреннимЗатратамРейса.Наименование,
			|	ДоплатыПоВнутреннимЗатратамРейса.Код";
		Если Параметры.Свойство("Подразделение") И Параметры.Подразделение <> Неопределено Тогда
			Список.Параметры.УстановитьЗначениеПараметра("Подразделение", Параметры.Подразделение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
