#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	
	КолДнейВМес = День(КонецМесяца(ПериодРегистрации));
	
	// регистр ГрафикВыходаВодителей 
	Движения.ГрафикВыходаВодителей.Записывать = Истина;
	Для Каждого ТекСтрокаГрафик Из График Цикл
		Если Не ЗначениеЗаполнено(ТекСтрокаГрафик.Водитель) Тогда
			Продолжить;
		КонецЕсли;
		
		Для сч = 1 По 31 Цикл
			Движение = Движения.ГрафикВыходаВодителей.Добавить();
			Движение.Период = ПериодРегистрации + (сч-1) * 3600 * 24;
			Движение.Подразделение = Подразделение;
			Движение.Водитель = ТекСтрокаГрафик.Водитель;
			Движение.ПланФакт = ПланФакт;
			
			стрЗначение = СокрЛП(ТекСтрокаГрафик["Представление"+сч]);
			Если стрЗначение = "1" Тогда
				Движение.ПлановыйВыход = 1;
			ИначеЕсли  НРег(стрЗначение) = "в1" Тогда
				Движение.ВнеплановыйВыход = 1;
			ИначеЕсли  НРег(стрЗначение) = "в" Тогда
				Движение.Выходной= 1;
			ИначеЕсли  НРег(стрЗначение) = "н" Тогда
				Движение.НеВыход= 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли