//Программистам! Команда для скана с эмулятора определена (СчитатьШтрикодКамера), выводите на форму и пользуйтесь
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущийСтатус; //клиентский кеш статуса документа (нужен для возможности отката изменения пользователем статуса)

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

#КонецОбласти
              
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВремяСохраненияДокументов = Константы.ВремяСохраненияДокументов.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ОтображатьОстатки = Истина;
	Если АльтерраОбщегоНазначения.ПолучитьОграничениеДоступностиОстатков() Тогда
		Если Объект.РабочийУчасток.СкрытьКоличествоПоУчету Тогда
			ОтображатьОстатки = АльтерраОбщегоНазначения.ЕстьПравоПросмотраОстатков(Объект.Сотрудник.Пользователь);
		КонецЕсли;
	КонецЕсли;
	Элементы.ГруппаОстаток.Видимость = ОтображатьОстатки;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма, "ОтгружаемыеТовары");
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ТоварыПоРаспоряжениям);
	КонецЕсли;
	
	Если Параметры.Свойство("Сотрудник") Тогда
		ИсполнительСотрудник = Параметры.Сотрудник;
	КонецЕсли;
	
	Если Параметры.Свойство("Секции") Тогда
		СекцииСотрудника.ЗагрузитьЗначения(Параметры.Секции);
	КонецЕсли;
	
	ДоступныеЯчейкиНастройкаСписка();
	
	ОтображатьХарактеристики = Ложь;
	
	ЗаполнитьДополнительныеПоля();
	
	УстановитьВидимостьХарактеристик();
	
	ЗаполнитьСобранныеОрдера();
	
	Элементы.ГруппаСобранныеОрдера.Видимость = СобранныеОрдера.Количество()<>0;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УстановитьДоступность();
	
	Если Объект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению Тогда
		_НомерВерсииПеремещения = ПолучитьНомерВерсииПеремещения();
	КонецЕсли; 
	
	//Подключение оповещений из очереди
	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = Объект.Сотрудник.ОповещенияИзОчереди; 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;
	Для каждого Стр Из СекцииСотрудника Цикл
		ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
		Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
			Инт = ЗнчИнтервала;
		КонецЕсли; 
	КонецЦикла; 
	ИнтервалОповещений = Инт; 
	
	//Нарезка
	Для каждого Строка из Объект.ОтгружаемыеТовары Цикл  
		Строка.ЕстьНарезка = НайтиСтрокуНарезки(Строка.Номенклатура,Строка.Характеристика,Ложь);
	КонецЦикла;   
	
	
	//Маркировка + 
	АктуализироватьМаркировку(); 
	 
	//Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Подготовлен") Тогда
	//	Для каждого Строка из Объект.ОтгружаемыеТовары Цикл
	//		Если Строка.Маркировка Тогда 
	//			Строка.КоличествоУпаковок = 0;
	//			Строка.Количество = 0; 
	//		КонецЕсли;
	//	КонецЦикла; 
	//	Объект.ШтрихкодыУпаковок.Очистить();
	//КонецЕсли;   
	//Маркировка -

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ТекущийСтатус = Объект.Статус;

	Если ВремяСохраненияДокументов > 0 Тогда
		ПодключитьОбработчикОжидания("ОбработатьОжидание", ВремяСохраненияДокументов, Ложь);
	КонецЕсли;  
	
	Если ОповещенияИзОчереди Тогда 
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли; 
	
	Для каждого Строка Из Объект.ОтгружаемыеТовары Цикл 
		Если Строка.ЕстьНарезка Тогда 
			Элементы.ВниманиеНарезка.Видимость = Истина;
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
функция НайтиСтрокуНарезки(Номенклатура,Характеристика,ПередатьСтроку = Истина)
	
	МассивНайдСтрок = Объект.Нарезка.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика));  
	
	Для каждого НайдСтрока Из МассивНайдСтрок Цикл
		Если ПередатьСтроку Тогда
			Возврат НайдСтрока;
		Иначе 
			Возврат Истина; 
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ложь;	
КонецФункции                

&НаСервере
Функция ПолучитьСтрокуНарезки(Номенклатура, Характеристика)
	
	СтрокаНарезки.Очистить();
	
	НайдСтрока = НайтиСтрокуНарезки(Номенклатура,Характеристика);
	Если ТипЗнч(НайдСтрока)<> Тип("Булево") Тогда
		НС = СтрокаНарезки.Добавить(); 
		ЗаполнитьЗначенияСвойств(НС,НайдСтрока); 
		Возврат Истина; 
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
Конецфункции

                    
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);

	Если ВремяСохраненияДокументов > 0 Тогда
		ОтключитьОбработчикОжидания("ОбработатьОжидание");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары", Истина);
	ЗаполнитьПризнакРасхождение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		//+Альтерра
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 =  Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			
			Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.НовыйШтрихкод Тогда
				НовыйШтрихкод = "";
				Если ТипЗнч(Параметр) = Тип("Строка") Тогда 
					НовыйШтрихкод = Параметр;
				КонецЕсли;	
			ИначеЕсли Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Ложь
				И Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Ложь
				И Элементы.ВыборЯчейки.Видимость = Истина Тогда
				
				ОбработатьШтрихкод(ШтрихКод1[0]);
				
			ИначеЕсли ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СчитатьШтрикодКамера Тогда 
				ОбработатьШтрихкодыЯчейки(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Штрихкод1));
			Иначе 
				//Маркировка +	 
				СтруктураКодаМаркировки = Неопределено;
				ЭтоКодМаркировки = МаркировкаАльтерра.ЭтоКодМаркировки(ШтрихКод1);	
				Если ЭтоКодМаркировки Тогда
					СтруктураКодаМаркировки = МаркировкаАльтерра.ПолучитьСтруктуруКодаМаркировки(ШтрихКод1[0]);
					Штрихкод1[0] = СтруктураКодаМаркировки.СоставКодаМаркировки.EAN; 	
				КонецЕсли; 
				//Маркировка -	
				ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Штрихкод1),СтруктураКодаМаркировки);
			КонецЕсли;
		КонецЕсли;
		//-
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры  

Функция ПолучитьНомерВерсииПеремещения()
	Возврат АльтерраОбщегоНазначения.ПолучитьКоличествоЗаписейВРегистреСобытияДокументов(ПолучитьПеремещениеПоЗаказам(),Перечисления.СобытияДокументов.ИзменениеТабличнойЧасти);
КонецФункции

Функция ПолучитьПеремещениеПоЗаказам()
	
	СсылкаНаПеремещение = Документы.ПеремещениеТоваров.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
		|ПОМЕСТИТЬ ВТ_Распоряжения
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Распоряжения КАК ВТ_Распоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ПО (ПеремещениеТоваровТовары.Ссылка = ВТ_Распоряжения.Распоряжение
		|				ИЛИ ПеремещениеТоваровТовары.ЗаказНаПеремещение = ВТ_Распоряжения.Распоряжение)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СсылкаНаПеремещение = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СсылкаНаПеремещение;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоФактуПриИзменении(Элемент)
	
	Если ФактическоеКоличество <= ПлановоеКоличество Тогда
		ТекущаяСтрока = Объект.ОтгружаемыеТовары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.КоличествоУпаковок = ФактическоеКоличество;
			Действия = Новый Структура();
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, Действия);					
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
			
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.УпаковочныйЛистРодитель) Тогда
				ПересчитатьКоличествоМест();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ФактическоеКоличество = 0;
		#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товара больше!","ru-RU");
			Иначе
				СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();
			КонецЕсли;
		#КонецЕсли
		Сообщить("Товара больше, чем в распоряжении!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьУпаковочныеЛистыПриИзменении(Элемент)
	
	Элементы.ОтгружаемыеТоварыГруппаУпаковочныйЛист.Видимость = ОтображатьУпаковочныеЛисты;
	Элементы.ОтгружаемыеТоварыГруппаУпаковочныеЛисты.Видимость = ОтображатьУпаковочныеЛисты; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтгружаемыеТовары

&НаКлиенте
Процедура ОтгружаемыеТоварыПередУдалением(Элемент, Отказ)
	 УпаковочныеЛистыКлиент.ПередУдалениемСтрокТЧСУпаковочнымиЛистами(Элементы.ОтгружаемыеТовары, КэшированныеЗначения, ПараметрыУказанияСерий.ОтгружаемыеТовары);
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыПослеУдаления(Элемент)
	//ТоварыПослеУдаленияСервер(КэшированныеЗначения);
	//ПодключитьОбработчикОжидания("ОтобразитьИнформациюПоНеотгружаемымТоварамКлиент",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыНоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииСервер(КэшированныеЗначения);
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УпаковочныеЛистыКлиент.НачалоВыбораТоварногоМеста(ЭтаФорма, Элемент, СтандартнаяОбработка, Объект.РежимПросмотраПоТоварам);
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыУпаковочныйЛистНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УпаковочныеЛистыКлиент.НачалоВыбораТоварногоМеста(ЭтаФорма, Элемент, СтандартнаяОбработка, Объект.РежимПросмотраПоТоварам);
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//+Альтерра
	//#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда       
	Если Элементы.ОтгружаемыеТовары.ТолькоПросмотр Тогда
		Возврат
	КонецЕсли;
		
		ТекущаяСтрокаТСД = Элементы.ОтгружаемыеТовары.ТекущаяСтрока;
		
		Если типзнч(ТекущаяСтрокаТСД) <> Тип("Неопределено") Тогда
			
			ЭлементСписка = Объект.ОтгружаемыеТовары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
						
			Номенклатура = "";
			Характеристика = "";
			ПлановоеКоличество = 0;
		    ФактическоеКоличество = 0;
		    Ячейка = "";
			НоваяЯчейка = "";
			НовыйШтрихкод = "";
			ОстатокНаСкладе = 0;
			АдресКартинки="";

			Если ЭлементСписка <> Неопределено Тогда
				Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Ложь;
				Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Истина;
				Номенклатура = ЭлементСписка.Номенклатура;
				Характеристика = ЭлементСписка.Характеристика;
				ФактическоеКоличество = ЭлементСписка.КоличествоУпаковок;
				ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;
				ПлановоеКоличество = ЭлементСписка.КоличествоПлан;
				Ячейка = ПолучитьЯчейку(Номенклатура,Объект.Склад);
				ОстатокНаСкладе = ПолучитьОстаток(Номенклатура,Характеристика,Объект.Склад);
				ПолучитьАдресКартинки(Номенклатура); 
				Элементы.СтрокаНарезки.Видимость = ПолучитьСтрокуНарезки(Номенклатура,Характеристика);   
			//Маркировка+
			Элементы.ПоФакту.ТолькоПросмотр = МаркировкаАльтерра.НоменклатураПодлежитМаркировке(ЭлементСписка.Номенклатура);
			//Маркировка-
			Конецесли;
	                        
		Иначе
			#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда

				Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
				Иначе
				СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();
				КонецЕсли;
			Сообщить("Штрихкод не найден!");
			#КонецЕсли

		КонецЕсли;
			
	//#КонецЕсли
	//-
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыУпаковочныйЛистПриИзменении(Элемент)
	УпаковочныйЛистПриИзмененииСервер(КэшированныеЗначения);
	Элементы.ОтгружаемыеТовары.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОтгружаемыеТовары.ТекущиеДанные;
	
	Действия = Новый Структура();
	Действия.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	Действия.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	Действия.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	Действия.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	Действия.Вставить("ПересчитатьКоличествоУпаковок"); 
	Действия.Вставить("ПересчитатьВесОбъем");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыВесПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковокПоВесу");
	
	ТекущаяСтрока = Элементы.ОтгружаемыеТовары.ТекущиеДанные;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыОбъемПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковокПоОбъему");
	
	ТекущаяСтрока = Элементы.ОтгружаемыеТовары.ТекущиеДанные;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОтгружаемыеТовары.ТекущиеДанные;
	Действия = Новый Структура();
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, Действия);					
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.УпаковочныйЛистРодитель) Тогда
		ПересчитатьКоличествоМест();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыДействиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.ОтгружаемыеТовары.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение <> ПредопределенноеЗначение("Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить") Тогда
		Если ТекущаяСтрока.ЭтоУпаковочныйЛист Тогда
			ТекстПредупреждения = НСтр("ru = 'Для строки упаковочного листа допустимо только действие %Отгрузить%. Для выбора другого действия сначала распакуйте товары.'");	
			ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения,"%Отгрузить%", ПредопределенноеЗначение("Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить"));
			ПоказатьПредупреждение(,ТекстПредупреждения);
			Возврат;
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.УпаковочныйЛистРодитель) Тогда
			ТекстВопроса = НСтр("ru = 'При изменении действия со строкой на %Действие% товар будет исключен из упаковочного листа. Продолжить?'");
			ТекстВопроса = СтрЗаменить(ТекстВопроса,"%Действие%", ВыбранноеЗначение);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтгружаемыеТоварыДействиеОбработкаВыбораЗавершение", ЭтаФорма, ДополнительныеПараметры);
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяСтрока.Действие = ВыбранноеЗначение;
	Модифицированность = Истина;
	
	Если Не ТекущаяСтрока.ЭтоУпаковочныйЛист Тогда		
		Действия = Новый Структура;
		Действия.Вставить("ПроверитьСериюРассчитатьСтатус",
			Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий.ОтгружаемыеТовары));
		
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыДействиеОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ОтгружаемыеТовары.ТекущиеДанные;
	ТекущаяСтрока.Действие = ДополнительныеПараметры.ВыбранноеЗначение;
	Модифицированность = Истина;
	
	Если Объект.РежимПросмотраПоТоварам = 1 Тогда
		ТекущаяСтрока.УпаковочныйЛистРодитель = Неопределено;
		ТекущаяСтрока.УпаковочныйЛистРодительКод = "";
		Действия = Новый Структура;
		Действия.Вставить("ПроверитьСериюРассчитатьСтатус",
			Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий.ОтгружаемыеТовары));
		
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
	Иначе
		РаспаковатьСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыУпаковочныйЛистРодительОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(Неопределено, Элементы.ОтгружаемыеТовары.ТекущиеДанные.УпаковочныйЛистРодитель);
КонецПроцедуры

&НаКлиенте
Процедура ОтгружаемыеТоварыУпаковочныйЛистРодительОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьПоРаспоряжению()
    
	Документы.РасходныйОрдерНаТовары.ЗаполнитьОтгружаемыеТоварыПоТоварамПоРаспоряжениям(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Распаковать(Команда)
	УпаковочныеЛистыКлиент.РаспаковатьУпаковочныйЛист(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Упаковать(Команда)
	
	Если Элементы.ОтгружаемыеТовары.ТекущиеДанные = Неопределено Тогда
		ТекстПредупреждения = НСтр("ru='Выберите строки для объединения.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	НовыйУпаковочныйЛист = УпаковатьСервер();
	
	Если ЗначениеЗаполнено(НовыйУпаковочныйЛист) Тогда
		ТекстОповещения = НСтр("ru='Создание:'");
		ПоказатьОповещениеПользователя(ТекстОповещения,
			ПолучитьНавигационнуюСсылку(НовыйУпаковочныйЛист),
			НовыйУпаковочныйЛист,
			БиблиотекаКартинок.Информация32);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	ТекущаяКолонка = Элементы.ОтгружаемыеТовары.ТекущийЭлемент;
	
	Если ТекущаяКолонка <> Неопределено Тогда
		СортироватьСтроки(ТекущаяКолонка.Имя, "ВОЗР");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	ТекущаяКолонка = Элементы.ОтгружаемыеТовары.ТекущийЭлемент;
	
	Если ТекущаяКолонка <> Неопределено Тогда
		СортироватьСтроки(ТекущаяКолонка.Имя, "УБЫВ");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоЯчейке(Команда)
	СортироватьСтроки("ОтгружаемыеТоварыЯчейка", "ВОЗР");
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВесу(Команда)
	
	Действия = Новый Структура();
	Действия.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	Действия.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	Действия.Вставить("ПересчитатьВесОбъем");
	Для каждого Строка Из Объект.ОтгружаемыеТовары Цикл
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Строка, Действия, КэшированныеЗначения);
		Строка.Вес = Строка.КоличествоПлан*Строка.ВесУпаковки;
	КонецЦикла; 

	СортироватьСтроки("ОтгружаемыеТоварыВес", "Убыв");
	Элементы.ОтгружаемыеТоварыВес.Видимость = Ложь;
	Элементы.ОтгружаемыеТоварыВесУпаковки.Видимость = Ложь;
	Элементы.ОтгружаемыеТоварыЯчейка.Видимость = Истина;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры


&НаКлиенте
Процедура Отложить(Команда)
	
	ОбщегоНазначенияУТКлиент.ЗаписатьИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору") Тогда
		ЗаполнитьПоРаспоряжению();
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Подготовлен");
		СтатусПриИзмененииСервер();
		ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма,,Новый ОписаниеОповещения("ОповеститьОбИзмененииСтатусаОрдера",ЭтотОбъект));
	Иначе
		Закрыть();
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура УдалитьДокументНаСервере(ссылка)
	ДокументОбъект = Ссылка.ПолучитьОбъект(); 
	ДокументОбъект.УстановитьПометкуУдаления(Истина); 
КонецПроцедуры   
&НаКлиенте
Процедура Собрать(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору");
	СтатусПриИзмененииСервер();
	Попытка
		ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма,Истина,Новый ОписаниеОповещения("ОповеститьОбИзмененииСтатусаОрдера",ЭтотОбъект));
		АктуализироватьМаркировку();
	Исключение 
		Сообщить("Документ уже собирается");   
		УдалитьДокументНаСервере(Объект.Ссылка);
		Закрыть(); 
	КонецПопытки;  
	ОчиститьКоличествоОтгружаемыеТовары();
	
	ТолькоРасхождения = Истина;	
	
	Если ВремяСохраненияДокументов > 0 Тогда
		ОтключитьОбработчикОжидания("ОбработатьОжидание");
		ОбработатьОжидание();
		ПодключитьОбработчикОжидания("ОбработатьОжидание", ВремяСохраненияДокументов, Ложь);
	КонецЕсли;  
	
	УстановитьДоступность();
	
	Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(ПредопределенноеЗначение("Перечисление.СобытияРаботыТСД.Документ"),,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Собрано(Команда)
	
	Если ФактическоеКоличествоСовпадаетСПлановым() Тогда
		
		Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Ложь;
		Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Ложь;
		Элементы.ВыборЯПХ.Видимость = Истина;
		
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросСобратьЧастично",ЭтотОбъект); 
		СписокКнопок = Новый СписокЗначений; 
		СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Я не нашел"); 
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Дособирать");
		
		ПоказатьВопрос(Оповещение, "Внимание, вы не дособирали",  СписокКнопок,0,, "Состояние");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура _ПрисвоитьШК(Команда)
	
	СоздатьШК(НовыйШтрихкод);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяОтСборки(Команда)
	 
	ВВестиЗначение(Объект.ПричинаОтказаОтСборки,"Выберите причину отказа",Тип("ПеречислениеСсылка.ПричиныОтказаОтСборки"));
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура _ИзменитьЯчейку(Команда)
	
	Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Ложь;
	Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Ложь;
	Элементы.ВыборЯчейки.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКТЧ(Команда)
	
	ЗаполнитьПризнакРасхождение();	
	Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Истина;
	Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Ложь; 
	
КонецПроцедуры

&НаКлиенте
Процедура Выдать(Команда)
	
	Если ФактическоеКоличествоСовпадаетСПлановым() Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен");
		СтатусПриИзмененииСервер();
		Сообщить("Создан " + Строка(Объект.Ссылка) + " в статусе " + Строка(Объект.Статус));
		ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма,,Новый ОписаниеОповещения("ОповеститьОбИзмененииСтатусаОрдера",ЭтотОбъект));
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросВыдатьЧастично",ЭтотОбъект); 
		СписокКнопок = Новый СписокЗначений; 
		СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Выдать частично"); 
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		
		ПоказатьВопрос(Оповещение, "Документ не полностью собран",  СписокКнопок,0,, "Состояние");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//
    ПараметрыУсловногоОформления = НоменклатураСервер.НовыеПараметрыУсловногоОформленияЕдиницИзмерения();
	ПараметрыУсловногоОформления.ИмяПоляЕдиницаИзмерения = "ОтгружаемыеТоварыНоменклатураЕдиницаИзмерения";
	ПараметрыУсловногоОформления.ПутьКПолюУпаковка = "Объект.ОтгружаемыеТовары.Упаковка";
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма, ПараметрыУсловногоОформления);
	
	
	//

	СкладыСервер.УстановитьУсловноеОформлениеПоДействиюВСтроке(ЭтотОбъект);
	
	//
	
	
	//

	//НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма,
	//																		"ОтгружаемыеТоварыХарактеристика",
	//																		"Объект.ОтгружаемыеТовары.ХарактеристикиИспользуются");
																			
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгружаемыеТоварыДопИнфоУпаковочныйЛист.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгружаемыеТоварыУпаковочныйЛист.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.КоличествоЗаполненныхПодчиненныхПозиций");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.ЭтоУпаковочныйЛист");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	//
		
	//

	//УпаковочныеЛистыСервер.УстановитьУсловноеОформлениеСУчетомУпаковочныхЛистов(ЭтаФорма, "ОтгружаемыеТовары");
	
	//

	//НоменклатураСервер.УстановитьУсловноеОформлениеНазначенияНоменклатуры(ЭтаФорма,
																		//"ОтгружаемыеТоварыНазначение",
																		//"Объект.ОтгружаемыеТовары.ТипНоменклатуры");
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгружаемыеТовары.Имя);
	
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.КоличествоУпаковок");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.КоличествоПлан");
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	 Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгружаемыеТовары.Имя);
	
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.КоличествоУпаковок");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
    ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.КоличествоПлан");
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгружаемыеТовары.Имя);
	
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.КоличествоУпаковок");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
    ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.КоличествоПлан");
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтый);
	
	Элементы.ОтгружаемыеТоварыЯчейка.ЦветТекста = WebЦвета.Черный;
	Элементы.ОтгружаемыеТоварыНоменклатура.ЦветТекста = WebЦвета.Красный;
	
	//Элементы.ОтгружаемыеТоварыЯчейка.Шрифт.Размер=12;
	
	//Нарезка
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгружаемыеТовары.Имя);
	
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгружаемыеТовары.Естьнарезка");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЭлемента.ПравоеЗначение = Истина;
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(228,232,255));

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад,Помещение",Объект.Склад,Объект.Помещение));
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.РасходныйОрдерНаТовары));
			
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ТоварыПоРаспоряжениям", Ложь);
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары", Ложь);
	
	ТипОтгрузки = "Самовывоз";
			
КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура СкладПомещениеПриИзмененииСервер()
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад,Помещение",Объект.Склад,Объект.Помещение));
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.РасходныйОрдерНаТовары));
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ТоварыПоРаспоряжениям);
	
	НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку = ПолучитьФункциональнуюОпцию("НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку", Новый Структура("Склад", Объект.Склад));
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусНаАдресномСкладе()	
	НовыйСтатус   = Объект.Статус;
	СтатусПриИзмененииСервер();
	ПодключитьОбработчикОжидания("ОтобразитьИнформациюПоНеотгружаемымТоварамКлиент",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриСменеСтатусаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	Иначе
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Объект.Статус = ДополнительныеПараметры.НовыйСтатус;
	
	ИзменитьСтатусНаАдресномСкладе();
	
	ТекущийСтатус = Объект.Статус;
	
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииСервер()
	
	Документы.РасходныйОрдерНаТовары.ЗаполнитьДействиеВСтроках(Объект);
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.РасходныйОрдерНаТовары));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
	
	Если Объект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
		Объект.ДатаОтгрузки = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКоличествоОтгружаемыеТовары()
	
	Для каждого СтрокаТаблицы из Объект.ОтгружаемыеТовары Цикл 
		СтрокаТаблицы.КоличествоУпаковок = 0;
		СтрокаТаблицы.Количество = 0; 
	КонецЦикла;
	
	Объект.ШтрихкодыУпаковок.Очистить();	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов,СтруктураКодаМаркировки = Неопределено)
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьВесОбъем");
	
	Действия = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	Действия.Штрихкоды                              = ДанныеШтрихкодов;
	Действия.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	Действия.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	Действия.ПараметрыУказанияСерий                 = ПараметрыУказанияСерий.ОтгружаемыеТовары;
	Действия.ТолькоТовары                           = Истина;
	Действия.ИмяТЧ                                  = "ОтгружаемыеТовары";
	//+Альтерра
	Действия.ЗаполнятьНазначения                	= Истина; 
	Действия.НеИспользоватьУпаковки             	= Истина;
	//-
	
	ОбработатьШтрихкодыСервер(Действия,КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(Действия,КэшированныеЗначения,ЭтаФорма);
	
	Если ШтрихкодированиеНоменклатурыКлиент.НужноОткрытьФормуУказанияСерийПослеОбработкиШтрихкодов(Действия) Тогда
		
		ТекущиеДанныеИдентификатор = Действия.МассивСтрокССериями[0];
		
		ПодключитьОбработчикОжидания("ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры",0.1,Истина);
		
	КонецЕсли;
	
	УпаковочныеЛистыКлиент.ОбновитьКешированныеЗначенияДляТЧСУпаковочнымиЛистами(Элементы.ОтгружаемыеТовары, КэшированныеЗначения, ПараметрыУказанияСерий.ОтгружаемыеТовары);
	
	//ЗаполнитьПризнакРасхождение();
	//+Альтерра
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		ТекущаяСтрокаТСД = Действия.ТекущаяСтрока;
		ЭлементСписка = Объект.ОтгружаемыеТовары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
		

		Если ТипЗнч(ЭлементСписка) <> Тип("Неопределено") Тогда 
	
			//Маркировка +
			ЭлементСписка.Маркировка = Ложь;
			Если СтруктураКодаМаркировки = Неопределено Тогда
				Если МаркировкаАльтерра.НоменклатураПодлежитМаркировке(ЭлементСписка.Номенклатура) Тогда 
					Сообщить("Отсканируйте код маркировки");
					ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 1; 
					ЭлементСписка.Количество = ЭлементСписка.Количество - 1; 
					Возврат;
				КонецЕсли;
			Иначе  
				ИндексТекСтроки = ЭлементСписка.НомерСтроки -1;
				//ТекСтрока = Объект.ОтгружаемыеТовары.Получить(ИндексТекСтроки);
				
				ЭлементСписка.Маркировка = Истина; 
			    СтруктураНоменклатуры = Новый Структура("Номенклатура,Серия,Характеристика", ЭлементСписка.Номенклатура,ЭлементСписка.Серия,ЭлементСписка.Характеристика); 
			    СсылкаНаШтрихкодМаркировки = МаркировкаАльтерра.ПолучитьСсылкуНаШтрихкодМаркируемогоТовара(СтруктураКодаМаркировки,СтруктураНоменклатуры);
			    ИдентификаторСтрокиМаркировка =  ПолучитьСтрокуШтрихкодыУпаковок(СсылкаНаШтрихкодМаркировки);    
				
                ВидПродукции = МаркировкаАльтерра.ОпределитьВидПродукции(ЭлементСписка.Номенклатура,СтруктураКодаМаркировки.ВидыПродукции); 
				  
			    ДанныеСтрокиМаркировки = Новый Структура("ИндексТекСтроки,СсылкаНаШтрихкодМаркировки,ИдентификаторСтрокиМаркировка,МассивКодовМаркировкиЧЗ,ВидПродукции",
			    ИндексТекСтроки,СсылкаНаШтрихкодМаркировки,ИдентификаторСтрокиМаркировка,СтруктураКодаМаркировки.МассивКодовМаркировкиЧЗ,ВидПродукции);  
				
				Если ИдентификаторСтрокиМаркировка <> Неопределено Тогда   
					
					Если Номенклатура   <> ЭлементСписка.Номенклатура Тогда
						Номенклатура = "";
						Характеристика = "";
						ПлановоеКоличество = 0;
						ФактическоеКоличество = 0;
						Ячейка = "";
						НоваяЯчейка = "";
						НовыйШтрихкод = "";             
						ОстатокНаСкладе = 0;
						АдресКартинки="";
						
						Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Ложь;
						Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Истина;
						Элементы.ПоФакту.ТолькоПросмотр = Истина;						
						Номенклатура = ЭлементСписка.Номенклатура;
						Характеристика = ЭлементСписка.Характеристика;
						ФактическоеКоличество = ЭлементСписка.КоличествоУпаковок;
						ПлановоеКоличество = ЭлементСписка.КоличествоПлан;
						Ячейка = ПолучитьЯчейку(Номенклатура,Объект.Склад);	
						ОстатокНаСкладе = ПолучитьОстаток(Номенклатура,Характеристика,Объект.Склад);
						ПолучитьАдресКартинки(Номенклатура);  
					КонецЕсли;
					
					
					ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУдаленияКМ", ЭтотОбъект, ДанныеСтрокиМаркировки), 
					"Код маркировки уже присутствует в документе. Удалить КМ?",РежимДиалогаВопрос.ДаНет);
					ЭлементСписка.Маркировка = Истина;  
					Возврат; 	
				КонецЕсли;
				
			КонецЕсли; 
			
		  
			//Маркировка -  
			
			Если ЭлементСписка.КоличествоУпаковок > ЭлементСписка.КоличествоПлан  Тогда
				Если ЭлементСписка.КоличествоПлан = 0 Тогда
					Объект.ОтгружаемыеТовары.Удалить(ЭлементСписка);
					Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
						СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
					Иначе
						СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();
					КонецЕсли;
					Сообщить("Товара нет в наборке!");
				Иначе 					
					ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоПлан;
					Действия = Новый Структура();
					ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, Действия);					
					ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ЭлементСписка, Действия, КэшированныеЗначения);
					
					Если Не ЗначениеЗаполнено(ЭлементСписка.УпаковочныйЛистРодитель) Тогда
						ПересчитатьКоличествоМест();
					КонецЕсли;
					
					Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
						СредстваМультимедиа.ВоспроизвестиТекст("Товара больше!","ru-RU");
					Иначе
						СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();
					КонецЕсли;
					Сообщить("Товара больше, чем в распоряжении!");
				КонецЕсли;
				
			ИначеЕсли ЭлементСписка.КоличествоУпаковок < ЭлементСписка.КоличествоПлан Тогда
				
				Номенклатура = "";
				Характеристика = "";
				ПлановоеКоличество = 0;
				ФактическоеКоличество = 0;
				Ячейка = "";
				НоваяЯчейка = "";
				НовыйШтрихкод = "";
				ОстатокНаСкладе = 0;
				АдресКартинки="";
				
				Если ЭлементСписка <> Неопределено  Тогда
					Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Ложь;
					Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Истина;
				    Элементы.ПоФакту.ТолькоПросмотр = МаркировкаАльтерра.НоменклатураПодлежитМаркировке(ЭлементСписка.Номенклатура);
				    
					Номенклатура = ЭлементСписка.Номенклатура;
					Характеристика = ЭлементСписка.Характеристика;
					ФактическоеКоличество = ЭлементСписка.КоличествоУпаковок;
					ПлановоеКоличество = ЭлементСписка.КоличествоПлан;
					Ячейка = ПолучитьЯчейку(Номенклатура,Объект.Склад);	
					ОстатокНаСкладе = ПолучитьОстаток(Номенклатура,Характеристика,Объект.Склад);
					ПолучитьАдресКартинки(Номенклатура);
				КонецЕсли; 
				//Маркировка 
					Если ЭлементСписка.Маркировка  Тогда 
						ОбработатьСтрокуСМаркировкой(ДанныеСтрокиМаркировки);
						ФактическоеКоличество = ЭлементСписка.КоличествоУпаковок;
						ЗаполнитьПризнакРасхождение();
					КонецЕсли;
				//Маркировка
			Иначе   
				//Маркировка 
					Если ЭлементСписка.Маркировка  Тогда 
						ОбработатьСтрокуСМаркировкой(ДанныеСтрокиМаркировки);
					КонецЕсли;
				//Маркировка

					ЗаполнитьПризнакРасхождение();
					Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Истина;
					Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Ложь;  
			Конецесли; 
			
			
		Иначе
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
			Иначе
				СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();
			КонецЕсли;
			Сообщить("Штрихкод не найден!");
		КонецЕсли;
		
	#КонецЕсли
	//Альтерра-
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(Действия,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,Действия,КэшированныеЗначения);
	
	ПересчитатьКоличествоМест();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(ШтрихКод1) 	
	СсылкаНаЯчейку = ПолучитьЯчейкуПоШтрихкоду(ШтрихКод1); 
	Если СсылкаНаЯчейку <> Неопределено Тогда
		ДоступныеЯчейки.Отбор.Элементы.Очистить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейки, "Ссылка", СсылкаНаЯчейку, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		Сообщить("Ячейка не найдена!");
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция ПолучитьЯчейкуПоШтрихкоду(ШтрихКод1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда	
		Возврат ВыборкаДетальныеЗаписи.Ссылка;   
	Иначе 
		Возврат Неопределено; 
	КонецЕсли;
КонецФункции


#КонецОбласти

#Область УпаковочныеЛисты

&НаСервере
Процедура РежимПросмотраПриИзмененииСервер()
	
	УпаковочныеЛистыСервер.РежимПросмотраПриИзменении(ЭтаФорма, Объект.ОтгружаемыеТовары, Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ПриПереходеНаДругойУровеньСервер(НавигационнаяСсылка)
	УпаковочныеЛистыСервер.ПриПереходеНаДругойУровень(ЭтаФорма,
		Объект.ОтгружаемыеТовары, НавигационнаяСсылка, Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииСервер(КэшированныеЗначения)
	
	ТекущаяСтрока = Объект.ОтгружаемыеТовары.НайтиПоИдентификатору(Элементы.ОтгружаемыеТовары.ТекущаяСтрока);
	
	ДействияСТекущейСтрокой = Новый Структура;
	ДействияСТекущейСтрокой.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	ДействияСТекущейСтрокой.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу"      , ТекущаяСтрока.Упаковка);
	ДействияСТекущейСтрокой.Вставить("ПересчитатьКоличествоЕдиниц");
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));

	ДействияСТекущейСтрокой.Вставить("ПересчитатьВесОбъем");
	ДействияСТекущейСтрокой.Вставить("ПроверитьСериюРассчитатьСтатус",
						Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий.ОтгружаемыеТовары));

	ДействияСТекущейСтрокой.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "ОтгружаемыеТовары"));

	УпаковочныеЛистыСервер.НоменклатураУпаковочныйЛистПриИзменении(ЭтаФорма, Объект.ОтгружаемыеТовары,
		"ОтгружаемыеТоварыНоменклатура", КэшированныеЗначения, ДействияСТекущейСтрокой);
	
КонецПроцедуры

&НаСервере
Функция УпаковатьСервер()
	
	Возврат УпаковочныеЛистыСервер.УпаковатьСервер(ЭтаФорма);
	
КонецФункции

&НаСервере
Процедура ТоварыПослеУдаленияСервер(КэшированныеЗначения)
	
	УпаковочныеЛистыСервер.ПослеУдаленияВТЧСУпаковочнымиЛистами(ЭтаФорма, Объект.ОтгружаемыеТовары, Объект.РежимПросмотраПоТоварам);
	
КонецПроцедуры

// Обработчик, вызываемый после закрытия вопроса пользователю о распаковке
//
&НаКлиенте
Процедура ПослеЗакрытияВопросаОРаспаковке(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		РаспаковатьСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспаковатьСервер()
	
	УпаковочныеЛистыСервер.РаспаковатьУпаковочныйЛист(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТЧТовары(ИмяТЧ, Перенумеровать = Истина)
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры",
		Новый Структура("Номенклатура", "ТипНоменклатуры"));
	
	Если ИмяТЧ = "ОтгружаемыеТовары" Тогда
		Действия.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
		Действия.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	
		УпаковочныеЛистыСервер.ЗаполнитьСлужебныеРеквизиты(ЭтаФорма, Объект.ОтгружаемыеТовары, Действия, ,Перенумеровать);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОтобраннымТоварамСервер(ИзменениеСтатуса, НовыйСтатус)
	
	ПараметрыЗаполнения = СкладыСервер.ПараметрыЗаполненияОрдеровОтобраннымиТоварами();
	ПараметрыЗаполнения.РежимЗаполнения   = "Единичное";	
	Если ЗначениеЗаполнено(НовыйСтатус) Тогда
		ПараметрыЗаполнения.СтатусДокумента   = ОбщегоНазначения.ИмяЗначенияПеречисления(НовыйСтатус);
	КонецЕсли;
	ПараметрыЗаполнения.ИзменениеСтатуса  = ИзменениеСтатуса;	
	ПараметрыЗаполнения.ДокументОбъект    = Объект;	
	
	СкладыСервер.ЗаполнитьОрдераОтобраннымиТоварами(ПараметрыЗаполнения, Модифицированность);	
	
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары");
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.РасходныйОрдерНаТовары));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
    ОтобразитьИнформациюПоНеотгружаемымТоварам();
	
КонецПроцедуры

&НаСервере
Процедура РазбитьСправочноПоУпаковкамСервер()
	
	Документы.РасходныйОрдерНаТовары.РазбитьПоУпаковкамСправочно(Объект);
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары");
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
	УпаковочныеЛистыСервер.ПеренумероватьСтроки(ЭтотОбъект, Объект.ОтгружаемыеТовары);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИРазбитьПоУпаковкамСервер()

	Документы.РасходныйОрдерНаТовары.ЗаполнитьОтгружаемыеТоварыПоТоварамПоРаспоряжениям(Объект);
	Документы.РасходныйОрдерНаТовары.РазбитьПоУпаковкамСправочно(Объект);
	
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары");
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(Форма, Действия)
	
	Действия.Вставить("ПересчитатьКоличествоЕдиниц");
	Действия.Вставить("ПересчитатьВесОбъем");
	Действия.Вставить("ПроверитьСериюРассчитатьСтатус",
			Новый Структура("Склад, ПараметрыУказанияСерий", Форма.Объект.Склад, Форма.ПараметрыУказанияСерий.ОтгружаемыеТовары));
	
КонецФункции

&НаСервере
Процедура УстановитьДоступность()
	
	СтатусОтгрузки = Объект.Статус;
	
	Если СтатусОтгрузки = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Подготовлен") Тогда
		
		УстановитьВидимостьКоманд(Истина,Ложь,Ложь,Ложь,Ложь,Истина,Ложь);
		
	ИначеЕсли СтатусОтгрузки = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору") Тогда
		
		УстановитьВидимостьКоманд(Ложь,Истина,Истина,Истина,Истина,Истина,Истина);
		
	ИначеЕсли СтатусОтгрузки = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтгрузке") Тогда
		
		УстановитьВидимостьКоманд(Ложь,Ложь,Истина,Истина,Истина,Истина,Истина);
		
	ИначеЕсли СтатусОтгрузки = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен") Тогда
		
		УстановитьВидимостьКоманд(Ложь,Ложь,Ложь,Ложь,Ложь,Истина,Ложь);			
	КонецЕсли;

	ОтображатьХарактеристики = Ложь;
	
	Элементы.ОтгружаемыеТоварыХарактеристика.Видимость = ОтображатьХарактеристики;
	
	УстановитьПривилегированныйРежим(Истина);
		
    РабочийПользователь = ИсполнительСотрудник.Пользователь;
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(РабочийПользователь.ИдентификаторПользователяИБ);
	
	Если Не (ПользовательИБ = Неопределено) Тогда
		Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.МенеджерТорговогоЗала) Или ПользовательИБ.Роли.Содержит(Метаданные.Роли.СотрудникМД) Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;     
			Элементы.ОтгружаемыеТовары.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКоманд(КнопкаСобрать,КнопкаСобрано,КнопкаВыдать,КнопкаВыдатьЧастично,КнопкаОтложить,КнопкаОтмена,ТабличнаяЧасть)
	Элементы.Собрать.Видимость=КнопкаСобрать;
	//Элементы.ОтказатьсяОтСборки.Видимость=КнопкаСобрать;
	Элементы.Собрано.Видимость=КнопкаСобрано;
    Элементы.Выдать.Видимость=КнопкаВыдать;
	//Элементы.Отложить.Видимость=КнопкаОтложить;
	Элементы.Отмена.Видимость=КнопкаОтмена;
	Элементы.ОтгружаемыеТовары.Доступность = ТабличнаяЧасть;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИнформациюПоНеотгружаемымТоварамКлиент()
	
	ОтобразитьИнформациюПоНеотгружаемымТоварам();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьИнформациюПоНеотгружаемымТоварам()
	
	КоличествоНеОтгружать = Объект.ОтгружаемыеТовары.НайтиСтроки(
							Новый Структура("Действие", Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать)).Количество();
	
	Если КоличествоНеОтгружать > 0 Тогда
		
		Элементы.Декорация2.Видимость = Ложь;
		Элементы.КартинкаИнформация.Видимость = Истина;
		Элементы.НадписьОставить.Видимость = Истина;
		
		
		ТекстНадписи = НСтр("ru = 'В зоне отгрузки необходимо оставить %КоличествоПозиций% товаров.'");
		КоличествоПозиций = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоНеОтгружать,
																								НСтр("ru = 'позицию,позиции,позиций'"));
		
		ТекстНадписи = СтрЗаменить(ТекстНадписи,  "%КоличествоПозиций%", КоличествоПозиций);
		НадписьОставить = ТекстНадписи;
		
	Иначе
		
		Элементы.Декорация2.Видимость = Истина;
		Элементы.КартинкаИнформация.Видимость = Ложь;
		Элементы.НадписьОставить.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

Процедура УпаковочныйЛистПриИзмененииСервер(КэшированныеЗначения)
	
	ТекущаяСтрока = Объект.ОтгружаемыеТовары.НайтиПоИдентификатору(Элементы.ОтгружаемыеТовары.ТекущаяСтрока);
	
	ДействияСТекущейСтрокой = Новый Структура;
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	ДействияСТекущейСтрокой.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	ДействияСТекущейСтрокой.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	ДействияСТекущейСтрокой.Вставить("ПересчитатьКоличествоЕдиниц");
	ДействияСТекущейСтрокой.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "ОтгружаемыеТовары"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	ДействияСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	ДействияСТекущейСтрокой.Вставить("ПересчитатьВесОбъем");
	
	ДействияСДобавляемымиСтроками = Новый Структура;
	ДействияСДобавляемымиСтроками.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ДействияСДобавляемымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	ДействияСДобавляемымиСтроками.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ДействияСДобавляемымиСтроками.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	ДействияСДобавляемымиСтроками.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	ДействияСДобавляемымиСтроками.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	ДействияСДобавляемымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	ДействияСДобавляемымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	ДействияСДобавляемымиСтроками.Вставить("ПересчитатьВесОбъем");
	
	УпаковочныеЛистыСервер.НоменклатураУпаковочныйЛистПриИзменении(ЭтаФорма, Объект.ОтгружаемыеТовары,
		"ОтгружаемыеТоварыУпаковочныйЛист", КэшированныеЗначения, ДействияСТекущейСтрокой, ДействияСДобавляемымиСтроками);
	
КонецПроцедуры

&НаСервере
Процедура НаУровеньВверхСервер()
	
	НайденныеСтроки = УпаковочныеЛисты.НайтиСтроки(Новый Структура("УпаковочныйЛист",УпаковочныйЛистРодитель));
	ПриПереходеНаДругойУровеньСервер(НайденныеСтроки[0].УпаковочныйЛистРодитель);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКоличествоМест()
	
	УпаковочныеЛистыСервер.ПересчитатьКоличествоМест(ЭтаФорма, Объект.ОтгружаемыеТовары)
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьОтгружаемымиТоварамиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
    	ПерезаполнитьОтгружаемымиТоварамиСервер();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьОтгружаемымиТоварамиСервер()
	
	Документы.РасходныйОрдерНаТовары.ИзменитьТоварыПоРаспоряжениямПоОтгружаемымТоварам(Объект, Истина);
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ТоварыПоРаспоряжениям", Ложь);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий.ТоварыПоРаспоряжениям);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВСуществующийОрдерЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ИзмененныйОрдер = ПеренестиВСуществующийОрдерСервер(Результат, ДополнительныеПараметры.СтрокиДляПереноса);
		
		Если ЗначениеЗаполнено(ИзмененныйОрдер) Тогда
			ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбИзмененииОбъекта(Объект.Ссылка);
			ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбИзмененииОбъекта(ИзмененныйОрдер);
			
			Оповестить("Запись_РасходныйОрдерНаТовары", Неопределено, Объект.Ссылка);
			Оповестить("Запись_РасходныйОрдерНаТовары", Неопределено, ИзмененныйОрдер);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиВСуществующийОрдерСервер(ДругойОрдер, СтрокиДляПереноса)
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ИсточникОбъект = РеквизитФормыВЗначение("Объект");
	
	ИзмененныйОрдер = Документы.РасходныйОрдерНаТовары.РазбитьОрдер(ИсточникОбъект, СтрокиДляПереноса, ДругойОрдер);
	
	Если ЗначениеЗаполнено(ИзмененныйОрдер) Тогда
		ЗначениеВРеквизитФормы(ИсточникОбъект,"Объект");
		Модифицированность = Ложь;
		ПриЧтенииСозданииНаСервере();
	Иначе
		Прочитать();
	КонецЕсли;
	
	Возврат ИзмененныйОрдер; 
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВНовыйОрдерЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат)
		Или ДополнительныеПараметры.Свойство("БезЗадания") Тогда
		НовыйОрдер = ПеренестиВНовыйОрдерСервер(Результат, ДополнительныеПараметры.СтрокиДляПереноса);
		Если ЗначениеЗаполнено(НовыйОрдер) Тогда
			
			ОткрытьФорму("Документ.РасходныйОрдерНаТовары.Форма.Док_ФормаДокументаДляТСД",Новый Структура("Ключ",НовыйОрдер)); 
			
			Оповестить("Запись_РасходныйОрдерНаТовары", Неопределено, Объект.Ссылка);
			Оповестить("Запись_РасходныйОрдерНаТовары", Неопределено, НовыйОрдер);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиВНовыйОрдерСервер(ЗаданиеНаПеревозку, СтрокиДляПереноса)
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ИсточникОбъект = РеквизитФормыВЗначение("Объект");
	НовыйОрдер = Документы.РасходныйОрдерНаТовары.РазбитьОрдер(ИсточникОбъект, СтрокиДляПереноса,,ЗаданиеНаПеревозку);
	
	Если ЗначениеЗаполнено(НовыйОрдер) Тогда
		ЗначениеВРеквизитФормы(ИсточникОбъект,"Объект");
		Модифицированность = Ложь;
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	Возврат НовыйОрдер; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПорядокДоставкиВЗаданииНаПеревозку(ЗаданиеНаПеревозку, Получатель)
	Возврат ДоставкаТоваров.ПорядокДоставкиВЗаданииНаПеревозку(ЗаданиеНаПеревозку, Получатель);	
КонецФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьДоступностьЗаданияНаПеревозку(Форма)
	Форма.Элементы.ЗаданиеНаПеревозку.Доступность = Форма.Объект.ОтгрузкаПоЗаданиюНаПеревозку;
КонецПроцедуры

&НаСервере
Функция ПроверитьКомплектностьТоварныхМест()
	
	Отказ = Ложь;
	
	ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ИмяТЧ = "ОтгружаемыеТовары";
	ПараметрыПроверки.УсловиеОтбораСтрокПроверкиКомплектности = "ОтгружаемыеТовары.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать)";

	НоменклатураСервер.ПроверитьКомплектностьТоварныхМест(Объект.ОтгружаемыеТовары, Отказ, ПараметрыПроверки);
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Процедура СортироватьСтроки(ИмяКолонки, Направление)
	ИмяКолонкиНаправление = СтрЗаменить(Элементы[ИмяКолонки].ПутьКДанным, "Объект.ОтгружаемыеТовары.","") + " " + Направление; 
	
	Объект.ОтгружаемыеТовары.Сортировать(ИмяКолонкиНаправление);
	Если ИспользоватьУпаковочныеЛисты Тогда
		УпаковочныеЛистыСервер.ПеренумероватьСтроки(ЭтотОбъект, Объект.ОтгружаемыеТовары);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьЯчейку(НоменклатураСсылка,СкладСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|ГДЕ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = &Номенклатура
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("Склад", СкладСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ячейка = ВыборкаДетальныеЗаписи.Ячейка;
	КонецЦикла;

    Возврат Ячейка;
	
КонецФункции

&НаСервере
Функция ПолучитьОстаток(НоменклатураСсылка,ХарактеристикаСсылка,СкладСсылка)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладахОстатки.Склад = &Склад
		|	И ТоварыНаСкладахОстатки.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("Склад", СкладСсылка);
	Запрос.УстановитьПараметр("Характеристика", ХарактеристикаСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ОстатокНаСкладе = ВыборкаДетальныеЗаписи.ВНаличииОстаток;
	КонецЦикла;
	
    Возврат ОстатокНаСкладе;
	
КонецФункции
 
&НаКлиенте
Процедура ПослеОтветаНаВопросВыдатьЧастично(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		СтрокиУдалены = УдалитьСтрокиСНулевымКоличеством();
		
		Если СтрокиУдалены Тогда

		ПерезаполнитьОтгружаемымиТоварамиСервер();
		
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен");
		СтатусПриИзмененииСервер();
		Сообщить("Создан " + Строка(Объект.Ссылка));
		ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
		
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросСобратьЧастично(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
				
		Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Ложь;
		Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Ложь;
		Элементы.ВыборЯПХ.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьШК(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК НоменклатураПредставление,
	|	ШтрихкодыНоменклатуры.Характеристика.Наименование КАК ХарактеристикаПредставление,
	|	ШтрихкодыНоменклатуры.Упаковка.Наименование КАК УпаковкаПредставление
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для номенклатуры %Номенклатура%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Номенклатура%", """" + Выборка.НоменклатураПредставление + """"
		+ ?(ЗначениеЗаполнено(Выборка.Характеристика), " " + НСтр("ru='с характеристикой'") + " """ + Выборка.ХарактеристикаПредставление + """", "")
		+ ?(ЗначениеЗаполнено(Выборка.Упаковка), " " + НСтр("ru='в упаковке'") + " """ + Выборка.УпаковкаПредставление + """", ""));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Сообщить();
		
	Иначе
		МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Штрихкод = Штрихкод;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Характеристика = Характеристика;

		МенеджерЗаписи.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Штрихкод записан!";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЯчейкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.ВыборЯчейки.Видимость = Ложь;
	
	НоваяЯчейка = Элементы.ДоступныеЯчейки.ТекущиеДанные.Ссылка;
	
	Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость=Истина;
	
	Если ИзменитьЯчейку() Тогда
		Ячейка = ПолучитьЯчейку(Номенклатура,Объект.Склад);	
		Сообщить("Ячейка изменена!");
	Иначе
		Ячейка = "";
		Сообщить("При изменении ячейки произошли проблемы! Ячейка не изменена!");
	КонецЕсли;
	ДоступныеЯчейки.Отбор.Элементы.Очистить();	
    ДоступныеЯчейкиНастройкаСписка();
КонецПроцедуры
&НаСервере
Процедура ДоступныеЯчейкиНастройкаСписка ()
	Если СекцииСотрудника.Количество()>0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейки, "РабочийУчасток", СекцииСотрудника.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке,,Истина);	
		
		ЯПХПриОтгрузке = Новый Массив;
		Для Каждого Строка Из СекцииСотрудника.ВыгрузитьЗначения() Цикл
			ЯПХПриОтгрузке.Добавить(Строка.ГруппаСкладскихЯчеекХраненияПриОтгрузке);		
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейкиЯПХ, "Ссылка.Родитель", ЯПХПриОтгрузке, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);		
	ИначеЕсли ЗначениеЗаполнено(Объект.РабочийУчасток) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейки, "РабочийУчасток", Объект.РабочийУчасток, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Если ЗначениеЗаполнено(Объект.РабочийУчасток.ГруппаСкладскихЯчеекХраненияПриОтгрузке) Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейкиЯПХ, "Ссылка.Родитель", Объект.РабочийУчасток.ГруппаСкладскихЯчеекХраненияПриОтгрузке, ВидСравненияКомпоновкиДанных.Равно,,Истина);
        Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейкиЯПХ, "РабочийУчасток", Объект.РабочийУчасток, ВидСравненияКомпоновкиДанных.Равно,,Истина);	
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ИзменитьЯчейку()
	
	Записано = Ложь;
	
	Попытка
		НачатьТранзакцию();
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Отбор.Склад.Установить(Объект.Склад);
		НаборЗаписей.Отбор.Ячейка.Установить(Ячейка);
		НаборЗаписей.Записать();
		
		МенеджерЗаписи = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Склад = Объект.Склад;
		МенеджерЗаписи.Ячейка = НоваяЯчейка;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.ОсновнаяЯчейка=Истина;
		
		МенеджерЗаписи.Записать();
		
		Записано = Истина;
		УстановитьПривилегированныйРежим(Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("Ошибка записи!");
		Записано = Ложь;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат Записано;	
	
КонецФункции

&НаСервере
Функция УдалитьСтрокиСНулевымКоличеством()
	
	СтрокиУдалены = Истина;
	
	МассивСтрок = Объект.ОтгружаемыеТовары.НайтиСтроки(Новый Структура("КоличествоУпаковок",0));
	
	Если МассивСтрок.Количество() = Объект.ОтгружаемыеТовары.Количество() Тогда
		Сообщить("Не заполнена ни одна строка!");
		СтрокиУдалены = Ложь;
	Иначе
		Удалено = Ложь;
		Для каждого строка из МассивСтрок Цикл
			Объект.ОтгружаемыеТовары.Удалить(Строка);
			Удалено = Истина;
		КонецЦикла;
		Если Удалено Тогда
			ПерезаполнитьОтгружаемымиТоварамиСервер();
        КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокиУдалены;
  
КонецФункции

&НаСервере
Функция ФактическоеКоличествоСовпадаетСПлановым()
	
	ЕстьРасхождения = Ложь;
	
	 Для каждого Строка из Объект.ОтгружаемыеТовары Цикл
		Если Строка.КоличествоУпаковок <> Строка.КоличествоПлан Тогда
			ЕстьРасхождения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Не ЕстьРасхождения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПризнакРасхождение()
	
	Для Каждого СтрТабл Из Объект.ОтгружаемыеТовары Цикл
		СтрТабл.Расхождение = СтрТабл.КоличествоУпаковок <> СтрТабл.КоличествоПлан;
	КонецЦикла;
	
	Если ТолькоРасхождения Тогда
		Элементы.ОтгружаемыеТовары.ОтборСтрок = Новый ФиксированнаяСтруктура("Расхождение",Истина);
	Иначе
		Элементы.ОтгружаемыеТовары.ОтборСтрок = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеПоля()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
	|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыПоРаспоряжению
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.НомерСтроки КАК НомерСтроки,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение КАК Назначение,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия КАК Серия,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Действие КАК Действие,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Упаковка КАК Упаковка,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Количество КАК Количество,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ВТ_ТоварыПоРаспоряжению.Количество КАК КоличествоПлан,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование КАК ЯчейкаНаименование
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_ТоварыПоРаспоряжению КАК ВТ_ТоварыПоРаспоряжению
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|			ПО (ВТ_ТоварыПоРаспоряжению.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|					И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
	|					И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
	|		ПО (ВТ_ТоварыПоРаспоряжению.Ссылка = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка
	|				И ВТ_ТоварыПоРаспоряжению.Номенклатура = РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура
	|				И ВТ_ТоварыПоРаспоряжению.Характеристика = РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика
	|				И ВТ_ТоварыПоРаспоряжению.Назначение = РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение)
	|УПОРЯДОЧИТЬ ПО		
    | ЯчейкаНаименование";

	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Запрос.УстановитьПараметр("Склад",Объект.Склад);
	
	Объект.ОтгружаемыеТовары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеТаблицы()
    
    Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоУпаковок");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоУпаковокФакт");
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	 Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоУпаковок");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
    ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоУпаковокФакт");
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Голубой);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоУпаковок");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
    ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоУпаковокФакт");
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Розовый);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоУпаковокФакт");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЭлемента.ПравоеЗначение = 0;
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСобранныеОрдера()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Проведен = ИСТИНА
		|	И РасходныйОрдерНаТовары.Накладная = &Накладная
		|	И РасходныйОрдерНаТовары.РабочийУчасток = &РабочийУчасток
		|	И РасходныйОрдерНаТовары.Статус = &Статус
		|	И РасходныйОрдерНаТовары.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Накладная", Объект.Накладная);
	Запрос.УстановитьПараметр("РабочийУчасток", Объект.РабочийУчасток);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выгрузить();
	
	СобранныеОрдера.ЗагрузитьЗначения(Выборка.ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура СобранныеОрдераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СобранныеОрдера.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьФорму("Документ.РасходныйОрдерНаТовары.Форма.Док_ФормаДокументаДляТСД",Новый Структура("Ключ",ТекущиеДанные.Значение)); 
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОжидание() Экспорт
	
	Если ТоварОтгружен() Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаСтрокаРедактирования = Ложь;
	ПереопределитьТекущуюСтроку = Ложь;
	АктивнаСтрокаРедактирования = Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость;
	
	Если АктивнаСтрокаРедактирования Тогда
		ДанныеТекущейСтроки  = Объект.ОтгружаемыеТовары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
		Если ДанныеТекущейСтроки <> Неопределено Тогда
			НомерСтроки = ДанныеТекущейСтроки.НомерСтроки;
			ПереопределитьТекущуюСтроку = Истина;
		КонецЕсли;
	КонецЕсли;

	ДанныеИзменены = Ложь;
	ДанныеИзменены = ЗаписатьИзменениеТабличнойЧасти();
	
	Если ДанныеИзменены Тогда
		
		ЭтаФорма.Прочитать();
		ЗаполнитьДополнительныеПоля();
		ЗаполнитьПризнакРасхождение();
		
		Если ПереопределитьТекущуюСтроку Тогда
			ТекущаяСтрокаТСД = Объект.ОтгружаемыеТовары[НомерСтроки-1].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ТоварОтгружен()

	Возврат Объект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен ИЛИ ?(Объект.Ссылка.Пустая(),Ложь,Объект.Ссылка.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен); 
	
КонецФункции

&НаСервере
Функция ЗаписатьИзменениеТабличнойЧасти() 
	
	ДанныеИзменены = Ложь;
	
	НачатьТранзакцию();
	Попытка
		Если Не Объект.Ссылка.Пустая()Тогда
			Если АльтерраОбщегоНазначения.ТабличнаяЧастьИзменилась(Объект.Ссылка.ОтгружаемыеТовары.Выгрузить(),Объект.ОтгружаемыеТовары.Выгрузить()) Тогда
				ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
				ДокументОбъект.ОтгружаемыеТовары.Загрузить(Объект.ОтгружаемыеТовары.Выгрузить());
				//Маркировка
				ДокументОбъект.ШтрихкодыУпаковок.Загрузить(Объект.ШтрихкодыУпаковок.Выгрузить());
				//Маркировка -
				УстановитьПривилегированныйРежим(Истина);
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект,истина);
				АктуализироватьМаркировку();
				УстановитьПривилегированныйРежим(Ложь);
				ДанныеИзменены = Истина; 
			КонецЕсли;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение 
		ОтменитьТранзакцию();	
	КонецПопытки;
	
	Возврат ДанныеИзменены;
	
КонецФункции

&НаКлиенте
Процедура ТолькоРасхождения(Команда)
	ТолькоРасхождения = Не ТолькоРасхождения;
	ЗаполнитьПризнакРасхождение();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьХарактеристики(Команда)
	ОтображатьХарактеристики = Не ОтображатьХарактеристики;
    УстановитьВидимостьХарактеристик();	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьХарактеристик()
	Элементы.ОтгружаемыеТоварыХарактеристика.Видимость =ОтображатьХарактеристики;
	Элементы.Характеристика.Видимость=ОтображатьХарактеристики;
КонецПроцедуры

&НаСервере
Процедура ПолучитьАдресКартинки(Номенклатура)
	
	ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ФайлКартинки");
	Если ЗначениеЗаполнено(ФайлКартинки) тогда
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ЭтотОбъект.УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеЗаменаИзображения(Команда)
		
	Если ЗначениеЗаполнено(Номенклатура) Тогда  
		Замечание = "";  
		ОтправительСообщения = ?(ЗначениеЗаполнено(Объект.Сотрудник), Объект.Сотрудник, Альтерра_СкладСервер.ТекущийСотрудник()); 
		Если ВвестиСтроку(Замечание, "Текст замечания (что не так)") Тогда
			Если Замечание <> "" Тогда
				ДопМодуль.ОтправитьСообщениеОЗаменеКартинки("Замените изображение у номенклатуры - ", Номенклатура, Замечание, ОтправительСообщения); 
			Иначе
				 ОбщегоНазначенияКлиент.СообщитьПользователю("Для отправки запроса на замену картинки товара необходимо заполнить 'Текст замечания'!");
			КонецЕсли;
		Иначе 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для отправки запроса на замену картинки товара необходимо заполнить 'Текст замечания'!");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЯчейки1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.ВыборЯПХ.Видимость = Ложь;
	
	НоваяЯчейка = Элементы.ДоступныеЯчейкиЯПХ.ТекущиеДанные.Ссылка;
	
	Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Истина;
		
	СтрокиУдалены = УдалитьСтрокиСНулевымКоличеством();
	
	Если СтрокиУдалены Тогда
		
		Если Не ФактическоеКоличествоСовпадаетСПлановым() Тогда
			ПерезаполнитьОтгружаемымиТоварамиСервер();
		КонецЕсли;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтгрузке");
		
		Объект.ЯчейкаПромежуточногоХранения = НоваяЯчейка;
		
		СтатусПриИзмененииСервер();
		
		Сообщить("Создан " + Строка(Объект.Ссылка) + " в статусе " + Строка(Объект.Статус));
		
		ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма,Ложь,Новый ОписаниеОповещения("ОповеститьОбИзмененииСтатусаОрдера",ЭтотОбъект));
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииСтатусаОрдера(Результат, Параметры) Экспорт
	Оповестить("РасходныйОрдер_СтатусИзменение_Доп",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрикодКамера(Команда)
		#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
	
		#Если МобильныйКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		ДанныеСтруктура =  Новый Структура("Штрихкод, Количество", Штрихкод, 1);
		
				
		Данные = Новый Массив;
		Данные.Добавить(ДанныеСтруктура);
		//ОбработатьШтрихкодыЯчейки(Данные);
		
		Если СтрДлина(Штрихкод) > 35 Тогда
			
			ОбработатьШтрихкодыЯчейки(Данные);
		Иначе
			//ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Данные));
			ОбработатьШтрихкоды(Данные);
		КонецЕсли;
		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодыЯчейки(ДанныеШтрихкодов) 
	
	Штрихкод = ДанныеШтрихкодов[0].Штрихкод;
	// Штрихкод ячейки
	Если СтрДлина(Штрихкод) > 35   Тогда
			МассивСсылок = СсылкаНаЯчейкуПоШтрихкоду(Штрихкод);  
			
			СтрокиУдалены = УдалитьСтрокиСНулевымКоличеством();
    
			// Ячейка найдена
			Если МассивСсылок.Количество() > 0  Тогда   
				НайденнаяЯчейка = МассивСсылок[0];      
				РезультатПроверки = ПроверитьСсылкуВСписке(НайденнаяЯчейка);
				Если  РезультатПроверки = Истина Тогда	
					
						Если Не ФактическоеКоличествоСовпадаетСПлановым() Тогда
							ПерезаполнитьОтгружаемымиТоварамиСервер();
						КонецЕсли;
						Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтгрузке");
						
						Объект.ЯчейкаПромежуточногоХранения = НайденнаяЯчейка;
						
						СтатусПриИзмененииСервер();
						
						Сообщить("Создан " + Строка(Объект.Ссылка) + " в статусе " + Строка(Объект.Статус));
						
						ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма,Ложь,Новый ОписаниеОповещения("ОповеститьОбИзмененииСтатусаОрдера",ЭтотОбъект));
		
				Иначе
					Сообщить("Ячейка не найдена в списке. Повторите сканирование или вручную выберите ячейку из списка!");
				КонецЕсли;
			Иначе
				Сообщить("Ячейка не найдена. Повторите сканирование!");
			КонецЕсли;
	КонецЕсли;
    ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры     

&НаКлиенте
Функция СсылкаНаЯчейкуПоШтрихкоду(Штрихкод)
    Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Справочник.СкладскиеЯчейки.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
КонецФункции    

&НаКлиенте
Процедура БракНаСкладе(Команда)
	
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("ДобавитьФотоТовара", Истина);
	ПараметрыФормы.Вставить("ПричинаБлокировки", "Брак на складе");
	
	ОткрытьФорму("Документ.БлокировкаДвиженияТоваров.Форма.Док_ФормаДокументаТСД", ПараметрыФормы);	
	
КонецПроцедуры

&НаКлиенте
Процедура НетНаСкладе(Команда)
	
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("ДобавитьФотоТовара", Ложь);
	ПараметрыФормы.Вставить("ПричинаБлокировки", "Нет на складе");
	
	ОткрытьФорму("Документ.БлокировкаДвиженияТоваров.Форма.Док_ФормаДокументаТСД", ПараметрыФормы);	
	
КонецПроцедуры
#КонецОбласти 

&НаСервере
Функция ПроверитьСсылкуВСписке(НайденнаяЯчейка)

Схема = Элементы.ДоступныеЯчейкиЯПХ.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
Настройки = Элементы.ДоступныеЯчейкиЯПХ.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

ДанныеСписка = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

Результат = Ложь;
Для Каждого Строка Из ДанныеСписка Цикл  
	Если Строка.Ссылка = НайденнаяЯчейка.Ссылка Тогда     
		Результат = Истина;
		Прервать; 
	КонецЕсли;	
КонецЦикла;	      

Возврат Результат;
КонецФункции


#Область Оповещения 
&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
				
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда   
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору"); 
	    ОтключитьОбработчикОжидания("ОбработатьОжидание");
		ОбработатьОжидание();
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды, ОткрытьОчередь",Объект.Сотрудник,"Отгрузка", Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника);
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
   	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Объект.Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


#КонецОбласти

#Область Маркировка   

&НаСервере
Функция ПолучитьСтрокуШтрихкодыУпаковок(CcылкаНаШтрихкод) 
	
	Строка = Объект.ШтрихкодыУпаковок.Выгрузить().Найти(CcылкаНаШтрихкод,"ШтрихкодУпаковки");
	Если Строка = Неопределено Тогда
		Возврат Неопределено;
	Иначе                                   
		Возврат Строка.НомерСтроки - 1;
	КонецЕсли;
	
КонецФункции  

&НаСервере
Процедура АктуализироватьМаркировку()
	
  // ОбработанныеТовары = МаркировкаАльтерра.АктуализироватьМаркировку(Объект.ОтгружаемыеТовары);
 //   Если ОбработанныеТовары = Неопределено Тогда
  //  	Возврат;
 //   КонецЕсли;
    
//	Объект.ОтгружаемыеТовары.Загрузить(ОбработанныеТовары);
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент,Отказ) 
	
	ТекущаяСтрока = Элементы.ОтгружаемыеТовары.ТекущаяСтрока;
	ЭлементСписка = Объект.ОтгружаемыеТовары.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ЭлементСписка.Маркировка и ЭлементСписка.КоличествоУпаковок > 0 Тогда
		Отказ = Истина;
		Элементы.ГруппаРедактированиеДокументаНаТСД.Видимость=Ложь;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере 
Функция ПолучитьРазобранныйКодМаркировки(ШтрихкодМаркировки)  
	Возврат  РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ШтрихкодМаркировки, Неопределено, Неопределено,Неопределено,Неопределено);  
КонецФункции

&НаКлиенте
Процедура ОбработатьСтрокуСМаркировкой(ДанныеСтрокиМаркировки)
	
     ЭлементСписка = Объект.ОтгружаемыеТовары.Получить(ДанныеСтрокиМаркировки.ИндексТекСтроки); 
	 
	    Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтгрузкаПродажа");
		РезультатПроверки = МаркировкаАльтерра.ПроверкаЧЗ(ДанныеСтрокиМаркировки.МассивКодовМаркировкиЧЗ,ДанныеСтрокиМаркировки.ВидПродукции,Операция);
		СообщениеОбОшибках = РезультатПроверки.СообщениеОбОшибках;
		
		Если РезультатПроверки.КодВалидный Тогда
			 НС = Объект.ШтрихкодыУпаковок.Добавить();
		     НС.ШтрихкодУпаковки = ДанныеСтрокиМаркировки.СсылкаНаШтрихкодМаркировки; 
		Иначе  
			СообщениеОбОшибках = СообщениеОбОшибках + "
			|ОтложитеТовар!"; 
			
			ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 1;
			ЭлементСписка.Количество = ЭлементСписка.Количество - 1;		
		КонецЕсли; 
		
		Если  СообщениеОбОшибках <> "" Тогда  
			Сообщить(СообщениеОбОшибках);
		КонецЕсли;
 
КонецПроцедуры	

&НаКлиенте
Процедура ВопросУдаленияКМ(Результат, ДанныеСтрокиМаркировки) Экспорт 
	 
    ЭлементСписка = Объект.ОтгружаемыеТовары.Получить(ДанныеСтрокиМаркировки.ИндексТекСтроки);
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Объект.ШтрихкодыУпаковок.Удалить(ДанныеСтрокиМаркировки.ИдентификаторСтрокиМаркировка); 
		ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 2;
		ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;
	Иначе 
		ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоУпаковок - 1;   
		ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;	  
	КонецЕсли;
	
	Если Элементы.ГруппаРедактированиеЭлементаНаТСД.Видимость Тогда
		ФактическоеКоличество = ЭлементСписка.КоличествоУпаковок;
	КонецЕсли;
	ЗаполнитьПризнакРасхождение(); 
	 
КонецПроцедуры


#КонецОбласти

