////////////////////// События формы /////////////////////////////
 #Область СобытияФормы  
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		Объект.ПериодРегистрации= НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	МесяцРегистрацииСтрокой= УчетРабочегоВремениСервер.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
	КолДнейВМес= День(КонецМесяца(Объект.ПериодРегистрации));
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ОбновитьИтоги();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для сч = 1 По КолДнейВМес Цикл
		Элемент = Элементы["ГрафикПредставление"+сч];
		Элемент.Заголовок = Строка(сч);

		ТекДата = Дата(Год(Объект.ПериодРегистрации),Месяц(Объект.ПериодРегистрации), сч);
		ВидДня = УчетРабочегоВремениСервер.ПолучитьВидДня(ТекДата);
		Если ВидДня = Неопределено Тогда
			Элемент.ЦветФонаЗаголовка = Новый Цвет(100, 100, 100);
			Элемент.ЦветТекста= Новый Цвет(100, 100, 100);
		ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий") Тогда
			Элемент.ЦветТекстаЗаголовка = Новый Цвет(0, 0, 0);
			Элемент.ЦветТекста = Новый Цвет(0, 0, 0);
		ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота") Тогда
			Элемент.ЦветТекстаЗаголовка = Новый Цвет(0, 0, 255);
			Элемент.ЦветТекста= Новый Цвет(0, 0, 255);
		ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье") Тогда
			Элемент.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
			Элемент.ЦветТекста= Новый Цвет(255, 0, 0);
		ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник") Тогда
			Элемент.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 255);
			Элемент.ЦветТекста= Новый Цвет(255, 0, 255);
		КонецЕсли;
		
	КонецЦикла;
	//Скроем не нужные
	Для сч = КолДнейВМес + 1 По 31 Цикл
		Элемент = ЭтаФорма.Элементы["ГрафикПредставление" + сч];	
		Элемент.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("РедактируемыйОбъект", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПутьРеквизита", "Объект.ПериодРегистрации");
	ДополнительныеПараметры.Вставить("ПутьРеквизитаПредставления", "МесяцРегистрацииСтрокой");
	ДополнительныеПараметры.Вставить("ИзменитьМодифицированность", Истина);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Значение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтаФорма, "Объект.ПериодРегистрации");
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
	Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Значение, "Месяц", Ложь),
	ЭтаФорма, , , ,ОповещениеЗавершения , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	Объект.ПериодРегистрации = ЗначениеВыбрано;
	МесяцРегистрацииСтрокой = УчетРабочегоВремениКлиент.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
	КолДнейВМес = День(КонецМесяца(Объект.ПериодРегистрации));  
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцРегистрацииСтрокой = УчетРабочегоВремениКлиент.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
	КолДнейВМес = День(КонецМесяца(Объект.ПериодРегистрации));  
	
КонецПроцедуры  

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Движения(Команда)
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", Новый Структура("Документ", Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВодителями(Команда)
	ЗаполнитьВодителямиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВодителямиНаСервере()
	
	Объект.График.Очистить();
	Документы.ГрафикВыходаВодителей.ЗаполнитьВодителями(Объект);
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоФакту(Команда)
	ЗаполнитьПоФактуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоФактуНаСервере()  
	
	Документы.ГрафикВыходаВодителей.ЗаполнитьПоФакту(Объект);
	ОбновитьИтоги(); 
	
КонецПроцедуры

#КонецОбласти

////////////////////// Обработка Графика /////////////////////////////
 #Область ОбработкаГрафика

&НаКлиенте
Процедура ГрафикПриИзменении(Элемент)
	ОбновитьИтоги();
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуПодвала(стр) 
	
	 Отбор = Новый Структура("Автомобиль", стр);
	 СтрокиПодвала = Объект.График.НайтиСтроки(Отбор);
	 Если СтрокиПодвала.Количество() = 0 Тогда
		 НоваяСтрока = Объект.График.Добавить();
		 НоваяСтрока.Автомобиль = стр;
		 НоваяСтрока.ИтоговаяСтрока = Истина;
	 Иначе
		 НоваяСтрока = СтрокиПодвала[0];
	 КонецЕсли;
	 
	 Возврат НоваяСтрока; 
		 
КонецФункции 
 
#КонецОбласти

////////////////////// Функции расчета /////////////////////////////
 #Область Расчеты
 
 &НаСервере
 Процедура ОбновитьИтоги()
	 
	 //Подвал
	 СтрокаПодвала15т = ПолучитьСтрокуПодвала("1,5 т");
	 СтрокаПодвала3т = ПолучитьСтрокуПодвала("3 т");
	 СтрокаПодвалаСамогрузы = ПолучитьСтрокуПодвала("Самогрузы");
	 СтрокаПодвала6м = ПолучитьСтрокуПодвала("6 м");
	 СтрокаПодвалаИтого15т = ПолучитьСтрокуПодвала("Итого 1,5 (3т=2авто 1,5т)");
	 СтрокаПодвалаВсегоБезСамогрузов = ПолучитьСтрокуПодвала("Всего авто без самогрузов");
	 
	 Для Каждого График Из Объект.График Цикл
		 Если Не ЗначениеЗаполнено(График.Водитель) Тогда 
			 Продолжить;
		 КонецЕсли;
			 
		 Если Не ЗначениеЗаполнено(График.Автомобиль) Тогда
		 График.Автомобиль = Документы.ГрафикВыходаВодителей.ПолучитьАвтомобиль(График.Водитель);
	 КонецЕсли;
	 
		 Если Не ЗначениеЗаполнено(График.Автомобиль) Тогда 
			 Продолжить;
		 КонецЕсли;
	 
		 //Заполним параметры
		График.ГрузоподъемностьВТоннах = График.Автомобиль.ГрузоподъемностьВТоннах;
		График.МаксимальнаяДлинаГруза = График.Автомобиль.МаксимальнаяДлинаГруза;
		  
		КоличествоВыходов = 0;
		Для сч = 1 По КолДнейВМес Цикл
			 стрЗначение = СокрЛП(График["Представление" + сч]);
			 
			 Если стрЗначение = "1" Или НРег(стрЗначение) = "в1" Тогда
				 КоличествоВыходов = КоличествоВыходов + 1;
			 КонецЕсли;
		 КонецЦикла;
		 График.КоличествоВыходов = КоличествоВыходов;
	 КонецЦикла;
	 
	 //Итоги вертикально
	 Для сч = 1 По КолДнейВМес Цикл
		 ИтогПодвала15т = 0;
		 ИтогПодвала3т = 0;
		 ИтогПодвалаСамогрузы = 0;
		 ИтогПодвала6м = 0;
		 ИтогПодвалаИтого15т = 0;
		 ИтогПодвалаВсегоБезСамогрузов = 0;
		 
		 Для Каждого График Из Объект.График Цикл
			 Если ТипЗнч(График.Автомобиль) = Тип("Строка") Тогда
				 Продолжить;
			 КонецЕсли;
			 стрЗначение = СокрЛП(График["Представление" + сч]);	 
			 
			 Если стрЗначение = "1" Или НРег(стрЗначение) = "в1" Тогда
				 //Вставляем итоги
				 Если График.Автомобиль.ГрузоподъемностьВТоннах < 3 Тогда
					 ИтогПодвала15т = ИтогПодвала15т+1;
				 Иначе
					 Если График.Автомобиль.Самогруз Тогда
						 ИтогПодвалаСамогрузы = ИтогПодвалаСамогрузы + 1;
					 Иначе
					 	ИтогПодвала3т = ИтогПодвала3т+1;
					 КонецЕсли;
				 КонецЕсли;
				 Если График.Автомобиль.МаксимальнаяДлинаГруза >= 6 Тогда
					 ИтогПодвала6м = ИтогПодвала6м + 1;
				 КонецЕсли;
				 ИтогПодвалаИтого15т = ИтогПодвала15т + ИтогПодвала3т*2;
				 ИтогПодвалаВсегоБезСамогрузов = ИтогПодвала15т + ИтогПодвала3т;
			 КонецЕсли;
		 КонецЦикла;
		 СтрокаПодвала15т["Представление" + сч] = Строка(ИтогПодвала15т);
		 СтрокаПодвала3т["Представление" + сч] = Строка(ИтогПодвала3т);
		 СтрокаПодвалаСамогрузы["Представление" + сч] = Строка(ИтогПодвалаСамогрузы);
		 СтрокаПодвала6м["Представление" + сч] = Строка(ИтогПодвала6м);
		 СтрокаПодвалаИтого15т["Представление" + сч] = Строка(ИтогПодвалаИтого15т);
		 СтрокаПодвалаВсегоБезСамогрузов["Представление" + сч] = Строка(ИтогПодвалаВсегоБезСамогрузов);
	 КонецЦикла;
	 
	 Объект.График.Сортировать("ИтоговаяСтрока Возр"); 
	 ЭтаФорма.Модифицированность = Истина;  
	 
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды Не работает
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды






