&НаКлиенте
Перем ФормаОжидания;      

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВозможностьВозврата = Неопределено;
	Если Параметры.Свойство("ВозможностьВозврата", ВозможностьВозврата) Тогда
		ЗаполнитьПараметрыВозврата(ВозможностьВозврата);
	КонецЕсли;
	
КонецПроцедуры       

#КонецОбласти

#Область Возвраты

&НаСервере
Процедура ЗаполнитьПараметрыВозврата(ВозможностьВозврата)

	ДокументОснование = ВозможностьВозврата.ДокументОснование;
	СуммаОплаты = ВозможностьВозврата.СуммаОплаты;
	МаксимальнаяСуммаВозврата = ВозможностьВозврата.СуммаДокументаВозврата;   
	
	Элементы.ДокументВозврата.СписокВыбора.Очистить();
	Для Каждого ЭОВозврат Из ВозможностьВозврата.НеоформленныеВозвратныеЭО Цикл    
		
		Если Не ЗначениеЗаполнено(ДокументВозврата) Тогда
			ДокументВозврата = ЭОВозврат.Документ;
			СуммаВозврата = ЭОВозврат.СуммаДокумента;
		КонецЕсли;	
		
		Элементы.ДокументВозврата.СписокВыбора.Добавить(ЭОВозврат.Документ);
	КонецЦикла; 
	
	Элементы.НоваяЭОВозврат.Видимость = Не ЗначениеЗаполнено(ДокументВозврата) И МаксимальнаяСуммаВозврата > 0;  
	
	Для Каждого ЭОВОзврат Из ВозможностьВозврата.ОформленныеВозвратныеЭО Цикл   
		СтрокаТЗ = ОформленныеВозвраты.Добавить();
		СтрокаТЗ.ЭквайринговаяОперация = ЭОВОзврат.Документ;
		СтрокаТЗ.Сумма = ЭОВОзврат.СуммаДокумента;
	КонецЦикла;
	Элементы.ГруппаВозвраты.Видимость = ВозможностьВозврата.ОформленныеВозвратныеЭО.Количество() > 0; 
	Элементы.ГруппаВозвраты.Заголовок = СтрШаблон("Оформлено возвратов на %1 ₽", Формат(ОформленныеВозвраты.Итог("Сумма"), "ЧДЦ=2"));
	
	Для Каждого Реализация Из ВозможностьВозврата.ОформленныеРеализации Цикл   
		СтрокаТЗ = ОформленныеРеализации.Добавить();
		СтрокаТЗ.Реализация = Реализация.Документ;
		СтрокаТЗ.Сумма = Реализация.СуммаДокумента;
	КонецЦикла;   
	Элементы.ГруппаРеализации.Видимость = ВозможностьВозврата.ОформленныеРеализации.Количество() > 0;                          
	Элементы.ГруппаРеализации.Заголовок = СтрШаблон("Оформлено реализаций на %1 ₽", Формат(ОформленныеРеализации.Итог("Сумма"), "ЧДЦ=2"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВозвратДС(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда      
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ВозвратПоДинамическойСсылке = ИнтеграцияБанки.ПолучитьОплатуДинамическойСсылки(ДокументОснование, ДокументВозврата, ДатаВозвратаВОчереди);
			
			Если ВозвратПоДинамическойСсылке.ТребуетсяВозврат Тогда	
				
				ФормаОжидания = ОткрытьФорму("Обработка.БезналичнаяОплатаБезПодключенияОборудования.Форма.ФормаОжиданияВозвратаДС",, ЭтаФорма ,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
				ВыполнениеВозврата = ИнтеграцияБанки.ВыполнитьВозвратДинамическойСсылки(ВозвратПоДинамическойСсылке.ДокументОснование,
					ДокументОснование, СуммаВозврата, ДокументВозврата, ВозвратПоДинамическойСсылке.ЭквайринговыйТерминал);  
				ДатаВозвратаВОчереди = ВыполнениеВозврата.ДатаОперации;
				
				Если ВыполнениеВозврата.Результат Тогда
					ПодключитьОбработчикОжидания("ПроверкаПробитияВозвратаДинамическиеСсылки", 5, Ложь);
				Иначе      
					Если ФормаОжидания <> Неопределено Тогда
						ФормаОжидания.Выполнено();
					КонецЕсли;   
					
					ОповещениеЗакрытия = Новый ОписаниеОповещения("ЗакрытиеФормыВозврата", ЭтотОбъект);
					ПоказатьПредупреждение(ОповещениеЗакрытия, СтрШаблон("Не выполнен возврат: %1", ВыполнениеВозврата.Сообщение), 0, "Статус возврата");		

				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли; 
		                         
    КонецЕсли;	
  
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПробитияВозвратаДинамическиеСсылки()

	ВозвратПоДинамическойСсылке = ИнтеграцияБанки.ПолучитьОплатуДинамическойСсылки(ДокументОснование, ДокументВозврата, ДатаВозвратаВОчереди);
		
	Если ВозвратПоДинамическойСсылке.ВозвратОбработан <> Null И ВозвратПоДинамическойСсылке.ВозвратОбработан Тогда
		
		ОтключитьОбработчикОжидания("ПроверкаПробитияВозвратаДинамическиеСсылки"); 
		
		Если ФормаОжидания <> Неопределено Тогда
			ФормаОжидания.Выполнено();
		КонецЕсли;   
		
		ОповещениеЗакрытия = Новый ОписаниеОповещения("ЗакрытиеФормыВозврата", ЭтотОбъект);
		ПоказатьПредупреждение(ОповещениеЗакрытия, "Выполнен возврат в Альфа-банк", 0, "Статус возврата");		

	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗакрытиеФормыВозврата(Параметры) Экспорт
	
	Закрыть(Истина);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьСуммуОплаты(ЭквайринговаяОперация)
	
	Возврат ЭквайринговаяОперация.СуммаДокумента;
	
КонецФункции

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура Вернуть(Команда)

	Оповещение = Новый ОписаниеОповещения("ВыполнитьВозвратДС", ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение, СтрШаблон("Выполнить возврат Альфа-Банка на сумму %1 руб.?", Формат(СуммаВозврата, "ЧДЦ=2")),
    	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Возврат");
	
КонецПроцедуры 

&НаКлиенте
Процедура ДокументВозвратаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СуммаВозврата = ПолучитьСуммуОплаты(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти