
&НаКлиенте
Процедура ЗаполнитьТекущимиУдержаниями(Команда)
	Если Объект.Проведен Тогда
		Предупреждение("перед перезаполнением необходимо распровести документ!", 5);
		Возврат;
	КонецЕсли;
	
	Если Объект.Начисления.Количество() > 0 Тогда
		ОтветНаВопрос = Вопрос(НСтр("ru='Таблица ""Начисления"" будет перезаполнена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьТекущимиУдержаниямиНаСервере();
	ЭтаФорма.Модифицированность= Истина;
КонецПроцедуры
//Сам расчет
&НаСервере
Процедура ЗаполнитьТекущимиУдержаниямиНаСервере()//Расчет
	ПериодНачисления= КонецМесяца(Объект.ПериодНачисления);
	Объект.Начисления.Очистить();
	
	ТЗНачисления= Объект.Начисления.Выгрузить();
	//////////////////////////// Штрафы /////////////////////////////
	//Разовый штраф
	ВыборкаУдержания = ЗапросПоРазовымУдержаниям();
	Пока ВыборкаУдержания.Следующий() Цикл
		НоваяСтрока= Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник= ВыборкаУдержания.Сотрудник;
		НоваяСтрока.Удержание= ВыборкаУдержания.Удержание;
		НоваяСтрока.СуммаУдержания= ВыборкаУдержания.СуммаУдержания;
		НоваяСтрока.РегистраторУдержания= ВыборкаУдержания.Регистратор;
	КонецЦикла;		
	
	//////////////////////////////Периодические штраф////////////////////////////
	ВыборкаУдержания = ЗапросПоПериодическимУдержаниям();
	Пока ВыборкаУдержания.Следующий() Цикл
		Пропустить= Ложь;
		НоваяСтрока= Неопределено;
		ТЗУдержаний= ПолучитьСуммыУдержаний(ВыборкаУдержания);
		
		ДатаОкончанияДействия= ?(ЗначениеЗаполнено(ВыборкаУдержания.ДатаОкончанияДействия), ВыборкаУдержания.ДатаОкончанияДействия, КонецМесяца(Объект.ПериодНачисления));
		ДатаРасчета= ?(ДатаОкончанияДействия>КонецМесяца(Объект.ПериодНачисления), КонецМесяца(Объект.ПериодНачисления), ДатаОкончанияДействия);
		
		РазностьДат= ОбщегоНазначенияУТ.РазностьДат(ВыборкаУдержания.ДатаНачалаДействия, ДатаРасчета, Перечисления.Периодичность.День);
		
		//Закрытые в этом месяце не штрафуем
		Если ВыборкаУдержания.Закрыт = Ложь ИЛИ (ВыборкаУдержания.Закрыт И КонецМесяца(ВыборкаУдержания.ДатаОкончанияДействия) > КонецМесяца(Объект.ПериодНачисления)) Тогда	
			//До начала начисления должно пройти несколько месяцев
			Если РазностьДат >= ВыборкаУдержания.Удержание.КоличествоДнейПередНачаломНачисления Тогда
				НоваяСтрока= Объект.Начисления.Добавить();
				НоваяСтрока.Сотрудник= ВыборкаУдержания.Сотрудник;
				НоваяСтрока.Удержание= ВыборкаУдержания.Удержание;
				НоваяСтрока.РегистраторУдержания= ВыборкаУдержания.Регистратор;
				
				Если ТЗУдержаний.Количество() <> 0 Тогда//последующие разы, уже были удержания 
					НоваяСтрока.СуммаЗадержки= ВыборкаУдержания.Тариф/2;
					НоваяСтрока.СуммаУдержания= ВыборкаУдержания.Тариф/2;
					//Вслучае солидарной ответственности с МАП делим ещё на 2
					Если ТипЗнч(НоваяСтрока.РегистраторУдержания) = Тип("ДокументСсылка.ЛистСогласования") И ЗначениеЗаполнено(НоваяСтрока.РегистраторУдержания.МАП) Тогда
						НоваяСтрока.СуммаЗадержки= НоваяСтрока.СуммаЗадержки/2;
						НоваяСтрока.СуммаУдержания= НоваяСтрока.СуммаУдержания/2;
					КонецЕсли;
				Иначе//Первый раз еще небыло удержаний
					НоваяСтрока.СуммаЗадержки= ВыборкаУдержания.СуммаУдержания;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		/////////////////////////////////////// Возвраты //////////////////////////////////////////
		Если ВыборкаУдержания.Закрыт И НачалоМесяца(ВыборкаУдержания.ДатаОкончанияДействия) = НачалоМесяца(Объект.ПериодНачисления) Тогда 
						
			//Если ТЗУдержаний.Количество() > 0 Тогда 
			//	ПерваяСумма= ТЗУдержаний[0].СуммаЗадержки;
			//Иначе
			//	ПерваяСумма= 0;
			//КонецЕсли;
			//ПослудующиеСуммы= ТЗУдержаний.Итог("СуммаУдержания")-ПерваяСумма;
			//Формула
			//СуммаВозврата= ПерваяСумма+(ПослудующиеСуммы/2);
			//СуммаВозврата= ПерваяСумма;
			СуммаВозврата= ТЗУдержаний.Итог("СуммаЗадержки");
			Если  СуммаВозврата > 0 Тогда
				НоваяСтрока= Объект.Начисления.Добавить();
				НоваяСтрока.Сотрудник= ВыборкаУдержания.Сотрудник;
				НоваяСтрока.Удержание= ВыборкаУдержания.Удержание;
				НоваяСтрока.РегистраторУдержания= ВыборкаУдержания.Регистратор;
				НоваяСтрока.СуммаВозврата= СуммаВозврата;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммыУдержаний(НоваяСтрока)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанийОбороты.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	НачисленияУдержанийОбороты.Сотрудник,
	|	НачисленияУдержанийОбороты.Удержание,
	|	НачисленияУдержанийОбороты.РегистраторУдержания,
	|	СУММА(НачисленияУдержанийОбороты.СуммаВозвратаОборот) КАК СуммаВозврата,
	|	СУММА(НачисленияУдержанийОбороты.СуммаЗадержкиОборот) КАК СуммаЗадержки,
	|	СУММА(НачисленияУдержанийОбороты.СуммаУдержанияОборот) КАК СуммаУдержания
	|ИЗ
	|	РегистрНакопления.НачисленияУдержаний.Обороты(, , , ) КАК НачисленияУдержанийОбороты
	|ГДЕ
	|	НачисленияУдержанийОбороты.Сотрудник = &Сотрудник
	|	И НачисленияУдержанийОбороты.Удержание = &Удержание
	|	И НачисленияУдержанийОбороты.РегистраторУдержания = &РегистраторУдержания
	|	И НачисленияУдержанийОбороты.ПериодНачисления < &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержанийОбороты.Сотрудник,
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанийОбороты.ПериодНачисления, МЕСЯЦ),
	|	НачисленияУдержанийОбороты.РегистраторУдержания,
	|	НачисленияУдержанийОбороты.Удержание
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления";
	
	Запрос.УстановитьПараметр("Сотрудник", НоваяСтрока.Сотрудник);
	Запрос.УстановитьПараметр("Удержание", НоваяСтрока.Удержание);
	Запрос.УстановитьПараметр("РегистраторУдержания", НоваяСтрока.Регистратор);
	Запрос.УстановитьПараметр("ПериодНачисления", КонецМесяца(Объект.ПериодНачисления)-1);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ= РезультатЗапроса.Выгрузить();
	
	Возврат ТЗ;
КонецФункции

//Запросы
&НаСервере
Функция ЗапросПоРазовымУдержаниям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Удержания.Сотрудник,
	|	Удержания.Удержание,
	|	Удержания.ДатаНачалаДействия,
	|	Удержания.ДатаОкончанияДействия,
	|	Удержания.Периодический,
	|	Удержания.Закрыт,
	|	Удержания.СуммаУдержания,
	|	Удержания.Регистратор,
	|	Удержания.Удержание.Тариф КАК Тариф
	|ИЗ
	|	РегистрСведений.Удержания КАК Удержания
	|ГДЕ
	|	Удержания.СуммаУдержания > 0
	|	И НАЧАЛОПЕРИОДА(Удержания.ДатаНачалаДействия, МЕСЯЦ) = &ПериодНачисления
	|	И Удержания.Периодический = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Удержания.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(Объект.ПериодНачисления));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаУдержания = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаУдержания;
КонецФункции
&НаСервере
Функция ЗапросПоПериодическимУдержаниям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Удержания.Сотрудник,
	|	Удержания.Удержание,
	|	Удержания.ДатаНачалаДействия,
	|	Удержания.ДатаОкончанияДействия,
	|	Удержания.Периодический,
	|	Удержания.Закрыт,
	|	Удержания.СуммаУдержания,
	|	Удержания.Регистратор,
	|	Удержания.Удержание.Тариф КАК Тариф
	|ИЗ
	|	РегистрСведений.Удержания КАК Удержания
	|ГДЕ
	|	Удержания.СуммаУдержания > 0
	|	И Удержания.Периодический = ИСТИНА
	|	И Удержания.ДатаНачалаДействия <= &КонецПериодаНачисления
	|	И Удержания.Сотрудник.Недействителен = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Удержания.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("НачалоПериодаНачисления", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("КонецПериодаНачисления", КонецМесяца(Объект.ПериодНачисления));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаУдержания = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаУдержания;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	Объект.ПериодНачисления= НачалоМесяца(Объект.ПериодНачисления);
КонецПроцедуры
