
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрТипЗаписи=0;
	Если Параметры.Свойство("ТипЗаписи", ПараметрТипЗаписи) Тогда
		Если Запись.ТипЗаписи <> ПараметрТипЗаписи Тогда
			Запись.ТипЗаписи=ПараметрТипЗаписи;
		КонецЕсли;
	КонецЕсли;
	Элементы.ЦеноваяГруппа_Номенклатура.Заголовок=?(Запись.ТипЗаписи = 1, "Ценовая группа МД", "Номенклатура");
	Массив = Новый Массив;
	Если Запись.ТипЗаписи = 1 Тогда
		Массив.Добавить(Тип("СправочникСсылка.ТоварныеКатегории"));
	Иначе
		Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	КонецЕсли;
	НашеОписание = Новый ОписаниеТипов(Массив);
	Элементы.ЦеноваяГруппа_Номенклатура.ОграничениеТипа = НашеОписание;
	Запись.ЦеноваяГруппа_Номенклатура = НашеОписание.ПривестиЗначение(Запись.ЦеноваяГруппа_Номенклатура);
	Элементы.ГруппаТоварнойКатегории.Видимость=Запись.ТипЗаписи = 1;
	Элементы.ГруппаНоменклатура.Видимость=Запись.ТипЗаписи = 0;

КонецПроцедуры

#КонецОбласти
