
Функция РежимРаботыПрограммы() Экспорт
	
	РежимРаботы = Новый Структура;
	
	// Права текущего пользователя.
	РежимРаботы.Вставить("ЭтоАдминистраторПрограммы", Пользователи.ЭтоПолноправныйПользователь(, Ложь, Ложь));
	РежимРаботы.Вставить("ЭтоАдминистраторСистемы",   Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь));
	
	// Режимы работы сервера.
	РежимРаботы.Вставить("МодельСервиса", ОбщегоНазначения.РазделениеВключено());
	РежимРаботы.Вставить("Автономный",    ОбщегоНазначения.ЭтоАвтономноеРабочееМесто());
	РежимРаботы.Вставить("Локальный",     НЕ РежимРаботы.Автономный И НЕ РежимРаботы.МодельСервиса);
	РежимРаботы.Вставить("Файловый",        Ложь);
	РежимРаботы.Вставить("КлиентСерверный", Ложь);
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		РежимРаботы.Файловый = Истина;
	Иначе
		РежимРаботы.КлиентСерверный = Истина;
	КонецЕсли;
	
	РежимРаботы.Вставить("ЛокальныйФайловый",
	РежимРаботы.Локальный И РежимРаботы.Файловый);
	РежимРаботы.Вставить("ЛокальныйКлиентСерверный",
	РежимРаботы.Локальный И РежимРаботы.КлиентСерверный);
	
	// Режимы работы клиента.
	РежимРаботы.Вставить("ЭтоWindowsКлиент",   ОбщегоНазначения.ЭтоWindowsКлиент());
	РежимРаботы.Вставить("ЭтоLinuxКлиент",     ОбщегоНазначения.ЭтоLinuxКлиент());
	РежимРаботы.Вставить("ЭтоMacOSКлиент",     ОбщегоНазначения.ЭтоMacOSКлиент());
	РежимРаботы.Вставить("ЭтоВебКлиент",       ОбщегоНазначения.ЭтоВебКлиент());
	РежимРаботы.Вставить("ЭтоМобильныйКлиент", ОбщегоНазначения.ЭтоМобильныйКлиент());
	
	Возврат РежимРаботы;
	
КонецФункции

Функция ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, Настройка, ПустоеЗначение = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	|
	|ГДЕ
	|	Пользователь = &Пользователь
	| И Настройка    = &Настройка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПустоеЗначение = Неопределено Тогда
		ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;
		
	ИначеЕсли Выборка.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
		
	Иначе
		Возврат ПустоеЗначение;
		
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()

Функция ПолучитьЗначениеНастройки(Настройка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	|
	|ГДЕ
	|	Пользователь = &Пользователь
	| И Настройка    = &Настройка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();
	
	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;
		
	ИначеЕсли Выборка.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
		
	Иначе
		Возврат ПустоеЗначение;
		
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеНастройки()

Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции

Функция ИспользуетсяТелефония() Экспорт
	
	Возврат ТелефонияСервер.ИспользуетсяТелефония();
	
КонецФункции

Функция ДействиеПриИсходящемЗвонке() Экспорт
	
	Возврат ТелефонияСервер.ПолучитьНастройкиТелефонии().ДействиеИсходящегоЗвонка;
	
КонецФункции

