&НаКлиенте
Процедура Проверить(Команда)
	ОтправитьПисьма();
КонецПроцедуры

Процедура ОтправитьПисьма() 
	ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Начало отправки писем");
	
	УчетнаяЗапись= Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("tg-alterra22@yandex.ru", Истина);
	
	ВыборкаДетальныеЗаписи= ЗапросКБаллам();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Почта= ВыборкаДетальныеЗаписи.Почта;
		
		Если Не ПроверкаАдресаПочты(Почта) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстHTML= РеквизитФормыВЗначение("Объект").ПолучитьМакет("ТекстHTML").ПолучитьТекст();
		
		ТекстHTML= СтрЗаменить(ТекстHTML, "*КлиентФИО*", ВыборкаДетальныеЗаписи.КлиентФИО);
		
		Если ВыборкаДетальныеЗаписи.КоличествоПриход > 0 Тогда
			ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаНачисленоБаллов*", "На ваш счет начислено "+Строка(ВыборкаДетальныеЗаписи.КоличествоПриход) +" бонусов.");
		Иначе
		ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаНачисленоБаллов*", "");	
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.КоличествоРасход > 0 Тогда
			ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаСписаниеБаллов*", "С вашего счета списано "+Строка(ВыборкаДетальныеЗаписи.КоличествоРасход) +" бонусов.");
		Иначе
			ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаСписаниеБаллов*", "");	
		КонецЕсли;
		
		ТекстHTML= СтрЗаменить(ТекстHTML, "*Баланс*", Строка(ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток));
		
		СкрытаяПочта= "";
		СкрытаяПочта= "ryabushkina@tg-alterra.ru";
		
		//Создаем письмо
		Попытка
			Письмо=  Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
			Письмо.Дата= ТекущаяДата();
			Письмо.Автор= Пользователи.ТекущийПользователь();
			Письмо.Автор= ТекущаяДата();
			Письмо.Ответственный= Пользователи.ТекущийПользователь();
			Письмо.Важность= Перечисления.ВариантыВажностиВзаимодействия.Низкая;
			Письмо.Кодировка= "UTF-8"; 
			Письмо.ОтправительПредставление= "www.tg-alterra.ru - Интернет-магазин";
			Письмо.СписокПолучателейПисьма= Почта;
			Письмо.СписокПолучателейСкрытыхКопий= СкрытаяПочта;
			Письмо.СтатусПисьма= Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
			Письмо.Текст= "";
			Письмо.ТекстHTML= ТекстHTML;
			Письмо.Тема= "Информация по бонусному счету";
			Письмо.ТипТекста= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			Письмо.УчетнаяЗапись= УчетнаяЗапись;
			Письмо.Комментарий= "Отправлено автоматически";
			
			НоваяСтрока = Письмо.ПолучателиПисьма.Добавить();
			НоваяСтрока.Представление = Почта;
			НоваяСтрока.Адрес = Почта;
			
			Если не ПустаяСтрока(СкрытаяПочта) Тогда
				НоваяСтрока = Письмо.ПолучателиСкрытыхКопий.Добавить();
				НоваяСтрока.Представление = СкрытаяПочта;
				НоваяСтрока.Адрес = СкрытаяПочта;
			КонецЕсли;
			
			Письмо.Записать();
			
			ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Отправлено письмо на адресс: "+Почта);
		Исключение
			ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Не удалось отправить письмо на адресс: "+Почта);
		КонецПопытки;
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Окончание отправки писем");
КонецПроцедуры

Функция ЗапросКБаллам() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БонусныеБаллыОстаткиИОбороты.Партнер,
	|	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """") КАК Почта,
	|	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоПриход) КАК КоличествоПриход,
	|	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоРасход) КАК КоличествоРасход,
	|	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	БонусныеБаллыОстаткиИОбороты.Партнер.Наименование КАК КлиентФИО
	|ИЗ
	|	РегистрНакопления.БонусныеБаллы.ОстаткиИОбороты(&Дата1, , Регистратор, , ) КАК БонусныеБаллыОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|		ПО БонусныеБаллыОстаткиИОбороты.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
	|			И (&ТипПочта = ПартнерыКонтактнаяИнформация.Тип)
	|ГДЕ
	|	БонусныеБаллыОстаткиИОбороты.НачисленоОборот <> 0
	|	И ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """") <> """"
	|	И БонусныеБаллыОстаткиИОбороты.Регистратор.Дата МЕЖДУ &Дата1 И &Дата2
	|
	|СГРУППИРОВАТЬ ПО
	|	БонусныеБаллыОстаткиИОбороты.Партнер,
	|	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """"),
	|	БонусныеБаллыОстаткиИОбороты.Партнер.Наименование";
	
	Запрос.УстановитьПараметр("ТипПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи= РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

Функция ПроверкаАдресаПочты(Почта)
	Если ПустаяСтрока(Почта) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	мСтрок= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Почта, "@");
	Если мСтрок.Количество() <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	мСтрок2= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(мСтрок[1], ".");
	Если мСтрок.Количество() < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если мСтрок.Количество() > 3 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

