
&ИзменениеИКонтроль("ВыполнитьПравилаРегистрацииОбъектовДляПланаОбменаПопыткаИсключение")
Процедура Док_ВыполнитьПравилаРегистрацииОбъектовДляПланаОбменаПопыткаИсключение(МассивУзловРезультат, Объект, ИмяПланаОбмена, ДополнительныеПараметры)

	ОбъектМетаданных = ДополнительныеПараметры.ОбъектМетаданных;
	ЭтоРегистр = ДополнительныеПараметры.ЭтоРегистр;
	Замещение = ДополнительныеПараметры.Замещение;
	Выгрузка = ДополнительныеПараметры.Выгрузка;

	ПравилаРегистрацииОбъекта = Новый Массив;

	ИмяПрофиляБезопасности = ОбменДаннымиПовтИсп.ИмяПрофиляБезопасности(ИмяПланаОбмена);
	Если ИмяПрофиляБезопасности <> Неопределено Тогда
		УстановитьБезопасныйРежим(ИмяПрофиляБезопасности);
	КонецЕсли;

	Правила = ПравилаРегистрацииОбъекта(ИмяПланаОбмена, ОбъектМетаданных.ПолноеИмя());

	Для Каждого Правило Из Правила Цикл

		ПравилаРегистрацииОбъекта.Добавить(ПравилоРегистрацииСтруктурой(Правило, Правила.Колонки));

	КонецЦикла;

	Если ПравилаРегистрацииОбъекта.Количество() = 0 Тогда // Правила регистрации не заданы.

		// Если для объекта не созданы ПРО и отключена авторегистрация,
		// то регистрируем объект на всех узлах плана обмена кроме предопределенного.
		Получатели = ОбменДаннымиПовтИсп.УзлыПланаОбмена(ИмяПланаОбмена);

		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивУзловРезультат, Получатели, Истина);

	Иначе // Последовательно выполняем правила регистрации.

		Если ЭтоРегистр Тогда // для регистра

			Для Каждого ПРО Из ПравилаРегистрацииОбъекта Цикл

				// ОПРЕДЕЛЯЕМ ПОЛУЧАТЕЛЕЙ С РЕЖИМОМ ВЫГРУЗКИ "ПО УСЛОВИЮ"

				ОпределитьПолучателейПоУсловиюДляНабораЗаписей(МассивУзловРезультат, ПРО, Объект, ОбъектМетаданных, ИмяПланаОбмена, Замещение, Выгрузка);

				Если ЗначениеЗаполнено(ПРО.ИмяРеквизитаФлага) Тогда

					// ОПРЕДЕЛЯЕМ ПОЛУЧАТЕЛЕЙ С РЕЖИМОМ ВЫГРУЗКИ "ВСЕГДА"

					УстановитьПривилегированныйРежим(Истина);
					Получатели = УзлыДляРегистрацииПоУсловиюВыгружатьВсегда(ИмяПланаОбмена, ПРО.ИмяРеквизитаФлага);
					УстановитьПривилегированныйРежим(Ложь);

					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивУзловРезультат, Получатели, Истина);

					// ОПРЕДЕЛЯЕМ ПОЛУЧАТЕЛЕЙ С РЕЖИМОМ ВЫГРУЗКИ "ПРИ НЕОБХОДИМОСТИ"
					// для наборов записей выполнение регистрации "при необходимости" не имеет физического смысла.

				КонецЕсли;

			КонецЦикла;

		Иначе // для ссылочного типа

			Для Каждого ПРО Из ПравилаРегистрацииОбъекта Цикл

				// Если у объекта есть правило с обработчиком пакетной регистрации,
				// и это проверка регистрации перед выгрузкой, то пропускаем это правило,
				// т.к объект был проверен ранее пакетным обработчиком
				Если ПРО.ПакетноеВыполнениеОбработчиков 
					И Объект.ДополнительныеСвойства.Свойство("ПроверкаРегистрацииПередВыгрузкой")
					И НЕ Объект.ДополнительныеСвойства.Свойство("ИнтерактивноеДополнениеВыгрузки") Тогда
					Продолжить;
				КонецЕсли;

				// ОПРЕДЕЛЯЕМ ПОЛУЧАТЕЛЕЙ С РЕЖИМОМ ВЫГРУЗКИ "ПО УСЛОВИЮ"

				ОпределитьПолучателейПоУсловию(МассивУзловРезультат, ПРО, Объект, ИмяПланаОбмена, ДополнительныеПараметры);

				Если ЗначениеЗаполнено(ПРО.ИмяРеквизитаФлага) Тогда

					// ОПРЕДЕЛЯЕМ ПОЛУЧАТЕЛЕЙ С РЕЖИМОМ ВЫГРУЗКИ "ВСЕГДА"

					УстановитьПривилегированныйРежим(Истина);
					Получатели = УзлыДляРегистрацииПоУсловиюВыгружатьВсегда(ИмяПланаОбмена, ПРО.ИмяРеквизитаФлага);
					УстановитьПривилегированныйРежим(Ложь);

					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивУзловРезультат, Получатели, Истина);

					// ОПРЕДЕЛЯЕМ ПОЛУЧАТЕЛЕЙ С РЕЖИМОМ ВЫГРУЗКИ "ПРИ НЕОБХОДИМОСТИ"

					Если Не Объект.ЭтоНовый() Тогда

						УстановитьПривилегированныйРежим(Истина);
						Получатели = УзлыДляРегистрацииПоУсловиюВыгружатьПриНеобходимости(Объект.Ссылка, ИмяПланаОбмена, ПРО.ИмяРеквизитаФлага);
						УстановитьПривилегированныйРежим(Ложь);
						
						#Вставка
						Если ТипЗнч(Объект) = Тип("СправочникОбъект.Номенклатура") Тогда
					        Если ПроверкаНоменклатурыНаИзминения(Объект) Тогда
					            ОбменБУХ = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("515cf274-a8b4-428b-a9d7-3f00c8b7a4d3");
								СтрокаПолучатели = Получатели.Найти(ОбменБУХ);
								СтрокаУзлов = МассивУзловРезультат.Найти(ОбменБУХ); 
								Если СтрокаУзлов <> Неопределено Тогда
									МассивУзловРезультат.Удалить(СтрокаУзлов);
								КонецЕсли;
								Если СтрокаПолучатели <> Неопределено Тогда
									Получатели.Удалить(СтрокаПолучатели);	
								КонецЕсли;
							КонецЕсли;
					    КонецЕсли;
						#КонецВставки
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивУзловРезультат, Получатели, Истина);

					КонецЕсли;

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Функция ПроверкаНоменклатурыНаИзминения(Объект)  
	Возврат Ложь;

     Запрос = Новый Запрос("
        |ВЫБРАТЬ
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.НаборУпаковок КАК НаборУпаковок,
		|	Номенклатура.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
		|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
		|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка");

    Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        Если Выборка.Наименование <> Объект.Наименование
            ИЛИ Выборка.НаборУпаковок <> Объект.НаборУпаковок
            ИЛИ Выборка.ИспользоватьУпаковки <> Объект.ИспользоватьУпаковки
			ИЛИ Выборка.СтавкаНДС <> Объект.СтавкаНДС
			ИЛИ Выборка.НаименованиеПолное <> Объект.НаименованиеПолное 
			ИЛИ Выборка.ПометкаУдаления <> Объект.ПометкаУдаления Тогда
                Возврат Ложь;
        КонецЕсли;
    КонецЦикла;                        
    Возврат Истина;
КонецФункции