#Область ИзменениеДанных

// Вносит изменения в данные по поставке
//
// Параметры:
//  МассивЗаказов  - Массив (СправочникСсылка.ЗаказыПоставщику) - заказы, состояние которых должно измениться в сетке. Можно отправлять один заказ не в массиве.
//                
//  УсловиеЗаписи - Строка - предопределенные значения. "Новое", "Редактирование", "Удаление", "РейсИзменениеПлана". Для удаления записи получаем предопределенную структуру, например.
//
//  ИзменяемыеПараметры  - Соответствие, стуктура - Соответствие: ключ - "ЗаказПоставщику", значение - структура параметров. Если параметры одинаковые для всех предполагаемых строк, можно передать структурой. 
//                                                                                    Отдельный параметры структуры - "Оборудование" должен иметь тип "Соответствие" с ключом - ТехРесурс и значение - его количество
//  РедактированиеИзЗаказа - Булево - могла ли измениться ТЧ с оборудованием или нет.
//
Процедура ИзменитьДанныеСеткиПоставок(Знач МассивЗаказов, УсловиеЗаписи, ИзменяемыеПараметры=Неопределено, РедактированиеИзЗаказа=Ложь) Экспорт
	
	Если ТипЗнч(МассивЗаказов) <> Тип("Массив") Тогда
		Заказ = МассивЗаказов;
		МассивЗаказов = Новый Массив;
		МассивЗаказов.Добавить(Заказ);
	КонецЕсли;
	
	//предварительная обработка полученных параметров
	Если ИзменяемыеПараметры = Неопределено Тогда
		Если ВРег(УсловиеЗаписи) = ВРег("Новое") Тогда
		КонецЕсли;
	КонецЕсли;
	
	//получение/редактирование данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ГрафикПоставокНаСкладСрезПоследних.Оборудование КАК Оборудование,
	|	ГрафикПоставокНаСкладСрезПоследних.Поток КАК Поток,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
	|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки КАК ПродолжительностьРазгрузки,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяПриездаФакт КАК ДатаВремяПриездаФакт,
	|	ГрафикПоставокНаСкладСрезПоследних.КоличествоИспользуется КАК КоличествоИспользуется,
	|	ГрафикПоставокНаСкладСрезПоследних.СогласованоСоСкладом КАК СогласованоСоСкладом,
	|	ГрафикПоставокНаСкладСрезПоследних.ТекстПоставки КАК ТекстПоставки
	|ИЗ
	|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних(, ЗаказПоставщику В (&МассивЗаказов)) КАК ГрафикПоставокНаСкладСрезПоследних
	|ИТОГИ
	|	МАКСИМУМ(Поток),
	|	МАКСИМУМ(ДатаВремяРазгрузкиПлан),
	|	МАКСИМУМ(ПродолжительностьРазгрузки),
	|	МАКСИМУМ(ДатаВремяПриездаФакт),
	|	СУММА(КоличествоИспользуется),
	|	МАКСИМУМ(СогласованоСоСкладом),
	|	МАКСИМУМ(ТекстПоставки)
	|ПО
	|	ЗаказПоставщику,
	|	Оборудование";
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаказы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗаказПоставщику");
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ПустойПоток = Справочники.РабочиеУчастки.ПустаяСсылка();
	Пока ВыборкаЗаказы.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаЗаказы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Оборудование");
		Если ИзменяемыеПараметры<>Неопределено Тогда
			Если ТипЗнч(ИзменяемыеПараметры) = Тип("Соответствие") Тогда
				ПараметрыЗаказа = ИзменяемыеПараметры[ВыборкаЗаказы.ЗаказПоставщику];
			Иначе
				ПараметрыЗаказа = ИзменяемыеПараметры;
			КонецЕсли;
		КонецЕсли;
		
		Если РедактированиеИзЗаказа Тогда
			ЕстьОборудование =  ПараметрыЗаказа.Свойство("Оборудование");
			Если ЕстьОборудование Тогда
				ОборудованиеЗаказа = ПараметрыЗаказа["Оборудование"];
				Для каждого СтрОборудования из ОборудованиеЗаказа Цикл
					НаборЗаписейГрафикаПоставок = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьНаборЗаписей();
					НаборЗаписейГрафикаПоставок.Отбор.ЗаказПоставщику.Установить(ВыборкаЗаказы.ЗаказПоставщику);
					НаборЗаписейГрафикаПоставок.Отбор.Оборудование.Установить(СтрОборудования.Ключ);
					НоваяЗапись = НаборЗаписейГрафикаПоставок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаЗаказы);
					НоваяЗапись.Период = ТекущаяДата();
					НоваяЗапись.АвторИзменений = ТекущийПользователь;
					НоваяЗапись.Оборудование = СтрОборудования.Ключ;
					НоваяЗапись.КоличествоИспользуется = СтрОборудования.Значение;
					Если НаборЗаписейГрафикаПоставок.Количество()>0 Тогда
						УстановитьПривилегированныйРежим(Истина);
						НаборЗаписейГрафикаПоставок.Записать(Ложь);
						УстановитьПривилегированныйРежим(Ложь);
					КонецЕсли;
				КонецЦикла;
			Иначе
				НоваяЗапись = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ПараметрыЗаказа);
				НоваяЗапись.Период = ТекущаяДата();
				НоваяЗапись.ЗаказПоставщику = Заказ;
				НоваяЗапись.АвторИзменений = ТекущийПользователь;
				УстановитьПривилегированныйРежим(Истина);
				НоваяЗапись.Записать(Ложь);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		Иначе
			//оборудование
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НаборЗаписейГрафикаПоставок = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьНаборЗаписей();
				НаборЗаписейГрафикаПоставок.Отбор.ЗаказПоставщику.Установить(ВыборкаЗаказы.ЗаказПоставщику);
				НаборЗаписейГрафикаПоставок.Отбор.Оборудование.Установить(ВыборкаДетальныеЗаписи.Оборудование);
				Если БудемЗаписыватьДанные(УсловиеЗаписи, ИзменяемыеПараметры, ВыборкаДетальныеЗаписи) Тогда
					НоваяЗапись = НаборЗаписейГрафикаПоставок.Добавить();
					НоваяЗапись.Период = ТекущаяДата();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
					НоваяЗапись.АвторИзменений = ТекущийПользователь;
					
					Если ВРег(УсловиеЗаписи) = ВРег("Удаление") Тогда
						НоваяЗапись.ДатаВремяРазгрузкиПлан = НачалоДня(НоваяЗапись.ДатаВремяРазгрузкиПлан);
					Иначе
						Для каждого Параметр Из ПараметрыЗаказа Цикл
							Если Параметр.Ключ = "Оборудование" Тогда
								Если Параметр.Значение[ВыборкаДетальныеЗаписи.Оборудование]<>Неопределено Тогда
									Значение = ВыборкаДетальныеЗаписи.Оборудование;
									НоваяЗапись.КоличествоИспользуется = Параметр.Значение[ВыборкаДетальныеЗаписи.Оборудование];
								КонецЕсли;
							Иначе
								Значение = Параметр.Значение;
							КонецЕсли;
							НоваяЗапись[Параметр.Ключ] = Значение;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				Если НаборЗаписейГрафикаПоставок.Количество()>0 Тогда
					УстановитьПривилегированныйРежим(Истина);
					НаборЗаписейГрафикаПоставок.Записать(Ложь);
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если ВРег(УсловиеЗаписи) <> ВРег("Удаление") Тогда
		//создание нового интервала поставки
		Если ВыборкаЗаказы.Количество()=0 Тогда
			Заказ = МассивЗаказов[0];
			Если ТипЗнч(ИзменяемыеПараметры) = Тип("Соответствие") Тогда
				ПараметрыДокумента = ИзменяемыеПараметры[Заказ];
			Иначе
				ПараметрыДокумента = ИзменяемыеПараметры;
			КонецЕсли;
			ЕстьОборудование =  ПараметрыДокумента.Свойство("Оборудование");
			Если ЕстьОборудование Тогда
				ОборудованиеЗаказа = ПараметрыДокумента["Оборудование"];
			Иначе
				ОборудованиеЗаказа = Новый Массив;
				ОборудованиеЗаказа.Добавить(Справочники.ТехническиеРесурсыСклада.ПустаяСсылка());
			КонецЕсли;
			Для каждого СтрОборудования из ОборудованиеЗаказа Цикл
				НоваяЗапись = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ПараметрыДокумента);
				НоваяЗапись.Период = ТекущаяДата();
				НоваяЗапись.ЗаказПоставщику = Заказ;
				НоваяЗапись.АвторИзменений = ТекущийПользователь;
				Если ЕстьОборудование Тогда
					НоваяЗапись.Оборудование = СтрОборудования.Ключ;
					НоваяЗапись.КоличествоИспользуется = СтрОборудования.Значение;
				КонецЕсли;
				УстановитьПривилегированныйРежим(Истина);
				НоваяЗапись.Записать(Ложь);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЧтениеДанных

// Получить состояние поставки
//
// Параметры:
//  МассивЗаказов - массив - список заказов, для которых необходимо получить
//                 текущее состояние поставки
//  ПолучитьПоследнее - булево - получить только последнее актуальное состояние или полную таблицу состояний поставки 
//
// Возвращаемое значение:
//  таблица значений   - если требуется получить последнее, то результат с колонками "Заказ", "СостояниеПоставки", "ВремяИзмененияСостоянияПоставки". В случаях с состоянием "Запланирована" подтягивается не дата изменения, 
//                 а дата, на которую была запланирована поставка. Если требуются все состояния - передается таблица "Заказ", "ТекущееСостояние", "ВремяПрибытие", "ВремяВъезд", "ВремяВыезд"
//
Функция ПолучитьТекущееСостояниеПоставки(МассивЗаказов, ПолучитьПоследнее = Истина) Экспорт
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка КАК Заказ
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка В(&МассивЗаказов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Документ КАК Документ,
		|	МИНИМУМ(Итог.ВремяВъезд) КАК ВремяВъезд,
		|	МАКСИМУМ(Итог.ВремяВыезд) КАК ВремяВыезд
		|ПОМЕСТИТЬ втОтметкиКПП
		|ИЗ
		|	(ВЫБРАТЬ
		|		СостояниеОтгрузкиДокумента.Документ КАК Документ,
		|		ВЫБОР
		|			КОГДА СостояниеОтгрузкиДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Заехал)
		|				ТОГДА МИНИМУМ(СостояниеОтгрузкиДокумента.Период)
		|		КОНЕЦ КАК ВремяВъезд,
		|		ВЫБОР
		|			КОГДА СостояниеОтгрузкиДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Выехал)
		|				ТОГДА МАКСИМУМ(СостояниеОтгрузкиДокумента.Период)
		|		КОНЕЦ КАК ВремяВыезд
		|	ИЗ
		|		РегистрСведений.СостояниеОтгрузкиДокумента КАК СостояниеОтгрузкиДокумента
		|	ГДЕ
		|		СостояниеОтгрузкиДокумента.Документ В(&МассивЗаказов)
		|		И СостояниеОтгрузкиДокумента.Состояние В(&СтатусыДоставки)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СостояниеОтгрузкиДокумента.Документ,
		|		СостояниеОтгрузкиДокумента.Состояние) КАК Итог
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказы.Заказ КАК Заказ,
		|	""Прибыл"" КАК Состояние,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяПриездаФакт КАК ДатаСостояния,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан
		|ПОМЕСТИТЬ втЗаездыФакт
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
		|		ПО втЗаказы.Заказ = ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаездыФакт.Заказ КАК Заказ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втОтметкиКПП.ВремяВыезд, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""Выехал""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(втОтметкиКПП.ВремяВъезд, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ""Заехал""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(втЗаездыФакт.ДатаСостояния, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|							ТОГДА ""Прибыл""
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЕСТЬNULL(втЗаездыФакт.ДатаВремяРазгрузкиПлан, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|									ТОГДА ""Запланирована""
		|								ИНАЧЕ ""Не запланирована""
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ТекущееСостояние,
		|	ЕСТЬNULL(втЗаездыФакт.ДатаСостояния, ДАТАВРЕМЯ(1, 1, 1)) КАК ВремяПрибытие,
		|	ЕСТЬNULL(втОтметкиКПП.ВремяВъезд, ДАТАВРЕМЯ(1, 1, 1)) КАК ВремяВъезд,
		|	ЕСТЬNULL(втОтметкиКПП.ВремяВыезд, ДАТАВРЕМЯ(1, 1, 1)) КАК ВремяВыезд
		|ПОМЕСТИТЬ втИтог
		|ИЗ
		|	втЗаездыФакт КАК втЗаездыФакт
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОтметкиКПП КАК втОтметкиКПП
		|		ПО втЗаездыФакт.Заказ = втОтметкиКПП.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИтог.Заказ КАК Заказ,
		|	втИтог.ТекущееСостояние КАК ТекущееСостояние,
		|	втИтог.ВремяПрибытие КАК ВремяПрибытие,
		|	втИтог.ВремяВъезд КАК ВремяВъезд,
		|	втИтог.ВремяВыезд КАК ВремяВыезд
		|ИЗ
		|	втИтог КАК втИтог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИтог.Заказ КАК Заказ,
		|	втИтог.ТекущееСостояние КАК СостояниеПоставки,
		|	ВЫБОР
		|		КОГДА втИтог.ВремяВыезд <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА втИтог.ВремяВыезд
		|		ИНАЧЕ ВЫБОР
		|				КОГДА втИтог.ВремяВъезд <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА втИтог.ВремяВъезд
		|				ИНАЧЕ ВЫБОР
		|						КОГДА втИтог.ВремяПрибытие <> ДАТАВРЕМЯ(1, 1, 1)
		|							ТОГДА втИтог.ВремяПрибытие
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ВремяИзмененияСостоянияПоставки
		|ИЗ
		|	втИтог КАК втИтог";
		СтатусыДоставки = Новый Массив;
		СтатусыДоставки.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Заехал);
		СтатусыДоставки.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Выехал);
		Запрос.УстановитьПараметр("СтатусыДоставки", СтатусыДоставки);
		Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		УстановитьПривилегированныйРежим(Ложь);
		Если ПолучитьПоследнее Тогда
			ТЗ = РезультатЗапроса[5].Выгрузить();
			
		Иначе
			ТЗ = РезультатЗапроса[4].Выгрузить();
		КонецЕсли;
		Возврат ТЗ;
	
КонецФункции

#КонецОбласти

#Область Вспомогательные
//Проверка на транзитный склад (у них нет секций)
Функция ЕстьСекцииУСклада(ПроверяемыйСклад) Экспорт 
	ЗапросУчастки = Новый Запрос;
	ЗапросУчастки.Текст = "ВЫБРАТЬ
	                      |	РабочиеУчастки.Ссылка КАК РабочийУчасток
	                      |ИЗ
	                      |	Справочник.РабочиеУчастки КАК РабочиеУчастки
	                      |ГДЕ
	                      |	РабочиеУчастки.Владелец = &Склад
	                      |	И РабочиеУчастки.ПометкаУдаления = ЛОЖЬ";
	ЗапросУчастки.УстановитьПараметр("Склад", ПроверяемыйСклад);
	Результат = ЗапросУчастки.Выполнить();
	Выборка = Результат.Выбрать();
	Если  Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ЗапросПоТЗВесОбъем(ТабТовары, ДокументСсылка=Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тз.Номенклатура КАК Номенклатура,
	|	тз.Количество КАК КоличествоУпаковок,
	|	тз.Упаковка,
	|	&Ссылка КАК ЗаказПоставщику,
	|   тз.Отменено
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&ТЗ КАК тз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.ЗаказПоставщику КАК ЗаказПоставщику,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА втТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА спрНоменклатура.ЕдиницаИзмерения
	|		ИНАЧЕ втТовары.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	спрНоменклатура.ВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
	|	спрНоменклатура.ОбъемЕдиницаИзмерения КАК НоменклатураОбъемЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА спрНоменклатура.ВесЗнаменатель <> 0
	|			ТОГДА спрНоменклатура.ВесЧислитель / спрНоменклатура.ВесЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесКоэффициентНоменклатура,
	|	ВЫБОР
	|		КОГДА спрНоменклатура.ОбъемЗнаменатель <> 0
	|			ТОГДА спрНоменклатура.ОбъемЧислитель /спрНоменклатура.ОбъемЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемКоэффициентНоменклатура
	|ПОМЕСТИТЬ втНоменклатураДокумента
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО втТовары.Номенклатура = спрНоменклатура.Ссылка
	|ГДЕ втТовары.Отменено=Ложь";
	Запрос.УстановитьПараметр("ТЗ", ТабТовары);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	СтруктураЗапрос = Новый Структура;
	СтруктураЗапрос.Вставить("Запрос", Запрос);
	АдресЗапросаКоэффициентыТоваров = ПоместитьВоВременноеХранилище(СтруктураЗапрос, Новый УникальныйИдентификатор());

	Возврат АдресЗапросаКоэффициентыТоваров;
КонецФункции

Функция БудемЗаписыватьДанные(УсловиеЗаписи, ПараметрыУсловияЗаписи, СтрокаВыборки)

	Если  УсловиеЗаписи <> "РейсИзменениеПлана" Тогда
		Возврат Истина;
	Иначе
		Если ПараметрыУсловияЗаписи.ДатаВремяРазгрузкиПлан <> НачалоДня(СтрокаВыборки.ДатаВремяРазгрузкиПлан) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	

	Возврат Ложь;
КонецФункции

#КонецОбласти
