#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СозданиеНаОсновании
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ЧекККМ.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);    
	
КонецПроцедуры       

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	ИмяДокумента = "АрендаНоменклатурыВозврат";
	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяДокумента]) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы[ИмяДокумента].ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы[ИмяДокумента]);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции

Процедура ЗаполнитьДокументРеализацияПоОснованию(Объект, ДанныеЗаполнения) Экспорт
	
	ДокОснование = ДанныеЗаполнения;
	ДанныеЗаполнения = Новый Структура;
	
	ЗаполнитьЗначенияСвойств(Объект, ДокОснование, , "Номер, Дата, Автор");	
	Объект.Согласован= Истина;
	Объект.Дата= ТекущаяДата();
	Объект.Статус= Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	Объект.ХозяйственнаяОперация= Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	Объект.СпособДоставки= Перечисления.СпособыДоставки.Самовывоз;
	Объект.ВалютаВзаиморасчетов= Объект.Соглашение.Валюта;
	Справочники.ДоговорыКонтрагентов.УдалитьПорядокОплаты(Объект, Объект.Соглашение);
	Объект.ВариантОформленияПродажи= Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	Объект.ДатаРаспоряжения= ДокОснование.Дата;
	Объект.НалогообложениеНДС= АльтерраОбщегоНазначения.ПолучитьНалогообложениеНДС(Объект.Организация);
	Объект.БанковскийСчетОрганизации= АльтерраОбщегоНазначения.ПолучитьБанковскийСчетПоУмолчанию(Объект.Организация, Объект.Валюта);
	Объект.ВариантОформленияПродажи= Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	
	Объект.ЗаполнитьЭтапыГрафикаОплаты();
	
	Для Каждого ТоварОснования Из ДокОснование.Товары Цикл
		НоваяСтрока= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТоварОснования.УслугаАренды;
		НоваяСтрока.Склад = Объект.Склад;
		НоваяСтрока.Упаковка = ТоварОснования.УслугаАренды.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТоварОснования.КоличествоУслуги;
		НоваяСтрока.КоличествоУпаковок = ТоварОснования.КоличествоУслуги;
		НоваяСтрока.Цена = ТоварОснования.ЦенаУслуги;
		НоваяСтрока.ВидЦены = ТоварОснования.ВидЦены;
		НоваяСтрока.Сумма = ТоварОснования.СуммаУслуги;
		НоваяСтрока.СтавкаНДС = ПреобразоватьНДС(ТоварОснования.СтавкаНДС);
		НоваяСтрока.СуммаНДС = ТоварОснования.СуммаНДСУслуги;
		НоваяСтрока.СуммаСНДС = ТоварОснования.СуммаСНДСУслуги;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаполнитьДокументЧекККМПоОснованию(Объект, ДанныеЗаполнения) Экспорт
	
	ДокОснование = ДанныеЗаполнения;
	ДанныеЗаполнения = Новый Структура;
	
	ЗаполнитьЗначенияСвойств(Объект, ДокОснование,,"Номер,Дата,Автор");
	
	Объект.Дата = ТекущаяДата();
    Объект.ДокументОснование = ДокОснование.Ссылка;
	Объект.Статус = Перечисления.СтатусыЧековККМ.ОтложенСРезервированием;
	Объект.Автор = Пользователи.ТекущийПользователь();
	Объект.Менеджер = Объект.Автор;
	Объект.ОтложенДо = КонецДня(ТекущаяДата());
	Объект.ВидЦены = Объект.Соглашение.ВидЦен;
	//Отменить заполнение реквизита Контрагент при создании документа Чек ККМ
	//на основании документа Возврат аренды номенклатуры
	Объект.Контрагент = ПустаяСсылка();
	
	
	Если РольДоступна("Полныеправа") ИЛИ РольДоступна("ОтметкаКассы") Тогда
		Объект.КассаККМ = Справочники.КассыККМ.КассаККМФискальныйРегистраторДляРМК();
	Иначе
		Объект.КассаККМ = АльтерраОбщегоНазначения.КассаККМПоумолчанию(ДокОснование.Подразделение);
	КонецЕсли;

	СтруктураСостояниеКассовойСмены = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Объект.КассаККМ);
	Если Объект.Статус <> Перечисления.СтатусыЧековККМ.Пробит
		И Объект.КассоваяСмена <> СтруктураСостояниеКассовойСмены.КассоваяСмена Тогда
		Объект.КассоваяСмена = СтруктураСостояниеКассовойСмены.КассоваяСмена;
	КонецЕсли;
	
	Для Каждого ТоварОснования Из ДокОснование.Товары Цикл
		НоваяСтрока= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТоварОснования.УслугаАренды;
		НоваяСтрока.Склад = Объект.Склад;
		НоваяСтрока.Упаковка = ТоварОснования.УслугаАренды.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТоварОснования.КоличествоУслуги;
		НоваяСтрока.КоличествоУпаковок = ТоварОснования.КоличествоУслуги;
		НоваяСтрока.Цена = ТоварОснования.ЦенаУслуги;
		НоваяСтрока.ВидЦены = ТоварОснования.ВидЦены;
		НоваяСтрока.Сумма = ТоварОснования.СуммаУслуги; 
		НоваяСтрока.СтавкаНДС = ПреобразоватьНДС(ТоварОснования.СтавкаНДС);	
		НоваяСтрока.СуммаНДС = ТоварОснования.СуммаНДСУслуги;
		НоваяСтрока.СуммаСНДС = ТоварОснования.СуммаСНДСУслуги;
		НоваяСтрока.Продавец = Объект.Менеджер;
	КонецЦикла; 
	
КонецПроцедуры

Функция ПреобразоватьНДС(СтавкаНДС) 
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		СтавкаИзСправочника = Справочники.СтавкиНДС.НайтиПоНаименованию(СтавкаНДС);
		Если ЗначениеЗаполнено(СтавкаИзСправочника) Тогда
			Возврат СтавкаИзСправочника;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;
КонецФункции	

#КонецОбласти 


#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры
#КонецОбласти 


#Область Экспортные
Функция ПолучитьТоварДляВозврата(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АрендаНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	АрендаНоменклатурыОстатки.Характеристика КАК Характеристика,
	|	АрендаНоменклатурыОстатки.ВАрендеОстаток КАК ВАрендеОстаток
	|ПОМЕСТИТЬ ВТ_ОстатокАренды
	|ИЗ
	|	РегистрНакопления.АрендаНоменклатуры.Остатки КАК АрендаНоменклатурыОстатки
	|ГДЕ
	|	АрендаНоменклатурыОстатки.ДокументАренды = &Аренда
	|	И АрендаНоменклатурыОстатки.ВАрендеОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АрендаНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	АрендаНоменклатурыТовары.Характеристика КАК Характеристика,
	|	АрендаНоменклатурыТовары.УслугаАренды КАК УслугаАренды,
	|	АрендаНоменклатурыТовары.Цена КАК Цена,
	|	АрендаНоменклатурыТовары.Сумма КАК Сумма,
	|	АрендаНоменклатурыТовары.СтавкаНДС КАК СтавкаНДС,
	|	АрендаНоменклатурыТовары.СуммаНДС КАК СуммаНДС,
	|	АрендаНоменклатурыТовары.СуммаСНДС КАК СуммаСНДС,
	|	АрендаНоменклатурыТовары.ЦенаУслуги КАК ЦенаУслуги,
	|	АрендаНоменклатурыТовары.СуммаУслуги КАК СуммаУслуги,
	|	АрендаНоменклатурыТовары.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	АрендаНоменклатурыТовары.СуммаСНДСУслуги КАК СуммаСНДСУслуги,
	|	АрендаНоменклатурыТовары.СуммаЗалога КАК СуммаЗалога,
	|	АрендаНоменклатурыТовары.Период КАК Период,
	|	АрендаНоменклатурыТовары.ДатаВозврата КАК ДатаВозврата,
	|	ВТ_ОстатокАренды.ВАрендеОстаток КАК Количество,
	|	ВТ_ОстатокАренды.ВАрендеОстаток КАК КоличествоУслуги,
	|	&ДатаСдачиВАренду КАК ДатаСдачиВАренду
	|ИЗ
	|	ВТ_ОстатокАренды КАК ВТ_ОстатокАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АрендаНоменклатуры.Товары КАК АрендаНоменклатурыТовары
	|		ПО (АрендаНоменклатурыТовары.Номенклатура = ВТ_ОстатокАренды.Номенклатура)
	|			И (АрендаНоменклатурыТовары.Характеристика = ВТ_ОстатокАренды.Характеристика)
	|ГДЕ
	|	АрендаНоменклатурыТовары.Ссылка = &Аренда";

	Запрос.УстановитьПараметр("Аренда", Объект.Основание);
	Запрос.УстановитьПараметр("ДатаСдачиВАренду", Объект.ДатаСдачиВАренду);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();

	Возврат ТЗ;
	
КонецФункции


#КонецОбласти
#КонецЕсли
