
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Показатель=Параметры.ПоказательРасчета;
	СКД=Показатель.ХранилищеСхемыКомпоновкиДанных.получить();
	НастройкиСКД=Показатель.ХранилищеНастроекКомпоновкиДанных.получить();
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	если НастройкиСКД<>неопределено тогда 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСКД);
	иначе
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	конецесли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
Перем ДанныеРасшифровкиОбъект;
			СхемаКомпоновкиДанных=Показатель.ХранилищеСхемыКомпоновкиДанных.получить();

			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			//для отчета  
			МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровкиОбъект);
			//для варианта
			//МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровкиОбъект);
			АдресСхемыИсполненногоОтчета = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,  УникальныйИдентификатор);
			ВывестиМакетКомпоновкиДанныхВТабличныйДокумент(МакетКомпоновкиДанных, ДанныеРасшифровкиОбъект);
КонецПроцедуры
&НаСервере
Процедура ВывестиМакетКомпоновкиДанныхВТабличныйДокумент(МакетКомпоновкиДанных, ДанныеРасшифровкиОбъект)
	
	РезультатТабличныйДокумент.Очистить();
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровкиОбъект, Ложь);
	
	ПроцессорВыводаРезультатаОтчета = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультатаОтчета.УстановитьДокумент(РезультатТабличныйДокумент);
	ПроцессорВыводаРезультатаОтчета.НачатьВывод();
	ПроцессорВыводаРезультатаОтчета.Вывести(ПроцессорКомпоновкиДанных);
	ПроцессорВыводаРезультатаОтчета.ЗакончитьВывод();
	
	Если ДанныеРасшифровкиОбъект <> Неопределено Тогда
		
		АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОбъект, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
