#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ПолучитьСобытияДокумента(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СобытияДокументовАльтерра.Документ КАК Документ,
	|	СобытияДокументовАльтерра.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.СобытияДокументовАльтерра КАК СобытияДокументовАльтерра
	|ГДЕ
	|	СобытияДокументовАльтерра.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ= РезультатЗапроса.Выгрузить();
	
	мСобытий= ТЗ.ВыгрузитьКолонку("Документ");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат мСобытий
КонецФункции

Функция ПолучитьПоследнееСобытие(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияДокументовАльтерраСрезПоследних.Документ КАК Документ,
	|	СобытияДокументовАльтерраСрезПоследних.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.СобытияДокументовАльтерра.СрезПоследних(, Документ = &Документ) КАК СобытияДокументовАльтерраСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Событие;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Неопределено;
	
КонецФункции

Функция БылоСобытие(Документ, Событие) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобытияДокументовАльтерра.Документ КАК Документ,
	|	СобытияДокументовАльтерра.Событие КАК Событие,
	|	СобытияДокументовАльтерра.Период КАК Период
	|ИЗ
	|	РегистрСведений.СобытияДокументовАльтерра КАК СобытияДокументовАльтерра
	|ГДЕ
	|	СобытияДокументовАльтерра.Документ = &Документ
	|	И СобытияДокументовАльтерра.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Событие", Событие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Ложь;
	
КонецФункции

Процедура ЗаписатьСобытие(Документ, Событие, Пользователь = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата();
	Запись.Документ = Документ;
	Запись.Событие = Событие;
	Если Пользователь <> Неопределено Тогда
		Запись.Пользователь = Пользователь; 
	КонецЕсли;
	
	НаборЗаписей.Записать(Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
#КонецЕсли
