#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ДляЗаданийКЗакрытиюМесяца") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// В форме списка регистра заданий к закрытию месяца для выбора доступны только те значения перечисления,
	// которые поддерживаются в механизме закрытия месяца.
	// см. использование функции ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца().
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов);
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов);
	КонецЕсли;
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РаспределениеРасходовПоНаправлениямДеятельности);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РаспределениеДоходовПоНаправлениямДеятельности);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС);
	Если ПолучитьФункциональнуюОпцию("УчетДисконтированнойКредиторскойЗадолженностиПоставщикам") Тогда
		ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетПроцентныхРасходовДисконтирования);
	КонецЕсли;
	ЗакрытиеМесяцаЛокализация.ДополнитьДанныеВыбораОперацийЗакрытияМесяца(ДанныеВыбора);
	
	ДанныеВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает неиспользуемые операции закрытия месяца, по которым не должно быть записей в регистре ЗаданияКЗакрытиюМесяца.
// 
// Возвращаемое значение:
// Массив из ПеречислениеСсылка.ОперацииЗакрытияМесяца - неиспользуемые операции
Функция НеиспользуемыеОперации() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПустаяСсылка());
	Результат.Добавить(Перечисления.ОперацииЗакрытияМесяца.УдалитьИсправлениеОшибокКорреспонденцииФинансовыхРегистров);
	Результат.Добавить(Перечисления.ОперацииЗакрытияМесяца.УдалитьОформлениеПередачМатериаловВПроизводство);
	Результат.Добавить(Перечисления.ОперацииЗакрытияМесяца.УдалитьПроверкаОшибокКорреспонденцииФинансовыхРегистров);
	
	Возврат Результат; 
	
КонецФункции

//++ Локализация


//-- Локализация

#КонецОбласти

#КонецЕсли
