
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;    
	ВидЦены = Параметры.ВидЦены;
	ДопСведение = Параметры.ДополнительноеСведение;
	ДатаДокумента = Параметры.ДатаДокумента;    
	ИнициализироватьТабличныйДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	МакетЗаполненияПоВнешнемуИсточнику = Обработки.ЗагрузкаТоваровИзВнешнихФайлов.ПолучитьМакет("МакетПроверкиЦенников");
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Очистить();                          
	
	ТабличныйДокумент.Присоединить(ОбластьТовары);               
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаявку(Команда)
	ЗаполненыНоменклатураКодНоменклатура = ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C2").Текст);
	
	Если Не ЗаполненыНоменклатураКодНоменклатура Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	Если СопоставленыДанныеТабличногоДокументаСДаннымиИБ() Тогда 
		ЗаполнениеТаблицы();
		ПеренестиТовары();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция СопоставленыДанныеТабличногоДокументаСДаннымиИБ()
	
	ТоварыДляДокумента.Очистить();
	НомерСтроки = 2 ;
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ЗаполненыНоменклатураКодНоменклатура=ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст);
	
	Пока ЗаполненыНоменклатураКодНоменклатура Цикл                             
		Код=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст;   
		Номенклатура=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст; 
		НоменклатураСсылка=""; 
		
		Если ЗначениеЗаполнено(Код) И НЕ ЗначениеЗаполнено(НоменклатураСсылка) Тогда
			НоменклатураСсылка = Справочники.Номенклатура.НайтиПоКоду(Код);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Номенклатура) И НЕ ЗначениеЗаполнено(НоменклатураСсылка) Тогда
			НоменклатураСсылка=Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура, Истина);
		КонецЕсли;            
		
		Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда  
			Стр=ТоварыДляДокумента.Добавить();
			Стр.Код = НоменклатураСсылка.Код;       
			Стр.Номенклатура=НоменклатураСсылка;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Номенклатура не найдена. Проверьте корректность введенных данных и попробуйте заново.";      
			Сообщение.Сообщить();
		КонецЕсли;	
		НомерСтроки = НомерСтроки+1 ;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		ЗаполненыНоменклатураКодНоменклатура=ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст)
			Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст);

	КонецЦикла;	                                   
	
	Возврат  ЗначениеЗаполнено(НоменклатураСсылка);
	
КонецФункции   

Процедура ЗаполнениеТаблицы()
                                                    	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВР_таблица
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_таблица.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаТекущая,
		|	ДополнительныеСведения.Значение КАК ДополнительноеСведение,
		|	ДополнительныеСведения.Свойство КАК Свойство
		|ИЗ
		|	ВР_таблица КАК ВР_таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВР_таблица.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ВР_таблица.Номенклатура = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство = &ДополнительныеСведения)";      
	
	Запрос.УстановитьПараметр("Таблица", ТоварыДляДокумента.Выгрузить());
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Период", ДатаДокумента);
	Запрос.УстановитьПараметр("ДополнительныеСведения", ДопСведение);
	РезультатЗапроса = Запрос.Выполнить();     
	ТоварыДляДокумента.Загрузить(РезультатЗапроса.Выгрузить());	
КонецПроцедуры  

&НаКлиенте
Процедура ПеренестиТовары()
		АдресТоваровВХранилище = ПоместитьТоварыВХранилище();
		Закрыть(АдресТоваровВХранилище);
КонецПроцедуры

&НаСервере
Функция ПоместитьТоварыВХранилище()
	ТоварыНаПроверку = ТоварыДляДокумента.Выгрузить();
	ТоварыДляДокумента.Очистить();
	
	Возврат ПоместитьВоВременноеХранилище(ТоварыНаПроверку);
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	  Закрыть();
КонецПроцедуры
