#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокВидовВремениБуквенныйКод() Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВидыИспользованияРабочегоВремени.Ссылка КАК Ссылка,
	|	ВидыИспользованияРабочегоВремени.Наименование КАК Наименование,
	|	ВидыИспользованияРабочегоВремени.ПолноеНаименование КАК ПолноеНаименование,
	|	ВидыИспользованияРабочегоВремени.Сотрировка КАК Сотрировка,
	|	ВидыИспользованияРабочегоВремени.БуквенныйКод КАК БуквенныйКод,
	|	ВидыИспользованияРабочегоВремени.ЦифровойКод КАК ЦифровойКод
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
	|ГДЕ
	|	ВидыИспользованияРабочегоВремени.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрировка" ;
	
	Список= Новый СписокЗначений;
	
	Выборка= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Список.Добавить(Выборка.Ссылка, Выборка.БуквенныйКод);
	КонецЦикла;
	Возврат Список;
	
КонецФункции

Функция ПолучитьСписокВидовВремениСтруктурой(Текст) Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВидыИспользованияРабочегоВремени.Ссылка КАК Ссылка,
	|	ВидыИспользованияРабочегоВремени.Наименование КАК Наименование,
	|	ВидыИспользованияРабочегоВремени.ПолноеНаименование КАК ПолноеНаименование,
	|	ВидыИспользованияРабочегоВремени.Сотрировка КАК Сотрировка,
	|	ВидыИспользованияРабочегоВремени.БуквенныйКод КАК БуквенныйКод,
	|	ВидыИспользованияРабочегоВремени.ЦифровойКод КАК ЦифровойКод
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
	|ГДЕ
	|	ВидыИспользованияРабочегоВремени.ПометкаУдаления = ЛОЖЬ
	|	И ВидыИспользованияРабочегоВремени.БуквенныйКод ПОДОБНО &БуквенныйКод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрировка" ;
	
	Если Не ПустаяСтрока(Текст) Тогда
		Запрос.УстановитьПараметр("БуквенныйКод",Текст);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидыИспользованияРабочегоВремени.БуквенныйКод ПОДОБНО &БуквенныйКод", "");
	КонецЕсли;
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	
	СП= Новый СписокЗначений;	
	Пока Выборка.Следующий() Цикл 
		СтркДанныеВыбора= Новый Структура("ВидВремени, БуквенноеОбозначение, Часы, ЕстьРазделитель", Выборка.Ссылка, Выборка.БуквенныйКод);
		СП.Добавить(СтркДанныеВыбора, "["+Выборка.БуквенныйКод+"] "+Выборка.Наименование);
	КонецЦикла;
	Возврат СП;
	
КонецФункции

Функция ПолучитьВидВремениЯвкаСтруктура() Экспорт
	ВидВремени= Справочники.ВидыИспользованияРабочегоВремени.Явка;
	Возврат Новый Структура("ВидВремени, БуквенноеОбозначение", ВидВремени, ВидВремени.БуквенныйКод);
КонецФункции

Функция ПолучитьВидВремениВыходной() Экспорт
	ВидВремени= Справочники.ВидыИспользованияРабочегоВремени.ВыходныеДни;
	Возврат Новый Структура("ВидВремени, БуквенноеОбозначение", ВидВремени, ВидВремени.БуквенныйКод);
КонецФункции

Функция ПолучитьВидВремениПоБуквенномуКоду(Текст) Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВидыИспользованияРабочегоВремени.Ссылка,
	|	ВидыИспользованияРабочегоВремени.Наименование,
	|	ВидыИспользованияРабочегоВремени.ПолноеНаименование,
	|	ВидыИспользованияРабочегоВремени.Сотрировка КАК Сотрировка,
	|	ВидыИспользованияРабочегоВремени.БуквенныйКод,
	|	ВидыИспользованияРабочегоВремени.ЦифровойКод
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
	|ГДЕ
	|	ВидыИспользованияРабочегоВремени.ПометкаУдаления = ЛОЖЬ
	|	И ВидыИспользованияРабочегоВремени.БуквенныйКод = &БуквенныйКод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрировка" ;
	
	Запрос.УстановитьПараметр("БуквенныйКод",Текст);
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Сообщить("Не верно введен Вид рабочего времени!");
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьМесяцПоДате(РедактируемыйОбъект, ПутьРеквизита, ПутьРеквизитаПредставления) Экспорт
	
	Значение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита);
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизитаПредставления, Формат(Значение, "ДФ='ММММ гггг'"));
	
КонецПроцедуры

Функция ПолучитьПредставлениеМесяца(ДатаНачалаМесяца) Экспорт
	
	Возврат Формат(ДатаНачалаМесяца, "ДФ='ММММ гггг'");
	
КонецФункции

Функция ПолучитьКоличествоСотрудниковВПодразделении(Отдел)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сотрудники.Ссылка) КАК Кол
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Отдел = &Отдел
	|	И Сотрудники.Уволен = ЛОЖЬ
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ" ;
	
	Запрос.УстановитьПараметр("Отдел",Отдел);
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Кол;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьВидДня(Дата)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата,
	|	ДанныеПроизводственногоКалендаря.ВидДня
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата = &Дата
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь" ;
	
	Запрос.УстановитьПараметр("Дата",НачалоДня(Дата));
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ"));
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидДня;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКоличествоДнейВМесяц(ДатаНачала, ДатаОкончания, ВидДня=Неопределено)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПроизводственногоКалендаря.Дата) КАК ДатаКол,
	|	ДанныеПроизводственногоКалендаря.ВидДня
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И ДанныеПроизводственногоКалендаря.ВидДня = &ВидДня
	|	И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПроизводственногоКалендаря.ВидДня" ;
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Если ВидДня = Неопределено Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст, "И ДанныеПроизводственногоКалендаря.ВидДня = &ВидДня", "");
	Иначе 
		Запрос.УстановитьПараметр("ВидДня", ВидДня);
	КонецЕсли;
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаКол;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьРаботающихСотрудников(Отдел=Неопределено, ДатаНачалаПериода)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Пользователь КАК Пользователь,
	|	Сотрудники.Должность КАК Должность,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.ДатаПриема КАК ДатаПриема,
	|	Сотрудники.Отдел КАК Отдел,
	|	Сотрудники.Подразделение КАК Подразделение
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Отдел В ИЕРАРХИИ(&Отдел)
	|	И ВЫБОР
	|			КОГДА Сотрудники.Уволен = ИСТИНА
	|				ТОГДА Сотрудники.ДатаУвольнения >= &ДатаНачалаПериода
	|			ИНАЧЕ Сотрудники.Уволен = ЛОЖЬ
	|		КОНЕЦ" ;
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода",ДатаНачалаПериода);

	Если Отдел = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Сотрудники.Отдел В ИЕРАРХИИ(&Отдел)", "");
	Иначе
		Запрос.УстановитьПараметр("Отдел",Отдел);
	КонецЕсли;
	Результат= Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСотрудников = Новый Массив;
	Пока Выборка.Следующий()Цикл
		СтрукСотрудника = Новый Структура("Сотрудник, Должность, Отдел, Подразделение");
		ЗаполнитьЗначенияСвойств(СтрукСотрудника, Выборка);
		МассивСотрудников.Добавить(СтрукСотрудника);
	КонецЦикла;
	
	Возврат МассивСотрудников;	
КонецФункции

Функция ПолучитьЧасыработыОрганизации(Календарь,КонецГрафика)  Экспорт
	
	ДатаНачала = НачалоМесяца(КонецГрафика);
	ДатаОкончания = КонецМесяца(КонецГрафика);

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Создаем временную таблицу расписаний.
	ГрафикиРаботы.СоздатьВТРасписанияРаботыНаПериод(МенеджерВременныхТаблиц, Календарь, ДатаНачала, ДатаОкончания);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДЕНЬ(РасписанияРаботы.ДатаГрафика) КАК НомерДня,
	|	СУММА(РАЗНОСТЬДАТ(РасписанияРаботы.ВремяНачала, РасписанияРаботы.ВремяОкончания, ЧАС)) КАК Часов
	|ИЗ
	|	ВТРасписанияРаботы КАК РасписанияРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	ДЕНЬ(РасписанияРаботы.ДатаГрафика)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДня" ;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Результат = Запрос.Выполнить().Выгрузить();
	
	мРасписание = Новый Массив(Число(День(ДатаОкончания)));
	Для ДН = Число(День(ДатаНачала)) По Число(День(ДатаОкончания)) Цикл
		НовыйДень = Результат.Найти(ДН, "НомерДня");
		Если НовыйДень <> Неопределено Тогда
			мРасписание[ДН-1] = НовыйДень.Часов;
		Иначе
			мРасписание[ДН-1] = 0;
		КонецЕсли;
	КонецЦикла;
	Возврат мРасписание; 
	
КонецФункции

Функция ПолучитьНормыРабочегоВремени(ДатаСреза, Отдел, ГрафикРаботы)  Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	НормыРабочегоВремениСрезПоследних.ДеньНедели КАК ДеньНедели,
	|	НормыРабочегоВремениСрезПоследних.НормаЧасовРаботыНаЧеловекаВДень КАК НормаЧасов,
	|	НормыРабочегоВремениСрезПоследних.ДеньНеделиСтрокой
	|ИЗ
	|	РегистрСведений.НормыРабочегоВремени.СрезПоследних(
	|			&ДатаСреза,
	|			Отдел = &Отдел
	|				И ГрафикРаботы = &ГрафикРаботы) КАК НормыРабочегоВремениСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДеньНедели" ;
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Отдел", Отдел);
	Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботы);
	
	мНормы= Новый Массив;
	
	Результат= Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		мНормы.Добавить(Выборка.НормаЧасов);
	КонецЦикла;
	Возврат мНормы;
	
КонецФункции

Функция ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Штрихкод) Экспорт
	
	Ошибка= Ложь;
	Сотрудник= Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
	Событие= Перечисления.СостоянияСотрудников.Вышел;
	Результат= СотрудникВОфисе(Сотрудник);
	ПредыдущееСостояние= Результат.Состояние;
	ПериодПредудущегоСобытия= Результат.Период;
	
	Если (ПериодПредудущегоСобытия+5*60) >= ТекущаяДата() Тогда
		Ошибка= Истина;
		Сообщить("Между последним сконированием прошло меньше 5 минут!");
		Событие= ПредыдущееСостояние;
		Возврат  Новый Структура("Событие, Ошибка", Событие, Ошибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		НаборЗаписей= РегистрыСведений.УчетРабочегоВремениСотрудников.СоздатьНаборЗаписей();
		НоваяЗапись= НаборЗаписей.Добавить();
		НоваяЗапись.Период= ТекущаяДата();
		НоваяЗапись.Сотрудник= Сотрудник;
		НоваяЗапись.Пользователь= Сотрудник.Пользователь;
		НоваяЗапись.Подразделение= ?(ЗначениеЗаполнено(Сотрудник.Подразделение), Сотрудник.Подразделение, Сотрудник.Пользователь.ТекущееПодразделение);
		
		//Если последнее событие было вчера или позднее тогда всегда зашел
		Если НачалоДня(ПериодПредудущегоСобытия) < НачалоДня(ТекущаяДата()) Тогда
			НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
		Иначе
			// Общая проверка
			Если  ПредыдущееСостояние = Перечисления.СостоянияСотрудников.Вышел Тогда//Вышел или ещё не было
				НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
			Иначе
				НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Вышел;
			КонецЕсли;
		КонецЕсли;
		Событие= НоваяЗапись.Событие;
		
		НаборЗаписей.Записать(Ложь);
	Иначе 
		Ошибка= Истина;
		Сообщить("Сотрудник со штрихкодом "+Штрихкод+" не найден!")
	КонецЕсли;
	
	Возврат  Новый Структура("Событие, Ошибка", Событие, Ошибка);
	
КонецФункции

Функция СотрудникВОфисе(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетРабочегоВремениСотрудниковСрезПоследних.Событие,
	|	УчетРабочегоВремениСотрудниковСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.УчетРабочегоВремениСотрудников.СрезПоследних(
	|			,
	|			Сотрудник = &Сотрудник
	|				И Подразделение = &Подразделение
	|				И Пользователь = &Пользователь) КАК УчетРабочегоВремениСотрудниковСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Сотрудник.Подразделение);
	Запрос.УстановитьПараметр("Пользователь", Сотрудник.Пользователь);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если  ВыборкаДетальныеЗаписи.Событие = Перечисления.СостоянияСотрудников.Зашел Тогда
			Состояние= Перечисления.СостоянияСотрудников.Зашел;
			Период= ВыборкаДетальныеЗаписи.Период;
		Иначе
			Состояние= Перечисления.СостоянияСотрудников.Вышел;
			Период= ВыборкаДетальныеЗаписи.Период;
		КонецЕсли;
	Иначе
		Состояние= Перечисления.СостоянияСотрудников.Вышел;
		Период= Дата(0001,01,01);;
	КонецЕсли;
		Рез= Новый Структура("Состояние,Период", Состояние, Период);
	Возврат  Рез;
	
КонецФункции	

//Дополнительные процедуры и функции
Процедура ТабельЗаполнитьДанныеПоСотрудникам(Объект, СписокСотрудников, СтрокиПоСотрудникам, ДатаОкончанияРасчета, ПоГрафику) Экспорт
	
	КодыВидовВремени = КодыВидовВремени(Объект.ПериодРегистрации);
	
	Если ПоГрафику Тогда
		ВыборкаДанныхОВремени = ВыборкаДанныхПоГрафику(СписокСотрудников, ДатаОкончанияРасчета,Объект.ГрафикРаботы);	
	Иначе
		ВыборкаДанныхОВремени = ВыборкаДанныхОВремени(Объект, СписокСотрудников, ДатаОкончанияРасчета);
	КонецЕсли;
	
	ТекущийСотрудник = Неопределено;
	ДанныеОВремениПоСотруднику = Новый Массив;
	НомерСтрокиСотрудник = 1;
	ИТ = Объект.Отделы.НайтиСтроки(Новый Структура("Отдел", Справочники.Отделы.НайтиПоКоду("000000148"))).Количество() > 0; 
	
	ДанныеОВремениПоСотруднику = Новый ТаблицаЗначений;
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Сотрудник");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("ВидУчетаВремени");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Дата");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("ДатаНачалаРаботы");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Часы");
	
	Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Сотрудник") Цикл
		ДанныеОВремениПоСотруднику.Очистить();
		Пока ВыборкаДанныхОВремени.Следующий() Цикл
			СтрокаТаблицыДанныхОВремени = ДанныеОВремениПоСотруднику.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДанныхОВремени, ВыборкаДанныхОВремени)
		КонецЦикла;	
		
		Если СтрокиПоСотрудникам <> Неопределено Тогда					
			МассивСтрокПоСотруднику = СтрокиПоСотрудникам[ВыборкаДанныхОВремени.Сотрудник];
		КонецЕсли;	
		
		ТабельЗаполнитьСтрокиПоСотруднику(
		    Объект.ДанныеОВремени,
			ДанныеОВремениПоСотруднику, 
			МассивСтрокПоСотруднику, 
			КодыВидовВремени, ПоГрафику, Объект.ГрафикРаботы, Объект.Ссылка, ИТ);
	КонецЦикла;
		
КонецПроцедуры	

Функция КодыВидовВремени(Месяц = Неопределено) Экспорт  
	
	Выборка = СформироватьЗапросПоВидамВремени().Выбрать();
	
	КодыВидовВремени = Новый Соответствие;
	
	БуквенныйКодИмяРеквизита = "БуквенныйКод";
	
	Пока Выборка.Следующий() Цикл 
		КодыВидовВремени.Вставить(Выборка.ВидВремени, Выборка[БуквенныйКодИмяРеквизита]);
	КонецЦикла;	
	
	КодыВидовВремени.Вставить(Справочники.ВидыИспользованияРабочегоВремени.ПустаяСсылка(), "");
	
	Возврат КодыВидовВремени; 
	
КонецФункции

Функция СформироватьЗапросПоВидамВремени() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыИспользованияРабочегоВремени.Ссылка КАК ВидВремени,
	|	ВидыИспользованияРабочегоВремени.БуквенныйКод, 
	|	ВидыИспользованияРабочегоВремени.Целосменное,
	|	ВидыИспользованияРабочегоВремени.Наименование
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ВыборкаДанныхПоГрафику(СписокСотрудников = Неопределено, ДатаОкончанияРасчета, График);	
	УстановитьПривилегированныйРежим(истина);	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата",Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Часы",Новый ОписаниеТипов("Число"));
	
	мЧасыРаботыПоГрафику = ПолучитьЧасыработыОрганизации(График,ДатаОкончанияРасчета); 
	КолДнейВМес = День(ДатаОкончанияРасчета);

	Для НомерДня = 1 По КолДнейВМес Цикл
		ТекДата = Дата(Год(ДатаОкончанияРасчета),Месяц(ДатаОкончанияРасчета), НомерДня);
		ДеньНедели = ДеньНедели(ТекДата);
			
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Дата = ТекДата;
		НоваяСтрока.Часы = мЧасыРаботыПоГрафику[НомерДня-1];
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблица.Дата КАК Дата,
		|	ВнешняяТаблица.Часы КАК Часы
		|ПОМЕСТИТЬ ВнешняяТаблица
		|ИЗ
		|	&ВнешняяТаблица КАК ВнешняяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Пользователь КАК Пользователь,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	ВнешняяТаблица.Дата КАК Дата,
		|	ВнешняяТаблица.Часы КАК Часы
		|ПОМЕСТИТЬ ВР_СотрудникиВремя
		|ИЗ
		|	ВнешняяТаблица КАК ВнешняяТаблица,
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Ссылка)
		|	И ВнешняяТаблица.Дата >= Сотрудники.ДатаПриема
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_СотрудникиВремя.Сотрудник КАК Сотрудник,
		|	ВР_СотрудникиВремя.Пользователь КАК Пользователь,
		|	ВР_СотрудникиВремя.Подразделение КАК Подразделение,
		|	ВР_СотрудникиВремя.Дата КАК Дата,
		|	ВР_СотрудникиВремя.Часы КАК Часы,
		|	ВЫБОР
		|		КОГДА НЕ СостоянияСотрудников.Состояние ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком)
		|						ТОГДА ""ОЖ""
		|					КОГДА СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоБеременностиИРодам)
		|						ТОГДА ""Р""
		|				КОНЕЦ
		|	КОНЕЦ КАК ВидУчетаВремени
		|ИЗ
		|	ВР_СотрудникиВремя КАК ВР_СотрудникиВремя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|		ПО ВР_СотрудникиВремя.Сотрудник = СостоянияСотрудников.Сотрудник
		|			И (СостоянияСотрудников.Период = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ))
		|			И (ВР_СотрудникиВремя.Дата МЕЖДУ СостоянияСотрудников.ДатаНачала И СостоянияСотрудников.ДатаОкончания)";
	//	|			И (СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком))";
	
	Запрос.УстановитьПараметр("Ссылка", СписокСотрудников);  
	Запрос.УстановитьПараметр("Период", ДатаОкончанияРасчета);
    Запрос.УстановитьПараметр("ВнешняяТаблица", ТЗ);
	УстановитьПривилегированныйРежим(ложь);
	Возврат Запрос.Выполнить().Выбрать(); 
	
КонецФункции

Функция ВыборкаДанныхОВремени(ДанныеТабеля, СписокСотрудников = Неопределено, ДатаОкончанияРасчета) 
	
	ТекстЗапроса = "ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_Сотрудники
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Сотрудник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&нПериода, ДЕНЬ, aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d) КАК Период
		|ПОМЕСТИТЬ ВТ_ТаблицаДат
		|{ВЫБРАТЬ
		|	Период}
		|ИЗ
		|	(ВЫБРАТЬ
		|		0 КАК a
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		1
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		2
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		3
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		4
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		5
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		6
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		7
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		8
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		9) КАК aa
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			0 КАК b
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			1
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			2
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			3
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			4
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			5
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			6
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			7
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			8
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			9) КАК bb
		|		ПО (ИСТИНА)
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			0 КАК c
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			1
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			2
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			3
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			4
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			5
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			6
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			7
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			8
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			9) КАК cc
		|		ПО (ИСТИНА)
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			0 КАК d
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			1
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			2
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			3
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			4
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			5
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			6
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			7
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			8
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			9) КАК dd
		|		ПО (ИСТИНА)
		|ГДЕ
		|	aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d <= РАЗНОСТЬДАТ(&нПериода, &кПериода, ДЕНЬ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетРабочегоВремениСотрудников.Сотрудник КАК Сотрудник,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА УчетРабочегоВремениСотрудников.Событие = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудников.Зашел)
		|				ТОГДА УчетРабочегоВремениСотрудников.Период
		|		КОНЕЦ) КАК ДатаНачалаРаботы,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА УчетРабочегоВремениСотрудников.Событие = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудников.Вышел)
		|				ТОГДА УчетРабочегоВремениСотрудников.Период
		|		КОНЕЦ) КАК ДатаОкончанияРаботы,
		|	НАЧАЛОПЕРИОДА(УчетРабочегоВремениСотрудников.Период, ДЕНЬ) КАК Период,
		|	NULL КАК ВидУчетаВремени
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.УчетРабочегоВремениСотрудников КАК УчетРабочегоВремениСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК Сотр
		|		ПО УчетРабочегоВремениСотрудников.Сотрудник = Сотр.Сотрудник
		|ГДЕ
		|	УчетРабочегоВремениСотрудников.Период МЕЖДУ &нПериода И &кПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетРабочегоВремениСотрудников.Сотрудник,
		|	НАЧАЛОПЕРИОДА(УчетРабочегоВремениСотрудников.Период, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СостоянияСотрудников.Сотрудник,
		|	НАЧАЛОПЕРИОДА(ВТ_ТаблицаДат.Период, ДЕНЬ),
		|	КОНЕЦПЕРИОДА(ВТ_ТаблицаДат.Период, ДЕНЬ),
		|	НАЧАЛОПЕРИОДА(ВТ_ТаблицаДат.Период, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком)
		|			ТОГДА ""ОЖ""
		|		КОГДА СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоБеременностиИРодам)
		|			ТОГДА ""Р""
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
		|		ПО (ВТ_ТаблицаДат.Период МЕЖДУ СостоянияСотрудников.ДатаНачала И СостоянияСотрудников.ДатаОкончания)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК Сотр
		|		ПО СостоянияСотрудников.Сотрудник = Сотр.Сотрудник
		|ГДЕ
		|	СостоянияСотрудников.Период = &нПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДат.Период КАК Дата,
		|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_ТаблицаДат.Период = ВременнаяТаблица.Период
		|				ТОГДА ВременнаяТаблица.ДатаНачалаРаботы
		|		КОНЕЦ) КАК ДатаНачалаРаботы,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_ТаблицаДат.Период = ВременнаяТаблица.Период
		|				ТОГДА ВременнаяТаблица.ДатаОкончанияРаботы
		|		КОНЕЦ) КАК ДатаОкончанияРаботы,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НЕ ВременнаяТаблица.ВидУчетаВремени ЕСТЬ NULL
		|				ТОГДА 0
		|			КОГДА ВТ_ТаблицаДат.Период = ВременнаяТаблица.Период
		|				ТОГДА ВЫБОР
		|						КОГДА ВременнаяТаблица.ДатаНачалаРаботы ЕСТЬ NULL
		|								ИЛИ ВременнаяТаблица.ДатаОкончанияРаботы ЕСТЬ NULL
		|							ТОГДА 0
		|						ИНАЧЕ ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ВременнаяТаблица.ДатаНачалаРаботы, ВременнаяТаблица.ДатаОкончанияРаботы, МИНУТА) - 60) / 60 - 0.49 КАК ЧИСЛО(10, 0))
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Часы,
		|	ВременнаяТаблица.ВидУчетаВремени КАК ВидУчетаВремени
		|ИЗ
		|	ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
		|		ПО ВТ_ТаблицаДат.Период >= ВТ_Сотрудники.Сотрудник.ДатаПриема
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
		|		ПО ВТ_ТаблицаДат.Период = ВременнаяТаблица.Период
		|			И ВТ_Сотрудники.Сотрудник = ВременнаяТаблица.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицаДат.Период,
		|	ВТ_Сотрудники.Сотрудник,
		|	ВременнаяТаблица.ВидУчетаВремени";
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("кПериода", ДатаОкончанияРасчета);
	Запрос.УстановитьПараметр("нПериода", НачалоМесяца(ДанныеТабеля.ПериодРегистрации));
	Запрос.УстановитьПараметр("Сотрудник", СписокСотрудников);

	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ТабельЗаполнитьСтрокиПоСотруднику(ДанныеОВремени, ДанныеОВремениПоСотруднику, МассивСтрокПоСотруднику, КодыВидовВремени, ПоГрафику, Календарь = Ложь, ДокументСсылка = Неопределено, ИТ = Ложь) Экспорт 
	
	Календарь_Ссылка = Справочники.Календари.ПолучитьСсылку(Новый УникальныйИдентификатор("91df52ef-4f67-11e4-80c7-002590e168ab"));
	УстановленПлавающийГрафик = Календарь.Ссылка = Справочники.Календари.НайтиПоНаименованию("Плавающий график");
	Явка = Справочники.ВидыИспользованияРабочегоВремени.Явка;
	Выходной = Справочники.ВидыИспользованияРабочегоВремени.ВыходныеДни;
	Декрет=Справочники.ВидыИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком; 
	ПоБеременности=Справочники.ВидыИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам; 
	Табель = ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремени");   
	ЗапретИзмененияДо15Числа = Табель И ДокументСсылка.Статус = ПредопределенноеЗначение("Перечисление.ТабельУчетаРабочегоВремениСтатус.УтвержденКАвансу");
	
	ВидВремени = Справочники.ВидыИспользованияРабочегоВремени.ПустаяСсылка();
	
	Для Каждого СтрокаДанныхОВремени Из ДанныеОВремениПоСотруднику Цикл  
		
		НомерДня = День(СтрокаДанныхОВремени.Дата);
		
		Если ЗапретИзмененияДо15Числа И НомерДня <= 15 Тогда
			Продолжить;
		КонецЕсли;
			
		НомерВидаВремениНаДату = 1;
		СтрокаТабеля = МассивСтрокПоСотруднику[НомерВидаВремениНаДату - 1];
		
		Если Не РучнаяКорректировкаВремени(СтрокаДанныхОВремени, ДанныеОВремени, ПоГрафику, Табель, УстановленПлавающийГрафик, ИТ) Тогда
			если СтрокаДанныхОВремени.ВидУчетаВремени="ОЖ" тогда
				ВидВремени = Декрет; 
				СтрокаДанныхОВремени.Часы = 0;                   
			иначеесли СтрокаДанныхОВремени.ВидУчетаВремени="Р" тогда	
				ВидВремени = ПоБеременности; 
				СтрокаДанныхОВремени.Часы = 0;                   
			иначеЕсли ЗначениеЗаполнено(СтрокаДанныхОВремени.Часы) Тогда
				ВидВремени = Явка;           
			Иначеесли не ЗначениеЗаполнено(СтрокаДанныхОВремени.ВидУчетаВремени) и не ЗначениеЗаполнено(СтрокаДанныхОВремени.Часы) тогда
				ВидВремени = Выходной;
				СтрокаДанныхОВремени.Часы = 0;
			КонецЕсли;
			
			Если ПоГрафику и (Календарь.Ссылка = Календарь_Ссылка) Тогда
				ВидДня = УчетРабочегоВремениСервер.ПолучитьВидДня(СтрокаДанныхОВремени.Дата);
				Если ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий") Тогда
				ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный") Тогда
					Если (СтрокаДанныхОВремени.Часы >= 1) тогда
					 СтрокаДанныхОВремени.Часы = СтрокаДанныхОВремени.Часы - 1;
					Конецесли; 
				Иначеесли не ЗначениеЗаполнено(СтрокаДанныхОВремени.ВидУчетаВремени) тогда
					ВидВремени = Выходной;
					СтрокаДанныхОВремени.Часы = 0;
				Конецесли;
			Конецесли;
			
			ЗаполняетсяПлан = ?(Табель И ПоГрафику И УстановленПлавающийГрафик И НЕ ИТ, Истина, Ложь);
			
			Если НЕ ЗаполняетсяПлан Тогда
				СтрокаТабеля["ВидВремени" + НомерДня] = ВидВремени;
			КонецЕсли;
			
			ДополнениеИмениКолонки = ?(ЗаполняетсяПлан, "План", "");
			СтрокаТабеля["Часов" + ДополнениеИмениКолонки + НомерДня] = СтрокаДанныхОВремени.Часы;
			СтрокаТабеля["Представление" + ДополнениеИмениКолонки + НомерДня] = ТабельПредставлениеВремениПоВиду(КодыВидовВремени.Получить(ВидВремени), СтрокаДанныхОВремени.Часы);  
		КонецЕсли;
		
		НачалоСмены = СтрокаДанныхОВремени.ДатаНачалаРаботы;
		Если Табель И Не ПоГрафику И ЗначениеЗаполнено(НачалоСмены) Тогда
			СтрокаТабеля["НачалоСмены" + НомерДня] = Дата('00010101') + (НачалоСмены - НачалоДня(НачалоСмены)) ;
		КонецЕсли;
		
	КонецЦикла;	
		
	КоличествоСтрокПоСотруднику = МассивСтрокПоСотруднику.Количество();
	
	Сотрудник = МассивСтрокПоСотруднику[0].Сотрудник;
	
	Для Каждого СтрокаПоСотруднику Из МассивСтрокПоСотруднику Цикл
		СтрокаПоСотруднику.Сотрудник = Сотрудник;		
	КонецЦикла;	
	
КонецПроцедуры	

Функция РучнаяКорректировкаВремени(ДанныеПоСтроке, ДанныеОВремени, ПоГрафику = Неопределено, Табель = Неопределено, Плавающий = Ложь, ИТ = Ложь) Экспорт
	
	Представление = ?(Табель И ПоГрафику И Плавающий И НЕ ИТ, "ПредставлениеПлан", "Представление");
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник",ДанныеПоСтроке.Сотрудник);
	МассивСтрок = ДанныеОВремени.НайтиСтроки(Отбор);
	Для каждого Строка из МассивСтрок Цикл	
		Если ЗначениеЗаполнено(Строка[Представление + День(ДанныеПоСтроке.Дата)]) Тогда
			Возврат Истина;
			Прервать;
		Иначе
			Возврат Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
КонецФункции

Функция ТабельПредставлениеВремениПоВиду(ОбозначениеВремени, КоличествоЧасов) Экспорт 
	
	Если Не ПустаяСтрока(ОбозначениеВремени) Или КоличествоЧасов <> 0 Тогда
		Возврат ОбозначениеВремени + Формат(КоличествоЧасов, "ЧГ=");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

