
&НаСервере
Процедура ЗагрузитьДанныеВРегистрНаСервере()
	Для каждого Строка из Аналоги Цикл
		Если РегистрыСведений.АналогиНоменклатуры.ЕстьАналогСТемжеПриоритетом(Строка) Тогда
			Сообщить("По номенклатуре "+Строка.Номенклатура+" есть запись стаким же приоритетом!");
			Продолжить;
		КонецЕсли;
		
		Попытка
			НачатьТранзакцию();
			НоваяЗапись = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Строка);
			Если Строка.ОбратнаяАналогия Тогда
				ОбратнаяЗапись = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
				ОбратнаяЗапись.Номенклатура = Строка.АналогНоменклатуры;
				ОбратнаяЗапись.АналогНоменклатуры = Строка.Номенклатура;
				ОбратнаяЗапись.Характеристика = Строка.АналогХарактеристики;
				ОбратнаяЗапись.АналогХарактеристики = Строка.Характеристика;
				ОбратнаяЗапись.Кратность = ?(Строка.Кратность <> 0,Окр(1/Строка.Кратность,1,РежимОкругления.Окр15как20),0);
				ОбратнаяЗапись.ОбратнаяАналогия = Истина;
				ОбратнаяЗапись.Приоритет= Строка.Приоритет;
				ОбратнаяЗапись.Записать();
			КонецЕсли;
			НоваяЗапись.Записать();
			ЗафиксироватьТранзакцию();	
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВРегистр(Команда)
	ЗагрузитьДанныеВРегистрНаСервере();
	//Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоНоменклатуреПриИзменении(Элемент)
	ЭтаФорма.Элементы.Номенклатура.Доступность = ПоНоменклатуре;
	ЭтаФорма.Элементы.Характеристика.Доступность = ПоНоменклатуре;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Оповещение = Новый ОписаниеОповещения("ПередОчищениемЗавершение", ЭтотОбъект); 
	ПоказатьВопрос(Оповещение, "Вы действительно хотите очистить табличную часть?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте 
Процедура ПередОчищениемЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Аналоги.Очистить();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект);   	
	ОткрытьФорму("РегистрСведений.АналогиНоменклатуры.Форма.ФормаДоп", ,ЭтаФорма,,,,Оповещение,);
КонецПроцедуры


&НаКлиенте 
Процедура ЗагрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено тогда
		ЗагрузитьРезультат(Результат);
	конецесли;
КонецПроцедуры  

&НаСервере
Процедура ЗагрузитьРезультат(Результат)
	Аналоги.Загрузить(Результат.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура АналогиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Строка = Элементы.Аналоги.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(Строка.Номенклатура) ИЛИ Не ЗначениеЗаполнено(Строка.АналогНоменклатуры) Тогда
		ОтменаРедактирования = Истина;
		Сообщить("Поля: 'Номенклатура' и 'АналогНоменклатуры' обязательны для заполнения!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АналогиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если ПоНоменклатуре И ЗначениеЗаполнено(Номенклатура) Тогда
			Элементы.Аналоги.ТекущиеДанные.Номенклатура = Номенклатура;
			Если ЗначениеЗаполнено(Характеристика) Тогда
				Элементы.Аналоги.ТекущиеДанные.Характеристика = Характеристика;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

