
Функция Enter(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	Если Запрос.ПараметрыЗапроса.Количество() > 0 Тогда
		
		Ид = Запрос.ПараметрыЗапроса.Получить("ID");
		Код = Запрос.ПараметрыЗапроса.Получить("Code");
		
		Если Не ПустаяСтрока(ИД) И Не ПустаяСтрока(Код) Тогда
			Результат = УправлениеДоступомСервер.ОбработатьЗапросSKUD(Ид, Код);
			Если Результат = Истина Тогда
				Ответ.УстановитьТелоИзСтроки("1", КодировкаТекста.UTF8);
			Иначе 
				Ответ.УстановитьТелоИзСтроки("0", КодировкаТекста.UTF8);
			КонецЕсли;
		Иначе 
			Ответ.УстановитьТелоИзСтроки("0", КодировкаТекста.UTF8);
		КонецЕсли;
	Иначе
		Ответ.УстановитьТелоИзСтроки("0", КодировкаТекста.UTF8);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;
	
КонецФункции
