// Работа с напоминаниями
Процедура ПодключитьПроизвольноеНапоминаниеПользователям(Предмет = Неопределено) Экспорт
	ПараметрыНапоминания = Новый Структура;
	ПараметрыНапоминания.Вставить("Описание", "Новая поставка на склад!");
	ПараметрыНапоминания.Вставить("ВремяСобытия", ТекущаяДата());
	ПараметрыНапоминания.Вставить("Источник", Предмет);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СекцииКладовщиков.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СекцииКладовщиков КАК СекцииКладовщиков
		|ГДЕ
		|	СекцииКладовщиков.Склад = &Склад
		|	И СекцииКладовщиков.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Склад", Предмет.Склад);
	Запрос.УстановитьПараметр("Ячейка", Предмет.РабочийУчасток);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПараметрыНапоминания.Вставить("Пользователь", ВыборкаДетальныеЗаписи.Пользователь);
        Напоминание = СоздатьНапоминание(ПараметрыНапоминания);
	    НапоминанияПользователяСлужебный.ПодключитьНапоминание(Напоминание);
		ПараметрыНапоминания.Удалить("Пользователь");
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьНапоминание(ПараметрыНапоминания)
	
	Напоминание = НапоминанияПользователяКлиентСервер.ОписаниеНапоминания(ПараметрыНапоминания, Истина);
	Напоминание.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
		
	Напоминание.СрокНапоминания = Напоминание.ВремяСобытия;
		
	Если Не ЗначениеЗаполнено(Напоминание.СрокНапоминания) Тогда
		Напоминание.СрокНапоминания = Напоминание.ВремяСобытия;
	КонецЕсли;
	
	Возврат Напоминание;
	
КонецФункции

//СистемаВзаимодействия
Процедура СоздатьСообщение(Параметры) Экспорт
	установитьпривилегированныйрежим(Истина);
	
	Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		ОтветственныйПользовательИБ = Параметры.Ответственный;
		ИдентификаторПользователяСВ = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ОтветственныйПользовательИБ.ИдентификаторПользователяИБ);
		
		Отбор = Новый ОтборОбсужденийСистемыВзаимодействия();
		Отбор.КонтекстноеОбсуждение = Истина;
		Отбор.КонтекстОбсуждения = Новый КонтекстОбсужденияСистемыВзаимодействия(Параметры.НавигационнаяСсылка);
		Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждения(Отбор);

		Если Обсуждение.Количество()=1 Тогда
			Для каждого СтрокаОбсуждение из Обсуждение Цикл
				НовоеСообщение = СистемаВзаимодействия.СоздатьСообщение(СтрокаОбсуждение.Идентификатор);
				НовоеСообщение.Данные = Параметры.Ссылка;
				НовоеСообщение.Получатели.Добавить(ИдентификаторПользователяСВ);
				НовоеСообщение.Дата = ТекущаяДата();
				НовоеСообщение.Текст = "Клиент на месте!  Укажите время до конца сборки!";
				НовоеСообщение.Записать();
			КонецЦИкла;
		КонецЕсли;
	КонецЕсли; 
	
	установитьпривилегированныйрежим(Ложь);	
КонецПроцедуры

//Количество текущих заданий 
Функция ОбновитьДанныеНаСервере(Секция,Склад) Экспорт
	
	СтруктураДанныхВозврата = Новый Структура;
	СтруктураДанныхВозврата.Вставить("КоличествоДокПриемка",);
	СтруктураДанныхВозврата.Вставить("КоличествоДокОтгрузка",);
	СтруктураДанныхВозврата.Вставить("КоличествоДокПересчет",);
		
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыКПоступлениюОстатки.ДокументПоступления) КАК КоличествоДокПриемка,
	               |	0 КАК КоличествоДокОтгрузка,
	               |	0 КАК КоличествоДокПересчет
	               |ПОМЕСТИТЬ ВТ_Временная
	               |ИЗ
	               |	РегистрНакопления.ТоварыКПоступлению.Остатки(&КонецДня, Склад = &Склад) КАК ТоварыКПоступлениюОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	               |		ПО ТоварыКПоступлениюОстатки.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	               |			И ТоварыКПоступлениюОстатки.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	               |			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	               |ГДЕ
	               |	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0
	               |	И ВЫБОР
	               |			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	               |				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&Секция)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	               |			КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЗаказНаПеремещение
	               |				ТОГДА ПеремещениеТоваров.Ссылка
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	               |						ТОГДА РеализацияТоваровУслуг.Ссылка
	               |					ИНАЧЕ ТоварыКОтгрузке.ДокументОтгрузки
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	0
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(&КонецДня, Склад = &Склад) КАК ТоварыКОтгрузке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО ТоварыКОтгрузке.ДокументОтгрузки = ПеремещениеТоваров.ЗаказНаПеремещение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ТоварыКОтгрузке.ДокументОтгрузки = РеализацияТоваровУслуг.ЗаказКлиента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	               |		ПО ТоварыКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	               |			И ТоварыКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	               |			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	               |				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&Секция)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ТоварыКОтгрузке.КОтгрузкеОстаток > 0
	               |	И ТоварыКОтгрузке.ДокументОтгрузки.Дата >= &ДатаНачалаОрдерной
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПересчетТоваров.Ссылка)
	               |ИЗ
	               |	Документ.ПересчетТоваров КАК ПересчетТоваров
	               |ГДЕ
	               |	ПересчетТоваров.Склад = &Склад
	               |	И ПересчетТоваров.Проведен = ИСТИНА
	               |	И ПересчетТоваров.Дата МЕЖДУ &НачалоДня И &КонецДня
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ_Временная.КоличествоДокПриемка) КАК КоличествоДокПриемка,
	               |	СУММА(ВТ_Временная.КоличествоДокПересчет) КАК КоличествоДокПересчет,
	               |	СУММА(ВТ_Временная.КоличествоДокОтгрузка) КАК КоличествоДокОтгрузка
	               |ИЗ
	               |	ВТ_Временная КАК ВТ_Временная";
	
	Запрос.УстановитьПараметр("Секция", Секция);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ДатаНачалаОрдерной", Склад.ДатаНачалаОрдернойСхемыПриОтгрузке);
	
	Запрос.УстановитьПараметр("НачалоДня", Началодня(ТекущаяДата()));	
    Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДата()));	

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ЗаполнитьЗначенияСвойств(СтруктураДанныхВозврата,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	 
	Возврат СтруктураДанныхВозврата;
КонецФункции

//Сохранение фотографий в папку
Функция СохранениеФотоВПапку(Сотрудник,ИмяФайла,Файл) Экспорт
	
	Если ЗначениеЗаполнено(Сотрудник.ПутьДляФотоСТСД) Тогда
		ИмяФайла = Сотрудник.ПутьДляФотоСТСД + "\" + ИмяФайла+ ".png";
	Иначе
		ИмяФайла = "\\TG-Storage01\Alterra - общая\Харина М.А\" + ИмяФайла+ ".png";
	КонецЕсли;

	Если Файл <> Неопределено Тогда
            Попытка 
                Файл.Записать(ИмяФайла);
                Сообщить("Файл успешно записан!");
				Возврат ИмяФайла;
            Исключение
                Сообщить(ИмяФайла + "  - Ошибка записи: "+ОписаниеОшибки());
				Возврат "Ошибка записи файла";
            КонецПопытки;
	КонецЕсли;
	
КонецФункции

//Поставка
Функция СкладПересорта(Подразделение, Брак=Ложь)	
	
	Если Брак Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Подразделение = &Подразделение
		|   И НЕ Склады.ЭтоГруппа
		|	И Склады.Наименование ПОДОБНО ""%БРАК%""";
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Подразделение = &Подразделение
		|   И НЕ Склады.ЭтоГруппа
		|	И Склады.Наименование ПОДОБНО ""%Недостачи%""";
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("Подразделение", Подразделение); 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.ссылка;
	иначе 
		возврат неопределено;
	конецесли;;
	
КонецФункции 

Функция СоздатьПеремещение(Основание, ТоварыТаблица, СоздатьБрак, СоздатьНедостачи) Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	Недостачи = Ложь;
	Брак = Ложь;
	СтрокаЗадачи = ""; 
	
	ТипОснования = ТипЗнч(Основание);
		
	Если ТипОснования = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		СкладОтправительНедостачи = Основание.СкладПолучатель;
		СкладПолучательНедостачи =  Основание.СкладОтправитель;
		КомментарийНедостачи = "АКТ по перемещению № " + Строка(Основание.Номер);
		СкладОтправительБрак = Основание.СкладПолучатель;
		СкладПолучательБрак =  СкладПересорта(СкладОтправительБрак.Подразделение, Истина);
		КомментарийБрак = "АКТ по перемещению № " + Строка(Основание.Номер); 
		Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		СкладОтправительНедостачи = Основание.Склад;
		СкладПолучательНедостачи =  СкладПересорта(СкладОтправительНедостачи.Подразделение, Ложь);
		КомментарийНедостачи = "АКТ по поступлению № " + Строка(Основание.Номер);
		СкладОтправительБрак = Основание.Склад;
		СкладПолучательБрак =  СкладПересорта(СкладОтправительБрак.Подразделение, Истина);
		КомментарийБрак = "АКТ по поступлению № " + Строка(Основание.Номер);
		Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	КонецЕсли;
	
	Если СоздатьНедостачи Тогда 
		
		Док1 = Документы.ПеремещениеТоваров.СоздатьДокумент();
		СсылкаНового = Документы.ПеремещениеТоваров.ПолучитьСсылку();
		Док1.УстановитьСсылкуНового(СсылкаНового);
		СсылкаНовогоДок1 = Док1.ПолучитьСсылкуНового();
		Док1.ОрганизацияПолучатель = СкладПолучательНедостачи.Подразделение.Организация; 
		Док1.Организация = СкладОтправительНедостачи.Подразделение.Организация;
		Док1.Дата= ТекущаяДата();
		Док1.СкладОтправитель = СкладОтправительНедостачи;
		Док1.СкладПолучатель =  СкладПолучательНедостачи;
		Док1.Статус= Статус;
		Док1.Ответственный= Пользователи.ТекущийПользователь();
		Док1.Комментарий = КомментарийНедостачи;
		Док1.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз;
		Док1.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Док1.ФиктивноеПеремещение=Истина;
		
		Для Каждого Товар Из ТоварыТаблица Цикл
			Если Товар.Описание = "Недостачи" Тогда
				Если ТипЗнч(Товар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
					НоваяСтрока= Док1.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
					НоваяСтрока.Количество= Товар.КоличествоУпаковок;
				Иначе
					Док1.Комментарий = Док1.Комментарий + Символы.ПС + "Обнаружен неизвестный товар: " + Товар.Номенклатура;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Док1.Записать(РежимЗаписиДокумента.Проведение);
		СтрокаЗадачи = Док1.Комментарий + Символы.ПС;
		
		СтруктураВозврата.Вставить("Недостачи",СсылкаНовогоДок1);
		
	Иначе
		
		СтруктураВозврата.Вставить("Недостачи",Неопределено);
		
	КонецЕсли;
	
	Если СоздатьБрак Тогда
		
		Док2 = Документы.ПеремещениеТоваров.СоздатьДокумент();
		СсылкаНового = Документы.ПеремещениеТоваров.ПолучитьСсылку();
		Док2.УстановитьСсылкуНового(СсылкаНового);
		СсылкаНовогоДок2 = Док2.ПолучитьСсылкуНового();
		Док2.ОрганизацияПолучатель = СкладПолучательБрак.Подразделение.Организация; 
		Док2.Организация = СкладОтправительБрак.Подразделение.Организация;
		Док2.Дата= ТекущаяДата();
		Док2.СкладОтправитель = СкладОтправительБрак;
		Док2.СкладПолучатель =  СкладПолучательБрак;
		Док2.Статус= Статус;
		Док2.Ответственный= Пользователи.ТекущийПользователь();
		Док2.Комментарий = КомментарийБрак;
		Док2.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз;
		Док2.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;

		Для Каждого Товар Из ТоварыТаблица Цикл
			Если Товар.Описание = "Брак" Тогда
				Если ТипЗнч(Товар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
					НоваяСтрока= Док2.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
					НоваяСтрока.Количество= Товар.КоличествоУпаковок;
				Иначе
					Док2.Комментарий = Док2.Комментарий + Символы.ПС + "Обнаружен неизвестный товар: " + Товар.Номенклатура;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		Док2.Записать(РежимЗаписиДокумента.Проведение);
		СтрокаЗадачи = СтрокаЗадачи + Док2.Комментарий + Символы.ПС;
		
		СтруктураВозврата.Вставить("Брак",СсылкаНовогоДок2);
		
	Иначе
		
		СтруктураВозврата.Вставить("Брак",Неопределено);
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;	
КонецФункции

Функция ВнестиИзмененияВЗаказ(ДокументЗаказПоставщику, ТоварыТаблица) Экспорт
	
	ПриобретениеОбъект = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ПриобретениеОбъект,ДокументЗаказПоставщику,,"Номер");
	
	СсылкаНового = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку();
	ПриобретениеОбъект.УстановитьСсылкуНового(СсылкаНового);
	СсылкаНовогоДок1 = ПриобретениеОбъект.ПолучитьСсылкуНового();
	ПриобретениеОбъект.ДокументОснования = ДокументЗаказПоставщику; 
	ПриобретениеОбъект.Дата= ТекущаяДата()-1;
	ПриобретениеОбъект.ЗаказПоставщику = ДокументЗаказПоставщику;
	ПриобретениеОбъект.ПоступлениеПоЗаказам=Истина;
	ПриобретениеОбъект.Валюта = Справочники.Валюты.НайтиПоКоду("643");
	ПриобретениеОбъект.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");
	
	Для каждого Строка из ТоварыТаблица Цикл
		КоличествоФакт = Строка.КоличествоФакт;
		Если КоличествоФакт > Строка.КоличествоУпаковок  Тогда
			Если ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				НоваяСтрока = ПриобретениеОбъект.Товары.Добавить();
				ПараметрыОтбора = Новый Структура("КодСтроки",Строка.КодСтроки);
				НайденныеСтроки = ДокументЗаказПоставщику.Товары.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество()>0 Тогда
					Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
						НоваяСтрока2 = ПриобретениеОбъект.Товары.Добавить();
                        ЗаполнитьЗначенияСвойств(НоваяСтрока2,НайденнаяСтрока);
						ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрока);
					КонецЦикла;
				Иначе
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
					НоваяСтрока.Склад = ПриобретениеОбъект.Склад;
				КонецЕсли;
				НоваяСтрока.КодСтроки = 0;
				НоваяСтрока.Количество = КоличествоФакт-Строка.КоличествоУпаковок;
				НоваяСтрока.КоличествоУпаковок = КоличествоФакт-Строка.КоличествоУпаковок;
				Иначе
				ПриобретениеОбъект.Комментарий = ПриобретениеОбъект.Комментарий + Символы.ПС + "Обнаружен неизвестный товар: " + Строка.Номенклатура;
			КонецЕсли;
		Иначе   
			   НоваяСтрока = ПриобретениеОбъект.Товары.Добавить();
				ПараметрыОтбора = Новый Структура("КодСтроки",Строка.КодСтроки);
				НайденныеСтроки = ДокументЗаказПоставщику.Товары.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество()>0 Тогда
					Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
						ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрока);
					КонецЦикла;
				КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПриобретениеОбъект.Записать(РежимЗаписиДокумента.Проведение);

    ПоступлениеДокумент = СсылкаНовогоДок1;

    Возврат ПоступлениеДокумент;

КонецФункции

Процедура ПоставитьСтатусПринято(ДокументПеремещение)Экспорт
	Если ДокументПеремещение.Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено Тогда
		ПеремещениеОбъект = ДокументПеремещение.ПолучитьОбъект();
		ПеремещениеОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
		ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КОнецЕсли;
КонецПроцедуры

Функция ТекущийПользователь()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

Функция ОтборСтрокВТаблице(ТоварыТаблица,ЗначениеКолонки) Экспорт
	
	ПараметрыОтбор = Новый Структура;
	ПараметрыОтбор.Вставить("Описание",ЗначениеКолонки);
	НайденныеСтроки = ТоварыТаблица.НайтиСтроки(ПараметрыОтбор);
	
	Если НайденныеСтроки.Количество()>0 Тогда
		ОтветВозврата = Истина;
	Иначе
		ОтветВозврата = Ложь;
	КонецЕсли;	
	
	Возврат ОтветВозврата;
	
КонецФункции

Функция СоздатьПриобретениеТоваровУслуг(ДокументЗаказПоставщику, ТоварыТаблица) Экспорт
	
	ПриобретениеОбъект = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ПриобретениеОбъект,ДокументЗаказПоставщику,,"Номер");
	
	СсылкаНового = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку();
	ПриобретениеОбъект.УстановитьСсылкуНового(СсылкаНового);
	СсылкаНовогоДок1 = ПриобретениеОбъект.ПолучитьСсылкуНового();
	ПриобретениеОбъект.ДокументОснования = ДокументЗаказПоставщику; 
	ПриобретениеОбъект.Дата= ТекущаяДата()-1;
	ПриобретениеОбъект.ЗаказПоставщику = ДокументЗаказПоставщику;
	ПриобретениеОбъект.ПоступлениеПоЗаказам=Истина;
	ПриобретениеОбъект.Валюта = Справочники.Валюты.НайтиПоКоду("643");
	ПриобретениеОбъект.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");
	
	Для каждого Строка из ТоварыТаблица Цикл
		Если ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				ПараметрыОтбора = Новый Структура("КодСтроки",Строка.КодСтроки);
				НайденныеСтроки = ДокументЗаказПоставщику.Товары.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество()<>0 Тогда
					Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
						Если НайденнаяСтрока.Количество <= Строка.Количество Тогда
						НоваяСтрока1 = ПриобретениеОбъект.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
						Если НайденнаяСтрока.Количество < Строка.Количество Тогда
						НоваяСтрока2 = ПриобретениеОбъект.Товары.Добавить();
   						ЗаполнитьЗначенияСвойств(НоваяСтрока2,НайденнаяСтрока);
						НоваяСтрока2.КодСтроки = 0;
				        НоваяСтрока2.Количество = Строка.Количество - НайденнаяСтрока.Количество;
				        НоваяСтрока2.КоличествоУпаковок = Строка.Количество - НайденнаяСтрока.Количество;
					КонецЕсли;
				Иначе
					 Если Строка.Количество <> 0 Тогда
					 НоваяСтрока1 = ПриобретениеОбъект.Товары.Добавить();
					 ЗаполнитьЗначенияСвойств(НоваяСтрока1,НайденнаяСтрока);
					 НоваяСтрока1.Количество = Строка.Количество;
				     НоваяСтрока1.КоличествоУпаковок = Строка.Количество;
					 КонецЕсли;
				КонецЕсли;
					КонецЦикла;
				Иначе
					Если Строка.Количество <> 0 Тогда
					НоваяСтрока = ПриобретениеОбъект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
					НоваяСтрока.КодСтроки = 0;
				    НоваяСтрока.Количество = Строка.Количество;
				    НоваяСтрока.КоличествоУпаковок = Строка.Количество;
					НоваяСтрока.Склад = ПриобретениеОбъект.Склад;
					КонецЕсли;
				КонецЕсли;
				Иначе
				ПриобретениеОбъект.Комментарий = ПриобретениеОбъект.Комментарий + Символы.ПС + "Обнаружен неизвестный товар: " + Строка.Номенклатура;
		КонецЕсли;
	КонецЦикла;
	
	ПриобретениеОбъект.Записать(РежимЗаписиДокумента.Проведение);

    ПоступлениеДокумент = СсылкаНовогоДок1;

    Возврат ПоступлениеДокумент;

КонецФункции

Функция СоздатьПеремещениеНедостачиБрак(Основание, ТоварыТаблица, СоздатьБрак, СоздатьНедостачи) Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	Недостачи = Ложь;
	Брак = Ложь;
	СтрокаЗадачи = ""; 
	
	ТипОснования = ТипЗнч(Основание);
		
	Если ТипОснования = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		СкладОтправительНедостачи = Основание.СкладПолучатель;
		СкладПолучательНедостачи =  Основание.СкладОтправитель;
		КомментарийНедостачи = "АКТ по перемещению № " + Строка(Основание.Номер);
		СкладОтправительБрак = Основание.СкладПолучатель;
		СкладПолучательБрак =  СкладПересорта(СкладОтправительБрак.Подразделение, Истина);
		КомментарийБрак = "АКТ по перемещению № " + Строка(Основание.Номер); 
		Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		СкладОтправительНедостачи = Основание.Склад;
		СкладПолучательНедостачи =  СкладПересорта(СкладОтправительНедостачи.Подразделение, Ложь);
		КомментарийНедостачи = "АКТ по поступлению № " + Строка(Основание.Номер);
		СкладОтправительБрак = Основание.Склад;
		СкладПолучательБрак =  СкладПересорта(СкладОтправительБрак.Подразделение, Истина);
		КомментарийБрак = "АКТ по поступлению № " + Строка(Основание.Номер);
		Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	КонецЕсли;
	
	Если СоздатьНедостачи Тогда 
		
		Док1 = Документы.ПеремещениеТоваров.СоздатьДокумент();
		СсылкаНового = Документы.ПеремещениеТоваров.ПолучитьСсылку();
		Док1.УстановитьСсылкуНового(СсылкаНового);
		СсылкаНовогоДок1 = Док1.ПолучитьСсылкуНового();
		Док1.ОрганизацияПолучатель = СкладПолучательНедостачи.Подразделение.Организация; 
		Док1.Организация = СкладОтправительНедостачи.Подразделение.Организация;
		Док1.Дата= ТекущаяДата();
		Док1.СкладОтправитель = СкладОтправительНедостачи;
		Док1.СкладПолучатель =  СкладПолучательНедостачи;
		Док1.Статус= Статус;
		Док1.Ответственный= Пользователи.ТекущийПользователь();
		Док1.Комментарий = КомментарийНедостачи;
		Док1.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз;
		Док1.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Док1.ФиктивноеПеремещение=Истина;
		
		Для Каждого Товар Из ТоварыТаблица Цикл
				Если ТипЗнч(Товар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
					НоваяСтрока= Док1.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар,,"КодСтроки");
					НоваяСтрока.КоличествоУпаковок = Товар.Количество;
				Иначе
					Док1.Комментарий = Док1.Комментарий + Символы.ПС + "Обнаружен неизвестный товар: " + Товар.Номенклатура;
				КонецЕсли;
		КонецЦикла;
		
		Док1.Записать(РежимЗаписиДокумента.Проведение);
		СтрокаЗадачи = Док1.Комментарий + Символы.ПС;
		
		СтруктураВозврата.Вставить("Недостачи",СсылкаНовогоДок1);
		
	Иначе
		
		СтруктураВозврата.Вставить("Недостачи",Неопределено);
		
	КонецЕсли;
	
	Если СоздатьБрак Тогда
		
		Док2 = Документы.ПеремещениеТоваров.СоздатьДокумент();
		СсылкаНового = Документы.ПеремещениеТоваров.ПолучитьСсылку();
		Док2.УстановитьСсылкуНового(СсылкаНового);
		СсылкаНовогоДок2 = Док2.ПолучитьСсылкуНового();
		Док2.ОрганизацияПолучатель = СкладПолучательБрак.Подразделение.Организация; 
		Док2.Организация = СкладОтправительБрак.Подразделение.Организация;
		Док2.Дата= ТекущаяДата();
		Док2.СкладОтправитель = СкладОтправительБрак;
		Док2.СкладПолучатель =  СкладПолучательБрак;
		Док2.Статус= Статус;
		Док2.Ответственный= Пользователи.ТекущийПользователь();
		Док2.Комментарий = КомментарийБрак;
		Док2.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз;
		Док2.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Док2.ФиктивноеПеремещение=Истина;

		Для Каждого Товар Из ТоварыТаблица Цикл
				Если ТипЗнч(Товар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
					НоваяСтрока= Док2.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар,,"КодСтроки");
					НоваяСтрока.КоличествоУпаковок= Товар.Количество;
				Иначе
					Док2.Комментарий = Док2.Комментарий + Символы.ПС + "Обнаружен неизвестный товар: " + Товар.Номенклатура;
				КонецЕсли;	
		КонецЦикла;
		
		Док2.Записать(РежимЗаписиДокумента.Проведение);
		СтрокаЗадачи = СтрокаЗадачи + Док2.Комментарий + Символы.ПС;
		
		СтруктураВозврата.Вставить("Брак",СсылкаНовогоДок2);
		
	Иначе
		
		СтруктураВозврата.Вставить("Брак",Неопределено);
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаЗадачи) Тогда
		НоваяЗадача=Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.Автор = Пользователи.ТекущийПользователь();
		НоваяЗадача.РольИсполнителя = Справочники.РолиИсполнителей.НайтиПоНаименованию("Отдел качества");
		НоваяЗадача.Наименование = "Созданы акты расхождений";
		НоваяЗадача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
		НоваяЗадача.Предмет = Основание; 
		НоваяЗадача.Описание = СтрокаЗадачи; 
		НоваяЗадача.Записать();
	КонецЕсли;

	Возврат СтруктураВозврата;
		
	
КонецФункции

Функция ИспользуетсяНоваяСхемаРаботыСклада(Дата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	НоваяСхемаУчета = Дата >= Константы.ДатаНачалаДействияНовогоУчетаПоСкладу.Получить() 
		         И Константы.ИспользуетсяНоваяСхемаУчетаПоСкладу.Получить()=Истина;

	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат НоваяСхемаУчета;	
			 
КонецФункции
		 
Функция РабочийУчастокСоздаватьПоставкиНаСклад(РабочийУчасток) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РабочийУчастокВключен = ?(ЗначениеЗаполнено(РабочийУчасток),?(РабочийУчасток.ИспользуетсяВПриемкеСТСД = Истина,Истина,Ложь),Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РабочийУчастокВключен;
	
КонецФункции

Функция РабочийУчастокСоздаватьОтгрузкиСоСклада(РабочийУчасток) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РабочийУчастокВключен = ?(ЗначениеЗаполнено(РабочийУчасток),?(РабочийУчасток.ИспользуетсяВОтгрузкеСТСД = Истина,Истина,Ложь),Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РабочийУчастокВключен;
	
КонецФункции

Функция ДокументОснованиеПрошелКПП(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеОтгрузкиДокументаСрезПоследних.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних КАК СостояниеОтгрузкиДокументаСрезПоследних
		|ГДЕ
		|	СостояниеОтгрузкиДокументаСрезПоследних.Документ = &Документ
		|	И СостояниеОтгрузкиДокументаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Заехал)";
	
	Запрос.УстановитьПараметр("Документ", Документ);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
		
КонецФункции

Функция ПолучитьТаблицуДвиженийРазмещениеАльтерра(Ссылка) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.Ссылка КАК Документ,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КРазмещению,
		|	ЗаказПоставщикуТовары.Склад КАК Склад,
		|	ЗаказПоставщикуТовары.ДатаПоступления КАК Период
		|ПОМЕСТИТЬ ВТ_Объединение
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|	И ЗаказПоставщикуТовары.Отменено = ЛОЖЬ
		|	И ЗаказПоставщикуТовары.ДатаПоступления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Характеристика,
		|	ПеремещениеТоваровТовары.Ссылка,
		|	ПеремещениеТоваровТовары.КоличествоУпаковок,
		|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
		|	ПеремещениеТоваровТовары.Ссылка.ДатаПоставкиНаСклад
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		|	И ПеремещениеТоваровТовары.Ссылка.ДатаПоставкиНаСклад <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Объединение.Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТ_Объединение.Документ КАК Документ,
		|	ВТ_Объединение.Номенклатура КАК Номенклатура,
		|	ВТ_Объединение.Характеристика КАК Характеристика,
		|	ВТ_Объединение.Склад КАК Склад,
		|	ВТ_Объединение.КРазмещению КАК КРазмещению
		|ИЗ
		|	ВТ_Объединение КАК ВТ_Объединение
		|ГДЕ
		|	ВТ_Объединение.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьТаблицуДвиженийРазмещениеПоРейсам(Ссылка) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаНачала = Константы.ДатаНачалаЗаписиДвиженийПоПоставкам.Получить();
	
	Если ДатаНачала = Дата(1,1,1) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи КАК ДокументПродажи,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.Дата КАК ДатаПрибытияНаСклад,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Основания
		|ИЗ
		|	Документ.ЗаданиеНаПеревозкуРейс.РасчетДоставки КАК ЗаданиеНаПеревозкуРейсРасчетДоставки
		|ГДЕ
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка = &Документ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РейсОтПоставщикаРасчетДоставки.ДокументОснование,
		|	РейсОтПоставщикаРасчетДоставки.Ссылка.ДатаПрибытияНаСклад,
		|	РейсОтПоставщикаРасчетДоставки.Ссылка
		|ИЗ
		|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
		|ГДЕ
		|	РейсОтПоставщикаРасчетДоставки.Ссылка = &Документ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РейсСиламиПоставщикаОснования.Документ,
		|	РейсСиламиПоставщикаОснования.Ссылка.Дата,
		|	РейсСиламиПоставщикаОснования.Ссылка
		|ИЗ
		|	Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
		|ГДЕ
		|	РейсСиламиПоставщикаОснования.Ссылка = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Основания.Ссылка КАК Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.Ссылка КАК Документ,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КРазмещению,
		|	ЗаказПоставщикуТовары.Склад КАК Склад,
		|	ВТ_Основания.ДатаПрибытияНаСклад КАК ДатаПоРейсу,
		|	ЗаказПоставщикуТовары.ДатаПоступления КАК ДатаПоДокументу
		|ПОМЕСТИТЬ ВТ_Объединение
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ПО ВТ_Основания.ДокументПродажи = ЗаказПоставщикуТовары.Ссылка
		|ГДЕ
		|	ЗаказПоставщикуТовары.Отменено = ЛОЖЬ
		|	И ЗаказПоставщикуТовары.ДатаПоступления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ЗаказПоставщикуТовары.Ссылка.Дата >= &Дата
		|	И ВТ_Основания.ДатаПрибытияНаСклад <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Основания.Ссылка,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Характеристика,
		|	ПеремещениеТоваровТовары.Ссылка,
		|	ПеремещениеТоваровТовары.КоличествоУпаковок,
		|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
		|	ВТ_Основания.ДатаПрибытияНаСклад,
		|	ПеремещениеТоваровТовары.Ссылка.ДатаПоставкиНаСклад
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ПО ВТ_Основания.ДокументПродажи = ПеремещениеТоваровТовары.Ссылка
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка.Дата >= &Дата
		|	И ПеремещениеТоваровТовары.Ссылка.ДатаПоставкиНаСклад <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ВТ_Основания.ДатаПрибытияНаСклад <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Объединение.Документ КАК Документ,
		|	ВТ_Объединение.Номенклатура КАК Номенклатура,
		|	ВТ_Объединение.Характеристика КАК Характеристика,
		|	ВТ_Объединение.Склад КАК Склад,
		|	СУММА(ВТ_Объединение.КРазмещению) КАК КРазмещению,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТ_Объединение.ДатаПоРейсу КАК Период,
		|	ВТ_Объединение.Ссылка КАК Рейс
		|ИЗ
		|	ВТ_Объединение КАК ВТ_Объединение
		|ГДЕ
		|	ВТ_Объединение.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Объединение.Документ,
		|	ВТ_Объединение.Номенклатура,
		|	ВТ_Объединение.Характеристика,
		|	ВТ_Объединение.Склад,
		|	ВТ_Объединение.ДатаПоРейсу,
		|	ВТ_Объединение.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Объединение.Документ,
		|	ВТ_Объединение.Номенклатура,
		|	ВТ_Объединение.Характеристика,
		|	ВТ_Объединение.Склад,
		|	СУММА(ВТ_Объединение.КРазмещению),
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВТ_Объединение.ДатаПоДокументу,
		|	NULL
		|ИЗ
		|	ВТ_Объединение КАК ВТ_Объединение
		|ГДЕ
		|	ВТ_Объединение.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Объединение.Документ,
		|	ВТ_Объединение.Номенклатура,
		|	ВТ_Объединение.Характеристика,
		|	ВТ_Объединение.Склад,
		|	ВТ_Объединение.ДатаПоДокументу";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("Дата", ДатаНачала);

	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТЗ;
	
КонецФункции
	
Функция ИспользуетсяНоваяСхемаРаботыСПоставками(Дата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ДатаНачала = Константы.ДатаНачалаЗаписиДвиженийПоПоставкам.Получить();

	НоваяСхемаРаботыПоставок = Дата >= ДатаНачала И НЕ ДатаНачала = Дата(1,1,1);

	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат НоваяСхемаРаботыПоставок;	
			 
КонецФункции

Функция ПроверитьОстаткиНаОфорлениеОрдеров(ДокументОснование) Экспорт
	
	СтруктураОтвета = Новый Структура();
	СтруктураОтвета.Вставить("ЕстьРасхожденияСОрдерами");
	СтруктураОтвета.Вставить("ТекстРасхождений");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Характеристика КАК Характеристика,
		|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Склад КАК Склад,
		|	СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовПриход) КАК КОформлениюАктовПриход,
		|	СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовРасход) КАК КОформлениюАктовРасход,
		|	-1 * (СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовПриход) - СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовРасход)) КАК КОформлениюОрдеров
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.ОстаткиИОбороты(, , Авто, , ) КАК ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты
		|ГДЕ
		|	(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор = &Регистратор
		|			ИЛИ ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор.Основание = &Регистратор)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Номенклатура,
		|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Характеристика,
		|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблица.Характеристика КАК Характеристика,
		|	ВременнаяТаблица.КОформлениюОрдеров КАК КОформлениюОрдеров
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|ГДЕ
		|	ВременнаяТаблица.КОформлениюОрдеров <> 0";
	
	Запрос.УстановитьПараметр("Регистратор", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()=0 Тогда
		СтруктураОтвета.ЕстьРасхожденияСОрдерами = Ложь;
	Иначе
		СтруктураОтвета.ЕстьРасхожденияСОрдерами = Истина;
		ТекстОтвета = "";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекстОтвета = ТекстОтвета + ВыборкаДетальныеЗаписи.Номенклатура + " к оформлению ордеров " + ВыборкаДетальныеЗаписи.КОформлениюОрдеров + Символы.ПС; 	
		КонецЦикла;
		СтруктураОтвета.ТекстРасхождений = ТекстОтвета;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Процедура СоздатьОрдераПоАктам(ДокументРаспоряжение) Экспорт
	
	НачатьТранзакцию();
	Попытка
		    СоздатьОрдера(ДокументРаспоряжение);
			ЗафиксироватьТранзакцию();
	Исключение
        ОтменитьТранзакцию();
		Сообщить("Не удалось создать ордера!");
		Сообщить(ИнформацияОбОшибке().Описание);
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьОрдерДляКорректировкаПриобретения(ДокументРаспоряжение, ВидОрдера) Экспорт 
	
	НачатьТранзакцию(); 
	Попытка 
		ОрдерДляКорректировкиПриобретения(ДокументРаспоряжение, ВидОрдера);
		ЗафиксироватьТранзакцию();
	Исключение 
		ОтменитьТранзакцию();
		Сообщить("Не удалось создать ордер!"); 
		Сообщить(ИнформацияОбОшибке().Описание);
	КонецПопытки; 
	
КонецПроцедуры

Процедура ОрдерДляКорректировкиПриобретения(ДокументРаспоряжение, ВидОрдера)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаПриобретенияРасхождения.Номенклатура КАК Номенклатура,
	|	КорректировкаПриобретенияРасхождения.Характеристика КАК Характеристика,
	|	КорректировкаПриобретенияРасхождения.Назначение КАК Назначение,
	|	КорректировкаПриобретенияРасхождения.Количество КАК Количество,
	|	КорректировкаПриобретенияРасхождения.Количество КАК КоличествоУпаковок,
	|	КорректировкаПриобретенияРасхождения.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КорректировкаПриобретения.Ссылка КАК Основание,
	|	КорректировкаПриобретения.Организация КАК Организация,
	|	КорректировкаПриобретения.Склад КАК Склад,
	|	КорректировкаПриобретенияРасхождения.Серия КАК Серия,
	|	КорректировкаПриобретенияРасхождения.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция
	|ИЗ
	|	Документ.КорректировкаПриобретения.Расхождения КАК КорректировкаПриобретенияРасхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК КорректировкаПриобретения
	|		ПО (КорректировкаПриобретенияРасхождения.Ссылка = КорректировкаПриобретения.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|				ПО КорректировкаПриобретенияРасхождения.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|					И КорректировкаПриобретения.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|					И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|
	|ГДЕ
	|	КорректировкаПриобретения.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Секция"; 
	
	Запрос.УстановитьПараметр("Ссылка", ДокументРаспоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСекция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСекция.Следующий() Цикл
		
		Ордер = ОрдерДляКорректировкиПриобретенияПоРаспоряжениюИСекции(ДокументРаспоряжение,ВыборкаСекция.Секция, ВидОрдера);
		
		Если Ордер = Неопределено Тогда
			
			Если ВидОрдера = "Отражение излишков" Тогда
				 Ордер = Документы.ОрдерНаОтражениеИзлишковТоваров.СоздатьДокумент();
			КонецЕсли;
			
			Если ВидОрдера = "Отражение недостач" Тогда
				 Ордер = Документы.ОрдерНаОтражениеНедостачТоваров.СоздатьДокумент();
			КонецЕсли;
			
			Ордер.Дата = ТекущаяДата();
			Ордер.Основание = ДокументРаспоряжение;
		    Ордер.Склад =  ДокументРаспоряжение.Склад;
		    Ордер.РабочийУчасток = ВыборкаСекция.Секция;
			Ордер.Комментарий = ДокументРаспоряжение.Комментарий;
			
		Иначе
			Ордер = Ордер.Ссылка.ПолучитьОбъект();
			
			Если Ордер.ПометкаУдаления = Истина Тогда
				 АльтерраОбщегоНазначения.СообщитьПользователю(Ордер.Ссылка,"Есть созданный ордер, который помечен на удаление! Снимите пометку на удаление и попробуйте создать ордера заново! - " + Строка(Ордер.Ссылка));
				 Возврат;
			КонецЕсли;
			 
		КонецЕсли;		
		
		Если Не ЗначениеЗаполнено(Ордер.Ответственный) Тогда
			Ордер.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		Ордер.Товары.Очистить();
		
		ВыборкаДетальныеЗаписи = ВыборкаСекция.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВидОрдера = "Отражение излишков" И ВыборкаДетальныеЗаписи.Количество > 0 Тогда
				НоваяСтрока = Ордер.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			КонецЕсли;
			Если ВидОрдера = "Отражение недостач" И ВыборкаДетальныеЗаписи.Количество < 0 Тогда	
				НоваяСтрока = Ордер.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
				НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество * (-1);
				НоваяСтрока.КоличествоУпаковок = ВыборкаДетальныеЗаписи.КоличествоУпаковок * (-1);

			КонецЕсли; 
		КонецЦикла;
		
		Ордер.Записать(РежимЗаписиДокумента.Проведение);
		АльтерраОбщегоНазначения.СообщитьПользователю(Ордер.Ссылка,"Создан/обновлен документ " + Строка(Ордер.Ссылка));
	КонецЦикла;

КонецПроцедуры

Функция ОрдерДляКорректировкиПриобретенияПоРаспоряжениюИСекции(Распоряжение,Секция, ВидОрдера)
	
	СсылкаНаДокумент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрдерНаОтражениеИзлишковТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеИзлишковТоваров КАК ОрдерНаОтражениеИзлишковТоваров
		|ГДЕ
		|	ОрдерНаОтражениеИзлишковТоваров.Основание = &Основание
		|	И ОрдерНаОтражениеИзлишковТоваров.РабочийУчасток = &РабочийУчасток
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОрдерНаОтражениеНедостачТоваров.Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеНедостачТоваров КАК ОрдерНаОтражениеНедостачТоваров
		|ГДЕ
		|	ОрдерНаОтражениеНедостачТоваров.Основание = &Основание
		|	И ОрдерНаОтражениеНедостачТоваров.РабочийУчасток = &РабочийУчасток";
	
	Запрос.УстановитьПараметр("Основание", Распоряжение);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если (ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") И ВидОрдера = "Отражение излишков") ИЛИ  (ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.СписаниеНедостачТоваров") И ВидОрдера = "Отражение недостач") Тогда 
	     СсылкаНаДокумент = ВыборкаДетальныеЗаписи.Ссылка;
	 КонецЕсли; 
	КонецЦикла;
	
	Возврат СсылкаНаДокумент;

КонецФункции

Процедура СоздатьОрдера(ДокументРаспоряжение)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОприходованиеИзлишковТоваровТовары.Номенклатура КАК Номенклатура,
		|	ОприходованиеИзлишковТоваровТовары.Характеристика КАК Характеристика,
		|	ОприходованиеИзлишковТоваровТовары.Ссылка.Склад КАК Склад,
		|	ОприходованиеИзлишковТоваровТовары.Назначение КАК Назначение,
		|	ОприходованиеИзлишковТоваровТовары.Количество КАК Количество,
		|	ОприходованиеИзлишковТоваровТовары.Серия КАК Серия,
		|	ОприходованиеИзлишковТоваровТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ОприходованиеИзлишковТоваровТовары.Количество КАК КоличествоУпаковок,
		|	ОприходованиеИзлишковТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	NULL КАК НоменклатураОприходование,
		|	NULL КАК ХарактеристикаОприходование,
		|	NULL КАК НазначениеОприходование,
		|	NULL КАК СерияОприходование,
		|	NULL КАК СтатусУказанияСерийОприходование,
		|	NULL КАК КоличествоОприходование,
		|	NULL КАК УпаковкаОприходование,
		|	NULL КАК ПодНазначение
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
		|ГДЕ
		|	ОприходованиеИзлишковТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеНедостачТоваровТовары.Номенклатура,
		|	СписаниеНедостачТоваровТовары.Характеристика,
		|	СписаниеНедостачТоваровТовары.Ссылка.Склад,
		|	СписаниеНедостачТоваровТовары.Назначение,
		|	СписаниеНедостачТоваровТовары.Количество,
		|	СписаниеНедостачТоваровТовары.Серия,
		|	СписаниеНедостачТоваровТовары.СтатусУказанияСерий,
		|	СписаниеНедостачТоваровТовары.Количество,
		|	СписаниеНедостачТоваровТовары.Номенклатура.ЕдиницаИзмерения,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
		|ГДЕ
		|	СписаниеНедостачТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПересортицаТоваровТовары.Номенклатура,
		|	ПересортицаТоваровТовары.Характеристика,
		|	ПересортицаТоваровТовары.Ссылка.Склад,
		|	ПересортицаТоваровТовары.Назначение,
		|	ПересортицаТоваровТовары.Количество,
		|	ПересортицаТоваровТовары.Серия,
		|	ПересортицаТоваровТовары.СтатусУказанияСерий,
		|	ПересортицаТоваровТовары.Количество,
		|	ПересортицаТоваровТовары.Номенклатура.ЕдиницаИзмерения,
		|	ПересортицаТоваровТовары.НоменклатураОприходование,
		|	ПересортицаТоваровТовары.ХарактеристикаОприходование,
		|	ПересортицаТоваровТовары.НазначениеОприходование,
		|	ПересортицаТоваровТовары.СерияОприходование,
		|	ПересортицаТоваровТовары.СтатусУказанияСерийОприходование,
		|	ПересортицаТоваровТовары.Количество,
		|	ПересортицаТоваровТовары.НоменклатураОприходование.ЕдиницаИзмерения,
		|	NULL
		|ИЗ
		|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
		|ГДЕ
		|	ПересортицаТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПорчаТоваровТовары.Номенклатура,
		|	ПорчаТоваровТовары.Характеристика,
		|	ПорчаТоваровТовары.Ссылка.Склад,
		|	ПорчаТоваровТовары.Назначение,
		|	ПорчаТоваровТовары.Количество,
		|	ПорчаТоваровТовары.Серия,
		|	ПорчаТоваровТовары.СтатусУказанияСерий,
		|	ПорчаТоваровТовары.Количество,
		|	ПорчаТоваровТовары.Номенклатура.ЕдиницаИзмерения,
		|	ПорчаТоваровТовары.НоменклатураОприходование,
		|	ПорчаТоваровТовары.ХарактеристикаОприходование,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ПорчаТоваровТовары.Количество,
		|	ПорчаТоваровТовары.НоменклатураОприходование.ЕдиницаИзмерения,
		|	ПорчаТоваровТовары.ПодНазначение
		|ИЗ
		|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
		|ГДЕ
		|	ПорчаТоваровТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток, ЗНАЧЕНИЕ(Справочник.РабочиеУчастки.ПустаяСсылка)) КАК Секция,
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Склад КАК Склад,
		|	ВТ_Товары.Назначение КАК Назначение,
		|	ВТ_Товары.Количество КАК Количество,
		|	ВТ_Товары.Серия КАК Серия,
		|	ВТ_Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВТ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_Товары.Упаковка КАК Упаковка,
		|	ВТ_Товары.НоменклатураОприходование КАК НоменклатураОприходование,
		|	ВТ_Товары.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
		|	ВТ_Товары.НазначениеОприходование КАК НазначениеОприходование,
		|	ВТ_Товары.СерияОприходование КАК СерияОприходование,
		|	ВТ_Товары.СтатусУказанияСерийОприходование КАК СтатусУказанияСерийОприходование,
		|	ВТ_Товары.КоличествоОприходование КАК КоличествоОприходование,
		|	ВТ_Товары.УпаковкаОприходование КАК УпаковкаОприходование,
		|	ВТ_Товары.ПодНазначение КАК ПодНазначение
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ВТ_Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|ИТОГИ ПО
		|	Секция";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументРаспоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСекция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСекция.Следующий() Цикл
		
		Ордер = ОрдерПоРаспоряжениюИСекции(ДокументРаспоряжение,ВыборкаСекция.Секция);
		
		Если Ордер = Неопределено Тогда
			
			Если ТипЗнч(ДокументРаспоряжение) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда
				 Ордер = Документы.ОрдерНаОтражениеИзлишковТоваров.СоздатьДокумент();
			КонецЕсли;
			
			Если ТипЗнч(ДокументРаспоряжение) = Тип("ДокументСсылка.СписаниеНедостачТоваров") Тогда
				 Ордер = Документы.ОрдерНаОтражениеНедостачТоваров.СоздатьДокумент();
			КонецЕсли;
			
			Если ТипЗнч(ДокументРаспоряжение) = Тип("ДокументСсылка.ПересортицаТоваров") Тогда
				 Ордер = Документы.ОрдерНаОтражениеПересортицыТоваров.СоздатьДокумент();
			КонецЕсли;
			
			Если ТипЗнч(ДокументРаспоряжение) = Тип("ДокументСсылка.ПорчаТоваров") Тогда
				 Ордер = Документы.ОрдерНаОтражениеПорчиТоваров.СоздатьДокумент();
			КонецЕсли;
			
			Ордер.Дата = ТекущаяДата();
			Ордер.Основание = ДокументРаспоряжение;
		    Ордер.Склад =  ДокументРаспоряжение.Склад;
		    Ордер.РабочийУчасток = ВыборкаСекция.Секция;
			Ордер.Комментарий = ДокументРаспоряжение.Комментарий;
			
		Иначе
			Ордер = Ордер.Ссылка.ПолучитьОбъект();
			
			Если Ордер.ПометкаУдаления = Истина Тогда
				 АльтерраОбщегоНазначения.СообщитьПользователю(Ордер.Ссылка,"Есть созданный ордер, который помечен на удаление! Снимите пометку на удаление и попробуйте создать ордера заново! - " + Строка(Ордер.Ссылка));
				 Возврат;
			КонецЕсли;
			 
		КонецЕсли;		
		
		Если Не ЗначениеЗаполнено(Ордер.Ответственный) Тогда
			Ордер.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		Ордер.Товары.Очистить();
		
		ВыборкаДетальныеЗаписи = ВыборкаСекция.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Ордер.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		Ордер.Записать(РежимЗаписиДокумента.Проведение);
		АльтерраОбщегоНазначения.СообщитьПользователю(Ордер.Ссылка,"Создан/обновлен документ " + Строка(Ордер.Ссылка));
	КонецЦикла;
	
КонецПроцедуры

Функция ОрдерПоРаспоряжениюИСекции(Распоряжение,Секция)
	
	СсылкаНаДокумент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрдерНаОтражениеИзлишковТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеИзлишковТоваров КАК ОрдерНаОтражениеИзлишковТоваров
		|ГДЕ
		|	ОрдерНаОтражениеИзлишковТоваров.Основание = &Основание
		|	И ОрдерНаОтражениеИзлишковТоваров.РабочийУчасток = &РабочийУчасток
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОрдерНаОтражениеНедостачТоваров.Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеНедостачТоваров КАК ОрдерНаОтражениеНедостачТоваров
		|ГДЕ
		|	ОрдерНаОтражениеНедостачТоваров.Основание = &Основание
		|	И ОрдерНаОтражениеНедостачТоваров.РабочийУчасток = &РабочийУчасток
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОрдерНаОтражениеПересортицыТоваров.Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеПересортицыТоваров КАК ОрдерНаОтражениеПересортицыТоваров
		|ГДЕ
		|	ОрдерНаОтражениеПересортицыТоваров.РабочийУчасток = &РабочийУчасток
		|	И ОрдерНаОтражениеПересортицыТоваров.Основание = &Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОрдерНаОтражениеПорчиТоваров.Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеПорчиТоваров КАК ОрдерНаОтражениеПорчиТоваров
		|ГДЕ
		|	ОрдерНаОтражениеПорчиТоваров.Основание = &Основание
		|	И ОрдерНаОтражениеПорчиТоваров.РабочийУчасток = &РабочийУчасток";
	
	Запрос.УстановитьПараметр("Основание", Распоряжение);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	     СсылкаНаДокумент = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;
	
	Возврат СсылкаНаДокумент;

КонецФункции

Функция ПоАктуСуществуетОрдерНаОтражение(Акт) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрдерНаОтражениеИзлишковТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеИзлишковТоваров КАК ОрдерНаОтражениеИзлишковТоваров
		|ГДЕ
		|	ОрдерНаОтражениеИзлишковТоваров.Проведен = ИСТИНА
		|	И ОрдерНаОтражениеИзлишковТоваров.Основание = &Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОрдерНаОтражениеНедостачТоваров.Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеНедостачТоваров КАК ОрдерНаОтражениеНедостачТоваров
		|ГДЕ
		|	ОрдерНаОтражениеНедостачТоваров.Проведен = ИСТИНА
		|	И ОрдерНаОтражениеНедостачТоваров.Основание = &Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОрдерНаОтражениеПересортицыТоваров.Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеПересортицыТоваров КАК ОрдерНаОтражениеПересортицыТоваров
		|ГДЕ
		|	ОрдерНаОтражениеПересортицыТоваров.Проведен = ИСТИНА
		|	И ОрдерНаОтражениеПересортицыТоваров.Основание = &Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОрдерНаОтражениеПорчиТоваров.Ссылка
		|ИЗ
		|	Документ.ОрдерНаОтражениеПорчиТоваров КАК ОрдерНаОтражениеПорчиТоваров
		|ГДЕ
		|	ОрдерНаОтражениеПорчиТоваров.Проведен = ИСТИНА
		|	И ОрдерНаОтражениеПорчиТоваров.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Акт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ТоварПоРаспоряжениюПринят(Распоряжение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	СУММА(ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток) КАК КоличествоУпаковок,
		|	СУММА(ТоварыКПоступлениюОстатки.ПринимаетсяОстаток) КАК ПринимаетсяОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(, ) КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКПоступлениюОстатки.Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток) > 0
		|		ИЛИ СУММА(ТоварыКПоступлениюОстатки.ПринимаетсяОстаток) > 0)";

	Запрос.УстановитьПараметр("ДокументПоступления", Распоряжение);
								
	РезультатЗапроса = Запрос.Выполнить();

	Возврат ?(РезультатЗапроса.Пустой(),Истина,Ложь);		
КонецФункции

// Функция - Есть ли не заблокированные товары
//
// Параметры:
//  Распоряжение	 - 	 - 
//  ПриходныйОрдер	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЕстьЛиНеЗаблокированныеТовары(Распоряжение,ПриходныйОрдер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	СУММА(-1 * ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ИзлишкиПоПоступлению
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(
		|			,
		|			(Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
		|					ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика
		|				ИЗ
		|					Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
		|				ГДЕ
		|					ПриходныйОрдерНаТоварыТовары.Ссылка = &ПриходныйОрдер)) КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления
		|	И ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток < 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКПоступлениюОстатки.Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БлокировкаДвиженияТоваровТовары.Номенклатура КАК Номенклатура,
		|	БлокировкаДвиженияТоваровТовары.Характеристика КАК Характеристика,
		|	СУММА(БлокировкаДвиженияТоваровТовары.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ЗаблокированныеТовары
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК БлокировкаДвиженияТоваровТовары
		|ГДЕ
		|	БлокировкаДвиженияТоваровТовары.Ссылка.Статус = &Статус
		|	И БлокировкаДвиженияТоваровТовары.Ссылка.ДокументОснование = &ПриходныйОрдер
		|	И БлокировкаДвиженияТоваровТовары.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	БлокировкаДвиженияТоваровТовары.Номенклатура,
		|	БлокировкаДвиженияТоваровТовары.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Результат
		|ПОМЕСТИТЬ ВТЕстьРасхождения
		|ИЗ
		|	ИзлишкиПоПоступлению КАК ИзлишкиПоПоступлению
		|		ПОЛНОЕ СОЕДИНЕНИЕ ЗаблокированныеТовары КАК ЗаблокированныеТовары
		|		ПО (ЗаблокированныеТовары.Номенклатура = ИзлишкиПоПоступлению.Номенклатура)
		|			И (ЗаблокированныеТовары.Характеристика = ИзлишкиПоПоступлению.Характеристика)
		|ГДЕ
		|	ЕСТЬNULL(ИзлишкиПоПоступлению.КоличествоУпаковок, 0) - ЕСТЬNULL(ЗаблокированныеТовары.КоличествоУпаковок, 0) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Излишки.Номенклатура КАК Номенклатура,
		|	Излишки.Характеристика КАК Характеристика,
		|	Излишки.КоличествоУпаковок КАК КоличествоУпаковок
		|ИЗ
		|	ИзлишкиПоПоступлению КАК Излишки
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ
		|				ВТЕстьРасхождения.Результат
		|			ИЗ
		|				ВТЕстьРасхождения)";

	Запрос.УстановитьПараметр("ДокументПоступления", Распоряжение);
	Запрос.УстановитьПараметр("ПриходныйОрдер", ПриходныйОрдер);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
				
	Возврат Запрос.Выполнить();
		
КонецФункции

Функция НетТоваровСверхРаспоряжения(Распоряжение,ПриходныйОрдер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	СУММА(-1 * ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток) КАК КоличествоУпаковок
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(
		|			,
		|			(Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
		|					ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика
		|				ИЗ
		|					Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
		|				ГДЕ
		|					ПриходныйОрдерНаТоварыТовары.Ссылка = &ПриходныйОрдер)) КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления
		|	И ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток < 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКПоступлениюОстатки.Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика";

	Запрос.УстановитьПараметр("ДокументПоступления", Распоряжение);
	Запрос.УстановитьПараметр("ПриходныйОрдер", ПриходныйОрдер);
				
	Возврат Запрос.Выполнить().Пустой();
		
КонецФункции


Процедура СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировкиДвижения,ПараметрыЗаполнения, ТоварыВТЗ = Ложь) Экспорт
	
	ДокументБлокировкиДвижения.Дата = ПараметрыЗаполнения.Дата;
	ДокументБлокировкиДвижения.Склад = ПараметрыЗаполнения.Склад;
	ДокументБлокировкиДвижения.ДокументОснование =  ПараметрыЗаполнения.ДокументОснование;
	ДокументБлокировкиДвижения.Статус = ПараметрыЗаполнения.Статус;
	ДокументБлокировкиДвижения.ПричинаБлокировки = ПараметрыЗаполнения.ПричинаБлокировки;
    ДокументБлокировкиДвижения.Ответственный = Пользователи.ТекущийПользователь();
    ДокументБлокировкиДвижения.Комментарий = ПараметрыЗаполнения.Комментарий;
    
    ДопСвойство = Новый Структура();
    ПараметрыЗаполнения.Свойство("ДополнительныеСвойства", ДопСвойство);
    Если ДопСвойство <> Неопределено тогда
	    Для Каждого ТекущийПараметр из ДопСвойство Цикл
	     ДокументБлокировкиДвижения.ДополнительныеСвойства.Вставить(ТекущийПараметр.Ключ, ТекущийПараметр.Значение);
	    КонецЦикла;
    Конецесли;
    
    
	Если ТоварыВТЗ Тогда
		ДокументБлокировкиДвижения.Товары.Загрузить(ПараметрыЗаполнения.Товары);
	Иначе
    	ДокументБлокировкиДвижения.Товары.Загрузить(ПараметрыЗаполнения.Товары.Выгрузить());
	КонецЕсли;
	Попытка
        ДокументБлокировкиДвижения.Записать(РежимЗаписиДокумента.Проведение);
		АльтерраОбщегоНазначения.СообщитьПользователю(ДокументБлокировкиДвижения.Ссылка, "Создан/обновлен документ: "+ДокументБлокировкиДвижения.Ссылка + ". Основание - " + ПараметрыЗаполнения.ДокументОснование);
    Исключение
        Сообщить("Не удалось создать/обновить документ " + ДокументБлокировкиДвижения);	
	КонецПопытки;
    
КонецПроцедуры

Функция ПолучитьБлокировкиПоОснования(Основание) Экспорт
	  		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА БлокировкаДвиженияТоваров.ПричинаБлокировки = &ПричинаРасхождениеКМ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПричинаРасхождениеКМ
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
		|ГДЕ
		|	БлокировкаДвиженияТоваров.ДокументОснование = &ДокументОснование
		|	И БлокировкаДвиженияТоваров.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ПричинаРасхождениеКМ",Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при поступлении (нет кода маркировки)"));

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьПриходныеОрдерыНаТоварыГдеЕстьБлокировкиПоЗаказуПоставщику(ЗаказПоставщику) Экспорт
	  		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   ПриходныйОрдерНаТовары.Ссылка КАК ПриходныйОрдерНаТовары
        |ИЗ
        |   Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
        |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
        |           ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
        |           ПО ПриходныйОрдерНаТовары.Распоряжение = ЗаказПоставщику.Ссылка
        |       ПО БлокировкаДвиженияТоваров.ДокументОснование = ПриходныйОрдерНаТовары.Ссылка
        |ГДЕ
        |   БлокировкаДвиженияТоваров.Проведен = ИСТИНА
        |   И ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", ЗаказПоставщику);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
    
	Возврат РезультатЗапроса;
	
КонецФункции

Функция СоздатьПриходныйОрдерНаТовары(СтруктураПараметровСоздания) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ДокументОрдер,СтруктураПараметровСоздания);
		
		Если ДокументОрдер.СкладскаяОперация <> Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваров
			И ЗначениеЗаполнено(ДокументОрдер.Распоряжение) Тогда
			СкладскаяОперация = СкладыКлиентСервер.СкладскаяОперацияПриемкиПоХозяйственнойОперации(ДокументОрдер.ХозяйственнаяОперация);
			Если СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению
				Или СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства Тогда
				ДокументОрдер.ЗаполнитьТоварыПоТоварамКПоступлению("НоменклатураКоличество", СтруктураПараметровСоздания.ДатаПоступления);
			Иначе
				ДокументОрдер.ЗаполнитьТоварыПоТоварамКПоступлению("Номенклатура", СтруктураПараметровСоздания.ДатаПоступления);
			КонецЕсли;
			
			Документы.ПриходныйОрдерНаТовары.ЗаполнитьСерииПоРаспоряжению(ДокументОрдер, Ложь);
		КонецЕсли;
		
	ДокументОрдер.Ответственный = Пользователи.ТекущийПользователь();
	ДокументОрдер.Статус        = Перечисления.СтатусыПриходныхОрдеров.Принят;

    ДокументОрдер.Записать(РежимЗаписиДокумента.Проведение);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументОрдер.Ссылка; 
КонецФункции

Процедура КонтрольОстатковПоТоварамНаСкладах(Объект,Отказ) Экспорт
	
	Если Отказ тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не Константы.КонтролироватьОстаткиТоваровНаСкладах.Получить() тогда
		
		Возврат;
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Склад КАК Склад,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток - ЗаказКлиентаТовары.Количество, 0)) КАК Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	|		ПО ЗаказКлиентаТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ЗаказКлиентаТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И (ВЫБОР
	|				КОГДА ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно)
	|					ТОГДА ЗаказКлиентаТовары.Ссылка.Назначение = ТоварыНаСкладахОстатки.Назначение
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ЗаказКлиентаТовары.Склад = ТоварыНаСкладахОстатки.Склад
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка
	|	И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно)
	|			ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика,
	|	ЗаказКлиентаТовары.Склад,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток - ЗаказКлиентаТовары.Количество, 0)) < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика,
	|	РеализацияТоваровУслугТовары.Склад,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток - РеализацияТоваровУслугТовары.Количество, 0))
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И РеализацияТоваровУслугТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И РеализацияТоваровУслугТовары.Назначение = ТоварыНаСкладахОстатки.Назначение
	|			И РеализацияТоваровУслугТовары.Склад = ТоварыНаСкладахОстатки.Склад
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугТовары.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|	И РеализацияТоваровУслугТовары.Ссылка.Дата >= РеализацияТоваровУслугТовары.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика,
	|	РеализацияТоваровУслугТовары.Склад,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток - РеализацияТоваровУслугТовары.Количество, 0)) < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМТовары.Номенклатура,
	|	ЧекККМТовары.Характеристика,
	|	ЧекККМТовары.Ссылка.Склад,
	|	ЧекККМТовары.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток - ЧекККМТовары.Количество, 0))
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	|		ПО ЧекККМТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ЧекККМТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И ЧекККМТовары.Ссылка.Склад = ТоварыНаСкладахОстатки.Склад
	|ГДЕ
	|	ЧекККМТовары.Ссылка = &Ссылка
	|	И ЧекККМТовары.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|	И ЧекККМТовары.Ссылка.Дата >= ЧекККМТовары.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМТовары.Номенклатура,
	|	ЧекККМТовары.Характеристика,
	|	ЧекККМТовары.Ссылка.Склад,
	|	ЧекККМТовары.Номенклатура.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток - ЧекККМТовары.Количество, 0)) < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток - ПеремещениеТоваровТовары.Количество, 0))
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ПеремещениеТоваровТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель = ТоварыНаСкладахОстатки.Склад
	|			И ПеремещениеТоваровТовары.НазначениеОтправителя = ТоварыНаСкладахОстатки.Назначение
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|	И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|	И ПеремещениеТоваровТовары.Ссылка.Дата >= ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.КОтгрузкеОстаток - ПеремещениеТоваровТовары.Количество, 0)) < 0";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата+1);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
		
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = "Превышен складской остаток номенклатуре " + Строка(Выборка.Номенклатура) + " (" + Строка(Выборка.Характеристика)+ ") на количество " +Строка(Выборка.Количество) + " " + Строка(Выборка.ЕдиницаИзмерения) + " на складе " + Строка(Выборка.Склад) + " на дату документа (дополнительный контроль).";
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ,, Отказ);
		ТекстСообщения = НСтр("ru = 'Проведение не выполнено '");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения + Строка(Объект));
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ПоДокументуЕстьАктПоРасхождениям(ДокументОснование) Экспорт
	 		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктОРасхожденияхПослеПеремещенияТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК АктОРасхожденияхПослеПеремещенияТовары
		|ГДЕ
		|	АктОРасхожденияхПослеПеремещенияТовары.ДокументОснование = &ДокументОснование
		|	И АктОРасхожденияхПослеПеремещенияТовары.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ЗаписьВРегистрЖурналРаботыТСД(Событие,Комментарий="",Документ=Неопределено,Сотрудник=Неопределено,ИдентификаторКлиента=Неопределено) Экспорт
	
	РегистрыСведений.ЖурналРаботыТСД.ЗаписатьСобытие(Событие,Комментарий,Документ,Сотрудник,ИдентификаторКлиента);
	
КонецПроцедуры

Функция ПолучитьИдентификаторКлиента() Экспорт
	
	 УстановитьПривилегированныйРежим(Истина);

	 СистемнаяИнформация = Новый СистемнаяИнформация;
	 
	 Возврат СистемнаяИнформация.ИдентификаторКлиента; 
	 
КонецФункции

Функция ТекущийСотрудник() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Попытка
		Возврат ?(ЗначениеЗаполнено(ПараметрыСеанса.ТекущийСотрудник), ПараметрыСеанса.ТекущийСотрудник, Справочники.Сотрудники.ПустаяСсылка());
	Исключение
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции
		  
Функция ПолучитьОстатки(Номенклатура, ХарактеристикаНоменклатуры, Склад, БезРезервов = Ложь) Экспорт

	Запрос = Новый Запрос;
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапасыИПотребность.ВНаличииОстаток "+?(безрезервов,"- ЗапасыИПотребность.РезервироватьНаСкладеОстаток","")+" КАК ВНаличииОстаток
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И Характеристика = &Характеристика
		|				И Склад = &Склад и Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ЗапасыИПотребность";  
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Остаток = 0;
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Остаток = Выборка.ВНаличииОстаток;
	КонецЕсли;
	
	Возврат Остаток;
	
КонецФункции
