
&НаКлиенте
Процедура Док_КассаПриИзмененииПосле(Элемент)
	Если ЗначениеЗаполнено(Объект.Касса) Тогда
		Объект.Подразделение = ПодразделениеКассы(Объект.Касса);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодразделениеКассы(Касса)   
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Касса, "Подразделение");
КонецФункции      

&НаКлиенте
Процедура Док_ХозяйственнаяОперацияПриИзмененииПосле(Элемент)
	ОбновитьСтатьюДДС();
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Организация) тогда
		НовыйМассив = Новый Массив();                    
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Организация"));
		
		Элементы.Касса.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
&После("РасшифровкаПлатежаСтатьяРасходовПриИзмененииСервер")
Процедура Док_РасшифровкаПлатежаСтатьяРасходовПриИзмененииСервер(КэшированныеЗначения, ИмяЭлемента)
	Документы.РасходныйКассовыйОрдер.СтатьяРасходов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами(Объект);
КонецПроцедуры        

#Область НапечататьПоследнийСлипЧек

&НаКлиенте
Процедура НапечататьПоследнийСлипЧек(Команда)   
	Если ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование) И ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование.ККТ) Тогда
		ДопМодульКлиент.НапечататьПоследнийСлипЧек(ЭтотОбъект.УникальныйИдентификатор, ФискальнаяОперацияПодключенноеОборудование.ККТ);
    КонецЕсли;
КонецПроцедуры       

#КонецОбласти      

&НаСервере
Процедура ОбновитьСтатьюДДС()
	Документы.РасходныйКассовыйОрдер.ЗаполнитьСтатьюДДС(Объект);
КонецПроцедуры

&НаСервере
Функция СуммаБольшеСуммыДокумента()

	Попытка
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			Если Не Объект.ДокументОснование.Метаданные().Реквизиты.Найти("СуммаДокумента") = Неопределено Тогда
				Возврат Объект.СуммаДокумента > Объект.ДокументОснование.СуммаДокумента; 
			Иначе
				Возврат Ложь;		
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки   

КонецФункции

&НаКлиенте
Процедура Док_СуммаДокументаПриИзмененииПосле(Элемент)
	Если СуммаБольшеСуммыДокумента() Тогда
		ПоказатьПредупреждение(,"Внимание, НЕЛЬЗЯ вводить сумму больше, чем сумма документа основания!",);
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьКассира")
&НаСервере
Процедура Док_ЗаполнитьКассира()
    #Удаление
	КассирКассы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Касса, "Кассир");
	Если ЗначениеЗаполнено(КассирКассы) Тогда
		Объект.Кассир = КассирКассы;
	Иначе
	#КонецУдаления
		Объект.Кассир = ДенежныеСредстваСервер.КассирПоследнегоРКОИлиПКО(Объект.Дата, Объект.Организация, Объект.Касса);
	#Удаление
	КонецЕсли;
    #КонецУдаления
КонецПроцедуры
