
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьКассовуюКнигу(Команда)
	
//	СтруктураПараметров = Новый Структура("Организация", ОтборОрганизация);
	ОткрытьФорму("Отчет.КассоваяКнига.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)
	
//	СтруктураПараметров = Новый Структура("Организация", ОтборОрганизация);
	ОткрытьФорму("Отчет.ЖурналРегистрацииКассовыхДокументов.Форма");
	
КонецПроцедуры
