
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок   = Параметры.ЗаголовокФормы;
	
	Если Параметры.Картинка.Вид <> ВидКартинки.Пустая Тогда
		Элементы.Картинка.Картинка = Параметры.Картинка;
	Иначе
		Элементы.Картинка.Видимость = Ложь;
	КонецЕсли;
	
	ПоказатьКомментарий = Ложь;
	КонстантыРасхождений = ИнтеграцияСМаркетплейсамиСервер.КонстантыРасхождений();
	
	Для Каждого КлючИЗначение Из Параметры.СведенияОМаркировке Цикл
		СтрокаТаблицыЗначений = СведенияОМаркировке.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗначений, КлючИЗначение.Значение);
		
		СтрокаТаблицыЗначений.СтатусКартинка      = БиблиотекаКартинок[КонстантыРасхождений[КлючИЗначение.Значение.Статус]];
		СтрокаТаблицыЗначений.СтатусПредставление = КлючИЗначение.Значение.Статус;
		СтрокаТаблицыЗначений.Количество          = Макс(КлючИЗначение.Значение.Количество, 
			КлючИЗначение.Значение.КоличествоПоДокументу);
		
		СтрокаТаблицыЗначений.Комментарий = "";
		Если СтрокаТаблицыЗначений.Количество > 1 Тогда
			СтрокаТаблицыЗначений.Комментарий = СтрокаТаблицыЗначений.Комментарий
				+ СтрокаТаблицыЗначений.Количество + " " + КлючИЗначение.Значение.Упаковка + " ";
		КонецЕсли;
		Если ЗначениеЗаполнено(КлючИЗначение.Значение.ТекстСообщения) Тогда
			СтрокаТаблицыЗначений.Комментарий = СтрокаТаблицыЗначений.Комментарий
				+ СтрЗаменить(КлючИЗначение.Значение.ТекстСообщения, НСтр("ru = '(в файле нет сведений)'"), "");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицыЗначений.Комментарий) Тогда
			ПоказатьКомментарий = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СведенияОМаркировкеКомментарий.Видимость = ПоказатьКомментарий;
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СведенияОМаркировкеСтатусПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОМаркировке.СтатусПредставление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "КодыМаркировкиСовпадают";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Совпадает'"));
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СведенияОМаркировкеСтатусПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОМаркировке.СтатусПредставление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "ЛишнийКодМаркировки";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Недостача'"));
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СведенияОМаркировкеСтатусПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОМаркировке.СтатусПредставление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "КодовМаркировкиНетВФайле";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = 'Нет в файле'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНеАктивнойСтроки);
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СведенияОМаркировкеСтатусПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОМаркировке.СтатусПредставление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "ПересортицаКодовМаркировки";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Пересортица'"));
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СведенияОМаркировкеСтатусПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОМаркировке.СтатусПредставление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "ИзлишекКодовМаркировки";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Излишек'"));
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СведенияОМаркировкеСтатусПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОМаркировке.СтатусПредставление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "НедостачаКодовМаркировки";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Недостача'"));
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СведенияОМаркировкеСтатусПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СведенияОМаркировке.СтатусПредставление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "КодыМаркировкиНеНайдены";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = 'Не найден'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
КонецПроцедуры

#КонецОбласти
