
#Область СобытияФормы

&НаСервере
Процедура Инициализировать()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыПродажи, "Основания", Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Карта= Истина; 
	УстановитьВидДоставки(); 
	УстановитьВидимостьДоступность();
	РежимРаботы= 1;
	ИнициализироватьКарту(); 
КонецПроцедуры

&НаСервере 
Процедура УстановитьВидДоставки()
	ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК;
КонецПроцедуры
&НаКлиенте
Процедура ПулЗаказовПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыПродажи, "Основания", ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку), Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку), Истина);
	Иначе
		Инициализировать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПродажиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПулЗаказовОтметкаПриИзменении(Элемент)
	Попытка
		ДобавитьУдалитьЗаказВРейс();
	Исключение
		Сообщить("Ошибка сервияса геокодирования Яндекс");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	ИнициализироватьКарту();
	
	ОбновитьСписокДоставки(Неопределено);

	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	ИнициализироватьКарту();
	
	ОбновитьСписокДоставки(Неопределено);

	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоТарифамПриИзменении(Элемент)
	ИнициализироватьКарту();
	
	ОбновитьСписокДоставки(Неопределено);

	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура КартаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия
&НаКлиенте
Процедура ОтборПоТарифам(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	ПараметрыФормы.Вставить("ВыделитьСтрокиМассив", ПолучитьМассивТарифов());
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораТарифов", ЭтаФорма);

	ОткрытьФорму("Справочник.ТарифыПеревозчиков.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры
&НаСервере
Функция ПолучитьМассивТарифов()
	Возврат Тарифы.Выгрузить().ВыгрузитьКолонку("Тариф");
КонецФункции
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораТарифов(МассивТарифов, ДопПараметры) Экспорт
	Если МассивТарифов <> Неопределено Тогда
		Тарифы.Очистить();
		
		Для Каждого ЭлементМассива Из МассивТарифов Цикл
			НоваяСтрока = Тарифы.Добавить();
			НоваяСтрока.Тариф = ЭлементМассива;
		КонецЦикла;
		
		Если ИспользоватьОтборПоТарифам Тогда 
			ИнициализироватьКарту();
			ОбновитьСписокДоставки(Неопределено);
			УстановитьВидимостьДоступность();
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДоставки(Команда)
	ОбновитьСписокДоставкиНаСервере();
	ЗаказыВРейс.Очистить();
КонецПроцедуры
&НаСервере
Процедура ОбновитьСписокДоставкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|		ЗаданиеНаПеревозкуРейсОснования.Ссылка КАК Рейс,
	|		ЗаданиеНаПеревозкуРейсОснования.Документ КАК ЗаказНаДоставку
	|	ПОМЕСТИТЬ Рейсы
	|	ИЗ
	|		Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
	|	ГДЕ
	|		ЗаданиеНаПеревозкуРейсОснования.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		РегистрНакопленияЗаказыКДоставкеОстатки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|		СУММА(РегистрНакопленияЗаказыКДоставкеОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|	ПОМЕСТИТЬ ВТ_ЗаказыКДоставке
	|	ИЗ
	|		РегистрНакопления.ЗаказыКДоставке.Остатки КАК РегистрНакопленияЗаказыКДоставкеОстатки
	|	ГДЕ
	|		РегистрНакопленияЗаказыКДоставкеОстатки.КоличествоОстаток > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РегистрНакопленияЗаказыКДоставкеОстатки.ЗаказНаДоставку
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|		Обеспечение.Назначение КАК Назначение,
	|		Обеспечение.Назначение.Заказ КАК НазначениеЗаказ
	|	ПОМЕСТИТЬ ВТ_ЗаказыПодНазначение
	|	ИЗ
	|		(ВЫБРАТЬ
	|	ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
	|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК Поступило,
	|	СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) КАК Отгрузить,
	|	СУММА(РаспределениеЗапасов.Зарезервировано) КАК КОбеспечениюБезРезерва
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
	|		ПО (ЗапасыИПотребностиОстатки.Назначение = ТоварыКОтгрузкеОстатки.Назначение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО (ЗапасыИПотребностиОстатки.Назначение = РаспределениеЗапасов.Назначение)
	|ГДЕ
	|	НЕ ЗапасыИПотребностиОстатки.Назначение.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыИПотребностиОстатки.Назначение) КАК Обеспечение
	|	ГДЕ
	|		Обеспечение.Поступило > 0
	|		И Обеспечение.Поступило = Обеспечение.КОбеспечениюБезРезерва
	|		И НЕ Обеспечение.Назначение.Ссылка ЕСТЬ NULL
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ЗаказНаДоставкуКлиентуОснования.Документ КАК ДокументПродажи,
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка КАК ЗаказНаДоставку,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗаказНаДоставкуКлиентуОснования.Документ.Кассир.Ссылка, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ОтметкаКассы,
	|		НЕОПРЕДЕЛЕНО КАК ПодНазначение
	|	ПОМЕСТИТЬ ВТ_ОтметкаКассы
	|	ИЗ
	|		Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
	|	ГДЕ
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
	|				ИЗ
	|					ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
	|		И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказНаДоставкуКлиентуОснования.Документ,
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка,
	|		ВЫБОР
	|			КОГДА ЗаказНаДоставкуКлиентуОснования.Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
	|	ГДЕ
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
	|				ИЗ
	|					ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
	|		И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.ЧекККМ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказНаДоставкуКлиентуОснования.Документ,
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РеализацияТоваровУслуг.Кассир.Ссылка, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ,
	|		ЕСТЬNULL(ВТ_ЗаказыПодНазначение.Назначение, НЕОПРЕДЕЛЕНО)
	|	ИЗ
	|		Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ПО ЗаказНаДоставкуКлиентуОснования.Документ = РеализацияТоваровУслуг.ЗаказКлиента
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПодНазначение КАК ВТ_ЗаказыПодНазначение
	|			ПО ЗаказНаДоставкуКлиентуОснования.Документ = ВТ_ЗаказыПодНазначение.НазначениеЗаказ
	|	ГДЕ
	|		ЗаказНаДоставкуКлиентуОснования.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку
	|				ИЗ
	|					ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке)
	|		И ЗаказНаДоставкуКлиентуОснования.Документ ССЫЛКА Документ.ЗаказКлиента
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ВТ_ОтметкаКассы.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|		МИНИМУМ(ВТ_ОтметкаКассы.ОтметкаКассы) КАК ОтметкаКассы,
	|		ВТ_ОтметкаКассы.ПодНазначение КАК ПодНазначение
	|	ПОМЕСТИТЬ ВТ_ОтметкаКассыОбъединение
	|	ИЗ
	|		ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ОтметкаКассы.ЗаказНаДоставку,
	|		ВТ_ОтметкаКассы.ПодНазначение
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		СУММА(ИтогРеализацииИЧеки.КоличествоДокументовПродажи) КАК КоличествоДокументовПродажи,
	|		ИтогРеализацииИЧеки.ЗаказНаДоставку КАК ЗаказНаДоставку
	|	ПОМЕСТИТЬ ВТ_РеализацииИЧеки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи) КАК КоличествоДокументовПродажи,
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку КАК ЗаказНаДоставку
	|		ИЗ
	|			ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
	|		ГДЕ
	|			ВТ_ОтметкаКассы.ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи),
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку
	|		ИЗ
	|			ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы
	|		ГДЕ
	|			ВТ_ОтметкаКассы.ДокументПродажи ССЫЛКА Документ.ЧекККМ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОтметкаКассы.ДокументПродажи),
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВТ_ОтметкаКассы_Заказ.ДокументПродажи КАК ДокументПродажи,
	|				ВТ_ОтметкаКассы_Заказ.ЗаказНаДоставку КАК ЗаказНаДоставку
	|			ИЗ
	|				ВТ_ОтметкаКассы КАК ВТ_ОтметкаКассы_Заказ
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|					ПО ВТ_ОтметкаКассы_Заказ.ДокументПродажи = Реализация.Ссылка.ЗаказКлиента
	|			ГДЕ
	|				ВТ_ОтметкаКассы_Заказ.ДокументПродажи ССЫЛКА Документ.ЗаказКлиента) КАК ВТ_ОтметкаКассы
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ОтметкаКассы.ЗаказНаДоставку) КАК ИтогРеализацииИЧеки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ИтогРеализацииИЧеки.ЗаказНаДоставку
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказНаДоставкуКлиенту.ПрибытиеНаОтгрузку КАК ПрибытиеНаОтгрузку,
	|		ЗаказНаДоставкуКлиенту.ВремяДоставкиС КАК ВремяДоставкиС,
	|		ЗаказНаДоставкуКлиенту.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|		ЗаказНаДоставкуКлиенту.Вес КАК Вес,
	|		ЗаказНаДоставкуКлиенту.Объем КАК Объем,
	|		ЗаказНаДоставкуКлиенту.АдресДоставки КАК АдресДоставки,
	|		ЗаказНаДоставкуКлиенту.Широта КАК Широта,	
	|		ЗаказНаДоставкуКлиенту.Долгота КАК Долгота,		
	|		ЗаказНаДоставкуКлиенту.Ссылка КАК ЗаказНаДоставку,
	|		ЗаказНаДоставкуКлиенту.СуммаДокумента КАК Выручка,
	|		ЗаказНаДоставкуКлиенту.Партнер КАК Клиент,
	|		ЗаказНаДоставкуКлиенту.ТелефонКлиента КАК Телефон,
	|		ЗаказНаДоставкуКлиенту.ТелефонКлиентаНаВыгрузке КАК ТелефонНаВыгрузки,
	|		ЗаказНаДоставкуКлиенту.СтоимостьДоставки КАК ТранспортныеРасходы,
	|		ЗаказНаДоставкуКлиенту.Номер КАК Номер,
	|		ЗаказНаДоставкуКлиенту.Дата КАК Дата,
	|		ЗаказНаДоставкуКлиенту.Подразделение КАК Подразделение,
	|		ЗаказНаДоставкуКлиенту.ЭкспрессДоставка КАК ЭкспрессДоставка,
	|		ЗаказНаДоставкуКлиенту.ССайта КАК ССайта,
	|		ЗаказНаДоставкуКлиенту.Организация КАК Организация,
	|		ЗаказНаДоставкуКлиенту.ДоставкаСРазгрузкой КАК ДоставкаСРазгрузкой,
	|		ЗаказНаДоставкуКлиенту.СтоимостьДоставки КАК СтоимостьДоставки,
	|		ЗаказНаДоставкуКлиенту.СтоимостьДоставкиСНДС КАК СтоимостьДоставкиСНДС,
	|		ЗаказНаДоставкуКлиенту.ВидРазгрузки КАК ВидРазгрузки,
	|		ЗаказНаДоставкуКлиенту.МаксимальнаяДлина КАК МаксимальнаяДлина,
	|		ЗаказНаДоставкуКлиенту.ВидДоставки КАК ВидДоставки,
	|		ЗаказНаДоставкуКлиенту.НужнаИнкассация КАК НужнаИнкассация,
	|		ЗаказНаДоставкуКлиенту.НаправлениеДоставки КАК НаправлениеДоставки,
	|		ВЫБОР
	|			КОГДА ЗаказНаДоставкуКлиенту.Объем <> 0
	|				ТОГДА ЗаказНаДоставкуКлиенту.Вес / ЗаказНаДоставкуКлиенту.Объем
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесКОбъему,
	|		ЗаказНаДоставкуКлиенту.Инкассация КАК СуммаИнкассации,
	|		ЕСТЬNULL(ВТ_ОтметкаКассы.ОтметкаКассы, 0) КАК ОтметкаКассы,
	|		ВТ_ЗаказыКДоставке.ЗаказНаДоставку.Инкассация КАК Инкассация,
	|		ЕСТЬNULL(ВТ_РеализацииИЧеки.КоличествоДокументовПродажи, 0) КАК КоличествоДокументовПродажи,
	|		ВТ_ЗаказыКДоставке.ЗаказНаДоставку.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой,
	|		ВТ_ОтметкаКассы.ПодНазначение КАК ПодНазначение,
	|		ЗаказНаДоставкуКлиенту.ЕстьЗаявкаЛесЕГАИС КАК ЕстьЗаявкаЛесЕГАИС,
	|		ЗаказНаДоставкуКлиенту.Тариф КАК Тариф,
	|		ЗаказНаДоставкуКлиенту.Тариф.ГрузоподъемностьВТоннах КАК ТарифГрузоподъемностьВТоннах
	|	ИЗ
	|		ВТ_ЗаказыКДоставке КАК ВТ_ЗаказыКДоставке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
	|			ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ЗаказНаДоставкуКлиенту.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтметкаКассыОбъединение КАК ВТ_ОтметкаКассы
	|			ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ВТ_ОтметкаКассы.ЗаказНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииИЧеки КАК ВТ_РеализацииИЧеки
	|			ПО ВТ_ЗаказыКДоставке.ЗаказНаДоставку = ВТ_РеализацииИЧеки.ЗаказНаДоставку
	|	ГДЕ
	|		ИСТИНА
	|		И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение
	|		И ЗаказНаДоставкуКлиенту.ПрибытиеНаОтгрузку МЕЖДУ &Дата1 И &Дата2
	|		И ЗаказНаДоставкуКлиенту.ВидДоставки В(&мВидДоставки)
	|	   И ЗаказНаДоставкуКлиенту.Тариф В(&Тарифы)
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		ЭкспрессДоставка УБЫВ,
	|		ПрибытиеНаОтгрузку,
	|		ВремяДоставкиС";
	
	Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	
	Если ИспользоватьОтборПоТарифам Тогда
		Запрос.УстановитьПараметр("Тарифы", Тарифы.Выгрузить().ВыгрузитьКолонку("Тариф"));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.Тариф В(&Тарифы)", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Филиал) Тогда
		Запрос.УстановитьПараметр("Подразделение", Филиал);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение", "");
	КонецЕсли;
	                                                   
	Если ЗначениеЗаполнено(ВидДоставки) Тогда
		мВидДоставки = Новый Массив;
		мВидДоставки.Добавить(ВидДоставки);
		Если ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная Тогда
			мВидДоставки.Добавить(Перечисления.ВидыДоставокДоКлиента.Внутренняя);
		КонецЕсли;
		Запрос.УстановитьПараметр("мВидДоставки", мВидДоставки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗаказНаДоставкуКлиенту.ВидДоставки В(&мВидДоставки)", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ПулЗаказов.Загрузить(РезультатЗапроса.Выгрузить());
	
	Если ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная Тогда
		Выборка = Документы.ЗаказНаДоставкуКлиенту.ПолучитьКоличествоЗаказовНаДоставку(ТекущаяДата(), Филиал);
		сч = 1;
		Пока Выборка.Следующий() Цикл
			ИмяЭлемента = "Интервал" + сч;
			Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
				Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаИнтервалы);
			КонецЕсли;
			Элементы[ИмяЭлемента].Заголовок = Выборка.Наименование + ": " + Выборка.КолЗаказов;
			сч = сч + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ФункцииОбработки

&НаКлиенте
Процедура ПулЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	Док= Элементы.ПулЗаказов.ТекущиеДанные.ЗаказНаДоставку;
	Если Не Док.Пустая() Тогда 	
		ОткрытьФорму("Документ.ЗаказНаДоставкуКлиенту.ФормаОбъекта", Новый Структура("Ключ", Док));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОснования(Ссылка)
	мОснований= Новый Массив;
	Для Каждого стрОснования Из Ссылка.Основания Цикл
		мОснований.Добавить(стрОснования.Документ);
	КонецЦикла;
	Возврат мОснований;
КонецФункции

&НаКлиенте
Процедура РасчитатьИтоги()
	Ном= 1;
	ВесИтог= 0;
	ОбъемИтог= 0;
	МаксимальнаяДлинна= 0;
	Расстояние= 0;
	ВремяВПути= 0;
	ВремяРазгрузки= 0;
	СтоимостьДоставки= 0;
	СтоимостьДоставкиСНДС= 0;
	Для Каждого стрДоставки Из ЗаказыВРейс Цикл
		стрДоставки.НомерСтроки= Ном;
		Ном= Ном+1;
		ВесИтог= ВесИтог+стрДоставки.Вес;
		ОбъемИтог= ОбъемИтог+стрДоставки.Объем;
		МаксимальнаяДлинна= Макс(МаксимальнаяДлинна, стрДоставки.МаксимальнаяДлина);
		Расстояние= Расстояние+стрДоставки.Расстояние;
		ВремяВПути= ВремяВПути+стрДоставки.ВремяВПути;
		ВремяРазгрузки= ВремяРазгрузки+стрДоставки.ВремяРазгрузки;
		СтоимостьДоставки= СтоимостьДоставки+стрДоставки.СтоимостьДоставки;
		СтоимостьДоставкиСНДС= СтоимостьДоставкиСНДС+стрДоставки.СтоимостьДоставкиСНДС;
	КонецЦикла;
	Элементы.ЗаказыВРейсыВес.ТекстПодвала= ВесИтог;
	Элементы.ЗаказыВРейсыОбъем.ТекстПодвала= ОбъемИтог;
	Элементы.ЗаказыВРейсыМаксимальнаяДлина.ТекстПодвала= МаксимальнаяДлинна;
	Элементы.ЗаказыВРейсыРасстояние.ТекстПодвала= Расстояние;
	Элементы.ЗаказыВРейсыВремяВПути.ТекстПодвала= ВремяВПути;
	Элементы.ЗаказыВРейсыВремяРазгрузки.ТекстПодвала= ВремяРазгрузки;
	Элементы.ЗаказыВРейсСтоимостьДоставки.ТекстПодвала= СтоимостьДоставки;
	Элементы.ЗаказыВРейсСтоимостьДоставкиСНДС.ТекстПодвала= СтоимостьДоставкиСНДС;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУдалитьЗаказВРейс()
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	
	Если ТекущаяСтрока.Отметка Тогда
		НоваяСтрока= ЗаказыВРейс.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.НомерСтроки= ЗаказыВРейс.Количество();
		
		Если Карта Тогда
			ДобавитьТочкуНаКарту(НоваяСтрока.АдресДоставки, НоваяСтрока.Широта, НоваяСтрока.Долгота);
		КонецЕсли;
	Иначе
		Строки= ЗаказыВРейс.НайтиСтроки(Новый Структура ("ЗаказНаДоставку", ТекущаяСтрока.ЗаказНаДоставку));
		Для Каждого Строка Из Строки Цикл
			ЗаказыВРейс.Удалить(ЗаказыВРейс.Индекс(Строка));
		КонецЦикла;
		
	КонецЕсли;
	РасчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная") Тогда
		Элементы.ДокументыДоставкиНаправлениеДоставки.Видимость= Ложь;
		Элементы.ГруппаИнтервалы.Видимость= Истина;
	Иначе 
		Элементы.ДокументыДоставкиНаправлениеДоставки.Видимость= Истина;
		Элементы.ГруппаИнтервалы.Видимость= Ложь;
	КонецЕсли;
	
	Если Карта Тогда 
		Элементы.ГруппаПраво.Видимость= Истина;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Истина;
	Иначе
		Элементы.ГруппаПраво.Видимость= Ложь;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОформитьДокументы

&НаКлиенте
Процедура СоздатьРейс(Команда)
	Если СуществуютДублиСкладов() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьРейсНаКлиенте();
КонецПроцедуры

&НаСервере
Функция СуществуютДублиСкладов()
	Возврат Документы.ЗаданиеНаПеревозкуРейс.ПроверитьДублиСкладОтправитьСкладПолучатель(ЗаказыВРейс.Выгрузить( , "ЗаказНаДоставку").ВыгрузитьКолонку(0));
КонецФункции

&НаКлиенте
Процедура СоздатьРейсНаКлиенте()                                                       
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", МассивЗаказовВРейс());
	ПараметрыФормы.Вставить("ВызовИзОбработкиРабочееМестоМенеджераПоДоставке", Истина);
	
	ОткрытьФорму("Документ.ЗаданиеНаПеревозкуРейс.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция МассивЗаказовВРейс()
	Массив = РеквизитФормыВЗначение("ЗаказыВРейс").ВыгрузитьКолонку("ЗаказНаДоставку");
	Документы.ЗаданиеНаПеревозкуРейс.ИзменениеСтатусовДляДокументовОснований(Массив, Перечисления.СтатусыЗаказовНаДоставку.ВРейсе);            
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ЗаказыВРейсыПриИзменении(Элемент)
	РасчитатьИтоги();
КонецПроцедуры
#КонецОбласти

#Область КАРТА
#Область СобытияКарты
&НаКлиенте
Процедура ОбновитьТочкиНаКарте(Команда)
	для Каждого стрЗаказа Из ЗаказыВРейс Цикл
		Если Карта Тогда
			ДобавитьТочкуНаКарту(стрЗаказа.АдресДоставки, стрЗаказа.Широта, стрЗаказа.Долгота);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКарту(Команда)
		КартаДокумент= Элементы.КартаЯндекс.Документ;
		
		КартаДокумент.defaultView.initMap();
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьМаршрутRoute(Команда)
	Попытка
		КартаДокумент= Элементы.КартаЯндекс.Документ;
		
		КартаДокумент.defaultView.calcRouter();
	Исключение
		Сообщить("Ошибка сервияса геокодирования Яндекс");
	КонецПопытки;
КонецПроцедуры

#КонецОбласти


#Область ИнициализацияКарты
&НаКлиенте
Процедура ИнициализироватьКарту()
	ИнициализироватьКартуНаСервере()
КонецПроцедуры
&НаСервере
Процедура ИнициализироватьКартуНаСервере()
	Парам= Обработки.КартографическийИнтерфейсДоставка.ПолучитьСтруктуруПараметров();
	Парам.Вставить("ВидДоставки", ВидДоставки);
	Парам.Вставить("Филиал", Филиал);

	Обработки.КартографическийИнтерфейсДоставка.ИнициализироватьКартуТолькоЗоны(КартаЯндекс, Парам);
КонецПроцедуры
#КонецОбласти

#Область Геокодирование
&НаКлиентеНаСервере
Функция ПолучитьДанныеСКарты(ПеременныеКарты)
	ДанныеКарты= Новый Структура;
	ДанныеКарты.Вставить("Адрес", ПеременныеКарты.Address);
	ДанныеКарты.Вставить("РасчетПоРасстоянию", ПеременныеКарты.distanceCalc);
	ДанныеКарты.Вставить("СтоимостьПоРасстоянию", ПеременныеКарты.distanseCost);
	ДанныеКарты.Вставить("СтоимостьДоставки", ПеременныеКарты.price);
	ДанныеКарты.Вставить("Зона", ПеременныеКарты.zone);
КонецФункции

&НаКлиенте
Процедура ДобавитьТочкуНаКарту(АдресДоставки, Широта = 0, Долгота = 0)
	КартаДокумент= Элементы.КартаЯндекс.Документ;
	
	Если Широта <>  0 Тогда 
		КартаДокумент.defaultView.addMarkerOnCoords(Широта, Долгота, АдресДоставки);
	Иначе
		КартаДокумент.defaultView.addMarkerOnAdress(АдресДоставки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	ТекущаяСтрока=Элементы.ПулЗаказов.ТекущиеДанные;
	если ТекущаяСтрока<>Неопределено тогда
		если значениезаполнено(ТекущаяСтрока.ПодНазначение) тогда	
			СоздатьРеализациюСервер(ТекущаяСтрока.ПодНазначение);	
		иначе
			Сообщить("Документ основания не является обособленным. Создание реализации не требуется.");
		конецесли;
	конецесли;	
	
	
КонецПроцедуры

Процедура СоздатьРеализациюСервер(Назначение)
	УстановитьПривилегированныйРежим(истина);
	
	НачатьТранзакцию();
	
		ЗаказКлиента= Назначение.Заказ;
		
		Если Не ЗначениеЗаполнено(ЗаказКлиента.Кассир) Тогда
			Сообщить("На документ "+ЗаказКлиента+"не установлена отметка кассы.");
			возврат;
		КонецЕсли;
		
		ЗаказОбъект= ЗаказКлиента.ПолучитьОбъект();
		Для Каждого стрТовар Из ЗаказОбъект.Товары Цикл
			Если стрТовар.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			Если стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно ИЛИ стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.НеТребуется Тогда
				Продолжить;
			КонецЕсли;
			
			Если стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
				стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно;
			Иначе
				стрТовар.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
			КонецЕсли;
		КонецЦикла;
		Отказ=ложь;
		Попытка
			ЗаказОбъект.ДополнительныеСвойства.Вставить("Регламент", Истина);
			
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказОбъект.Ссылка, "Отгружен: "+ЗаказОбъект.Ссылка);
		Исключение
			Отказ= Истина;
			Текст= "Не удалось записать: "+ЗаказОбъект.Ссылка;
			АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказОбъект.Ссылка, Текст);
		//	ЗаписьЖурналаРегистрации("РегламентноеЗадание.АвтоматическоеСозданиеРеализацийПоЗаказам", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		КонецПопытки;
		
		Если Не Отказ Тогда
			Док= Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			ДанныеЗаполнения= Новый Структура;
			ДанныеЗаполнения.Вставить("ВариантОформленияПродажи", Перечисления.ВариантыОформленияПродажи);
			ДанныеЗаполнения.Вставить("ДокументОснование", ЗаказКлиента);
			ДанныеЗаполнения.Вставить("СкладОтгрузки", Неопределено);
			Док.Заполнить(ДанныеЗаполнения);
			
			Док.Склад= ЗаказКлиента.Склад;
			Док.Комментарий= "Создан автоматически по заказу с отметкой кассы";
			Док.Дата= ТекущаяДата();
			Док.Менеджер= ЗаказКлиента.Менеджер;
			Док.Магазин= ЗаказКлиента.Магазин;
			Если Док.Товары.Количество() > 0 Тогда 
				Попытка
					Док.СкидкиРассчитаны=истина;
					Док.Записать(РежимЗаписиДокумента.Проведение);
					АльтерраОбщегоНазначения.СообщитьПользователю(Док.Ссылка, "Создан: "+Док.Ссылка);
				Исключение
					Отказ= Истина;
					Текст= "Не удалось записать: "+Док.Ссылка;
					АльтерраОбщегоНазначения.СообщитьПользователю(Док.Ссылка, Текст);
				КонецПопытки;
				
				Если Не Отказ Тогда
					НужнаЗаявка= Документы.ЗаявкаВЕГАИСЛес.ПроверкаНаличияЗаявкиНаСоответствующийДокументПродажи(Док.Ссылка);
					
					Если НужнаЗаявка Тогда
						ДокЗаявка= Документы.ЗаявкаВЕГАИСЛес.СоздатьДокумент();
						ДокЗаявка.Дата= ТекущаяДата();
						ДокЗаявка.Заполнить(Док.Ссылка);
						Попытка
							ДокЗаявка.Записать(РежимЗаписиДокумента.Проведение);
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЗаявка.Ссылка, "Создан: "+ДокЗаявка.Ссылка);
						Исключение
							Отказ= Истина;
							Текст= "Не удалось записать: "+ДокЗаявка.Ссылка;
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЗаявка.Ссылка, Текст);
						КонецПопытки;
					КонецЕсли;
					
					Если Док.ИспользуетсяДоговор Тогда
						ДокЛистСогласования = Документы.ЛистСогласования.СоздатьДокумент();
						ДокЛистСогласования.Дата = ТекущаяДата();
						ДокЛистСогласования.Заполнить(Док.Ссылка);
						ДокЛистСогласования.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления;
						ДокЛистСогласования.Проблема = Справочники.Проблемы.НайтиПоКоду("000000016");//Реализация (отсутствие оригинала/некорректное оформление -ПАКЕТ ДОКУМЕНТОВ)
						
						Если Док.Партнер<>Справочники.Партнеры.ПустаяСсылка() и Док.Партнер.ОсновнойМенеджер<>Справочники.Пользователи.ПустаяСсылка() и СтрНайти(Док.Партнер.ОсновнойМенеджер.Наименование, "Сектор выписки")=0 Тогда
							ДокЛистСогласования.ОсновнойМенеджер = Док.Партнер.ОсновнойМенеджер;
						Иначе
							ДокЛистСогласования.ОсновнойМенеджер = Док.ЗаказКлиента.Менеджер;
						КонецЕсли;
						ДокЛистСогласования.Согласовано = Справочники.ПользователиДляСогласованияЛистов.НайтиПоКоду("000000035");//Тупицына Оксана Геннадьевна
						ДокЛистСогласования.Согласован = Истина;
						ДокЛистСогласования.Комментарий = "Создан автоматически по заказу с отметкой кассы";
						Попытка
							ДокЛистСогласования.Записать(РежимЗаписиДокумента.Проведение);
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЛистСогласования.Ссылка, "Создан: "+ДокЛистСогласования.Ссылка);
						Исключение
							Отказ = Истина;
							Текст = "Не удалось записать: " + ДокЛистСогласования.Ссылка;
							АльтерраОбщегоНазначения.СообщитьПользователю(ДокЛистСогласования.Ссылка, Текст);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	Если Отказ Тогда 
		ОтменитьТранзакцию();
		Текст= "Не удалось установить вариант обеспечение отгрузить: "+ЗаказКлиента;
		АльтерраОбщегоНазначения.СообщитьПользователю(ЗаказКлиента, Текст);
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	

КонецПроцедуры
#КонецОбласти
#КонецОбласти