&НаСервере
Функция ПроверитьЗанятостьПатерностера()    
	Возврат РегистрыСведений.Патерностеры.ПроверитьЗанятостьПатерностера(Запись.Склад, Запись.Номенклатура, Запись.Характеристика, Запись.Патерностер, ТекущаяДата());	
КонецФункции
 
&НаКлиенте
Процедура ПослеЗакрытияВопросаЗанятыйПатерностер(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.ОК Тогда 
		ЗаписатьПатерностерВРегистр();
		ЭтаФорма.Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда   
		Запись.Патерностер = Неопределено;
	КонецЕсли;	
 
КонецПроцедуры   

&НаКлиенте
Процедура ПатерностерПриИзменении(Элемент) 
	Если ЗначениеЗаполнено(Запись.Патерностер)  Тогда 
		ЗанятостьПатерностера = ПроверитьЗанятостьПатерностера(); 
		Если  ЗанятостьПатерностера.Занятость = 1  Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗанятыйПатерностер",ЭтотОбъект,ЗанятостьПатерностера.Характеристика);
			ПоказатьВопрос(Оповещение,СтрШаблон("На данном валу уже хранится - %1. Заменить на данном валу - 'Ок', для выбора свободного вала, нажмите - 'Отмена'. Свободные валы - %2",ЗанятостьПатерностера.Номенклатура,ЗанятостьПатерностера.СвободныеВалы),РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.ОК);
		КонецЕсли;   
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Процедура ЗаписатьПатерностерВРегистр()
	РегистрыСведений.Патерностеры.ЗаписатьПатерностер(Запись.Склад,Запись.Номенклатура,Запись.Характеристика,Запись.Патерностер, ТекущаяДата());
КонецПроцедуры	

