#Область ПроектЧеки

&Вместо("Рассчитать")
Функция Док_Рассчитать(Объект, ВходныеПараметры) Экспорт
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекСамообслуживания") Тогда
		// Альтерра ПроектЧеки
		//РезультатРасчета = РассчитатьПоЧекуККМ(Объект, ВходныеПараметры);
		Входныепараметры = Новый Структура("РеализацияСверхЗаказа",ложь);
		Входныепараметры.Вставить("ВосстанавливатьУправляемыеСкидки",ложь);
		Входныепараметры.Вставить("ТолькоПредварительныйРасчет",ложь);
		Входныепараметры.Вставить("ПрименятьКОбъекту",истина);
		РезультатРасчета = РассчитатьПоРеализацииТоваровУслуг(Объект, ВходныеПараметры);
		//-
	Иначе
		РезультатРасчета = ПродолжитьВызов(Объект, ВходныеПараметры);		
	КонецЕсли;

	Возврат РезультатРасчета; 
	
КонецФункции

#КонецОбласти

#Область Прайс

Функция РассчитатьДляПрайса(ПараметрыРасчета, ВходныеПараметры) Экспорт				
	
	УстановитьПривилегированныйРежим(Истина);
	Индекс = 0;
	Для Каждого СтрокаТЧ Из параметрыРасчета.Товары Цикл
		Индекс = Индекс + 1;
		СтрокаТЧ.КлючСвязи = Индекс;
	КонецЦикла;        
	ПримененныеСкидкиНаценки = РассчитатьДеревоСкидокНаценокДляПрайса(ПараметрыРасчета, ВходныеПараметры, истина);
	Возврат ПримененныеСкидкиНаценки;
	
КонецФункции

#КонецОбласти

Процедура ОтразитьДетализациюБонусныхБаллов(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДетализацияБонусныхБаллов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ДетализацияБонусныхБаллов.Записывать = Истина;
	Движения.ДетализацияБонусныхБаллов.Загрузить(Таблица);

КонецПроцедуры

//Дополнен список входных параметров 
Функция РассчитатьДеревоСкидокНаценокДляПрайса(ПараметрыРасчета, ВходныеПараметры, ПреобразовыватьПараметры = Ложь)

	ИспользоватьЦеновыеГруппы = ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы");

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	ОсновныеТаблицы = ПакетЗапросовСоздать();
	ОсновныеТаблицы.Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	УдалятьВременныеТаблицы = Ложь;
	//ПреобразовыватьПараметры = Ложь;
	Для Каждого КлючИЗначение Из ПараметрыРасчета Цикл
		ОсновныеТаблицы.Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;

	ПакетЗапросовВставитьЗапросВПакет(ЗапросВременнаяТаблицаТовары(ПараметрыРасчета, ОсновныеТаблицы),
	ОсновныеТаблицы,
	Неопределено,
	УдалятьВременныеТаблицы,
	ПреобразовыватьПараметры);

	ПакетЗапросовВставитьЗапросВПакет(ЗапросКурсыВалют(ПараметрыРасчета),              ОсновныеТаблицы, "КурсыВалют",              УдалятьВременныеТаблицы, ПреобразовыватьПараметры);
	ПакетЗапросовВставитьЗапросВПакет(ЗапросСкидкиНаценки(ПараметрыРасчета),           ОсновныеТаблицы, "СкидкиНаценки",           УдалятьВременныеТаблицы, ПреобразовыватьПараметры);
	ПакетЗапросовВставитьЗапросВПакет(ЗапросТЧУсловияПредоставления(ПараметрыРасчета), ОсновныеТаблицы, "ТЧУсловияПредоставления", УдалятьВременныеТаблицы, ПреобразовыватьПараметры);
	ПакетЗапросовВставитьЗапросВПакет(ЗапросУсловияПредоставления(ПараметрыРасчета),   ОсновныеТаблицы, "УсловияПредоставления",   УдалятьВременныеТаблицы, ПреобразовыватьПараметры);
	// Для Подарков
	ПакетЗапросовВставитьЗапросВПакет(ЗапросТоварыПоСегментам(ПараметрыРасчета),       ОсновныеТаблицы, "ТоварыПоСегментам",       УдалятьВременныеТаблицы, ПреобразовыватьПараметры);
	// Для Специальной цены
	ПакетЗапросовВставитьЗапросВПакет(ЗапросЦеныНоменклатуры(ПараметрыРасчета),        ОсновныеТаблицы, "ЦеныНоменклатуры",        УдалятьВременныеТаблицы, ПреобразовыватьПараметры);
	Если ИспользоватьЦеновыеГруппы Тогда
		ПакетЗапросовВставитьЗапросВПакет(
		ЗапросСкидкиНаценкиПоЦеновымГруппам(ПараметрыРасчета),
		ОсновныеТаблицы,
		"УточненияЗначенияСкидкиНаценкиПоЦеновымГруппам",
		УдалятьВременныеТаблицы, ПреобразовыватьПараметры);
	КонецЕсли;

	ПакетЗапросовВыполнить(ОсновныеТаблицы);

	КурсыВалют = ПакетЗапросовРезультатПоИмени("КурсыВалют", ОсновныеТаблицы).Выгрузить();
	Для Каждого СтрокаТЧ Из КурсыВалют Цикл
		Если СтрокаТЧ.КурсЧислитель = 0 Тогда
			ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Для валюты %1 не установлен курс.
			|Перед расчетом скидок (наценок) курсы валют должны быть установлены.'"), СтрокаТЧ.Валюта);
		КонецЕсли;
	КонецЦикла;

	Условия               = ПакетЗапросовРезультатПоИмени("ТЧУсловияПредоставления", ОсновныеТаблицы).Выгрузить();
	УсловияПредоставления = ПакетЗапросовРезультатПоИмени("УсловияПредоставления", ОсновныеТаблицы).Выгрузить();
	ДеревоСкидок          = СформироватьДеревоСкидок(ОсновныеТаблицы);

	ДеревоСкидок.Колонки.Добавить("Рассчитано", Новый ОписаниеТипов("Булево"));

	Скидки = ДеревоСкидок.Строки.НайтиСтроки(Новый Структура("ЭтоГруппа", Ложь), Истина);

	ТаблицаВыполненныеУсловия = ВыполнитьЗапросыУсловийПредоставления(
	УсловияПредоставления,
	Скидки,
	ПараметрыРасчета,
	МенеджерВременныхТаблиц);
	ПроверитьУсловияРекурсивно(ДеревоСкидок, Скидки, Условия, ТаблицаВыполненныеУсловия);

	Если ВходныеПараметры.ТолькоПредварительныйРасчет Тогда

		ВозвращаемыеДанные = Новый Структура;
		ВозвращаемыеДанные.Вставить("ДеревоСкидок",         ДеревоСкидок);
		ВозвращаемыеДанные.Вставить("ТаблицаСкидкиНаценки", ПустаяТаблицаСкидкиНаценки());
		ВозвращаемыеДанные.Вставить("ПараметрыРасчета",     ПараметрыРасчета);

		Возврат ВозвращаемыеДанные;

	КонецЕсли;

	ПараметрыРасчета.Вставить("ИспользоватьЦеновыеГруппы", ИспользоватьЦеновыеГруппы);
	ПараметрыРасчета.Вставить("ЦеныНоменклатуры",      ПакетЗапросовРезультатПоИмени("ЦеныНоменклатуры",  ОсновныеТаблицы).Выгрузить());
	ПараметрыРасчета.Вставить("ТоварыПоСегментам",     ПакетЗапросовРезультатПоИмени("ТоварыПоСегментам", ОсновныеТаблицы).Выгрузить());
	ПараметрыРасчета.Вставить("УсловияПредоставления", ПакетЗапросовРезультатПоИмени("УсловияПредоставления",         ОсновныеТаблицы).Выгрузить());

	ПараметрыРасчета.Вставить("ПримененныеСкидкиУмножение", ПустаяТаблицаСкидкиНаценки());
	ПараметрыРасчета.Вставить("ВыполненныеУсловия",         ТаблицаВыполненныеУсловия);
	ПараметрыРасчета.Вставить("КурсыВалют",                 КурсыВалют);

	ПараметрыРасчета.Вставить("ПустаяТаблицаСкидокСРасшифровкой", ПустаяТаблицаСкидокСРасшифровкой());
	ПараметрыРасчета.Вставить("ПустаяТаблицаРасшифровка",         ПустаяТаблицаРасшифровка());
	ПараметрыРасчета.Вставить("ПустаяТаблицаСкидкиНаценки",       ПустаяТаблицаСкидкиНаценки());

	ПараметрыРасчета.Вставить("КешУмножениеГруппы", Новый Соответствие);
	ПараметрыРасчета.Вставить("КешУмножениеСуммы",  Новый Соответствие);

	Если ИспользоватьЦеновыеГруппы Тогда

		ПараметрыРасчета.Вставить("УточненияЗначенияСкидкиНаценки", Новый Соответствие);

		УточненияЗначенияСкидкиНаценкиПоЦеновымГруппам = ПакетЗапросовРезультатПоИмени(
		"УточненияЗначенияСкидкиНаценкиПоЦеновымГруппам", ОсновныеТаблицы).Выгрузить();

		ТекущаяСкидка = Неопределено;
		Уточнения = Неопределено;

		Для Каждого СтрокаТЧ Из УточненияЗначенияСкидкиНаценкиПоЦеновымГруппам Цикл
			Если ТекущаяСкидка <> СтрокаТЧ.СкидкаНаценка Тогда
				Если ТекущаяСкидка <> Неопределено Тогда
					ПараметрыРасчета.УточненияЗначенияСкидкиНаценки.Вставить(ТекущаяСкидка, Уточнения);
				КонецЕсли;
				Уточнения = ПустаяТаблицаУточненияЗначенияСкидкиНаценки();
				ТекущаяСкидка = СтрокаТЧ.СкидкаНаценка;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Уточнения.Добавить(), СтрокаТЧ);
		КонецЦикла;

		Если ТекущаяСкидка <> Неопределено Тогда
			ПараметрыРасчета.УточненияЗначенияСкидкиНаценки.Вставить(ТекущаяСкидка, Уточнения);
		КонецЕсли;

	КонецЕсли;

	РезультатРасчета = РассчитатьДеревоСкидок(ДеревоСкидок, ПараметрыРасчета);

	Возврат РезультатРасчета;

КонецФункции

&ИзменениеИКонтроль("РассчитатьПоРеализацииТоваровУслугПоЗаказу")
Функция Док_РассчитатьПоРеализацииТоваровУслугПоЗаказу(Объект)

	Объект.СкидкиНаценки.Очистить();
	Объект.НачислениеБонусныхБаллов.Очистить();
	
	ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(Объект, "Товары");
	
	ИспользоватьБонусныеПрограммыЛояльности = ПолучитьФункциональнуюОпцию("ИспользоватьБонусныеПрограммыЛояльности");

	ДанныеПоЗаказу = СкидкиНаценкиЗаполнениеСервер.СкидкиНаценкиПоЗаказу(Объект);
	СкидкиНаценкиЗаказа = ДанныеПоЗаказу.СкидкиНаценкиЗаказа;
	ТаблицаТоваров = ДанныеПоЗаказу.ТаблицаТоваров;
	
	РазницаДатМеждуЗаказомИРеализациейВСекундах = 0;
	
	Если ИспользоватьБонусныеПрограммыЛояльности Тогда
	
		НачислениеБонусныхБалловЗаказа = ДанныеПоЗаказу.НачислениеБонусныхБалловЗаказа;
		
		Если ЗначениеЗаполнено(Объект.ЗаказКлиента)
			И (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.АктВыполненныхРабот")
				Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) Тогда
			ЗаказКлиентаДата = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента, "Дата"));
			ДокументРеализацииДата = НачалоДня(Объект.Дата);
			РазницаДатМеждуЗаказомИРеализациейВСекундах = ДокументРеализацииДата - ЗаказКлиентаДата;
		КонецЕсли;
		
		БонуснаяПрограммаЛояльности = Новый Структура("БонуснаяПрограммаЛояльности, 
			|ВалютаКонвертацииБонусов, 
			|КурсКонвертацииБонусовВВалюту,
			|СтруктураКурсовВалютыКонвертации,
			|СтруктураКурсовВалютыДокумента");
		
		БонусныеПрограммыЛояльности = НачислениеБонусныхБалловЗаказа.Скопировать();
		
		БонусныеПрограммыЛояльности.Свернуть("БонуснаяПрограммаЛояльности, 
			|ВалютаКонвертацииБонусов, 
			|КурсКонвертацииБонусовВВалюту");
		
		Если БонусныеПрограммыЛояльности.Количество() > 1 Тогда
			
			ИспользоватьБонусныеПрограммыЛояльности = Ложь;
			
			ТекстОшибки = НСтр("ru='Обнаружены разные программы лояльности для начисления бонусных баллов. Заказы 
				|с разными бонусными программами лояльности не могут быть отгружены в одном документе.'");
			ВызватьИсключение ТекстОшибки;
		ИначеЕсли БонусныеПрограммыЛояльности.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(БонуснаяПрограммаЛояльности, БонусныеПрограммыЛояльности[0]);
			
			Если Объект.Валюта <> БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов Тогда
				
				БонуснаяПрограммаЛояльности.СтруктураКурсовВалютыКонвертации = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов, 
					ТекущаяДатаСеанса(),
					ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Объект.Организация));
				
				БонуснаяПрограммаЛояльности.СтруктураКурсовВалютыДокумента = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(Объект.Валюта, 
					ТекущаяДатаСеанса(),
					ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Объект.Организация));
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	НомерОбрабатываемойСтроки = 0;
	ПредыдущийКодСтроки       = 0;
	ПредыдущийЗаказ           = Неопределено;
	ОбрабатываемыеСтроки      = Новый Массив;
	
	СтруктураДействий = Новый Структура;
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
		Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
	
	Для Каждого ВыборкаТовары Из ТаблицаТоваров Цикл
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ЗаказКлиента, КодСтроки", ВыборкаТовары.ЗаказКлиента, ВыборкаТовары.КодСтроки));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПредыдущийКодСтроки = ВыборкаТовары.КодСтроки И ПредыдущийЗаказ = ВыборкаТовары.ЗаказКлиента Тогда
			НомерОбрабатываемойСтроки = НомерОбрабатываемойСтроки + 1;
		Иначе
			НомерОбрабатываемойСтроки = 0;
		КонецЕсли;
		
		СтрокаТаблицы = НайденныеСтроки[НомерОбрабатываемойСтроки];
		
		ПредыдущийКодСтроки = ВыборкаТовары.КодСтроки;
		ПредыдущийЗаказ     = ВыборкаТовары.ЗаказКлиента;
		
		СписокПолей = "ПроцентАвтоматическойСкидки, ПроцентРучнойСкидки";
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаТовары, СписокПолей);
		
		Если ВыборкаТовары.СуммаАвтоматическойСкидки = Null или ВыборкаТовары.СуммаРучнойСкидки = Null Тогда
			ТекстОшибки = НСтр("ru='Возникла проблемная ситуация при переносе скидок из заказа. Возможно не задан курс для валюты ""%Валюта%""'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Валюта%", Объект.ВалютаВзаиморасчетов);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		ТекСуммаАвтоматическойСкидки = Окр(
				ВыборкаТовары.ЗаказСуммаАвтоматическойСкидки 
				* (ВыборкаТовары.РеализацияКоличество / ВыборкаТовары.ЗаказКоличество) 
				* ВыборкаТовары.ВалютаКоэффициентПересчета, 
			2);
		ТекСуммаРучнойСкидки = Окр(
				ВыборкаТовары.ЗаказСуммаРучнойСкидки 
				* (ВыборкаТовары.РеализацияКоличество / ВыборкаТовары.ЗаказКоличество) 
				* ВыборкаТовары.ВалютаКоэффициентПересчета, 
			2);
		ТекСуммаНачисленныхБонусныхБалловВВалюте = Окр(
				ВыборкаТовары.ЗаказСуммаНачисленныхБонусныхБалловВВалюте 
				* (ВыборкаТовары.РеализацияКоличество / ВыборкаТовары.ЗаказКоличество) 
				* ВыборкаТовары.ВалютаКоэффициентПересчета, 
			2);
		ТекСуммаБонусныхБалловКСписаниюВВалюте = Окр(
				ВыборкаТовары.ЗаказСуммаБонусныхБалловКСписаниюВВалюте 
				* (ВыборкаТовары.РеализацияКоличество / ВыборкаТовары.ЗаказКоличество) 
				* ВыборкаТовары.ВалютаКоэффициентПересчета, 
			2);
		ТекСуммаБонусныхБалловКСписанию = Окр(
				ВыборкаТовары.ЗаказСуммаБонусныхБалловКСписанию 
				* (ВыборкаТовары.РеализацияКоличество / ВыборкаТовары.ЗаказКоличество), 
			2);
		
		СтрокаТаблицы.СуммаАвтоматическойСкидки 				= ТекСуммаАвтоматическойСкидки;
		СтрокаТаблицы.СуммаРучнойСкидки 						= ТекСуммаРучнойСкидки;
		СтрокаТаблицы.СуммаНачисленныхБонусныхБалловВВалюте 	= ТекСуммаНачисленныхБонусныхБалловВВалюте;
		СтрокаТаблицы.СуммаБонусныхБалловКСписаниюВВалюте 		= ТекСуммаБонусныхБалловКСписаниюВВалюте;
		СтрокаТаблицы.СуммаБонусныхБалловКСписанию 				= ТекСуммаБонусныхБалловКСписанию;
		
		ОбрабатываемыеСтроки.Добавить(СтрокаТаблицы);
		
		СуммаКРаспределению = СтрокаТаблицы.СуммаАвтоматическойСкидки + СтрокаТаблицы.СуммаНачисленныхБонусныхБалловВВалюте;
		
		Если СтрокаТаблицы.КлючСвязи <> 0 Тогда
		
			НайденныеСтроки = СкидкиНаценкиЗаказа.НайтиСтроки(Новый Структура("ЗаказКлиента, КлючСвязи", СтрокаТаблицы.ЗаказКлиента, ВыборкаТовары.КлючСвязи));
			Если НайденныеСтроки.Количество() <> 0 Тогда
				Для Каждого СтрокаСкидкиЗаказа Из НайденныеСтроки Цикл
					
					СтрокаСкидки 			= Объект.СкидкиНаценки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСкидки, СтрокаСкидкиЗаказа);
					СтрокаСкидки.КлючСвязи	= СтрокаТаблицы.КлючСвязи;
 					СтрокаСкидки.Сумма 		= (ВыборкаТовары.РеализацияКоличество / ВыборкаТовары.ЗаказКоличество) * СтрокаСкидки.Сумма;
					
					СуммаКРаспределению 	= СуммаКРаспределению - СтрокаСкидки.Сумма;
					
				КонецЦикла;
				Если СуммаКРаспределению <> 0 Тогда
					СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
			
		Если ИспользоватьБонусныеПрограммыЛояльности Тогда
			СуммаКРаспределению = СтрокаТаблицы.СуммаНачисленныхБонусныхБалловВВалюте;

			Если ЗначениеЗаполнено(БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов)
				И Объект.Валюта <> БонуснаяПрограммаЛояльности.ВалютаКонвертацииБонусов Тогда
				
				СуммаКРаспределению = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
					СуммаКРаспределению,
					БонуснаяПрограммаЛояльности.СтруктураКурсовВалютыДокумента,
					БонуснаяПрограммаЛояльности.СтруктураКурсовВалютыКонвертации);
					
			КонецЕсли;
			
			Если СуммаКРаспределению <> 0
				И ЗначениеЗаполнено(БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту) Тогда
				
				СуммаКРаспределению = СуммаКРаспределению / БонуснаяПрограммаЛояльности.КурсКонвертацииБонусовВВалюту;
			КонецЕсли;
			
			Если СтрокаТаблицы.КлючСвязи <> 0 Тогда
			
				НайденныеСтроки = НачислениеБонусныхБалловЗаказа.НайтиСтроки(Новый Структура("ЗаказКлиента, КлючСвязи", СтрокаТаблицы.ЗаказКлиента, ВыборкаТовары.КлючСвязи));
				Если НайденныеСтроки.Количество() <> 0 Тогда
					
					Для Каждого СтрокаБонусныеБаллыЗаказа Из НайденныеСтроки Цикл
						
						СтрокаБонусныеБаллы = Объект.НачислениеБонусныхБаллов.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаБонусныеБаллы, СтрокаБонусныеБаллыЗаказа);
						СтрокаБонусныеБаллы.СуммаБонусныхБаллов = (ВыборкаТовары.РеализацияКоличество / ВыборкаТовары.ЗаказКоличество) * СтрокаБонусныеБаллы.СуммаБонусныхБаллов;
						
						СуммаКРаспределению = СуммаКРаспределению - СтрокаБонусныеБаллы.СуммаБонусныхБаллов;
						
						Если РазницаДатМеждуЗаказомИРеализациейВСекундах > 0 Тогда
							СтрокаБонусныеБаллы.ДатаНачисления = СтрокаБонусныеБаллы.ДатаНачисления
								+ РазницаДатМеждуЗаказомИРеализациейВСекундах;
							Если ЗначениеЗаполнено(СтрокаБонусныеБаллы.ДатаСписания) Тогда
								СтрокаБонусныеБаллы.ДатаСписания = СтрокаБонусныеБаллы.ДатаСписания
									+ РазницаДатМеждуЗаказомИРеализациейВСекундах;
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;
					#Удаление
					Если СуммаКРаспределению <> 0 Тогда
						СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
					КонецЕсли;
					#КонецУдаления
					#Вставка
					Если СуммаКРаспределению <> 0 И СтрокаСкидки <> Неопределено Тогда
						СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
					КонецЕсли;
					#КонецВставки
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Товары,
		КэшированныеЗначения);
	
	Объект.СкидкиРассчитаны = Истина;
	
	Возврат Новый Структура;

КонецФункции

&ИзменениеИКонтроль("ПрименитьРезультатРасчетаПоБонуснымБаллам")
Процедура Док_ПрименитьРезультатРасчетаПоБонуснымБаллам(Объект, 
													ИмяТЧ, 
													ПримененныеСкидкиНаценки, 
													ИспользоватьОплатуБонуснымиБаллами = Ложь, 
													РеализацияСверхЗаказа = Ложь)
																									

																										
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
    #Удаление
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		ТаблицаБонусныеБаллы = Объект.БонусныеБаллы;
		ИспользоватьКлючСвязи = Ложь;
	Иначе
		ТаблицаБонусныеБаллы = Объект.НачислениеБонусныхБаллов;
		ИспользоватьКлючСвязи = Истина;
	КонецЕсли;   
    #КонецУдаления	   

    #Вставка    
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекСамообслуживания") Тогда
		ТаблицаБонусныеБаллы = Объект.БонусныеБаллы;
		ИспользоватьКлючСвязи = Ложь;
	Иначе
		ТаблицаБонусныеБаллы = Объект.НачислениеБонусныхБаллов;
		ИспользоватьКлючСвязи = Истина;
	КонецЕсли;
   #КонецВставки

	Если Объект.Партнер = Справочники.Партнеры.РозничныйПокупатель 
		Или Не РеализацияСверхЗаказа Тогда
		
		Если ТаблицаБонусныеБаллы.Количество() > 0 Тогда
			ТаблицаБонусныеБаллы.Очистить();
		КонецЕсли;
		
		Если Объект.Партнер = Справочники.Партнеры.РозничныйПокупатель Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	НачисленныеБонусныеБаллы = БонусныеБаллыСервер.ТаблицаБонусныеБаллы(ПримененныеСкидкиНаценки.ТаблицаСкидкиНаценки, Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КартыЛояльности.Владелец.БонуснаяПрограммаЛояльности.НеНачислятьБаллыПриОплатеБонусами, Ложь) КАК НеНачислятьБаллыПриОплатеБонусами
	|ИЗ
	|	Справочник.КартыЛояльности КАК КартыЛояльности
	|ГДЕ
	|	КартыЛояльности.Ссылка = &КартаЛояльности";
	
	Запрос.УстановитьПараметр("КартаЛояльности", Объект.КартаЛояльности);
	
	ИспользуетсяОдновременноеСписаниеИНачисление = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИспользуетсяОдновременноеСписаниеИНачисление = Не Выборка.НеНачислятьБаллыПриОплатеБонусами;
	КонецЕсли;
	
	БонусныеБаллы = Новый ТаблицаЗначений;
	Если ИспользоватьКлючСвязи Тогда
		БонусныеБаллы.Колонки.Добавить("КлючСвязи",                   Новый ОписаниеТипов("Число"));
	КонецЕсли;
	БонусныеБаллы.Колонки.Добавить("БонуснаяПрограммаЛояльности", Новый ОписаниеТипов("СправочникСсылка.БонусныеПрограммыЛояльности"));
	БонусныеБаллы.Колонки.Добавить("ДатаНачисления",              ОбщегоНазначенияУТ.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	БонусныеБаллы.Колонки.Добавить("ДатаСписания",                ОбщегоНазначенияУТ.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	БонусныеБаллы.Колонки.Добавить("СуммаБонусныхБаллов",         ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		Если РеализацияСверхЗаказа И СтрокаТЧ.КодСтроки > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ИспользоватьОплатуБонуснымиБаллами И (ИспользуетсяОдновременноеСписаниеИНачисление ИЛИ СтрокаТЧ.СуммаБонусныхБалловКСписанию = 0)
			Или Не ИспользоватьОплатуБонуснымиБаллами Тогда 
			
			Начислено = 0;
			НайденныеСтроки = НачисленныеБонусныеБаллы.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаТЧ.КлючСвязи));
			Для Каждого СтрокаНачислениеБаллов Из НайденныеСтроки Цикл
				
				НоваяСтрока = БонусныеБаллы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНачислениеБаллов);
				
				// Конвертация начисленных баллов из валюты документа в баллы.
				НоваяВалюта = СтрокаНачислениеБаллов.ВалютаКонвертацииБонусов;
				СтруктураКурсовНовойВалюты = ПримененныеСкидкиНаценки.ПараметрыРасчета.КурсыВалют.Найти(НоваяВалюта, "Валюта");
				ТекущаяВалюта = Объект.Валюта;
				СтруктураКурсовТекущейВалюты = ПримененныеСкидкиНаценки.ПараметрыРасчета.КурсыВалют.Найти(ТекущаяВалюта, "Валюта");
				
				Начислено = Начислено + СтрокаНачислениеБаллов.СуммаБонусныхБаллов;
				
				НоваяСтрока.СуммаБонусныхБаллов = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(НоваяСтрока.СуммаБонусныхБаллов,
					СтруктураКурсовТекущейВалюты,
					СтруктураКурсовНовойВалюты) / СтрокаНачислениеБаллов.КурсКонвертацииБонусовВВалюту;
				
			КонецЦикла;
			
			СтрокаТЧ.СуммаНачисленныхБонусныхБалловВВалюте = Начислено;
			
		Иначе
			
			СтрокаТЧ.СуммаНачисленныхБонусныхБалловВВалюте = 0;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ИспользоватьКлючСвязи Тогда
		БонусныеБаллы.Свернуть("КлючСвязи, БонуснаяПрограммаЛояльности, ДатаНачисления, ДатаСписания", "СуммаБонусныхБаллов");
	Иначе
		БонусныеБаллы.Свернуть("БонуснаяПрограммаЛояльности, ДатаНачисления, ДатаСписания", "СуммаБонусныхБаллов");
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из БонусныеБаллы Цикл
		НоваяСтрока = ТаблицаБонусныеБаллы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
												
	
КонецПроцедуры
	
	
&После("ПодготовитьДанныеОВыбранныхУправляемыхСкидках")
Процедура Док_ПодготовитьДанныеОВыбранныхУправляемыхСкидках(Объект, ПараметрыРасчета, ВходныеПараметры)
	Если ДопМодуль.ЕстьСвойствоОбъекта(Объект, "РаспределитьТранспортныеДистрибуция") Тогда 
		Если Объект.РаспределитьТранспортныеДистрибуция Тогда
		    НаценкаНаДоставку = Справочники.СкидкиНаценки.НайтиПоНаименованию("+1% (доставка организацией)"); 
			Если НЕ НаценкаНаДоставку.Пустая() Тогда 
		        ЭлНаценкаНаДоставку = ПараметрыРасчета.СкидкиНаценки.Найти(НаценкаНаДоставку);
				ПараметрыРасчета.СкидкиНаценки.Удалить(ЭлНаценкаНаДоставку);
	        КонецЕсли; 	 		
	    КонецЕсли;
	КонецЕсли;
КонецПроцедуры
	
