#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Удержания
	Движения.Удержания.Записывать = Истина;
	Движение = Движения.Удержания.Добавить();
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;
	Движение.Удержание = Удержание;
	Движение.Проблема = Неопределено;
	Движение.ДатаНачалаДействия = ДатаНачалаДействия;
	Движение.ДатаОкончанияДействия = ДатаОкончанияДействия;
	Движение.Периодический = Периодический;
	Движение.Закрыт = Закрыт;
	Движение.СуммаУдержания = СуммаУдержания;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецЕсли