#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("УстановитьСтатус")
Функция Док_УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры)
	ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств[НовыйСтатус];

	Если ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
		Или Статус <> Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
		И ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате Тогда
		КтоРешил = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	#Вставка
		Если ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате Тогда
			Утверждающий = Пользователи.ТекущийПользователь();
		КонецЕсли;
	#КонецВставки

	Статус = ЗначениеНовогоСтатуса;

	Возврат ПроверитьЗаполнение();

КонецФункции

&Перед("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипОснования = ТипЗнч(ДанныеЗаполнения);
	Если ТипОснования = Тип("Массив") И ДанныеЗаполнения.Количество() > 0 Тогда
		ТипОснования = ТипЗнч(ДанныеЗаполнения[0]);
		Если ТипОснования = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Или ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") 
			Или ТипОснования = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда 

			ЗаполнитьЗаявкуНаРасходованиеДСПоМассиву(ДанныеЗаполнения, ДанныеЗаполнения);
			
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения_После(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Массив") и ДанныеЗаполнения <> неопределено Тогда
		Для Каждого ЭлементРасшифровки Из РасшифровкаПлатежа Цикл 
			Если ЭлементРасшифровки.ОбъектРасчетов.Объект = Неопределено Тогда
				ЭлементРасшифровки.Партнер = ДанныеЗаполнения.Договор.Партнер;
				ЭлементРасшифровки.СтатьяДвиженияДенежныхСредств = ДанныеЗаполнения.Договор.СтатьяДвиженияДенежныхСредств;
			КонецЕсли;	
		КонецЦикла; 
		
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			ДокументОсн = ДанныеЗаполнения.ДокументОснование;
			ТипОснования = ТипЗнч(ДокументОсн);
			
			Если ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику")Тогда 
				ЗаполнитьСуммыПоЗаказуПоставщику(ДокументОсн);
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда 
				ЗаполнитьСуммыПоОснованию("Товары",ДокументОсн);
				ДатаПлатежа = ТекущаяДата();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ЗаполнитьЗаявкуНаРасходованиеДСПоМассиву(Знач МассивОснований, ДанныеЗаполнения)
	
	Перем КэшированныеЗначения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	ЗаявкаНаРасходованиеДСОснования.ДокументОснования КАК ДокументОснования	
		|Поместить ВТ_ИспользованныеДокументы
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|		Внутреннее СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.ДокументыОснования КАК ЗаявкаНаРасходованиеДСОснования
		|		ПО ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = ЗаявкаНаРасходованиеДСОснования.Ссылка
		|Где 
		|	ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления = Ложь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Основания
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|
		|ГДЕ
		|	ПриобретениеТоваровУслуг.Ссылка В(&МассивДокументов)
		|	И ПриобретениеТоваровУслуг.Ссылка Не В 
		|		(Выбрать ВТ_ИспользованныеДокументы.ДокументОснования КАК ДокументОснования
		|			ИЗ 	ВТ_ИспользованныеДокументы КАК ВТ_ИспользованныеДокументы)				 
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ  
		|	ЗаказПоставщику.Ссылка
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка В(&МассивДокументов)
		|	И ЗаказПоставщику.Ссылка Не В 
		|		(Выбрать ВТ_ИспользованныеДокументы.ДокументОснования КАК ДокументОснования
		|			ИЗ 	ВТ_ИспользованныеДокументы КАК ВТ_ИспользованныеДокументы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ПриобретениеУслугПрочихАктивов.Ссылка
		|ИЗ
		|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
		|ГДЕ
		|	ПриобретениеУслугПрочихАктивов.Ссылка В(&МассивДокументов)
		|	И ПриобретениеУслугПрочихАктивов.Ссылка Не В 
		|		(Выбрать ВТ_ИспользованныеДокументы.ДокументОснования КАК ДокументОснования
		|			ИЗ 	ВТ_ИспользованныеДокументы КАК ВТ_ИспользованныеДокументы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.Организация КАК Организация,
		|	ПриобретениеТоваровУслуг.Договор КАК Договор,
		|	ПриобретениеТоваровУслуг.Партнер КАК Партнер,
		|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
		|	СУММА(ПриобретениеТоваровУслугТовары.Сумма) КАК Сумма
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|		ПО ВТ_Основания.Ссылка = ПриобретениеТоваровУслугТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|		ПО ВТ_Основания.Ссылка = ПриобретениеТоваровУслуг.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ВТ_Основания.Ссылка) = ТИП(Документ.ПриобретениеТоваровУслуг)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровУслуг.Организация,
		|	ПриобретениеТоваровУслуг.Договор,
		|	ПриобретениеТоваровУслуг.Партнер,
		|	ПриобретениеТоваровУслуг.Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказПоставщику.Организация,
		|	ЗаказПоставщику.Договор,
		|	ЗаказПоставщику.Партнер,
		|	ЗаказПоставщику.Контрагент,
		|	СУММА(ЗаказПоставщикуТовары.Сумма)
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ПО ВТ_Основания.Ссылка = ЗаказПоставщикуТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО ВТ_Основания.Ссылка = ЗаказПоставщику.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ВТ_Основания.Ссылка) = ТИП(Документ.ЗаказПоставщику)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщику.Организация,
		|	ЗаказПоставщику.Договор,
		|	ЗаказПоставщику.Партнер,
		|	ЗаказПоставщику.Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеУслугПрочихАктивов.Организация,
		|	ПриобретениеУслугПрочихАктивов.Договор,
		|	ПриобретениеУслугПрочихАктивов.Партнер,
		|	ПриобретениеУслугПрочихАктивов.Контрагент,
		|	СУММА(ПриобретениеУслугПрочихАктивовРасходы.Сумма)
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПриобретениеУслугПрочихАктивовРасходы
		|		ПО ВТ_Основания.Ссылка = ПриобретениеУслугПрочихАктивовРасходы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
		|		ПО ВТ_Основания.Ссылка = ПриобретениеУслугПрочихАктивов.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ВТ_Основания.Ссылка) = ТИП(Документ.ПриобретениеУслугПрочихАктивов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеУслугПрочихАктивов.Организация,
		|	ПриобретениеУслугПрочихАктивов.Договор,
		|	ПриобретениеУслугПрочихАктивов.Партнер,
		|	ПриобретениеУслугПрочихАктивов.Контрагент";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОснований);
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТаблицаДанных = РезультатЗапроса[2].Выгрузить();
	МассивОснований = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если ТаблицаДанных.Количество() > 1 Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не у всех документов одинаковые реквизиты заполнения.Расхождение по ключам:'"),
		ДокументОснование);
		СтрКлючи = "";
		Организация = ТаблицаДанных[0].организация;
		Договор = ТаблицаДанных[0].Договор;
		Партнер = ТаблицаДанных[0].Партнер;
		Контрагент = ТаблицаДанных[0].Контрагент;
		Для Каждого стр Из ТаблицаДанных Цикл
			Ошибка_есть = Ложь;
			Если стр.Организация <> Организация Тогда
				стрключи = "организация";
				Ошибка_есть = Истина;
			КонецЕсли;	
			Если стр.Договор <> Договор Тогда
				Если стрключи <> "" Тогда
					стрключи = стрключи + ", ";	
				КонецЕсли;
				стрключи = стрключи + "договор";
				Ошибка_есть = истина;
			КонецЕсли;	
			Если стр.Партнер <> Партнер Тогда
				Если стрключи <> "" Тогда
					стрключи = стрключи + ", ";	
				КонецЕсли;
				стрключи = стрключи + "партнер";
				Ошибка_есть = Истина;
			КонецЕсли;	
			Если стр.Контрагент <> Контрагент Тогда
				Если стрключи <> "" Тогда
					стрключи = стрключи + ", ";	
				КонецЕсли;
				стрключи = стрключи + "контрагент";
				Ошибка_есть = Истина;
			КонецЕсли;	
			Если Ошибка_есть Тогда
				Текст = Текст + стрключи;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		ВызватьИсключение Текст;
	Иначе
		Если ТаблицаДанных.Количество() = 1  Тогда
			ТипОснования = ТипЗнч(ДанныеЗаполнения[0]);    
			Организация_ = Справочники.Организации.ПустаяСсылка();
			Если ТипОснования = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")  Тогда  
				Организация_ = ДанныеЗаполнения[0].Организация;
				ЗаполнитьПоПоступлениюТоваровУслуг(МассивОснований[0], ДанныеЗаполнения);
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
				Организация_ = ДанныеЗаполнения[0].Организация;
				ЗаполнитьПоЗаказуПоставщику(МассивОснований[0], ДанныеЗаполнения);
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
				Организация_ = ДанныеЗаполнения[0].Организация;
				ЗаполнитьПоПоступлениюУслугИВнеоборотныхАктивовМассив(МассивОснований, ДанныеЗаполнения);
				ДанныеЗаполнения.ЖелательнаяДатаПлатежа=ТекущаяДата();
			Иначе
				Возврат;
			КонецЕсли;
			ДокументОснование = "";
			Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
				 ДанныеЗаполнения.ДокументОснование="";
			КонецЕсли;	
			СуммаДокумента = ТаблицаДанных[0].Сумма; 
			
			Если ТипОснования = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда 
				СтавкаНДС = РасшифровкаПлатежа[0].СтавкаНДС;
			Иначе
				СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация_, МассивОснований[0]); 
			КонецЕсли;
			
			ЦенаВключаетНДС = МассивОснований[0].ЦенаВключаетНДС;
						
			Для Каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
				СтрокаТаблицы.Сумма = СуммаДокумента;
				СтрокаТаблицы.СуммаВзаиморасчетов = СуммаДокумента;
				СтрокаТаблицы.СтавкаНДС = СтавкаНДС;
				СтруктураПересчетаСуммы = Новый Структура;
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС",ЦенаВключаетНДС);
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
			КонецЦикла;	
			Если значениезаполнено(ТаблицаДанных[0].Договор) Тогда
				ЗаполнитьОснованиеПлатежа(НазначениеПлатежа,ТаблицаДанных[0].Договор,МассивОснований);
			КонецЕсли;
		Иначе
		    Сообщить("На основании выбранных документов уже создана заявка"); 
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
	
Процедура ЗаполнитьПоПоступлениюУслугИВнеоборотныхАктивовМассив(
	
	Знач ДокументОснование,
	ДанныеЗаполнения)
	
	// Заполним данные шапки документа.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА ДанныеДокумента.БанковскийСчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка) ТОГДА
	|		ДанныеДокумента.БанковскийСчетОрганизации.Владелец
	|	ИНАЧЕ
	|		ДанныеДокумента.Организация
	|	КОНЕЦ КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.Договор КАК Договор,
	|	&Ссылка КАК Заказ,
	|	ДанныеДокумента.БанковскийСчетОрганизации КАК БанковскийСчет,
	|	ДанныеДокумента.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК Касса,
	|
	|	ВЫБОР КОГДА ДанныеДокумента.БанковскийСчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка) ТОГДА
	|		ДанныеДокумента.БанковскийСчетОрганизации.ВалютаДенежныхСредств
	|	ИНАЧЕ
	|		ДанныеДокумента.Валюта
	|	КОНЕЦ КАК Валюта,
	|
	|	ДанныеДокумента.ДатаПлатежа КАК ЖелательнаяДатаПлатежа,
	|	ДанныеДокумента.ФормаОплаты КАК ФормаОплатыЗаявки,
	|
	|	ВЫБОР КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	| 		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ФормаОплатыНаличная,
	|
	|	ВЫБОР КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	| 		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ФормаОплатыБезналичная,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику) КАК ХозяйственнаяОперация,
	|	&Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование[0]);
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗаполнитьРеквизитыПоРезультатуЗапроса(
		ДокументОснование,
		РезультатЗапроса,
		ДанныеЗаполнения);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеУслугПрочихАктивов.Ссылка КАК ДокументОснования
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
	|ГДЕ
	|	ПриобретениеУслугПрочихАктивов.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", ДокументОснование);
	
	ДокументыОснования.Загрузить(Запрос.Выполнить().Выгрузить());	
	
	Если ТипЗнч(ДокументОснование) = Тип("Массив") Тогда
		ДокументЗаказа = ?(ТипЗнч(ДокументОснование[0]) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов"), ДокументОснование[0], ДокументОснование[0].ДокументОснование);
		ЗаполнитьЗаметкиМассив();
	Иначе	
		ДокументЗаказа = ?(ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов"), ДокументОснование[0], ДокументОснование[0].ДокументОснование);
	КонецЕсли; 
	ЗаполнятьПоСуммеДок = Ложь;
	ЗаполнитьСуммыПоОснованию("Расходы",ДокументЗаказа);
			
	Если ЗначениеЗаполнено(ДокументЗаказа.Договор) Тогда
		МассивОснованийДокументов = Новый Массив;
		МассивОснованийДокументов.Добавить(ДокументЗаказа); 
	    ЗаполнитьОснованиеПлатежа(НазначениеПлатежа,ДокументЗаказа.Договор,МассивОснованийДокументов);
	КонецЕсли;
	ЗаполнитьЗаметкиМассив();
		
КонецПроцедуры

Процедура ЗаполнитьЗаметкиМассив()

	ТекстЗаметки = "";
	Для Каждого стр Из  ДокументыОснования Цикл
		ТекстЗаметки = ТекстЗаметки + "Акт №" + СОКРЛП(стр.ДокументОснования.НомерВходящегоДокумента) + " от " + ФОРМАТ(стр.ДокументОснования.ДатаВходящегоДокумента, "ДФ=дд.ММ.гггг'г.'") + " - " + стр.ДокументОснования.СуммаДокумента + "р." + Символы.ПС; 
	КонецЦикла;   
	Комментарий = ТекстЗаметки;  
	
КонецПроцедуры
	
Процедура ЗаполнитьОснованиеПлатежа(НазначениеПлатежа,Договор,МассивОснований)
	
	Если Не ПустаяСтрока(Договор.ТекстДляНазначенияПлатежа) Тогда
		ТекстНазначение = СОКРЛП(Договор.ТекстДляНазначенияПлатежа) + " ";
		
		ТекстСумма = "Сумма " + Формат(СуммаДокумента, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="); 
					
	   	ТекстСуммаНДС = ДенежныеСредстваСервер.ТекстСуммаНДСПлатежа(Организация, Валюта, РасшифровкаПлатежа, Истина);
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка КАК Ссылка,
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Номер КАК Номер,
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Дата КАК Дата,
		|	"""" КАК Акт_Текст,
		|	ЛОЖЬ КАК Акт
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО ПриобретениеТоваровУслуг.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|	И ПриобретениеТоваровУслуг.Ссылка В(&МассивОснований)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка,
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Номер,
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Дата,
		|	"""",
		|	ЛОЖЬ
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО ПриобретениеТоваровУслуг.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
		|		ПО ПриобретениеТоваровУслуг.ЗаказПоставщику = Заказ.Ссылка
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|	И Заказ.Ссылка В(&МассивОснований)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка,
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Номер,
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Дата,
		|	ПриобретениеУслугПрочихАктивов.УПДАктОтПеревозчика,
		|	ИСТИНА
		|ИЗ
		|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО ПриобретениеУслугПрочихАктивов.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|	И ПриобретениеУслугПрочихАктивов.Ссылка В(&МассивОснований)";
		
		Запрос.УстановитьПараметр("МассивОснований", МассивОснований);
		      
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Акт тогда
				ТекстНазначение = ТекстНазначение + ВыборкаДетальныеЗаписи.Акт_Текст;	
			Иначе
				ТекстНазначение = ТекстНазначение + "сч.ф №" + ВыборкаДетальныеЗаписи.Номер + " от " + формат(ВыборкаДетальныеЗаписи.дата,"ДЛФ=Д") + ", ";
			КонецЕсли;
		КонецЦикла;
		ТекстНазначение = ТекстНазначение + Символы.ПС + ТекстСумма + Символы.ПС + ТекстСуммаНДС;
		
		НазначениеПлатежа = ТекстНазначение;
		
	КонецЕсли;
	
КонецПроцедуры

&После("ЗаполнитьПоПоступлениюУслугИВнеоборотныхАктивов")
Процедура Док_ЗаполнитьПоПоступлениюУслугИВнеоборотныхАктивов(
	
	Знач ДокументОснование,
	ДанныеЗаполнения)
	
	ДокументЗаказа = ?(ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов"), ДокументОснование, ДокументОснование.ДокументОснование);
	ЗаполнятьПоСуммеДок = Ложь; 
	ЗаполнитьСуммыПоОснованию("Расходы",ДокументЗаказа);

	ДатаПлатежа = ТекущаяДата();		
			
	Если ЗначениеЗаполнено(ДокументЗаказа.Договор) Тогда
		МассивОснованийДокументов = Новый Массив;
		МассивОснованийДокументов.Добавить(ДокументЗаказа);
		ЗаполнитьОснованиеПлатежа(НазначениеПлатежа,ДокументЗаказа.Договор,МассивОснованийДокументов);
	КонецЕсли; 
	
	СтрокаТЧ = ДокументыОснования.Добавить();
	СтрокаТч.ДокументОснования = ДокументЗаказа;
	
КонецПроцедуры	

&Перед("ИнициализироватьДокумент")
Процедура Док_ИнициализироватьДокумент(ДанныеЗаполнения)
	
	Если БанковскийСчетКонтрагента.Закрыт Тогда
		ДанныеЗаполнения.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Счет получателя очищен, т.к. имеет статус ""Закрыт"". Заполните открытым счетом'"),,
		"Объект.БанковскийСчетКонтрагента");
	ИначеЕсли БанковскийСчетПолучатель.Закрыт Тогда
		ДанныеЗаполнения.БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Счет получателя очищен, т.к. имеет статус ""Закрыт"". Заполните открытым счетом'"),,
		"Объект.БанковскийСчетПолучатель");
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ АльтерраОбщегоНазначения.ДействующийПоставщик(ЭтотОбъект.Контрагент) Тогда
	
		Отказ = Истина; 
		Сообщить("Данный контрагент не включен в реестр поставщиков", СтатусСообщения.Важное);
	
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСуммыПоОснованию(ИмяТабЧасти,ДокументОсн)
	
	Если РасшифровкаПлатежа.Количество() = 1 Тогда  
		
			РасшифровкаПлатежа[0].Сумма = ДокументОсн[ИмяТабЧасти].Итог("Сумма");
			РасшифровкаПлатежа[0].СуммаНДС = ДокументОсн[ИмяТабЧасти].Итог("СуммаНДС");
			РасшифровкаПлатежа[0].СуммаВзаиморасчетов = ДокументОсн[ИмяТабЧасти].Итог("Сумма");      
		    РасшифровкаПлатежа[0].СтавкаНДС = ДокументОсн[ИмяТабЧасти][0].СтавкаНДС;  
		
	КонецЕсли;
	
	СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");	
КонецПроцедуры  

Процедура ЗаполнитьСуммыПоЗаказуПоставщику(ДокЗаказПоставщику) 
	
	Если РасшифровкаПлатежа.Количество() = 1 Тогда  
		
		РасшифровкаПлатежа[0].Сумма = ДокЗаказПоставщику.СуммаДокумента; 
		СуммаНДС = 0;
		Для Каждого Строка из ДокЗаказПоставщику.Товары Цикл 
			Если НЕ Строка.Отменено Тогда
				СуммаНДС = СуммаНДС + Строка.СуммаНДС;
			КонецЕсли;	
		КонецЦикла; 	
		РасшифровкаПлатежа[0].СуммаНДС = СуммаНДС;
		РасшифровкаПлатежа[0].СуммаВзаиморасчетов = ДокЗаказПоставщику.СуммаДокумента; 
		РасшифровкаПлатежа[0].СтавкаНДС = ДокЗаказПоставщику.Товары[0].СтавкаНДС;  
		
	КонецЕсли;
	
	СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");	
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВсеРеквизиты = Новый Массив;
	РеквизитыОперации = Новый Массив;
	НепроверяемыеРеквизиты = Новый Массив;
	
	РасшифровкаБезРазбиения = Ложь;
	Если ДополнительныеСвойства.Свойство("РасшифровкаБезРазбиения") И ДополнительныеСвойства.РасшифровкаБезРазбиения Тогда
		РасшифровкаБезРазбиения = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(ОрганизацияПолучатель)
		И Организация = ОрганизацияПолучатель Тогда
		
		Текст = НСтр("ru = 'Одна и та же организация не может являться отправителем и получателем одновременно'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, "Организация",, Отказ);
	КонецЕсли;
	
	// Платежной картой можно оплачивать только возврат оплаты клиенту.
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
		И (ФормаОплатыПлатежнаяКарта Или ФормаОплатыЗаявки = Перечисления.ФормыОплаты.ПлатежнаяКарта) Тогда
		
		ТекстОшибки = НСтр("ru = 'Оплату платежной картой можно выбирать только для возврата оплаты клиенту'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ХозяйственнаяОперация",, Отказ);
	КонецЕсли;
	
	// Организация-получатель должна быть взаимосвязана с организацией-отправителем по организационной структуре.
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств
		И ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(ОрганизацияПолучатель)
		И Не Справочники.Организации.ОрганизацииВзаимосвязаныПоОрганизационнойСтруктуре(
			Организация, ОрганизацияПолучатель) Тогда
		
		ТекстОшибки = НСтр("ru = 'Организация-получатель должна быть взаимосвязана с организацией-отправителем по организационной структуре.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ОрганизацияПолучатель",, Отказ);
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
		НепроверяемыеРеквизиты.Добавить("ДатаАвансовогоОтчета");
		Если Не ЗначениеЗаполнено(ДатаАвансовогоОтчета) Тогда
			ТекстОшибки = НСтр("ru = 'Поле ""Отчитаться"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ПериодАвансовогоОтчета",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если РаспределениеПоСчетам.Итог("Сумма") > СуммаДокумента Тогда
		ТекстОшибки = НСтр("ru = 'Сумма распределения по счетам не может превышать сумму документа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "РаспределениеПоСчетам",, Отказ);
	КонецЕсли;
	
	Если ЖелательнаяДатаПлатежа < НачалоДня(Дата) Тогда
		Текст = НСтр("ru = 'Желательная дата платежа не может быть меньше даты документа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, "ЖелательнаяДатаПлатежа",, Отказ);
	КонецЕсли;
	
	Для каждого СтрокаРаспределения Из РаспределениеПоСчетам Цикл
		Если СтрокаРаспределения.ДатаПлатежа < НачалоДня(Дата) Тогда
			Текст = НСтр("ru = 'Дата платежа не может быть меньше даты документа'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ЭтотОбъект,
				"РаспределениеПоСчетам[" + РаспределениеПоСчетам.Индекс(СтрокаРаспределения) + "].ДатаПлатежа",,
				Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована
		И Не ПраваПользователяПовтИсп.СогласованиеЗаявокНаРасходованиеДенежныхСредств() Тогда
		
		ТекстОшибки = НСтр("ru = 'У вас нет права согласования заявок на расходование денежных средств'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате
		И Не ПраваПользователяПовтИсп.УтверждениеЗаявокНаРасходованиеДенежныхСредств() Тогда
		
		ТекстОшибки = НСтр("ru = 'У вас нет права утверждения к оплате заявок на расходование денежных средств'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
	Если Не (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику И СписокФизЛиц) Тогда
		ДенежныеСредстваСервер.ПроверитьЗаполнениеРасшифровкиПлатежа(ЭтотОбъект, СуммаДокумента, ХозяйственнаяОперация, Отказ);
	ИначеЕсли ПеречислениеСотрудникуЧерезБанк Тогда
		ДенежныеСредстваСервер.ПроверитьЛицевыеСчетаСотрудниковПоБанку(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Проверяем соответствие валюты заявки, валюты взаиморасчетов и валюты платежа
	Если ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов
		И ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств
		И ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.КонвертацияВалюты
		И ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда
		
		ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетовВТабличнойЧасти(Валюта, Дата, РасшифровкаПлатежа, Организация);
		ПроверитьСоответствиеВалютыВзаиморасчетов(Отказ);
	КонецЕсли;
	
	Документы.ЗаявкаНаРасходованиеДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		ЭтотОбъект, ВсеРеквизиты, РеквизитыОперации);
		
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		ВсеРеквизиты, РеквизитыОперации, НепроверяемыеРеквизиты);
		
	Если ФормаОплатыЗаявки <> Перечисления.ФормыОплаты.Безналичная Тогда
		НепроверяемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
	КонецЕсли;
	
	Если РасшифровкаБезРазбиения Тогда
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.Сумма");
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
		Или Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена Тогда
		
		НепроверяемыеРеквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		НепроверяемыеРеквизиты.Добавить("Контрагент");
		НепроверяемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.Партнер");
		НепроверяемыеРеквизиты.Добавить("СтатьяАктивовПассивов");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СтатьяРасходов");
		НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
		НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.Контрагент");
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована Тогда
		НепроверяемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
		#Вставка
		ИначеЕсли Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КУтверждению Тогда
		НепроверяемыеРеквизиты.Добавить("ОрганизацияПолучатель");
		НепроверяемыеРеквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
		НепроверяемыеРеквизиты.Добавить("Контрагент");
		НепроверяемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.Партнер");
		НепроверяемыеРеквизиты.Добавить("СтатьяАктивовПассивов");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СтатьяРасходов");
		НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
		#КонецВставки
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств Тогда
		
		Если ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Наличная Тогда
			НепроверяемыеРеквизиты.Добавить("БанковскийСчетПолучатель");
			
		ИначеЕсли ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Безналичная Тогда
			НепроверяемыеРеквизиты.Добавить("КассаПолучатель");
			
		Иначе
			НепроверяемыеРеквизиты.Добавить("БанковскийСчетПолучатель");
			НепроверяемыеРеквизиты.Добавить("КассаПолучатель");
		КонецЕсли;
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты Тогда
		НепроверяемыеРеквизиты.Добавить("БанковскийСчетПолучатель");
		НепроверяемыеРеквизиты.Добавить("КассаПолучатель");
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
		Если СписокФизЛиц Тогда
			НепроверяемыеРеквизиты.Добавить("ПодотчетноеЛицо");
			НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа");
			НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств");
			НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.Сумма");
			Если Не ПеречислениеСотрудникуЧерезБанк Тогда
				НепроверяемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
			КонецЕсли;
		Иначе
			НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников");
			НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.ФизическоеЛицо");
			НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
			НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.Сумма");
			НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.СтатьяДвиженияДенежныхСредств");
		КонецЕсли;
		Если ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Наличная Тогда
			НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
			НепроверяемыеРеквизиты.Добавить("Контрагент");
		КонецЕсли;
	КонецЕсли;
	
	ДенежныеСредстваСервер.ДобавитьНепроверяемыеРеквизитыПоВыплатеЗаработнойПлаты(
		ЭтотОбъект, НепроверяемыеРеквизиты, ХозяйственнаяОперацияПоЗарплате);
	
	Если ПеречислениеСотрудникуЧерезБанк Тогда
		
		Если ФормаОплатыЗаявки <> Перечисления.ФормыОплаты.Наличная Тогда
			РеквизитыОперации.Добавить("Контрагент");
			РеквизитыОперации.Добавить("БанковскийСчетКонтрагента");
		КонецЕсли;
		
	Иначе
		
		Если (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
			ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
			И НепроверяемыеРеквизиты.Найти("Контрагент") = Неопределено Тогда
			НепроверяемыеРеквизиты.Добавить("Контрагент");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихАктивовПассивов") Тогда
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СтатьяРасходов");
	КонецЕсли;
	
	ДенежныеСредстваСервер.ПроверитьЗаполнениеПартнера(
		ЭтотОбъект, ХозяйственнаяОперация, НепроверяемыеРеквизиты, РасшифровкаБезРазбиения, Отказ);
	
	НепроверяемыеРеквизиты.Добавить("СтатьяРасходов");
	Если ОтражатьКомиссию И СуммаКомиссии<>0 И Не ЗначениеЗаполнено(СтатьяРасходов) Тогда
		Текст = НСтр("ru = 'Поле ""Статья расходов"" по эквайринговой комиссии не заполнено'");
		ОбщегоНазначения.СообщитьПользователю(Текст, ЭтотОбъект, "СтатьяРасходов",, Отказ);
	КонецЕсли;
	
	Если Не СписокКонтрагентов Тогда
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.Контрагент");
	Иначе
		
		Если ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Наличная Тогда
			НепроверяемыеРеквизиты.Добавить("Контрагент");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		ДенежныеСредстваСервер.ПроверитьДоступностьБанковскогоСчета(ЭтотОбъект, БанковскийСчет, "БанковскийСчет");
	КонецЕсли;
	
	Если РаспределениеПоСчетам.Количество() <> 0
		И ФормаОплатыЗаявки <> Перечисления.ФормыОплаты.Наличная Тогда
		ДенежныеСредстваСервер.ПроверитьДоступностьБанковскогоСчетаТабличнойЧасти(
			ЭтотОбъект, "РаспределениеПоСчетам", "БанковскийСчетКасса");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчетКонтрагента)
		И РеквизитыОперации.Найти("БанковскийСчетКонтрагента") <> Неопределено Тогда
		ДенежныеСредстваСервер.ПроверитьДоступностьБанковскогоСчета(
			ЭтотОбъект, БанковскийСчетКонтрагента, "БанковскийСчетКонтрагента");
	КонецЕсли;
	#Вставка
	Если ЗначениеЗаполнено(Контрагент) И НЕ ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
		ТекстОшибки = НСтр("ru = 'Банковский счет контрагента не заполнен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "БанковскийСчетКонтрагента",, Истина);
	КонецЕсли;
	#КонецВставки
	
	Если ЗначениеЗаполнено(БанковскийСчетПолучатель)
		И РеквизитыОперации.Найти("БанковскийСчетПолучатель") <> Неопределено Тогда
		ДенежныеСредстваСервер.ПроверитьДоступностьБанковскогоСчета(
			ЭтотОбъект, БанковскийСчетПолучатель, "БанковскийСчетПолучатель");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчетСписанияКомиссии)
		И РеквизитыОперации.Найти("БанковскийСчетСписанияКомиссии") <> Неопределено Тогда
		ДенежныеСредстваСервер.ПроверитьДоступностьБанковскогоСчета(
		    ЭтотОбъект, БанковскийСчетСписанияКомиссии, "БанковскийСчетСписанияКомиссии");
	КонецЕсли;
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ДенежныеСредстваСервер.ПроверитьБанковскийСчетПолучатель(ЭтотОбъект, Отказ);
	ДенежныеСредстваСервер.ПроверитьВалютуКонвертации(ЭтотОбъект, Отказ);
	
	ПроверитьНаличиеОплатыЗаявки(Отказ);
	ПроверитьДатыПогашения(Отказ);
	
	ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	Если РасшифровкаБезРазбиения Тогда
		ДенежныеСредстваСервер.ПроверитьЗаполнениеРасшифровкиБезРазбиения(
			ЭтотОбъект, ПроверяемыеРеквизиты, "РасшифровкаПлатежа", "РасшифровкаБезРазбиения", Отказ);
	КонецЕсли;

КонецПроцедуры




