#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, Замещение)  
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		если лев(ТекЗапись.Свойство.Наименование,6)="DDPro_" тогда
			продолжить;
		конецесли;	
		
		Если ЗначениеЗаполнено(ТекЗапись.Свойство) И
			ЗначениеЗаполнено(ТекЗапись.Свойство.ТипЗначения) И
			ЗначениеЗаполнено(ТекЗапись.Значение) И
			Не ТекЗапись.Свойство.ТипЗначения.СодержитТип(ТипЗнч(ТекЗапись.Значение)) Тогда   
			
			СтрТипы = "";
			СписокТипов = ТекЗапись.Свойство.ТипЗначения.Типы();
			Для Каждого Стр Из СписокТипов Цикл   
				Если ЗначениеЗаполнено(СтрТипы) Тогда
					СтрТипы = СтрТипы + ", " + Стр;
				Иначе
					СтрТипы = "" + Стр; 
				КонецЕсли;
			КонецЦикла;
			
			ОбщегоНазначения.СообщитьПользователю(
				"Тип Значения '" + 
				ТипЗнч(ТекЗапись.Значение) + 
				"' не может быть использован для Свойства '" + 
				ТекЗапись.Свойство + 
				"'. Значение должно иметь тип: '" + 
				СтрТипы + 
				"'", ТекЗапись.Свойство);
			
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли
