
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура Док_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	СписокОбъектов.Добавить(Документы.ЗаказНаДоставкуКлиенту);
	СписокОбъектов.Добавить(Документы.ЗаданиеНаПеревозкуРейс);
	СписокОбъектов.Добавить(Документы.РейсОтПоставщика);
	СписокОбъектов.Добавить(Документы.ЗаказНаДоставкуОтПоставщика);
	СписокОбъектов.Добавить(Документы.ГрафикВыходаВодителей);
	СписокОбъектов.Добавить(Документы.БлокировкаДвиженияТоваров);
	СписокОбъектов.Добавить(Документы.ЛистСогласования);
	СписокОбъектов.Добавить(Документы.АрендаНоменклатуры);
	СписокОбъектов.Добавить(Документы.АрендаНоменклатурыВозврат);
	СписокОбъектов.Добавить(Справочники.Сотрудники);
	СписокОбъектов.Добавить(Документы.ПроверкаЦенников);
	СписокОбъектов.Добавить(Документы.ОбращениеКлиента);  
	СписокОбъектов.Добавить(Документы.ПутевойЛист);

КонецПроцедуры
