#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных
Перем ПодлежитМаркировкеДо;
#КонецОбласти

&После("ПередЗаписью")
Процедура Спр_ПередЗаписью(Отказ)
	//Автоматическая установка дополнительного реквизита Резка для выгрузки на сайт
	Свойство= АльтерраОбщегоНазначения.ПолучитьСвойствоДопРеквизитаПоЗаголовку("Резка");
	Значение= АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизитПоСвойству(Ссылка, Свойство);
	Если ЗначениеЗаполнено(УслугаРезки) Тогда
		Если Не ЗначениеЗаполнено(Значение) Тогда
				МассивСтрок = ЭтотОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));
				Если МассивСтрок.Количество() Тогда
					СтрокаСвойства = МассивСтрок[0];
				Иначе
					СтрокаСвойства = ЭтотОбъект.ДополнительныеРеквизиты.Добавить();
				КонецЕсли;
				СтрокаСвойства.Свойство= Свойство;
				СтрокаСвойства.Значение= Истина;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Значение) Тогда
				МассивСтрок = ЭтотОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));
				Если МассивСтрок.Количество() Тогда
					СтрокаСвойства = МассивСтрок[0];
				Иначе
					СтрокаСвойства = ЭтотОбъект.ДополнительныеРеквизиты.Добавить();
					СтрокаСвойства.Свойство= Свойство;
				КонецЕсли;
				СтрокаСвойства.Значение= Ложь;
				Сообщить("Для установления галочки Резка нужно заполнить реквизит 'Услуга резки'");
		КонецЕсли;
	КонецЕсли;    
	
	Если Не Отказ И ЭтоНовый() И Не ЗначениеЗаполнено(ДатаРегистрации) И НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ДатаРегистрации = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ Ссылка.Пустая()  Тогда
		Если Ссылка.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать И
			ИспользованиеХарактеристик <> Ссылка.ИспользованиеХарактеристик И Не РольДоступна("ПолныеПрава") Тогда 
			Если ЕстьДокументы(Ссылка) Тогда
				ИспользованиеХарактеристик = Ссылка.ИспользованиеХарактеристик;
				Сообщить("Номенклатура уже используется в документах без характеристик! Изменять использование характеристик не рекомендуется.");
			КонецЕсли;
		КонецЕсли;
		//ЗаменитьРеквизитыВНоменклатуреДругогоКачества(Ссылка);
		ПодлежитМаркировкеДо = МаркировкаАльтерра.НоменклатураПодлежитМаркировке(Ссылка);
	КонецЕсли;

КонецПроцедуры

&После("ПриЗаписи")
Процедура Спр_ПриЗаписи(Отказ)   
	ЗаменитьРеквизитыВНоменклатуреДругогоКачества(Ссылка);
	ПодлежитМаркировкеПосле = МаркировкаАльтерра.НоменклатураПодлежитМаркировке(Ссылка); 
	Если ПодлежитМаркировкеПосле И ПодлежитМаркировкеДо <> ПодлежитМаркировкеПосле Тогда 
		ЗаписатьGTINШтрихкодам(Ссылка);
	КонецЕсли	
КонецПроцедуры


Процедура ЗаменитьРеквизитыВНоменклатуреДругогоКачества(Номенклатура)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыДругогоКачества.НоменклатураБрак.Ссылка КАК НоменклатураБрак
		|ИЗ
		|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
		|ГДЕ
		|	ТоварыДругогоКачества.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			СпрОбъект=ВыборкаДетальныеЗаписи.НоменклатураБрак.ПолучитьОбъект();
			Спробъект.МенеджерПоставок=Номенклатура.МенеджерПоставок; 
			СпрОбъект.КатегорийныйМенеджер=Номенклатура.КатегорийныйМенеджер;
			СпрОбъект.Записать();
		Исключение  
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать менеджера поставок и категорийного менеджера в товар другого качества";
			Сообщение.Сообщить();
		КонецПопытки;  
	КонецЦикла;
КонецПроцедуры


&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)  
	ДатаРегистрации = ТекущаяДата();
	
	Артикул="";
	ФайлКартинки=Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка();
	ФайлОписанияДляСайта="";
	//АдресКартинки="";
	//ДанныеФайлаКартинки="";
	ВидНоменклатуры= Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Новый товар");
	ОтборБарнаул= Ложь;
	ОтборНовоалтайск= Ложь;
	ОтборЦентр= Ложь;
	ОтборБийск = Ложь;
	ВыгружаетсяНаСайт= Ложь;
	АналогНоменклатуры="";
	
	Прайс = Ложь;
	СправочникДляПрайса = Справочники.СправочникДляПрайса.ПустаяСсылка();
	ДополнительныеРеквизиты.Очистить();
КонецПроцедуры

Функция Естьдокументы(Номенклатура)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗапасыИПотребности.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности КАК ЗапасыИПотребности
		|ГДЕ
		|	ЗапасыИПотребности.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда  
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

Процедура ЗаписатьGTINШтрихкодам(Номенклатура)
   Запрос = Новый Запрос;
	Запрос.Текст = 
        "ВЫБРАТЬ
        |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ	
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ 
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
	   
	   ДанныеШтрихкода = Новый Структура();
	   ДанныеШтрихкода.Вставить("Номенклатура", Номенклатура);
	   ДанныеШтрихкода.Вставить("Упаковка", Выборка.Упаковка);
	   ДанныеШтрихкода.Вставить("Штрихкод", Выборка.Штрихкод);
	   МаркировкаАльтерра.ЗаписатьGTINИС(ДанныеШтрихкода);
	   
	КонецЦикла;
	
КонецПроцедуры	

#КонецЕсли

