
&НаКлиенте
&ИзменениеИКонтроль("ОбработкаКоманды")
Процедура Док_ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    #Удаление
	ОткрытьФорму("Документ.ОперацияПоПлатежнойКарте.Форма.ФормаСпискаДокументов",
	, // ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник,
	ПараметрыВыполненияКоманды.Уникальность,
	ПараметрыВыполненияКоманды.Окно);
    #КонецУдаления
	#Вставка
	ОткрытьФорму("Документ.ОперацияПоПлатежнойКарте.Форма.ФормаСписка",
	, // ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник,
	ПараметрыВыполненияКоманды.Уникальность,
	ПараметрыВыполненияКоманды.Окно);
	#КонецВставки
КонецПроцедуры
