#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь,"Подразделение");
	
	Элементы.Подразделение.Видимость = АльтерраОбщегоНазначения._РольДоступна("ОтделЛогистики") ИЛИ АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава");
	Элементы.РозничнаяДоставка.Видимость = НЕ (Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000001"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЗавершитьРаботуСистемы(Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПропускНаСклад(Команда)
	ОткрытьФорму("Обработка.Самообслуживание.Форма.ФормаПропускНаСклад",Новый Структура("Подразделение",Подразделение),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияСотрудников(Команда)
	ОткрытьФорму("Обработка.Самообслуживание.Форма.ФормаРегистрацияСотрудников",Новый Структура("Подразделение",Подразделение),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РозничнаяДоставка(Команда)
	ОткрытьФорму("Обработка.Самообслуживание.Форма.ФормаРозничнаяДоставка",Новый Структура("Подразделение",Подразделение),ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

