#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		ТекстИсключения = НСтр("ru='Поле ""Наименование"" не заполнено'");
		ВызватьИсключение ТекстИсключения; 
		Отказ = Истина;
		
	КонецЕсли;
	
		
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		НаименованиеУникально = РабочееНаименованиеУникально(ЭтотОбъект);
		
		Если НЕ НаименованиеУникально Тогда
			
			ТекстИсключения = НСтр("ru='Значение поля ""Наименование"" не уникально'");
			ВызватьИсключение ТекстИсключения; 
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
	
КонецПроцедуры

Функция РабочееНаименованиеУникально(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СопутствующиеВидыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СопутствующиеВидыНоменклатуры КАК СопутствующиеВидыНоменклатуры
	|ГДЕ
	|	СопутствующиеВидыНоменклатуры.Ссылка <> &Ссылка
	|	И СопутствующиеВидыНоменклатуры.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Ссылка",       Объект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);

	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.СортировкаСопутствующихВидовНоменклатуры.ДополнитьЗаписиРегистраПоВидуНоменклатуры(ЭтотОбъект.Владелец);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
