
&НаСервере
Функция Спр_ПоискПослеНаСервере()
	
	//НомерТелефона = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("()- ", НомерТелефона, "");
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона);
	
	Если Не ЗначениеЗаполнено(НомерТелефона) ИЛИ СтрДлина(НомерТелефона)<>10 Тогда
		Отказ = Истина;
		Возврат Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	// - Альтерра
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Клиент
	//	|ИЗ
	//	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	//	|ГДЕ
	//	|	ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""";
	//-
	
	//+Альтерра
	Если ТипЗапроса = 0 Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Клиент
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""";
	Иначе	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Клиент,
		|	""Клиенте"" КАК УказанВ
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""
		|	И ПартнерыКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец,
		|   ""Контактном лице - "" + КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Наименование КАК УказанВ
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Клиент КАК Клиент,
		|   ВТ.УказанВ КАК УказанВ
		|ИЗ
		|	ВТ КАК ВТ";
	КонецЕсли;
	//-
	
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
		НайденныеКлиенты.Загрузить(РезультатЗапроса);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Спр_ПоискПосле(Команда)
	Если Спр_ПоискПослеНаСервере() тогда 
		ЭтаФорма.Элементы.ГруппаНайденныеКлиенты.Видимость = Истина;
	Иначе
		Сообщить("Клиент не найден!Проверьте, пожалуйста, корректность ввода!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоискКартЛояльности(Получатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартыЛояльности.Ссылка КАК Ссылка,
		|	КартыЛояльности.Наименование КАК Наименование,
		|	КартыЛояльности.Статус КАК Статус
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Партнер = &Владелец
		|	И КартыЛояльности.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКартЛояльности.Действует)";
	
	Запрос.УстановитьПараметр("Владелец", Получатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	НайденныеКартыЛояльности.Загрузить(РезультатЗапроса);
		
КонецПроцедуры
&НаКлиенте
Процедура Спр_НайденныеКлиентыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные= Элементы.НайденныеКлиенты.ТекущиеДанные;
	Закрыть();
	Оповестить(
	"СчитанПартнер",
	Новый Структура("Партнер, ФормаВладелец", ТекущиеДанные.Клиент, ВладелецФормы.УникальныйИдентификатор),
	Неопределено);
	 
	 //ПоказатьОповещениеПользователя(
	 //НСтр("ru = 'Считана партнер"),
	 //ПолучитьНавигационнуюСсылку(ТекущиеДанные.Клиент),
	 //СтрШаблон(НСтр("ru = 'Считана карта лояльности %1'"), ТекущиеДанные.Клиент),
	 //БиблиотекаКартинок.Информация32);
	
	 //ПоискКартЛояльности(Элемент.ТекущиеДанные.Клиент);
	 //СтэкСтраниц.Добавить(Элементы.Страницы.ТекущаяСтраница);
	 //Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаВыборКартыЛояльности;
	 //Элементы.СтраницыКнопкиНазад.ТекущаяСтраница = Элементы.СтраницыКнопкиНазад.ПодчиненныеЭлементы.КнопкаНазад;
 КонецПроцедуры

&НаСервере
 Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	 Если Параметры.Свойство("ТипЗапроса") Тогда
		 ТипЗапроса = Параметры.ТипЗапроса;
	 Иначе
		 ТипЗапроса = 0;
	КонецЕсли;		 
 КонецПроцедуры
