
&ИзменениеИКонтроль("ПриЗавершенииВыбораСтатьиИАналитики")
Процедура Док_ПриЗавершенииВыбораСтатьиИАналитики(Результат, ДополнительныеПараметры)

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Форма                 = ДополнительныеПараметры.Форма; // ФормаКлиентскогоПриложения
	ПараметрыВыбораСтатьи = ДополнительныеПараметры.ПараметрыВыбораСтатьи; // см. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики
	Если ТипЗнч(ДополнительныеПараметры.ИдентификаторСтроки) = Тип("Массив") Тогда
		МассивИдентификаторов = ДополнительныеПараметры.ИдентификаторСтроки;
	Иначе
		МассивИдентификаторов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры.ИдентификаторСтроки)
	КонецЕсли;  
	#Вставка
    ЕстьРеквизитСтатьяРасходовБУ = Неопределено; 
	#КонецВставки
	Для каждого ИдентификаторСтроки Из МассивИдентификаторов Цикл
		Данные = ДоходыИРасходыКлиентСервер.ДанныеПоПути(Форма, ПараметрыВыбораСтатьи.ПутьКДанным, ИдентификаторСтроки);
		Данные[ПараметрыВыбораСтатьи.Статья] = Результат.Статья;
		Если ПараметрыВыбораСтатьи.ВыборСтатьиРасходов Тогда
			Данные[ПараметрыВыбораСтатьи.АналитикаРасходов] = Результат.АналитикаРасходов; 
			#Вставка 
			Если ЕстьРеквизитСтатьяРасходовБУ = Неопределено Тогда 
				ЕстьРеквизитСтатьяРасходовБУ = Данные.Свойство("СтатьяРасходовБУ");
			КонецЕсли; 
			
			Если ЕстьРеквизитСтатьяРасходовБУ = Истина Тогда 
				Данные.СтатьяРасходовБУ = Результат.Статья;
			КонецЕсли;
			#КонецВставки
		КонецЕсли;
		Если ПараметрыВыбораСтатьи.ВыборСтатьиДоходов Тогда
			Данные[ПараметрыВыбораСтатьи.АналитикаДоходов] = Результат.АналитикаДоходов;
		КонецЕсли;
		Если ПараметрыВыбораСтатьи.ВыборСтатьиАктивовПассивов Тогда
			Данные[ПараметрыВыбораСтатьи.АналитикаАктивовПассивов] = Результат.АналитикаАктивовПассивов;
		КонецЕсли;
		ДоходыИРасходыКлиентСервер.ЗаполнитьРеквизитыСтатьи(Форма, Данные, ПараметрыВыбораСтатьи);
		ДоходыИРасходыКлиентСервер.УстановитьСвойстваЭлементовАналитики(Форма, ПараметрыВыбораСтатьи);
	КонецЦикла;


	Форма.Модифицированность = Истина;

	Если ДополнительныеПараметры.ОписаниеОповещенияПослеЗаполнения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияПослеЗаполнения);
	КонецЕсли;

КонецПроцедуры
