#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать 
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ЛистСогласования";
	КомандаПечати.Идентификатор = "ЛистСогласования";
	КомандаПечати.Представление = НСтр("ru = 'Напечатать лист'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 1;
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ТабДок= Новый ТабличныйДокумент;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Если Ссылка.ОстатокДоступногоЛимита < 0 И Ссылка.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда 
			Сообщить("Привышен остаток доступного лимита. Печать невозможна!", СтатусСообщения.ОченьВажное);
		Иначе
			СформироватьЛистСогласования(Ссылка, ТабДок);
		КонецЕсли;
	КонецЦикла;
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ЛистСогласования", НСтр("ru = 'Лист согласования'"), ТабДок);
КонецПроцедуры

Процедура  СформироватьЛистСогласования(Ссылка, ТабДок)
	
	Макет= ПолучитьМакет("ЛистСогласования");
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗадолженность= Макет.ПолучитьОбласть("Задолженность");
	ОбластьПроблема= Макет.ПолучитьОбласть("Проблема");
	ОбластьПодвал= Макет.ПолучитьОбласть("Подвал");
	
	Основание = Ссылка.Основание;
	
	//Шапка
	ОбластьШапка.Параметры.Заполнить(Основание);
	ОбластьШапка.Параметры.Заполнить(Ссылка);
	ОбластьШапка.Параметры.Дата= Формат(Основание.Дата, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка);
	//Задолженности
	Если Ссылка.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда
		ОбластьЗадолженность.Параметры.Заполнить(Ссылка);
		ТабДок.Вывести(ОбластьЗадолженность);
	Иначе
		ОбластьПроблема.Параметры.Заполнить(Ссылка);
		ТабДок.Вывести(ОбластьПроблема);
	КонецЕсли;
	//Подвал
	ОбластьПодвал.Параметры.Заполнить(Ссылка);
	ОбластьПодвал.Параметры.ОсновнойМенеджер = Ссылка.ОсновнойМенеджер;
	
	
	Если ЗначениеЗаполнено(Основание) Тогда
		РеквизитыОснования = Основание.Метаданные().Реквизиты;
		Если РеквизитыОснования.Найти("Автор") <> Неопределено Тогда 
			ОбластьПодвал.Параметры.АвторДокумента = Основание.Автор;
		ИначеЕсли РеквизитыОснования.Найти("Менеджер") <> Неопределено Тогда
			ОбластьПодвал.Параметры.АвторДокумента = Основание.Менеджер;
		КонецЕсли;
	КонецЕсли;
	
	//ОбластьШапка.Параметры.СчФактура = ПродажиВызовСервера.СчетФактураДокумента(Ссылка.Основание, Ссылка.Основание.Организация);
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры
#КонецОбласти 

#Область СозданиеНаОсновании
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	ИмяДокумента= "ЛистСогласования";
	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяДокумента]) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы[ИмяДокумента].ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы[ИмяДокумента]);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
#КонецОбласти 

Процедура ЗаполнитьДанныеПоОснованию(Основание, Объект, ВидОперации = Неопределено) Экспорт

	Если Основание <> Неопределено Тогда
		
		Если типзнч(Основание) = тип("документссылка.КорректировкаЗадолженности") Тогда
			ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления;
		КонецЕсли;
		
		Объект.ВидОперации = ВидОперации;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
			Объект.Дата = ТекущаяДата();
		Иначе 
			Объект.Дата = Основание.Дата;
		КонецЕсли;
		
		Объект.Основание = Основание.ссылка;		
		Объект.НомерДокумента = Основание.Номер;
		Объект.ДатаДокумента = Основание.Дата;
		Объект.Организация = Основание.Организация;
		Объект.Контрагент = Основание.Контрагент;
		Объект.Подразделение = Основание.Подразделение;
		
		Если ТипЗнч(Основание) <> Тип("ДокументСсылка.КорректировкаЗадолженности") И ТипЗнч(Основание) <> Тип("ДокументСсылка.ЗаказНаДоставкуКлиенту") 
			И ТипЗнч(Основание) <> Тип("ДокументСсылка.ЧекККМ") Тогда
			Объект.Договор = Основание.Договор;
			Объект.ОплатаДо = ЛистыСогласованияСервер.ПолучитьОплатуДо(Основание);

			Объект.СуммаДокумента = Основание.СуммаДокумента;
		КонецЕсли;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления
			И ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			Объект.ОсновнойМенеджер = Объект.Договор.Менеджер;
		Иначе			
			Если Не ЗначениеЗаполнено(Основание.Контрагент.Партнер.ОсновнойМенеджер) и ТипЗнч(Основание) <> Тип("документссылка.КорректировкаЗадолженности") Тогда	
				Объект.ОсновнойМенеджер = Объект.АвторДокумента;
			Иначе
				Объект.ОсновнойМенеджер = Основание.Контрагент.Партнер.ОсновнойМенеджер;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг") И ТипЗнч(Основание) <> Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
			Объект.МАП = Основание.Контрагент.Партнер.МАП;
		КонецЕсли;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаПриобретения") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда			
			Объект.АвторДокумента = Основание.Менеджер;
		Иначеесли ТипЗнч(Основание)<>Тип("документссылка.КорректировкаЗадолженности") тогда
			Объект.АвторДокумента = Основание.Автор;
		КонецЕсли;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Объект.Водитель = Основание.Водитель;
			Объект.ТелефонВодителя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
		КонецЕсли;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			НомераСчетовФактур = "";
			Для Каждого СчетФактураВыд Из Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(Основание) Цикл
				НомераСчетовФактур = НомераСчетовФактур + " " + СчетФактураВыд.Номер;
			КонецЦикла;
			Объект.СчетФактура = СокрЛП(НомераСчетовФактур);
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
			Объект.СчетФактура = СокрЛП(Основание.НомерВходящегоДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьЗадолженностьСервер(Объект);
КонецПроцедуры


#Область Экспортные

Процедура ОбновитьЗадолженностьСервер(Объект) Экспорт
	Объект.ЗадолженностьПоПартнеру= 0;
	Объект.ЗадолженностьПоДоговору= 0;
	Объект.ОстатокДоступногоЛимита= 0;
	Объект.СуммаСогласования= 0;
	ПорядокРасчетов= Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	
	Если типзнч(Объект.Основание)<>тип("документссылка.КорректировкаЗадолженности") И ТипЗнч(Объект.Основание) <> Тип("ДокументСсылка.ЗаказНаДоставкуКлиенту") 
			И ТипЗнч(Объект.Основание)<>Тип("ДокументСсылка.ЧекККМ") Тогда
		Если ЗначениеЗаполнено(Объект.Основание.Договор) Тогда
			ПорядокРасчетов= Объект.Основание.Договор.ПорядокРасчетов;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
		ДопустимаяСуммаЗадолженности= Объект.Основание.Договор.ДопустимаяСуммаЗадолженности;
		ДатаОстатковМоментВремени= Новый МоментВремени(Объект.Основание.Дата, Объект.Основание);
		
		ДатаОстатков= Новый Граница(ДатаОстатковМоментВремени, ВидГраницы.Включая);
		
		ЗадолженностьПоДоговору= ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоДоговору(ДатаОстатков, Объект.Основание.Договор);
		Объект.ЗадолженностьПоДоговору= ЗадолженностьПоДоговору- ДопустимаяСуммаЗадолженности;
		
		
		ЗадолженностьПоПартнеру= ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоПартнеру(ДатаОстатков, Объект.Основание.Партнер);
		Объект.ЗадолженностьПоПартнеру= ЗадолженностьПоПартнеру;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда
			Если ЛистыСогласованияСервер.ЕстьНеЗакрытыеЛистыПоДоговору(Объект) Тогда 
				Объект.СуммаСогласования= Объект.СуммаДокумента;
			ИначеЕсли Объект.СогласованиеПросроченнойЗадолженности тогда
				Объект.СуммаСогласования= Объект.СуммаДокумента;
			Иначе
				Если ЗначениеЗаполнено(Объект.Договор) Тогда
					Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоДоговору<0, 0, Объект.ЗадолженностьПоДоговору);
				Иначе
					Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоПартнеру<0, 0, Объект.ЗадолженностьПоПартнеру);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли  Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов Тогда
			ДатаОстатков= Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая);
			Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
				Договор = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(Объект.Основание.Договор);
				CтрукЗадолженность = ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоТранзитам(ДатаОстатков,Договор);
				Задолженность = CтрукЗадолженность.СуммаОстаток;
				Объект.ЗадолженностьПоДоговору = Задолженность;
				
				Если Задолженность >= 0 Тогда//Не было оплаты и есть задолженность
					Объект.СуммаСогласования = Объект.СуммаДокумента;
				ИначеЕсли Объект.СуммаДокумента + Задолженность < 0 Тогда//переплата
					Объект.СуммаСогласования = 0;
				Иначе//частичная или полная оплата
					Объект.СуммаСогласования = Объект.СуммаДокумента+Задолженность;
				КонецЕсли;
			Иначе
				Заказ = ОбъектыРасчетовСервер.ОбъектРасчетовИзСсылки(Объект.Основание);
				CтрукЗадолженность = ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоТранзитам(ДатаОстатков, Заказ);
				Объект.ЗадолженностьПоПартнеру = CтрукЗадолженность.СуммаОстаток;
				Объект.СуммаСогласования = ?(CтрукЗадолженность.КОплатеОстаток < 0, 0, CтрукЗадолженность.КОплатеОстаток); 
			КонецЕсли;
			//Объект.ЗадолженностьПоПартнеру как правило отрецательная
			//Если Задолженность >= 0 Тогда//Не было оплаты и есть задолженность
			//	Объект.СуммаСогласования = Объект.СуммаДокумента;
			//ИначеЕсли Объект.СуммаДокумента + Задолженность < 0 Тогда//переплата
			//	Объект.СуммаСогласования = 0;
			//Иначе//частичная или полная оплата
			//	Объект.СуммаСогласования = Объект.СуммаДокумента+Задолженность;
			//КонецЕсли;
			//Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоПартнеру<=0, , Объект.СуммаДокумента);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти 


#КонецЕсли
