
//++ Локализация
#Область ПрограммныйИнтерфейс

// Осуществляет разбор выписки банка
//
// Параметры:
// 	ЭлектроннаяВыпискаБанка - Ссылка - Электронная выписка
//
Процедура РазобратьВыпискуБанка(ЭлектроннаяВыпискаБанка) Экспорт
	
	ДенежныеСредстваСерверЛокализация.РазобратьВыпискуБанка(ЭлектроннаяВыпискаБанка);
	
КонецПроцедуры


// Возвращает номер банковского счета по уникальному идентификатору первичного документа.
// 
// Параметры:
//  ИдПервичногоДокумента - Строка - уникальный идентификатор объекта в информационной базе.
// 
// Возвращаемое значение:
// - Строка.
//
Функция БанковскийСчетПодтвержденияПоПервичномуДокументу(ИдПервичногоДокумента) Экспорт
	
	БанковскийСчет = "";
	
	ПервичныйДокумент = ДенежныеСредстваСерверЛокализация.ПервичныйДокументПоИдентификатору(ИдПервичногоДокумента);
			
	Если Не ПервичныйДокумент.Пустая() Тогда
		
		Если ПервичныйДокумент.Метаданные().Реквизиты.Найти("БанковскийСчет") <> Неопределено Тогда
			БанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервичныйДокумент, "БанковскийСчет.НомерСчета");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат БанковскийСчет;
	
КонецФункции

#КонецОбласти
//-- Локализация