#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Карточка номенклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МакетШтрихкода";
	КомандаПечати.Представление = НСтр("ru = 'Бейджик'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Бейджик'");
	
	// Карточка номенклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МакетQrкода";
	КомандаПечати.Представление = НСтр("ru = 'Бейджик - QR-код'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Бейджик - QR-код''"); 
	
	// Карточка номенклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МакетБейджикаВодителя";
	КомандаПечати.Представление = НСтр("ru = 'Бейджики для водителя'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Бейджики для водителя''");


КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетШтрихкода") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МакетШтрихкода", 
		"МакетШтрихкода", 
		СформироватьПечатнуюФормуМакетШтрихкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетQrкода") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МакетQrкода", 
		"МакетQrкода", 
		СформироватьПечатнуюФормуМакетQrкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;  
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетБейджикаВодителя") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МакетБейджикаВодителя", 
		"МакетБейджикаВодителя", 
		СформироватьПечатнуюФормуМакетБейджикаВодителя(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	

	
КонецПроцедуры

Функция СформироватьПечатнуюФормуМакетШтрихкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	//Ссылка= МассивОбъектов[0].Ссылка;
	
	ТабДок= Новый ТабличныйДокумент;
	Макет= ПолучитьМакет("МакетШтрихкода");
	Шапка= Макет.ПолучитьОбласть("Шапка");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Шапка.Параметры.Должность= ВРег(Ссылка.Должность);	
		Шапка.Параметры.Сотрудник= ВРег(Ссылка.Наименование);	
		
		//Штрихкод
		Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		Рисунок= Шапка.Рисунки[0];
		
		
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(Ссылка.Код));
		ПараметрыШтрихкода.Вставить("ТипКода",         99);
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    12);
		
		Рисунок.Картинка = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
		//-	
		
		ТабДок.Вывести(Шапка);
	КонецЦикла;
	Возврат ТабДок;
КонецФункции

Функция СформироватьПечатнуюФормуМакетQrкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	//Ссылка= МассивОбъектов[0].Ссылка;
	
	ТабДок= Новый ТабличныйДокумент;
	Макет= ПолучитьМакет("МакетQrкода");
	Шапка= Макет.ПолучитьОбласть("Шапка");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Шапка.Параметры.Должность= ВРег(Ссылка.Должность);	
		Шапка.Параметры.Сотрудник= ВРег(Ссылка.Наименование);	
		ТабДок.Вывести(Шапка);

		
		ОбластьQRкода = Макет.ПолучитьОбласть("ОбластьQRкода");;
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(СокрЛП(Ссылка.Код), 1, 200);
  		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
 		ОбластьQRкода.Рисунки.QRКод.Картинка = КартинкаQRКода;
		ТабДок.Вывести(ОбластьQRкода);

			КонецЦикла;
	Возврат ТабДок;
КонецФункции            

Функция СформироватьПечатнуюФормуМакетБейджикаВодителя(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	//Ссылка= МассивОбъектов[0].Ссылка;
	
	ТабДок= Новый ТабличныйДокумент;
	Макет= ПолучитьМакет("МакетБейджикаВодителя");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Для Каждого Строка Из Ссылка.БейджыВодителя Цикл
			
			Шапка= Макет.ПолучитьОбласть("Шапка");
			Отступ = Макет.ПолучитьОбласть("Отступ"); 
			Шапка.Параметры.Водитель= ВРег(Ссылка.Наименование);	
			Шапка.Параметры.ТранспортноеСредство= ВРег(Строка.ТранспортноеСредство);	
			ТабДок.Вывести(Шапка);

			
			ОбластьQRкода = Макет.ПолучитьОбласть("ОбластьQRкода");;
			ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(СокрЛП(Строка.Штрихкод), 1, 200);
	  		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
	 		ОбластьQRкода.Рисунки.QRКод.Картинка = КартинкаQRКода;
			ТабДок.Вывести(ОбластьQRкода);   
			ТабДок.Вывести(Отступ);
		КонецЦикла; 	

			КонецЦикла;
	Возврат ТабДок;
КонецФункции



Функция ПолучитьВодителяПоИдентификатору(ИдентификаторМобильногоПриложения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ИдентификаторМобильногоПриложения КАК ИдентификаторМобильногоПриложения,
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИдентификаторМобильногоПриложения = &ИдентификаторМобильногоПриложения";
	
	Запрос.УстановитьПараметр("ИдентификаторМобильногоПриложения", ИдентификаторМобильногоПриложения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции
#КонецЕсли
