
&ИзменениеИКонтроль("ПередФормированиемСпискаПолучателейРассылки")
Процедура Док_ПередФормированиемСпискаПолучателейРассылки(ПараметрыПолучателей, Запрос, СтандартнаяОбработка, Результат)

	Если ПараметрыПолучателей.Личная Тогда

		ТипПолучателей = ТипЗнч(ПараметрыПолучателей.Автор);

	Иначе 
		#Вставка
		Если ПараметрыПолучателей.ТипПолучателейРассылки.Пустая() Тогда 
			Возврат;
		КонецЕсли;
        #КонецВставки
		ТипПолучателей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПолучателей.ТипПолучателейРассылки, "КлючОбъектаМетаданных").Получить();

	КонецЕсли;

	Если ТипПолучателей = Тип("СправочникСсылка.Партнеры") Тогда

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "В ИЕРАРХИИ", "В");

	КонецЕсли;

КонецПроцедуры
