
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	тзнВрем = Параметры.ТаблицаСвойств.выгрузить();
	
	МассивСвойств 	= ПланыОбмена.Б_ОбменССайтом.ПолучитьСписокСвойств();
	
	Для каждого Свойство из МассивСвойств Цикл
		
		НайденнаяСтрока = тзнВрем.Найти(свойство.значение, "Свойство");
		
		Если НайденнаяСтрока = Неопределено тогда
			
			НовСтр =  НастройкаСвойствТоваровИХарактеристик.Добавить();
			НовСтр.Свойство = свойство.Значение;
		Иначе
			
			НовСтр =  НастройкаСвойствТоваровИХарактеристик.Добавить();
			НовСтр.Свойство = свойство.Значение;
			НовСтр.ВлияетНаЦену = НайденнаяСтрока.ВлияетНаЦену;
			НовСтр.ВыгружатьВХИ = НайденнаяСтрока.ВыгружатьВХИ;
			НовСтр.НеВыгружатьВСвойстваПредложений 	= НайденнаяСтрока.НеВыгружатьВСвойстваПредложений;
			НовСтр.НеВыгружатьВСвойстваТоваров 		= НайденнаяСтрока.НеВыгружатьВСвойстваТоваров;

		КонецЕсли;
		
	КонецЦикла;
	
	 НастройкаСвойствТоваровИХарактеристик.Сортировать("Свойство")
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаСвойств",НастройкаСвойствТоваровИХарактеристик);
	Закрыть(ПолучитьТаблицуСвойств());

КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуСвойств()
	Возврат НастройкаСвойствТоваровИХарактеристик;	
КонецФункции


