//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализОтклоненийВСтоимостиТоваров);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Анализ отклонений в стоимости товаров.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализОтклоненийВСтоимостиТоваровПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru= 'Анализ отклонений в стоимости товаров по организациям.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализОтклоненийВСтоимостиТоваровПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru= 'Анализ отклонений в стоимости товаров по предприятию.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
