#Область ПрограммныйИнтерфейс

Процедура ОповеститьОЗавершении() Экспорт
	
	НовыхЗаписей = ОбменМобильныеАвтономныйСервер.ПринятоОтправленоНовыхЗаписей();
	Если НовыхЗаписей.Принято <> 0 ИЛИ НовыхЗаписей.Отправлено <> 0 Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.Номенклатура"));
		ОбновитьИнтерфейс();
		ПоказатьОповещениеПользователя(НСтр("ru = 'Выполнена синхронизация'"), ,
			СтрШаблон(НСтр("ru = 'Принято объектов: %1. Отправлено объектов: %2.'"), НовыхЗаписей.Принято, НовыхЗаписей.Отправлено));
	КонецЕсли

КонецПроцедуры

#КонецОбласти