#Область ПрограммныйИнтерфейс

// см. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ДополнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
		
	ИндексПрофилей = ИндексироватьПрофили(ОписанияПрофилей, "Имя");
	//++ Локализация
	
	#Область Дополнить_профиль_СупервайзерТорговыхПредставителей
	ОписаниеПрофиля = НайтиПрофиль("СупервайзерТорговыхПредставителей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "СупервайзерТорговыхПредставителей");

		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		
		// Дополнительные права
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
		ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("АналитическиеОтчетыСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
		
		// Документы, чтение.

		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
		
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_Маркетолог
	ОписаниеПрофиля = НайтиПрофиль("Маркетолог", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
	
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Маркетолог");
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_РуководительОтделаПродаж
	ОписаниеПрофиля = НайтиПрофиль("РуководительОтделаПродаж", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "РуководительОтделаПродаж");

		// Справочники, чтение.

		// Документы, чтение.

		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспознанныхДокументов");
		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");

		// Дополнительные права
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
		// Работа с сервисом Share.
		ИнтеграцияShare.ДобавитьПраваИспользованияСервиса(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_МенеджерПоПродажам
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоПродажам", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоПродажам");
		// Документы, чтение.

		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспознанныхДокументов");
		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляОнлайнОплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);

		// Работа с сервисом Share.
		ИнтеграцияShare.ДобавитьПраваИспользованияСервиса(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Кассир
	ОписаниеПрофиля = НайтиПрофиль("Кассир", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Кассир");
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		
		// Документы, чтение.


		// Документы, создание.

		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Казначей
	ОписаниеПрофиля = НайтиПрофиль("Казначей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Казначей");
		// Нормативно-справочная информация
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
		
		// Документы чтение

		
		// Добавление документы.


		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовОнлайнОплаты");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОперацийПоЯндексКассе");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовОнлайнОплаты");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменСБанками");
		
		ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
		
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникРаботыССамозанятыми");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоУчетуНДС");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоОбеспечениюПотребностей
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоОбеспечениюПотребностей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоОбеспечениюПотребностей");
		// Нормативно-справочная информация
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
		
		// БизнесСеть.КоммерческиеПредложения
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ФинансовыйАналитик
	ОписаниеПрофиля = НайтиПрофиль("ФинансовыйАналитик", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ФинансовыйАналитик");
		// Прикладные роли
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		
		// Документы, чтение

		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомитента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНаНеподтвержденнуюРеализацию0");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоУчетуНДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданныхНаАванс");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Кладовщик
	ОписаниеПрофиля = НайтиПрофиль("Кладовщик", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Кладовщик");

		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоЗакупкам
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоЗакупкам", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоЗакупкам");

		// Документы, чтение.

		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
		
		// БизнесСеть.КоммерческиеПредолжения
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспознанныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникРаботыССамозанятыми");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомитента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданныхНаАванс");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);

		// Работа с сервисом Share.
		ИнтеграцияShare.ДобавитьПраваИспользованияСервиса(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Клиент
	ОписаниеПрофиля = НайтиПрофиль("Клиент", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Клиент");

		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеПартнеров
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеПартнеров", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ОтветственныйЗаВедениеПартнеров");

	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеНоменклатуры
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеНоменклатуры", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ОтветственныйЗаВедениеНоменклатуры");
		
		// отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаПересеченияШтрихкодовНоменклатурыСоСпецКодами");
	КонецЕсли;

	#КонецОбласти

	#Область Дополнить_профиль_РаботникСклада
	ОписаниеПрофиля = НайтиПрофиль("РаботникСклада", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "РаботникСклада");

	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоДоставке
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоДоставке", ОписанияПрофилей, ИндексПрофилей);	
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоДоставке");
		
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ОтправкаЗаказовНаДоставкуПеревозчикуСервисДоставки");
		
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_ПродавецКассирККМ
	ОписаниеПрофиля = НайтиПрофиль("ПродавецКассирККМ", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ПродавецКассирККМ");
		
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");
		
	КонецЕсли;
	#КонецОбласти
	

	
	#Область Дополнить_профиль_МенеджерПоРозничнойТорговле
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоРозничнойТорговле", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоРозничнойТорговле");

		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");

	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_УчастникСогласованияУсловийПродаж
	
	ОписаниеПрофиля = НайтиПрофиль("УчастникСогласованияУсловийПродаж", ОписанияПрофилей, ИндексПрофилей);
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	#КонецОбласти 
	
	#Область Дополнить_профиль_Ремонтник
	
	ОписаниеПрофиля = НайтиПрофиль("Ремонтник", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

	// ЛокализацияРаботыСЭПД
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
	КонецЕсли;
	
	#КонецОбласти 
	
	#Область Дополнить_профиль_Ремонтник
	
	ОписаниеПрофиля = НайтиПрофиль("Ремонтник", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

	// ЛокализацияРаботыСЭПД
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
	КонецЕсли;
	
	#КонецОбласти 
	
	#Область Дополнить_профиль_ДиспетчерСборкиИКурьерскойДоставки
	
	ОписаниеПрофиля = НайтиПрофиль("ДиспетчерСборкиИКурьерскойДоставки", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ОтправкаПлатежныхСсылокСБП");

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Дополнить_профиль_Бухгалтер
	
	ОписаниеПрофиля = НайтиПрофиль("Бухгалтер", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		// ЛокализацияРаботыСЭПД
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникРаботыССамозанятыми");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Дополнить_профиль_ИнициаторЗаявокНаРасходованиеДенежныхСредств
	
	ОписаниеПрофиля = НайтиПрофиль("ИнициаторЗаявокНаРасходованиеДенежныхСредств", ОписанияПрофилей, ИндексПрофилей);
	
	Если ОписаниеПрофиля <> Неопределено Тогда
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникРаботыССамозанятыми");
	КонецЕсли;
	
	#КонецОбласти 
	
	//-- Локализация

КонецПроцедуры

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// см. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
		
	ИндексироватьПрофили(ОписанияПрофилей, "Имя");
	//++ Локализация

	// Папка профилей "Государственные информационные системы".
	ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
	ОписаниеПапки.Имя           = "ГосударственныеИнформационныеСистемы";
	ОписаниеПапки.Идентификатор = "05de7c25-eb81-11eb-81dc-4cedfb6825bf";
	ОписаниеПапки.Наименование  =
		НСтр("ru = 'Государственные информационные системы'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПапки);

	#Область Создать_профиль_ОтветственныйЗаОбменЭД
	// Профиль "Ответственный за обмен электронными документами (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаОбменЭД";
	ОписаниеПрофиля.Идентификатор = "1c7bc32a-60eb-4395-ab8d-87fd6103a095";
	ОписаниеПрофиля.Родитель      = "Прочее";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за обмен электронными документами (дополнительный)'");

	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекEDI");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDIЗакупка");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDIПродажа");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDI");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДелEDI");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	
	// ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоАктированияЕИС");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, назначается пользователям, осуществляющим настройку
	                                      |соглашений по обмену электронными документами'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	#КонецОбласти
	
	#Область Создать_профиль_ВетеринарныйВрач

	// Профиль "Ветеринарный врач".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ВетеринарныйВрач";
	ОписаниеПрофиля.Идентификатор = "2434ce08-e835-48a1-a1c9-d02e5ce8adba";
	ОписаниеПрофиля.Родитель      = "ГосударственныеИнформационныеСистемы";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ветеринарный врач'");
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ВетеринарныйВрач");

	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");

	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");

	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");

	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");

	
	// ЛокализацияУчета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит оформление ветеринарной сопроводительной документации,
	                                      |оформление транспортных, производственных и складских операций с продукцией,
	                                      |автоматическое взаимодействие с системой ""Меркурий"".'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти
	
	
	
	//-- Локализация
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// см. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

	Описание = Описание + "
//++ Локализация
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Чтение.Организации
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Изменение.Организации
	|Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КассовыеКниги.Чтение.Организации
	|Справочник.КассовыеКниги.Изменение.Организации
	|Справочник.КвитанцииДТСПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КвитанцииДТСПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КэшВизуализацииДокументовЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КэшВизуализацииДокументовЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Чтение.ГруппыПартнеров
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Изменение.ГруппыПартнеров
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.МаршрутыПодписания.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Изменение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НастройкиОбменСБанками.Изменение.Организации
	|Справочник.НастройкиОнлайнОплат.Чтение.Организации
	|Справочник.НастройкиОнлайнОплат.Изменение.Организации
	|Справочник.НастройкиПодключенияКОнлайнЗаказам.Чтение.Организации
	|Справочник.НастройкиПодключенияКОнлайнЗаказам.Изменение.Организации
	|Справочник.Патенты.Чтение.Организации
	|Справочник.Патенты.Изменение.Организации
	|Справочник.ПатентыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПатентыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкаОПодтверждающихДокументахПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкаОПодтверждающихДокументахПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УчетныеЗаписиМаркетплейсов.Чтение.Организации
	|Справочник.УчетныеЗаписиМаркетплейсов.Изменение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Организации
	|Документ.АктСписанияЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Чтение.Организации
	|Документ.АктСписанияЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Изменение.Организации
	|Документ.БлокировкаВычетаНДС.Чтение.Организации
	|Документ.БлокировкаВычетаНДС.Изменение.Организации
	|Документ.ВводОстатковНДСПредъявленного.Чтение.Организации
	|Документ.ВводОстатковНДСПредъявленного.Изменение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Чтение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Изменение.Организации
	|Документ.ВозвратВОборотИСМП.Чтение.Организации
	|Документ.ВозвратВОборотИСМП.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Организации
	|Документ.ВыводИзОборотаИСМП.Чтение.Организации
	|Документ.ВыводИзОборотаИСМП.Изменение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Чтение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Изменение.Организации
	|Документ.ЗаписьКнигиПокупок.Чтение.Организации
	|Документ.ЗаписьКнигиПокупок.Изменение.Организации
	|Документ.ЗаписьКнигиПродаж.Чтение.Организации
	|Документ.ЗаписьКнигиПродаж.Изменение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Организации
	|Документ.ЗапросКоммерческихПредложенийПоставщиков.Чтение.Организации
	|Документ.ЗапросКоммерческихПредложенийПоставщиков.Изменение.Организации
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Чтение.Организации
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Изменение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Чтение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Изменение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.Организации
	|Документ.КоммерческоеПредложениеПоставщика.Чтение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеПоставщика.Чтение.Организации
	|Документ.КоммерческоеПредложениеПоставщика.Изменение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеПоставщика.Изменение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Чтение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Изменение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Чтение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Склады
	|Документ.ЛистКассовойКниги.Чтение.Организации
	|Документ.ЛистКассовойКниги.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.МаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.МаркировкаТоваровИСМП.Чтение.Организации
	|Документ.МаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ОперацияПоЯндексКассе.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Чтение.Организации
	|Документ.ОперацияПоЯндексКассе.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Изменение.Организации
	|Документ.ОстаткиЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Чтение.Организации
	|Документ.ОстаткиЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Изменение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Чтение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Изменение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.ОтчетЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Чтение.Организации
	|Документ.ОтчетЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Изменение.Организации
	|Документ.ОтчетИСМП.Чтение.Организации
	|Документ.ОтчетИСМП.Изменение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПакетОбменСБанками.Изменение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.ПеремаркировкаТоваровИСМП.Чтение.Организации
	|Документ.ПеремаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ПеремещениеМеждуМОДИСМП.Чтение.Организации
	|Документ.ПеремещениеМеждуМОДИСМП.Изменение.Организации
	|Документ.ПисьмоОбменСБанками.Чтение.Организации
	|Документ.ПисьмоОбменСБанками.Изменение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ПодключениеКегаКОборудованиюРозливаИСМП.Чтение.Организации
	|Документ.ПодключениеКегаКОборудованиюРозливаИСМП.Изменение.Организации
	|Документ.ПриемкаТоваровИСМП.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Изменение.Организации
	|Документ.РазрешениеНаОтгрузкуИСМП.Чтение.Организации
	|Документ.РазрешениеНаОтгрузкуИСМП.Изменение.Организации
	|Документ.СводнаяСправкаНДС.Чтение.Организации
	|Документ.СводнаяСправкаНДС.Изменение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СообщениеОбменСБанками.Изменение.Организации
	|Документ.СообщениеЭДО.Чтение.Организации
	|Документ.СообщениеЭДО.Изменение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Чтение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Изменение.Организации
	|Документ.СписаниеПартийЗЕРНО.Чтение.Организации
	|Документ.СписаниеПартийЗЕРНО.Изменение.Организации
	|Документ.СправкаОПодтверждающихДокументах.Чтение.Организации
	|Документ.СправкаОПодтверждающихДокументах.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.ВнешниеПользователи
	|Документ.СчетФактураВыданный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураКомиссионеру.Чтение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Чтение.Организации
	|Документ.СчетФактураКомиссионеру.Изменение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Изменение.Организации
	|Документ.СчетФактураКомитента.Чтение.Организации
	|Документ.СчетФактураКомитента.Изменение.Организации
	|Документ.СчетФактураНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураНалоговыйАгент.Изменение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Чтение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.Организации
	|Документ.ТранспортнаяНакладная.Чтение.Организации
	|Документ.ТранспортнаяНакладная.Изменение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.Организации
	|Документ.ТранспортныйКонтейнерЭДО.Чтение.Организации
	|Документ.ТранспортныйКонтейнерЭДО.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.Склады
	|Документ.ТТНВходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Изменение.Склады
	|Документ.ТТНИсходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Чтение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Изменение.Организации
	|Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Чтение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Изменение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Изменение.Организации
	|Документ.ЧекЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Чтение.Организации
	|Документ.ЧекЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Изменение.Организации
	|Документ.ЧекЕГАИСВозврат.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Чтение.Организации
	|Документ.ЧекЕГАИСВозврат.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Изменение.Организации
	|Документ.ЭлектроннаяСопроводительнаяВедомость.Чтение.Организации
	|Документ.ЭлектроннаяСопроводительнаяВедомость.Изменение.Организации
	|Документ.ЭлектроннаяТранспортнаяНакладная.Чтение.Организации
	|Документ.ЭлектроннаяТранспортнаяНакладная.Изменение.Организации
	|Документ.ЭлектронныйДоговорФрахтования.Чтение.Организации
	|Документ.ЭлектронныйДоговорФрахтования.Изменение.Организации
	|Документ.ЭлектронныйДокументВходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументВходящийЭДО.Изменение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Изменение.Организации
	|Документ.ЭлектронныйЗаказЗаявка.Чтение.Организации
	|Документ.ЭлектронныйЗаказЗаявка.Изменение.Организации
	|Документ.ЭлектронныйЗаказНаряд.Чтение.Организации
	|Документ.ЭлектронныйЗаказНаряд.Изменение.Организации
	|Документ.ЭлектронныйПутевойЛист.Чтение.Организации
	|Документ.ЭлектронныйПутевойЛист.Изменение.Организации
	|ЖурналДокументов.КорректировкиНДС.Чтение.Организации
	|ЖурналДокументов.ПрослеживаемостьУведомления.Чтение.Организации
	|ЖурналДокументов.РегламентныеДокументы.Чтение.Организации
	|РегистрСведений.ВерсииТитуловЭПД.Чтение.Организации
	|РегистрСведений.ВерсииТитуловЭПД.Изменение.Организации
	|РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Чтение.Организации
	|РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС.Изменение.Организации
	|РегистрСведений.ДанныеОснованийСчетовФактур.Чтение.Организации
	|РегистрСведений.ДетализацияСебестоимостиТоваров.Чтение.Организации
	|РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП.Чтение.Организации
	|РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.Чтение.Организации
	|РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.Изменение.Организации
	|РегистрСведений.ЖурналДействийПоЭДО.Чтение.Организации
	|РегистрСведений.ЖурналДействийПоЭДО.Изменение.Организации
	|РегистрСведений.ЖурналМашиночитаемыхДоверенностей.Чтение.Организации
	|РегистрСведений.ЖурналМашиночитаемыхДоверенностей.Изменение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Чтение.Организации
	|РегистрСведений.ЗаказыТорговыхПлощадок.Чтение.Организации
	|РегистрСведений.ЗаказыТорговыхПлощадок.Изменение.Организации
	|РегистрСведений.ЗначенияРеквизитовДокументовЭПД.Чтение.Организации
	|РегистрСведений.ЗначенияРеквизитовДокументовЭПД.Изменение.Организации
	|РегистрСведений.ИдентификаторыОнлайнЗаказов.Чтение.Организации
	|РегистрСведений.ИдентификаторыОнлайнЗаказов.Изменение.Организации
	|РегистрСведений.ИмпортируемыеТоварыТорговыхПлощадок.Чтение.Организации
	|РегистрСведений.ИмпортируемыеТоварыТорговыхПлощадок.Изменение.Организации
	|РегистрСведений.КэшВизуализацииДокументовЭДО.Чтение.Организации
	|РегистрСведений.КэшВизуализацииДокументовЭДО.Изменение.Организации
	|РегистрСведений.НастройкиВнутреннегоЭДО.Чтение.Организации
	|РегистрСведений.НастройкиВнутреннегоЭДО.Изменение.Организации
	|РегистрСведений.НастройкиОбменаЕИС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаЕИС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаЕИСДляЗаказчиков.Чтение.Организации
	|РегистрСведений.НастройкиОбменаЕИСДляЗаказчиков.Изменение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументов.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументов.Изменение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Изменение.Организации
	|РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Чтение.Организации
	|РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНДСПриУСН.Чтение.Организации
	|РегистрСведений.НастройкиУчетаУСН.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Изменение.Организации
	|РегистрСведений.НеОтправленныеПрикладныеОбъектыEDI.Чтение.Организации
	|РегистрСведений.ОбъектыУчетаДокументовЭДО.Чтение.Организации
	|РегистрСведений.ОбъектыУчетаДокументовЭДО.Изменение.Организации
	|РегистрСведений.ОграниченияВыгрузкиОстатковМаркетплейсов.Чтение.Организации
	|РегистрСведений.ОграниченияВыгрузкиОстатковМаркетплейсов.Изменение.Организации
	|РегистрСведений.ОстаткиТоваровМаркетплейсов.Чтение.Организации
	|РегистрСведений.ОстаткиТоваровМаркетплейсов.Изменение.Организации
	|РегистрСведений.ОчередьЗапросовВизуализацииЭДО.Чтение.Организации
	|РегистрСведений.ОчередьЗапросовВизуализацииЭДО.Изменение.Организации
	|РегистрСведений.ОчередьСообщенийЗЕРНО.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийИСМП.Чтение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Чтение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Чтение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Изменение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Чтение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Изменение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Склады
	|РегистрСведений.ПримененияЕНВД.Изменение.Организации
	|РегистрСведений.ПримененияЕНВД.Изменение.Склады
	|РегистрСведений.ПроверкиЭлектронныхПодписейЭДО.Чтение.Организации
	|РегистрСведений.ПроверкиЭлектронныхПодписейЭДО.Изменение.Организации
	|РегистрСведений.ПулКодовМаркировкиСУЗ.Чтение.Организации
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Организации
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Подразделения
	|РегистрСведений.РеестрЭПД.Чтение.Организации
	|РегистрСведений.РеестрЭПД.Изменение.Организации
	|РегистрСведений.РезультатыОбменаДаннымиСГИСНР.Чтение.Организации
	|РегистрСведений.РезультатыОбменаДаннымиСГИСНР.Изменение.Организации
	|РегистрСведений.СинхронизацияДанныхИСМП.Чтение.Организации
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|РегистрСведений.СоответствияАтрибутовМаркетплейсов.Чтение.Организации
	|РегистрСведений.СоответствияАтрибутовМаркетплейсов.Изменение.Организации
	|РегистрСведений.СоответствияОбъектовМаркетплейсов.Чтение.Организации
	|РегистрСведений.СоответствияОбъектовМаркетплейсов.Изменение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Изменение.Организации
	|РегистрСведений.СостоянияДокументовEDI.Чтение.Организации
	|РегистрСведений.СостоянияДокументовEDI.Чтение.ТипыДокументовEDI
	|РегистрСведений.СостоянияДокументовЭДО.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЭДО.Изменение.Организации
	|РегистрСведений.СтатусыОнлайнОплат.Чтение.Организации
	|РегистрСведений.СтатусыОнлайнОплат.Изменение.Организации
	|РегистрСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon.Чтение.Организации
	|РегистрСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon.Изменение.Организации
	|РегистрСведений.СубъектыДляСкрытияПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.ГруппыПартнеров
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.Организации
	|РегистрСведений.СчетаФактурыКомитентовКРегистрации.Чтение.Организации
	|РегистрСведений.СчетаФактурыПоставщиковКПеревыставлениюКомитентам.Чтение.Организации
	|РегистрСведений.ТекущиеОтправляемыеТранспортныеКонтейнерыЭДО.Чтение.Организации
	|РегистрСведений.ТоварыНаСкладахТорговыхПлощадокЗаДень.Чтение.Организации
	|РегистрСведений.ТоварыНаСкладахТорговыхПлощадокЗаДень.Изменение.Организации
	|РегистрСведений.УдалитьАктуальныеДокументыЭДО.Чтение.Организации
	|РегистрСведений.УдалитьАктуальныеДокументыЭДО.Изменение.Организации
	|РегистрСведений.УчетныеЗаписиЭДО.Чтение.Организации
	|РегистрСведений.УчетныеЗаписиЭДО.Изменение.Организации
	|РегистрСведений.ЧерновикиЭлектронныхДокументовЛегкийКлиентЭДО.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.ПартииЗатратНаВыпуск.Чтение.Организации
	|РегистрНакопления.ПартииПроизводственныхЗатрат.Чтение.Организации
	|РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ПартииТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Чтение.Организации
//-- Локализация
	|";

КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
// 
// Параметры:
//  ВидДоступа - Строка - вид доступа.
//  Использование - Булево - значение соответствующих констант.
//
// см. УправлениеДоступомУТ.ПриЗаполненииИспользованияВидаДоступа
//
Процедура ЗаполнитьИспользованиеВидаДоступа(ВидДоступа, Использование) Экспорт

	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	//++ Локализация
	// RLS на объекты подсистемы ЗащитаПерсональныхДанных поставляется в ролях
	//   ДобавлениеИзменениеФизическихЛиц
	//   ЧтениеФизическихЛиц
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		Если Список = Метаданные.Документы["ОтзывСогласияНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.Документы["СогласиеНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.РегистрыСведений["СогласияНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.РегистрыСведений["СубъектыДляСкрытияПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Субъект)";
		КонецЕсли;
	КонецЕсли;

	//-- Локализация
	
КонецПроцедуры

// см. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа
//
Процедура ЗаполнитьВидыДоступа(ВидыДоступа) Экспорт
	
	//++ Локализация
	
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ТипыДокументовEDI";
	ВидДоступа.Представление = НСтр("ru = 'Типы документов сервиса EDI'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ТипыДокументовEDI");
	
	//-- Локализация
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// Параметры:
//  Списки - см. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	Списки.Вставить(Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций, Истина);
	// Конец ЭлектронноеВзаимодействие
	
	УправлениеДоступомБП.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	// RLS на объекты подсистемы ЗащитаПерсональныхДанных поставляется в ролях
	//   ДобавлениеИзменениеФизическихЛиц
	//   ЧтениеФизическихЛиц
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		Списки.Вставить(Метаданные.Документы["ОтзывСогласияНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.Документы["СогласиеНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.РегистрыСведений["СогласияНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.РегистрыСведений["СубъектыДляСкрытияПерсональныхДанных"], Ложь);
	КонецЕсли;
	
	
	
	УчетПрослеживаемыхТоваровЛокализация.ПриЗаполненииСписковСОграничениемДоступа(Списки);
		
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	// Конец РаспознаваниеДокументов
	
	Списки.Вставить(Метаданные.Документы.АктПостановкиНаБалансЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.АктСписанияЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатковТМЦВЭксплуатации, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатковНДСПредъявленного, Истина);
	Списки.Вставить(Метаданные.Документы.ВыводИзОборотаИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратВОборотИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратИзРегистра2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВнесениеСведенийОСобранномУрожаеЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапросОстатковПартийЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВыпускКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаОбособленногоУчетаЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.ЛистКассовойКниги, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОперацияПоЯндексКассе, Истина);
	Списки.Вставить(Метаданные.Документы.ОстаткиЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтгрузкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОформлениеСДИЗЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаВРегистр2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеМеждуМОДИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПогашениеСДИЗЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ПодключениеКегаКОборудованиюРозливаИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПриемкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.РазрешениеНаОтгрузкуИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеКодовМаркировкиИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеПартийЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.СправкаОПодтверждающихДокументах, Истина);
	Списки.Вставить(Метаданные.Документы.ТранспортнаяНакладная, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНВходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНИсходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТранспортнаяНакладнаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УточнениеСведенийОКодахМаркировкиИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИСВозврат, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОЗачисленииВалюты, Истина);
	Списки.Вставить(Метаданные.Документы.ФормированиеПартийЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ФормированиеПартийИзДругихПартийЗЕРНО, Истина);
	Списки.Вставить(Метаданные.Документы.ФормированиеПартийПриПроизводствеЗЕРНО, Истина);
	
	Списки.Вставить(Метаданные.ЖурналыДокументов.РегламентныеДокументы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Истина);
	
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиОбменаСУЗ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиУчетаУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиУчетаНДСПриУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОграниченияВыгрузкиОстатковМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОстаткиТоваровМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИмпортируемыеТоварыТорговыхПлощадок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОчередьСообщенийИСМП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПримененияЕНВД, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПулКодовМаркировкиСУЗ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РегистрацииВНалоговомОргане, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СоответствияАтрибутовМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СоответствияОбъектовМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СинхронизацияДанныхИСМП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ТоварыНаСкладахТорговыхПлощадокЗаДень, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаказыТорговыхПлощадок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОчередьСообщенийЗЕРНО, Истина);
	
	Списки.Вставить(Метаданные.Справочники.Патенты, Истина);
	Списки.Вставить(Метаданные.Справочники.ПатентыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.КассовыеКниги, Истина);
	Списки.Вставить(Метаданные.Справочники.КлассификаторОрганизацийЕГАИС, Истина);
	Списки.Вставить(Метаданные.Справочники.ЛицензииПоставщиковАлкогольнойПродукции, Истина);
	Списки.Вставить(Метаданные.Справочники.РегистрацииВНалоговомОргане, Истина);
	Списки.Вставить(Метаданные.Справочники.ТранспортнаяНакладнаяПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СправкаОПодтверждающихДокументахПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.УчетныеЗаписиМаркетплейсов, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыХраненияПартийЗЕРНО, Истина);
	
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИндексироватьПрофили(ОписанияПрофилей, ПолеПрофиля = "Имя")
	
	Результат = Новый Соответствие;
	Для Индекс = 0 По ОписанияПрофилей.ВГраница() Цикл
		
		Профиль = ОписанияПрофилей[Индекс];
		Результат.Вставить(Профиль[ПолеПрофиля], Индекс);
		
	КонецЦикла;
	Возврат Результат;
	
КонецФункции
//++ Локализация
Функция НайтиПрофиль(ИмяПрофиля, ОписанияПрофилей, ИндексПрофилей)

	ИндексПрофиля = ИндексПрофилей[ИмяПрофиля];
	Если ИндексПрофиля = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ОписанияПрофилей[ИндексПрофиля];
	
КонецФункции
//-- Локализация

// Служебная функция. Сделана экспортной для удобства внедрения.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСАТУРН");
	
	// Необходимые роли БЭД
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// Новости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	
	// ЭлектронноеВзаимодействие.СервисДоставки
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСервисДоставки");
	// ЭлектронноеВзаимодействие.СервисДоставки
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиТорговыйПредставитель(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоОбеспечениюПотребностей(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");

	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");

	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиФинансовогоАналитика(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоЗакупкам(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГосударственныхКонтрактов");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	//-- Локализация
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.


//
Процедура ДобавитьРолиБухгалтераРеглУчетаНаЧтение(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппФинансовогоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");	
	
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркировокТоваровГИСМ");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛистовКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоЯндексКассе");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	
	
	// Чтение регистров.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиБухгалтера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыПереданныеНаКомиссию");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаУчетныеПолитикиОрганизаций");
	
	// Регистры сведений, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПримененияЕНВД");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");

	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаРегламентированныйУчет");
	
	// Доступ на чтение к учету НДС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокВидовДеятельностиНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНДССостояниеРеализации0");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомитента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНаНеподтвержденнуюРеализацию0");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("АналитическиеОтчетыСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	// Прослеживаемость импортных товаров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПрослеживаемыхТоваровВЕАЭС");
	
	//-- Локализация
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.


//
Процедура ДобавитьРолиБухгалтераРеглУчетаНаИзменение(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Справочники, чтение. 
	
	УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "БухгалтерРеглУчета");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированияПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛистовКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспознанныхДокументов");
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппФинансовогоУчета");
	
	// Обработки и отчеты

	
	
	// Регистры сведений, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПримененияЕНВД");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");

	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаРегламентированныйУчет");
	
	
	// Полный доступ к учету НДС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокВидовДеятельностиНДС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНДССостояниеРеализации0");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТаможенныхДекларацийИмпорта");
	
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомитента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурНаНеподтвержденнуюРеализацию0");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийПрослеживаемыхТоваров");
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	// Прослеживаемость импортных товаров
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияУчетПрослеживаемыхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПрослеживаемыхТоваровВЕАЭС");
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиСупервайзерТорговыхПредставителей(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМаркетолог(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиРуководительОтделаПродаж(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");

	// ЛокализацияРаботыСЭПД
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЭлектронныеПеревозочныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	
	// ЛокализацияРаботыСЯндексМаркет
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСтатусовПубликацииТоваровЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПродажиСФулфилментомЯндекса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажНаЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСоответствийОбъектовМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеОстатковТоваровМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейМаркетплейсов");
	
	// Обмен данными с маркетплейсом Ozon
	// Выше уже добавлены роли:
	//  "ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами",
	//  "РедактированиеСоответствийОбъектовМаркетплейсов",
	//  "РедактированиеОстатковТоваровМаркетплейсов",
	//  "ДобавлениеИзменениеУчетныхЗаписейМаркетплейсов".
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажиНаOzon");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПродажамиНаOzon");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	// ЭлектронноеВзаимодействие.СервисДоставки
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСервисДоставки");
	// Конец ЭлектронноеВзаимодействие.СервисДоставки
	
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГосударственныхКонтрактов");
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоДоставке(ОписаниеПрофиля) Экспорт
	//++ Локализация

	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджерПоПродажам(ОписаниеПрофиля) Экспорт
	//++ Локализация
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСтатусовПубликацииТоваровЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПродажиСФулфилментомЯндекса");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажНаЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСоответствийОбъектовМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеОстатковТоваровМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейМаркетплейсов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовОнлайнОплаты");
	
	// Обмен данными с маркетплейсом Ozon
	// Выше уже добавлены роли:
	//  "ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами",
	//  "РедактированиеСоответствийОбъектовМаркетплейсов",
	//  "РедактированиеОстатковТоваровМаркетплейсов",
	//  "ДобавлениеИзменениеУчетныхЗаписейМаркетплейсов".
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажиНаOzon");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПродажамиНаOzon");
	
	// ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИнтеграцияСЭлектроннымиТорговымиПлощадками");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПодключениямиКБидзаар");
	// Конец ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками
	
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГосударственныхКонтрактов");

	// Обмен данными с мобильным приложением "1С:Заказы"
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");     
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоРозничнойТорговле(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиКассир(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиКазначей(ОписаниеПрофиля) Экспорт
	//++ Локализация
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеОбновленийКлассификаторов");
	
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиКладовщик(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиАдминистраторПланирования(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиУчастникПланированияПроизводства(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиУчастникПланированияПродаж(ОписаниеПрофиля) Экспорт
	
	//++ Локализация

	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");

	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиУчастникПрогнозированияПродаж(ОписаниеПрофиля) Экспорт
	
	//++ Локализация

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельУправленияСервисомПрогнозирования");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервисаПрогнозированияПродаж");
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиАдминистраторПрогнозированияПродаж(ОписаниеПрофиля) Экспорт
	
	//++ Локализация

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельУправленияСервисомПрогнозирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекСервисаПрогнозированияПродаж");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервисаПрогнозированияПродаж");
	
	//-- Локализация
	
КонецПроцедуры



Процедура ДобавитьРолиТехнолог(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Облачные классификаторы 1С:Номенклатуры
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОблачныхКлассификаторов");
	//-- Локализация
	
КонецПроцедуры

//++ Локализация


//-- Локализация
#КонецОбласти
