
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Письмо= СоздатьЭлектронноеПисьмо(ПараметрКоманды);
	
	Если Письмо <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Ключ", Письмо);
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьЭлектронноеПисьмо(Партнер) 
	Обработка= Обработки.РассылкаПисемОНачисленныхБонусныхБаллах.Создать();
	Письмо= Обработка.СоздатьПисьмоПартнеру(Партнер);
	
	Возврат Письмо;
КонецФункции
