
&НаКлиенте
Процедура ЗагрузитьАналоги(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.АналогиНоменклатуры.Форма.Форма", ,ЭтаФорма,,,,Оповещение,);
КонецПроцедуры

&НаКлиенте 
Процедура ЗагрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт
   ЭтаФорма.Элементы.Список.Обновить();	
КонецПроцедуры  

&НаСервере
Процедура ПриОткрытииНаСервере()
   ЭтаФорма.Элементы.ЗагрузитьАналоги.Доступность = рольДоступна("ПолныеПрава") ИЛИ рольДоступна("РаботаСАналогами"); 
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

