
&НаКлиенте
Процедура Спр_СписокВыборЗначенияПеред(Элемент, Значение, СтандартнаяОбработка)
	Если не ПроверкиАльтерраСервер.РазрешенВыборСегментаКлиента() тогда
	   Если не ПроверкиАльтерраСервер.МожноВыбратьЭтотСегмент(Значение) тогда
		   СтандартнаяОбработка = ложь;	
		   ТекстСообщения = "Вам запрещено включение партнера в сегмент "+Значение+". Выберите другой сегмент";
		   ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
       Конецесли;  
   Конецесли;  
КонецПроцедуры

