
&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)  
//	ПолучитьЭквайринговыйТерминал();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЭквайринговыйТерминал()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиРМКЭквайринговыеТерминалы.НомерСтроки КАК НомерСтроки,
		|	НастройкиРМКЭквайринговыеТерминалы.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
		|ИЗ
		|	Справочник.НастройкиРМК.ЭквайринговыеТерминалы КАК НастройкиРМКЭквайринговыеТерминалы
		|ГДЕ
		|	НастройкиРМКЭквайринговыеТерминалы.Ссылка.РабочееМесто.Код = &Код

		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки	";  
	
	Запрос.УстановитьПараметр("Код", МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента().Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Если ЭквайринговыйТерминал <> Выборка.ЭквайринговыйТерминал Тогда
			ЭквайринговыйТерминал = Выборка.ЭквайринговыйТерминал;  
			ЭквайринговыйТерминалОтборПриИзмененииНаСервере();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура Док_КомандаСоздатьСоздатьВозвратОплатыКлиентуВместо(Команда)
	Основание = Новый Структура;
	Основание.Вставить("ХозяйственнаяОперация", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);   
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗакрытииСозданногоДокумента", ЭтаФорма);
	
	ОткрытьФорму("Документ.ОперацияПоПлатежнойКарте.ФормаОбъекта", ПараметрыФормы, Элементы.Список,,,,ОбработкаЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииСозданногоДокумента(Значение, ДопПараметры) Экспорт     
//	ПолучитьЭквайринговыйТерминал();
КонецПроцедуры	

&НаКлиенте
Процедура Док_СоздатьНовыйПосле(Команда)
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗакрытииСозданногоДокумента", ЭтаФорма);
	
	ОткрытьФорму("Документ.ОперацияПоПлатежнойКарте.ФормаОбъекта",, Элементы.Список,,,,ОбработкаЗавершения);
	
КонецПроцедуры


