Функция МожноПробивать(Документ) Экспорт
	Если ТипЗНЧ(Документ.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
		И Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента
		И НачалоДня(Документ.Дата) <> НачалоДня(ТекущаяДата())
		И НЕ Документ.Ссылка.ПометкаУдаления
		И Документ.Организация <> Справочники.Организации.НайтиПоРеквизиту("Префикс", "АК") Тогда
		Возврат Ложь;
	ИначеЕсли ТипЗНЧ(Документ.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") 
		И Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
		И НачалоДня(Документ.Дата) <> НачалоДня(ТекущаяДата())
		И НЕ Документ.Ссылка.ПометкаУдаления 
		И Документ.Организация <> Справочники.Организации.НайтиПоРеквизиту("Префикс", "АК") Тогда
		Возврат Ложь;
	ИначеЕсли ТипЗНЧ(Документ.Ссылка) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") 
		И НЕ (Документ.ЭквайринговыйТерминал = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("19", Истина) // Терминалы сайта
		  ИЛИ Документ.ЭквайринговыйТерминал = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("18", Истина))
		И НачалоДня(Документ.Дата) <> НачалоДня(ТекущаяДата())
		И НЕ Документ.Ссылка.ПометкаУдаления 
		И Документ.Организация <> Справочники.Организации.НайтиПоРеквизиту("Префикс", "АК") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&ИзменениеИКонтроль("ШтрихкодыУпаковокПоДокументамЗаполнены")
Функция Док_ШтрихкодыУпаковокПоДокументамЗаполнены(ДокументыРеализации) Экспорт
	#Удаление 
	Возврат ФормированиеФискальныхЧековСерверПереопределяемый.ШтрихкодыУпаковокПоДокументамЗаполнены(ДокументыРеализации);
	#КонецУдаления
	#Вставка
	Возврат Истина;
	#КонецВставки
КонецФункции

Процедура СообщитьОПробитии(Документ) Экспорт
	ТекстСообщения = "Попытка пробития документа "+строка(Документ)+Символы.ПС+"Пользователь: "+Строка(Пользователи.ТекущийПользователь());
	Список = ПолучитьНастройкиХранилища("АдресатыПолученияПопыткиПробитияДокументовНеСегодняшнейДатой");
	Для каждого Получатель Из Список.СписокПолучателей Цикл
		АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщения, Получатель.Значение);
	КонецЦикла;

КонецПроцедуры

// Возвращает структуру из настроек хранилища дополнительной обработки.
//
// Параметры:
//	ИмяФайла - поиск элемента справочника по имени файла 
//  ИмяСтруктуры - название структуры в структуре хранилища значений
// Возвращаемое значение:
//	Структура со значениями сохраненных настроек.
//
Функция ПолучитьНастройкиХранилища(ИмяСтруктуры,ИмяФайла="НастройкиХранилища.epf") экспорт
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", имяФайла);		
	СтруктураХранилища=ДополнительнаяОбработка.ХранилищеНастроек.Получить();
	если типзнч(СтруктураХранилища)=тип("Структура") и СтруктураХранилища.Свойство(ИмяСтруктуры) тогда
		Возврат СтруктураХранилища[ИмяСтруктуры] ;
	конецесли;
	возврат неопределено;
КонецФункции