&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МесяцНачалаСтрокой = ПолучитьПредставлениеМесяца(Объект.МесяцНачала);
    МесяцОкончанияСтрокой = ПолучитьПредставлениеМесяца(Объект.МесяцОкончания);

КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалаСтрокойПриИзменении(Элемент)
	
	Если МесяцНачалаСтрокой = "" Тогда 
		Объект.МесяцНачала = Дата(1,1,1);    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцОкончанияСтрокойПриИзменении(Элемент)
	
	Если МесяцОкончанияСтрокой = "" Тогда 
		Объект.МесяцОкончания = Дата(1,1,1);    
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
    МесяцНачалоВыбора(Истина);

КонецПроцедуры

&НаКлиенте
Процедура МесяцОкончанияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МесяцНачалоВыбора(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалоВыбора(НачалоПериода) 
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("МесяцНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("НачалоПериода", НачалоПериода));

	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
	Новый Структура("РежимВыбораПериода", "Месяц"),
	ЭтаФорма, , , ,ОповещениеЗавершения , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры      

&НаКлиенте
Процедура МесяцНачалоВыбораЗавершение(Значение, ДополнительныеПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Если ДополнительныеПараметры.НачалоПериода Тогда
			Объект.МесяцНачала = Значение;
	        МесяцНачалаСтрокой = ПолучитьПредставлениеМесяца(Объект.МесяцНачала);
		Иначе
			Объект.МесяцОкончания = КонецМесяца(Значение);
	        МесяцОкончанияСтрокой = ПолучитьПредставлениеМесяца(Объект.МесяцОкончания);		
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;

КонецПроцедуры   

&НаКлиенте
Процедура МесяцНачалаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.МесяцНачала = ДобавитьМесяц(Объект.МесяцНачала, Направление);
	МесяцНачалаСтрокой = ПолучитьПредставлениеМесяца(Объект.МесяцНачала);
	Модифицированность = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцОкончанияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка) 
	
	Объект.МесяцОкончания = ДобавитьМесяц(КонецМесяца(Объект.МесяцОкончания), Направление);
	МесяцОкончанияСтрокой = ПолучитьПредставлениеМесяца(Объект.МесяцОкончания);  
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеМесяца(Дата)
	
	Возврат Формат(Дата, "ДФ='ММММ'");
	
КонецФункции

