
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("Респондент", ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура ("Респондент", ПараметрКоманды));
	ОткрытьФорму("РегистрСведений.АнкетированиеОтветы.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	//ПараметрыФормы = Новый Структура("Респондент", ПараметрКоманды);
	//ОткрытьФорму("РегистрСведений.АнкетированиеОтветы.Форма.ФормаАнкетирования", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
