#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("РабочийУчасток",      РабочийУчасток);
		ДанныеЗаполнения.Свойство("Исполнитель",      Исполнитель);
		ДанныеЗаполнения.Свойство("Сотрудник",      Сотрудник);
		ДанныеЗаполнения.Свойство("НомерВходящегоДокумента",      НомерВходящегоДокумента);
		ДанныеЗаполнения.Свойство("Распоряжение",      Распоряжение);
		
		Если Не ЗначениеЗаполнено(НомерВходящегоДокумента) И Не (ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику")
			ИЛИ ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")) Тогда
			НомерВходящегоДокумента = Распоряжение.Номер;
		КонецЕсли;
		
		//Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		//	 ОтменаДвиженийРегистраСО = Истина;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(РабочийУчасток) И Товары.Количество()>0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
			|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
			|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
			|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
			|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
			|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
			|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
			|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
			|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
			|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
			|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
			|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
			|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
			|ИЗ
			|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
			|	0 КАК Количество,
			|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
			|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
			|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
			|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
			|	0 КАК КоличествоУпаковок,
			|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
			|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
			|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
			|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
			|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
			|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
			|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
			|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
			|ИЗ
			|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
			|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
			|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
			|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
			|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование";
			
			Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",Товары.Выгрузить());
			Запрос.УстановитьПараметр("Склад",Склад);
			Запрос.УстановитьПараметр("РабочиеУчастки",РабочийУчасток);
			
			Товары.Очистить();
			Товары.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят") Тогда
		ПроверяемыеРеквизиты.Добавить("НомерВходящегоДокумента");
	КонецЕсли; 
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	ДокументРеализации = ПолучитьДокументРеализации();
	
	Если Не Отказ И ЗначениеЗаполнено(Ссылка) И Не Проведен И ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если Не ПометкаУдаления Тогда                               // Записанный документ проводится
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					ДополнительныеСвойства.Вставить("НаличиеКорректировки", НаличиеКорректировки);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда      // Пометка на удаление записанного документа
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					Попытка
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
					Исключение
						ВызватьИсключение;
					КонецПопытки;
				КонецЕсли;
			ИначеЕсли Ссылка.ПометкаУдаления И Не ПометкаУдаления Тогда // Пометка на удаление снимается
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Истина);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					Попытка
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
					Исключение
						ВызватьИсключение;
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДополнительныеСвойства.Вставить("ЗначениеСтатуса", Ссылка.Статус);
	КонецЕсли;
	
КонецПроцедуры
	
Процедура СоздатьИзменитьБлокировкуДвиженияТоваров()
	
	РаспоряжениеЭтоЗаказНаПеремещениеИлиПеремещениеТоваров =
	ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ
	ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров");
	
	Если РаспоряжениеЭтоЗаказНаПеремещениеИлиПеремещениеТоваров ИЛИ
		ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ
		ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ 
		ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		
		//Маркировка   
		ТаблицаРасхожденийКМ = МаркировкаАльтерра.ПолучитьРасхожденияПоКодамМаркировки(Товары, ШтрихкодыУпаковок);  
		Если  ТаблицаРасхожденийКМ = Неопределено Или ТаблицаРасхожденийКМ.Пустой() Тогда  
			ЕстьРасхожденияКМ = Ложь;
		Иначе
			ЕстьРасхожденияКМ = Истина; 
		КонецЕсли; 
		//  
		
		БлокировкиПоПриходномуОрдеру = Альтерра_СкладСервер.ПолучитьБлокировкиПоОснования(Ссылка).Выгрузить();   
		//Маркировка 
		БлокировкаКМ = БлокировкиПоПриходномуОрдеру.Найти(Истина, "ПричинаРасхождениеКМ");
		УжеЕстьБлокировкаКМ = НЕ БлокировкаКМ = Неопределено;  
		ДокументБлокировкиКМ = Неопределено;
		//  
		Если БлокировкиПоПриходномуОрдеру.Количество() = 0 Тогда
			ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент(); 
			//Маркировка
			Если ЕстьРасхожденияКМ Тогда
				ДокументБлокировкиКМ = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент(); 
			КонецЕсли; 
			//
		ИначеЕсли БлокировкиПоПриходномуОрдеру.Количество() = 1 Тогда  
			//Маркировка
			Если УжеЕстьБлокировкаКМ Тогда  				
				ДокументБлокировкиКМ = БлокировкаКМ.Ссылка.ПолучитьОбъект();
				ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент(); 
			Иначе
				Если ЕстьРасхожденияКМ Тогда
					ДокументБлокировкиКМ = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент(); 
				КонецЕсли;
				ДокументБлокировки = БлокировкиПоПриходномуОрдеру[0].Ссылка.ПолучитьОбъект();  
			КонецЕсли;  
			// 
		ИначеЕсли БлокировкиПоПриходномуОрдеру.Количество() = 2 Тогда 
			//Маркировка
			Если УжеЕстьБлокировкаКМ Тогда  			 				
				ДокументБлокировкиКМ = БлокировкаКМ.Ссылка.ПолучитьОбъект(); 
				ДокументБлокировки = БлокировкиПоПриходномуОрдеру.Найти(Ложь, "ПричинаРасхождениеКМ").Ссылка.ПолучитьОбъект();  
			Иначе				
				АльтерраОбщегоНазначения.СообщитьПользователю(, "Внимание, заблокированные товары не соотвествуют приходному ордеру! Документ блокировки не изменен, так как блокировок по данному основанию больше одной!",);
				Возврат;			
			КонецЕсли;  
			// 
		Иначе
			АльтерраОбщегоНазначения.СообщитьПользователю(, "Внимание, заблокированные товары не соотвествуют приходному ордеру! Документ блокировки не изменен, так как блокировок по данному основанию больше одной!",);
			Возврат;
		КонецЕсли;  
		
		ИзлишкиПоПриходу = Альтерра_СкладСервер.ЕстьЛиНеЗаблокированныеТовары(Распоряжение, Ссылка); 
		ИзлишкиИзменены = Ложь;
		
		Если ЕстьРасхожденияКМ И НЕ ИзлишкиПоПриходу.Пустой() Тогда   
			ИзлишкиПоПриходу = ИзменитьКоличествоСУчетомРасхожденийКМ(ИзлишкиПоПриходу.Выгрузить(),ТаблицаРасхожденийКМ.Выгрузить()); 
			ИзлишкиИзменены = Истина;
		КонецЕсли;
		
		
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("Дата",			  Дата);
		ПараметрыЗаполнения.Вставить("Склад",			  Склад);
		ПараметрыЗаполнения.Вставить("ДокументОснование", Ссылка);
		ПараметрыЗаполнения.Вставить("Статус",			  Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
		ПараметрыЗаполнения.Вставить("Комментарий", 	  "Создан автоматически при принятии приходного ордера");
		ПараметрыЗаполнения.Вставить("ДополнительныеСвойства",	Новый Структура("КонтролироватьОбеспечение", Ложь));
		
		//Блокировка на товары, по которым не хватает кодов маркировки
		Если  ЕстьРасхожденияКМ Тогда 
			
			ПараметрыЗаполнения.Вставить("Товары",ТаблицаРасхожденийКМ);
			ПараметрыЗаполнения.Вставить("ПричинаБлокировки", Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при поступлении (нет кода маркировки)"));
			
			Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировкиКМ, ПараметрыЗаполнения); 
			Если Не УжеЕстьБлокировкаКМ Тогда  
				Если Не РаспоряжениеЭтоЗаказНаПеремещениеИлиПеремещениеТоваров Тогда
					БлокировкаКМ = Документы.ПриходныйОрдерНаТовары.ПолучитьБлокировкуРасхождениеКМ(Ссылка); 
					Если  БлокировкаКМ <> Неопределено Тогда
	   		        	Документы.ПриходныйОрдерНаТовары.ЗапуститьБпПоОтсутствиюКодаМаркировки(Ссылка,Распоряжение,РабочийУчасток,БлокировкаКМ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;		
		Иначе 
			Если ДокументБлокировкиКМ <> Неопределено Тогда
				Если ДокументБлокировкиКМ.Товары.Количество() > 0 И ДокументБлокировкиКМ.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда
					ДокументБлокировкиКМ.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Отменено;
					ДокументБлокировкиКМ.Записать(РежимЗаписиДокумента.Проведение);
					АльтерраОбщегоНазначения.СообщитьПользователю(ДокументБлокировки.Ссылка, "Отменен документ: " + ДокументБлокировки.Ссылка); 
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		
		//Блокировка на излишки
		Если Не ИзлишкиПоПриходу.Пустой() Тогда
			
			ПараметрыЗаполнения.Вставить("Товары",ИзлишкиПоПриходу);				
			Если РаспоряжениеЭтоЗаказНаПеремещениеИлиПеремещениеТоваров Тогда
				ПараметрыЗаполнения.Вставить("ПричинаБлокировки", Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при перемещении (брак, излишки)")); 
			Иначе
				ПараметрыЗаполнения.Вставить("ПричинаБлокировки", Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при поступлении (брак, излишки)")); 
			КонецЕсли;
			
			Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировки, ПараметрыЗаполнения);
			ОтправитьСообщениеМенеджеру(Распоряжение.Товары, Товары);
			
		Иначе 
			Если Альтерра_СкладСервер.НетТоваровСверхРаспоряжения(Распоряжение, Ссылка) Или ИзлишкиИзменены Тогда
				Если ДокументБлокировки.Товары.Количество() > 0 И ДокументБлокировки.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда
					ДокументБлокировки.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Отменено;
					ДокументБлокировки.Записать(РежимЗаписиДокумента.Проведение);
					АльтерраОбщегоНазначения.СообщитьПользователю(ДокументБлокировки.Ссылка, "Отменен документ: " + ДокументБлокировки.Ссылка);
				КонецЕсли;    
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры


&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)   
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	#Вставка                                
	УстановитьПривилегированныйРежим(Истина); 
	
	Если Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда
		
		Заказ = ПолучитьЗаказ();
		НужнаКорректировкаНазначения = Ложь;
		НужноПровестиБлокировку = Ложь;
		
		Если Не Заказ.Пустая() Тогда		
			Назначение = Документы.КорректировкаНазначенияТоваров.НазначениеЗаказа(Заказ);	
			Если Документы.КорректировкаНазначенияТоваров.ЕстьТоварыКСнятиюРезерва(Назначение) Тогда
				Если Не ДополнительныеСвойства.Свойство("НаличиеКорректировки") Тогда	
					НужнаКорректировкаНазначения = Истина;  
					Блокировка = ПолучитьБлокировкуДвиженияТоваров();
					
					Если Не Блокировка.Пустая() Тогда
						Попытка
							НужноПровестиБлокировку = Истина;
							БлокировкаОбъект = Блокировка.ПолучитьОбъект();
							БлокировкаОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						Исключение
							
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;   
		
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда 
		
		СоздатьИзменитьБлокировкуДвиженияТоваров();  
		
		Если НужноПровестиБлокировку Тогда 
				БлокировкаОбъект.ДополнительныеСвойства.Вставить("ПроведениеИзПриходногоОрдера",Истина);
				БлокировкаОбъект.Записать(РежимЗаписиДокумента.Проведение); 	
		КонецЕсли;
		
		Если НужнаКорректировкаНазначения Тогда
			СоздатьКорректировку(Заказ,Назначение);
		КонецЕсли;  
		
	КонецЕсли;
		
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Если Не ДатыЗапретаИзменения.ИзменениеЗапрещено("Документ.ПеремещениеТоваров",Распоряжение) Тогда
			Если Альтерра_СкладСервер.ТоварПоРаспоряжениюПринят(Распоряжение) Тогда
				МассивПеремещений = Новый Массив();
				МассивПеремещений.Добавить(Распоряжение);
				ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(МассивПеремещений, "Принято",);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗначениеСтатуса") И ДополнительныеСвойства.ЗначениеСтатуса <> Ссылка.Статус Тогда
		//записываем статус в регистр сведений СтатусыОрдеров
		НаборЗаписей = РегистрыСведений.СтатусыОрдеров.СоздатьНаборЗаписей();
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДата();
		Запись.Документ = Ссылка;
		Запись.Статус = Ссылка.Статус;
		Запись.Пользователь = Пользователи.ТекущийПользователь();  
		Запись.Сотрудник  = Альтерра_СкладСервер.ТекущийСотрудник();
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
	ПерепровестиПриобретенияТоваров();    
	
	РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьЯчейки(Отказ, Товары.ВыгрузитьКолонку("Номенклатура"), Склад, РабочийУчасток);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	#КонецВставки
	
КонецПроцедуры


Функция ПолучитьЗаказ() 
	
	Заказ = Документы.ЗаказКлиента.ПустаяСсылка();

	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ
		ТипЗнч(Распоряжение) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
			Если ТипЗнч(Распоряжение.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				И ЗначениеЗаполнено(Распоряжение.ДокументРеализации.ЗаказКлиента) Тогда
				Заказ = Распоряжение.ДокументРеализации.ЗаказКлиента;
			КонецЕсли;
		Иначеесли ЗначениеЗаполнено(Распоряжение.ДокументОснование.ЗаказКлиента) тогда 
			Заказ = Распоряжение.ДокументОснование.ЗаказКлиента;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Заказ;	
	
КонецФункции

Процедура ОтправитьСообщениеМенеджеру(ТоварыРаспоряжения, ТоварыОрдера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыРаспоряжения.Номенклатура КАК Номенклатура,
	|	ТоварыРаспоряжения.Характеристика КАК Характеристика,
	|	ТоварыРаспоряжения.Назначение КАК Назначение,
	|	ТоварыРаспоряжения.Количество КАК Количество
	|ПОМЕСТИТЬ ТоварыРаспоряжения
	|ИЗ
	|	&ТоварыРаспоряжения КАК ТоварыРаспоряжения
	|ГДЕ
	|	НЕ ТоварыРаспоряжения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрдера.Номенклатура КАК Номенклатура,
	|	ТоварыОрдера.Характеристика КАК Характеристика,
	|	ТоварыОрдера.Назначение КАК Назначение,
	|	ТоварыОрдера.Количество КАК Количество
	|ПОМЕСТИТЬ ТоварыОрдера
	|ИЗ
	|	&ТоварыОрдера КАК ТоварыОрдера
	|ГДЕ
	|	НЕ ТоварыОрдера.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыРаспоряжения.Номенклатура КАК Номенклатура,
	|	ЗаказКлиента.Ссылка КАК Заказ,
	|	ЗаказКлиента.Менеджер КАК Менеджер
	|ИЗ
	|	ТоварыРаспоряжения КАК ТоварыРаспоряжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ТоварыРаспоряжения.Назначение.Заказ = ЗаказКлиента.Ссылка
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыОрдера КАК ТоварыОрдера
	|		ПО ТоварыРаспоряжения.Номенклатура = ТоварыОрдера.Номенклатура
	|			И ТоварыРаспоряжения.Характеристика = ТоварыОрдера.Характеристика
	|			И ТоварыРаспоряжения.Назначение = ТоварыОрдера.Назначение
	|ГДЕ
	|	ТоварыРаспоряжения.Количество > ТоварыОрдера.Количество
	|ИТОГИ ПО
	|	Менеджер,
	|	Заказ";
	
	Запрос.УстановитьПараметр("ТоварыРаспоряжения", ТоварыРаспоряжения);
	Запрос.УстановитьПараметр("ТоварыОрдера", ТоварыОрдера);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМенеджер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМенеджер.Следующий() Цикл
		Менеджер = ВыборкаМенеджер.Менеджер; 
		
		ВыборкаЗаказ = ВыборкаМенеджер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтрокаСообщения = "";
		
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			Заказ = ВыборкаЗаказ.Заказ;
			
			МассивНоменклатуры = Новый Массив;
			
			Выборка = ВыборкаЗаказ.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				МассивНоменклатуры.Добавить(Выборка.Номенклатура);
				
			КонецЦикла;
			
			СтрокаСообщения = СтрокаСообщения + Символы.ПС + Строка(Заказ) + Символы.ПС + СтрСоединить(МассивНоменклатуры, Символы.ПС);
			
		КонецЦикла;
		
		ТекстСообщения = "По следующим позициям создана блокировка товаров:" + Символы.ПС + СтрокаСообщения;
		
		АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщения, Менеджер);
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьКорректировкиНазначенияПоЗаказу(Заказ)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	КорректировкаНазначенияТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаНазначенияТоваров КАК КорректировкаНазначенияТоваров
	|ГДЕ
	|	КорректировкаНазначенияТоваров.Проведен = Истина
	|	И КорректировкаНазначенияТоваров.Назначение.Заказ = &Заказ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	
	Выборка = Запрос.Выполнить();
	
	Если Выборка.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Альтерра_СкладСервер.ПоДокументуЕстьАктПоРасхождениям(ЭтотОбъект.Распоряжение) И не АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава") Тогда
		Отказ = Истина;
		Сообщить("По документу основанию есть акт по расхождениям, реадактирование заблокировано!");
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
		|ГДЕ
		|	БлокировкаДвиженияТоваров.ПометкаУдаления = ЛОЖЬ
		|	И БлокировкаДвиженияТоваров.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			БлокировкаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			БлокировкаОбъект.УстановитьПометкуУдаления(Истина);
			Сообщить("Удален: "+БлокировкаОбъект.Ссылка);
		КонецЦикла;
		
		////Поиск и установка пометки удаления файлов, присоединенных через ТСД
		ИмяПапки = СтрЗаменить(СтрЗаменить(Строка(ЭтотОбъект.Ссылка), ":", "_"), " ", "_");
		ПапкаСФайламиОрдера = Справочники.ЗаказПоставщикуПрисоединенныеФайлы.НайтиПоНаименованию(ИмяПапки, Истина);
		Если ЗначениеЗаполнено(ПапкаСФайламиОрдера) Тогда
			ПапкаОрдера = ПапкаСФайламиОрдера.ПолучитьОбъект();
			ПапкаОрдера.ПометкаУдаления = Истина;
			ПапкаОрдера.Записать();
		КонецЕсли;
		////
		
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&Перед("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	ДокументРеализации = ПолучитьДокументРеализации();		
	Если Не Отказ И ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Истина, Ложь);
		Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
			Попытка
				Если ПометкаУдаления Тогда // Пометка на удаление проведенного документа
					НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
				Иначе                      // Распроведение документа
					НаличиеКорректировки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			Исключение
				ВызватьИсключение;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения1(Отказ)
	
	ОбъектРаспоряжение = Распоряжение.ПолучитьОбъект();
	НуженКонтрольОтметкиКассы = ОбъектРаспоряжение.Метаданные().Реквизиты.Найти("Кассир") <> Неопределено;
	
	Если НуженКонтрольОтметкиКассы И Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда
		АльтерраОбщегоНазначения.КонтрольОтметкиКассы(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ОбменУТМПСервер.УдалитьСвязанныеЗаписиОбменМП(Ссылка);
	
КонецПроцедуры

Функция ПолучитьДокументРеализации()
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Возврат Распоряжение.ДокументРеализации;
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Возврат Распоряжение.ДокументОснование;
	Иначе
		Возврат Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
КонецФункции


Процедура ПерепровестиПриобретенияТоваров()
	
	// Проверка на другие принятые приходные ордера у заказа поставщику в этом приходном ордере
	Запрос = Новый Запрос;	
	Запрос.Текст =  
	"ВЫБРАТЬ 
	|	ДругойПриходныйОрдер.Ссылка  ДругойПриходныйОрдерСсылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдер
	|	СОЕДИНЕНИЕ 
	|		Документ.ЗаказПоставщику КАК Заказ
	|		ПО 
	|			ВЫРАЗИТЬ(ПриходныйОрдер.Распоряжение КАК Документ.ЗаказПоставщику).Ссылка = Заказ.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ПриходныйОрдерНаТовары КАК ДругойПриходныйОрдер
	|		ПО 
	|			Заказ.Ссылка = ВЫРАЗИТЬ(ДругойПриходныйОрдер.Распоряжение КАК Документ.ЗаказПоставщику).Ссылка
	|			И ДругойПриходныйОрдер.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|			И ПриходныйОрдер.ССылка <> ДругойПриходныйОрдер.Ссылка
	|ГДЕ ПриходныйОрдер.Ссылка = &ПриходныйОрдер	
	|И ПриходныйОрдер.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)";
	
	Запрос.УстановитьПараметр("ПриходныйОрдер", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		
		Если Выборка.ДругойПриходныйОрдерСсылка = Null Тогда
			
			// Получение списка приобретений для перепроведения		
			ЗапросНаИзменения = Новый Запрос;	
			ЗапросНаИзменения.Текст =  
			"ВЫБРАТЬ 
			|	Приобретение.Ссылка ПриобретениеСсылка
			|ИЗ
			|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдер
			|СОЕДИНЕНИЕ 
			|	Документ.ЗаказПоставщику КАК Заказ
			|	ПО 
			|		ВЫРАЗИТЬ(ПриходныйОрдер.Распоряжение КАК Документ.ЗаказПоставщику).Ссылка = Заказ.Ссылка
			|СОЕДИНЕНИЕ 
			|	Документ.ПриобретениеТоваровУслуг КАК Приобретение
			|	ПО 
			|		Заказ.Ссылка = Приобретение.ЗаказПоставщику
			|     	И Приобретение.ПометкаУдаления = Ложь
			|ГДЕ ПриходныйОрдер.Ссылка = &ПриходныйОрдер	
			|И ПриходныйОрдер.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)";
			
			ЗапросНаИзменения.УстановитьПараметр("ПриходныйОрдер", Ссылка);
			ВыборкаНаИзменения = ЗапросНаИзменения.Выполнить().Выбрать();
			
			ОшибкаПриПроведении = Ложь;
			
			Пока ВыборкаНаИзменения.Следующий() Цикл
				
				Если Не ДатыЗапретаИзменения.ИзменениеЗапрещено("Документ.ПриобретениеТоваровУслуг",ВыборкаНаИзменения.ПриобретениеСсылка) Тогда
					ДокументОбъект = ВыборкаНаИзменения.ПриобретениеСсылка.ПолучитьОбъект();	
					ДокументОбъект.Дата = Дата - 300;
					Для каждого Строка Из ДокументОбъект.ЭтапыГрафикаОплаты Цикл
						Строка.ДатаПлатежа = Дата+24*60*60; 
					КонецЦикла;
					Попытка
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ОшибкаПриПроведении = Истина;
					КонецПопытки
				Иначе
					ОшибкаПриПроведении = Истина;
				КонецЕсли;
				
				Если ОшибкаПриПроведении Тогда
					Сообщить("Не удалось перепровести приобретение!");
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьКорректировку(Заказ,Назначение)
	
	КорректировкаНазначения = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Организация");
	
	КорректировкаНазначения.Организация = Организация;
	КорректировкаНазначения.Назначение = Назначение;
	КорректировкаНазначения.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
	//КорректировкаНазначения.ДокументПоРаспоряжению = ЗначениеЗаполнено(Заказ);
	КорректировкаНазначения.Дата = ТекущаяДатаСеанса();
	КорректировкаНазначения.УстановитьНовыйНомер();
	КорректировкаНазначения.Автор = Справочники.Пользователи.НайтиПоНаименованию("Администратор"); 
	КорректировкаНазначения.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КорректировкаНазначения.Комментарий = "Создана автоматически при создании документа "" " + Ссылка + """";
	
	Для Каждого СтрокаТовара Из Товары Цикл
		Если СтрокаТовара.Назначение = Назначение Тогда
			СтрокаПродукция = КорректировкаНазначения.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПродукция, СтрокаТовара);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(КорректировкаНазначения, Документы.КорректировкаНазначенияТоваров));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(КорректировкаНазначения, ПараметрыУказанияСерий);
	
	Документы.КорректировкаНазначенияТоваров.ЗаполнитьПоОснованию(Назначение, 
	Организация,
	КорректировкаНазначения.Ссылка, 
	Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв, 
	КорректировкаНазначения.Товары,
	КорректировкаНазначения.Товары.Выгрузить());
	
	СкладЗаполнен = Истина;
	
	Для каждого Строка из КорректировкаНазначения.Товары Цикл
		Если Не ЗначениеЗаполнено(Строка.Склад) Тогда
			СкладЗаполнен = Ложь;
			Сообщить("Корректировка назначения не создана. Передайте информацию технической поддержке."); 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КорректировкаНазначения.Товары.Количество()>0 И СкладЗаполнен Тогда
		КорректировкаНазначения.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Если ЕстьКорректировкиНазначенияПоЗаказу(Заказ) Тогда
		АльтерраОбщегоНазначения.СообщитьПользователю(, "По заказу есть корректировки назначения!",);
	КонецЕсли;
	
КонецПроцедуры
	
Функция ПолучитьБлокировкуДвиженияТоваров() 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
		|ГДЕ
		|	БлокировкаДвиженияТоваров.ДокументОснование = &ДокументОснование
		|	И БлокировкаДвиженияТоваров.ПометкаУдаления = ЛОЖЬ
		|	И БлокировкаДвиженияТоваров.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("ДокументОснование", Распоряжение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда  
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Документы.БлокировкаДвиженияТоваров.ПустаяСсылка();
		КонецЕсли;
		
	КонецФункции
	
Функция ИзменитьКоличествоСУчетомРасхожденийКМ(ИзлишкиПоПриходу,РасхжденияКМ)
		
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзлишкиПоПриходу.Номенклатура КАК Номенклатура,
		|	ИзлишкиПоПриходу.Характеристика КАК Характеристика,
		|	ИзлишкиПоПриходу.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ИзлишкиПоПриходу
		|ИЗ
		|	&ИзлишкиПоПриходу КАК ИзлишкиПоПриходу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасхжденияКМ.Номенклатура КАК Номенклатура,
		|	РасхжденияКМ.Характеристика КАК Характеристика,
		|	РасхжденияКМ.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ РасхжденияКМ
		|ИЗ
		|	&РасхжденияКМ КАК РасхжденияКМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзлишкиПоПриходу.Номенклатура КАК Номенклатура,
		|	ИзлишкиПоПриходу.Характеристика КАК Характеристика,
		|	ИзлишкиПоПриходу.КоличествоУпаковок - ЕстьNull(РасхжденияКМ.КоличествоУпаковок,0) КАК КоличествоУпаковок
		|ИЗ
		|	ИзлишкиПоПриходу КАК ИзлишкиПоПриходу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасхжденияКМ КАК РасхжденияКМ
		|		ПО ИзлишкиПоПриходу.Номенклатура = РасхжденияКМ.Номенклатура
		|			И ИзлишкиПоПриходу.Характеристика = РасхжденияКМ.Характеристика
		|   ГДЕ (ИзлишкиПоПриходу.КоличествоУпаковок - ЕстьNull(РасхжденияКМ.КоличествоУпаковок,0)) > 0"; 
		
		Запрос.УстановитьПараметр("ИзлишкиПоПриходу",ИзлишкиПоПриходу);
		Запрос.УстановитьПараметр("РасхжденияКМ",РасхжденияКМ);
	Возврат Запрос.Выполнить();	
		
	КонецФункции
	
#КонецЕсли
