#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнитьПоЗначениямАвтозаполнения(ДанныеЗаполнения);
	ИнициализироватьДокумент(ДанныеЗаполнения);
	если ЭтотОбъект.ЭтоНовый() тогда
		Водитель =   ДопМодуль.ВодительТС(ответственный);
		если ЗначениеЗаполнено(Водитель) тогда
			ТранспортноеСредство=ДопМодуль.ТранспортноеСредство(Водитель);
			если не ЗначениеЗаполнено(Механик) тогда
				Механик=ТранспортноеСредство.Механик;
			конецесли;	
		конецесли;
		если ЗначениеЗаполнено(ТранспортноеСредство) тогда
			ДанныеТоплива=ДопМодуль.ТопливоПоРасходу(ТранспортноеСредство);
			если ДанныеТоплива<>НЕОПРЕДЕЛЕНО тогда
				Топливо=ДанныеТоплива;
				НормаРасхода=ДопМодуль.ПолучитьНормуРасхода(ЭтотОбъект);
			конецесли;	
			СпидометрНачало=Документы.ПутевойЛист.ПоказаниеСпидометра(Ссылка,ТранспортноеСредство);
			СпидометрВозвращение=СпидометрНачало;
		конецесли;
		если ЗначениеЗаполнено(Водитель) и ЗначениеЗаполнено(Топливо) тогда
			если Водитель.УчитыватьОстатокТоплива тогда
				ОстатокПриВыезде=Документы.ПутевойЛист.ОстатокГСМ(Ссылка,Водитель.СкладТоплива,Топливо);
			конецесли;	
		конецесли;	
	конецесли;	
КонецПроцедуры

Процедура ЗаполнитьПоЗначениямАвтозаполнения(ДанныеЗаполнения = Неопределено)
	
	ЕстьДанныеЗаполнения = (НЕ ДанныеЗаполнения = Неопределено);
	ДанныеЗаполненияСтруктура = (ТипЗнч(ДанныеЗаполнения) = Тип("Структура"));
	
	Если Не ЕстьДанныеЗаполнения Или ДанныеЗаполненияСтруктура И НЕ ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		// Заполним основные свойства
		СвойстваАвтозаполнения = Новый Структура("Организация,Ответственный,АдресПодачи");
		СтрокаКлючиСтруктуры = СокрЛП(ОбменДаннымиСобытия.КлючиСтруктурыВСтроку(СвойстваАвтозаполнения));
		
		Если ДанныеЗаполненияСтруктура Тогда
			ЗаполнитьЗначенияСвойств(СвойстваАвтозаполнения, ДанныеЗаполнения);
		КонецЕсли;
		
		ОбщегоНазначенияУТ.ОбработкаЗаполнения(СвойстваАвтозаполнения, Неопределено, Неопределено);
		
		ОбщегоНазначенияУТ.ОбработкаЗаполнения(ЭтотОбъект, СвойстваАвтозаполнения, Истина);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СвойстваАвтозаполнения, СтрокаКлючиСтруктуры);
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    если ТранспортноеСредство.УчитыватьПоказанияСпидометра тогда
	// регистр ПоказанияСпидометра
	Движения.ПоказанияСпидометра.Записывать = Истина;
	Движение = Движения.ПоказанияСпидометра.Добавить();
	Движение.Период = Дата;
	Движение.ТранспортноеСредство = ТранспортноеСредство;
	Движение.Показания = СпидометрВозвращение;
	конецесли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	если Водитель.УчитыватьОстатокТоплива тогда
	Движения.ДвижениеТоплива.Записывать=Истина;
	Движение = Движения.ДвижениеТоплива.Добавить();
	Движение.ВидДвижения=ВидДвиженияНакопления.Расход;	
	Движение.Период = Дата;
	Движение.Склад=Водитель.СкладТоплива;
	Движение.ПутевойЛист=ЭтотОбъект.Ссылка;
	Движение.Топливо=Топливо;
	Движение.Количество=РасходФактический;
	конецесли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
КонецПроцедуры

#КонецОбласти         

#КонецОбласти

#КонецЕсли
