#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника.
//  ТабличныеЧасти - Структура - Ключ - имя табличной части объекта
//                               Значение - Выгрузка в таблицу значений пустой табличной части
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	#Область ВодительскоеУдостоверение
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВодительскоеУдостоверение";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Водительское удостоверение'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	//++ Локализация

	#Область ВоенныйБилет
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВоенныйБилет";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Военный билет'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ВоенныйБилетОфицераЗапаса
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВоенныйБилетОфицераЗапаса";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Военный билет офицера запаса'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ВременноеУдостоверениеВзаменВоенногоБилетаОфицераЗапаса
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВременноеУдостоверениеВзаменВоенногоБилетаОфицераЗапаса";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Временное удостоверение, выданное взамен военного билета офицера запаса'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ДипломатическийПаспорт
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДипломатическийПаспорт";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Дипломатический паспорт гражданина РФ'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ЗагранпаспортРФ
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗагранпаспортРФ";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Загранпаспорт гражданина РФ'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ЗагранпаспортСССР
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗагранпаспортСССР";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Загранпаспорт гражданина СССР'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ПаспортРФ
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортРФ";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Паспорт гражданина РФ'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ПаспортСССР
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортСССР";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Паспорт гражданина СССР'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ПаспортМинморфлота
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортМинморфлота";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Паспорт Минморфлота'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область ПаспортМоряка
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортМоряка";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Паспорт моряка'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область СвидетельствоОРождении
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СвидетельствоОРождении";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Свидетельство о рождении'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область СправкаВзаменВоенногоБилета
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СправкаВзаменВоенногоБилета";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Справка взамен военного билета'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область УдостоверениеГражданинаПодлежащегоПризыву
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УдостоверениеГражданинаПодлежащегоПризыву";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Удостоверение гражданина, подлежащего призыву на военную службу'", КодыЯзыков); // @НСтр-2
	#КонецОбласти

	#Область УдостоверениеОфицера
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УдостоверениеОфицера";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Удостоверение личности офицера'", КодыЯзыков); // @НСтр-2
	#КонецОбласти
	
	//-- Локализация
	
КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - СправочникОбъект.СтатьиДвиженияДенежныхСредств - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	
	МультиязычностьСервер.ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка, Метаданные.Справочники.ВидыДокументовФизическихЛиц);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
