&После("ДобавитьКомандыСозданияНаОсновании")
Процедура Док_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)
	Документы.СверкаВзаиморасчетов2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеFNS(Контрагент) Экспорт
	
	Если Контрагент.ИНН<>"" Тогда
		Данные = ОбщийHTTPСервер.ПолучитьДанныеССайтаFNS(Контрагент.ИНН, Контрагент.ЮрФизЛицо);
		
		КонтрагентОбъект = Контрагент.ПолучитьОбъект();
		Для Индекс = 0 По Данные.ВГраница()-1 Цикл
			
			ДокументРезультат = Новый ТабличныйДокумент;
			
			Макет = Справочники.Контрагенты.ПолучитьМакет("Док_ДанныеФНС");    
			ОблСтрока = Макет.ПолучитьОбласть("ОблСтрока"); 
			
			ДокументРезультат.НачатьАвтогруппировкуСтрок();
			
			Для Каждого ТекСтрока Из Данные[Индекс] Цикл 
				ОблСтрока.Параметры.Раздел = ТекСтрока.Раздел;
				ОблСтрока.Параметры.Наименование  = ТекСтрока.Наименование;
				ОблСтрока.Параметры.Информация  = ТекСтрока.Информация;
				
				Если ТекСтрока.Наименование = "КолРаб" Тогда
					КонтрагентОбъект.КоличествоРаботников = ТекСтрока.Информация;
				ИначеЕсли ТекСтрока.Наименование = "СведСНР" Тогда
					Если ТекСтрока.Информация = "Нет" Тогда
						КонтрагентОбъект.ПлательщикНДС = Истина;
					КонецЕсли;
				КонецЕсли;                                 
				
				Если ТекСтрока.Раздел <> Неопределено Тогда
					ДокументРезультат.Вывести(ОблСтрока, 1);
				Иначе 
					ДокументРезультат.Вывести(ОблСтрока, 2);
				КонецЕсли;	
			КонецЦикла;
			ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
			ДокументРезультат.ОтображатьСетку = Ложь;
			
			Если Индекс = 0 Тогда
				КонтрагентОбъект.ПолнаяИнформацияФНС = Новый ХранилищеЗначения(ДокументРезультат);
			ИначеЕсли Индекс = 1 Тогда
				КонтрагентОбъект.ИнформацияФНС = Новый ХранилищеЗначения(ДокументРезультат);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Стр Из Данные[2] Цикл
			Если НЕ ТипЗнч(Стр.Сумма) = Тип("Неопределено") Тогда
				КонтрагентОбъект.Выручка = Стр.Сумма * 1000;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		КонтрагентОбъект.ДатаОбновленияДанныхФНС = ТекущаяДата();
		КонтрагентОбъект.Записать();
	КонецЕсли;	
КонецПроцедуры

                          