
&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ)
	
	//Закомментированный код, защита "ФИЗИЧЕСКОЕ ЛИЦО" без Роли "ПолныеПрава"
	//Если (ВРег(СокрЛП(Наименование)) = "ФИЗИЧЕСКОЕ ЛИЦО" ИЛИ ВРег(СокрЛП(Ссылка.Наименование)) = "ФИЗИЧЕСКОЕ ЛИЦО") И Не РольДоступна("ПолныеПрава") Тогда
	//	Сообщить("Внесение изменений в контрагента ""ФИЗИЧЕСКОЕ ЛИЦО"" запрещено!");
	//	Отказ = Истина;
	//КонецЕсли;
	
	// Задача № 160397 Убрана проверка на Полные права для ФЛ, запрет на изменение реквизита Партнер если ФЛ, запрет создания нового ФЛ
	Если Ссылка <> Неопределено Тогда
		Если ВРег(СокрЛП(Ссылка.Наименование)) = "ФИЗИЧЕСКОЕ ЛИЦО" Тогда
			Если ВРег(СокрЛП(Наименование)) <> "ФИЗИЧЕСКОЕ ЛИЦО" Тогда
				Сообщить("Запрещено изменять наименование контрагента ""физическое лицо""!", СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Если Партнер <> Ссылка.Партнер Тогда
				Сообщить("Запрещено изменять партнера у контрагента ""физическое лицо""!", СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
	Если ВРег(СокрЛП(Наименование)) = "ФИЗИЧЕСКОЕ ЛИЦО" Тогда
		
		Если Ссылка = Неопределено Тогда
			Сообщить("Создание контрагента с наименованием ""физическое лицо"" запрещено!", СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;			
		ИначеЕсли ВРег(СокрЛП(Ссылка.Наименование)) <> "ФИЗИЧЕСКОЕ ЛИЦО" Тогда
			Сообщить("Запрещено переименовывать контрагента в ""физическое лицо""!", СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	Если ЭтотОбъект.ДатаОбновленияДанныхФНС = '00010101' Тогда
		Попытка 
			Справочники.Контрагенты.ПолучитьДанныеFNS(ЭтотОбъект.Ссылка);
			Сообщить("Данные ФНС обновлены");
		Исключение
       		Сообщить(ОписаниеОшибки());
		КонецПопытки;
	ЭтотОбъект.Прочитать();
	КонецЕсли;   	
КонецПроцедуры


