
&ИзменениеИКонтроль("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	УчетПодарочныхСертификатов2_5 = УчетПодарочныхСертификатов2_5();

	Если УчетПодарочныхСертификатов2_5 Тогда
#Вставка
		Если Владелец.Номинал = 1 Тогда
			Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("Розничный покупатель ПС");
		КонецЕсли;
#КонецВставки
		Если Не ЗначениеЗаполнено(Контрагент) Тогда
			Контрагент = Справочники.Контрагенты.РозничныйПокупатель;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Партнер) Тогда
			Партнер = Справочники.Партнеры.РозничныйПокупатель;
		КонецЕсли;
		ОрганизацияИзВидаПодарочногоСертификата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец,"Организация");
		НалогообложениеНДС = УчетНДСУП.ПараметрыУчетаПоОрганизации(
			ОрганизацияИзВидаПодарочногоСертификата,
			ТекущаяДатаСеанса(),
			Неопределено, Подразделение).НалогообложениеНДСРозничнойПродажи;
	КонецЕсли;

	СоздатьОбъектРасчетовПоПодарочномуСертификату2_5(УчетПодарочныхСертификатов2_5, Отказ);

КонецПроцедуры