
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьПриИзмененииТипа();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимостьПриИзмененииТипа();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьПриИзмененииТипа()
	
	Элементы.ПроцентБонусов.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом);
	Элементы.ВидЦены.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.УстановитьВидЦены);
	Элементы.СуммаБонусов.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой ИЛИ Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыЗаНовогоКлиента);
	Элементы.Причина.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой ИЛИ Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыЗаНовогоКлиента);
	Элементы.СтатусУчастникаБонуснойПрограммы.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.СменитьСтатусУчастникаБонуснойПрограммы);
	
КонецПроцедуры


#КонецОбласти
