
&НаКлиенте
Процедура НовоеАнкетирование(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьФорму", ЭтаФорма);
	ПараметрыФормы = Новый Структура("Респондент", Респондент);
	ОткрытьФорму("РегистрСведений.АнкетированиеОтветы.Форма.ФормаАнкетирования",ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьФорму(Результат, ДополнительныеПараметры) Экспорт 
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРеультаты(Команда)
	УдаляемыеЗаписи = Элементы.Список.ТекущиеДанные;
	УдалитьЗапсиРегистра(УдаляемыеЗаписи.Респондент, УдаляемыеЗаписи.ШаблонАнкеты,УдаляемыеЗаписи.ДатаЗаполнения);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЗапсиРегистра(Респондент, ШаблонАнкеты,ДатаЗаполнения)
	Выборка = РегистрыСведений.АнкетированиеОтветы.Выбрать(Новый Структура("Респондент", Респондент));
	Пока Выборка.Следующий() Цикл
		Если Выборка.ШаблонАнкеты = ШаблонАнкеты и Выборка.ДатаЗаполнения=ДатаЗаполнения Тогда
			Объект = Выборка.ПолучитьМенеджерЗаписи();
			Объект.Удалить();
		КонецЕсли;
	КонецЦикла;
	//НаборЗаписей=Регистрысведений.АнкетированиеОтветы.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Респондент.Установить(Респон);
КонецПроцедуры

&НаСервере
Процедура СформироватьРезультатыНаСервере(Респондент,ШаблонАнкеты,ДатаЗаполнения,ТабДок)

	РегистрыСведений.АнкетированиеОтветы.СформироватьТабличныйДокументОпроса(Респондент,ШаблонАнкеты,ДатаЗаполнения,ТабДок);

КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьРезультаты(Команда)
	Результаты = Элементы.Список.ТекущиеДанные;
	ТабДок = Новый ТабличныйДокумент;
	СформироватьРезультатыНаСервере(Результаты.Респондент, Результаты.ШаблонАнкеты,Результаты.ДатаЗаполнения, ТабДок);
	ТабДок.Показать("Результаты опроса");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("респондент") Тогда
		Респондент = Параметры.Отбор.Респондент;
	КонецЕсли;

КонецПроцедуры
