
&ИзменениеИКонтроль("РаспределитьШтрихкодыПоТаблицеТоваров")
Функция Док_РаспределитьШтрихкодыПоТаблицеТоваров(ДокументСсылка, МассивУпаковок, ПараметрыУказанияСерий, Товары) Экспорт

	ДанныеРаспределения = ДанныеРаспределенияШтрихкодовУпаковокПоТоварам(
		ДокументСсылка, МассивУпаковок, ПараметрыУказанияСерий, Товары, Истина);

	Если ДанныеРаспределения.ЕстьОшибки Тогда
		ВызватьИсключение СтрСоединить(ДанныеРаспределения.Ошибки, Символы.ПС);
	КонецЕсли;
#Удаление 
	ТекстОшибки = "";
	Для Каждого РаспределеннаяСтрока Из ДанныеРаспределения.РаспределенныеСтроки Цикл
		Для Каждого СтрокаЗначения Из РаспределеннаяСтрока.Значение Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаЗначения, "ТекстОшибки")
				И СтрокаЗначения.ТекстОшибки <> Неопределено И СтрокаЗначения.ТекстОшибки <> "" Тогда
				ТекстОшибки = ТекстОшибки + СтрокаЗначения.ТекстОшибки + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Если ТекстОшибки <> Неопределено И ТекстОшибки <> "" Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
#КонецУдаления     

	СтавкаНДСБезНДС = Справочники.СтавкиНДС.БезНДС;
	СтавкаНДС0 = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС0);
	
	ТоварыРазобранные = НоваяТаблицаРаспределенныхТоваровПоШтрихкодам(Товары.СкопироватьКолонки());
	ОписанияНоменклатурыСЧастичнымВыбытием = Новый Соответствие;

	Для Каждого СтрокаТовары Из Товары Цикл

		КоэффциентУпаковкиДокумента = СтрокаТовары.КоличествоУпаковок / СтрокаТовары.Количество;

		РаспределениеПоСтроке = ДанныеРаспределения.РаспределенныеСтроки.Получить(СтрокаТовары);

		Если РаспределениеПоСтроке = Неопределено
			ИЛИ (НЕ ИнтеграцияГИСМ.ПодсистемаНеИспользуется()
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "ОсобенностьУчета")
				И СтрокаТовары.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПродукцияИзНатуральногоМеха) Тогда

			СтрокаТоварыРазобранные = ТоварыРазобранные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоварыРазобранные, СтрокаТовары);
			Продолжить;
		КонецЕсли;

		пКоличествоУпаковок = СтрокаТовары.КоличествоУпаковок;
		пСуммаСкидки        = СтрокаТовары.СуммаСкидки;
		пСуммаНДС           = СтрокаТовары.СуммаНДС;
		пСуммаСНДС          = СтрокаТовары.СуммаСНДС;

		ОтклонениеСуммыСкидки = 0;
		ОтклонениеСуммыНДС = 0;
		ОтклонениеСуммыСНДС = 0;

		Для Каждого СтрокаРаспределения Из РаспределениеПоСтроке Цикл
			
			Если СтрокаТовары.КоличествоУпаковок = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаТоварыРазобранные = ТоварыРазобранные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоварыРазобранные, СтрокаТовары);
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаРаспределения, "ТекстОшибки") Тогда
				СтрокаТоварыРазобранные.ТекстОшибки = СтрокаРаспределения.ТекстОшибки;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТоварыРазобранные.ТекстОшибки) Тогда
				СтрокаТовары.Количество = СтрокаТовары.Количество - СтрокаРаспределения.Количество;
				Продолжить;
			КонецЕсли;
			
			СтрокаТоварыРазобранные.Количество = 1;
			СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаТоварыРазобранные.Количество
			                                             * КоэффциентУпаковкиДокумента;
			
			ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения = Ложь;
			КоэффициентПересчетаУпаковки = КоэффциентУпаковкиДокумента;
				
			Если ЗначениеЗаполнено(СтрокаРаспределения.Штрихкод) Тогда
				
				Если СтрокаРаспределения.ЧастичноеВыбытие Тогда
					
					ОписаниеНоменклатуры = ОписаниеНоменклатуры(
						СтрокаТовары.Номенклатура,
						ОписанияНоменклатурыСЧастичнымВыбытием);
					
					СтрокаТоварыРазобранные.Упаковка = ОписаниеНоменклатуры.УпаковкаЧастичногоВыбытия;
					
					КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(
							СтрокаТоварыРазобранные.Упаковка,
							СтрокаТоварыРазобранные.Номенклатура);
					КоэффициентПересчетаУпаковки = 1 / КоэффициентУпаковки;
							
					СтрокаТоварыРазобранные.Количество = Мин(СтрокаРаспределения.Количество, СтрокаТовары.Количество);
					СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаТоварыРазобранные.Количество
					                                             * КоэффициентПересчетаУпаковки;
					
					СтрокаТоварыРазобранные.ДополнениеКНаименованиюТовара = СтруктураНаименованияТовара(
						СтрокаТовары,
						СтрокаРаспределения);
					
				ИначеЕсли СтрокаРаспределения.Количество <> 1 Тогда
					
					СтрокаТоварыРазобранные.Количество         = СтрокаРаспределения.Количество;
					СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаРаспределения.Количество
					                                             * КоэффициентПересчетаУпаковки;
					
					СтрокаТоварыРазобранные.ДополнениеКНаименованиюТовара = СтруктураНаименованияТовара(
						СтрокаТовары,
						СтрокаРаспределения);
					
				ИначеЕсли СтрокаРаспределения.ВидУпаковки <> Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
					
					СтрокаТоварыРазобранные.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					СтрокаТоварыРазобранные.Количество = СтрокаРаспределения.Количество;
					
					ВДокументеПродажаУпаковки = ЗначениеЗаполнено(СтрокаТовары.Упаковка);
					Если ВДокументеПродажаУпаковки Тогда
						ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения = Истина;
					Иначе
						СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаРаспределения.Количество;
						КоэффициентПересчетаУпаковки = 1;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;

			СуммаСкидки = СтрокаТовары.СуммаСкидки;
			СуммаСкидкиЭталон = СуммаСкидки;
			СуммаНДС    = СтрокаТовары.СуммаНДС;
			СуммаСНДС   = СтрокаТовары.СуммаСНДС;
			СуммаСНДСЭталон = СуммаСНДС;
			Если Не СтрокаТовары.Количество = СтрокаТоварыРазобранные.Количество Тогда
				СуммаСкидкиЭталон = пСуммаСкидки  / пКоличествоУпаковок * СтрокаТоварыРазобранные.КоличествоУпаковок;
				СуммаСНДСЭталон   = пСуммаСНДС    / пКоличествоУпаковок * СтрокаТоварыРазобранные.КоличествоУпаковок;
				СуммаСкидки       = Окр(СуммаСкидкиЭталон, 2);
				СуммаНДС          = Окр(пСуммаНДС / пКоличествоУпаковок * СтрокаТоварыРазобранные.КоличествоУпаковок, 2);
				СуммаСНДС         = Окр(СуммаСНДСЭталон, 2);
  			КонецЕсли;
			
			СтрокаТоварыРазобранные.КоэффициентПересчетаУпаковки = КоэффициентПересчетаУпаковки;
			
			СтрокаТоварыРазобранные.СуммаСкидки = СуммаСкидки;
			СтрокаТоварыРазобранные.СуммаНДС    = СуммаНДС;
			СтрокаТоварыРазобранные.СуммаСНДС   = СуммаСНДС;

			СтрокаТоварыРазобранные.Штрихкод    = СтрокаРаспределения.Штрихкод;
			СтрокаТоварыРазобранные.РезультатРаспределения = СтрокаРаспределения;
			
			Если Не (СтрокаТоварыРазобранные.СуммаСНДС = СуммаСНДСЭталон) Тогда
				ОтклонениеСуммыСНДСПоСтроке = СтрокаТоварыРазобранные.СуммаСНДС - СуммаСНДСЭталон;
				Если ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке >= 0.01 Тогда
					СтрокаТоварыРазобранные.СуммаСНДС = СтрокаТоварыРазобранные.СуммаСНДС - 0.01;
					ОтклонениеСуммыСНДС = ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке - 0.01;
				ИначеЕсли ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке <= -0.01 Тогда
					СтрокаТоварыРазобранные.СуммаСНДС = СтрокаТоварыРазобранные.СуммаСНДС + 0.01;
					ОтклонениеСуммыСНДС = ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке + 0.01;
				Иначе
					ОтклонениеСуммыСНДС = ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке;
				КонецЕсли;
			КонецЕсли;

			Если Не (СтрокаТоварыРазобранные.СуммаСкидки = СуммаСкидкиЭталон) Тогда
				ОтклонениеСуммыСкидкиПоСтроке = СтрокаТоварыРазобранные.СуммаСкидки - СуммаСкидкиЭталон;
				Если ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке >= 0.01 Тогда
					СтрокаТоварыРазобранные.СуммаСкидки = СтрокаТоварыРазобранные.СуммаСкидки - 0.01;
					ОтклонениеСуммыСкидки = ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке - 0.01;
				ИначеЕсли ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке <= -0.01 Тогда
					СтрокаТоварыРазобранные.СуммаСкидки = СтрокаТоварыРазобранные.СуммаСкидки + 0.01;
					ОтклонениеСуммыСкидки = ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке + 0.01;
				Иначе
					ОтклонениеСуммыСкидки = ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ (СтрокаТоварыРазобранные.СтавкаНДС = СтавкаНДСБезНДС
				ИЛИ СтрокаТоварыРазобранные.СтавкаНДС = СтавкаНДС0
				ИЛИ СтрокаТоварыРазобранные.СуммаНДС = СтрокаТовары.СуммаНДС) Тогда
				
				ОтклонениеСуммыНДСПоСтроке = ОтклонениеСуммыНДС(СтрокаТоварыРазобранные);
				Если ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке >= 0.01 Тогда
					СтрокаТоварыРазобранные.СуммаНДС = СтрокаТоварыРазобранные.СуммаНДС - 0.01;
					ОтклонениеСуммыНДС = ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке - 0.01;
				ИначеЕсли ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке <= -0.01 Тогда
					СтрокаТоварыРазобранные.СуммаНДС = СтрокаТоварыРазобранные.СуммаНДС + 0.01;
					ОтклонениеСуммыНДС = ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке + 0.01;
				Иначе
					ОтклонениеСуммыНДС = ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке;
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТовары.Упаковка = СтрокаТоварыРазобранные.Упаковка Тогда
				Цена = СтрокаТовары.Цена;
			Иначе
				Цена = Окр((СтрокаТоварыРазобранные.СуммаСНДС + СтрокаТоварыРазобранные.СуммаСкидки) / СтрокаТоварыРазобранные.КоличествоУпаковок, 2);
			КонецЕсли;
			
			СтрокаТоварыРазобранные.Цена    = Цена;
			СтрокаТовары.Количество         = СтрокаТовары.Количество - СтрокаТоварыРазобранные.Количество;
			СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок
			                                  - СтрокаТоварыРазобранные.Количество * КоэффциентУпаковкиДокумента;
			СтрокаТовары.СуммаСкидки        = СтрокаТовары.СуммаСкидки - СтрокаТоварыРазобранные.СуммаСкидки;
			СтрокаТовары.СуммаНДС           = СтрокаТовары.СуммаНДС - СтрокаТоварыРазобранные.СуммаНДС;
			СтрокаТовары.СуммаСНДС          = СтрокаТовары.СуммаСНДС - СтрокаТоварыРазобранные.СуммаСНДС;
			
			СтрокаТоварыРазобранные.ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения
			                        = ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения;
			Если ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения Тогда
				СтрокаТоварыРазобранные.Цена = Окр((СтрокаТоварыРазобранные.СуммаСНДС + СтрокаТоварыРазобранные.СуммаСкидки) / СтрокаТоварыРазобранные.КоэффициентПересчетаУпаковки, 2);
				СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаТоварыРазобранные.Количество;
				СтрокаТоварыРазобранные.КоэффициентПересчетаУпаковки = 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаТовары.Количество > 0 Тогда
			СтрокаТоварыРазобранные = ТоварыРазобранные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоварыРазобранные, СтрокаТовары);
			
			СтрокаТоварыРазобранные.Цена = Окр((СтрокаТоварыРазобранные.СуммаСНДС + СтрокаТоварыРазобранные.СуммаСкидки) / СтрокаТоварыРазобранные.КоличествоУпаковок, 2);
			
			ОтклонениеСуммыНДСПоСтроке = ОтклонениеСуммыНДС(СтрокаТоварыРазобранные);
			Если ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке >= 0.01 Тогда
				СтрокаТоварыРазобранные.СуммаНДС = СтрокаТоварыРазобранные.СуммаНДС - 0.01;
			ИначеЕсли ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке <= -0.01 Тогда
				СтрокаТоварыРазобранные.СуммаНДС = СтрокаТоварыРазобранные.СуммаНДС + 0.01;
			КонецЕсли;
		КонецЕсли;

		
	КонецЦикла;
	
	Возврат ТоварыРазобранные;
КонецФункции
&ИзменениеИКонтроль("УстановитьВозможностьИспользованиеОплатыСБПНаФормахРМК")
Процедура Док_УстановитьВозможностьИспользованиеОплатыСБПНаФормахРМК(Форма) 
	
	Форма.ИспользоватьОплатуСБП = ДляОрганизацииНастроеноПодключениеСБП(
		Форма.Объект.Организация,
		Форма.Объект.КассаККМ);
	#Вставка
	//Проверить работоспособность СБП при обновлении
	Если ЗначениеЗаполнено(Форма.Объект.КассаККМ) и ИнтеграцияСБПГазпромбанк.ПолучитьКассовуюСсылкуДляТерминалаКассы(Форма.Объект.КассаККМ) <> Неопределено Тогда
		Форма.ИспользоватьОплатуСБП = Истина;
	КонецЕсли;	
	#КонецВставки  
	
КонецПроцедуры
