
&НаКлиенте
Процедура Док_ВыбратьВместо(Команда)
	
	//Проверяем является ли выбранный терминал - терминалом доставки
	Если ПолучитьГруппуДоставки() Тогда 
		
			Оповещение = Новый ОписаниеОповещения("ВыборТерминала", ЭтотОбъект);    
	       	Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Ок", "Ок");
	      	Кнопки.Добавить("Отмена", "Отмена");
	 		ПоказатьВопрос(Оповещение,
		      	"Выбран терминал доставки, вы уверены?",
		      	Кнопки,
		      	0);  
	ИначеЕсли ТерминалНеПодключен() ТОгда //Проверка флага "Используется без подключения"  
			Оповещение = Новый ОписаниеОповещения("ВыборТерминала", ЭтотОбъект);    
	       	Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Ок", "Ок");
	      	Кнопки.Добавить("Отмена", "Отмена");
	 		ПоказатьВопрос(Оповещение,
		      	"Выбранный терминал не подключен, вы уверены?",
		      	Кнопки,
		      	0);  
				
	Иначе
		Для каждого ЭлементСписка Из СписокТерминалов Цикл
			Если ЭлементСписка.Значение.Ссылка = ЭквайринговыйТерминал Тогда
				Закрыть(ЭлементСписка.Значение);
				Прервать;
			КонецЕсли;
		КонецЦикла;
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ВыборТерминала(Результат, Параметры) Экспорт  
	Если Результат = "Ок" Тогда
		Для каждого ЭлементСписка Из СписокТерминалов Цикл
			Если ЭлементСписка.Значение.Ссылка = ЭквайринговыйТерминал Тогда
				Закрыть(ЭлементСписка.Значение);
				Прервать;
			КонецЕсли;
		КонецЦикла;    
	КонецЕсли;
КонецПроцедуры 	       

&НаСервере 
Функция ТерминалНеПодключен()  	
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда 
		РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
        НастройкиРМК = Справочники.НастройкиРМК.НайтиПоРеквизиту("РабочееМесто", РабочееМесто); 
		Если ЗначениеЗаполнено(НастройкиРМК) Тогда 
			Для каждого Терминал из НастройкиРМК.ЭквайринговыеТерминалы Цикл 
				Если Терминал.ЭквайринговыйТерминал = ЭквайринговыйТерминал и Терминал.ИспользоватьБезПодключенияОборудования Тогда 
					Возврат Истина; 
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	Возврат Ложь; 
КонецФункции
		
&НаСервере
Функция ПолучитьГруппуДоставки() 
   СправочникЭквайринговыеТерминалы_Доставка = Справочники.ЭквайринговыеТерминалы.НайтиПоНаименованию("Терминалы доставки");
   Если ЗначениеЗаполнено(ЭквайринговыйТерминал) И 
		ЗначениеЗаполнено(СправочникЭквайринговыеТерминалы_Доставка) И 
		ЭквайринговыйТерминал.ПринадлежитЭлементу(СправочникЭквайринговыеТерминалы_Доставка) Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь; 
	КонецЕсли; 		
КонецФункции 
