
Процедура ОткрытьОтчетРасшифровкаДнейпросрочки(Договор, ДатаОтчета) Экспорт
	
	    КлючНазначенияИспользования="";
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючНазначенияИспользования", КлючНазначенияИспользования);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии",     Истина);
		ПараметрыФормы.Вставить("Отбор",Новый Структура("Договор,ДатаОкончания",Договор,ДатаОтчета));

		ОткрытьФорму("Отчет.КоличествоДнейПросрочки.Форма",
			ПараметрыФормы,
			,
			"Договор=" + Договор);
			
КонецПроцедуры
