#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Документы.ЗаданиеНаПеревозкуРейс.ЗаполнитьДанныеПоОснованию(ДанныеЗаполнения, ЭтотОбъект);
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Ссылка.ПометкаУдаления И НЕ ПометкаУдаления Тогда
		ПересчитатьДокумент();
	ИначеЕсли ДокументыПродажиБылиИзменены() Тогда
		Отказ = Истина;
		Сообщить("Документы продажи были изменены, необходим пересчет!");
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ВремяВыезда) Тогда
		Отказ= Истина;
		Сообщить("Время выезда не заполнено!");
	КонецЕсли;
	
	Если Не Отказ И ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
		Если Не ЗначениеЗаполнено(ФактическаяСтоимостьРейса) Тогда
			Отказ= Истина;
			Сообщить("Не указана стоимость рейса!");
		КонецЕсли;
		
		Если Не Отказ И НужнаИнкассация И Не ЗначениеЗаполнено(ПлановаяДатаСдачиДСвКассу) Тогда
			Отказ= Истина;
			ОбщегоНазначения.СообщитьПользователю("Заполните реквизит 'Плановая дата сдачи ДС в кассу'!");
		КонецЕсли;
	КонецЕсли;
		
	Если Не Отказ И ПометкаУдаления И Не Проведен Тогда
		Документы.ЗаданиеНаПеревозкуРейс.ИзменениеСтатусовДляДокументовОснований(
			Основания.ВыгрузитьКолонку("Документ"),
			Перечисления.СтатусыЗаказовНаДоставку.Ожидает);		
	КонецЕсли; 	

	Если Не Отказ Тогда
		Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
			Документы.ЗаданиеНаПеревозкуРейс.УдалитьДокументЗатрат(Ссылка);	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ)
	
	Если QRкод = "" Тогда  
		ЭтотОбъект.QRкод = ГенерацияШтрихкода.СформироватьQRКод(ЭтотОбъект.Ссылка);
		Записать(РежимЗаписиДокумента.Запись);   
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		НаборЗаписей = РегистрыСведений.ИсторияРейсов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Рейс.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина)		
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Основания.Количество() = 0 И Не ЭтотОбъект.ПометкаУдаления Тогда
		Сообщить("Документ не может быть без оснований");
		Отказ = Истина;
	КонецЕсли;    
	
	Если Не Отказ И Документы.ЗаданиеНаПеревозкуРейс.ПроверитьДублированиеЗаказовНаДоставкуВДругихРейсах(Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.QRкод = ""; 
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ДокументыПродажиБылиИзменены() Тогда
		Отказ = Истина;
		Сообщить("Документы продажи были изменены, необходим пересчет!");
	КонецЕсли;
	
	Если Дата > Дата(2017,07,25)  И Не Отказ И ЗначениеЗаполнено(Статус) Тогда
		//ЗаказыКДоставке
		Движения.ЗаказыКДоставке.Записывать = Истина;
		Для Каждого ТекСтрокаОснования Из Основания Цикл
			Для Каждого стрДок Из ТекСтрокаОснования.Документ.Основания Цикл
				Движение = Движения.ЗаказыКДоставке.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ЗаказНаДоставку = ТекСтрокаОснования.Документ;
				Движение.ДокументПродажи = стрДок.Документ;
				Движение.Количество = 1;
				Движение.Рейс = Ссылка;
			КонецЦикла;
		КонецЦикла;        
		
		Если Не ОбменДанными.Загрузка И Не ДополнительныеСвойства.Свойство("Обработка") Тогда
			ЗаписатьИсториюРейсов();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьИсториюРейсов()      
			
	НаборЗаписей = РегистрыСведений.ИсторияРейсов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Рейс.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	НовыйСтатус = НаборЗаписей.Добавить();   
	НовыйСтатус.Период = ТекущаяДата();
	НовыйСтатус.Рейс = Ссылка;
	НовыйСтатус.Статус = Статус;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	Если Не Отказ Тогда
		Документы.ЗаданиеНаПеревозкуРейс.УдалитьДокументЗатрат(Ссылка);
		
		СтрукОтвет = АльтерраОбщегоНазначения.ПолучитьСтруктуруСтатусаВодителя(Водитель);
		Если СтрукОтвет.Статус = Перечисления.СтатусыВодителей.ВРейсе И СтрукОтвет.Рейс = Ссылка Тогда
			АльтерраОбщегоНазначения.УстановитьСтатусГотовВодителю(Водитель, "Рейс помечен на удаление");
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ И ПометкаУдаления И Проведен Тогда
		Документы.ЗаданиеНаПеревозкуРейс.ИзменениеСтатусовДляДокументовОснований(
			Основания.ВыгрузитьКолонку("Документ"),
			Перечисления.СтатусыЗаказовНаДоставку.Ожидает);
	КонецЕсли;
		
КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)	
	
	Если ОплатаБанковскойКартой Тогда
		ПроверяемыеРеквизиты.Добавить("БанковскийТерминал");
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПередУдалением")
Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если Не Отказ Тогда
	//	Документы.ЗаданиеНаПеревозкуРейс.ИзменениеСтатусовДляДокументовОснований(
	//		Основания.ВыгрузитьКолонку("Документ"),
	//		Перечисления.СтатусыЗаказовНаДоставку.Ожидает);
	//КонецЕсли;
		
КонецПроцедуры

Функция ДокументыПродажиБылиИзменены() Экспорт
	ТЧДок = РасчетДоставки.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТЧДок.ЗаказНаДоставку КАК ЗаказНаДоставку,
		|	ТЧДок.ДокументПродажи КАК ДокументПродажи
		|ПОМЕСТИТЬ втТЧДок
		|ИЗ &ТЧДок КАК ТЧДок;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыПродажи.Документ КАК Документ
		|ПОМЕСТИТЬ ВтДокументыПродажиИзОснований
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ДокументыПродажи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТЧДок КАК втТЧДок
		|		ПО ДокументыПродажи.Ссылка = втТЧДок.ЗаказНаДоставку;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтДокументыПродажиИзОснований.Документ КАК Документ
		|ИЗ
		|	ВтДокументыПродажиИзОснований КАК ВтДокументыПродажиИзОснований
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТЧДок КАК втТЧДок
		|		ПО (втТЧДок.ДокументПродажи = ВтДокументыПродажиИзОснований.Документ)
		|ГДЕ
		|	втТЧДок.ДокументПродажи ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втТЧДок.ДокументПродажи
		|ИЗ
		|	ВтДокументыПродажиИзОснований КАК ВтДокументыПродажиИзОснований
		|		ПРАВОЕ СОЕДИНЕНИЕ втТЧДок КАК втТЧДок
		|		ПО (втТЧДок.ДокументПродажи = ВтДокументыПродажиИзОснований.Документ)
		|ГДЕ
		|	ВтДокументыПродажиИзОснований.Документ ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТЧДок", ТЧДок);
	Результат = Запрос.Выполнить().Выгрузить();
	Результат = Результат.ВыгрузитьКолонку("Документ");
	
	Если Результат.Количество() <> 0 Тогда
		Возврат Истина
	КонецЕсли;

	Возврат Ложь
КонецФункции

//Восстанавливает регистрации расходов при снятии пометки удаления
Процедура ПересчитатьДокумент()
	Если  (ЭтотОбъект.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Внутренняя ИЛИ 
		  ЭтотОбъект.ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная) Тогда
		Документы.ЗаданиеНаПеревозкуРейс.СформироватьЗатраты(ЭтотОбъект, Ложь);
	КонецЕсли;  	
КонецПроцедуры
#КонецЕсли
