#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Получатель = Перечисления.ТипыСтатейАктивовПассивов.СтатьяПассивов и 
		Источник = Перечисления.ТипыСтатейАктивовПассивов.СтатьяРасходов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаТовары.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
			|	ТаблицаТовары.АналитикаРасходовИсточник КАК АналитикаРасходовИсточник,
			|	ТаблицаТовары.АналитикаАктивовПассивовИсточник КАК АналитикаАктивовПассивовИсточник,
			|	ТаблицаТовары.СтатьяИсточник КАК СтатьяИсточник,
			|	ТаблицаТовары.ОбъектРасходов КАК ОбъектРасходов,
			|	ТаблицаТовары.АналитикаОбъекта КАК АналитикаОбъекта,
			|	СУММА(ТаблицаТовары.Сумма) КАК Сумма
			|ИЗ
			|	Документ.ДвижениеПрочихАктивовПассивов.ДанныеОтражения КАК ТаблицаТовары
			|ГДЕ
			|	ТаблицаТовары.Ссылка = &Ссылка
			|	И НЕ ТаблицаТовары.ОбъектРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|	И НЕ ТаблицаТовары.АналитикаОбъекта = ЗНАЧЕНИЕ(Справочник.АналитикаОбъекта.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаТовары.ПодразделениеПолучатель,
			|	ТаблицаТовары.АналитикаРасходовИсточник,
			|	ТаблицаТовары.АналитикаАктивовПассивовИсточник,
			|	ТаблицаТовары.СтатьяИсточник,
			|	ТаблицаТовары.ОбъектРасходов,
			|	ТаблицаТовары.АналитикаОбъекта";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.РасходыПоОбъектам.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Подразделение = ВыборкаДетальныеЗаписи.ПодразделениеПолучатель;
			
			Если НЕ ВыборкаДетальныеЗаписи.АналитикаРасходовИсточник.Пустая() Тогда
				Движение.АналитикаРасходов = ВыборкаДетальныеЗаписи.АналитикаРасходовИсточник;
			КонецЕсли;
			
			Если НЕ ВыборкаДетальныеЗаписи.СтатьяИсточник.Пустая() Тогда
				Движение.СтатьяРасходов = ВыборкаДетальныеЗаписи.СтатьяИсточник;
			КонецЕсли; 
			
			Движение.ОбъектРасходов = ВыборкаДетальныеЗаписи.ОбъектРасходов;
			Движение.АналитикаОбъекта = ВыборкаДетальныеЗаписи.АналитикаОбъекта;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		КонецЦикла;
		Движения.РасходыПоОбъектам.Записывать = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТЧ из ДанныеОтражения Цикл  
		
		Если НЕ СтрокаТЧ.ОбъектРасходов.Пустая() и СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ИндексМассива = СтрокаТЧ.НомерСтроки-1;
			ОбщегоНазначения.СообщитьПользователю("Нельзя по строке реквизит ""Объект расходов"" заполнить, а ""Аналитика объекта"" нет. Исправьте или очистите значения этих реквизитов в строке",, 
				"Объект.ДанныеОтражения[" + ИндексМассива + "].АналитикаОбъекта");
			Отказ = Истина;
		ИначеЕсли СтрокаТЧ.ОбъектРасходов.Пустая() и НЕ СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ИндексМассива = СтрокаТЧ.НомерСтроки-1;
			ОбщегоНазначения.СообщитьПользователю("Нельзя по строке реквизит ""Аналитика объекта"" заполнить, а ""Объект расходов"" нет. Исправьте или очистите значения этих реквизитов в строке",, 
				"Объект.ДанныеОтражения[" + ИндексМассива + "].ОбъектРасходов");
			Отказ = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.ДанныеОтражения.Итог("Сумма");

КонецПроцедуры
#КонецЕсли
