
//Проведение
Функция ПолучитьТаблицуБонусныхБаловДляПроведенияРеализации(Объект, Отказ) Экспорт
	Запрос= Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабличнаяЧасть.ДатаНачисления КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	&Партнер КАК Партнер,
		|	ТабличнаяЧасть.СуммаБонусныхБаллов КАК Начислено,
		|	0 КАК КСписанию
		|ПОМЕСТИТЬ ВтБонусныеБаллы
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.БонусныеБаллы КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И НЕ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
		|	И &ОтметкаКассы
		|	И ТабличнаяЧасть.ДатаНачисления <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.ДатаСписания,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности,
		|	&Партнер,
		|	0,
		|	ТабличнаяЧасть.СуммаБонусныхБаллов
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.БонусныеБаллы КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И НЕ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
		|	И ТабличнаяЧасть.ДатаСписания <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	&БонуснаяПрограммаЛояльности,
		|	&Партнер,
		|	ТабличнаяЧасть.СуммаБонусныхБалловКСписанию,
		|	ТабличнаяЧасть.СуммаБонусныхБалловКСписанию
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И НЕ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
		|	И ТабличнаяЧасть.СуммаБонусныхБалловКСписанию <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БонусныеБаллы.Период КАК Период,
		|	БонусныеБаллы.ВидДвижения КАК ВидДвижения,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер КАК Партнер,
		|	СУММА(БонусныеБаллы.Начислено) КАК Начислено,
		|	СУММА(БонусныеБаллы.КСписанию) КАК КСписанию
		|ИЗ
		|	ВтБонусныеБаллы КАК БонусныеБаллы
		|
		|СГРУППИРОВАТЬ ПО
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер,
		|	БонусныеБаллы.Период,
		|	БонусныеБаллы.ВидДвижения";
	
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", Объект.Дата);

	Запрос.УстановитьПараметр("ОтметкаКассы", ЗначениеЗаполнено(Объект.Кассир));
	
	БонуснаяПрограммаЛояльности= АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Функция ПолучитьТаблицуБонусныхБаловДляПроведенияВозврата(Объект, Отказ) Экспорт
	Запрос= Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабличнаяЧасть.ДатаНачисления КАК Период,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	&Партнер КАК Партнер,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|			ТОГДА -ТабличнаяЧасть.СуммаБонусныхБаллов
		|		ИНАЧЕ ТабличнаяЧасть.СуммаБонусныхБаллов
		|	КОНЕЦ КАК Начислено,
		|	0 КАК КСписанию
		|ПОМЕСТИТЬ ВтБонусныеБаллы
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента.НачислениеБонусныхБаллов КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И ТабличнаяЧасть.ДатаНачисления <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.ДатаСписания,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности,
		|	&Партнер,
		|	0,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|			ТОГДА -ТабличнаяЧасть.СуммаБонусныхБаллов
		|		ИНАЧЕ ТабличнаяЧасть.СуммаБонусныхБаллов
		|	КОНЕЦ
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента.НачислениеБонусныхБаллов КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И ТабличнаяЧасть.ДатаСписания <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.ДатаОплаты,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	КОНЕЦ,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности,
		|	&Партнер,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|			ТОГДА ТабличнаяЧасть.СуммаБонусныхБаллов
		|		ИНАЧЕ -ТабличнаяЧасть.СуммаБонусныхБаллов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.СуммаБонусныхБаллов > 0
		|			ТОГДА ТабличнаяЧасть.СуммаБонусныхБаллов
		|		ИНАЧЕ -ТабличнаяЧасть.СуммаБонусныхБаллов
		|	КОНЕЦ
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента.ОплатаБонуснымиБаллами КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БонусныеБаллы.Период КАК Период,
		|	БонусныеБаллы.ВидДвижения КАК ВидДвижения,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер КАК Партнер,
		|	СУММА(БонусныеБаллы.Начислено) КАК Начислено,
		|	СУММА(БонусныеБаллы.КСписанию) КАК КСписанию
		|ИЗ
		|	ВтБонусныеБаллы КАК БонусныеБаллы
		|ГДЕ
		|	&ОтметкаКассы = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер,
		|	БонусныеБаллы.Период,
		|	БонусныеБаллы.ВидДвижения";
	
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ОтметкаКассы", ЗначениеЗаполнено(Объект.Кассир));
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Функция ПолучитьТаблицуДетализацияБонусныхБаллов(Объект,Отказ) Экспорт
	  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БонусныеБаллыОбороты.Период КАК Период,
	|	БонусныеБаллыОбороты.Регистратор КАК Регистратор,
	|	БонусныеБаллыОбороты.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	БонусныеБаллыОбороты.Партнер КАК Партнер,
	|	БонусныеБаллыОбороты.НачисленоПриход КАК НачисленоПриход
	|ПОМЕСТИТЬ ВТ_БонусныеБаллы
	|ИЗ
	|	РегистрНакопления.БонусныеБаллы.Обороты(, , Регистратор, ) КАК БонусныеБаллыОбороты
	|ГДЕ
	|	БонусныеБаллыОбороты.Регистратор = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМАкции.Ссылка КАК Ссылка,
	|	СУММА(ЧекККМАкции.Баллы) КАК Баллы
	|ПОМЕСТИТЬ ВТ_Акции
	|ИЗ
	|	Документ.ЧекККМ.Акции КАК ЧекККМАкции
	|ГДЕ
	|	ЧекККМАкции.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМАкции.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугАкции.Ссылка,
	|	СУММА(РеализацияТоваровУслугАкции.Баллы)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Акции КАК РеализацияТоваровУслугАкции
	|ГДЕ
	|	РеализацияТоваровУслугАкции.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугАкции.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БонусныеБаллы.Период КАК Период,
	|	ВТ_БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	ВТ_БонусныеБаллы.Партнер КАК Партнер,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныНачисленияБонусныхБаллов.ЗаСтатус) КАК ПричинаНачисленияБонусныхБаллов,
	|	ВЫБОР
	|		КОГДА &ПроцентЗаКрупнуюПокупку + &ПроцентЗаСтатус > 0
	|			ТОГДА Выразить( &ПроцентЗаСтатус / (&ПроцентЗаКрупнуюПокупку + &ПроцентЗаСтатус) * (ВТ_БонусныеБаллы.НачисленоПриход - ЕСТЬNULL(ВТ_Акции.Баллы, 0))Как Число(10,0))
	|		ИНАЧЕ ВТ_БонусныеБаллы.НачисленоПриход - ЕСТЬNULL(ВТ_Акции.Баллы, 0)
	|	КОНЕЦ КАК Баллы
	|ИЗ
	|	ВТ_БонусныеБаллы КАК ВТ_БонусныеБаллы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Акции КАК ВТ_Акции
	|		ПО ВТ_БонусныеБаллы.Регистратор = ВТ_Акции.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_БонусныеБаллы.Период,
	|	ВТ_БонусныеБаллы.БонуснаяПрограммаЛояльности,
	|	ВТ_БонусныеБаллы.Партнер,
	|	ВЫБОР
	|		КОГДА &Бригадир
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныНачисленияБонусныхБаллов.ДопБаллы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПричиныНачисленияБонусныхБаллов.ЗаКрупнуюПокупку)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ПроцентЗаКрупнуюПокупку + &ПроцентЗаСтатус > 0
	|			ТОГДА Выразить(&ПроцентЗаКрупнуюПокупку / (&ПроцентЗаКрупнуюПокупку + &ПроцентЗаСтатус) * (ВТ_БонусныеБаллы.НачисленоПриход - ЕСТЬNULL(ВТ_Акции.Баллы, 0)) Как Число(10,0))
	|		ИНАЧЕ ВТ_БонусныеБаллы.НачисленоПриход - ЕСТЬNULL(ВТ_Акции.Баллы, 0)
	|	КОНЕЦ
	|ИЗ
	|	ВТ_БонусныеБаллы КАК ВТ_БонусныеБаллы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Акции КАК ВТ_Акции
	|		ПО ВТ_БонусныеБаллы.Регистратор = ВТ_Акции.Ссылка
	|ГДЕ
	|	&ПроцентЗаКрупнуюПокупку > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_БонусныеБаллы.Период,
	|	ВТ_БонусныеБаллы.БонуснаяПрограммаЛояльности,
	|	ВТ_БонусныеБаллы.Партнер,
	|	ЧекККМАкции.МаркетинговоеМероприятие,
	|	ЧекККМАкции.Баллы
	|ИЗ
	|	ВТ_БонусныеБаллы КАК ВТ_БонусныеБаллы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Акции КАК ЧекККМАкции
	|		ПО ВТ_БонусныеБаллы.Регистратор = ЧекККМАкции.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_БонусныеБаллы.Период,
	|	ВТ_БонусныеБаллы.БонуснаяПрограммаЛояльности,
	|	ВТ_БонусныеБаллы.Партнер,
	|	РеализацияТоваровУслугАкции.МаркетинговоеМероприятие,
	|	РеализацияТоваровУслугАкции.Баллы
	|ИЗ
	|	ВТ_БонусныеБаллы КАК ВТ_БонусныеБаллы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Акции КАК РеализацияТоваровУслугАкции
	|		ПО ВТ_БонусныеБаллы.Регистратор = РеализацияТоваровУслугАкции.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПроцентЗаКрупнуюПокупку", Объект.ПроцентЗаКрупнуюПокупку);
	Запрос.УстановитьПараметр("ПроцентЗаСтатус", ?(ЗначениеЗаполнено(Объект.СтатусПартнераВПрограммеЛояльности),Объект.СтатусПартнераВПрограммеЛояльности.Коэффициент*100,0));
	Запрос.УстановитьПараметр("Бригадир", АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер));	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();  


КонецФункции

Функция ПолучитьНачисленныеБаллы(Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(БонусныеБаллы.Начислено) КАК Количество
		|ИЗ
		|	РегистрНакопления.БонусныеБаллы КАК БонусныеБаллы
		|ГДЕ
		|	БонусныеБаллы.Регистратор = &Регистратор
		|	И БонусныеБаллы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";
	
	Запрос.УстановитьПараметр("Регистратор", Основание);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаНачисленныхБалловПриПродажи= ?(Выборка.Количество=Null, 0, Выборка.Количество);
	Иначе
		СуммаНачисленныхБалловПриПродажи= 0;
	КонецЕсли;
	
	Возврат СуммаНачисленныхБалловПриПродажи;
КонецФункции

//Реализация модуль менеджера
Функция ТекстЗапросаВтБонусныеБаллы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтБонусныеБаллы";
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТабличнаяЧасть.ДатаНачисления КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	&Партнер КАК Партнер,
		|	ТабличнаяЧасть.СуммаБонусныхБаллов КАК Начислено,
		|	0 КАК КСписанию
		|ПОМЕСТИТЬ ВтБонусныеБаллы
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.БонусныеБаллы КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И НЕ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
		|	И &ЧекПробит
		|	И ТабличнаяЧасть.ДатаНачисления <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.ДатаСписания,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности,
		|	&Партнер,
		|	0,
		|	ТабличнаяЧасть.СуммаБонусныхБаллов
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.БонусныеБаллы КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И НЕ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
		|	И ТабличнаяЧасть.ДатаСписания <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	&БонуснаяПрограммаЛояльности,
		|	&Партнер,
		|	ТабличнаяЧасть.СуммаБонусныхБалловКСписанию,
		|	ТабличнаяЧасть.СуммаБонусныхБалловКСписанию
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И НЕ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
		|	И ТабличнаяЧасть.СуммаБонусныхБалловКСписанию <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаБонусныеБаллы(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "БонусныеБаллы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтБонусныеБаллы", ТекстыЗапроса) Тогда
		ТекстЗапросаВтБонусныеБаллы(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	БонусныеБаллы.Период                      КАК Период,
		|	БонусныеБаллы.ВидДвижения                 КАК ВидДвижения,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер                     КАК Партнер,
		|	СУММА(БонусныеБаллы.Начислено)            КАК Начислено,
		|	СУММА(БонусныеБаллы.КСписанию)            КАК КСписанию
		|ИЗ
		|	ВтБонусныеБаллы КАК БонусныеБаллы
		|
		|СГРУППИРОВАТЬ ПО
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер,
		|	БонусныеБаллы.Период,
		|	БонусныеБаллы.ВидДвижения
		|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДетализацияБонусныхБаллов(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "ДетализацияБонусныхБаллов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтДетализацияБонусныхБаллов", ТекстыЗапроса) Тогда
		ТекстЗапросаВтБонусныеБаллы(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	БонусныеБаллы.Период                      КАК Период,
		|	БонусныеБаллы.ВидДвижения                 КАК ВидДвижения,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер                     КАК Партнер,
		|	СУММА(БонусныеБаллы.Начислено)            КАК Начислено,
		|	СУММА(БонусныеБаллы.КСписанию)            КАК КСписанию
		|ИЗ
		|	ВтБонусныеБаллы КАК БонусныеБаллы
		|
		|СГРУППИРОВАТЬ ПО
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер,
		|	БонусныеБаллы.Период,
		|	БонусныеБаллы.ВидДвижения
		|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

//Фильтры   
Процедура ОтобразитьПотраченныеБаллы(Форма) Экспорт
	Объект = Форма.Объект;
	Если Объект.Дата >= НачалоДня(ТекущаяДата()) И Объект.Дата <= КонецДня(ТекущаяДата()) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
			|	СУММА(БонусныеБаллы.Начислено) КАК Количество
			|ИЗ
			|	РегистрНакопления.БонусныеБаллы КАК БонусныеБаллы
			|ГДЕ
			|	(ТИПЗНАЧЕНИЯ(БонусныеБаллы.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг)
			|			ИЛИ ТИПЗНАЧЕНИЯ(БонусныеБаллы.Регистратор) = ТИП(Документ.ЧекККМ))
			|	И БонусныеБаллы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И БонусныеБаллы.Партнер = &Партнер
			|	И БонусныеБаллы.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
		Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Форма.Элементы.ПотраченныеБаллы.Видимость = Истина;
			Форма.Элементы.ПотраченныеБаллы.Заголовок = "Клиентом потрачено сегодня " + Строка(Выборка.Количество) + " б.";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСтрокиКРаспределениюСкидки(Знач Объект) Экспорт
	МассивСтрок= Новый Массив;
	
	ТЗ= ПолучитьТоварыКРасчетуБаллов(Объект.Товары, , Объект.Дата);
	Для Каждого стрТовар Из ТЗ Цикл
		ИдентификаторСтроки= Объект.Товары[стрТовар.НомерСтроки-1].ПолучитьИдентификатор();
		МассивСтрок.Добавить(ИдентификаторСтроки);
	КонецЦикла;
	
	Возврат МассивСтрок;
КонецФункции

Функция АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(Знач Объект, ИмяТаблицы, УникальныйИдентификатор, ТолькоДляВыделенныхСтрок,
	ИмяТаблицыВыделенныхСтрок = Неопределено, ТолькоАктивныеСтроки = Ложь,
	ИспользоватьОграничения = Истина, РеализацияСверхЗаказа = Ложь, МассивСтрок) Экспорт
	
	РеализацияСверхЗаказаПоЗаказу = РеализацияСверхЗаказа И Объект.РеализацияПоЗаказам;															  
	
	СоглашениеСКлиентом = Неопределено;
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Объект, "Соглашение") Тогда
		СоглашениеСКлиентом = Объект.Соглашение;
	КонецЕсли;
	
	ИспользоватьРучныеСкидки                     = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьОграниченияРучныхСкидокВПродажах = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоПользователям");
	
	Если ЗначениеЗаполнено(СоглашениеСКлиентом) Тогда
		ИспользоватьОграниченияПоСоглашениям = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоСоглашениям");
	Иначе
		ИспользоватьОграниченияПоСоглашениям = Ложь;
	КонецЕсли;
	
	ИспользоватьОграниченияРучныхСкидок = ИспользоватьОграничения И ИспользоватьРучныеСкидки И (ИспользоватьОграниченияРучныхСкидокВПродажах ИЛИ ИспользоватьОграниченияПоСоглашениям);
	
	Если ИмяТаблицы = "Услуги" Тогда
		ИмяКоличества = "Количество";
	Иначе
		ИмяКоличества = "КоличествоУпаковок";
	КонецЕсли;
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура",              Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить(ИмяКоличества,               Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	Товары.Колонки.Добавить("Цена",                      Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	Товары.Колонки.Добавить("СуммаАвтоматическойСкидки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	Товары.Колонки.Добавить("СуммаРучнойСкидки",         Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	
	Если ТолькоДляВыделенныхСтрок Тогда
		Для Каждого ТекСтрока Из  МассивСтрок Цикл
			
			СтрокаКоллекции = Объект[ИмяТаблицы].НайтиПоИдентификатору(ТекСтрока);
			
			Если ?(РеализацияСверхЗаказа, СтрокаКоллекции = Неопределено ИЛИ СтрокаКоллекции.КодСтроки > 0, СтрокаКоллекции = Неопределено) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
		КонецЦикла;
	Иначе
		Если РеализацияСверхЗаказа Тогда
			НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(Новый Структура("КодСтроки", 0));
			Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
		ИначеЕсли ТолькоАктивныеСтроки Тогда
			НайденныеСтроки =Объект[ИмяТаблицы].НайтиСтроки(Новый Структура("Активность", Истина));
			Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТЧ Из Объект[ИмяТаблицы] Цикл
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИспользоватьОграниченияРучныхСкидок Тогда
		
		ОграниченияРучныхСкидок = НастройкиПродажДляПользователейСервер.ОграниченияСкидокНаценок(СоглашениеСКлиентом, Пользователи.ТекущийПользователь());
		ЦеновыеГруппы = ОграниченияРучныхСкидок.ВыгрузитьКолонку("ЦеноваяГруппа");
		
	Иначе
		
		ОграниченияРучныхСкидок = Новый ТаблицаЗначений;
		ОграниченияРучныхСкидок.Колонки.Добавить("ЦеноваяГруппа", Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы"));
		ОграниченияРучныхСкидок.Колонки.Добавить("МаксимальныйПроцентРучнойСкидки",  Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
		ОграниченияРучныхСкидок.Колонки.Добавить("МаксимальныйПроцентРучнойНаценки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
		
		Ограничение = ОграниченияРучныхСкидок.Добавить();
		Ограничение.ЦеноваяГруппа = Справочники.ЦеновыеГруппы.ПустаяСсылка();
		Ограничение.МаксимальныйПроцентРучнойСкидки  = 999.99;
		Ограничение.МаксимальныйПроцентРучнойНаценки = 999.99;
		
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары." + ИмяКоличества + " " + "КАК КоличествоУпаковок,
		|	Товары.Цена КАК ЦенаЗаУпаковку,
		|	Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	СправочникНоменклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Товары.ЦенаЗаУпаковку КАК ЦенаЗаУпаковку,
		|	Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки
		|ПОМЕСТИТЬ ВременнаяТаблицаТовары
		|ИЗ
		|	ВременнаяТаблица КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО (СправочникНоменклатура.Ссылка = Товары.Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОграниченияРучныхСкидок.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ОграниченияРучныхСкидок.МаксимальныйПроцентРучнойСкидки КАК МаксимальныйПроцентРучнойСкидки,
		|	ОграниченияРучныхСкидок.МаксимальныйПроцентРучнойНаценки КАК МаксимальныйПроцентРучнойНаценки
		|ПОМЕСТИТЬ ОграниченияРучныхСкидок
		|ИЗ
		|	&ОграниченияРучныхСкидок КАК ОграниченияРучныхСкидок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	Т.СуммаБезСкидки КАК СуммаБезСкидки,
		|	Т.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	Т.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ОграниченияРучныхСкидок.МаксимальныйПроцентРучнойСкидки КАК МаксимальныйПроцентРучнойСкидки,
		|	ОграниченияРучныхСкидок.МаксимальныйПроцентРучнойНаценки КАК МаксимальныйПроцентРучнойНаценки,
		|	ВЫРАЗИТЬ(ОграниченияРучныхСкидок.МаксимальныйПроцентРучнойСкидки / 100 * Т.СуммаБезСкидки КАК ЧИСЛО(10, 2)) КАК МаксимальнаяСуммаРучнойСкидки,
		|	ВЫРАЗИТЬ(ОграниченияРучныхСкидок.МаксимальныйПроцентРучнойНаценки / 100 * Т.СуммаБезСкидки КАК ЧИСЛО(10, 2)) КАК МаксимальнаяСуммаРучнойНаценки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА ВременнаяТаблицаТовары.ЦеноваяГруппа В (&ЦеновыеГруппы)
		|				ТОГДА ВременнаяТаблицаТовары.ЦеноваяГруппа
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|		КОНЕЦ КАК ЦеноваяГруппа,
		|		СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаТовары.КоличествоУпаковок * ВременнаяТаблицаТовары.ЦенаЗаУпаковку КАК ЧИСЛО(10, 2))) КАК СуммаБезСкидки,
		|		СУММА(ВременнаяТаблицаТовары.СуммаАвтоматическойСкидки) КАК СуммаАвтоматическойСкидки,
		|		СУММА(ВременнаяТаблицаТовары.СуммаРучнойСкидки) КАК СуммаРучнойСкидки
		|	ИЗ
		|		ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВЫБОР
		|			КОГДА ВременнаяТаблицаТовары.ЦеноваяГруппа В (&ЦеновыеГруппы)
		|				ТОГДА ВременнаяТаблицаТовары.ЦеноваяГруппа
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|		КОНЕЦ) КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОграниченияРучныхСкидок КАК ОграниченияРучныхСкидок
		|		ПО (ОграниченияРучныхСкидок.ЦеноваяГруппа = Т.ЦеноваяГруппа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТовары.ЦеноваяГруппа КАК ЦеноваяГруппа
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("Товары", Товары);
	Запрос.Параметры.Вставить("ОграниченияРучныхСкидок", ОграниченияРучныхСкидок);
	Запрос.Параметры.Вставить("ЦеновыеГруппы", ЦеновыеГруппы);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Ограничения = Результат[3].Выгрузить();
	Ограничения.Индексы.Добавить("ЦеноваяГруппа");
	
	Товары = Результат[4].Выгрузить();
	Товары.Индексы.Добавить("Номенклатура");
	
	Возврат ПоместитьВоВременноеХранилище(Новый Структура("Ограничения, Товары, ИспользоватьОграниченияРучныхСкидок", Ограничения, Товары, ИспользоватьОграниченияРучныхСкидок), УникальныйИдентификатор);
КонецФункции

Процедура НачислитьБаллыВручную(ВидыПравилНачисленияБонусныхБаллов, Партнер, Баллы, Комментарий="")  Экспорт
	Документ = Документы.НачислениеИСписаниеБонусныхБаллов.СоздатьДокумент();
	Документ.ВидПравила= ВидыПравилНачисленияБонусныхБаллов;
	Документ.Дата= ТекущаяДата();
	Документ.БонуснаяПрограммаЛояльности=  АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	Документ.ПериодДействия= Перечисления.Периодичность.День;
	Документ.ПериодОтсрочкиНачалаДействия= Перечисления.Периодичность.День;
	Документ.КоличествоПериодовДействия               = 0;
	Документ.КоличествоПериодовОтсрочкиНачалаДействия = 0;
	Документ.ДатаОкончанияСрокаДействия               = Неопределено;
	
	Документ.Комментарий= Комментарий;
	
	Если ВидыПравилНачисленияБонусныхБаллов = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Списание Тогда
		НоваяСтрока= Документ.Списание.Добавить();
	Иначе
		НоваяСтрока= Документ.Начисление.Добавить();
	КонецЕсли;
	
	НоваяСтрока.Партнер = Партнер;
	НоваяСтрока.Баллы = Баллы;
	
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗаписьЖурналаРегистрации("РегламентноеЗадание.ОбновлениеСтатусовПартнеров", УровеньЖурналаРегистрации.Информация, Документ.Ссылка, , Комментарий);
КонецПроцедуры

Процедура УстановитьСтатусПоМаркетинговомуМероприятию(Партнер, ИсточникПервичногоИнтереса) Экспорт
	//Ставим статус Эксперт в бонусной программе
	ЭтоЧастноеЛицо= АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Партнер);
	Если ЭтоЧастноеЛицо И ЗначениеЗаполнено(ИсточникПервичногоИнтереса) И ТипЗнч(ИсточникПервичногоИнтереса)=Тип("СправочникСсылка.МаркетинговыеМероприятия") Тогда
		мКаналовДляНазначения= Новый Массив;
		мКаналовДляНазначения.Добавить(Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0А-00000074"));
		мКаналовДляНазначения.Добавить(Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0А-00000075"));
		
		Окончилось= (ЗначениеЗаполнено(ИсточникПервичногоИнтереса.ДатаОкончания) И ТекущаяДата() > ИсточникПервичногоИнтереса.ДатаОкончания);  
		
		Если мКаналовДляНазначения.Найти(ИсточникПервичногоИнтереса) <> Неопределено 
			И Не ИсточникПервичногоИнтереса.Завершено 
			И Не Окончилось
			Тогда
			БонусыАльтерра.ОбновитьСтатусВРегистре(Партнер, Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.Эксперт);
			Сообщить("Партнеру присвоен статус ""Эксперт""");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#Область ПроектЧеки      
                       
//Расчет
Функция РасчетБонусныхБалов(Объект, БонуснаяПрограммаЛояльности=Неопределено) Экспорт
	Если БонуснаяПрограммаЛояльности = Неопределено Тогда
		БонуснаяПрограммаЛояльности = Объект.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		БонуснаяПрограммаЛояльности= АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		
		МаксимальныйПроцентОплаты = БонуснаяПрограммаЛояльности.МаксимальныйПроцентОплатыБонусами / 100;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус КАК Статус,
			|	ЕСТЬNULL(СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус.Коэффициент, 0.01) КАК Коэффициент
			|ИЗ
			|	РегистрСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СрезПоследних(
			|			&Период,
			|			БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности
			|				И Партнер = &Партнер) КАК СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	БонусныеБаллыОстатки.Партнер КАК Партнер,
			|	БонусныеБаллыОстатки.НачисленоОстаток КАК НачисленоОстаток
			|ИЗ
			|	РегистрНакопления.БонусныеБаллы.Остатки(
			|			&Период,
			|			Партнер = &Партнер
			|				И БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности) КАК БонусныеБаллыОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	БонусныеБаллыОстатки.Партнер КАК Партнер,
			|	БонусныеБаллыОстатки.НачисленоОстаток КАК НачисленоОстаток
			|ИЗ
			|	РегистрНакопления.БонусныеБаллы.Остатки(
			|			,
			|			Партнер = &Партнер
			|				И БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности) КАК БонусныеБаллыОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	БонусныеБаллы.Партнер КАК Партнер,
			|	БонусныеБаллы.Начислено КАК Количество
			|ИЗ
			|	РегистрНакопления.БонусныеБаллы КАК БонусныеБаллы
			|ГДЕ
			|	БонусныеБаллы.Регистратор = &Регистратор";
		
		Запрос.УстановитьПараметр("Период", ?(Объект.Дата = Дата(1,1,1) ИЛИ Объект.Дата = НачалоДня(Объект.Дата), ТекущаяДата(), Объект.Дата));
		Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
		Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
		Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
		//Товар
		грТара= Справочники.Номенклатура.НайтиПоКоду("00448      ");
		Запрос.УстановитьПараметр("Товар", Объект.Товары.Выгрузить());
		Запрос.УстановитьПараметр("ГрТара", ГрТара);
		
		ПакетРезультатов= Запрос.ВыполнитьПакет();	
		
		// Получаем статус партнера
		Выборка= ПакетРезультатов[0].Выбрать();
		Коэффициент= 0.01;
		Если Выборка.Следующий() Тогда
			Статус= Выборка.Статус;
			Коэффициент= Выборка.Коэффициент;
		Иначе
			Статус= Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.Умелец;
			Коэффициент= Статус.Коэффициент;
		КонецЕсли;
		
		//Бригадиры
		Если АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер) тогда
			Если Объект.Соглашение.НачислятьБаллыЗаСтатус //Соглашение 1 или 2  
				тогда
				Коэффициент= Коэффициент;
			Иначе //Соглашение без бонусов за статус 
				Коэффициент= 0;
			Конецесли;
		КонецЕсли; 
		
		// получаем доступные баллы
		Выборка= ПакетРезультатов[1].Выбрать();
		Если Выборка.Следующий() Тогда
			ДоступныеБаллы= Выборка.НачисленоОстаток;
		Иначе
			ДоступныеБаллы= 0;
		КонецЕсли;
		
		// получаем накопленные баллы
		Выборка= ПакетРезультатов[2].Выбрать();
		Если Выборка.Следующий() Тогда
			НакопленныеБаллы= Выборка.НачисленоОстаток;
		Иначе
			НакопленныеБаллы= 0;
		КонецЕсли;
		
		// получаем начисленные этим документом баллы
		Выборка= ПакетРезультатов[3].Выбрать();
		Если Выборка.Следующий() Тогда
			НачисленныеБаллы= Выборка.Количество;
		Иначе
			НачисленныеБаллы= 0;
		КонецЕсли;
		
		СуммаКРасчету = 0;   
		СуммаКОплате = 0;
		
		ЭтоЗаказ= Ложь;
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ЭтоЗаказ= Истина;
		КонецЕсли;
		ТЗТовары= ПолучитьТоварыКрасчетуБаллов(Объект.Товары, ЭтоЗаказ, Объект.Дата);
		ТЗТоварыКОплате= ПолучитьТоварыКрасчетуБаллов(Объект.Товары, ЭтоЗаказ, Объект.Дата, Истина);
		
		//Дополнительный расчет бонусов за разовую покупку
		СуммаКРасчету = ТЗТовары.Итог("Сумма");   
		СуммаКОплате = ТЗТоварыКОплате.Итог("Сумма");
		
		КоэффициентЗаКрупнуюПокупку= 0;
		Если ТекущаяДата() < Дата(2022,04,01,00,00,00) Тогда
			Если СуммаКРасчету >= 50000 Тогда
				КоэффициентЗаКрупнуюПокупку = 0.03;
			ИначеЕсли СуммаКРасчету >= 30000 Тогда
				КоэффициентЗаКрупнуюПокупку =  0.02;
			ИначеЕсли СуммаКРасчету >= 20000 Тогда
				КоэффициентЗаКрупнуюПокупку =  0.01;
			КонецЕсли;
		Иначе
			Если СуммаКРасчету >= 90000 Тогда
				КоэффициентЗаКрупнуюПокупку = 0.03;
			ИначеЕсли СуммаКРасчету >= 50000 Тогда
				КоэффициентЗаКрупнуюПокупку =  0.02;
			ИначеЕсли СуммаКРасчету >= 30000 Тогда
				КоэффициентЗаКрупнуюПокупку =  0.01;
			КонецЕсли;
		КонецЕсли; 
		
		//Бригадиры 
		Если АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер) Тогда
			Если Объект.Соглашение.НачислятьБаллыЗаКрупнуюПокупку = Ложь тогда
				КоэффициентЗаКрупнуюПокупку = 0;
			Иначе 
				КоэффициентЗаКрупнуюПокупку = Объект.Соглашение.КоэффициентНачисленияББРозничнаяЦена; 
			КонецЕсли;
		КонецЕсли;
		
		Коэффициент = Коэффициент+КоэффициентЗаКрупнуюПокупку;
		
		РасчитанныеБаллы = Цел(СуммаКРасчету * Коэффициент);
		
		Если АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер) И Объект.Соглашение.ВозможностьСписатьБаллы = Ложь Тогда	
			СуммаБаловКОплате = 0; 
		Иначе
			СуммаБаловКОплате = Мин(Цел(СуммаКОплате*МаксимальныйПроцентОплаты), Цел(ДоступныеБаллы));
		КонецЕсли;
		
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
			ОбъектПроверки = Объект.ЧекККМ;
		Иначе
			ОбъектПроверки = Объект;
		КонецЕсли;
		
		Если ПроверитьЗапретБонусов(ОбъектПроверки) Тогда
			Возврат Новый Структура("Статус,Коэффициент,КоэффициентЗаКрупнуюПокупку,НакопленныеБаллы,ДоступныеБаллы,НачисленныеБаллы,РасчитанныеБаллы,МаксимальныйПроцентОплаты,СуммаБаловКОплате,Запрет, Товары", Статус, Коэффициент, КоэффициентЗаКрупнуюПокупку, НакопленныеБаллы, ДоступныеБаллы, 0, 0, 0, 0, Истина, ТЗТовары);
		Иначе
			Возврат Новый Структура("Статус,Коэффициент,КоэффициентЗаКрупнуюПокупку,НакопленныеБаллы,ДоступныеБаллы,НачисленныеБаллы,РасчитанныеБаллы,МаксимальныйПроцентОплаты,СуммаБаловКОплате, Запрет, Товары", Статус, Коэффициент, КоэффициентЗаКрупнуюПокупку, НакопленныеБаллы, ДоступныеБаллы, НачисленныеБаллы, РасчитанныеБаллы, МаксимальныйПроцентОплаты, СуммаБаловКОплате, Ложь, ТЗТовары);	
		КонецЕсли;
		
	Иначе
		Возврат Новый Структура("Статус,Коэффициент,КоэффициентЗаКрупнуюПокупку,НакопленныеБаллы,ДоступныеБаллы,НачисленныеБаллы,РасчитанныеБаллы,МаксимальныйПроцентОплаты,СуммаБаловКОплате,Запрет, Товары", Статус, Коэффициент, КоэффициентЗаКрупнуюПокупку, НакопленныеБаллы, ДоступныеБаллы, 0, 0, 0, 0, Истина, ТЗТовары);
	КонецЕсли;
КонецФункции

Функция ПолучитьТоварыКРасчетуБаллов(Товары, ЭтоЗаказ = Ложь, Дата = Неопределено, ОставитьТоварБезБонусов = Ложь)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура,
		|	Характеристика,
		|	Сумма,
		|	НомерСтроки
		|	%ТоварОтменено
		|ПОМЕСТИТЬ Товар
		|ИЗ
		|	&Товар КАК Товар
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура,
		|	Характеристика,
		|	Сумма,
		|	НомерСтроки
		|ПОМЕСТИТЬ ТоварБезТары	
		|ИЗ
		|	Товар 
		|ГДЕ
		|	Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ Номенклатура В ИЕРАРХИИ (&ГрТара)
		|	%УсловиеОтменено
		|;
		|////////////////////////////////////////////////////////////////////////////////     
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа,
		|	ДатаОкончанияДействия
		|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусовПоследние
		|ИЗ
		|	РегистрСведений.ЦеновыеГруппыБезБонусов.СрезПоследних(&Дата)
		|;
		|////////////////////////////////////////////////////////////////////////////////     
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа    
		|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусов
		|ИЗ
		|	втЦеновыеГруппыБезБонусовПоследние
		|ГДЕ 
		|	ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)  
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа    
		|ИЗ
		|	втЦеновыеГруппыБезБонусовПоследние
		|ГДЕ 
		|	ДатаОкончанияДействия >= &Дата
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварБезТары.Номенклатура,
		|	ТоварБезТары.Характеристика,
		|	ТоварБезТары.Сумма,
		|	ТоварБезТары.НомерСтроки,
		|   втЦеновыеГруппыБезБонусов.ЦеноваяГруппа ЕСТЬ НЕ NULL КАК БезБонусов
		|ИЗ
		|	ТоварБезТары 
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		втЦеновыеГруппыБезБонусов
		|			ПО ТоварБезТары.Номенклатура.ЦеноваяГруппа = втЦеновыеГруппыБезБонусов.ЦеноваяГруппа
		|%УсловиеБезБонусов";  
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТоварОтменено", ?(ЭтоЗаказ, ", Товар.Отменено", ""));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеОтменено", ?(ЭтоЗаказ, " И Товар.Отменено = ЛОЖЬ", ""));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеБезБонусов", ?(ОставитьТоварБезБонусов, "", "ГДЕ втЦеновыеГруппыБезБонусов.ЦеноваяГруппа ЕСТЬ NULL"));	
	
    Запрос.УстановитьПараметр("Товар", ?(ТипЗнч(Товары) = Тип("ТаблицаЗначений"), Товары, Товары.Выгрузить()));

	грТара = Справочники.Номенклатура.НайтиПоКоду("00448      ");
	Запрос.УстановитьПараметр("ГрТара", ГрТара);
	
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(Дата)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции                     

Функция ПолучитьФильтровонуюТаблицуТоваровКРасчетуБонусныхБаллов(ТабличнаяЧастьТовары) Экспорт
	
	ТабличнаяЧастьТоварыНовая= ТабличнаяЧастьТовары.Скопировать();
	ТабличнаяЧастьТоварыНовая.Очистить();
	
	ТоварыКОплате= ПолучитьТоварыКРасчетуБаллов(ТабличнаяЧастьТовары);
	
	Для Каждого стрТовара Из ТоварыКОплате Цикл
		НайденныеСтроки = ТабличнаяЧастьТовары.НайтиСтроки(Новый Структура("НомерСтроки", стрТовара.НомерСтроки));
		СтрокаТЧ= НайденныеСтроки[0];
		
		НоваяСтрока= ТабличнаяЧастьТоварыНовая.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
	
	Возврат ТабличнаяЧастьТоварыНовая;
КонецФункции

Функция ПодготовитьСтрокуИнформацииПоБаллам(Объект)  Экспорт
	Если УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер) Тогда
		ИнформациюПоБаллам= ПолучитьИнформациюПоБаллам(ТекущаяДата(), Объект.Партнер);
		
		Если Не ЗначениеЗаполнено(Объект.СтатусПартнераВПрограммеЛояльности) Тогда
			Объект.СтатусПартнераВПрограммеЛояльности= ИнформациюПоБаллам.Статус;
		КонецЕсли;
		Статус= Объект.СтатусПартнераВПрограммеЛояльности;
		
		Если АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер) тогда
			_ИнформацияПоБонусам= "Клиент является профессиональным Бригадиром";
		Иначе	
			Если ЗначениеЗаполнено(Объект.ПроцентЗаКрупнуюПокупку) Тогда
				_ИнформацияПоБонусам= "Статус клиента: "+Статус+" ("+Статус.Коэффициент*100+"%); "+Объект.ПроцентЗаКрупнуюПокупку+"% за крупную покупку; Доступно баллов: "+ИнформациюПоБаллам.ДоступныеБаллы;
			Иначе
				_ИнформацияПоБонусам= "Статус клиента: "+Статус+" ("+Статус.Коэффициент*100+"%); Доступно баллов: "+ИнформациюПоБаллам.ДоступныеБаллы;
			КонецЕсли;
		Конецесли;
		
		Возврат _ИнформацияПоБонусам;
	Иначе
		Возврат "Клиент не участвует в бонусной программе";
	КонецЕсли;
КонецФункции

Процедура ПоказатьИнформациюПоБонусам(Этаформа, Объект) Экспорт
	Элементы= Этаформа.Элементы;
	
	Если БонусыАльтерра.УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер) Тогда
		Элементы.ДекорацияБонусы.Заголовок= "Бонусы";
		Элементы._Информация.Видимость= Истина;		
		
		ИнформацияПоБонусам= БонусыАльтерра.ПолучитьИнформациюПоБаллам(Объект.Дата, Объект.Партнер);
		
		Если ИнформацияПоБонусам.ЭтоБригадир Тогда
			Элементы.ДекорацияБонусы.Заголовок= "Клиент является профессиональным бригадиром";
			Элементы.ДекорацияБонусы.ЦветТекста= Новый Цвет(0, 128, 0);
			Элементы._Информация.Видимость= Ложь;
		Иначе
			Этаформа._ДоступноБаллов= ИнформацияПоБонусам.ДоступныеБаллы;
			Если Не ЗначениеЗаполнено(Объект.СтатусПартнераВПрограммеЛояльности) Тогда
				Объект.СтатусПартнераВПрограммеЛояльности= ИнформацияПоБонусам.Статус;
			КонецЕсли;
			Этаформа._ПроцентУчастникаБонуснойПрограммы= Объект.СтатусПартнераВПрограммеЛояльности.Коэффициент*100;
			Если Объект.Партнер.БонуснаяПрограммаАктивна Тогда
				Элементы.ДекорацияБонусы.ЦветТекста= Новый Цвет(0, 128, 0);
			Иначе
				Элементы.ДекорацияБонусы.ЦветТекста= Новый Цвет(255, 0, 0);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияБонусы.Заголовок= "Не участвует в бонусной программе";
		Если Объект.Партнер.БонуснаяПрограммаАктивна Тогда
			Элементы.ДекорацияБонусы.ЦветТекста= Новый Цвет(0, 128, 0);
		Иначе
			Элементы.ДекорацияБонусы.ЦветТекста= Новый Цвет(255, 0, 0);
		КонецЕсли;
		
		Элементы._Информация.Видимость= Ложь;		
		
		Объект.СтатусПартнераВПрограммеЛояльности= Неопределено;
		Объект.ПроцентЗаКрупнуюПокупку= 0;	
		Этаформа._ПроцентУчастникаБонуснойПрограммы= 0;
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьИнформациюПоБаллам(Дата, Партнер, КартаЛояльности=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КартаЛояльности) Тогда
		БонуснаяПрограммаЛояльности= КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности;
	Иначе
		БонуснаяПрограммаЛояльности= АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;

	МаксимальныйПроцентОплаты = БонуснаяПрограммаЛояльности.МаксимальныйПроцентОплатыБонусами / 100;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус КАК Статус,
		|	СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СрезПоследних(
		|			&Период,
		|			БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности
		|				И Партнер = &Партнер) КАК СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БонусныеБаллыОстатки.Партнер КАК Партнер,
		|	БонусныеБаллыОстатки.НачисленоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллы.Остатки(
		|			&Период,
		|			Партнер = &Партнер
		|				И БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности) КАК БонусныеБаллыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БонусныеБаллыОстатки.Партнер КАК Партнер,
		|	БонусныеБаллыОстатки.НачисленоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллы.Остатки(
		|			,
		|			Партнер = &Партнер
		|				И БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности) КАК БонусныеБаллыОстатки";
	
	Запрос.УстановитьПараметр("Период", ?(Дата = Дата(1,1,1) ИЛИ Дата = НачалоДня(Дата), ТекущаяДата(), Дата));
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	ПакетРезультатов= Запрос.ВыполнитьПакет();	
	
	// Получаем статус партнера
	Выборка= ПакетРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Статус= Выборка.Статус;
		Коэффициент= Выборка.Коэффициент;
	Иначе
		Статус= Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.Умелец;
		Коэффициент= Статус.Коэффициент;
	КонецЕсли;
	
	// получаем доступные баллы
	Выборка= ПакетРезультатов[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ДоступныеБаллы= Выборка.КоличествоОстаток;
	Иначе
		ДоступныеБаллы= 0;
	КонецЕсли;
	
	// получаем накопленные баллы
	Выборка= ПакетРезультатов[2].Выбрать();
	Если Выборка.Следующий() Тогда
		НакопленныеБаллы= Выборка.КоличествоОстаток;
	Иначе
		НакопленныеБаллы= 0;
	КонецЕсли;
	
	ЭтоБригадир= АльтерраОбщегоНазначения.ЭтоБригадир(Партнер);
	
	Возврат Новый Структура("Статус,Коэффициент,НакопленныеБаллы,ДоступныеБаллы,ЭтоБригадир", Статус, Коэффициент, НакопленныеБаллы, ДоступныеБаллы, ЭтоБригадир);	
	
КонецФункции

//Начисление баллов
Процедура НачислитьБонусныеБаллы(Объект)   Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	//Очищаем
	Объект.БонусныеБаллы.Очистить();                          
	Для Каждого стрТовар Из Объект.Товары Цикл
		стрТовар.СуммаНачисленныхБонусныхБалловВВалюте= 0;
	КонецЦикла;
	
	Если Не УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Товары.Итог("Сумма") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	БонуснаяПрограммаЛояльности= Объект.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности;
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		БонуснаяПрограммаЛояльности= АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;
	
	РезультатРасчета= РасчетБонусныхБалов(Объект, БонуснаяПрограммаЛояльности);
	
	РасчитанныеБаллы= РезультатРасчета.РасчитанныеБаллы;
	СуммаИтог= РезультатРасчета.Товары.Итог("Сумма");
	
	Если СуммаИтог = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	БалловКРаспред=  РасчитанныеБаллы/СуммаИтог;
	
	ТекДата= ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
	
	Если РасчитанныеБаллы <> 0 Тогда
		Для Каждого стрТовар Из РезультатРасчета.Товары Цикл
			
			СуммаБонусныхБаллов= БалловКРаспред*стрТовар.Сумма;
			
			НайденнаяСтрока= Объект.Товары[стрТовар.НомерСтроки-1];
			НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте= СуммаБонусныхБаллов;
			
		КонецЦикла;
		НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте= НайденнаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте-(Объект.Товары.Итог("СуммаНачисленныхБонусныхБалловВВалюте")-РасчитанныеБаллы);//Применяем к последней строке если сумма разошлась
		
		//Таблица БонусныеБаллы
		НоваяСтрока= Объект.БонусныеБаллы.Добавить();
		НоваяСтрока.БонуснаяПрограммаЛояльности= БонуснаяПрограммаЛояльности;
		НоваяСтрока.ДатаНачисления= НачалоДня(ТекДата)+3600*24*3;
		НоваяСтрока.СуммаБонусныхБаллов=  Объект.Товары.Итог("СуммаНачисленныхБонусныхБалловВВалюте");
		
	КонецЕсли;
	
	//Записываем в документ
	Объект.СтатусПартнераВПрограммеЛояльности= РезультатРасчета.Статус;
	Объект.ПроцентЗаКрупнуюПокупку= РезультатРасчета.КоэффициентЗаКрупнуюПокупку*100;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ПроверитьЗапретБонусов(Объект, РазрешитьЮЛ = Ложь)  Экспорт
	ЭтоЗаказССайта= Ложь;
	Если ТипЗнч(Объект.Ссылка)  = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ЭтоЗаказССайта= Объект.ССайта;
	ИначеЕсли ТипЗнч(Объект.Ссылка)  = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
			ЭтоЗаказССайта= Объект.ЗаказКлиента.ССайта;
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

		ТабЧДок = Объект.Товары.Выгрузить();
		
		//1. Не начиляем струдникам, юр лицам, не не в группе партнеров Частные лица, Бригадиры
		Если Не УчаствуетПартнерВБонуснойПрограмме(Объект.Партнер, РазрешитьЮЛ) Тогда
			Возврат Истина;
		КонецЕсли;
		
		//2. Склад транзит
		Если Найти(Объект.Склад, "Транзит") > 0 Тогда 
			Возврат Истина;
		КонецЕсли;
		
		//3. Есть произвольные цены
		ЕстьПроизвольныеЦены= ТабЧДок.Найти(Справочники.ВидыЦен.ПустаяСсылка(), "ВидЦены");  
		
		Если ЕстьПроизвольныеЦены <> Неопределено Тогда
			Сообщить("В документе есть произвольные цены, оплата бонусами невозможна!");
			Возврат Истина;
		КонецЕсли;	
		
		//4. Контрагент не физическое лицо
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Если Объект.Контрагент.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо И Не РазрешитьЮЛ Тогда
				Сообщить("Только физические лица могут участвовать в бонусной программе!");
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//5. Проверка на Розницу
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Если Объект.Партнер = Справочники.Партнеры.РозничныйПокупатель Тогда
			Сообщить("Партнер Розница не может участвовать в бонусной программе!");
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
		//6. Есть ручные скидки зад № 62413
		Если ТабЧДок <> Неопределено тогда
			ЕстьРучныеСкидки = ТабЧДок.Итог("ПроцентРучнойСкидки");
			Если ЕстьРучныеСкидки <>0 Тогда
				Сообщить("В документе есть ручные скидки, оплата бонусами невозможна!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
	//7. Организация АСК-Р задача № 119167
	Если Объект.Организация = АльтерраОбщегоНазначения.ПолучитьАСКР() Тогда
		Возврат истина;
	КонецЕсли;	
		
	Возврат Ложь;
КонецФункции

Функция УчаствуетПартнерВБонуснойПрограмме(Партнер, РазрешитьЮЛ = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Партнер = Справочники.Партнеры.РозничныйПокупатель Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Партнер.ЮрФизЛицо =  Перечисления.КомпанияЧастноеЛицо.Компания И Не РазрешитьЮЛ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ГруппаПартнеров= АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Партнер, "Группы партнеров");
	Если ГруппаПартнеров = Неопределено Тогда
		Возврат Ложь
	ИначеЕсли ГруппаПартнеров.Наименование <> "Частные лица" И ГруппаПартнеров.Наименование <> "Бригадиры" Тогда
		
		Если Не РазрешитьЮЛ Тогда
			Возврат Ложь
		ИначеЕсли СокрЛП(ГруппаПартнеров.Наименование) <> "Покупатели (организация/ИП)" И СокрЛП(ГруппаПартнеров.Наименование) <> "Покупатели-поставщики"  Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;  
	
	Если СокрЛП(Партнер.Код) = "А9764" Или СокрЛП(Партнер.Наименование) = "? розница для МД" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьЗапретОплатыБонусов(Объект)  Экспорт
	//Бригадиры
	Если АльтерраОбщегоНазначения.ЭтоБригадир(Объект.Партнер) тогда
		Если не МожноРассчитыватьсяБаллами(Объект.Соглашение) Тогда
			    Сообщить("По данному соглашению оплата бонусами невозможна!");
				Возврат Истина;
		конецесли;
	КонецЕсли;

	Если ПроверитьЗапретБонусов(Объект) Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат ЕстьКомиссионныйТовар(Объект);
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Функция ЕстьКомиссионныйТовар(Объект)  Экспорт
	ТЗЗапасов= Объект.ВидыЗапасов.Выгрузить();
	Если ТЗЗапасов.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТЗЗапасов.Свернуть("ВидЗапасов");
	Для Каждого стрЗапасов Из ТЗЗапасов Цикл
		Если стрЗапасов.ВидЗапасов.ТипЗапасов = Перечисления.ТипыЗапасов.КомиссионныйТовар Тогда
			Сообщить("В документе есть комиссионный товар. Оплата бонусами невозможна!");
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

//Проведение
Процедура КонтрольОстатковПоБонуснымБалалм(Ссылка, Отказ) Экспорт
	СуммаОплаченныхБалловПриПродажи= Ссылка.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");
	Если СуммаОплаченныхБалловПриПродажи = 0 Тогда
		Возврат;
	КонецЕсли;
	
	БонуснаяПрограммаЛояльности= Ссылка.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности;
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		 БонуснаяПрограммаЛояльности= АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БонусныеБаллыОстатки.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллыОстатки.Партнер,
		|	БонусныеБаллыОстатки.НачисленоОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллы.Остатки(, ) КАК БонусныеБаллыОстатки
		|ГДЕ
		|	БонусныеБаллыОстатки.БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности
		|	И БонусныеБаллыОстатки.Партнер = &Партнер
		|	И БонусныеБаллыОстатки.НачисленоОстаток < 0";
	
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	Запрос.УстановитьПараметр("Партнер", Ссылка.Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У партнера не хватает бонусных баллов для оплаты!"+Символы.ПС+"Необходимо обновить оплату в документе.",, ,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

//Заполнение документов
Процедура ЗаполнитьБонусныеБаллыВозвратТоваровОтКлиентаПоРеализации(Объект) Экспорт
	Объект.НачислениеБонусныхБаллов.Очистить();
	Объект.ОплатаБонуснымиБаллами.Очистить();

	
	Если ТипЗнч(Объект.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Основание = Объект.ДокументРеализации;
	Иначе
		Основание = Объект.ЧекККМ;
	КонецЕсли;
	
	Если Основание.Кассир.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	БонуснаяПрограммаЛояльности = Основание.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности;	
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		 БонуснаяПрограммаЛояльности= АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;
	
	Если БонуснаяПрограммаЛояльности.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СуммаНачисленныхБалловПриПродажи= Основание.БонусныеБаллы.Итог("СуммаБонусныхБаллов");
	СуммаОплаченныхБалловПриПродажи= Основание.Товары.Итог("СуммаБонусныхБалловКСписаниюВВалюте");

	Если СуммаНачисленныхБалловПриПродажи > 0 ИЛИ СуммаОплаченныхБалловПриПродажи > 0 Тогда
		Для Каждого стрТовар Из Объект.Товары Цикл
			СтрокИОснования= Основание.Товары.НайтиСтроки(Новый Структура("Номенклатура",стрТовар.Номенклатура));
			СтрокаОснования= СтрокИОснования[0];
						
			//1. Пересчёт бонусных сумм
			Если СтрокаОснования.Количество = стрТовар.Количество Тогда
				стрТовар.СуммаНачисленныхБонусныхБалловВВалюте= СтрокаОснования.СуммаНачисленныхБонусныхБалловВВалюте;
				стрТовар.СуммаБонусныхБалловКСписанию= СтрокаОснования.СуммаБонусныхБалловКСписаниюВВалюте;
				стрТовар.СуммаБонусныхБалловКСписаниюВВалюте= стрТовар.СуммаБонусныхБалловКСписанию;
			Иначе
				стрТовар.СуммаНачисленныхБонусныхБалловВВалюте=  (стрТовар.Количество*СтрокаОснования.СуммаНачисленныхБонусныхБалловВВалюте)/СтрокаОснования.Количество;
				
				стрТовар.СуммаБонусныхБалловКСписанию=  (стрТовар.Количество*СтрокаОснования.СуммаБонусныхБалловКСписаниюВВалюте)/СтрокаОснования.Количество;
				стрТовар.СуммаБонусныхБалловКСписаниюВВалюте= стрТовар.СуммаБонусныхБалловКСписанию;
			КонецЕсли;
			
			//2. Пересчёт сумм рублевых с учётом бонусных
			Если СтрокаОснования.СуммаАвтоматическойСкидки  = 0 Тогда
				 стрТовар.Цена= СтрокаОснования.Цена;
			Иначе//цену нужно пересчитать от исходной суммы, чтобы исключить двойной учёт бонусов, но при этом перенести учёт скидки
				стрСумма = СтрокаОснования.Цена*СтрокаОснования.Количество;
				стрТовар.Цена = (стрСумма*(1-СтрокаОснования.ПроцентАвтоматическойСкидки/100))/СтрокаОснования.Количество;
			КонецЕсли;
			ПересчитатьСуммыСУчетомБонусов(Объект, стрТовар);     
			
			//3. Отбрасывание копеек у бонусных сумм
			Если СтрокаОснования.Количество <> стрТовар.Количество Тогда
				стрТовар.СуммаНачисленныхБонусныхБалловВВалюте=  Цел(стрТовар.СуммаНачисленныхБонусныхБалловВВалюте);
				стрТовар.СуммаБонусныхБалловКСписанию=  Цел(стрТовар.СуммаБонусныхБалловКСписанию);
				стрТовар.СуммаБонусныхБалловКСписаниюВВалюте= стрТовар.СуммаБонусныхБалловКСписанию;
			КонецЕсли;
		КонецЦикла;
		
		Объект.СуммаДокумента= Объект.Товары.Итог("СуммаСНДС");
		
		ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Объект, Объект.СуммаДокумента);// затирает сумму взаиморасчетов
		//Поэтому проставляем сумму
		Для Каждого стрРасшифровки Из  Объект.РасшифровкаПлатежа Цикл
			стрРасшифровки.СуммаВзаиморасчетов= стрРасшифровки.Сумма;
		КонецЦикла;
		
		СуммаВозвратаНачисленныхБаллов= Мин(Объект.Товары.Итог("СуммаНачисленныхБонусныхБалловВВалюте"), СуммаНачисленныхБалловПриПродажи);
		
		Если СуммаВозвратаНачисленныхБаллов > 0 Тогда
			ТекДата= ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
			
			НоваяСтрока = Объект.НачислениеБонусныхБаллов.Добавить();
			НоваяСтрока.БонуснаяПрограммаЛояльности= БонуснаяПрограммаЛояльности;
			НоваяСтрока.ДатаНачисления= ТекДата;
			НоваяСтрока.ДатаСписания=  ТекДата;
			НоваяСтрока.СуммаБонусныхБаллов= СуммаВозвратаНачисленныхБаллов;
		КонецЕсли;
	КонецЕсли;
	
	//Возвращаем оплаты балов часть баллов
	СуммаОплаченныхБалловВернуть= Мин(Объект.Товары.Итог("СуммаБонусныхБалловКСписанию"), СуммаОплаченныхБалловПриПродажи);
	Если СуммаОплаченныхБалловВернуть > 0 Тогда
		
		ТекДата= ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
		
		НоваяСтрока = Объект.ОплатаБонуснымиБаллами.Добавить();
		НоваяСтрока.БонуснаяПрограммаЛояльности= БонуснаяПрограммаЛояльности;
		НоваяСтрока.ДатаОплаты= ТекДата;
		НоваяСтрока.СуммаБонусныхБаллов= -СуммаОплаченныхБалловВернуть;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьБонусныеБаллыВРеализацииПоЗаказу(ТекущийОбъект) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийОбъект.БонусныеБаллы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.КодСтроки,
		|	Товары.НомерСтроки
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика,
		|	ЗаказКлиентаТовары.СуммаНачисленныхБонусныхБалловВВалюте,
		|	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписаниюВВалюте,
		|	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписанию,
		|	ЗаказКлиентаТовары.КодСтроки,
		|	РеализацияТоваровУслугТовары.НомерСтроки
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Товары КАК РеализацияТоваровУслугТовары
		|		ПО ЗаказКлиентаТовары.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ЗаказКлиентаТовары.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|			И ЗаказКлиентаТовары.КодСтроки = РеализацияТоваровУслугТовары.КодСтроки
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаБонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	ЗаказКлиентаБонусныеБаллы.ДатаНачисления,
		|	ЗаказКлиентаБонусныеБаллы.ДатаСписания,
		|	ЗаказКлиентаБонусныеБаллы.СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЗаказКлиента.БонусныеБаллы КАК ЗаказКлиентаБонусныеБаллы
		|ГДЕ
		|	ЗаказКлиентаБонусныеБаллы.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", ТекущийОбъект.ЗаказКлиента);
	Запрос.УстановитьПараметр("Товары", ТекущийОбъект.Товары.Выгрузить());
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ТЧТоварыИБаллы = Результаты[1].Выгрузить();
	ТЧБонусныеБаллы = Результаты[2].Выгрузить();
	
	Для Каждого стрТовар Из ТЧТоварыИБаллы Цикл
		ТкущаяСтрока= ТекущийОбъект.Товары[стрТовар.НомерСтроки-1];
		ТкущаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте= стрТовар.СуммаНачисленныхБонусныхБалловВВалюте;
		ТкущаяСтрока.СуммаБонусныхБалловКСписаниюВВалюте= стрТовар.СуммаБонусныхБалловКСписаниюВВалюте;
		ТкущаяСтрока.СуммаБонусныхБалловКСписанию= стрТовар.СуммаБонусныхБалловКСписанию;
	КонецЦикла;
	
	ТекущийОбъект.БонусныеБаллы.Загрузить(ТЧБонусныеБаллы);
	
КонецПроцедуры

//Вспомогательные
Процедура  ПересчитатьСуммыСУчетомБонусовВТоваре(Объект)  Экспорт
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		ПересчитатьСуммыСУчетомБонусов(Объект, СтрокаТЧ);		
	КонецЦикла;
КонецПроцедуры

Процедура ПересчитатьСуммыСУчетомБонусов(Объект, ТекущаяСтрока)  Экспорт
	СтруктураДействий = Новый Структура;
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	Если  ТипЗнч(Объект.Ссылка) <> Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	КонецЕсли;

	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	
	ЭтоПомощникПродаж= АльтерраОбщегоНазначения.ЕстьРеквизитОбъекта(Объект, "ЭтоПомощникПродаж");
	Если  ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Если ТипЗнч(ТекущаяСтрока) = Тип("ДанныеФормыЭлементКоллекции") И Объект.Товары.Итог("Сумма") <> Объект.СуммаДокумента И Объект.СуммаДокумента <> 0 Тогда 
			СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВозвратПереданнойМногооборотнойТары);
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВозвратПереданнойМногооборотнойТары);
			СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", Новый Структура("БезВозвратнойТары",	"Сумма,СуммаНДС,СуммаСНДС"));
		КонецЕсли;
	КонецЕсли;	
	Если  (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента")) И Не ЭтоПомощникПродаж Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", Новый Структура(	"БезВозвратнойТары",	"Сумма,СуммаНДС,СуммаСНДС,СуммаАвтоматическойСкидки,СуммаРучнойСкидки"));
		Если  ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару", Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
			СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
		КонецЕсли;
	КонецЕсли;
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры


Процедура ЗаполнитьЦенуПродажиИПересчитатьСуммыСУчетомБонусовВТоваре(Объект, ВидЦены=Неопределено)  Экспорт
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(ВидЦены) Тогда
			СтрокаТЧ.ВидЦены= ВидЦены;
		КонецЕсли;
		ЗаполнитьЦенуПродажиИПересчитатьСуммыСУчетомБонусов(Объект, СтрокаТЧ);		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьЦенуПродажиИПересчитатьСуммыСУчетомБонусов(Объект, ТекущаяСтрока)  Экспорт
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж",ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	
	Если  ТипЗнч(Объект.Ссылка) <> Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	КонецЕсли;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	
	Если  ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", Новый Структура(	"БезВозвратнойТары",	"Сумма,СуммаНДС,СуммаСНДС,СуммаАвтоматическойСкидки,СуммаРучнойСкидки"));
		Если  ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару", Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
			СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
		КонецЕсли;
	КонецЕсли;
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);  
	
КонецПроцедуры      

// новая
Процедура ЗаполнитьЦенуПродажиИПересчитать(Объект) экспорт
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
//	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
//	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов", Неопределено);
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗаполнения.Вставить("Партнер", Объект.Партнер);
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("НалогообложениеНДС",  Объект.НалогообложениеНДС);
//	ПараметрыЗаполнения.Вставить("ВозвращатьМногооборотнуюТару",  Объект.ВернутьМногооборотнуюТару);
//	ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена");
	ПараметрыЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыЗаполнения.Вставить("Соглашение", Объект.Соглашение);
	
	
	ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
		Объект.Товары, // Табличная часть
		НЕОПРЕДЕЛЕНО, // Массив строк или структура отбора
		ПараметрыЗаполнения,
		СтруктураДействий);
	

КонецПроцедуры


Процедура ОчиститьБонусыСервер(Объект) Экспорт
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.СуммаБонусныхБалловКСписанию= 0;
		ТекущаяСтрока.СуммаБонусныхБалловКСписаниюВВалюте= 0;
		ТекущаяСтрока.СуммаНачисленныхБонусныхБалловВВалюте= 0;
		
		ПересчитатьСуммыСУчетомБонусов(Объект, ТекущаяСтрока);
	КонецЦикла;
	Объект.СкидкиРассчитаны= Ложь;	
	Объект.БонусныеБаллы.Очистить();
	Объект.СтатусПартнераВПрограммеЛояльности= Неопределено;
	Объект.ПроцентЗаКрупнуюПокупку= 0;	
КонецПроцедуры

Процедура ОчиститьОплатуБалламиСервер(Объект) Экспорт
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.СуммаБонусныхБалловКСписанию= 0;
		ТекущаяСтрока.СуммаБонусныхБалловКСписаниюВВалюте= 0;
		
		ПересчитатьСуммыСУчетомБонусов(Объект, ТекущаяСтрока);
	КонецЦикла;
КонецПроцедуры

Функция ТоварИсключенИзРасчетаБонусныхБалов(стрТовар) Экспорт
	грТара= Справочники.Номенклатура.НайтиПоКоду("00448      ");
	грПоддоны= Справочники.Номенклатура.НайтиПоКоду("Ц0000474   ");
	
	Если стрТовар.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат Истина;
	КонецЕсли;
	Если стрТовар.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
		Возврат Истина;
	КонецЕсли;
	Если стрТовар.Номенклатура.Родитель = грТара ИЛИ  стрТовар.Номенклатура.Родитель = грПоддоны Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура РаспределитьОплатуБаллами(СуммаОплаты, Товары) Экспорт       	
	
	ТоварыКОплате = ПолучитьТоварыКРасчетуБаллов(Товары,,, Истина); 
	МаксимальнаяСуммаОплатыВБаллах = ТоварыКОплате.Итог("Сумма");  
	СуммаКРаспределению = СуммаОплаты;
	
	// Определение строки с максимальной суммой и номера последней строки
	СтрокаСМаксимальнойСуммой  = Неопределено;
	НомерПоследнейСтроки = 0;
	СуммаБонусныхБалловКСписаниюРасчет = 0; 
	
	Для Каждого стрТовара Из ТоварыКОплате Цикл
		СтрокаТЧ = Товары.Найти(стрТовара.НомерСтроки, "НомерСтроки");
		
		Если СтрокаСМаксимальнойСуммой = Неопределено Тогда
			СтрокаСМаксимальнойСуммой = СтрокаТЧ;
		Иначе 
			СтрокаСМаксимальнойСуммой = ?(СтрокаТЧ.Сумма > СтрокаСМаксимальнойСуммой.Сумма, СтрокаТЧ, СтрокаСМаксимальнойСуммой);
		КонецЕсли;		    
		
		НомерПоследнейСтроки = ?(стрТовара.НомерСтроки > НомерПоследнейСтроки, стрТовара.НомерСтроки, НомерПоследнейСтроки);
	КонецЦикла;
	
	// Распределение баллов
	Для Каждого стрТовара Из ТоварыКОплате Цикл
		СтрокаТЧ = Товары.Найти(стрТовара.НомерСтроки, "НомерСтроки");   
		
		Если МаксимальнаяСуммаОплатыВБаллах <= 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если СтрокаТЧ.НомерСтроки <> НомерПоследнейСтроки Тогда
			СтрокаТЧ.СуммаБонусныхБалловКСписанию = СтрокаТЧ.Сумма * (СуммаКРаспределению / МаксимальнаяСуммаОплатыВБаллах);
		Иначе
			СтрокаТЧ.СуммаБонусныхБалловКСписанию = СуммаКРаспределению;
		КонецЕсли;
		
		Цена = (СтрокаТЧ.Сумма - СтрокаТЧ.СуммаБонусныхБалловКСписанию)/СтрокаТЧ.Количество;
		Если Цена < 0.01 Тогда
			СтрокаТЧ.СуммаБонусныхБалловКСписанию = СтрокаТЧ.Сумма - 0.01 * СтрокаТЧ.Количество;
		КонецЕсли;
		СтрокаТЧ.СуммаБонусныхБалловКСписаниюВВалюте = СтрокаТЧ.СуммаБонусныхБалловКСписанию;
		СуммаБонусныхБалловКСписаниюРасчет = СуммаБонусныхБалловКСписаниюРасчет + СтрокаТЧ.СуммаБонусныхБалловКСписанию;
		
		СуммаКРаспределению = СуммаКРаспределению - СтрокаТЧ.СуммаБонусныхБалловКСписанию;
		МаксимальнаяСуммаОплатыВБаллах = МаксимальнаяСуммаОплатыВБаллах - СтрокаТЧ.Сумма;
	КонецЦикла;
	
	// Корректировка копеек при правке цены с 0 на 0,01
	Если СуммаБонусныхБалловКСписаниюРасчет < СуммаОплаты Тогда
		СтрокаСМаксимальнойСуммой.СуммаБонусныхБалловКСписанию = СтрокаСМаксимальнойСуммой.СуммаБонусныхБалловКСписанию + 
			СуммаОплаты - СуммаБонусныхБалловКСписаниюРасчет;
		СтрокаСМаксимальнойСуммой.СуммаБонусныхБалловКСписаниюВВалюте = СтрокаСМаксимальнойСуммой.СуммаБонусныхБалловКСписанию;	
	КонецЕсли;
	
КонецПроцедуры

Функция ОтфильтроватьТаблицуТоваровКРасчетуБонусныхБаллов(ТабличнаяЧастьТовары) Экспорт
	
	ТабличнаяЧастьТоварыИсходная= ТабличнаяЧастьТовары.Скопировать();
	ТабличнаяЧастьТовары.Очистить();
	
	ТоварыКОплате= ПолучитьТоварыКРасчетуБаллов(ТабличнаяЧастьТоварыИсходная);
	
	Для Каждого стрТовара Из ТоварыКОплате Цикл
		НайденныеСтроки = ТабличнаяЧастьТоварыИсходная.НайтиСтроки(Новый Структура("НомерСтроки", стрТовара.НомерСтроки));
		СтрокаТЧ= НайденныеСтроки[0];
		
		НоваяСтрока= ТабличнаяЧастьТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
КонецФункции

Процедура ДобавитьСтрокувТЧБонусныеБаллы(Объект, СуммаБаллов) Экспорт
	Объект.БонусныеБаллы.Очистить();
	
	БонуснаяПрограммаЛояльности = Объект.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности;
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		 БонуснаяПрограммаЛояльности= АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
	КонецЕсли;
	
	ТекДата= ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
	
	НоваяСтрока = Объект.БонусныеБаллы.Добавить();
	НоваяСтрока.БонуснаяПрограммаЛояльности= БонуснаяПрограммаЛояльности;
	НоваяСтрока.ДатаНачисления= ТекДата+3600*24*3;
	НоваяСтрока.ДатаСписания=  ТекДата+3600*24*3;
	НоваяСтрока.СуммаБонусныхБаллов= СуммаБаллов;
КонецПроцедуры

Процедура ОбновитьСтатусВРегистре(Партнер, Статус, БонуснаяПрограммаЛояльности=Неопределено)  Экспорт
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности) Тогда
		БонуснаяПрограммаЛояльности= Справочники.БонусныеПрограммыЛояльности.НайтиПоНаименованию("Бонус от ALTERRA", Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.БонуснаяПрограммаЛояльности = БонуснаяПрограммаЛояльности;
	Запись.Партнер = Партнер;
	Запись.Статус = Статус;
	Запись.Записать();	

	УстановитьПривилегированныйРежим(Ложь);
	
	Комментарий= "Смена статуса на "+Статус;
	ЗаписьЖурналаРегистрации("ОбновлениеСтатусовПартнеров", УровеньЖурналаРегистрации.Информация, Партнер, , Комментарий);
КонецПроцедуры
#КонецОбласти

#ОБласть Проверки
Процедура ПриЗаписиКартыЛояльностиПередЗаписью(Источник, Отказ) Экспорт//Подписка на событие
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УПартнераУжеЕстьКарта(Источник.Ссылка, Отказ);
	
	Если ЗначениеЗаполнено(Источник.Владелец.БонуснаяПрограммаЛояльности) И Источник.Статус = Перечисления.СтатусыКартЛояльности.Действует Тогда
		Если Источник.Партнер = Справочники.Партнеры.РозничныйПокупатель Тогда
			Сообщить("Не нужно оформлять бонусную карту на клиента РОЗНИЦА!");
			Отказ= Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Источник.Контрагент) Тогда
			Если Источник.Контрагент.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо Тогда
				Сообщить("Бонусную карту можно оформить только для физических лиц!");
				Отказ= Истина;
			КонецЕсли;
		Иначе
			Сообщить("Контрагент не заполнен!");
			Отказ= Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Источник.Соглашение) Тогда
			Сообщить("Необходимо задать соглашение!");
			Отказ= Истина;
		Иначе
			ЕстьТЗ= Найти(Источник.Соглашение.Наименование, " ТЗ");
			Если ЕстьТЗ = 0 Тогда
				Сообщить("Необходимо выбрать соглашение с аббривиатурой 'ТЗ'!");
				Отказ= Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Выборка= КартыСТакимШтрихкодом(Источник);
	Пока Выборка.Следующий() Цикл
		Сообщить("С данным штрихкодом  '"+Источник.Штрихкод+"' уже зарегистрирована "+Выборка.ВидКарты+" дисконтная карта на партнера '"+Выборка.Партнер+"'!");
		Отказ= Истина;
	КонецЦикла;
КонецПроцедуры

Функция КартыСТакимШтрихкодом(Источник)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартыЛояльности.Ссылка КАК Ссылка,
		|	КартыЛояльности.Партнер КАК Партнер,
		|	КартыЛояльности.Владелец КАК ВидКарты,
		|	КартыЛояльности.Штрихкод КАК Штрихкод,
		|	КартыЛояльности.Статус КАК Статус
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	НЕ КартыЛояльности.ПометкаУдаления
		|	И КартыЛояльности.Штрихкод = &Штрихкод
		|	И КартыЛояльности.Статус = &Статус
		|	И КартыЛояльности.Ссылка <> &Источник
		|	И КартыЛояльности.Владелец = &ВидКарты";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКартЛояльности.Действует);
	Запрос.УстановитьПараметр("Штрихкод", Источник.Штрихкод);
	Запрос.УстановитьПараметр("Источник", Источник.Ссылка);
	Запрос.УстановитьПараметр("ВидКарты", Источник.Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Процедура УПартнераУжеЕстьКарта(КартаЛояльности, Отказ)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартыЛояльности.Ссылка КАК Карта,
		|	КартыЛояльности.Партнер КАК Партнер,
		|	КартыЛояльности.Владелец КАК ВидКарты
		|ПОМЕСТИТЬ ВТ_Партнер
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Ссылка = &КартаЛояльности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КартыЛояльности.Ссылка КАК Карта,
		|	КартыЛояльности.Партнер КАК Партнер,
		|	КартыЛояльности.Владелец КАК ВидКарты
		|ИЗ
		|	ВТ_Партнер КАК ВТ_Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыЛояльности КАК КартыЛояльности
		|		ПО ВТ_Партнер.Партнер = КартыЛояльности.Партнер
		|ГДЕ
		|	КартыЛояльности.Владелец = &Владелец
		|	И КартыЛояльности.Статус = &Статус
		|	И КартыЛояльности.Ссылка <> &КартаЛояльности";
	
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛояльности);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКартЛояльности.Действует);
	Запрос.УстановитьПараметр("Владелец", Справочники.ВидыКартЛояльности.НайтиПоНаименованию("Бонусная карта"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("У партнера уже есть бонусная карта "+ВыборкаДетальныеЗаписи.Карта);
		Отказ= Истина;
	КонецЦикла;
КонецПроцедуры

Процедура ЕстьПартнерСТакимТелефоном(ЭтотПартнер, Отказ)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Партнер,
		|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ПОМЕСТИТЬ ВТ_Телефон
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка = &ЭтотПартнер
		|	И ПартнерыКонтактнаяИнформация.Вид = &ВидТелефон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Партнер
		|ИЗ
		|	ВТ_Телефон КАК ВТ_Телефон
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|		ПО ВТ_Телефон.НомерТелефона = ПартнерыКонтактнаяИнформация.НомерТелефона
		|			И (&ВидТелефон = ПартнерыКонтактнаяИнформация.Вид)
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка <> &ЭтотПартнер";
	
	Запрос.УстановитьПараметр("ЭтотПартнер", ЭтотПартнер);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		АльтерраОбщегоНазначения.СообщитьПользователю(ВыборкаДетальныеЗаписи.Партнер, "У "+ВыборкаДетальныеЗаписи.Партнер+" такой же номер телефона");
		Отказ= Истина;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Бригадиры
Функция МожноРассчитыватьсяБаллами(Соглашение) Экспорт
	Если  ЗначениеЗаполнено(Соглашение) Тогда
		Если Соглашение.ВозможностьСписатьБаллы Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		Конецесли;	
	Иначе	
		Возврат Ложь;
	Конецесли;		
КонецФункции

Функция НужноПодтверждениеВыбораСоглашения(Соглашение) Экспорт
	Если  ЗначениеЗаполнено(Соглашение) Тогда
		Если Соглашение.ПодтверждениеЦен Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		Конецесли;	
	Иначе	
		Возврат Ложь;
	Конецесли;		
КонецФункции

#КонецОбласти


