#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Объект.Сотрудник = Альтерра_СкладСервер.ТекущийСотрудник();
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Объект.Склад = Объект.Сотрудник.Склад;
	КонецЕсли;

	Режим = "ПроверкаАХ";
	УстановитьВидимостьПриРежиме(Режим, "Проверка адресного хранения");
	
	ДействиеПрисвоитьТекущуюЯчейку = Перечисления.ДействияПриПроверкеАдресногоХранения.ПрисвоитьТекущуюЯчейку;	
	ДействиеПереложитьВДругуюЯчейку = Перечисления.ДействияПриПроверкеАдресногоХранения.ПереложитьВДругуюЯчейку;
	ДействиеСделатьЯчейкуДополнительной = Перечисления.ДействияПриПроверкеАдресногоХранения.СделатьЯчейкуДополнительной;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда
		
		Если Не ПодтвержденоЗакрытиеФормы Тогда 
			Отказ = Истина;
	    	ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Завершить работу по проверке адресного хранения?", РежимДиалогаВопрос.ДаНет, 10 ,КодВозвратаДиалога.Нет);		
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПодтвержденоЗакрытиеФормы = Истина;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	Если ЗначениеЗаполнено(Объект.Склад) И  ЗначениеЗаполнено(Объект.Ячейка) Тогда
		
		Если Объект.Товары.Количество() = 0 Тогда
			ЗаполнитьНоменклатуруНаСервере();
		Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНоменклатуруЗавершение", ЭтотОбъект), "Список товаров будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		КонецЕсли;
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщить("Не выбран склад");
	Иначе
		Сообщить("Не выбрана ячейка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимПроверкаАХ(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Режим", "ПроверкаАХ");
		ДополнительныеПараметры.Вставить("Заголовок", "Проверка адресного хранения");
		ПоказатьВопрос(Новый ОписаниеОповещения("СменитьРежимЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Список товаров будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		Режим = "ПроверкаАХ";
		УстановитьВидимостьПриРежиме(Режим, "Проверка адресного хранения")
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимНовыйСклад(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Режим", "НовыйСклад");
		ДополнительныеПараметры.Вставить("Заголовок", "Адресное хранение: Новый склад");
		ПоказатьВопрос(Новый ОписаниеОповещения("СменитьРежимЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Список товаров будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		Режим = "НовыйСклад";
		УстановитьВидимостьПриРежиме(Режим, "Адресное хранение: Новый склад")
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВРегистр(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписьВРегистрЗавершение", ЭтотОбъект), "Записать новые данные о хранении товара?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область ИзмененияРежимаРаботы

&НаКлиенте
Процедура СменитьРежимЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Режим = ДополнительныеПараметры.Режим;
		УстановитьВидимостьПриРежиме(ДополнительныеПараметры.Режим, ДополнительныеПараметры.Заголовок);
		Объект.Товары.Очистить();
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьВидимостьПриРежиме(Режим, Заголовок)
	РежимПроверки = (Режим = "ПроверкаАХ");
	ЭтаФорма.Заголовок = Заголовок;
	ЭтаФорма.Элементы.ЗаполнитьНоменклатуру.Видимость = РежимПроверки;	
	ЭтаФорма.Элементы.ТоварыПроверено.Видимость = РежимПроверки;	
	ЭтаФорма.Элементы.ТоварыДействие.Видимость = РежимПроверки;
	ЭтаФорма.Элементы.ТоварыИсходнаяЯчейка.Видимость = РежимПроверки;
	ЭтаФорма.Элементы.ТоварыЦелеваяЯчейка.Видимость = РежимПроверки;
	ЭтаФорма.Элементы.ТоварыНетЭтикетки.Видимость = РежимПроверки;
КонецПроцедуры	

#КонецОбласти

#Область ВыбораСкладаИЯчейки

&НаКлиенте
Процедура СкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.Товары.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Объект.Склад) И ВыбранноеЗначение <> Объект.Склад Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Склад", ВыбранноеЗначение);
			ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьТоварыПриВыбореСкладаЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Список товаров не относится к выбираемому складу "  + ВыбранноеЗначение + Символы.ПС + "и будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			Объект.Склад = ВыбранноеЗначение;
		КонецЕсли
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТоварыПриВыбореСкладаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Склад = ДополнительныеПараметры.Склад;
		Объект.Товары.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРабочиеУчасткиНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ПолучитьСписокРабочихУчастковСотрудника(Объект.Сотрудник);
КонецФункции

&НаКлиенте
Процедура ВыбратьЯчейку(Элемент)
    ЗначениеОтбора = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		ЗначениеОтбора.Вставить("Владелец", Объект.Склад);
	КонецЕсли;
    ЗначениеОтбора.Вставить("ЭтоГруппа", Ложь);
    ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
	
    ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);	
	
	Форма = ПолучитьФорму("Справочник.СкладскиеЯчейки.ФормаВыбора", ПараметрыВыбора, Элемент);
	Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
	Форма.Элементы.Наименование.Видимость = Ложь;
	Форма.Элементы.ОбластьХранения.Видимость = Ложь;
	Форма.Элементы.Помещение.Видимость = Ложь;
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЯчейку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.Товары.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Объект.Ячейка) И ВыбранноеЗначение <> Объект.Ячейка Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Ячейка", ВыбранноеЗначение);
			ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьТоварыПриВыбореЯчейкиЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Список товаров не относится к выбираемой ячейке "  + ВыбранноеЗначение + Символы.ПС + "и будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			Объект.Ячейка = ВыбранноеЗначение;
		КонецЕсли
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТоварыПриВыбореЯчейкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Ячейка = ДополнительныеПараметры.Ячейка;
		Объект.Товары.Очистить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ЗаписиВРегистр

&НаСервере
Функция ЗаписатьВРегистрНаСервере()

	ТекстСообщения = "";
	ПолеСообщения = "";
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Результат = ДокументОбъект.ЗаписатьРезультатыПроверкиАХ(ТекстСообщения, ПолеСообщения);
	Если ПолеСообщения = "" Тогда
		Сообщить(ТекстСообщения)
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = ПолеСообщения;
		Сообщение.Сообщить();		
	КонецЕсли;	

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаписьВРегистрЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = ЗаписатьВРегистрНаСервере();
		
		Если Режим = "ПроверкаАХ" Тогда
			ТекстВопроса = "Получить обновленный список товаров в ячейке?"
		Иначе
			ТекстВопроса = "Очистить список товаров?"
		КонецЕсли;
		
		Если Результат Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьПослеЗаписиВРегистрЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПослеЗаписиВРегистрЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	Если Режим = "ПроверкаАХ" Тогда
		ЗаполнитьНоменклатуруНаСервере()
	Иначе
		Объект.Товары.Очистить();
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ТабличнаяЧастьТовары

&НаСервере
Процедура ЗаполнитьНоменклатуруНаСервере()
	Объект.Товары.Очистить();
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	СписокНоменклатуры = ДокументОбъект.ПолучитьНоменклатуруИзЯчейки(Объект.Склад, Объект.Ячейка, ТекущаяДата());
	
	Если СписокНоменклатуры.Количество() > 0 Тогда
		Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
			НовыйТовар = Объект.Товары.Добавить();
			НовыйТовар.Номенклатура = СтрокаСписка.Номенклатура;
			НовыйТовар.ИсходнаяЯчейка = Объект.Ячейка;
			НовыйТовар.ЦелеваяЯчейка = Объект.Ячейка;
		КонецЦикла
	Иначе
	    Сообщить("В ячейке """ + Объект.Ячейка + " нет товара с ненулевым остатком");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНоменклатуруНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьОсновнаяЯчейкаУНоменклатурыНаСервере(Номенклатура, Склад, Ячейка)
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ЕстьОсновнаяЯчейкаУНоменклатуры(Номенклатура, Склад, Ячейка);
КонецФункции

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Если ЗначениеЗаполнено(Объект.Ячейка) Тогда
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.ЦелеваяЯчейка = Объект.Ячейка;
			
			Если Режим = "НовыйСклад" Тогда
				НоваяСтрока.Проверено = Истина;
			КонецЕсли;

		Иначе
			Сообщить("Необходимо выбрать ячейку для добавления товара");
		КонецЕсли;
	Иначе
		Сообщить("Необходимо выбрать склад для добавления товара");
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка) Тогда
		Сообщить("Вместо удаления товара """ + Элементы.Товары.ТекущиеДанные.Номенклатура + """" + " из " + Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка + " выберите действие ""Переложить в другую ячейку""");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка) Тогда
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", ВыбранноеЗначение);
		МассивСтрок = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрок.Количество() > 0 Тогда
			Сообщить("Товар """ + ВыбранноеЗначение + """ уже есть в списке");
		Иначе
			Элементы.Товары.ТекущиеДанные.Номенклатура = ВыбранноеЗначение;	
			
			Если ЕстьОсновнаяЯчейкаУНоменклатурыНаСервере(ВыбранноеЗначение, Объект.Склад, Объект.Ячейка) Тогда
				Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка = Объект.Ячейка;
			Иначе
				Элементы.Товары.ТекущиеДанные.Действие = ДействиеПрисвоитьТекущуюЯчейку;
			КонецЕсли;
			
		КонецЕсли;		
	Иначе 
		Сообщить("Выбор номенклатуры доступен для товара не из текущей ячейки");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДоступенВыборДействия(Действие, ИсходнаяЯчейка, Номенклатура, ОбнулитьЦелевуюЯчейку, ТекстСообщения)
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ИсходнаяЯчейка) Тогда
		
		Если Действие = ДействиеПрисвоитьТекущуюЯчейку Тогда
			ТекстСообщения = "Действие ""Присвоить текущую ячейку"" доступно для товара из других ячеек";	
		Иначе
			Результат = Истина;
		КонецЕсли;
		
	Иначе
		
		Если Действие <> ДействиеПрисвоитьТекущуюЯчейку Тогда
			ТекстСообщения = "Для товара из других ячеек доступно только действие ""Присвоить текущую ячейку""";
		Иначе
			Результат = Истина;
		КонецЕсли;
			
	КонецЕсли;
	
	ОбнулитьЦелевуюЯчейку = Ложь;
	Если (Действие = ДействиеПереложитьВДругуюЯчейку) Или (Действие = ДействиеСделатьЯчейкуДополнительной) Тогда
		ОбнулитьЦелевуюЯчейку = Истина;
	КонецЕсли;
	
	Если Действие = ДействиеСделатьЯчейкуДополнительной Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
		ДополнительнаяЯчейка = ДокументОбъект.ПолучитьЯчейкуНоменклатуры(Объект.Склад, Номенклатура, Ложь);
		Если ДополнительнаяЯчейка <> Справочники.СкладскиеЯчейки.ПустаяСсылка() Тогда
			ТекстСообщения = "Номенклатура """ + Номенклатура + """ уже имеет дополнительную ячейку " + ДополнительнаяЯчейка + ". Дополнительная ячейка будет изменена на выбранную фактическую ячейку.";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ТоварыДействиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТекстСообщения = "";
	ОбнулитьЦелевуюЯчейку = Ложь;
	Если ДоступенВыборДействия(ВыбранноеЗначение, ДанныеСтрока.ИсходнаяЯчейка, ДанныеСтрока.Номенклатура, ОбнулитьЦелевуюЯчейку, ТекстСообщения) Тогда
		
		Если ДанныеСтрока.Действие <> ВыбранноеЗначение Тогда
			Если ОбнулитьЦелевуюЯчейку Тогда
				ДанныеСтрока.ЦелеваяЯчейка = Неопределено
			Иначе
				ДанныеСтрока.ЦелеваяЯчейка = ДанныеСтрока.ИсходнаяЯчейка; 	
			КонецЕсли;
		КонецЕсли;
		
		ДанныеСтрока.Действие = ВыбранноеЗначение;
		
		Если (ВыбранноеЗначение = ДействиеСделатьЯчейкуДополнительной) И (ТекстСообщения <> "") Тогда		
			Сообщить(ТекстСообщения);	
		КонецЕсли
	Иначе
		Сообщить(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДоступенВыборЦелевойЯчейки(Действие)
	Результат = Ложь;
	Если (Действие = ДействиеПереложитьВДругуюЯчейку) Или  (Действие = ДействиеСделатьЯчейкуДополнительной) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ТоварыЦелеваяЯчейкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ДоступенВыборЦелевойЯчейки(ДанныеСтрока.Действие) Тогда
		ВыбратьЯчейку(Элемент)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦелеваяЯчейкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ДоступенВыборЦелевойЯчейки(Элементы.Товары.ТекущиеДанные.Действие) Тогда
		Если ВыбранноеЗначение <> Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка Тогда
			Элементы.Товары.ТекущиеДанные.ЦелеваяЯчейка = ВыбранноеЗначение;
		Иначе
			Элементы.Товары.ТекущиеДанные.ЦелеваяЯчейка = Неопределено;
			Сообщить("Фактическая ячейка должна отличаться от исходной");		
		КонецЕсли;
	Иначе 
		Сообщить("Выбор фактической ячейки доступен при действиях: " + Символы.ПС + """Переложить в другую ячейку"" и ""Сделать ячейку дополнительной""");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
























