#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт

	МеханизмыДокумента.Добавить("Обеспечение");
	МеханизмыДокумента.Добавить("БлокировкаДвиженияТоваров");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов ТаблицаЗначений с данными для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений	
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаБлокировкаДвиженияНоменклатуры(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры, Документ.Статус);
		
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции  

Процедура ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры, Статус)
	
	Если Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда	
		ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка                              КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата                         КАК Период,
		|	ТабЧасть.Номенклатура                        КАК Номенклатура,
		|	ТабЧасть.Характеристика                      КАК Характеристика,
		|	ТабЧасть.Ссылка.Склад                        КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	ТабЧасть.КоличествоУпаковок                  КАК Количество,
		|	НЕОПРЕДЕЛЕНО                                 КАК ЗапланированныйРасходРаспределенногоЗапаса,
		|	ИСТИНА                                       КАК КонтрольСвободногоОстатка,
		|	ЛОЖЬ                                         КАК ИгнорироватьРезервыПриКонтролеОстатков
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТабЧасть
		|ГДЕ
		|	НЕ(&ЗаполнятьПлановоеКоличество
		|			И &ОрдернаяСхемаПриПоступлении)";

		РаспределениеЗапасовДвижения.РасходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
    ИначеЕсли Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано Тогда
		ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка                              КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата                         КАК Период,
		|	ТабЧасть.Номенклатура                        КАК Номенклатура,
		|	ТабЧасть.Характеристика                      КАК Характеристика,
		|	ТабЧасть.Ссылка.Склад                        КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	ТабЧасть.КоличествоУпаковок                  КАК Количество,
		|	ЛОЖЬ                    					 КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО           						 КАК РаспоряжениеВГрафике		
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТабЧасть";
	
		РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);	
	КонецЕсли;
	
КонецПроцедуры
	 
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.БлокировкаДвиженияТоваров";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваров";
	КомандаПечати.Представление = НСтр("ru = 'Блокировка движения товаров'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 1; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.БлокировкаДвиженияТоваров";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваровСЦенойПокупки";
	КомандаПечати.Представление = НСтр("ru = 'Блокировка движения товаров с ценой покупки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 2;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваров") Тогда
		ТабДок= СформироватьБлокировкуДвиженияТоваров(МассивОбъектов,ОбъектыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваров", НСтр("ru = 'Блокировка движения товаров'"), ТабДок);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваровСЦенойПокупки") Тогда
		ТабДок= СформироватьБлокировкуДвиженияТоваровСЦенойПокупки(МассивОбъектов,ОбъектыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваровСЦенойПокупки", НСтр("ru = 'Блокировка движения товаров с ценой покупки'"), ТабДок);
	КонецЕсли;	
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);	

КонецПроцедуры

Функция СформироватьБлокировкуДвиженияТоваров(МассивОбъектов,ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Колонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(Колонка);
	
	ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.БлокировкаДвиженияТоваров.ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваров");
	
	ОбластьЗаголовка         = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьТовары = Макет.Область("Товар");
	ОбластьТовары.ШиринаКолонки = ОбластьТовары.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки;
	
	Если ИспользоватьУпаковкиНоменклатуры Тогда
		ОбластьУпаковокШапка  =  Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаУпаковок");
		ОбластьУпаковокСтрока =  Макет.ПолучитьОбласть("Строка|КолонкаУпаковок");
		ОбластьУпаковокПодвал =  Макет.ПолучитьОбласть("Подвал|КолонкаУпаковок");
	Иначе
		ОбластьТовары = Макет.Область("Товар");
		ОбластьТовары.ШиринаКолонки = ОбластьТовары.ШиринаКолонки 
									  + Макет.Область("КолонкаУпаковокКоличество").ШиринаКолонки
									  + Макет.Область("КолонкаУпаковокПредставление").ШиринаКолонки;
	КонецЕсли;
	
	ОбластьНомераШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьДанныхШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
	ОбластьКонецСтрокиШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	
	ОбластьНомераСтрока = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьДанныхСтрока = Макет.ПолучитьОбласть("Строка|Товар");
	ОбластьКонецСтрокиСтрока = Макет.ПолучитьОбласть("Строка|КонецСтроки");
	
	ОбластьНомераПодвал = Макет.ПолучитьОбласть("Подвал|НомерСтроки");
	ОбластьДанныхПодвал = Макет.ПолучитьОбласть("Подвал|Товар");
	ОбластьКонецСтрокиПодвал = Макет.ПолучитьОбласть("Подвал|КонецСтроки");
	
	ОбластьПодписей = Макет.ПолучитьОбласть("Подписи");
	
	ЗапросПоШапке = Новый Запрос;
	ЗапросПоШапке.Текст = 
	"ВЫБРАТЬ
	|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка,
	|	БлокировкаДвиженияТоваров.Номер КАК Номер,
	|	БлокировкаДвиженияТоваров.Дата КАК Дата,
	|	БлокировкаДвиженияТоваров.Склад.Представление КАК Склад,
	|	БлокировкаДвиженияТоваров.Статус КАК Статус,
	|	БлокировкаДвиженияТоваров.ПричинаБлокировки КАК Причина,
	|	БлокировкаДвиженияТоваров.Ответственный КАК Ответственный,
	|	БлокировкаДвиженияТоваров.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
	|ГДЕ
	|	БлокировкаДвиженияТоваров.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Дата";
	
	ЗапросПоШапке.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	РезультатПоШапке = ЗапросПоШапке.Выполнить().Выгрузить();
	
	ПерваяСтрокаОбъектов = Истина;
	ПервыйДокумент = Истина;
	
	Для Каждого Строка Из РезультатПоШапке Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент ИЛИ (ПервыйДокумент И НЕ ПерваяСтрокаОбъектов) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;

			НазваниеДокумента = НСтр("ru = 'Блокировка движения товара'");
			ОбластьЗаголовка.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Строка,
				НазваниеДокумента);
			ОбластьЗаголовка.Параметры.Заполнить(Строка);
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовка, Строка.Ссылка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовка);
			
			ТабличныйДокумент.Вывести(ОбластьНомераШапка);
						
			ТабличныйДокумент.Присоединить(ОбластьДанныхШапка);
			
			Если ИспользоватьУпаковкиНоменклатуры Тогда
				ТабличныйДокумент.Присоединить(ОбластьУпаковокШапка);
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьКонецСтрокиШапка);

		ЗапросПоТоварам = Новый Запрос;
		ЗапросПоТоварам.УстановитьПараметр("МассивОбъектов", Строка.Ссылка);
		
		ТекстЗапросаПоТоварам = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Товар,
		|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		|	ТаблицаТовары.Номенклатура.Код КАК Код,
		|	ТаблицаТовары.Номенклатура.Артикул КАК Артикул,
		|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
		|	КОНЕЦ КАК ПредставлениеЕдининицыИзмеренияУпаковки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
		|	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	ТаблицаТовары.НомерСтроки,
		|	Товар,
		|	Характеристика";
		
		ЗапросПоТоварам.Текст = ТекстЗапросаПоТоварам;
		ВыборкаПоТоварам = ЗапросПоТоварам.Выполнить().Выбрать();
					
			// Выборка товаров
			
			НомерСтроки = 1;
			
			Пока ВыборкаПоТоварам.НайтиСледующий(Новый Структура("Ссылка",Строка.Ссылка)) Цикл
				
				ОбластьНомераСтрока.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьНомераСтрока);
												
				ОбластьДанныхСтрока.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
					СокрЛП(ВыборкаПоТоварам.ТоварНаименование),
					СокрЛП(ВыборкаПоТоварам.ХарактеристикаНаименование));
				
				ТабличныйДокумент.Присоединить(ОбластьДанныхСтрока);
				
				Если ИспользоватьУпаковкиНоменклатуры Тогда
					ОбластьУпаковокСтрока.Параметры.Заполнить(ВыборкаПоТоварам);
					ТабличныйДокумент.Присоединить(ОбластьУпаковокСтрока);
				КонецЕсли;
				
				ОбластьКонецСтрокиСтрока.Параметры.Заполнить(ВыборкаПоТоварам);
				ТабличныйДокумент.Присоединить(ОбластьКонецСтрокиСтрока);
				
				НомерСтроки = НомерСтроки + 1;
								
			КонецЦикла;
			
			
			ТабличныйДокумент.Вывести(ОбластьНомераПодвал);
						
			ТабличныйДокумент.Присоединить(ОбластьДанныхПодвал);
			
			Если ИспользоватьУпаковкиНоменклатуры Тогда
				ТабличныйДокумент.Присоединить(ОбластьУпаковокПодвал);
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьКонецСтрокиПодвал);
			
			// Вывести подписи.
			ТабличныйДокумент.Вывести(ОбластьПодписей);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало,ОбъектыПечати, Строка.Ссылка);
		
		ПерваяСтрокаОбъектов = Ложь;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;


КонецФункции

Функция СформироватьБлокировкуДвиженияТоваровСЦенойПокупки(МассивОбъектов,ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Колонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(Колонка);
	
	ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.БлокировкаДвиженияТоваров.ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваровСЦенойПокупки");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок"); 
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");  
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	ЗапросПоШапке = Новый Запрос;
	ЗапросПоШапке.Текст = 
	"ВЫБРАТЬ
	|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка,
	|	БлокировкаДвиженияТоваров.Номер КАК Номер,
	|	БлокировкаДвиженияТоваров.Дата КАК Дата,
	|	БлокировкаДвиженияТоваров.Склад.Представление КАК Склад,
	|	БлокировкаДвиженияТоваров.Статус КАК Статус,
	|	БлокировкаДвиженияТоваров.ПричинаБлокировки КАК Причина,
	|	БлокировкаДвиженияТоваров.Ответственный КАК Ответственный,
	|	БлокировкаДвиженияТоваров.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
	|ГДЕ
	|	БлокировкаДвиженияТоваров.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Дата";
	
	ЗапросПоШапке.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	РезультатПоШапке = ЗапросПоШапке.Выполнить().Выгрузить();
	
	ПерваяСтрокаОбъектов = Истина;
	ПервыйДокумент = Истина;
	
	Для Каждого Строка Из РезультатПоШапке Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент ИЛИ (ПервыйДокумент И НЕ ПерваяСтрокаОбъектов) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;

			НазваниеДокумента = НСтр("ru = 'Блокировка движения товара с ценой покупки'");
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Строка,
				НазваниеДокумента);
			ОбластьЗаголовок.Параметры.Заполнить(Строка);
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, Строка.Ссылка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок); 
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			
		ЗапросПоТоварам = Новый Запрос;
		ЗапросПоТоварам.УстановитьПараметр("МассивОбъектов", Строка.Ссылка);
		
		ТекстЗапросаПоТоварам = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Товар,
		|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		|	ТаблицаТовары.Номенклатура.Код КАК Код,
		|	ТаблицаТовары.Номенклатура.Артикул КАК Артикул,
		|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
		|	КОНЕЦ КАК ПредставлениеЕдининицыИзмеренияУпаковки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
		|	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	ТаблицаТовары.НомерСтроки,
		|	Товар,
		|	Характеристика";
		
		ЗапросПоТоварам.Текст = ТекстЗапросаПоТоварам;
		ВыборкаПоТоварам = ЗапросПоТоварам.Выполнить().Выбрать();
					
			// Выборка товаров
			
			НомерСтроки = 1;
			СуммаИтого = 0;
			
			Пока ВыборкаПоТоварам.НайтиСледующий(Новый Структура("Ссылка",Строка.Ссылка)) Цикл 
				
	
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
					|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
					|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
					|ПОМЕСТИТЬ ВТ_ЦенаПокупки
					|ИЗ
					|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
					|			,
					|			Номенклатура = &Номенклатура
					|				И ВидЦены.Идентификатор = ""ЦенаПокупки""
					|				И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////    
					|ВЫБРАТЬ
					|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
					|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
					|	(СебестоимостьТоваровОстаткиИОбороты.СтоимостьКонечныйОстаток + СебестоимостьТоваровОстаткиИОбороты.ДопРасходыКонечныйОстаток) / СебестоимостьТоваровОстаткиИОбороты.КоличествоКонечныйОстаток КАК Цена
					|ПОМЕСТИТЬ ВТ_Себестоимость
					|ИЗ
					|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
					|			&НачалоПериода,
					|			&КонецПериода,
					|			,
					|			,
					|			АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
					|				И АналитикаУчетаНоменклатуры.Характеристика = &Характеристика
					|				И АналитикаУчетаНоменклатуры.СкладскаяТерритория = &Склад) КАК СебестоимостьТоваровОстаткиИОбороты
					|ГДЕ
					|	СебестоимостьТоваровОстаткиИОбороты.КоличествоКонечныйОстаток > 0
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(ВТ_ЦенаПокупки.Цена, ВТ_Себестоимость.Цена) КАК Цена
					|ИЗ
					|	ВТ_Себестоимость КАК ВТ_Себестоимость
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенаПокупки КАК ВТ_ЦенаПокупки
					|		ПО (ИСТИНА)";  
				
				Запрос.Параметры.Вставить("НачалоПериода",НачалоДня(ВыборкаПоТоварам.Ссылка.Дата)); 
				Запрос.Параметры.Вставить("КонецПериода",НачалоДня(ВыборкаПоТоварам.Ссылка.Дата));
				Запрос.Параметры.Вставить("Номенклатура",ВыборкаПоТоварам.Товар);
				Запрос.Параметры.Вставить("Характеристика",ВыборкаПоТоварам.Характеристика);
				Запрос.Параметры.Вставить("Склад",ВыборкаПоТоварам.Ссылка.Склад);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Выборка = РезультатЗапроса.Выбрать();  
				
				Если Выборка.Следующий() Тогда
					ОбластьСтрока.Параметры.Цена = Выборка.Цена; 
					ОбластьСтрока.Параметры.Сумма = Выборка.Цена*ВыборкаПоТоварам.КоличествоУпаковок;
					СуммаИтого = СуммаИтого + Выборка.Цена*ВыборкаПоТоварам.КоличествоУпаковок;
				Иначе	
					ОбластьСтрока.Параметры.Цена = 0; 
					ОбластьСтрока.Параметры.Сумма = 0;	
				КонецЕсли;
				
				
				ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;  
				ОбластьСтрока.Параметры.Заполнить(ВыборкаПоТоварам);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
												
				НомерСтроки = НомерСтроки + 1;
								
			КонецЦикла;
			
			ОбластьПодвал.Параметры.СуммаИтого = СуммаИтого;
			ТабличныйДокумент.Вывести(ОбластьПодвал);
						
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало,ОбъектыПечати, Строка.Ссылка);
		
		ПерваяСтрокаОбъектов = Ложь;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, Документ)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	ДатаНачалаДействияПредварительныхБлокировок = Константы.ДатаНачалаДействияПредварительныхБлокировок.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.УстановитьПараметр("ИспользоватьПредварительныеБлокировки", ?(ДатаНачалаДействияПредварительныхБлокировок=Дата(01,01,0001),Ложь,Истина));
	Запрос.УстановитьПараметр("ДатаНачалаДействияПредварительныхБлокировок", ДатаНачалаДействияПредварительныхБлокировок);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеШапки.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|				И ДанныеШапки.Дата >= ДанныеШапки.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдернаяСхемаПриПоступлении,
	|	ВЫБОР
	|		КОГДА (ДанныеШапки.ДокументОснование ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|				ИЛИ ДанныеШапки.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
	|				ИЛИ ДанныеШапки.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации)
	|               И ДанныеШапки.БлокировкаОснование = ЗНАЧЕНИЕ(Документ.БлокировкаДвиженияТоваров.ПустаяСсылка) 
	|               И &ИспользоватьПредварительныеБлокировки
	|				И ДанныеШапки.Дата >= &ДатаНачалаДействияПредварительныхБлокировок
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаполнятьПлановоеКоличество
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",          	 Реквизиты.Период);
	Запрос.УстановитьПараметр("ОрдернаяСхемаПриПоступлении",          	 Реквизиты.ОрдернаяСхемаПриПоступлении);
	Запрос.УстановитьПараметр("ЗаполнятьПлановоеКоличество",          	 Реквизиты.ЗаполнятьПлановоеКоличество);
	
КонецПроцедуры
		
Функция ТекстЗапросаТаблицаБлокировкаДвиженияНоменклатуры(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "БлокировкаДвиженияТоваров";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаТовары.Ссылка.Склад КАК Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Ссылка.ПричинаБлокировки КАК ПричинаБлокировки,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьПлановоеКоличество
	|				И &ОрдернаяСхемаПриПоступлении
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаТовары.КоличествоУпаковок
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьПлановоеКоличество
	|				И &ОрдернаяСхемаПриПоступлении
	|			ТОГДА ТаблицаТовары.КоличествоУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПлан
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Период,
	|	ТаблицаТовары.Ссылка.Склад,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Ссылка.ПричинаБлокировки,
	|	ТаблицаТовары.КоличествоУпаковок,
	|	0
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.БлокировкаДвиженияТоваров) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.БлокировкаДвиженияТоваров.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.БлокировкаДвиженияТоваров);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

Функция ВыполнитьКонтрольБлокировкиПослеПроведения(Ссылка, Отказ) Экспорт
	Успешно = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БлокировкаДвижения.Номенклатура КАК Номенклатура,
	                      |	БлокировкаДвижения.Характеристика КАК Характеристика,
	                      |	БлокировкаДвижения.Склад КАК Склад,
	                      |	БлокировкаДвижения.ПричинаБлокировки КАК ПричинаБлокировки,
	                      |	-БлокировкаДвижения.КоличествоОстаток КАК Количество,
	                      |	БлокировкаДвижения.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ИЗ
	                      |	Документ.БлокировкаДвиженияТоваров.Товары КАК БлокировкаДвиженияТоваровТовары
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БлокировкаДвиженияТоваров.Остатки(, ) КАК БлокировкаДвижения
	                      |		ПО БлокировкаДвиженияТоваровТовары.Номенклатура = БлокировкаДвижения.Номенклатура
	                      |			И БлокировкаДвиженияТоваровТовары.Характеристика = БлокировкаДвижения.Характеристика
	                      |			И БлокировкаДвиженияТоваровТовары.Ссылка.Склад = БлокировкаДвижения.Склад
	                      |			И БлокировкаДвиженияТоваровТовары.Ссылка.ПричинаБлокировки = БлокировкаДвижения.ПричинаБлокировки
	                      |ГДЕ
	                      |	БлокировкаДвижения.КоличествоОстаток < 0
	                      |	И БлокировкаДвиженияТоваровТовары.Ссылка = &Ссылка");
		
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ШаблонСообщения = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
							|Не заблокирована на складе %Склад% по причине %ПричинаБлокировки% в количестве %Количество% %Единица%'");
			
			
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристика%",
						НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(Выборка.Количество));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%",      Строка(Выборка.Склад));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПричинаБлокировки%",      Строка(Выборка.ПричинаБлокировки));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Единица%",    Строка(Выборка.ЕдиницаИзмерения));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, ,, Отказ);
		Успешно = Ложь;
	КонецЦикла;
	Возврат Успешно;
КонецФункции

Функция ЕстьОстаткиПоПлановомуКоличеству(Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваровОстатки.Номенклатура КАК Номенклатура,
		|	БлокировкаДвиженияТоваровОстатки.Характеристика КАК Характеристика,
		|	БлокировкаДвиженияТоваровОстатки.ПричинаБлокировки КАК ПричинаБлокировки,
		|	БлокировкаДвиженияТоваровОстатки.КоличествоПланОстаток КАК КоличествоПлан
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БлокировкаДвиженияТоваров.Остатки КАК БлокировкаДвиженияТоваровОстатки
		|		ПО ТаблицаТовары.Номенклатура = БлокировкаДвиженияТоваровОстатки.Номенклатура
		|			И ТаблицаТовары.Характеристика = БлокировкаДвиженияТоваровОстатки.Характеристика
		|			И ТаблицаТовары.Ссылка.Склад = БлокировкаДвиженияТоваровОстатки.Склад
		|			И ТаблицаТовары.Ссылка.ПричинаБлокировки = БлокировкаДвиженияТоваровОстатки.ПричинаБлокировки
		|ГДЕ
		|	ТаблицаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано)
		|	И БлокировкаДвиженияТоваровОстатки.КоличествоПланОстаток <> 0
		|	И (ТаблицаТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ВозвратТоваровОтКлиента
		|			ИЛИ ТаблицаТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
		|			ИЛИ ТаблицаТовары.Ссылка.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации)
		|	И ТаблицаТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьПриходныеОрдераПоДокументуОснованию(Распоряжение) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Проведен = ИСТИНА
		|	И ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ПерепровестиПриходныеОрдера(Ссылка,Отказ) Экспорт
	
	Если Не Отказ Тогда
		Если Документы.БлокировкаДвиженияТоваров.ЕстьОстаткиПоПлановомуКоличеству(Ссылка) Тогда
			ПриходныеОрдера = ПолучитьПриходныеОрдераПоДокументуОснованию(Ссылка.ДокументОснование);
			Для Каждого Ордер Из ПриходныеОрдера Цикл
				ОрдерОбъект = Ордер.Ссылка.ПолучитьОбъект();
				ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


#КонецЕсли
