#Область Устинов_изменение_подбора
&НаСервере
Процедура ПоискПоПодстрокеНаКлиенте()
	
	Использование = ЗначениеЗаполнено(СтрокаПоискаНоменклатура);

	Если Использование Тогда
		ШаблонПоиска = СокрЛП(СтрокаПоискаНоменклатура);
		
		МассивОтбора = Новый СписокЗначений();	
		МассивСлов = мРазложитьСтрокуВМассивПодстрок(ШаблонПоиска," ");
		МассивСлов = ПеревестиВРег(МассивСлов);
		КоличествоСлов = МассивСлов.Количество();
		
		Если КоличествоСлов > 0 Тогда
			// Воронин В.В.
			//ТекстЗапроса = 
			//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	Номенклатура.Ссылка КАК Номенклатура,
			//|	Номенклатура.Наименование,
			//|	Номенклатура.Артикул
			//|ИЗ
			//|	Справочник.Номенклатура КАК Номенклатура
			//|ГДЕ
			//|	(Номенклатура.Наименование ПОДОБНО &ШаблонПоиска
			//|	ИЛИ Номенклатура.Артикул ПОДОБНО &ШаблонПоиска)
			//|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	Номенклатура.Наименование,
			|	Номенклатура.Артикул,
			|	Номенклатура.Код
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	(Номенклатура.Наименование ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Артикул ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Код ПОДОБНО &ШаблонПоиска)
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";	
			//-
			
			//Попытка найти по первому слову но его может и не быть.
			ПодстрокаПоиска = СокрЛП(МассивСлов[0]);
			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;							
			Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
			ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
			
			//Попытка найти по второму слову
			Попытка
				Если ТаблицаТоваров.Количество() = 0 Тогда
					ПодстрокаПоиска = СокрЛП(МассивСлов[1]);
					
					Запрос = Новый Запрос();
					Запрос.Текст = ТекстЗапроса;							
					Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
					ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если ТаблицаТоваров.Количество() > 0 Тогда
				Для Каждого СтрЭлемент Из ТаблицаТоваров Цикл
					НаименованиеНоменклатуры = ВРег(СокрЛП(СтрЭлемент.Наименование));
					Артикул = ВРег(СокрЛП(СтрЭлемент.Артикул));
					// Воронин В.В.
					Код = Врег(СокрЛП(СтрЭлемент.Код));
					//-
					КоличествоСовпаденийСлов = 0;
					Для Каждого ПодстрокаПоиска Из МассивСлов Цикл				
						НомерСовпадения = Найти(НаименованиеНоменклатуры, ПодстрокаПоиска);
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Артикул, ПодстрокаПоиска);
						КонецЕсли;
						// Воронин В.В.
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Код, ПодстрокаПоиска);
						КонецЕсли;
						//-
						Если НомерСовпадения > 0 Тогда						
							КоличествоСовпаденийСлов = КоличествоСовпаденийСлов + 1;
							Если КоличествоСовпаденийСлов = КоличествоСлов Тогда
								МассивОтбора.Добавить(СтрЭлемент.Номенклатура);
							КонецЕсли;					
						КонецЕсли;
					КонецЦикла;			
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;	
		
		Если МассивОтбора.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			СписокНоменклатура.Отбор,
			"Ссылка",
			МассивОтбора,
			ВидСравненияКомпоновкиДанных.ВСписке,,Использование);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокНоменклатура.Отбор,
		"Ссылка",
		Неопределено,
		ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	КонецЕсли;
	СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоискаНоменклатура.СписокВыбора, СтрокаПоискаНоменклатура);
КонецПроцедуры
&НаСервере
Процедура Обр_ВыполнитьПоискНоменклатурыНаСервере() 
	Использование = ЗначениеЗаполнено(СтрокаПоискаНоменклатура);

	Если Использование Тогда
		ШаблонПоиска = СокрЛП(СтрокаПоискаНоменклатура);
		
		МассивОтбора = Новый СписокЗначений();	
		МассивСлов = мРазложитьСтрокуВМассивПодстрок(ШаблонПоиска," ");
		МассивСлов = ПеревестиВРег(МассивСлов);
		КоличествоСлов = МассивСлов.Количество();
		
		Если КоличествоСлов > 0 Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	Номенклатура.Наименование,
			|	Номенклатура.Артикул,
			|	Номенклатура.Код
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	(Номенклатура.Наименование ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Артикул ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Код ПОДОБНО &ШаблонПоиска)
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";	
			//-
			
			//Попытка найти по первому слову но его может и не быть.
			ПодстрокаПоиска = СокрЛП(МассивСлов[0]);
			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;							
			Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
			ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
			
			//Попытка найти по второму слову
			Попытка
				Если ТаблицаТоваров.Количество() = 0 Тогда
					ПодстрокаПоиска = СокрЛП(МассивСлов[1]);
					
					Запрос = Новый Запрос();
					Запрос.Текст = ТекстЗапроса;							
					Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
					ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если ТаблицаТоваров.Количество() > 0 Тогда
				Для Каждого СтрЭлемент Из ТаблицаТоваров Цикл
					НаименованиеНоменклатуры = ВРег(СокрЛП(СтрЭлемент.Наименование));
					Артикул = ВРег(СокрЛП(СтрЭлемент.Артикул));
					Код = Врег(СокрЛП(СтрЭлемент.Код));
					КоличествоСовпаденийСлов = 0;
					Для Каждого ПодстрокаПоиска Из МассивСлов Цикл				
						НомерСовпадения = Найти(НаименованиеНоменклатуры, ПодстрокаПоиска);
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Артикул, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Код, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения > 0 Тогда						
							КоличествоСовпаденийСлов = КоличествоСовпаденийСлов + 1;
							Если КоличествоСовпаденийСлов = КоличествоСлов Тогда
								МассивОтбора.Добавить(СтрЭлемент.Номенклатура);
							КонецЕсли;					
						КонецЕсли;
					КонецЦикла;			
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;	
		
		Если МассивОтбора.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			СписокНоменклатура.Отбор,
			"Ссылка",
			МассивОтбора,
			ВидСравненияКомпоновкиДанных.ВСписке,,Использование);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокНоменклатура.Отбор,
		"Ссылка",
		Неопределено,
		ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	КонецЕсли;
	СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоискаНоменклатура.СписокВыбора, СтрокаПоискаНоменклатура);
	
	
КонецПроцедуры
&НаСервере
Функция ПеревестиВРег(МассивСлов)
	
	НовыйМассив = Новый Массив; 
	
	Для Каждого Стр Из МассивСлов Цикл
		НовыйМассив.Добавить(ВРег(СокрЛП(Стр)));
	КонецЦикла;
	
	Возврат НовыйМассив; 
	
КонецФункции
&НаСервере
Функция мРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ";")
	
	МассивСтрок = Новый Массив();
	
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;		
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 
&НаКлиенте
Процедура Обр_СтрокаПоискаНоменклатураПриИзмененииВместо(Элемент)
Обр_ВыполнитьПоискНоменклатурыНаСервере();
		ПодборТоваровКлиент.ПослеВыполненияПоискаНоменклатуры(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Обр_СтрокаПоискаНоменклатураОчисткаВместо(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	СтрокаПоискаНоменклатура = "";

	Обр_ВыполнитьПоискНоменклатурыНаСервере();
КонецПроцедуры
#КонецОбласти
