
&НаСервере
Процедура Обр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	МодифицироватьЗапрос();
	Элементы.КорзинаВидЦены.ТолькоПросмотр = Не ПроверкиАльтерраСервер.ИмеетПолныеПрава();
	Если Параметры.Свойство("СтруктураКлиента") Тогда
		_СтруктураКлиента = Параметры.СтруктураКлиента;
	КонецЕсли;	
	
	Элементы.ОстаткиТоваров.Видимость = Истина;
	Элементы.ОтображатьОстаткиНадпись.Видимость = Истина;

КонецПроцедуры

&НаСервере
Процедура МодифицироватьЗапрос()
	
	Если Не ПустаяСтрока(СписокНоменклатура.ТекстЗапроса) Тогда
		Если СтрНайти(СписокНоменклатура.ТекстЗапроса, "ABCКлассификацияНоменклатуры_Альтерра") = 0 Тогда 
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(СписокНоменклатура.ТекстЗапроса);  
			
			
			ПакетЗапроса = СхемаЗапроса.ПакетЗапросов.Количество()-1;
			ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[ПакетЗапроса];
			ОператорВыбора = ЗапросВыбора.Операторы[0];
			
			НовыйИсточник = ОператорВыбора.Источники.Добавить("РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.СрезПоследних","ABCКлассификацияНоменклатуры_АльтерраСрезПоследних");
			
			НовыйИсточник.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
			Условие = Новый ВыражениеСхемыЗапроса("СправочникНоменклатура.Ссылка = ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Номенклатура");
			НовыйИсточник.Соединения[0].Условие = Условие;
			
			НовыйИсточник.Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса("Подразделение=&Подразделение") ;
			
			ОператорВыбора.ВыбираемыеПоля.Добавить("ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Класс");
			 
			Если найти(СписокНоменклатура.ТекстЗапроса,"&Склад") > 0 тогда
				НовыйИсточник = ОператорВыбора.Источники.Добавить("РегистрНакопления.ТоварыКОтгрузке.Остатки","ТоварыКОтгрузке");
				Условие = Новый ВыражениеСхемыЗапроса("СправочникНоменклатура.Ссылка = ТоварыКОтгрузке.Номенклатура");
				НовыйИсточник.Соединения[0].Условие = Условие;
				НовыйИсточник.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
				НовыйИсточник.Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса("Склад в (&Склад)") ;
				
				стрпоиска = "ВЫРАЗИТЬ(ЕСТЬNULL(ВсеОстатки.ВНаличии, 0) /";
				стрзамены = "ВЫРАЗИТЬ((ЕСТЬNULL(ВсеОстатки.ВНаличии, 0) + ЕСТЬNULL(ТоварыКОтгрузке.КОтгрузкеОстаток, 0)) /";
				
				СписокНоменклатура.ТекстЗапроса = стрзаменить(СхемаЗапроса.ПолучитьТекстЗапроса(), стрпоиска, стрзамены);
			Иначе
				СписокНоменклатура.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
			КонецЕсли;
			СписокНоменклатура.Параметры.УстановитьЗначениеПараметра("Подразделение", Склад.Подразделение);
		КонецЕсли;  
		
		//новое ценообразование
		Если ДопМодуль.НовоеЦенообразование() Тогда     
			Если ЭтаФорма.ВидыЦен.Количество() = 0 Тогда
				ВидыЦенПараметр = Справочники.ВидыЦен.ПустаяСсылка();
			ИначеЕсли ЭтаФорма.ВидыЦен.Количество() = 1 Тогда
				ВидыЦенПараметр = ЭтаФорма.ВидыЦен[0].Значение;
			Иначе
				ВидыЦенПараметр = ЭтаФорма.ВидыЦен.ВыгрузитьЗначения();
			КонецЕсли;

				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ВидыЦен", ВидыЦенПараметр);
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ФорматПодразделения", Подразделение.ФорматПодразделения);
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "РегионПрисутствия", Подразделение.РегионПрисутствия);
		КонецЕсли;	
		
		ДобавитьОтборПоСегменту();
	КонецЕсли; 
	
КонецПроцедуры

#Область ИзменениеПодбора

&НаСервере
Процедура ПоискПоПодстрокеНаКлиенте()
	
	Использование = ЗначениеЗаполнено(СтрокаПоискаНоменклатура);
	
	Если Использование Тогда
		ШаблонПоиска = СокрЛП(СтрокаПоискаНоменклатура);
		
		МассивОтбора = Новый СписокЗначений();	
		МассивСлов = мРазложитьСтрокуВМассивПодстрок(ШаблонПоиска," ");
		МассивСлов = ПеревестиВРег(МассивСлов);
		КоличествоСлов = МассивСлов.Количество();
		
		Если КоличествоСлов > 0 Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	Номенклатура.Наименование,
			|	Номенклатура.Артикул,
			|	Номенклатура.Код
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	(Номенклатура.Наименование ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Артикул ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Код ПОДОБНО &ШаблонПоиска)
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";	
			
			//Попытка найти по первому слову но его может и не быть.
			ПодстрокаПоиска = СокрЛП(МассивСлов[0]);
			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;							
			Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
			ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
			
			//Попытка найти по второму слову
			Попытка
				Если ТаблицаТоваров.Количество() = 0 Тогда
					ПодстрокаПоиска = СокрЛП(МассивСлов[1]);
					
					Запрос = Новый Запрос();
					Запрос.Текст = ТекстЗапроса;							
					Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
					ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если ТаблицаТоваров.Количество() > 0 Тогда
				Для Каждого СтрЭлемент Из ТаблицаТоваров Цикл
					НаименованиеНоменклатуры = ВРег(СокрЛП(СтрЭлемент.Наименование));
					Артикул = ВРег(СокрЛП(СтрЭлемент.Артикул));
					Код = Врег(СокрЛП(СтрЭлемент.Код));
					КоличествоСовпаденийСлов = 0;
					Для Каждого ПодстрокаПоиска Из МассивСлов Цикл				
						НомерСовпадения = Найти(НаименованиеНоменклатуры, ПодстрокаПоиска);
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Артикул, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Код, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения > 0 Тогда						
							КоличествоСовпаденийСлов = КоличествоСовпаденийСлов + 1;
							Если КоличествоСовпаденийСлов = КоличествоСлов Тогда
								МассивОтбора.Добавить(СтрЭлемент.Номенклатура);
							КонецЕсли;					
						КонецЕсли;
					КонецЦикла;			
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;	
		
		Если МассивОтбора.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			СписокНоменклатура.Отбор,
			"Ссылка",
			МассивОтбора,
			ВидСравненияКомпоновкиДанных.ВСписке,,Использование);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокНоменклатура.Отбор,
		"Ссылка",
		Неопределено,
		ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	КонецЕсли;
	СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоискаНоменклатура.СписокВыбора, СтрокаПоискаНоменклатура);

КонецПроцедуры

&НаСервере
Процедура Обр_ВыполнитьПоискНоменклатурыНаСервере() 
	
	Использование = ЗначениеЗаполнено(СтрокаПоискаНоменклатура);
	
	Если Использование Тогда
		ШаблонПоиска = СокрЛП(СтрокаПоискаНоменклатура);
		
		МассивОтбора = Новый СписокЗначений();	
		МассивСлов = мРазложитьСтрокуВМассивПодстрок(ШаблонПоиска," ");
		МассивСлов = ПеревестиВРег(МассивСлов);
		КоличествоСлов = МассивСлов.Количество();
		
		Если КоличествоСлов > 0 Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	Номенклатура.Наименование,
			|	Номенклатура.Артикул,
			|	Номенклатура.Код
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	(Номенклатура.Наименование ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Артикул ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Код ПОДОБНО &ШаблонПоиска)
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";	
			//-
			
			//Попытка найти по первому слову но его может и не быть.
			ПодстрокаПоиска = СокрЛП(МассивСлов[0]);
			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;							
			Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
			ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
			
			//Попытка найти по второму слову
			Попытка
				Если ТаблицаТоваров.Количество() = 0 Тогда
					ПодстрокаПоиска = СокрЛП(МассивСлов[1]);
					
					Запрос = Новый Запрос();
					Запрос.Текст = ТекстЗапроса;							
					Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
					ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если ТаблицаТоваров.Количество() > 0 Тогда
				Для Каждого СтрЭлемент Из ТаблицаТоваров Цикл
					НаименованиеНоменклатуры = ВРег(СокрЛП(СтрЭлемент.Наименование));
					Артикул = ВРег(СокрЛП(СтрЭлемент.Артикул));
					Код = Врег(СокрЛП(СтрЭлемент.Код));
					КоличествоСовпаденийСлов = 0;
					Для Каждого ПодстрокаПоиска Из МассивСлов Цикл				
						НомерСовпадения = Найти(НаименованиеНоменклатуры, ПодстрокаПоиска);
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Артикул, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Код, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения > 0 Тогда						
							КоличествоСовпаденийСлов = КоличествоСовпаденийСлов + 1;
							Если КоличествоСовпаденийСлов = КоличествоСлов Тогда
								МассивОтбора.Добавить(СтрЭлемент.Номенклатура);
							КонецЕсли;					
						КонецЕсли;
					КонецЦикла;			
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;	
		
		Если МассивОтбора.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			СписокНоменклатура.Отбор,
			"Ссылка",
			МассивОтбора,
			ВидСравненияКомпоновкиДанных.ВСписке,,Использование);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокНоменклатура.Отбор,
		"Ссылка",
		Неопределено,
		ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	КонецЕсли;
	СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоискаНоменклатура.СписокВыбора, СтрокаПоискаНоменклатура);
	
КонецПроцедуры

&НаСервере
Функция ПеревестиВРег(МассивСлов)
	
	НовыйМассив = Новый Массив; 
	
	Для Каждого Стр Из МассивСлов Цикл
		НовыйМассив.Добавить(ВРег(СокрЛП(Стр)));
	КонецЦикла;
	
	Возврат НовыйМассив; 
	
КонецФункции

&НаСервере
Функция мРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ";")
	
	МассивСтрок = Новый Массив();
	
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;		
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз - 1));
			Стр = Сред(Стр,Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура Обр_СтрокаПоискаНоменклатураПриИзмененииВместо(Элемент)
	
	// +Альтерра
	Обр_ВыполнитьПоискНоменклатурыНаСервере();
	ПодборТоваровКлиент.ПослеВыполненияПоискаНоменклатуры(ЭтаФорма);
	// -    
	
КонецПроцедуры

&НаКлиенте
Процедура Обр_СтрокаПоискаНоменклатураОчисткаВместо(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаПоискаНоменклатура = "";
	
	// +Альтерра
	Обр_ВыполнитьПоискНоменклатурыНаСервере();  
	// -    
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Обр_ИспользоватьФильтрыПриИзмененииПосле(Элемент)
	МодифицироватьЗапрос();
КонецПроцедуры

&НаКлиенте
Процедура Обр_СегментНоменклатурыПриИзмененииПеред(Элемент)
	ДобавитьОтборПоСегменту();
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборПоСегменту()
	
	СтрокаУсловия = "
	|1 В
	|(ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК Сегменты
	|ГДЕ
	|	Сегменты.Номенклатура = СправочникНоменклатура.Ссылка
	|	И Сегменты.Сегмент = &СегментНоменклатуры)";
	
	СхемаЗапроса= Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(СписокНоменклатура.ТекстЗапроса);
//	ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[0]; 
	ПакетЗапроса = СхемаЗапроса.ПакетЗапросов.Количество()-1;
	ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[ПакетЗапроса];
	ОператорВыбора = ЗапросВыбора.Операторы[0];
	Если ЗначениеЗаполнено(СегментНоменклатуры) Тогда	
		ОператорВыбора.Отбор.Добавить(СтрокаУсловия);
		
		СписокНоменклатура.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();			
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "СегментНоменклатуры", СегментНоменклатуры, ЗначениеЗаполнено(СегментНоменклатуры));
	Иначе
		Условие = ОператорВыбора.Отбор.Найти(СтрокаУсловия);	
		Если Условие <> Неопределено Тогда
			Индекс = ОператорВыбора.Отбор.Индекс(Условие);
			ОператорВыбора.Отбор.Удалить(Индекс);
			СписокНоменклатура.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область СохранениеСегмента

&НаСервере
Процедура Обр_ПриОткрытииПослеНаСервере()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодборТоваровВДокументПродажи_Форма","Настройки",СтруктураНастроек);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураНастроек); 
	
КонецПроцедуры

&НаКлиенте
Процедура Обр_ПриОткрытииПосле(Отказ)
	
	Обр_ПриОткрытииПослеНаСервере();
	Если ЗначениеЗаполнено(СегментНоменклатуры) Тогда
		ДобавитьОтборПоСегменту();
	КонецЕсли;    
	
КонецПроцедуры

&НаСервере
Процедура Обр_ПередЗакрытиемПослеНаСервере()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СегментНоменклатуры", СегментНоменклатуры);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодборТоваровВДокументПродажи_Форма","Настройки",СтруктураНастроек);
	Если значениезаполнено(_СтруктураКлиента) Тогда
		Если _НехваткаТовара.Количество() > 0 Тогда
			УстановитьПривилегированныйРежим(Истина);
			Попытка 
				ДокументНехватки = Документы.НехваткаТовара.СоздатьДокумент();
				ДокументНехватки.Дата = ТекущаяДата();
				ДокументНехватки.Менеджер = Пользователи.ТекущийПользователь();
				ДокументНехватки.Склад = Объект.Склад;
				ДокументНехватки.Клиент = _СтруктураКлиента.Партнер;
				ДокументНехватки.Контрагент = _СтруктураКлиента.Контрагент;
				ДокументНехватки.Товары.Загрузить(_НехваткаТовара.Выгрузить());
				ДокументНехватки.Записать();
				_НехваткаТовара.Очистить();
				Документы.НехваткаТовара.СоздатьСообщениеВБитрихПоДокументуНехватки(ДокументНехватки);
			Исключение
				_НехваткаТовара.Очистить();
				Информация = ИнформацияОбОшибке();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = КраткоеПредставлениеОшибки(Информация);
				Сообщение.Сообщить();
				ТекстОшибки = ПодробноеПредставлениеОшибки(Информация);
			КонецПопытки;	
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;	
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура Обр_ПередЗакрытиемПосле(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Обр_ПередЗакрытиемПослеНаСервере();
КонецПроцедуры
#КонецОбласти

#Область Аналоги

&НаКлиенте
Процедура Обр_СписокСтандартныйПоискНоменклатураПриАктивизацииСтрокиПосле(Элемент)
	
	Если _ПоказыватьАналоги И Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьАналогиСервер(Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные.Номенклатура);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАналогиСервер(Номенклатура)
	
	_Аналоги.Очистить();
	
	Если Номенклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ВидыЦен.Количество() > 0 Тогда
		ВидЦеныП = ВидыЦен[0].Значение;
	Иначе
		ВидЦеныП = ВидЦены;
	КонецЕсли;
	
	_Аналоги.Загрузить(РегистрыСведений.АналогиНоменклатуры.ПолучитьАналогиНоменклатуры(Номенклатура,ВидЦеныП,Склад));
	
КонецПроцедуры

&НаКлиенте
Процедура Обр_СписокРасширенныйПоискНоменклатураПриАктивизацииСтрокиПосле(Элемент)
	
	Если _ПоказыватьАналоги И Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьАналогиСервер(Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обр__АналогиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;
	
	СтараяТекСтрока = ТекущаяСтрокаНоменклатуры;
	
	Если ТекущаяСтрокаНоменклатуры.ХарактеристикиИспользуются Тогда
		Обр__ПерейтиКХарактеристикамНоменклатурыПослеНаСервере(Элементы._Аналоги.ТекущиеДанные.Номенклатура);
		Элементы.СтраницыАналогов.ТекущаяСтраница = Элементы.СтраницаАналогиХарактеристик;
	Иначе
		ТекущаяСтрокаНоменклатуры = ПодборТоваровКлиентСервер.СтруктураСтрокиНоменклатуры();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрокаНоменклатуры, Элемент.ТекущиеДанные);
		
		ПодборТаблицаНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Неопределено, СтандартнаяОбработка);
		ТекущаяСтрокаНоменклатуры = СтараяТекСтрока;
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура Обр__ПерейтиКХарактеристикамНоменклатурыПослеНаСервере(Номенклатура)	

	Запрос = Новый Запрос;   
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
	|	ХарактеристикиНоменклатуры.Владелец.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	&ВидЦены КАК ВидЦены,
	|	&Склад КАК Склад,
	|	ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) КАК Доступно,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	НЕОПРЕДЕЛЕНО КАК ВладелецХарактеристик,
	|	ИСТИНА КАК ХарактеристикиИспользуются,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка) КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК СодержитТовары,
	|	ЛОЖЬ КАК СодержитУслуги
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ХарактеристикиНоменклатуры.Владелец = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = ЦеныНоменклатурыСрезПоследних.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|			ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК ВНаличии,
	|			СУММА(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Резерв
	|		ИЗ
	|			РегистрНакопления.ЗапасыИПотребности.Остатки(
	|					,
	|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						И Склад = &Склад) КАК ЗапасыИПотребностиОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗапасыИПотребностиОстатки.Номенклатура,
	|			ЗапасыИПотребностиОстатки.Характеристика) КАК РаспределениеЗапасов
	|		ПО ХарактеристикиНоменклатуры.Владелец = РаспределениеЗапасов.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = РаспределениеЗапасов.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
	|		ПО ХарактеристикиНоменклатуры.Владелец = ТоварыКОтгрузкеОстатки.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = ТоварыКОтгрузкеОстатки.Характеристика
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
	Если ВидыЦен.Количество() > 0 Тогда
		ВидЦеныП = ВидыЦен[0].Значение;
	Иначе
		ВидЦеныП = ВидЦены;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦеныП);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	_АналогиХарактеристики.Загрузить(Рез);
	
КонецПроцедуры

&НаКлиенте
Процедура Обр__ПерейтиКСпискуАналогиПосле(Команда)
	Элементы.СтраницыАналогов.ТекущаяСтраница = Элементы.СтраницаАналогиНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура Обр__АналогиХарактеристикиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтараяТекСтрокаХарактеристика = ТекущаяСтрокаХарактеристик;
	
	ТекущаяСтрокаХарактеристик = ПодборТоваровКлиентСервер.СтруктураСтрокиХарактеристик();
	ЗаполнитьЗначенияСвойств(ТекущаяСтрокаХарактеристик, Элемент.ТекущиеДанные);
	
	ПодборТаблицаХарактеристикиВыбор(Элемент, ВыбраннаяСтрока, Неопределено, СтандартнаяОбработка);
	ТекущаяСтрокаХарактеристик = СтараяТекСтрокаХарактеристика;	        
	
КонецПроцедуры

&НаКлиенте
Процедура Обр__ОткрытьКарточкуПосле(Команда)

	ТекущаяСтрока = ЭтаФорма.Элементы._Аналоги.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ТекущаяСтрока.Номенклатура);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);  
	
КонецПроцедуры

&НаКлиенте
Процедура Обр__ПоказыватьАналогиПриИзмененииПосле(Элемент)
	Элементы.СтраницыАналогов.Видимость = _ПоказыватьАналоги; 
КонецПроцедуры

#КонецОбласти


#Область ПоказатьРезервы
&НаКлиенте
Процедура Ном_ПоказатьРезервы(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элементы[ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(ЭтаФорма)].ТекущаяСтрока);
	ПараметрыФормы.Вставить("Склад",Объект.Склад);
	ОткрытьФорму("ОбщаяФорма.ФормаРезервыПоСкладам", ПараметрыФормы, ЭтаФорма); 
	
КонецПроцедуры

#КонецОбласти

#Область Нехватка

&НаКлиенте
Процедура Док__ДобавитьНехваткуТовараПосле(Команда)
	
	ПараметрыФормы = Новый Структура;
	ДанныеСтроки = Элементы[ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(ЭтаФорма)].ТекущиеДанные;
	ПараметрыФормы.Вставить("Номенклатура",ДанныеСтроки.Номенклатура );
	ПараметрыФормы.Вставить("Остаток", ДанныеСтроки.Доступно);
	ПараметрыФормы.Вставить("КлассТовара", ДанныеСтроки.Класс);
	ПараметрыФормы.Вставить("Ликвидность", ВернутьЛиквидность(ДанныеСтроки.Номенклатура,Склад));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКоличестваНехватки", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.ЗапросКоличестваНехватки",ПараметрыФормы,,,,,ОписаниеОповещения);	

КонецПроцедуры

&НаСервере
Функция ВернутьЛиквидность(Номенклатура,Склад)
	
	Если значениезаполнено(склад) Тогда
		Возврат РегистрыСведений.Неликвиды.ВернутьЛиквидностьТовара(Номенклатура,Склад.Подразделение);
	КонецЕсли;	
	Возврат Перечисления.Ликвидность.ПустаяСсылка(); 
	
конецфункции	

&НаКлиенте
Процедура ПослеВыбораКоличестваНехватки(Результат,ДопПараметры) Экспорт

	ПослеВыбораКоличестваНехваткиСервер(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораКоличестваНехваткиСервер(Результат)

	Если Результат <> Неопределено Тогда 
		СтрокаТаблицы = _НехваткаТовара.Добавить();
		заполнитьЗначенияСвойств(СтрокаТаблицы,Результат);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти     

// новое ценообразование
&Вместо ("ЗаполнитьЦеныПоСоглашениюСервер")
Функция Док_ЗаполнитьЦеныПоСоглашениюСервер(ПоВсемСтрокам = Ложь)
	
	Если ПоВсемСтрокам Тогда
		МассивСтрок = Неопределено;
	Иначе
		МассивСтрок = Новый Массив;
		Для Каждого Строка Из Элементы.Корзина.ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(Объект.Корзина.НайтиПоИдентификатору(Строка));
		КонецЦикла;
	КонецЕсли;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(Объект.Корзина, МассивСтрок);
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	
	ПараметрыЗаполненияЦен = Новый Структура;
	ПараметрыЗаполненияЦен.Вставить("Дата",               Дата);
	ПараметрыЗаполненияЦен.Вставить("Валюта",             Валюта);     
	ПараметрыЗаполненияЦен.Вставить("Партнер",            Партнер);
	ПараметрыЗаполненияЦен.Вставить("Соглашение",         Соглашение);
	ПараметрыЗаполненияЦен.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ПараметрыЗаполненияЦен.Вставить("ВозвращатьМногооборотнуюТару", ВозвращатьМногооборотнуюТару);
	ПараметрыЗаполненияЦен.Вставить("Организация",        Организация);
	ПараметрыЗаполненияЦен.Вставить("РассчитыватьНаборы", Истина);    
	// +Альтерра
	ПараметрыЗаполненияЦен.Вставить("ПоляЗаполнения",	  "Цена, СтавкаНДС, ВидЦены, СрокПоставки");    
	// ПараметрыЗаполненияЦен.Вставить("ПоляЗаполнения",     "Цена, ВидЦены, СрокПоставки");
	// -
	
	// +Альтерра
	Если ДопМодуль.НовоеЦенообразование() Тогда
		ПараметрыЗаполненияЦен.Вставить("Подразделение", Подразделение);
	КонецЕсли;	
	// -
	
	ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
		Объект.Корзина,
		МассивСтрок, // Массив строк или структура отбора
		ПараметрыЗаполненияЦен, // Параметры заполнения
		СтруктураДействий);
	
	ПодборТоваровКлиентСервер.УстановитьТекстИнформационнойНадписи(ЭтаФорма);
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("ДополнитьСтруктуруДействиямиРасчетаЦены")
Процедура Док_ДополнитьСтруктуруДействиямиРасчетаЦены(Объект, СтруктураДействий, ТекущаяСтрока)

	ОписаниеОбъекта = Новый Структура;
	ОписаниеОбъекта.Вставить("Дата", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, Объект.ТекущаяДатаСеанса));
	ОписаниеОбъекта.Вставить("Валюта", Объект.Валюта);
	ОписаниеОбъекта.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	Если Объект.ВидыЦен.Количество() И ЗначениеЗаполнено(Объект.ВидыЦен[0].Значение) Тогда
		ОписаниеОбъекта.ВидЦены = Объект.ВидыЦен[0].Значение;
	КонецЕсли;
	ОписаниеОбъекта.Вставить("Партнер",    Объект.Партнер);
	ОписаниеОбъекта.Вставить("Соглашение", Объект.Соглашение);
	ОписаниеОбъекта.Вставить("Ссылка",     Неопределено);
	
	#Вставка
    ОписаниеОбъекта.Вставить("Подразделение",Объект.Подразделение);
    #КонецВставки
	Если Объект.ЕдинственныйВидЦенПродажи Тогда

		СтруктураЗаполненияЦены = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(ОписаниеОбъекта, Истина);
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);

	ИначеЕсли Объект.ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) 
		Или Не Объект.ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Партнер) И Объект.ИспользоватьПартнеровИКонтрагентов Тогда
		
		СтруктураЗаполненияУсловийПродажи = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(ОписаниеОбъекта);
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", СтруктураЗаполненияУсловийПродажи);
		
	ИначеЕсли Объект.РежимОтбораДляРозничныхПродаж Тогда

		СтруктураЗаполненияУсловийРозничнойПродажи = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийРозничныхПродажВСтрокеТЧ(ОписаниеОбъекта, Объект.ОбъектХраненияУсловийПродаж);
		СтруктураДействий.Вставить("ЗаполнитьУсловияРозничныхПродаж", СтруктураЗаполненияУсловийРозничнойПродажи);

	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены)
				Или ЦенообразованиеВызовСервера.НеобходимПересчетЦеныПриИзменении(ТекущаяСтрока.Номенклатура, "Серия", Неопределено) Тогда
		
		СтруктураЗаполненияЦены = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(ОписаниеОбъекта, Истина);
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);
	
	КонецЕсли;

КонецПроцедуры



