
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ФормаНазад.Видимость = Ложь;
	Элементы.ФормаГотово.Видимость = Ложь;
	Элементы.ФормаДалее.Доступность = Ложь;
	ДатаЗаполнения = ТекущаяДата();
	НомерВопроса = 0;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Если Не Параметры.Респондент.Пустая() Тогда
		Респондент = Параметры.Респондент;
	КонецЕсли;
	если Параметры.Свойство("ВзаимодействиеОснование") тогда
		ВзаимодействиеОснование=Параметры.ВзаимодействиеОснование;
	конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	Если Элементы.ПервыйЭтап.Видимость Тогда
		Элементы.ПервыйЭтап.Видимость = Ложь;
		Элементы.ВторойЭтап.Видимость = Истина;
		Элементы.ФормаНазад.Видимость = Истина;
		ВывестиВопрос(СписокВопросов[НомерВопроса].Значение);
	Иначе
		ДобавитьОтвет(СписокВопросов[НомерВопроса].Значение);
		НомерВопроса = НомерВопроса + 1;
		ВывестиВопрос(СписокВопросов[НомерВопроса].Значение);
	КонецЕсли;
	Если НомерВопроса = СписокВопросов.Количество() - 1 Тогда
		Элементы.ФормаДалее.Видимость = Ложь;
		Элементы.ФормаГотово.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если НомерВопроса = 0 Тогда
		Ответы.Очистить();
		Элементы.ФормаНазад.Видимость = Ложь;
		Элементы.ВторойЭтап.Видимость = Ложь;
		Элементы.ПервыйЭтап.Видимость = Истина;
	Иначе
		ДобавитьОтвет(СписокВопросов[НомерВопроса].Значение);
		НомерВопроса = НомерВопроса - 1;
		ВывестиВопрос(СписокВопросов[НомерВопроса].Значение);
		Если НомерВопроса = СписокВопросов.Количество() - 2 Тогда
			Элементы.ФормаГотово.Видимость = Ложь;
			Элементы.ФормаДалее.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьКнопок()
	Если Не Анкета.Пустая() И Не Респондент.Пустая() Тогда
		СписокСформирован = СформироватьСписокВопросов();
		Если СписокСформирован Тогда
			Элементы.ФормаДалее.Доступность = Истина;
		КонецЕсли;
	Иначе
		Элементы.ФормаДалее.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьСписокВопросов()
	//ВыборкаАнкет = РегистрыСведений.АнкетированиеОтветы.Выбрать(Новый Структура("Респондент", Респондент));
	//ЕстьАнкета = Ложь;
	//Пока ВыборкаАнкет.Следующий() Цикл
	//	Если ВыборкаАнкет.ШаблонАнкеты = Анкета Тогда
	//		ЕстьАнкета = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Если Не ЕстьАнкета Тогда
		Выборка = Справочники.ВопросыАнкетАльтерра.Выбрать(, Анкета);
		СписокВопросов.Очистить();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ЭтоГруппа Тогда
				НовыйВопрос = СписокВопросов.Добавить();
				НовыйВопрос.ПорядковыйНомер = Выборка.ПорядковыйНомер;
				НовыйВопрос.Значение = Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		СписокВопросов.Сортировать("ПорядковыйНомер");
		Возврат Истина;
	//Иначе
	//	Сообщить("Респондент уже участвовал в данном опросе");
	//	Возврат Ложь;
	//КонецЕсли;
КонецФункции

&НаКлиенте
Процедура РеспондентПриИзменении(Элемент)
	ДоступностьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура АнкетаПриИзменении(Элемент)
	ДоступностьКнопок();
КонецПроцедуры

&НаСервере
Процедура ВывестиВопрос(Вопрос)
	Элементы.ВариантыОтветов.Видимость = Ложь;
	Элементы.Ответ.Видимость = Ложь;
	Элементы.ТекстВопроса.Заголовок = Вопрос.Наименование;
	Массив = Ответы.НайтиСтроки(Новый Структура("Вопрос", Вопрос));
	Если Вопрос.Вопрос.НесколькоВариантовОтвета Тогда
		Элементы.ВариантыОтветов.Видимость = Истина;
		Выборка = Справочники.ВариантыОтветовНаВопрос.Выбрать(, Вопрос.Вопрос);
		ВариантыОтветов.Очистить();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ВариантыОтветов.Добавить();
			НоваяСтрока.Вариант = Выборка.Ссылка.Значение;
		КонецЦикла;
		Если Массив.Количество() > 0 Тогда
			Для Каждого Элемент Из Массив Цикл
				СтрокиОтветов = ВариантыОтветов.НайтиСтроки(Новый Структура("Вариант", Элемент.Ответ));
				Для Каждого Строка Из СтрокиОтветов Цикл
					Строка.Ответ = Истина;
				КонецЦикла;
			КонецЦикла;
			Пока Массив.Количество() <> 0 Цикл
				Ответы.Удалить(Массив[0]);
				Массив.Удалить(0);
			КонецЦикла;	
		КонецЕсли;
	Иначе
		Ответ = Неопределено;
		Элементы.Ответ.Видимость = Истина;
		Если Массив.Количество() > 0 Тогда
			Ответ = Массив[0].Ответ;
			Пока Массив.Количество() <> 0 Цикл
				Ответы.Удалить(Массив[0]);
				Массив.Удалить(0);
			КонецЦикла;
		Иначе
			Элементы.Ответ.ОграничениеТипа = Вопрос.Вопрос.ТипЗначения;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтвет(Вопрос)
	Если Вопрос.Вопрос.НесколькоВариантовОтвета Тогда
		НомерВарианта = 1;
		Для Каждого Строка Из ВариантыОтветов Цикл
			Если Строка.Ответ Тогда
				НоваяСтрока = Ответы.Добавить();
				НоваяСтрока.Респондент = Респондент;
				НоваяСтрока.ШаблонАнкеты = Анкета;
				НоваяСтрока.Вопрос = Вопрос;
				НоваяСтрока.НомерВарианта = НомерВарианта;
				НоваяСтрока.Ответ = Строка.Вариант;
				НомерВарианта = НомерВарианта + 1;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НоваяСтрока = Ответы.Добавить();
		НоваяСтрока.Респондент = Респондент;
		НоваяСтрока.ШаблонАнкеты = Анкета;
		НоваяСтрока.Вопрос = Вопрос;
		НоваяСтрока.НомерВарианта = 0;
		НоваяСтрока.Ответ = Ответ; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГотовоНаСервере()
	Если Ответы.Количество() > 0 Тогда
		НаборЗаписей = РегистрыСведений.АнкетированиеОтветы.СоздатьНаборЗаписей();
		НаборЗаписей.Записывать = Истина;
		Для Каждого Строка Из Ответы Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Респондент = Строка.Респондент;
			НоваяЗапись.ШаблонАнкеты = Строка.ШаблонАнкеты;
			НоваяЗапись.Вопрос = Строка.Вопрос;
			НоваяЗапись.НомерВарианта = Строка.НомерВарианта;
			НоваяЗапись.Ответ = Строка.Ответ;
			НоваяЗапись.Дата = ДатаЗаполнения;
			НоваяЗапись.ДатаЗаполнения = ДатаЗаполнения;
			НоваяЗапись.Ответственный = Ответственный;
			НоваяЗапись.ВзаимодействиеОснование = ВзаимодействиеОснование;

		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ДобавитьОтвет(СписокВопросов[НомерВопроса].Значение);
	ГотовоНаСервере();
	Закрыть();
КонецПроцедуры