
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
	
	ДействияСтрока = НСтр("ru = 'Все'");
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.КОбеспечению,
		Перечисления.ВариантыОбеспечения.КОбеспечению, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления,
		Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить,
		Перечисления.ВариантыОбеспечения.Отгрузить, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.СоСклада,
		Перечисления.ВариантыОбеспечения.СоСклада, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.НеТребуется,
		Перечисления.ВариантыОбеспечения.НеТребуется, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.ПереданРанее,
		Перечисления.ВариантыОбеспечения.ПереданРанее, Истина);
	ВосстановитьНастройки();
	#Вставка
	Имя = Параметры.ИмяМенеджераДокумента;
    Если (Имя = "ЗаказПоставщику" или Имя = "ЗаказНаПеремещение") и ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
        ВсеИзДокументаНеОбеспечено = 1;    
    КонецЕсли;
	#КонецВставки
	
	ЗаполнитьТоварыПоЗначениюПереключателяВсеИзДокументаНеОбеспечено();
КонецПроцедуры
