#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОткрытИзДокумента= Ложь;
	Если Параметры.Свойство("ОткрытИзДокумента") Тогда
		ОткрытИзДокумента= Параметры.ОткрытИзДокумента;
	КонецЕсли;
	
	Если ОткрытИзДокумента Тогда
		Партнер= Параметры.Партнер;
		Филиал= Параметры.Филиал;
		ВидДоставки= Параметры.ВидДоставки;
		Элементы.Тариф.Видимость = НЕ Параметры.ВидДоставки = ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная");
		Тариф= Параметры.Тариф;
		Адрес= Параметры.Адрес;
		Широта = Параметры.Широта;
		Долгота = Параметры.Долгота;
		ТарифВРучную=  Параметры.ТарифВРучную;  
		БезСтоимостиФилиалов = Ложь;
		Если Параметры.Свойство("БезСтоимостиФилиалов") Тогда  
			БезСтоимостиФилиалов = Параметры.БезСтоимостиФилиалов;	
		КонецЕсли;	

		Если ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
			ВариантДоставки= "ОРК";
			НДС= "СНДС";
			ВидСтоимости= "СтоимостьДляВодителя";
		ИначеЕсли ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Внутренняя Тогда	
			ВариантДоставки= "Внутренняя";
			НДС= "СНДС";
			ВидСтоимости= "СтоимостьДляКлиента";
		Иначе   
			ВариантДоставки= "Розница";
			Если  ВидДоставки = Перечисления.ВидыДоставокДоКлиента.ДистрибуцияСборныеГрузы Тогда 	
				НДС = "СНДС"; 
				БезСтоимостиФилиалов = Истина;  
				ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная;
				
				Если РольДоступна("ПолныеПрава") Или РольДоступна("ОтделЛогистики") Тогда
					Элементы.ГруппаРазгрузки.Видимость = Истина;
				Иначе 
					Элементы.ГруппаРазгрузки.Видимость = Ложь;
				КонецЕсли;			
			Иначе
				НДС= "БезНДС"; 
			КонецЕсли;
			ВидСтоимости= "СтоимостьДляКлиента";  
		КонецЕсли;
		
		ПараметрыРазгрузкиАдресВХранилище = Параметры.ПараметрыРазгрузкиАдресВХранилище;
		ПараметрыРазгрузки = ПолучитьИзВременногоХранилища(ПараметрыРазгрузкиАдресВХранилище);
		
		Если ТипЗнч(ПараметрыРазгрузки) = Тип("Структура") Тогда 
			Этаж = ПараметрыРазгрузки.Этаж;
			НомерКвартиры = ПараметрыРазгрузки.НомерКвартиры;
			ВариантРазгрузки = ПараметрыРазгрузки.ВариантРазгрузки;
		КонецЕсли;
		
	Иначе
		Подразделение= Пользователи.ТекущийПользователь().Подразделение;
		Если ЗначениеЗаполнено(Подразделение.Родитель) Тогда
			Филиал= Подразделение.Родитель;
		Иначе
			Филиал= Подразделение;
		КонецЕсли;
		
		ВариантДоставки= "Розница";
		НДС= "БезНДС";
		ВидСтоимости= "СтоимостьДляКлиента";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
		ТарифВРучную= Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Тариф) Тогда
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Если ЗначениеЗаполнено(Партнер) Тогда
			Адрес= АльтерраОбщегоНазначения.ПолучитьКонтактнуюИнформацию(Партнер, Справочники.ВидыКонтактнойИнформации.АдресПартнера);
		КонецЕсли
	КонецЕсли;

	//детали адреса
	Если ЗначениеЗаполнено(Адрес) Тогда
		НомерДома = Параметры.НомерДома;
		НомерКвартиры = Параметры.НомерКвартиры;
		ЧастныйДом = Параметры.ЭтоЧастныйДом;
		НомерКорпуса = Параметры.НомерКорпуса;
		НомерОфиса = Параметры.НомерОфиса;
		ДополнениеКАдресу = Параметры.ДополнениеКАдресу;
		
		НомерДомаКарта = ПолучитьДомИзАдреса();
		УстановитьДоступностьДома();
	КонецЕсли;

	Элементы.ФормаПередатьВДокумент.Видимость= ОткрытИзДокумента;
	Элементы.Тариф.ТолькоПросмотр= Не ТарифВРучную;
	
	Элементы.ГруппаРазгрузки.Доступность = РасчетРазгрузкиДействует(ТекущаяДата());
	
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	ИнициализироватьКарту();
	ОчиститьПараметрыРазгрузки();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ТарифНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ВариантДоставки = "Выписка/АктивДо1т" Тогда
		СтандартнаяОбработка= Ложь;

		ЗаполнитьданныеВыбора(ДанныеВыбора);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	ИнициализироватьКарту();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьданныеВыбора(ДанныеВыбора)
	Тариф1= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
	ДанныеВыбора= Новый СписокЗначений;
	ДанныеВыбора.Добавить(Тариф);
КонецПроцедуры

&НаКлиенте
Процедура ВариантДоставкиПриИзменении(Элемент)
	ВариантДоставкиПриИзмененииНаСервере();
КонецПроцедуры
&НаСервере
Процедура ВариантДоставкиПриИзмененииНаСервере()
	Если ВариантДоставки = "Розница" Тогда
		ВидСтоимости= "СтоимостьДляКлиента";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "БезНДС";
	ИначеЕсли ВариантДоставки = "ОРК" Тогда
		ВидСтоимости= "СтоимостьДляВодителя";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "СНДС";
	ИначеЕсли ВариантДоставки = "Внутренняя" Тогда
		ВидСтоимости= "СтоимостьДляВодителя";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Внутренняя;
		НДС= "СНДС";
	ИначеЕсли ВариантДоставки = "Выписка/Актив" Тогда
		ВидСтоимости= "СтоимостьДляВодителя";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "БезНДС";
	ИначеЕсли ВариантДоставки = "Выписка/АктивДо1т" Тогда 
		ВидСтоимости= "СтоимостьДляКлиента";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "БезНДС";
	Иначе
		ВидСтоимости= "СтоимостьДляКлиента";
		ВидДоставки= Перечисления.ВидыДоставокДоКлиента.Розничная;
		НДС= "БезНДС";
	КонецЕсли;
	
	ИнициализироватьКарту();
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ИнициализироватьКарту();
	ОчиститьПараметрыРазгрузки();
КонецПроцедуры

&НаКлиенте
Процедура ЧастныйДомПриИзменении(Элемент)
	НомерКвартиры = 0;
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура НомерДомаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура НомерКвартирыПриИзменении(Элемент)
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриИзмененииСтрокиАдреса()
	
	НомерДома = ПолучитьДомИзАдреса();
	НомерДомаКарта = НомерДома;
	
	УстановитьВидимостьДоступность();
	Если ЧастныйДом Тогда
		НомерКвартиры = "";
	КонецЕсли;
	Если НомерДома="" Тогда
		НомерКвартиры="";
	КонецЕсли;
	ОчиститьПараметрыРазгрузки();
	
КонецПроцедуры  

Функция ПолучитьДомИзАдреса()
	
	МассивАдреса = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ",", ,Истина);
	
	КоличествоПунктов = МассивАдреса.Количество(); 
	Если КоличествоПунктов > 0 Тогда 
		ПоследнийЭлемент = МассивАдреса[КоличествоПунктов-1];
		
		Если СтрДлина(ПоследнийЭлемент) <=7 Тогда			
			НайденныйДом = ПоследнийЭлемент;			
		Иначе
			НайденныйДом = "";
		КонецЕсли;  
	КонецЕсли;    
	
	Возврат НайденныйДом
	
КонецФункции	


#Область ИнициализацияКарты
&НаСервере
Процедура ИнициализироватьКарту()
	
	//Адрес, ВидДоставки, ВариантДоставки, Филиал, Тариф, НДС
	Парам= Обработки.КартографическийИнтерфейсДоставка.ПолучитьСтруктуруПараметров();
	Парам.Вставить("Адрес", Адрес);
	Парам.Вставить("Широта", Широта);
	Парам.Вставить("Долгота", Долгота);
	Парам.Вставить("ВидДоставки", ВидДоставки);
	Парам.Вставить("ВариантДоставки", ВариантДоставки);
	Парам.Вставить("Филиал", Филиал);
	Парам.Вставить("Тариф", Тариф);
	Парам.Вставить("НДС", НДС);
	Парам.Вставить("ВидСтоимости", ВидСтоимости); 
	Парам.Вставить("БезСтоимостиФилиалов", БезСтоимостиФилиалов);

	Обработки.КартографическийИнтерфейсДоставка.ИнициализироватьКарту(КартаЯндекс, Парам);
	
	Координаты = СтрЗаменить(""+Широта,",",".") + "," + СтрЗаменить(""+Долгота,",",".");
	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.Тариф.ТолькоПросмотр= Ложь;
	
	Если ВариантДоставки = "Выписка/АктивДо1т" Тогда
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоКоду("000000003");//До 1,5 тонн до 6м
		Элементы.Тариф.ТолькоПросмотр= Истина;
	КонецЕсли;
	Элементы.Тариф.ТолькоПросмотр= Не ТарифВРучную;

	Элементы.НомерКвартиры.Доступность = Не ЧастныйДом;
	Элементы.НомерКвартиры.АвтоОтметкаНезаполненного = Не ЧастныйДом;
	
	УстановитьДоступностьДома();
	
КонецПроцедуры  

Процедура УстановитьДоступностьДома()
	
	Элементы.ГруппаАдрес.Видимость = Адрес <> "";
	ДомНеНайден = НомерДомаКарта = "";
	ДомаНетНаКарте = ДомНеНайден И НомерДома <> "";
	Элементы.ДомаНетНаКарте.Видимость = ДомНеНайден;  
	Элементы.НомерДома.Доступность = ДомНеНайден;            
	Элементы.ГруппаДомКвартира.Видимость = ДомаНетНаКарте Или НомерДома <> "";	
	Элементы.ДомаНетНаКарте.ЦветТекстаЗаголовка = ?(ДомаНетНаКарте, WebЦвета.Красный, WebЦвета.Черный);
	
КонецПроцедуры	

&НаКлиенте
Процедура ДомаНетНаКартеПриИзменении(Элемент)        
	
	Элементы.ГруппаДомКвартира.Видимость = ДомаНетНаКарте;	
	Элементы.ДомаНетНаКарте.ЦветТекстаЗаголовка = ?(ДомаНетНаКарте, WebЦвета.Красный, WebЦвета.Черный);
	
КонецПроцедуры

#Область СобытияКарты
 &НаКлиенте
Процедура КартаЯндексПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Событие = ДанныеСобытия.Event;
	Если Событие.eventData1C <> Неопределено Тогда
		
			ОбновитьДанныеСтрокиАдреса = СтрНайти(Адрес, "дом ") = 0;  
			
			ПредыдущаяШирота = Широта;
    		ПредыдущаяДолгота = Долгота;  
			ПредыдущийАдрес = Адрес;
			ОбработатьСобытиеИзСкрипта(Событие); 
			Если Широта <> ПредыдущаяШирота И Долгота <> ПредыдущаяДолгота Тогда
				
				Если ОбновитьДанныеСтрокиАдреса Тогда
					ПриИзмененииСтрокиАдреса();
				Иначе
					УстановитьВидимостьДоступность();
				КонецЕсли;  
			Иначе  
				Если ПредыдущийАдрес <> "" И Адрес <> ПредыдущийАдрес Тогда
					Адрес = ПредыдущийАдрес;       
				КонецЕсли;    
				
				Если ПредыдущийАдрес = "" И Адрес <> "" Тогда
					ПриИзмененииСтрокиАдреса();
				КонецЕсли;
			КонецЕсли;    
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция  ОбработатьСобытиеИзСкрипта(Событие)
    
	evt = Событие.eventData1C.event;
    params = Событие.eventData1C.params;
    
	Если evt = "showMessage" Тогда
		Сообщить(params);
        
    ИначеЕсли evt = "addPlacemark" Тогда
        Адрес = params.address;
    	Широта = params.lat;
    	Долгота = params.lon;
        Координаты = "" + Широта + "," + Долгота;
        
    ИначеЕсли evt = "jsError" Тогда
        
        НомерСтроки = params.line + 1;
        ТекстОшибки = params.message;
        
        _КЯ = КартаЯндекс;
        _КЯ = СтрЗаменить(_КЯ, "&", "&amp;");
        _КЯ = СтрЗаменить(_КЯ, """", "&quot;");
        _КЯ = СтрЗаменить(_КЯ, "<", "&lt;");
        _КЯ = СтрЗаменить(_КЯ, ">", "&gt;");

        Строки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(_КЯ, Символы.ПС, , );
        ТекстHTML = "";
        Для н = 0 По Строки.Количество()-1 Цикл
            ТекстHTML = ТекстHTML + "<li" + ?(н = НомерСтроки," id='err'","") + ">" + Строки[н] + "</li>";
        КонецЦикла;
        
        ТекстHTML = "<!DOCTYPE html>
        |<html>
        |<head>
        |<meta charset='utf-8'>
        |<style>
        |  body {font-family: Arial,Helvetica,sans-serif; font-size:12px;}
        |  #err { background: red; }
        |</style>
        |<script>
        |  const err_line = {{err_line}};
        |  function setFocusToId(id){
        |    const el = document.getElementById(id);
        |    el.focus();
        |    el.scrollIntoView();
        |  }     
        |</script>
        |</head>
        |<body>
        |<ol>" + ТекстHTML + "</ol>
        |<script>
        |setTimeout(()=>{setFocusToId('err')},5);
        |</script>
        |</body>
        |</html>";
        
        ТекстHTML = СтрЗаменить( ТекстHTML, "{{err_line}}", НомерСтроки);
        ОтладкаHTML = ТекстHTML;

        Элементы.СтраницаОшибка.Видимость = Истина;
    КонецЕсли;                                                 
    
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ПередатьВДокумент(Команда)
	
	Если ИзмененыПараметрыРазгрузки Тогда
		Сообщить("Изменены параметры доставки, которые влияют на стоимость услуги разгрузки, необходимо перезаполнить параметры разгрузки!");
		Возврат;
	КонецЕсли;
	
	КартаДокумент = Элементы.КартаЯндекс.Документ;
	ПеременныеКарты = КартаДокумент.defaultView.mapData;
	
	ДанныеКарты = Новый Структура;
	ДанныеКарты.Вставить("Тариф", Тариф);
	
	ДанныеКарты.Вставить("ВидДоставки", ВидДоставки);
	ДанныеКарты.Вставить("РасчетПоРасстоянию", ПеременныеКарты.distanceCalc);
	ДанныеКарты.Вставить("СтоимостьПоРасстоянию", ПеременныеКарты.distanseCost);
	ДанныеКарты.Вставить("НДС", НДС);
	ДанныеКарты.Вставить("СтоимостьДоставки", ПеременныеКарты.price); 
	ДанныеКарты.Вставить("Зона", ПеременныеКарты.zone);
		
    ДанныеКарты.Вставить("Адрес", Адрес);	
	ДанныеКарты.Вставить("Широта", Широта);
	ДанныеКарты.Вставить("Долгота", Долгота);

	ДанныеКарты.Вставить("ТарифВРучную", ТарифВРучную);
	
	//Разгрузка
	ДанныеКарты.Вставить("Этаж", Этаж);
	ДанныеКарты.Вставить("ВариантРазгрузки", ВариантРазгрузки);
	ДанныеКарты.Вставить("СтоимостьРазгрузкиДляКлиента", СтоимостьРазгрузкиДляКлиента);
	ДанныеКарты.Вставить("СтоимостьРазгрузкиДляВодителя", СтоимостьРазгрузкиДляВодителя);
	ДанныеКарты.Вставить("НаличиеПандуса", НаличиеПандуса);   
	ДанныеКарты.Вставить("РучнаяКорректировкаВариантовРазгрузки", РучнаяКорректировкаВариантовРазгрузки);
	ДанныеКарты.Вставить("ВариантыРазгрузкиВРучнуюАдресВХранилище", ВариантыРазгрузкиВРучнуюАдресВХранилище);
	
	Если Этаж > 0 И ЗначениеЗаполнено(ВариантРазгрузки) Тогда
		ДанныеКарты.Вставить("ДоставкаСРазгрузкой", Истина);
	Иначе
		ДанныеКарты.Вставить("ДоставкаСРазгрузкой", Ложь);
	КонецЕсли;

	//детали адреса
	ДетальныеДанныеАдресаЗаполнены = (НомерДома <> "") И ?(ЧастныйДом, Истина, ЗначениеЗаполнено(НомерКвартиры) ИЛИ ЗначениеЗаполнено(НомерОфиса));
	Если Не ДетальныеДанныеАдресаЗаполнены Тогда
		Предупреждение("Не заполнены обязательные поля адреса!");
		Возврат;
	Иначе
		ДанныеКарты.Вставить("НомерДома", НомерДома);
		ДанныеКарты.Вставить("НомерКвартиры", НомерКвартиры);
		ДанныеКарты.Вставить("ЭтоЧастныйДом", ЧастныйДом);
		ДанныеКарты.Вставить("НомерКорпуса", НомерКорпуса);
		ДанныеКарты.Вставить("НомерОфиса", НомерОфиса);
		ДанныеКарты.Вставить("ДополнениеКАдресу", ДополнениеКАдресу); 
		ДанныеКарты.Вставить("ДомаНетНаКарте", ДомаНетНаКарте);
	КонецЕсли;
	
	Закрыть(ДанныеКарты);

КонецПроцедуры

&НаКлиенте
Процедура ВРучнуюПриИзменении(Элемент)
	Элементы.Тариф.ТолькоПросмотр= Не ТарифВРучную;
КонецПроцедуры

&НаКлиенте
Процедура КартаЯндексДокументСформирован(Элемент)
    
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРазгрузки(Команда)
	
	КартаДокумент = Элементы.КартаЯндекс.Документ;	
	ПеременныеКарты = КартаДокумент.defaultView.mapData;
	ЗаполнитьПараметрыРазгрузки(ПеременныеКарты.zone);	
	
	ОткрытьФорму("Обработка.КартографическийИнтерфейсДоставка.Форма.НастройкаПараметровРазгрузки", Новый Структура("ПараметрыРазгрузкиАдресВХранилище", ПараметрыРазгрузкиАдресВХранилище), ЭтаФорма, Истина,,, Новый ОписаниеОповещения("ЗакрытиеФормыНастройкиПараметровЗагрузки", ЭтотОбъект));
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыРазгрузки(Зона)
	
	ЗонаДоставки = Обработки.КартографическийИнтерфейсДоставка.ПолучитьЗонуДоставкиПоНаименованию(Зона);

	Если ЗначениеЗаполнено(ПараметрыРазгрузкиАдресВХранилище) Тогда
		ПараметрыРазгрузки = ПолучитьИзВременногоХранилища(ПараметрыРазгрузкиАдресВХранилище);
	Иначе
		ПараметрыРазгрузки = УправлениеЛогистикойСервер.ПолучитьСтруктуруПараметровРазгрузки();
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗонаДоставки) Тогда
		ПараметрыРазгрузки.Зона = УправлениеЛогистикойСервер.ПолучитьГлобальнуюЗону(ЗонаДоставки,Филиал);
	КонецЕсли;

	Если НДС = "СНДС" Тогда
		 ПараметрыРазгрузки.СНДС = Истина;
	 Иначе
		 ПараметрыРазгрузки.СНДС = Ложь;
	КонецЕсли;

	Если НомерКвартиры > 0 Тогда
		ПараметрыРазгрузки.НомерКвартиры = НомерКвартиры;
	КонецЕсли;       

	ПараметрыРазгрузки.Вставить("ЧастныйДом", ЧастныйДом);  

	Если ЗначениеЗаполнено(ПараметрыРазгрузкиАдресВХранилище) Тогда
		ПараметрыРазгрузкиАдресВХранилище = ПоместитьВоВременноеХранилище(ПараметрыРазгрузки,ПараметрыРазгрузкиАдресВХранилище);
	Иначе
		ПараметрыРазгрузкиАдресВХранилище = ПоместитьВоВременноеХранилище(ПараметрыРазгрузки,ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;

	ИзмененыПараметрыРазгрузки = Ложь;

КонецПроцедуры

Процедура ОчиститьПараметрыРазгрузки()
	
	Если Этаж > 0 Тогда
	Этаж = 0;
	НомерКвартиры = 0;
	ВариантРазгрузки = "";
	ИзмененыПараметрыРазгрузки = Истина;
	Сообщить("Изменены параметры доставки, которые влияют на стоимость услуги разгрузки, необходимо перезаполнить параметры разгрузки!");
конецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыНастройкиПараметровЗагрузки(Результат,Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчетРазгрузкиДействует(ДатаДокумента)
	Возврат УправлениеЛогистикойСервер.РасчетРазгрузкиДействуетНаДату(ДатаДокумента);
КонецФункции

&НаКлиенте
Процедура СохранитьОбъектДоставки(Команда)
	ФормаСправочника = ПолучитьФорму("Справочник.ОбъектыДоставки.Форма.ФормаЭлемента");
	ФормаСправочника.Объект.Владелец = Партнер;  
	ФормаСправочника.Объект.Адрес = Адрес;
	ФормаСправочника.Объект.Широта = Широта;
	ФормаСправочника.Объект.Долгота = Долгота; 
	ФормаСправочника.Объект.ЗонаДоставкиДляВодителя = ПолучитьЗонуДоставки(Элементы.КартаЯндекс.Документ.defaultView.mapData.zone);
    ФормаСправочника.Открыть();
КонецПроцедуры  

&НаСервере
Функция ПолучитьЗонуДоставки(Зона)
	Возврат Справочники.ЗоныДоставкиДоКлиента.НайтиПоНаименованию(Зона);
КонецФункции


#КонецОбласти
