
&ИзменениеИКонтроль("ОтправитьПисьма")
Функция Док_ОтправитьПисьма(УчетнаяЗаписьИлиСоединение, Письма, ТекстИсключения = Неопределено) Экспорт
	Перем УчетнаяЗапись, Соединение;
	
	Если ТипЗнч(УчетнаяЗаписьИлиСоединение) = Тип("ИнтернетПочта") Тогда
		Соединение = УчетнаяЗаписьИлиСоединение;
	Иначе
		УчетнаяЗапись = УчетнаяЗаписьИлиСоединение;
	КонецЕсли;
	
	Если УчетнаяЗапись <> Неопределено Тогда
	РеквизитыОтправителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, 
			"ИмяПользователя,АдресЭлектроннойПочты,ОтправлятьСкрытыеКопииПисемНаЭтотАдрес,ИспользоватьДляПолучения");
				
		УстановитьОтключениеБезопасногоРежима(Истина);
		Профиль = ИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		
		ПротоколПолученияПочты = ПротоколИнтернетПочты.POP3;
		Если ИспользоватьIMAPПриОтправкеПисем(Профиль) Тогда
			ПротоколПолученияПочты = ПротоколИнтернетПочты.IMAP;
		КонецЕсли;
		
		ТекстОшибки = "";
		Попытка
			Соединение = ПодключениеКПочте(УчетнаяЗапись);
			Если ПротоколПолученияПочты = ПротоколИнтернетПочты.IMAP Тогда
				ОпределитьПапкуОтправленные(Соединение);
			КонецЕсли;
		Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если Не РаботаСПочтовымиСообщениямиСлужебныйКлиентСервер.ЭтоОшибкаРаботыИнтернетПочты(ИнформацияОбОшибке)
				Или ПротоколПолученияПочты <> ПротоколИнтернетПочты.IMAP Или РеквизитыОтправителя.ИспользоватьДляПолучения Тогда
				ВызватьИсключение;
			КонецЕсли;
			
			ТекстОшибки = РасширенноеПредставлениеОшибки(ИнформацияОбОшибке, ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось подключиться к серверу IMAP:
				|%1'", ОбщегоНазначения.КодОсновногоЯзыка()), ТекстОшибки);
			
		ЗаписьЖурналаРегистрации(ИмяСобытияОтправкаПочты(), УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты, УчетнаяЗапись, ТекстОшибки);
			
			ПротоколПолученияПочты = ПротоколИнтернетПочты.POP3;
			Соединение = Новый ИнтернетПочта;
			ПодключитьсяКИнтернетПочте(Соединение, Профиль, ПротоколПолученияПочты);
			
		КонецПопытки;
	КонецЕсли;
	
	РезультатыОтправкиПисем = Новый Соответствие;
	ОбрабатыватьТексты = ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать;
	
	Попытка
		Для Каждого Письмо Из Письма Цикл
			Письмо.ИмяОтправителя = РеквизитыОтправителя.ИмяПользователя;
			Письмо.Отправитель.ОтображаемоеИмя = РеквизитыОтправителя.ИмяПользователя;
			Письмо.Отправитель.Адрес = РеквизитыОтправителя.АдресЭлектроннойПочты;
			
			Если РеквизитыОтправителя.ОтправлятьСкрытыеКопииПисемНаЭтотАдрес Тогда
				Получатель = Письмо.СлепыеКопии.Добавить(РеквизитыОтправителя.АдресЭлектроннойПочты);
				Получатель.ОтображаемоеИмя = РеквизитыОтправителя.ИмяПользователя;
			КонецЕсли; 
	#Вставка
			ПисьмоСОшибкой = Ложь;
	#КонецВставки		
	
			РезультатОтправкиПисьма = Новый Структура;
			РезультатОтправкиПисьма.Вставить("ОшибочныеПолучатели", Новый Соответствие);
			РезультатОтправкиПисьма.Вставить("ИдентификаторПисьмаSMTP", "");
			РезультатОтправкиПисьма.Вставить("ИдентификаторПисьмаIMAP", "");
			
			КодироватьАдресаВПисьме(Письмо);
			
			Если ПротоколПолученияПочты = ПротоколИнтернетПочты.IMAP Тогда

				Попытка
					Соединение.Послать(Письмо, ОбрабатыватьТексты, ПротоколИнтернетПочты.IMAP);
				Исключение
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					УточнениеИсключения = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(ИнформацияОбОшибке);
					КодОшибки = РаботаСПочтовымиСообщениямиСлужебныйКлиентСервер.КодОшибкиРаботыИнтернетПочты();
					
					ВызватьИсключение(
						УточнениеИсключения.Текст, УточнениеИсключения.Категория, КодОшибки, , ИнформацияОбОшибке);
				КонецПопытки;

				РезультатОтправкиПисьма.Вставить("ИдентификаторПисьмаIMAP", Письмо.ИдентификаторСообщения);
				
				ФлагиПисьма = Новый ФлагиИнтернетПочтовогоСообщения;
				ФлагиПисьма.Прочитанное = Истина;
				ФлагиПисем = Новый Соответствие;
				ФлагиПисем.Вставить(Письмо.ИдентификаторСообщения, ФлагиПисьма);
				Соединение.УстановитьФлагиСообщений(ФлагиПисем);

			КонецЕсли;
			
			ОшибочныеПолучатели = Новый Соответствие;
			Попытка
				ОшибочныеПолучатели = Соединение.Послать(Письмо, ОбрабатыватьТексты, ПротоколИнтернетПочты.SMTP);
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
				Если ПолучательПисьмаОтклоненСервером(ТекстОшибки) Тогда
					Для Каждого Получатель Из Письмо.Получатели Цикл
						ОшибочныеПолучатели.Вставить(Получатель.Адрес, ТекстОшибки);
					КонецЦикла;
				Иначе
				#Удаление			

					УточнениеИсключения = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(ИнформацияОбОшибке);
					КодОшибки = РаботаСПочтовымиСообщениямиСлужебныйКлиентСервер.КодОшибкиРаботыИнтернетПочты();
					
					ВызватьИсключение(
						УточнениеИсключения.Текст, УточнениеИсключения.Категория, КодОшибки, , ИнформацияОбОшибке);

				#КонецУдаления
				#Вставка 
					ПисьмоСОшибкой = Истина;
					Соединение.Подключиться(Профиль, ПротоколПолученияПочты);
				#КонецВставки		
				КонецЕсли;
			КонецПопытки;
			
			РезультатОтправкиПисьма.ОшибочныеПолучатели = ОшибочныеПолучатели; 
			#Вставка 
			Если НЕ ПисьмоСОшибкой Тогда	
			#КонецВставки
			РезультатОтправкиПисьма.ИдентификаторПисьмаSMTP = Письмо.ИдентификаторСообщения; 
			#Вставка 
			КонецЕсли;	
			#КонецВставки
			
			Если ОшибочныеПолучатели.Количество() > 0 Тогда
				ТекстыОшибок = Новый Массив;
				Для Каждого ОшибочныйПолучатель Из ОшибочныеПолучатели Цикл
					Получатель = ОшибочныйПолучатель.Ключ;
					ТекстОшибки = ОшибочныйПолучатель.Значение;
					ТекстыОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1: %2'"), Получатель, ТекстОшибки));
				КонецЦикла;
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Отправка письма следующим получателям не выполнена:
					|%1'", 
					ОбщегоНазначения.КодОсновногоЯзыка()), СтрСоединить(ТекстыОшибок, Символы.ПС));
				ЗаписьЖурналаРегистрации(ИмяСобытияОтправкаПочты(), УровеньЖурналаРегистрации.Ошибка, , 
					УчетнаяЗапись, ТекстОшибки);
			КонецЕсли;
			
			РезультатыОтправкиПисем.Вставить(Письмо, РезультатОтправкиПисьма);
		КонецЦикла;
	Исключение
	    ИнформацияОбОшибке = ИнформацияОбОшибке();
		Если УчетнаяЗапись <> Неопределено Тогда
			Попытка
				Соединение.Отключиться();
			Исключение // АПК:280
				// Обработка и журналирование исключения не требуется, т.к. 
				// в вызывающий код передается исходное исключение, которое будет там обработано.
			КонецПопытки;
		КонецЕсли;
		
		ТекстИсключения = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Если Не РаботаСПочтовымиСообщениямиСлужебныйКлиентСервер.ЭтоОшибкаРаботыИнтернетПочты(ИнформацияОбОшибке)
			Или РезультатыОтправкиПисем.Количество() = 0 Тогда
			ВызватьИсключение;
		КонецЕсли;
		
		ТекстОшибки = РасширенноеПредставлениеОшибки(ИнформацияОбОшибке, ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытияОтправкаПочты(), УровеньЖурналаРегистрации.Ошибка, , УчетнаяЗапись, ТекстОшибки);
		Возврат РезультатыОтправкиПисем;
	КонецПопытки;
	
	Если УчетнаяЗапись <> Неопределено Тогда
		Соединение.Отключиться();
	КонецЕсли;
	УстановитьОтключениеБезопасногоРежима(Ложь);
	
	Возврат РезультатыОтправкиПисем;
	
КонецФункции
