
Перем ДанныеДоЗаписи;

&НаСервере
&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	ДанныеДоЗаписи = Ссылка.Компетенции.Выгрузить().ВыгрузитьКолонку("Компетенция");
КонецПроцедуры

&НаСервере
&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ)
	Изменилось = Ложь;
	ДанныеПослеЗаписи = Компетенции.Выгрузить().ВыгрузитьКолонку("Компетенция");
	          
	Если ДанныеДоЗаписи.Количество() <> ДанныеПослеЗаписи.Количество() Тогда
		Изменилось = Истина;
	Иначе
		Для НомерСтроки = 0 По Компетенции.Количество() - 1 Цикл
			Если ДанныеДоЗаписи[НомерСтроки] <> ДанныеПослеЗаписи[НомерСтроки] Тогда
				Изменилось = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	Если Изменилось Тогда
		Сообщить("Изменился состав или порядок строк шаблона. Необходимо обновить документы.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументы() Экспорт 
	Отбор = Новый Структура;
	Отбор.Вставить("ШаблонОцениванияСотрудника", Ссылка);
	Выборка = Документы.ОценкаСотрудника.Выбрать(,,Отбор,);
	Пока Выборка.Следующий() Цикл
		докОбъект = Выборка.ПолучитьОбъект();
		тзОценки = докОбъект.ОценкиКомпетенций.Выгрузить();
		сОценки = Новый Соответствие;
		Для Каждого Строка Из тзОценки Цикл
			сОценки.Вставить(Строка.Компетенция, Строка.Значение);
		КонецЦикла;
		докОбъект.ОценкиКомпетенций.Очистить();
		докОбъект.ОценкиКомпетенций.Загрузить(докОбъект.ШаблонОцениванияСотрудника.Компетенции.Выгрузить());
		Для Каждого Строка Из докОбъект.ОценкиКомпетенций Цикл
			Строка.Значение = сОценки.Получить(Строка.Компетенция);
		КонецЦикла;
		докОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
