&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Если Параметры.Свойство("Отбор") Тогда
			Попытка
				УсловияОтбора = Параметры.Отбор.Номенклатура;
			Исключение
				УсловияОтбора = Список.Отбор.Элементы[0].ПравоеЗначение;
			КонецПопытки;
			ВывестиТекущуюКлассификацию();
		КонецЕсли;
		
	Иначе 
		ЭтаФорма.Элементы.ТекущаяКлассификация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


Функция ВывестиТекущуюКлассификацию()
	
	ТабДок.Очистить();
	Макет = РегистрыСведений.Неликвиды.ПолучитьМакет("ТекущаяЛиквидность");
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Строка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НеликвидыСрезПоследних.Подразделение КАК Подразделение,
	|	НеликвидыСрезПоследних.Подразделение.Код КАК ПодразделениеКод,
	|	НеликвидыСрезПоследних.Ликвидность КАК Ликвидность,
	|	НеликвидыСрезПоследних.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.Неликвиды.СрезПоследних(, Номенклатура = &Номенклатура) КАК НеликвидыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеКод";
	
	Запрос.УстановитьПараметр("Номенклатура", УсловияОтбора);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ГруппаСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ТекущаяКлассификация Тогда
		ВывестиТекущуюКлассификацию();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСоздания", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.Неликвиды.ФормаЗаписи", Новый Структура("Номенклатура", Неопределено), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
КонецПроцедуры

&НаКлиенте
Процедура ПослеСоздания(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КОнецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСоздания", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.Неликвиды.ФормаЗаписи", Новый Структура("ЗначениеЗаполнения", Элементы.Список.ТекущиеДанные), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры


