
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
   Если Не Параметры.ЗначениеКопирования.Перевозчик = Справочники.Партнеры.ПустаяСсылка() И Не РольДоступна ("ПолныеПрава") Тогда
       Отказ = Истина; 
       ВызватьИсключение("Запрещено создавать элементы копированием.");
   Иначе
	Если Запись.Ответственный = Справочники.Пользователи.ПустаяСсылка()                                
		ИЛИ (Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь И День(Запись.Период) = День(ТекущаяДата()))
		ИЛИ РегистрыСведений.ДоговорыПеревозчиков.ЕстьПравоИзмененияРегистраДоговорыПеревозчиков() Тогда
		ЗаполнитьПараметры() 
	Иначе                    
		Отказ = Истина; 
		ВызватьИсключение("Недостаточно прав для редактирования объекта.");
	КонецЕсли	
   КонецЕсли		
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ТолькоТранспортныеДоговоры Тогда 
		СтандартнаяОбработка = Ложь; 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", УстановитьПараметрыОтбора());
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;	
КонецПроцедуры

&НаСервере 
Функция УстановитьПараметрыОтбора()
	КонтрагентОтбора  = Справочники.Контрагенты.НайтиПоНаименованию("Транспортные расходы", 1);
	ОрганизацияОтбора = Справочники.Организации.НайтиПоНаименованию("АСК-Р", 1);
	СтруктураОтбора   = Новый Структура("Контрагент, Организация", КонтрагентОтбора, ОрганизацияОтбора);
	Возврат СтруктураОтбора
КонецФункции

&НаСервере 
Процедура ЗаполнитьПараметры()  
	Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Запись.Период = ТекущаяДата();	
	ДоступностьПолей = РольДоступна("ПолныеПрава");
	Элементы.Ответственный.Доступность = ДоступностьПолей;
	Элементы.Период.Доступность = ДоступностьПолей;   
	ТолькоТранспортныеДоговоры = 1;
КонецПроцедуры


