#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&НаСервере
Функция ПолучитьТекстЗапросаСЦенамиПоВидуЦен() Экспорт
	ТекстЗапроса=  
	"ВЫБРАТЬ
	|	ДоступностьТоваров.Номенклатура КАК Номенклатура,
	|	СУММА(ДоступностьТоваров.ВНаличии) КАК ВНаличии,
	|	0 КАК Свободно
	|Поместить ВТ_остатки
	|ИЗ
	|	РегистрСведений.РаспределениеЗапасов КАК ДоступностьТоваров
	|ГДЕ
	|	ДоступностьТоваров.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|	И ДоступностьТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И ДоступностьТоваров.Склад = &Склад
	|	И ДоступностьТоваров.Номенклатура В (&Номенклатура)
	|СГРУППИРОВАТЬ ПО
	|	ДоступностьТоваров.Номенклатура
	|
	|ОБЪЕДИНИТЬ все
	|
	|ВЫБРАТЬ
	|	ЗапасыИПотребностиОстатки.Номенклатура,
	|	0,
	|	СУММА(ВЫБОР
	|		КОГДА ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток -
	|			ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток -
	|			ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток
	|	КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И Номенклатура В (&Номенклатура)
	|	И Склад В (&Склад)) КАК ЗапасыИПотребностиОстатки
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыИПотребностиОстатки.Номенклатура
	|;
	|///////////////////////////////////////////////
	|ВЫБРАТЬ
	|	"""" КАК Класс,
	|	СправочникНоменклатура.Ссылка КАК Ссылка,
	|	СправочникНоменклатура.Артикул КАК Артикул,
	|	СправочникНоменклатура.Код КАК Код,
	|	СправочникНоменклатура.Наименование КАК Наименование,
	|	СправочникНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникНоменклатура.Родитель КАК Родитель,
	|	СправочникНоменклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	СправочникНоменклатура.Ссылка КАК ЭлементСписка,
	|	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЛОЖЬ КАК СодержитТовары,
	|	ЛОЖЬ КАК СодержитУслуги,
	|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СправочникНоменклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	СправочникНоменклатура.Качество КАК Качество,
	|	СправочникНоменклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
	|	ВЫБОР
	|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА ИСТИНА
	|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
	|		И ЕСТЬNULL(ЛОЖЬ, ЛОЖЬ)
	|		И НЕ ЕСТЬNULL(ЛОЖЬ, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоТовар,
	|	ВЫБОР
	|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ИСТИНА
	|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
	|		И ЕСТЬNULL(ЛОЖЬ, ЛОЖЬ)
	|		И НЕ ЕСТЬNULL(ЛОЖЬ, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга,
	|	ВЫБОР
	|		КОГДА
	|			СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	|			ТОГДА СправочникНоменклатура.ВидНоменклатуры
	|		КОГДА
	|			СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	|			ТОГДА СправочникНоменклатура.Ссылка
	|		КОГДА
	|			СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
	|			ТОГДА СправочникНоменклатура.ВладелецХарактеристик
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВладелецХарактеристик,
	|	ВЫБОР
	|		КОГДА
	|			СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ХарактеристикиИспользуются,
	|	&ВидЦены КАК ВидЦены,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,
	|	ЕСТЬNULL(ДоступныеОстатки.ВНаличии, 0) КАК ВНаличииВБазовыхЕдиницах,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ДоступныеОстатки.ВНаличии, 0) + ЕСТЬNULL(ТоварыКОтгрузке.КОтгрузкеОстаток, 0) КАК ЧИСЛО(15, 3)) КАК
	|		ВНаличииОстаток,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ДоступныеОстатки.Свободно, 0) КАК ЧИСЛО(15, 3)) КАК Доступно,
	|	ВЫРАЗИТЬ(ЦеныНоменклатуры.Цена КАК Число(31, 2)) КАК Цена
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ВидЦены
	|		И Номенклатура В (&Номенклатура)
	|		И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) {(Номенклатура).* КАК
	|			Номенклатура}) КАК ЦеныНоменклатуры
	|		ПО (ЦеныНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка)
	|		И (ЦеныНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДоступностьТоваров.Номенклатура,
	|			Сумма(ДоступностьТоваров.ВНаличии),
	|			Сумма(ДоступностьТоваров.Свободно)
	|		ИЗ
	|			ВТ_Остатки КАК ДоступностьТоваров
	|		СГРУППИРОВАТЬ ПО
	|			ДоступностьТоваров.Номенклатура) КАК ДоступныеОстатки
	|		ПО СправочникНоменклатура.Ссылка = ДоступныеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад В (&Склад)
	|		И Номенклатура В (&Номенклатура)) КАК ТоварыКОтгрузке
	|		ПО СправочникНоменклатура.Ссылка = ТоварыКОтгрузке.Номенклатура
	|ГДЕ
	|	НЕ СправочникНоменклатура.ЭтоГруппа
	|	И СправочникНоменклатура.Ссылка В (&Номенклатура)";

	Возврат ТекстЗапроса;
КонецФункции


#КонецЕсли