#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущиеРаспоряжения; //используется для передачи параметров в обработчик ожидания

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма,"ПанельОтгрузкиАвтоматическоеСоздание,ПанельОтгрузки");
	
	ЗаполнитьСкладПоУмолчанию();
	
	ДатаОтгрузки.ДатаНачала = ТекущаяДата() - 86400;
	ДатаОтгрузки.ДатаОкончания = ТекущаяДатаСеанса();
	СостояниеОтбора = "";
	
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если СтруктураБыстрогоОтбора <> Неопределено Тогда
		
		СтруктураБыстрогоОтбора.Свойство("Склад", Склад);
		СтруктураБыстрогоОтбора.Свойство("ОтборРаспоряжений", ОтборРаспоряжений);
		
	КонецЕсли;
	
	УстановитьОтборыВОсновныхСписках();
	УстановитьВидимостьПомещений();
	
	ИспользоватьУпаковочныеЛисты = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковочныеЛисты");
	РежимФормированияРасходныхОрдеров = Константы.РежимФормированияРасходныхОрдеров.Получить();
	АвтоматическоеФормированиеРасходныхОрдеров = РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Автоматически;
	ДоступноСозданиеРасходныхОрдеров = РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Кладовщиком;
	
	СкладПомещениеПриИзмененииСервер();	
	УстановитьВидимостьНеДоступноСозданиеРасходныхОрдеров(); 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	СписокТипов = ОрдераВРаботе.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = СписокТипов;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ОрдераВРаботеГруппаКоманднаяПанельИзменить;
	ПараметрыРазмещения.ПрефиксГрупп = "ОрдераВРаботе";
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если АвтоматическоеФормированиеРасходныхОрдеров Тогда
		КонтрольРаботыФоновыхЗаданийФормированияОчереди();
		ПодключитьОбработчикОжидания("КонтрольРаботыФоновыхЗаданийФормированияОчереди", 300);
	КонецЕсли;
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");

	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ИзменениеСписка_ОрдераВРаботе"
		ИЛИ ИмяСобытия = "ИзменениеСписка_ЗаданияВРаботе"
		ИЛИ ИмяСобытия = "Запись_ВозвратТоваровПоставщику"
		ИЛИ ИмяСобытия = "Запись_ПеремещениеТоваров"
		ИЛИ ИмяСобытия = "Запись_РеализацияТоваровУслуг"
		ИЛИ ИмяСобытия = "Запись_ПередачаСырьяПереработчику"
		ИЛИ ИмяСобытия = "Запись_ПередачаДавальцу"
		ИЛИ ИмяСобытия = "Запись_СборкаТоваров"
		ИЛИ ИмяСобытия = "Запись_ВнутреннееПотреблениеТоваров"
		ИЛИ ИмяСобытия = "Запись_РасходныйОрдерНаТовары"
		ИЛИ ИмяСобытия = "Запись_ОрдерНаПеремещениеТоваров"
		ИЛИ ИмяСобытия = "Запись_ЗаявкаНаВозвратТоваровОтКлиента"
		ИЛИ ИмяСобытия = "Запись_ЗаказНаСборку"
		ИЛИ ИмяСобытия = "Запись_ЗаказНаПеремещение"
		ИЛИ ИмяСобытия = "Запись_ЗаказКлиента"
		ИЛИ ИмяСобытия = "Запись_ЗаказНаВнутреннееПотребление"
		Тогда
		ОбработкаОповещенияСервер(ИмяСобытия,ТекущиеРаспоряжения());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ПолучатьСкладИзНастроек =
		Склад = Настройки.Получить("Склад")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов");
	
	Если ПолучатьСкладИзНастроек Тогда
		Если СтруктураБыстрогоОтбора = Неопределено Тогда
			Склад 		  = Настройки.Получить("Склад");
			Помещение 	  = Настройки.Получить("Помещение");
			ЗонаОтгрузки  = Настройки.Получить("ЗонаОтгрузки");
		Иначе
			
			Если Не СтруктураБыстрогоОтбора.Свойство("Склад") Тогда
				Склад = Настройки.Получить("Склад");
			КонецЕсли;
			
			Если Не СтруктураБыстрогоОтбора.Свойство("Помещение") Тогда
				Помещение = Настройки.Получить("Помещение");
			КонецЕсли;
			
			Если Не СтруктураБыстрогоОтбора.Свойство("ЗонаОтгрузки") Тогда
				ЗонаОтгрузки = Настройки.Получить("ЗонаОтгрузки");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	ФильтрЗаданий = Настройки.Получить("ФильтрЗаданий");
	ФильтрОрдеров = Настройки.Получить("ФильтрОрдеров");
	
	// Эти настройки мы уже загрузИЛИ
	Настройки.Удалить("Склад");
	Настройки.Удалить("Помещение");
	Настройки.Удалить("ЗонаОтгрузки");
	Настройки.Удалить("ФильтрЗаданий");
	Настройки.Удалить("ФильтрОрдеров");
		
	СкладПомещениеПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	СкладПомещениеПриИзмененииСервер();
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.УправлениеОтгрузкой.Форма.Элемент.Склад.ПриИзменении");
	
	ОтображениеДеталейОтгрузка = Ложь;
	СкладПомещениеПриИзмененииСервер();
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
	КонтрольРаботыФоновыхЗаданийФормированияОчереди();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	ДатаОтгрузкиПриИзмененииСервер();
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
КонецПроцедуры

&НаКлиенте
Процедура СостояниеОтгрузкиПриИзменении(Элемент)
		
	УстановитьОтборыВОсновныхСписках();
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьСостоянияРаспоряженийНаОтборКлиент();
	ГруппаСтраницыПриСменеСтраницыСервер(ТекущиеРаспоряжения(), ТекущаяСтраница.Имя);
	
	Если ТекущаяСтраница.Имя = "ГруппаОтгрузка" Тогда
		
		ТекущаяСтрока = Элементы.РаспоряженияНаОтгрузку.ТекущиеДанные;
		
		Если ТекущаяСтрока<>Неопределено Тогда
			СсылкаНаДокумент = ТекущаяСтрока.Распоряжение;
			ТекущийРабочийУчасток = ТекущаяСтрока.Секция;
			ЗаполнитьТовары(Ложь,СсылкаНаДокумент);
		КонецЕсли;
		
	Иначе
		
		ТекущаяСтрока = Элементы.ОрдераВРаботе.ТекущиеДанные;
		Если ТекущаяСтрока<>Неопределено Тогда
			СсылкаНаДокумент = ТекущаяСтрока.Ссылка;
			ЗаполнитьТовары(Истина,СсылкаНаДокумент);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФильтрОрдеровПриИзменении(Элемент)
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗаданийПриИзменении(Элемент)
	ФильтрОрдеровПриИзменении(ТекущиеРаспоряжения());
КонецПроцедуры

&НаКлиенте
Процедура ПроблемаСФоновымиЗаданиямиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылка = "ЗапуститьФормированиеОрдеров" Тогда
		
		ОчиститьСообщения();
		ЗапуститьФормированиеОрдеров();		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряженияНаОтгрузку

&НаКлиенте
Процедура РаспоряженияНаОтгрузкуПриАктивизацииСтроки(Элемент)
	ТекущиеРаспоряжения = ТекущиеРаспоряжения();
	
	ПодключитьОбработчикОжидания("ОсновнойСписокПриАктивацииСтрокиКлиент",0.2,Истина);
	
	ТекущаяСтрока = Элементы.РаспоряженияНаОтгрузку.ТекущиеДанные;
		
	Если ТекущаяСтрока<>Неопределено Тогда
		
	СсылкаНаДокумент = ТекущаяСтрока.Распоряжение;
	ТекущийРабочийУчасток = ТекущаяСтрока.Секция;
	ЗаполнитьТовары(Ложь,СсылкаНаДокумент);
	ЗаполнитьТекОрдера(СсылкаНаДокумент);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаОтгрузкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Распоряжение);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаОтгрузкуРаспоряжениеНомерНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Распоряжение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряженияНаОтбор

&НаКлиенте
Процедура РаспоряженияНаОтборПриАктивизацииСтроки(Элемент)
	ТекущиеРаспоряжения = ТекущиеРаспоряжения();
	
	ПодключитьОбработчикОжидания("ОсновнойСписокПриАктивацииСтрокиКлиент",0.2,Истина);
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(Элемент.ТекущиеДанные.Распоряжение) = Тип("ДокументСсылка.ЗаданиеНаПеревозку")
		И Поле <> Элементы.РаспоряженияНаОтборСостояние Тогда
		Если Поле = Элементы.РаспоряженияНаОтборНомер
			И Не ОтображениеДеталейОтгрузка Тогда
			ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Распоряжение);
		Иначе
			ТекущееЗаданиеНаПеревозкуОтбор = Элемент.ТекущиеДанные.Распоряжение;
			ОтображениеДеталейОтбор = Не ОтображениеДеталейОтбор;
			ОбновитьСостоянияРаспоряженийНаОтбор();
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.РаспоряженияНаОтборСостояние Тогда
		
		Если ТипЗнч(Элемент.ТекущиеДанные.Распоряжение) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
			
			Отбор = Новый Структура("ЗаданиеНаПеревозку", Элемент.ТекущиеДанные.Распоряжение);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор", Отбор);
			ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ВыполнениеОтбораТоваровПоСкладуКонтекст");
			ПараметрыФормы.Вставить("КлючВарианта", "ВыполнениеОтбораТоваровПоСкладуКонтекст");
			ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
			
			ОткрытьФорму("Отчет.ТоварыКОтбору.Форма",
				ПараметрыФормы,
				ЭтаФорма);
			
		Иначе
			
			Отбор = Новый Структура("Распоряжение", Элемент.ТекущиеДанные.Распоряжение);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор", Отбор);
			ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ВыполнениеОтбораТоваровПоСкладуКонтекст");
			ПараметрыФормы.Вставить("КлючВарианта", "ВыполнениеОтбораТоваровПоСкладуКонтекст");
			ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
			
			ОткрытьФорму("Отчет.ТоварыКОтбору.Форма",
				ПараметрыФормы,
				ЭтаФорма);
			
		КонецЕсли;
		
	Иначе
		ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Распоряжение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаОтборНомерНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Распоряжение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОрдераВРаботе

&НаКлиенте
Процедура ОрдераВРаботеПриИзменении(Элемент)
	Оповестить("ИзменениеСписка_ОрдераВРаботе", Новый Структура);
	Оповестить("Запись_РасходныйОрдерНаТовары", Новый Структура);
КонецПроцедуры

&НаКлиенте
Процедура ОрдераВРаботеПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекущаяСтрока = Элементы.ОрдераВРаботе.ТекущиеДанные;
	Если ТекущаяСтрока<>Неопределено Тогда
	СсылкаНаДокумент = ТекущаяСтрока.Ссылка;
	ЗаполнитьТовары(Истина,СсылкаНаДокумент);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаданияВРаботе

&НаКлиенте
Процедура ЗаданияВРаботеПриИзменении(Элемент)
	Оповестить("ИзменениеСписка_ЗаданияВРаботе", Новый Структура);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаданияНаОтбор(Команда)
	СоздатьЗаданияНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданияНаПереупаковку(Команда)
	СоздатьЗаданияНаКлиенте(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдера(Команда)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	ПроверитьСкладПомещение(Отказ);
		
	 СоздатьОрдераСервер();

	 Если ТекущийДокумент<>Неопределено Тогда
	    ОткрытьФорму("Документ.РасходныйОрдерНаТовары.ФормаОбъекта",Новый Структура("Ключ",ТекущийДокумент)); 
	 КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдераФрагмент(Знач Отказ)
	
	Перем ФормаПараметры;
	
	Если Не Отказ Тогда
		
		Если ИспользоватьАдресноеХранение Тогда
			НазначитьЗонуОтгрузки = Истина;
			
			ФормаПараметры = Новый Структура;
			ФормаПараметры.Вставить("Операция", "ФормированиеОрдеровАдресныйСклад");
			ФормаПараметры.Вставить("Склад", Склад);
			ФормаПараметры.Вставить("Помещение", Помещение);
			ФормаПараметры.Вставить("ИспользоватьСкладскиеПомещения", ИспользоватьСкладскиеПомещения);
		Иначе
			ФормаПараметры = Новый Структура;
			ФормаПараметры.Вставить("Операция", "ФормированиеОрдеров");
			ФормаПараметры.Вставить("Склад", Склад);
			ФормаПараметры.Вставить("Помещение", Помещение);
			ФормаПараметры.Вставить("ИспользоватьСкладскиеПомещения", ИспользоватьСкладскиеПомещения);
			
			НазначитьЗонуОтгрузки = Ложь;
		КонецЕсли;
		
		ОткрытьФорму("Обработка.УправлениеОтгрузкой.Форма.ФормаНастроек",ФормаПараметры,ЭтаФорма,,,, Новый ОписаниеОповещения("СоздатьОрдераЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдераЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.УправлениеОтгрузкой.Форма.Оповещение.СоздатьОрдераЗавершение");
	
    Ответ = Результат;
    
    Если Ответ = КодВозвратаДиалога.ОК Тогда
        СоздатьОрдераСервер();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьЗонуОтгрузки(Команда)
	ОчиститьСообщения();
	Отказ = Ложь;
	
	ПроверитьСкладПомещение(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументов = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.ОрдераВРаботе);
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ФормаПараметры = Новый Структура("Операция, Склад, Помещение", "ВыборЗоныОтгрузки", Склад, Помещение);
	Ответ = Неопределено;
	
	ОткрытьФорму("Обработка.УправлениеОтгрузкой.Форма.ФормаНастроек",ФормаПараметры,ЭтаФорма,,,, Новый ОписаниеОповещения("НазначитьЗонуОтгрузкиЗавершение", ЭтотОбъект, Новый Структура("МассивДокументов", МассивДокументов)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьЗонуОтгрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    МассивДокументов = ДополнительныеПараметры.МассивДокументов;
    
    
    Ответ = Результат;
    
    Если Ответ <> КодВозвратаДиалога.ОК Тогда
        Возврат;
    КонецЕсли;
    
    МассивИзмененныхДокументов = УстановитьЗоныОтгрузкиСервер(МассивДокументов);
    
    Если МассивИзмененныхДокументов.Количество() > 0 Тогда
        
        ТекстСообщения = НСтр("ru='Для %КоличествоОбработанных% из %КоличествоВсего% выделенных в списке ордеров на отгрузку товаров назначена зона отгрузки ""ЗонаОтгрузки""'");
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоОбработанных%", МассивИзмененныхДокументов.Количество());
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоВсего%",        МассивДокументов.Количество());
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЗонаОтгрузки%",           ЗонаОтгрузки);
        
        ТекстЗаголовка = НСтр("ru='Зона отгрузки ""%ЗонаОтгрузки%"" назначена'");
        ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ЗонаОтгрузки%", ЗонаОтгрузки);
        ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
        
    Иначе
        
        ТекстСообщения = НСтр("ru='Зона отгрузки ""%ЗонаОтгрузки%"" не назначена ни для одного ордере на отгрузку товаров'");
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЗонаОтгрузки%",                 ЗонаОтгрузки);
        
        ТекстЗаголовка = НСтр("ru='Зона отгрузки ""%ЗонаОтгрузки%"" не назначена'");
        ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ЗонаОтгрузки%", ЗонаОтгрузки);
        ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьЗаданиеНаПеревозку(Команда)
	
	ОчиститьСообщения();
	
	Ордера 					= Новый Массив;
	МассивДокументов 		= Новый Массив;
	НеобработанныеСтроки 	= Новый Массив;
	
	СписокОрдеров 		= Элементы.ОрдераВРаботе;
	ВыделенныеСтроки 	= ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(СписокОрдеров);
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		СтрокаОрдеров = СписокОрдеров.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если Не СтрокаОрдеров.ОтгрузкаПоЗаданиюНаПеревозку
			Или ТипЗнч(ВыделеннаяСтрока) <> Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			
			ПараметрыСтроки = Новый Структура("Ссылка, ОтгрузкаПоЗаданиюНаПеревозку");
			ЗаполнитьЗначенияСвойств(ПараметрыСтроки, СтрокаОрдеров);
			
			НеобработанныеСтроки.Добавить(ПараметрыСтроки);
			
		Иначе
			ПараметрыСтроки = Новый Структура("Ссылка, Статус");
			ЗаполнитьЗначенияСвойств(ПараметрыСтроки, СтрокаОрдеров);
			
			Ордера.Добавить(ПараметрыСтроки);
			МассивДокументов.Добавить(ВыделеннаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		ОповеститьОбОшибкахВыбораЗаданияНаПеревозку(НеобработанныеСтроки);
		Возврат;
	ИначеЕсли МассивДокументов.Количество() = 1 Тогда
		ПараметрыФормы = Новый Структура("Ордер", МассивДокументов[0]);
	Иначе
		ПараметрыФормы = Новый Структура("Ордера, Склад", МассивДокументов, Склад);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Ордера, НеобработанныеОрдера", Ордера, НеобработанныеСтроки);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("НазначитьЗаданиеНаПеревозкуЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ФормаВыбора = ОткрытьФорму("Документ.РасходныйОрдерНаТовары.Форма.ФормаВыбораЗаданияНаПеревозку",
		ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьЗаданиеНаПеревозкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		НазначитьЗаданиеНаПеревозкуСервер(Результат, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьПриоритетОтгрузки(Команда)
	ОчиститьСообщения();
		
	МассивДокументов = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.ОрдераВРаботе);
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
			
	ФормаПараметры = Новый Структура;
	ФормаПараметры.Вставить("Заголовок", НСтр("ru = 'Выберите приоритет отгрузки'"));
	
	Приоритет = Неопределено;

	
	ОткрытьФорму("Справочник.Приоритеты.ФормаВыбора",ФормаПараметры,ЭтаФорма,,,, Новый ОписаниеОповещения("НазначитьПриоритетОтгрузкиЗавершение", ЭтотОбъект, Новый Структура("МассивДокументов", МассивДокументов)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура НазначитьПриоритетОтгрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    МассивДокументов = ДополнительныеПараметры.МассивДокументов;
    
    
    Приоритет = Результат;
    
    Если Не ЗначениеЗаполнено(Приоритет) Тогда
        Возврат;
    КонецЕсли;
    
    МассивИзмененныхДокументов = НазначитьПриоритетОтгрузкиСервер(МассивДокументов, Приоритет);
    
    Если МассивИзмененныхДокументов.Количество() > 0 Тогда
        
        ТекстСообщения = НСтр("ru='Для %КоличествоОбработанных% из %КоличествоВсего% выделенных в списке ордеров на отгрузку товаров назначен приоритет отгрузки ""%Приоритет%""'");
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоОбработанных%", МассивИзмененныхДокументов.Количество());
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоВсего%",        МассивДокументов.Количество());
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Приоритет%",              Приоритет);
        
        ТекстЗаголовка = НСтр("ru='Приоритет отгрузки ""%Приоритет%"" назначен'");
        ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Приоритет%", Приоритет);
        ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
        
    Иначе
        
        ТекстСообщения = НСтр("ru='Приоритет отгрузки ""%Приоритет%"" не назначен ни для одного ордера на отгрузку товаров'");
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Приоритет%", Приоритет);
        
        ТекстЗаголовка = НСтр("ru='Приоритет ""%Приоритет%"" не назначена'");
        ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Приоритет%", Приоритет);
        ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрдераОтгрузить(Команда)
	ОчиститьСообщения();
		
	МассивДокументов = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.ОрдераВРаботе);
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИзмененныхДокументов = ОрдераИзменитьСтатусСервер(МассивДокументов,"Отгружен");
	
	ОповеститьПользователяОбУстановкеСтатусаОрдеров(МассивИзмененныхДокументов.Количество(), МассивДокументов.Количество(),
													ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрдераКОтгрузке(Команда)
	ОчиститьСообщения();
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаОтгрузка Тогда
		МассивДокументов = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.ОрдераВРаботе);
	Иначе
		МассивДокументов = Новый Массив;
		МассивСтрок      = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.РаспоряженияНаОтбор);
		Для Каждого СтрМас Из МассивСтрок Цикл
			Если ТипЗнч(Элементы.РаспоряженияНаОтбор.ДанныеСтроки(СтрМас).Распоряжение) <> Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
				МассивДокументов.Добавить(Элементы.РаспоряженияНаОтбор.ДанныеСтроки(СтрМас).Распоряжение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если МассивДокументов.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru='Команда не может быть выполнена для указанного объекта!'");
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	МассивИзмененныхДокументов = ОрдераИзменитьСтатусСервер(МассивДокументов,"КОтгрузке");
	
	Если МассивИзмененныхДокументов.Количество() > 0 Тогда
		Если ОтображениеДеталейОтбор И РаспоряженияНаОтбор.Количество() <= 1 Тогда
			ОтображениеДеталейОтбор = Ложь; // по заданию на отгрузку больше нет ордеров в статусе "К отбору"
		КонецЕсли;
		ОбновитьСостоянияРаспоряженийНаОтбор();
		УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
	КонецЕсли;
	
	ОповеститьПользователяОбУстановкеСтатусаОрдеров(МассивИзмененныхДокументов.Количество(), МассивДокументов.Количество(),
													ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтгрузке"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрдераКПроверке(Команда)
	ОчиститьСообщения();
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаОтгрузка Тогда
		МассивДокументов = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.ОрдераВРаботе);
	Иначе
		МассивДокументов = Новый Массив;
		МассивСтрок      = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.РаспоряженияНаОтбор);
		Для Каждого СтрМас Из МассивСтрок Цикл
			Если ТипЗнч(Элементы.РаспоряженияНаОтбор.ДанныеСтроки(СтрМас).Распоряжение) <> Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
				МассивДокументов.Добавить(Элементы.РаспоряженияНаОтбор.ДанныеСтроки(СтрМас).Распоряжение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если МассивДокументов.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru='Команда не может быть выполнена для указанного объекта!'");
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	МассивИзмененныхДокументов = ОрдераИзменитьСтатусСервер(МассивДокументов,"КПроверке");
	
	Если МассивИзмененныхДокументов.Количество() > 0 Тогда
		Если ОтображениеДеталейОтбор И РаспоряженияНаОтбор.Количество() <= 1 Тогда
			ОтображениеДеталейОтбор = Ложь; // по заданию на отгрузку больше нет ордеров в статусе "К отбору"
		КонецЕсли;
		ОбновитьСостоянияРаспоряженийНаОтбор();
    	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
	КонецЕсли;
	
	ОповеститьПользователяОбУстановкеСтатусаОрдеров(МассивИзмененныхДокументов.Количество(), МассивДокументов.Количество(),
													ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КПроверке"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрдераКОтбору(Команда)
	ОчиститьСообщения();
		
	МассивДокументов = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.ОрдераВРаботе);
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИзмененныхДокументов = ОрдераИзменитьСтатусСервер(МассивДокументов,"КОтбору");
	
	ОповеститьПользователяОбУстановкеСтатусаОрдеров(МассивИзмененныхДокументов.Количество(), МассивДокументов.Количество(),
													ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору"));
КонецПроцедуры

&НаКлиенте
Процедура ВзятьЗаданияВРаботу(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзятьЗаданияВРаботуЗавершение", ЭтотОбъект);
	
	СкладыКлиент.ВзятьЗаданияВРаботу(ЭтаФорма, Элементы.ЗаданияВРаботе , "УправлениеОтгрузкой", Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВзятьЗаданияВРаботуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	УстановитьОтборыВОсновныхСписках();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадания(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьЗаданияЗавершение", ЭтотОбъект);
	
	СкладыКлиент.ОтметитьВыполнениеЗаданийБезОшибок(ЭтаФорма, Элементы.ЗаданияВРаботе, "УправлениеОтгрузкой", Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаданияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	УстановитьОтборыВОсновныхСписках();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки(Команда)
	УстановитьОтборыВОсновныхСписках();
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоСостояниюСборки(Команда)
	
	Отбор = Новый Структура("Склад", Склад);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ВыполнениеСборкиТоваровПоСкладуКонтекст");
	ПараметрыФормы.Вставить("КлючВарианта", "ВыполнениеСборкиТоваровПоСкладуКонтекст");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", "Истина");
	
	ОткрытьФорму("Отчет.ТоварыКОтгрузке.Форма",
				ПараметрыФормы,
				ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдерНаПеремещение(Команда)
	
	Основание = Новый Структура;
	Основание.Вставить("Склад", Склад);
	Основание.Вставить("ПомещениеОтправитель", Помещение);
	
	ОткрытьФорму("Документ.ОрдерНаперемещениеТоваров.Форма.ФормаДокумента",Новый Структура("Основание",Основание));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКоличество(Команда)
	Если Элементы.ОрдераВРаботе.ТекущиеДанные <> Неопределено Тогда
		
		Если Не Элементы.ОрдераВРаботе.ТекущиеДанные.Свойство("Ссылка") Тогда
			ТекстСообщения = НСтр("ru = 'Действие недоступно для строки группировки списка.'");
			                        			
			ПоказатьПредупреждение(Неопределено, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элементы.ОрдераВРаботе.ТекущиеДанные;
		
		ЭтоРасходныйОрдер = (ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары"));
		
		Если ЭтоРасходныйОрдер
			И ИспользоватьУпаковочныеЛисты Тогда
			Действие = НСтр("ru = 'Проверка количества и упаковка'");
		Иначе
			Действие = НСтр("ru = 'Проверка количества'");
		КонецЕсли;
		
		ПараметрЗаголовок = НСтр("ru = '%ПроверкаУпаковка% товаров в документе %Документ%'");
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", ТекущиеДанные.Ссылка);
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%ПроверкаУпаковка%", Действие);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
		ПараметрыФормы.Вставить("Ордер", ТекущиеДанные.Ссылка);
		ПараметрыФормы.Вставить("Склад", Склад);
		
		ОткрытьФорму("Обработка.ПроверкаКоличестваТоваровВДокументе.Форма.Форма", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьКоличество(Команда)
	Если Элементы.ОрдераВРаботе.ТекущиеДанные <> Неопределено Тогда
		
		Если Не Элементы.ОрдераВРаботе.ТекущиеДанные.Свойство("Ссылка") Тогда
			ТекстСообщения = НСтр("ru = 'Действие недоступно для строки группировки списка.'");
			
			ПоказатьПредупреждение(Неопределено, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элементы.ОрдераВРаботе.ТекущиеДанные;
		
		ЭтоРасходныйОрдер = (ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары"));
		
		Если ЭтоРасходныйОрдер
			И ИспользоватьУпаковочныеЛисты Тогда
			Действие = НСтр("ru = 'Исправление количества и упаковка'");
		Иначе
			Действие = НСтр("ru = 'Исправление количества'");
		КонецЕсли;
		
		ПараметрЗаголовок = НСтр("ru = '%ИсправлениеУпаковка% товаров в документе %Документ%'");
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", ТекущиеДанные.Ссылка);
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%ИсправлениеУпаковка%", Действие);
		
		Помещение = ?(ТекущиеДанные.Свойство("ПомещениеОтправитель"), ТекущиеДанные.ПомещениеОтправитель, Неопределено);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
		ПараметрыФормы.Вставить("Ордер", ТекущиеДанные.Ссылка);
		ПараметрыФормы.Вставить("Склад", Склад);
		ПараметрыФормы.Вставить("Помещение", Помещение);
		ПараметрыФормы.Вставить("РежимИсправления", Истина);
		
		ОткрытьФорму("Обработка.ПроверкаКоличестваТоваровВДокументе.Форма.Форма", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеВТСД(Команда)
	
	ПараметрыФормы = Новый Структура("ВариантЗаполнения, СкладОтгрузки, ДатаОтгрузки", "ПоРаспоряжениямНаОтгрузку", Склад, ДатаОтгрузки);
	ОткрытьФорму("Обработка.ВыгрузкаБазыТоваровВТСД.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьОрдера(Команда)
	ОчиститьСообщения();
	
	МассивСтрок = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.РаспоряженияНаОтбор);
	МассивДокументов = Новый Массив;
	Для каждого СтрМас Из МассивСтрок Цикл
		МассивДокументов.Добавить(Элементы.РаспоряженияНаОтбор.ДанныеСтроки(СтрМас).Распоряжение);	
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИзмененныхДокументов = УменьшитьОрдераСервер(МассивДокументов);
	
	Если МассивИзмененныхДокументов.Количество() > 0 Тогда
		УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
		
		ТекстСообщения = НСтр("ru='Для %КоличествоОбработанных% из %КоличествоВсего% выделенных в списке распоряжений на отбор количество заполнено в соотвестии с количеством отобранных товаров'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоОбработанных%", МассивИзмененныхДокументов.Количество());
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоВсего%",        МассивДокументов.Количество());
		
		ТекстЗаголовка = НСтр("ru='Заполнение ордеров по отобранным товарам'");
		ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='Количество товаров не перезаполнялось ни в одном распоряжения на отбор товаров'");
		
		ТекстЗаголовка = НСтр("ru='Заполнение ордеров от отобранным товарам'");
		ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.ОрдераВРаботе);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ОрдераВРаботе, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ОрдераВРаботе);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

#Область ЗаполнениеИИнициализация

&НаСервере
Процедура ЗаполнитьСкладПоУмолчанию()
	
	СтруктураЗаполнения = Новый Структура("Склад");
	ОбщегоНазначенияУТ.ОбработкаЗаполнения(СтруктураЗаполнения, Неопределено, Неопределено);
	Склад = СтруктураЗаполнения.Склад;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаСервере
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ОрдерНаПеремещениеТоваров.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ОтборРазмещениеТоваров.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.РасходныйОрдерНаТовары.ПустаяСсылка"));
	
	МассивСсылок = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
	Если МассивСсылок.Количество() > 0 Тогда
		СсылкаДокумента = МассивСсылок[0];
		
		Если ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.ОтборРазмещениеТоваров")
			И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОтгрузка Тогда
			
			СсылкаРаспоряжения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаДокумента, "Распоряжение");
			Элементы.ОрдераВРаботе.ТекущаяСтрока = СсылкаРаспоряжения;
			
			Возврат СсылкаРаспоряжения;
			
		Иначе
			Если ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.ОтборРазмещениеТоваров") Тогда
				Элементы.ЗаданияВРаботе.ТекущаяСтрока = СсылкаДокумента;
			ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОтбор Тогда
				Элементы.РаспоряженияНаОтбор.ТекущаяСтрока = СсылкаДокумента;
			Иначе
				Элементы.ОрдераВРаботе.ТекущаяСтрока = СсылкаДокумента;
			КонецЕсли;
			
			Возврат СсылкаДокумента;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	СсылкаДокумента = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	
	Если СсылкаДокумента <> Неопределено Тогда
		ПоказатьЗначение(Неопределено, СсылкаДокумента);
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Интерфейс

&НаКлиенте
Процедура ОсновнойСписокПриАктивацииСтрокиКлиент()
	
	Если ТекущееРаспоряжениеНаОтбор <> ТекущиеРаспоряжения.РаспоряжениеНаОтбор
	 ИЛИ ТекущееРаспоряжениеНаОтгрузку <> ТекущиеРаспоряжения.РаспоряжениеНаОтгрузку Тогда
		
		// Кэшируем выделенные строки
		ВыделенныеСтрокиНаОтгрузку = Новый Массив;
		Для Каждого СтрокаТаблицы Из Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки Цикл
			СтрокаТаблицы = РаспоряженияНаОтгрузку.НайтиПоИдентификатору(СтрокаТаблицы);
			Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаТаблицы = СтрокаТаблицы.Распоряжение;
			КонецЕсли;
			ВыделенныеСтрокиНаОтгрузку.Добавить(СтрокаТаблицы);
		КонецЦикла;
		
		ВыделенныеСтрокиНаОтбор = Новый Массив;
		УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения);
		
		// Восстанавливаем выделенные строки
		СтрокиТаблицы = РаспоряженияНаОтгрузку.НайтиСтроки(Новый Структура("Распоряжение", ТекущиеРаспоряжения.РаспоряжениеНаОтгрузку));
		Если СтрокиТаблицы.Количество() > 0 Тогда
			Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока = СтрокиТаблицы[0].ПолучитьИдентификатор();
		КонецЕсли;
		
		Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки.Очистить();
		Для Каждого СтрокаТаблицы Из ВыделенныеСтрокиНаОтгрузку Цикл
			СтрокиТаблицы = РаспоряженияНаОтгрузку.НайтиСтроки(Новый Структура("Распоряжение", СтрокаТаблицы));
			Если СтрокиТаблицы.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки.Добавить(СтрокиТаблицы[0].ПолучитьИдентификатор());
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТекущиеРаспоряжения()
	
	СтруктураВозврата = Новый Структура("РаспоряжениеНаОтбор, РаспоряжениеНаОтгрузку");
	
	Если Элементы.РаспоряженияНаОтгрузку.ТекущиеДанные <> Неопределено Тогда
		СтруктураВозврата.РаспоряжениеНаОтгрузку = Элементы.РаспоряженияНаОтгрузку.ТекущиеДанные.Распоряжение;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура СкладПомещениеПриИзмененииСервер()
		
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	
	Если ЗначениеЗаполнено(Склад) Тогда
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Склад);
		СтруктураУстанавливаемыхПараметров.Вставить("Помещение",Помещение);
		
		ИспользоватьАдресноеХранение = СкладыСервер.ИспользоватьАдресноеХранение(Склад, Помещение);
		
	Иначе
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Неопределено);
		СтруктураУстанавливаемыхПараметров.Вставить("Помещение",Неопределено);
		ИспользоватьАдресноеХранение = Ложь;
	КонецЕсли;	
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	ИспользоватьСтатусыРасходныхОрдеров = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРасходныхОрдеров", 
																			Новый Структура("Склад", Склад));
																			
	Элементы.ОрдераВРаботеСтатус.Видимость = ИспользоватьСтатусыРасходныхОрдеров;
	
	Элементы.Состояние.СписокВыбора.Очистить();
	
	Элементы.Состояние.СписокВыбора.Добавить("Набирается", НСтр("ru = 'Набирается'"));		
	Элементы.Состояние.СписокВыбора.Добавить("ОжидаетсяОтбор", НСтр("ru = 'Ожидается отбор'"));
	Элементы.Состояние.СписокВыбора.Добавить("Набран", НСтр("ru = 'Набран'"));		
	Элементы.Состояние.СписокВыбора.Добавить("НетОтметкиКассы", НСтр("ru = 'Нет отметки кассы'"));
	Элементы.Состояние.СписокВыбора.Добавить("ЧастичноОтгружен", НСтр("ru = 'Частично отгружен'"));
	Элементы.Состояние.СписокВыбора.Добавить("Отгружен", НСтр("ru = 'Отгружен'"));
	Элементы.Состояние.СписокВыбора.Добавить("Все", НСтр("ru = 'Все'"));
	СостояниеОтгрузки = "ОжидаетсяОтбор";
		
	РабочийУчасток = Справочники.РабочиеУчастки.ПустаяСсылка();
	НазначитьЗонуОтгрузки   = Ложь;
	
	УстановитьОтборыВОсновныхСписках();
	
	ЗаполнитьСписокВыбораФильтраОрдеров();
	УстановитьВидимостьПомещений();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНеДоступноСозданиеРасходныхОрдеров()
	
	Если Не ДоступноСозданиеРасходныхОрдеров Тогда	
		
		Элементы.ГруппаРасходныеОрдера.ОтображатьЗаголовок = Ложь;
		Элементы.ГруппаРасходныеОрдера.Отображение = ОтображениеОбычнойГруппы.Нет;
		Элементы.ФильтрОрдеров.Видимость = Ложь;
		
		Элементы.ГруппаОтборКоманднаяПанельРаспоряженияНаОтгрузку.Видимость = Ложь;
		Элементы.ГруппаРаспоряженияНаОтгрузку.Видимость = Ложь;
		Элементы.ГруппаШапкаОтгрузкиРасходныеОрдера.Видимость = Истина;
		Элементы.АвтоматическоеФормированиеРасходныхОрдеров.Видимость = Истина;
		Элементы.ИзменитьФорму2.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ГруппаСтраницыПриСменеСтраницыСервер(ТекущиеРаспоряжения, ИмяТекущейСтраницы);
	
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения);
	УстановитьВидимостьПомещений();
	
КонецПроцедуры

&НаСервере
Процедура ДатаОтгрузкиПриИзмененииСервер()
	
	УстановитьОтборыВОсновныхСписках();
	УстановитьВидимостьПомещений();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиКолонокВесОбъем()
	ЕдиницаИзмеренияОбъема 	= Строка(Константы.ЕдиницаИзмеренияОбъема.Получить());
	ЕдиницаИзмеренияВеса 	= Строка(Константы.ЕдиницаИзмеренияВеса.Получить());
	
	ЗаголовокЭлемента = НСтр("ru='Объем, %ЕдиницаИзмерения%'");
	ЗаголовокЭлемента = СтрЗаменить(ЗаголовокЭлемента, "%ЕдиницаИзмерения%", ЕдиницаИзмеренияОбъема); 
	
	ЗаголовокЭлемента = НСтр("ru='Вес (брутто), %ЕдиницаИзмерения%'");
	ЗаголовокЭлемента = СтрЗаменить(ЗаголовокЭлемента, "%ЕдиницаИзмерения%", ЕдиницаИзмеренияВеса); 
	Элементы.ЗаданияВРаботе.ПодчиненныеЭлементы.ПеремещенияВРаботеВесОтбор.Заголовок   = ЗаголовокЭлемента;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыВОсновныхСписках()
	
	ЗаполнитьРаспоряженияНаОтгрузку();
	
	Элементы.ОрдераВРаботе.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения)
	
	Если ТекущиеРаспоряжения = Неопределено Тогда
		ТекущееРаспоряжениеНаОтбор = Неопределено;
		ТекущееРаспоряжениеНаОтгрузку = Неопределено;
	Иначе
		ТекущееРаспоряжениеНаОтбор    = ТекущиеРаспоряжения.РаспоряжениеНаОтбор;
		ТекущееРаспоряжениеНаОтгрузку = ТекущиеРаспоряжения.РаспоряжениеНаОтгрузку;
	КонецЕсли;
	
	//ОрдераВРаботе
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Склад", Склад, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ПомещениеОтправитель", Помещение,
														ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Помещение));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ДатаОтгрузки", КонецДня(ДатаОтгрузки.ДатаОкончания),
														ВидСравненияКомпоновкиДанных.МеньшеИЛИРавно,,Истина);
														
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ДатаОтгрузки", НачалоДня(ДатаОтгрузки.ДатаНачала),
														ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,Истина);

    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка.РабочийУчасток", РабочиеУчастки, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);

	ЗаполнитьРаспоряженияНаОтгрузку(Ложь);
	
	// Сбросим отбор, установленный для скрытия ордеров в случае фильтра "ПоТекущемуРаспоряжению" при отсутствии распоряжений.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", Неопределено,,,Ложь);
	
	Если ФильтрОрдеров = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Статус", Неопределено,,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Распоряжение", Неопределено,,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ЗаданиеНаПеревозку", Неопределено,,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Проведен", Истина,,,Ложь);
	ИначеЕсли ФильтрОрдеров = "ВсеНеотгруженные" Тогда
		
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.Подготовлен);
		СписокСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КОтбору);
		СписокСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КПроверке);
		СписокСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.Проверен);
		СписокСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
		СписокСтатусов.Добавить(Перечисления.СтатусыОрдеровНаПеремещение.КОтбору);
		СписокСтатусов.Добавить(Перечисления.СтатусыОрдеровНаПеремещение.КПроверке);
		СписокСтатусов.Добавить(Перечисления.СтатусыОрдеровНаПеремещение.КОтгрузке);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Статус", СписокСтатусов, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Распоряжение", Неопределено,,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ЗаданиеНаПеревозку", Неопределено,,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Проведен", Истина,,,Истина);
		
	ИначеЕсли ФильтрОрдеров = "ПоТекущемуРаспоряжению" Тогда
		
		Если Не ТекущиеРаспоряжения = Неопределено Тогда
			Если ТекущиеРаспоряжения.РаспоряжениеНаОтгрузку = Неопределено Тогда
				// Текущего распоряжения нет, ордера не показываем
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", Документы.РасходныйОрдерНаТовары.ПустаяСсылка(),,,Истина);
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Статус",   Неопределено,,,Ложь);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Проведен", Истина,,,Ложь);
				Если ТипЗнч(ТекущиеРаспоряжения.РаспоряжениеНаОтгрузку) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", Неопределено,,,Ложь);
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ЗаданиеНаПеревозку", ТекущиеРаспоряжения.РаспоряжениеНаОтгрузку,,,Истина);
				Иначе			
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
					|ГДЕ
					|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение";
					Запрос.УстановитьПараметр("Распоряжение", ТекущиеРаспоряжения.РаспоряжениеНаОтгрузку);
					РасходныеОрдера = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
					
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", РасходныеОрдера, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ЗаданиеНаПеревозку", Неопределено,,,Ложь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспоряженияНаОтгрузку(ПроверятьИзменениеПараметров = Ложь)
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		РаспоряженияНаОтгрузку.Очистить();
		Возврат;
	КонецЕсли;
	
	Если Не Пользователи.ЭтоПолноправныйПользователь(Неопределено) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка = &Склад";
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Если Запрос.Выполнить().Пустой() Тогда
			РаспоряженияНаОтгрузку.Очистить();
			Возврат;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Склад", 				Склад);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ТекущееЗаданиеНаПеревозкуОтгрузка);
	Запрос.УстановитьПараметр("ДатаОтгрузкиНачало", 		?(ЗначениеЗаполнено(ДатаОтгрузки.ДатаНачала), НачалоДня(ДатаОтгрузки.ДатаНачала) - 1, ДатаОтгрузки.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОтгрузки", 		?(ЗначениеЗаполнено(ДатаОтгрузки.ДатаОкончания), КонецДня(ДатаОтгрузки.ДатаОкончания) + 1, ДатаОтгрузки.ДатаОкончания));
	Запрос.УстановитьПараметр("Номер", 	ПоискПоНомеру);
	ОформлятьСначалаНакладные = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить() = Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные;
	Запрос.УстановитьПараметр("ОформлятьСначалаНакладные", ОформлятьСначалаНакладные);
	Запрос.УстановитьПараметр("ОтображениеДеталейОтгрузка", ОтображениеДеталейОтгрузка);
	
	// Если параметры не изменились, то формировать список заново не надо
	Если ПроверятьИзменениеПараметров
	 И ТипЗнч(ПараметрыРаспоряженияНаОтгрузку) = Тип("ФиксированнаяСтруктура")
	 И ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(ПараметрыРаспоряженияНаОтгрузку, Запрос.Параметры, "") Тогда 
		Возврат;
	КонецЕсли;
	
	// Кэшируем текущие параметры
	ПараметрыРаспоряженияНаОтгрузку = Новый Структура("Склад, ЗаданиеНаПеревозку, ДатаОтгрузки");
	ЗаполнитьЗначенияСвойств(ПараметрыРаспоряженияНаОтгрузку, Запрос.Параметры);
	ПараметрыРаспоряженияНаОтгрузку.Вставить("ОтображениеДеталейОтгрузка", ОтображениеДеталейОтгрузка);
	ПараметрыРаспоряженияНаОтгрузку = Новый ФиксированнаяСтруктура(ПараметрыРаспоряженияНаОтгрузку);
	
	ТекстЗапроса = "";
	
	ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
		Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
	
	Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ТоварыКОтгрузкеОбороты.Номенклатура     КАК Номенклатура,
		|	ТоварыКОтгрузкеОбороты.Характеристика   КАК Характеристика,
		|	ТоварыКОтгрузкеОбороты.Назначение       КАК Назначение,
		|	ТоварыКОтгрузкеОбороты.Серия            КАК Серия,
		|	ТоварыКОтгрузкеОбороты.Склад            КАК Склад,
		|	ТоварыКОтгрузкеОбороты.КОтгрузкеПриход  КАК Количество
		|
		|ПОМЕСТИТЬ ТоварыКОтгрузкеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Обороты(
		|			,
		|			,
		|			,
		|			&УсловиеСоединенияОбороты) КАК ТоварыКОтгрузкеОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	Если НЕ ОтображениеДеталейОтгрузка Тогда
		
		Если СкладыСервер.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку(Склад) Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СостоянияИРеквизитыДоставки.Распоряжение КАК ДокументОтгрузки,
			|	СостоянияИРеквизитыДоставки.ПолучательОтправитель КАК Получатель
			|ПОМЕСТИТЬ ВТРаспоряженияСДоставкойПоЗаданиям
			|ИЗ
			|	РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ОтказОтПеревозки
			|		ПО (ОтказОтПеревозки.ЗаданиеНаПеревозку = ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка))
			|			И СостоянияИРеквизитыДоставки.Склад = ОтказОтПеревозки.Склад
			|			И (ОтказОтПеревозки.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение)
			|ГДЕ
			|	СостоянияИРеквизитыДоставки.Склад = &Склад
			|	И СостоянияИРеквизитыДоставки.СпособДоставки В(&СпособыДоставки)
			|	И ОтказОтПеревозки.Распоряжение ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
			|	ВложенныйЗапрос.Получатель КАК Получатель,
			|	МИНИМУМ(ВложенныйЗапрос.Состояние) КАК Состояние,
			|	ВложенныйЗапрос.Секция КАК Секция
			|ПОМЕСТИТЬ ВТРаспоряженияКОтгрузке
			|ИЗ
			|	(ВЫБРАТЬ
			|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
			|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
			|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
			|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
			|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
			|		РаспоряженияКОтгрузке.Серия КАК Серия,
			|		ВЫБОР
			|			КОГДА &ОжидаетсяОтбор
			|				ТОГДА 0
			|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
			|				ТОГДА 1
			|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
			|				ТОГДА 2
			|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
			|				ТОГДА 3
			|			ИНАЧЕ 404
			|		КОНЕЦ КАК Состояние,
			|		РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Секция КАК Секция
			|	ИЗ
			|		РегистрНакопления.ТоварыКОтгрузке.Остатки(&ДатаОтгрузки, Склад = &Склад) КАК РаспоряженияКОтгрузке
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
			|			ПО РаспоряженияКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
			|				И РаспоряженияКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
			|				И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
			|					И РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&РабочиеУчастки))
			|	ГДЕ
			|		&УсловиеТоварыКОтбору) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ДокументОтгрузки,
			|	ВложенныйЗапрос.Получатель,
			|	ВложенныйЗапрос.Секция
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДокументОтгрузки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка,
			|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение,
			|	ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель КАК ПолучательОтправитель
			|ПОМЕСТИТЬ ВТОтборЗаданияНаПеревозку
			|ИЗ
			|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
			|ГДЕ
			|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен
			|	И ЗаданиеНаПеревозкуРаспоряжения.Склад = &Склад
			|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.КПогрузке))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Распоряжение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка КАК Ссылка,
			|	ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи КАК ДокументОснование
			|ПОМЕСТИТЬ _ВТ_Рейсы
			|ИЗ
			|	Документ.ЗаданиеНаПеревозкуРейс.РасчетДоставки КАК ЗаданиеНаПеревозкуРейсРасчетДоставки
			|ГДЕ
			|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.Проведен = ИСТИНА
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	РейсСиламиПоставщикаОснования.Ссылка,
			|	РейсСиламиПоставщикаОснования.Документ
			|ИЗ
			|	Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
			|ГДЕ
			|	РейсСиламиПоставщикаОснования.Ссылка.Проведен = ИСТИНА
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	РейсОтПоставщикаРасчетДоставки.Ссылка,
			|	РейсОтПоставщикаРасчетДоставки.ДокументОснование
			|ИЗ
			|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
			|ГДЕ
			|	РейсОтПоставщикаРасчетДоставки.Ссылка.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТИПЗНАЧЕНИЯ(ЗаданияНаПеревозку.Ссылка) КАК ТипДокумента,
			|	ЗаданияНаПеревозку.Ссылка КАК Распоряжение,
			|	ЗаданияНаПеревозку.Ссылка КАК ЗаданиеНаПеревозку,
			|	ЗаданияНаПеревозку.Ссылка.Номер КАК Номер,
			|	ЗаданияНаПеревозку.Ссылка.ДатаВремяРейсаПланС КАК Дата,
			|	НЕОПРЕДЕЛЕНО КАК Получатель,
			|	ВЫБОР
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 1
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|	КОНЕЦ КАК Состояние,
			|	1 КАК ИндексКартинки,
			|	ВТРаспоряженияКОтгрузке.Секция КАК Секция,
			|	_ВТ_Рейсы.Ссылка КАК Рейс
			|ИЗ
			|	ВТОтборЗаданияНаПеревозку КАК ЗаданияНаПеревозку
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаспоряженияКОтгрузке КАК ВТРаспоряженияКОтгрузке
			|			ЛЕВОЕ СОЕДИНЕНИЕ _ВТ_Рейсы КАК _ВТ_Рейсы
			|			ПО ВТРаспоряженияКОтгрузке.ДокументОтгрузки = _ВТ_Рейсы.ДокументОснование
			|		ПО (ВТРаспоряженияКОтгрузке.ДокументОтгрузки = ЗаданияНаПеревозку.Распоряжение)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаданияНаПеревозку.Ссылка,
			|	ЗаданияНаПеревозку.Ссылка.Номер,
			|	ЗаданияНаПеревозку.Ссылка.ДатаВремяРейсаПланС,
			|	ВТРаспоряженияКОтгрузке.Секция,
			|	_ВТ_Рейсы.Ссылка,
			|	ЗаданияНаПеревозку.Ссылка
			|
			|ИМЕЮЩИЕ
			|	ВЫБОР
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 1
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|	КОНЕЦ В (&Состояния)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТИПЗНАЧЕНИЯ(РаспоряженияКОтгрузке.ДокументОтгрузки),
			|	РаспоряженияКОтгрузке.ДокументОтгрузки,
			|	ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка),
			|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
			|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
			|	РаспоряженияКОтгрузке.Получатель,
			|	ВЫБОР
			|		КОГДА РаспоряженияКОтгрузке.Состояние = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|		КОГДА РаспоряженияКОтгрузке.Состояние = 1
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|		КОГДА РаспоряженияКОтгрузке.Состояние = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|		КОГДА РаспоряженияКОтгрузке.Состояние = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|	КОНЕЦ,
			|	0,
			|	РаспоряженияКОтгрузке.Секция,
			|	_ВТ_Рейсы.Ссылка
			|ИЗ
			|	ВТРаспоряженияКОтгрузке КАК РаспоряженияКОтгрузке
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
			|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = РеестрДокументов.Ссылка
			|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспоряженияСДоставкойПоЗаданиям КАК ВТРаспоряженияСДоставкойПоЗаданиям
			|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = ВТРаспоряженияСДоставкойПоЗаданиям.ДокументОтгрузки
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ВТ_Рейсы КАК _ВТ_Рейсы
			|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = _ВТ_Рейсы.ДокументОснование
			|ГДЕ
			|	ВТРаспоряженияСДоставкойПоЗаданиям.ДокументОтгрузки ЕСТЬ NULL
			|	И ВЫБОР
			|			КОГДА РаспоряженияКОтгрузке.Состояние = 0
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|			КОГДА РаспоряженияКОтгрузке.Состояние = 1
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|			КОГДА РаспоряженияКОтгрузке.Состояние = 2
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|			КОГДА РаспоряженияКОтгрузке.Состояние = 3
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|		КОНЕЦ В (&Состояния)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
			
			СпособыДоставки = ДоставкаТоваровКлиентСервер.СпособыДоставкиДоКлиентаСНашимУчастием(
				ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));
			
			Запрос.УстановитьПараметр("СпособыДоставки", СпособыДоставки);
			Запрос.УстановитьПараметр("РабочиеУчастки", РабочиеУчастки.ВыгрузитьЗначения());			
		Иначе
			ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ РАЗЛИЧНЫЕ
			                              |	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
			                              |	ВложенныйЗапрос.Документ КАК Документ,
			                              |	ВложенныйЗапрос.Получатель КАК Получатель,
			                              |	ВложенныйЗапрос.Секция КАК Секция,
			                              |	ВложенныйЗапрос.Дата КАК Дата,
			                              |	ВложенныйЗапрос.Номер КАК Номер,
			                              |	ВложенныйЗапрос.ОтметкаКассы КАК ОтметкаКассы,
			                              |	СУММА(ВложенныйЗапрос.КОтгрузкеПриход) КАК КОтгрузкеПриход,
			                              |	СУММА(ВложенныйЗапрос.КОтгрузкеРасход) КАК КОтгрузкеРасход,
			                              |	СУММА(ВложенныйЗапрос.КСборкеПриход) КАК КСборкеПриход,
			                              |	СУММА(ВложенныйЗапрос.КСборкеРасход) КАК КСборкеРасход,
			                              |	СУММА(ВложенныйЗапрос.СобираетсяПриход) КАК СобираетсяПриход,
			                              |	СУММА(ВложенныйЗапрос.СобираетсяРасход) КАК СобираетсяРасход,
			                              |	СУММА(ВложенныйЗапрос.СобраноПриход) КАК СобраноПриход,
			                              |	СУММА(ВложенныйЗапрос.СобраноРасход) КАК СобраноРасход
			                              |ПОМЕСТИТЬ РаспоряженияИСостояния
			                              |ИЗ
			                              |	(ВЫБРАТЬ
			                              |		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
			                              |		ВЫБОР
			                              |			КОГДА НЕ ПеремещениеТоваровТовары.Ссылка ЕСТЬ NULL
			                              |				ТОГДА ПеремещениеТоваровТовары.Ссылка
			                              |			ИНАЧЕ ВЫБОР
			                              |					КОГДА НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
			                              |						ТОГДА РеализацияТоваровУслугТовары.Ссылка
			                              |					ИНАЧЕ РаспоряженияКОтгрузке.ДокументОтгрузки
			                              |				КОНЕЦ
			                              |		КОНЕЦ КАК Документ,
			                              |		РаспоряженияКОтгрузке.Получатель КАК Получатель,
			                              |		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
			                              |		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
			                              |		РаспоряженияКОтгрузке.Назначение КАК Назначение,
			                              |		РаспоряженияКОтгрузке.Серия КАК Серия,
			                              |		РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
			                              |		РаспоряженияКОтгрузке.ДокументОтгрузки.Дата КАК Дата,
			                              |		РаспоряженияКОтгрузке.ДокументОтгрузки.Номер КАК Номер,
			                              |		ВЫБОР
			                              |			КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияКОтгрузке.ДокументОтгрузки) = ТИП(Документ.РеализацияТоваровУслуг)
			                              |				ТОГДА ВЫБОР
			                              |						КОГДА РаспоряженияКОтгрузке.ДокументОтгрузки.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			                              |							ТОГДА ЛОЖЬ
			                              |						ИНАЧЕ ИСТИНА
			                              |					КОНЕЦ
			                              |			ИНАЧЕ ВЫБОР
			                              |					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияКОтгрузке.ДокументОтгрузки) = ТИП(Документ.ЧекККМ)
			                              |						ТОГДА ВЫБОР
			                              |								КОГДА РаспоряженияКОтгрузке.ДокументОтгрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
			                              |									ТОГДА ИСТИНА
			                              |								ИНАЧЕ ЛОЖЬ
			                              |							КОНЕЦ
			                              |					ИНАЧЕ ИСТИНА
			                              |				КОНЕЦ
			                              |		КОНЕЦ КАК ОтметкаКассы,
			                              |		СУММА(ВЫБОР
			                              |				КОГДА РаспоряженияКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			                              |					ТОГДА РаспоряженияКОтгрузке.КОтгрузке
			                              |				ИНАЧЕ 0
			                              |			КОНЕЦ) КАК КОтгрузкеПриход,
			                              |		СУММА(ВЫБОР
			                              |				КОГДА РаспоряженияКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			                              |					ТОГДА РаспоряженияКОтгрузке.КОтгрузке
			                              |				ИНАЧЕ 0
			                              |			КОНЕЦ) КАК КОтгрузкеРасход,
			                              |		СУММА(ВЫБОР
			                              |				КОГДА РаспоряженияКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			                              |					ТОГДА РаспоряженияКОтгрузке.КСборке
			                              |				ИНАЧЕ 0
			                              |			КОНЕЦ) КАК КСборкеПриход,
			                              |		СУММА(ВЫБОР
			                              |				КОГДА РаспоряженияКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			                              |					ТОГДА РаспоряженияКОтгрузке.КСборке
			                              |				ИНАЧЕ 0
			                              |			КОНЕЦ) КАК КСборкеРасход,
			                              |		СУММА(ВЫБОР
			                              |				КОГДА РаспоряженияКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			                              |					ТОГДА РаспоряженияКОтгрузке.Собирается
			                              |				ИНАЧЕ 0
			                              |			КОНЕЦ) КАК СобираетсяПриход,
			                              |		СУММА(ВЫБОР
			                              |				КОГДА РаспоряженияКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			                              |					ТОГДА РаспоряженияКОтгрузке.Собирается
			                              |				ИНАЧЕ 0
			                              |			КОНЕЦ) КАК СобираетсяРасход,
			                              |		СУММА(ВЫБОР
			                              |				КОГДА РаспоряженияКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			                              |					ТОГДА РаспоряженияКОтгрузке.Собрано
			                              |				ИНАЧЕ 0
			                              |			КОНЕЦ) КАК СобраноПриход,
			                              |		СУММА(ВЫБОР
			                              |				КОГДА РаспоряженияКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			                              |					ТОГДА РаспоряженияКОтгрузке.Собрано
			                              |				ИНАЧЕ 0
			                              |			КОНЕЦ) КАК СобраноРасход
			                              |	ИЗ
			                              |		РегистрНакопления.ТоварыКОтгрузке КАК РаспоряженияКОтгрузке
			                              |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
			                              |			ПО РаспоряженияКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
			                              |				И РаспоряженияКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
			                              |				И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
			                              |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			                              |			ПО РаспоряженияКОтгрузке.ДокументОтгрузки = ПеремещениеТоваровТовары.ЗаказНаПеремещение
			                              |				И (ПеремещениеТоваровТовары.Ссылка.Проведен = ИСТИНА)
			                              |				И РаспоряженияКОтгрузке.Номенклатура = ПеремещениеТоваровТовары.Номенклатура
			                              |				И РаспоряженияКОтгрузке.Характеристика = ПеремещениеТоваровТовары.Характеристика
			                              |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			                              |			ПО РаспоряженияКОтгрузке.ДокументОтгрузки = РеализацияТоваровУслугТовары.ЗаказКлиента
			                              |				И (РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА)
			                              |				И РаспоряженияКОтгрузке.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
			                              |				И РаспоряженияКОтгрузке.Характеристика = РеализацияТоваровУслугТовары.Характеристика
			                              |	ГДЕ
			                              |		ВЫБОР
			                              |				КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
			                              |					ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&РабочиеУчастки)
			                              |				ИНАЧЕ ИСТИНА
			                              |			КОНЕЦ
			                              |		И РаспоряженияКОтгрузке.Склад = &Склад
			                              |		И РаспоряженияКОтгрузке.ДокументОтгрузки.Дата <= &ДатаОтгрузки
			                              |		И РаспоряженияКОтгрузке.ДокументОтгрузки.Дата >= &ДатаОтгрузкиНачало
			                              |	
			                              |	СГРУППИРОВАТЬ ПО
			                              |		РаспоряженияКОтгрузке.ДокументОтгрузки,
			                              |		РаспоряженияКОтгрузке.Получатель,
			                              |		РаспоряженияКОтгрузке.Номенклатура,
			                              |		РаспоряженияКОтгрузке.Характеристика,
			                              |		РаспоряженияКОтгрузке.Назначение,
			                              |		РаспоряженияКОтгрузке.Серия,
			                              |		РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
			                              |		РаспоряженияКОтгрузке.ДокументОтгрузки.Дата,
			                              |		РаспоряженияКОтгрузке.ДокументОтгрузки.Номер,
			                              |		ВЫБОР
			                              |			КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияКОтгрузке.ДокументОтгрузки) = ТИП(Документ.РеализацияТоваровУслуг)
			                              |				ТОГДА ВЫБОР
			                              |						КОГДА РаспоряженияКОтгрузке.ДокументОтгрузки.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			                              |							ТОГДА ЛОЖЬ
			                              |						ИНАЧЕ ИСТИНА
			                              |					КОНЕЦ
			                              |			ИНАЧЕ ВЫБОР
			                              |					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияКОтгрузке.ДокументОтгрузки) = ТИП(Документ.ЧекККМ)
			                              |						ТОГДА ВЫБОР
			                              |								КОГДА РаспоряженияКОтгрузке.ДокументОтгрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
			                              |									ТОГДА ИСТИНА
			                              |								ИНАЧЕ ЛОЖЬ
			                              |							КОНЕЦ
			                              |					ИНАЧЕ ИСТИНА
			                              |				КОНЕЦ
			                              |		КОНЕЦ,
			                              |		ВЫБОР
			                              |			КОГДА НЕ ПеремещениеТоваровТовары.Ссылка ЕСТЬ NULL
			                              |				ТОГДА ПеремещениеТоваровТовары.Ссылка
			                              |			ИНАЧЕ ВЫБОР
			                              |					КОГДА НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
			                              |						ТОГДА РеализацияТоваровУслугТовары.Ссылка
			                              |					ИНАЧЕ РаспоряженияКОтгрузке.ДокументОтгрузки
			                              |				КОНЕЦ
			                              |		КОНЕЦ) КАК ВложенныйЗапрос
			                              |ГДЕ
			                              |	ВЫБОР
			                              |			КОГДА НЕ &Номер = """"
			                              |				ТОГДА ВложенныйЗапрос.Номер ПОДОБНО ""%"" + &Номер + ""%""
			                              |			ИНАЧЕ ИСТИНА
			                              |		КОНЕЦ
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	ВложенныйЗапрос.ДокументОтгрузки,
			                              |	ВложенныйЗапрос.Получатель,
			                              |	ВложенныйЗапрос.Секция,
			                              |	ВложенныйЗапрос.Дата,
			                              |	ВложенныйЗапрос.Номер,
			                              |	ВложенныйЗапрос.ОтметкаКассы,
			                              |	ВложенныйЗапрос.Документ
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
			                              |	РаспоряженияИСостояния.Документ КАК Документ,
			                              |	РаспоряженияИСостояния.Получатель КАК Получатель,
			                              |	РаспоряженияИСостояния.Номер КАК Номер,
			                              |	РаспоряженияИСостояния.Дата КАК Дата,
			                              |	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) КАК ТипДокумента,
			                              |	0 КАК ИндексКартинки,
			                              |	РаспоряженияИСостояния.Секция КАК Секция,
			                              |	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка КАК Рейс,
			                              |	РаспоряженияИСостояния.ОтметкаКассы КАК ОтметкаКассы,
			                              |	ВЫБОР
			                              |		КОГДА РаспоряженияИСостояния.КОтгрузкеПриход - РаспоряженияИСостояния.КОтгрузкеРасход = 0
			                              |			ТОГДА ИСТИНА
			                              |		ИНАЧЕ ЛОЖЬ
			                              |	КОНЕЦ КАК Отгружен,
			                              |	ВЫБОР
			                              |		КОГДА РаспоряженияИСостояния.КОтгрузкеПриход - РаспоряженияИСостояния.КОтгрузкеРасход > 0
			                              |				И РаспоряженияИСостояния.КОтгрузкеРасход > 0
			                              |			ТОГДА ИСТИНА
			                              |		ИНАЧЕ ЛОЖЬ
			                              |	КОНЕЦ КАК ЧастичноОтгружен,
			                              |	ВЫБОР
			                              |		КОГДА РаспоряженияИСостояния.СобираетсяПриход - РаспоряженияИСостояния.СобираетсяРасход > 0
			                              |			ТОГДА ИСТИНА
			                              |		ИНАЧЕ ЛОЖЬ
			                              |	КОНЕЦ КАК Набирается,
			                              |	ВЫБОР
			                              |		КОГДА РаспоряженияИСостояния.СобраноПриход - РаспоряженияИСостояния.СобраноРасход > 0
			                              |			ТОГДА ИСТИНА
			                              |		ИНАЧЕ ЛОЖЬ
			                              |	КОНЕЦ КАК Набран,
			                              |	ВЫБОР
			                              |		КОГДА РаспоряженияИСостояния.КОтгрузкеПриход - РаспоряженияИСостояния.КОтгрузкеРасход > 0 
			                              |			ТОГДА ИСТИНА
			                              |		ИНАЧЕ ЛОЖЬ
			                              |	КОНЕЦ КАК ОжидаетсяОтбор
			                              |ПОМЕСТИТЬ Итоговый
			                              |ИЗ
			                              |	РаспоряженияИСостояния КАК РаспоряженияИСостояния
			                              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс.РасчетДоставки КАК ЗаданиеНаПеревозкуРейсРасчетДоставки
			                              |		ПО РаспоряженияИСостояния.Распоряжение = ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи
			                              |			И (ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.Проведен = ИСТИНА)
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	Итоговый.Распоряжение КАК Распоряжение,
			                              |	Итоговый.Документ КАК Документ,
			                              |	Итоговый.Документ.Номер КАК Номер,
			                              |	Итоговый.Документ.Дата КАК Дата,
			                              |	Итоговый.Получатель КАК Получатель,
			                              |	Итоговый.ТипДокумента КАК ТипДокумента,
			                              |	Итоговый.ИндексКартинки КАК ИндексКартинки,
			                              |	Итоговый.Секция КАК Секция,
			                              |	Итоговый.Рейс КАК Рейс,
			                              |	Итоговый.ОтметкаКассы КАК ОтметкаКассы,
			                              |	Итоговый.Отгружен КАК Отгружен,
			                              |	Итоговый.ЧастичноОтгружен КАК ЧастичноОтгружен,
			                              |	Итоговый.Набирается КАК Набирается,
			                              |	Итоговый.Набран КАК Набран,
			                              |	Итоговый.ОжидаетсяОтбор КАК ОжидаетсяОтбор
			                              |ИЗ
			                              |	Итоговый КАК Итоговый
			                              |ГДЕ &Условие
			                              |
			                              |УПОРЯДОЧИТЬ ПО
			                              |	Дата,
			                              |	Номер";
			Запрос.УстановитьПараметр("РабочиеУчастки",РабочиеУчастки.ВыгрузитьЗначения());
		КонецЕсли;
		
	Иначе // ОтображениеДеталейОтгрузка
	
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                              |	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
		                              |	ВложенныйЗапрос.Получатель КАК Получатель,
		                              |	ВЫБОР
		                              |		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
		                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		                              |		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
		                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		                              |		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
		                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		                              |		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
		                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
		                              |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		                              |	КОНЕЦ КАК Состояние,
		                              |	ВложенныйЗапрос.Секция КАК Секция
		                              |ПОМЕСТИТЬ РаспоряженияИСостояния
		                              |ИЗ
		                              |	(ВЫБРАТЬ
		                              |		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
		                              |		РаспоряженияКОтгрузке.Получатель КАК Получатель,
		                              |		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
		                              |		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
		                              |		РаспоряженияКОтгрузке.Назначение КАК Назначение,
		                              |		РаспоряженияКОтгрузке.Серия КАК Серия,
		                              |		РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
		                              |		ВЫБОР
		                              |			КОГДА &ОжидаетсяОтбор
		                              |				ТОГДА 0
		                              |			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
		                              |				ТОГДА 1
		                              |			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
		                              |				ТОГДА 2
		                              |			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
		                              |				ТОГДА 3
		                              |			ИНАЧЕ 404
		                              |		КОНЕЦ КАК Состояние
		                              |	ИЗ
		                              |		РегистрНакопления.ТоварыКОтгрузке.Остатки(
		                              |				&ДатаОтгрузки,
		                              |				Склад = &Склад
		                              |					И ДокументОтгрузки В
		                              |						(ВЫБРАТЬ
		                              |							ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК ДокументОтгрузки
		                              |						ИЗ
		                              |							Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		                              |						ГДЕ
		                              |							ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку)) КАК РаспоряженияКОтгрузке
		                              |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		                              |			ПО (РаспоряженияКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		                              |					И РаспоряженияКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
		                              |					И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		                              |	ГДЕ &УсловиеТоварыКОтбору) КАК ВложенныйЗапрос
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ВложенныйЗапрос.ДокументОтгрузки,
		                              |	ВложенныйЗапрос.Получатель,
		                              |	ВложенныйЗапрос.Секция
		                              |
		                              |ИМЕЮЩИЕ
		                              |	ВЫБОР
		                              |		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
		                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		                              |		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
		                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		                              |		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
		                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		                              |		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
		                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
		                              |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		                              |	КОНЕЦ В (&Состояния)
		                              |;
		                              |
		                              |////////////////////////////////////////////////////////////////////////////////
		                              |ВЫБРАТЬ
		                              |	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) КАК ТипДокумента,
		                              |	3 КАК ИндексКартинки,
		                              |	РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
		                              |	&ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
		                              |	РаспоряженияИСостояния.Получатель КАК Получатель,
		                              |	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
		                              |	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
		                              |	РаспоряженияИСостояния.Состояние КАК Состояние,
		                              |	1 КАК Порядок,
		                              |	РаспоряженияИСостояния.Секция КАК Секция
		                              |ИЗ
		                              |	РаспоряженияИСостояния КАК РаспоряженияИСостояния
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		                              |		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
		                              |			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
		                              |
		                              |ОБЪЕДИНИТЬ ВСЕ
		                              |
		                              |ВЫБРАТЬ
		                              |	ТИПЗНАЧЕНИЯ(ЗаданиеНаПеревозку.Ссылка),
		                              |	2,
		                              |	ЗаданиеНаПеревозку.Ссылка,
		                              |	ЗаданиеНаПеревозку.Ссылка,
		                              |	НЕОПРЕДЕЛЕНО,
		                              |	"""",
		                              |	ДАТАВРЕМЯ(1, 1, 1),
		                              |	ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка),
		                              |	0,
		                              |	NULL
		                              |ИЗ
		                              |	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
		                              |ГДЕ
		                              |	ЗаданиеНаПеревозку.Ссылка = &ЗаданиеНаПеревозку
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Порядок,
		                              |	Дата";
		
	КонецЕсли;
	
	Если СостояниеОтгрузки = "ОжидаетсяОтбор" Тогда
		Условие = 
		"ГДЕ 
		|	(Итоговый.ОжидаетсяОтбор = Истина)";
	Иначе
		Если  СостояниеОтгрузки = "Набирается" Тогда
			Условие = 
		"ГДЕ 
		|	(Итоговый.Набирается = Истина)";
			Иначе Если  СостояниеОтгрузки = "Набран" Тогда
				Условие = 
		"ГДЕ 
		|	(Итоговый.Набран = Истина)";
				Иначе	Если  СостояниеОтгрузки = "ЧастичноОтгружен" Тогда
					Условие = 
		"ГДЕ 
		|	(Итоговый.ЧастичноОтгружен = Истина)";
					Иначе	Если  СостояниеОтгрузки = "Отгружен" Тогда
						Условие = 
		"ГДЕ 
		|	(Итоговый.Отгружен = Истина)";
						Иначе	Если  СостояниеОтгрузки = "Все" Тогда
							Условие = "";
						ИначеЕсли СостояниеОтгрузки = "НетОтметкиКассы" Тогда
							Условие = 
		"ГДЕ 
		|	(Итоговый.ОтметкаКассы = Ложь)";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ГДЕ &Условие", Условие);
		
	Запрос.Текст = ТекстЗапроса;
	
	// Запомним текущую строку таблицы распоряжений
	Если ЗначениеЗаполнено(Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока) Тогда
		ТекущаяСтрокаРаспоряженияНаОтгрузку = 
			РаспоряженияНаОтгрузку.НайтиПоИдентификатору(Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока);
		Если ТекущаяСтрокаРаспоряженияНаОтгрузку <> Неопределено Тогда
			ТекущееРаспоряжение = ТекущаяСтрокаРаспоряженияНаОтгрузку.Распоряжение;
		КонецЕсли;		
	Иначе
		ТекущееРаспоряжение = Неопределено;
	КонецЕсли;
	
	РаспоряженияНаОтгрузку.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Восстановим текущую строку
	Если ЗначениеЗаполнено(ТекущееРаспоряжение) Тогда
		Строки = РаспоряженияНаОтгрузку.НайтиСтроки(Новый Структура("Распоряжение", ТекущееРаспоряжение));
		Если Строки.Количество() > 0 Тогда
			Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	ИначеЕсли РаспоряженияНаОтгрузку.Количество() > 0 Тогда
		Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока = РаспоряженияНаОтгрузку[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияСервер(ИмяСобытия, СтруктураРаспоряжений)
			
	Если ИмяСобытия = "ИзменениеСписка_ОрдераВРаботе" Тогда
		
		ЗаполнитьРаспоряженияНаОтгрузку(Истина);
		Элементы.ОрдераВРаботе.Обновить();
		
	ИначеЕсли ИмяСобытия = "ИзменениеСписка_ОрдераВРаботе"
		Или ИмяСобытия = "Запись_РасходныйОрдерНаТовары"
		Или ИмяСобытия = "Запись_ОрдерНаПеремещениеТоваров" Тогда 
		
		УстановитьОтборыВОсновныхСписках();
		
	КонецЕсли;
	
	УстановитьОтборыВЗависимыхСписках(СтруктураРаспоряжений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостоянияРаспоряженийНаОтборКлиент()
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостоянияРаспоряженийНаОтбор()	
	Перем ТекущееРаспоряжение;
	
	// Запомним текущую строку
	Идентификатор = Элементы.РаспоряженияНаОтбор.ТекущаяСтрока;
	Если Идентификатор <> Неопределено Тогда
		ЭлементКоллекции = РаспоряженияНаОтбор.НайтиПоИдентификатору(Идентификатор);
		Если ЭлементКоллекции <> Неопределено Тогда
			ЭлементКоллекции.Свойство("Распоряжение", ТекущееРаспоряжение);
		КонецЕсли;
	КонецЕсли;
	
	СкладыСервер.РассчитатьСостоянийРаспоряженийНаОтбор(
		Склад,
	 	Помещение,
		РаспоряженияНаОтбор,
		ОтображениеДеталейОтбор,
		ТекущееЗаданиеНаПеревозкуОтбор,
		СостояниеОтбора);
	
	// Восстановим текущую строку
	Если ЗначениеЗаполнено(ТекущееРаспоряжение) Тогда
		Строки = РаспоряженияНаОтбор.НайтиСтроки(Новый Структура("Распоряжение", ТекущееРаспоряжение));
		Если Строки.Количество() > 0 Тогда
			Элементы.РаспоряженияНаОтбор.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораФильтраОрдеров()
	
	// Добавим ИЛИ удалим из списка выбора поля ФильтрОрдеров элемент "ВсеНеотгруженные"
	// в зависимости от использования статусов ордеров на выбранном складе.
	
	Если Не ДоступноСозданиеРасходныхОрдеров Тогда
		СписокВыбора  = Элементы.ФильтрОрдеровАвтоматическоеФормированиеРасходныхОрдеров.СписокВыбора;
		ЭлементСписокВыбора = Элементы.ФильтрОрдеровАвтоматическоеФормированиеРасходныхОрдеров; 
	Иначе
		СписокВыбора  = Элементы.ФильтрОрдеров.СписокВыбора;
		ЭлементСписокВыбора = Элементы.ФильтрОрдеров;
	КонецЕсли;
	
	ЭлементСписка = СписокВыбора.НайтиПоЗначению("ВсеНеотгруженные");
	
	Если СкладыСервер.ИспользоватьСтатусыОрдеров(Склад, Ложь, Истина) Тогда
		Если ЭлементСписка = Неопределено Тогда
			ЭлементСписка = СписокВыбора.Вставить(1, "ВсеНеотгруженные");
		КонецЕсли;
		ЭлементСписка.Представление = НСтр("ru = 'Все неотгруженные'");
	Иначе
		Если ЭлементСписка <> Неопределено Тогда
			СписокВыбора.Удалить(ЭлементСписка);
			Если ФильтрОрдеров = "ВсеНеотгруженные" Тогда
				ФильтрОрдеров = СписокВыбора[0].Значение; // новый отбор установится позднее, при вызове УстановитьОтборыВЗависимыхСписках
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ДоступноСозданиеРасходныхОрдеров Тогда	
		ЭлементСписка = СписокВыбора.НайтиПоЗначению("ПоТекущемуРаспоряжению");
		Если ЭлементСписка <> Неопределено Тогда
			СписокВыбора.Удалить(ЭлементСписка);	
		КонецЕсли;
		Если ФильтрОрдеров = "ПоТекущемуРаспоряжению" Тогда
			ФильтрОрдеров = СписокВыбора[0].Значение; // новый отбор установится позднее, при вызове УстановитьОтборыВЗависимыхСписках
		КонецЕсли;
	КонецЕсли;
	
	Если СписокВыбора.Количество() = 1 Тогда
		ЭлементСписокВыбора.Видимость = Ложь;
	Иначе
		ЭлементСписокВыбора.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкиОрдеров

&НаСервере
Процедура СоздатьОрдераСервер()
	ТекущийДокумент = Неопределено;
	Если НЕ НазначитьЗонуОтгрузки Тогда
		ЗонаОтгрузки = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	КонецЕсли;
	
	Получатели = Новый Соответствие;
	ЗаданияНаПеревозку = Новый Массив;
	
	СтруктураПараметровСозданияРасходныхОрдеров = СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
	СтруктураПараметровСозданияРасходныхОрдеров.Склад = Склад;
	
	Если ПоОдномуПомещению Тогда
		СтруктураПараметровСозданияРасходныхОрдеров.Помещение = ПомещениеДляСозданияРасходныхОрдеров;
	КонецЕсли;	
	СтруктураПараметровСозданияРасходныхОрдеров.ЗонаОтгрузки = ЗонаОтгрузки;
	
	Для Каждого СтрИД Из Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки Цикл
			
			СтрТабл = РаспоряженияНаОтгрузку.НайтиПоИдентификатору(СтрИД);
			
			Если СтрТабл = Неопределено Тогда
				ТекстПредупреждения = НСтр("ru = 'Выберите распоряжение на отгрузку товаров.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
				Возврат;
			КонецЕсли;
			
			
			    МассивРаспоряжений = Получатели.Получить(СтрТабл.Получатель);
				Если МассивРаспоряжений = Неопределено Тогда
					МассивРаспоряжений = Новый Массив;
					Получатели.Вставить(СтрТабл.Получатель, МассивРаспоряжений);
				КонецЕсли;
				МассивРаспоряжений.Добавить(СтрТабл.Распоряжение);
				
	КонецЦикла;
	
	Если Получатели.Количество() > 0 Тогда
		
		Если ОтображениеДеталейОтгрузка Тогда
			СтруктураПараметровСозданияРасходныхОрдеров.ЗаданиеНаПеревозку = ТекущееЗаданиеНаПеревозкуОтгрузка;
		Иначе
			СтруктураПараметровСозданияРасходныхОрдеров.ЗаданиеНаПеревозку = Неопределено;
		КонецЕсли;
		
		Для Каждого Получатель Из Получатели Цикл
			СтруктураПараметровСозданияРасходныхОрдеров.Получатель = Получатель.Ключ;
			СтруктураПараметровСозданияРасходныхОрдеров.РаспоряженияНаОтгрузку = Получатель.Значение;		
			ОформОрдера = СкладыСервер.ПереоформитьРасходныеОрдера(СтруктураПараметровСозданияРасходныхОрдеров);
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(ТекущийРабочийУчасток) И ОформОрдера.Количество()>0 Тогда
			
			Для каждого Строка из ОформОрдера.ОформленныеОрдера Цикл
				
				Если Не ЗначениеЗаполнено(Строка.РасходныйОрдер.РабочийУчасток) ИЛИ 
					Строка.РасходныйОрдер.РабочийУчасток = ТекущийРабочийУчасток Тогда
					РО = Строка.РасходныйОрдер.ПолучитьОбъект();
					ТекущийДокумент = РО.Ссылка;
					РО.РабочийУчасток = ТекущийРабочийУчасток;
					
					ЗапросТ = Новый Запрос;
					ЗапросТ.Текст = 
					"ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Распоряжение КАК Распоряжение,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
					|ИЗ
					|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Распоряжение КАК Распоряжение,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ИЗ
					|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
					|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
					|ГДЕ
					|	ВЫБОР
					|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
					|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
					|			ИНАЧЕ ИСТИНА
					|		КОНЕЦ";
					
					ЗапросТ.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",РО.ТоварыПоРаспоряжениям.Выгрузить());
					ЗапросТ.УстановитьПараметр("Склад",Склад);
					ЗапросТ.УстановитьПараметр("РабочиеУчастки",ТекущийРабочийУчасток);
					
					РО.ТоварыПоРаспоряжениям.Очистить();
					РО.ТоварыПоРаспоряжениям.Загрузить(ЗапросТ.Выполнить().Выгрузить());

					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
					|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
					|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
					|ИЗ
					|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
					|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
					|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ИЗ
					|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
					|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
					|ГДЕ
					|	ВЫБОР
					|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
					|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
					|			ИНАЧЕ ИСТИНА
					|		КОНЕЦ";
					
					Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",РО.ОтгружаемыеТовары.Выгрузить());
					Запрос.УстановитьПараметр("Склад",Склад);
					Запрос.УстановитьПараметр("РабочиеУчастки",ТекущийРабочийУчасток);
					
					РО.ОтгружаемыеТовары.Очистить();
					РО.ОтгружаемыеТовары.Загрузить(Запрос.Выполнить().Выгрузить());
					
					
					РО.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					РО =  Строка.РасходныйОрдер.Скопировать();
					РО.Дата = ТекущаяДата();
					РО.РабочийУчасток = ТекущийРабочийУчасток;
					ТекущийДокумент = РО.Ссылка;
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
					|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
					|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
					|ИЗ
					|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
					|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
					|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ИЗ
					|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
					|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
					|ГДЕ
					|	ВЫБОР
					|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
					|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
					|			ИНАЧЕ ИСТИНА
					|		КОНЕЦ";
					
					Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",РО.ОтгружаемыеТовары.Выгрузить());
					Запрос.УстановитьПараметр("Склад",Склад);
					Запрос.УстановитьПараметр("РабочиеУчастки",ТекущийРабочийУчасток);
					
					РО.ОтгружаемыеТовары.Очистить();
					РО.ОтгружаемыеТовары.Загрузить(Запрос.Выполнить().Выгрузить());
					
					ЗапросТ = Новый Запрос;
					ЗапросТ.Текст = 
					"ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Распоряжение КАК Распоряжение,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
					|ИЗ
					|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Распоряжение КАК Распоряжение,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ИЗ
					|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
					|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
					|ГДЕ
					|	ВЫБОР
					|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
					|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
					|			ИНАЧЕ ИСТИНА
					|		КОНЕЦ";
					
					ЗапросТ.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",РО.ТоварыПоРаспоряжениям.Выгрузить());
					ЗапросТ.УстановитьПараметр("Склад",Склад);
					ЗапросТ.УстановитьПараметр("РабочиеУчастки",ТекущийРабочийУчасток);
					
					РО.ТоварыПоРаспоряжениям.Очистить();
					РО.ТоварыПоРаспоряжениям.Загрузить(ЗапросТ.Выполнить().Выгрузить());

					РО.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		КонецЕсли;

	
	УстановитьОтборыВОсновныхСписках();
	
	Если ФильтрОрдеров = "ПоТекущемуРаспоряжению" Тогда
		Если ТипЗнч(ТекущееРаспоряжениеНаОтгрузку) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", Неопределено,,,Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ЗаданиеНаПеревозку", ТекущееРаспоряжениеНаОтгрузку,,,Истина);
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
			|ГДЕ
			|	(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
			|			ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ЗаданиеНаПеревозку = &Распоряжение)";
			Запрос.УстановитьПараметр("Распоряжение", ТекущееРаспоряжениеНаОтгрузку);
			РасходныеОрдера = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", РасходныеОрдера, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "ЗаданиеНаПеревозку", Неопределено,,,Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьФормированиеОрдеров()
	
	СтруктураПараметровСозданияРасходныхОрдеров = СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
	СтруктураПараметровСозданияРасходныхОрдеров.Склад = Склад;
	Получатели = ПолучателиПоКоторымНетФоновогоЗаданияПереоформленияОрдеров(Склад);
	ЕстьОшибка = Ложь;
	Для Каждого Получатель Из Получатели Цикл
		СтруктураПараметровСозданияРасходныхОрдеров.Получатель = Получатель;
		СтруктураВозврата = СкладыСервер.ПереоформитьРасходныеОрдера(СтруктураПараметровСозданияРасходныхОрдеров);
		ЕстьОшибка = СтруктураВозврата.ЕстьОшибка Или ЕстьОшибка;
	КонецЦикла;
	
	Если ЕстьОшибка Тогда
		
		Элементы.АвтоматическоеФормированиеРасходныхОрдеров.ТекущаяСтраница = 
		Элементы.СтраницаПроблема;
		
	Иначе
		Элементы.АвтоматическоеФормированиеРасходныхОрдеров.ТекущаяСтраница = 
		Элементы.СтраницаНетПроблем;	
	КонецЕсли;
	
	УстановитьОтборыВОсновныхСписках();
	
КонецПроцедуры

&НаСервере
Функция УстановитьЗоныОтгрузкиСервер(Знач МассивДокументов)

	МассивИзмененныхДокументов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.ЗонаОтгрузки <> &ЗонаОтгрузки
	|	И РасходныйОрдерНаТовары.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрдерНаПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ОрдерНаПеремещениеТоваров КАК ОрдерНаПеремещениеТоваров
	|ГДЕ
	|	ОрдерНаПеремещениеТоваров.ЗонаОтгрузки <> &ЗонаОтгрузки
	|	И ОрдерНаПеремещениеТоваров.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("ЗонаОтгрузки", ЗонаОтгрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокументОбъект.Заблокировать();
			
			ДокументОбъект.ЗонаОтгрузки = ЗонаОтгрузки;
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			МассивИзмененныхДокументов.Добавить(Выборка.Ссылка);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	Элементы.ОрдераВРаботе.Обновить();
	
	Возврат МассивИзмененныхДокументов;
	
КонецФункции

&НаСервере
Функция НазначитьПриоритетОтгрузкиСервер(Знач МассивДокументов, Приоритет)
	
	МассивИзмененныхДокументов = Новый Массив;
	
    Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Приоритет <> &Приоритет
	|	И РасходныйОрдерНаТовары.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрдерНаПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ОрдерНаПеремещениеТоваров КАК ОрдерНаПеремещениеТоваров
	|ГДЕ
	|	ОрдерНаПеремещениеТоваров.Приоритет <> &Приоритет
	|	И ОрдерНаПеремещениеТоваров.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокументОбъект.Заблокировать();
			
			ДокументОбъект.Приоритет = Приоритет;
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			МассивИзмененныхДокументов.Добавить(Выборка.Ссылка);
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	Элементы.ОрдераВРаботе.Обновить();
	
	Возврат МассивИзмененныхДокументов;
	
КонецФункции

&НаСервере
Функция ОрдераИзменитьСтатусСервер(МассивДокументовДляОбработки, СтатусДокумента)
	
	МассивИзмененныхДокументов = Новый Массив;
	
	ЗаменитьЗаданияНаПеревозкуСсылкамиНаРасходныеОрдераВМассиве(МассивДокументовДляОбработки);
	
	МассивДокументов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивДокументовДляОбработки);
	
	Индекс = МассивДокументов.Количество();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТовары.Проведен КАК Проведен,
	|	РасходныйОрдерНаТовары.Статус КАК Статус,
	|	ВЫБОР
	|		КОГДА НастройкиАдресныхСкладов.ИспользоватьАдресноеХранение
	|				И РасходныйОрдерНаТовары.ДатаОтгрузки >= НастройкиАдресныхСкладов.ДатаНачалаАдресногоХраненияОстатков
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьАдресноеХранение
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиАдресныхСкладов КАК НастройкиАдресныхСкладов
	|		ПО (НастройкиАдресныхСкладов.Склад = РасходныйОрдерНаТовары.Склад)
	|			И (НастройкиАдресныхСкладов.Помещение = РасходныйОрдерНаТовары.Помещение)
	|ГДЕ
	|	РасходныйОрдерНаТовары.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрдерНаПеремещениеТоваров.Ссылка,
	|	ОрдерНаПеремещениеТоваров.Проведен,
	|	ОрдерНаПеремещениеТоваров.Статус,
	|	ВЫБОР
	|		КОГДА НастройкиАдресныхСкладов.ИспользоватьАдресноеХранение
	|				И ОрдерНаПеремещениеТоваров.ДатаОтгрузки >= НастройкиАдресныхСкладов.ДатаНачалаАдресногоХраненияОстатков
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.ОрдерНаПеремещениеТоваров КАК ОрдерНаПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиАдресныхСкладов КАК НастройкиАдресныхСкладов
	|		ПО (НастройкиАдресныхСкладов.Склад = ОрдерНаПеремещениеТоваров.Склад)
	|			И (НастройкиАдресныхСкладов.Помещение = ОрдерНаПеремещениеТоваров.ПомещениеОтправитель)
	|ГДЕ
	|	ОрдерНаПеремещениеТоваров.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	ТаблицаДанныхДокументов = Запрос.Выполнить().Выгрузить();
	
	Пока Индекс > 0 Цикл
		Индекс = Индекс - 1;
		СтрМас = МассивДокументов[Индекс];
		
		РеквизитыДокумента = ТаблицаДанныхДокументов.Найти(СтрМас,"Ссылка");
		
		Если Не РеквизитыДокумента.Проведен Тогда
			ТекстСообщения = НСтр("ru = 'Статус документа %Документ% не изменен: групповой обработкой можно изменять статусы только для проведенных документов.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", СтрМас);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			МассивДокументов.Удалить(Индекс);
		ИначеЕсли СтатусДокумента = "Отгружен"
			И ТипЗнч(СтрМас) <> Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			ТекстСообщения = НСтр("ru = 'Статус документа %Документ% не изменен: статус %Отгружен% может быть установлен только для расходных ордеров.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", СтрМас);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Отгружен%", Перечисления.СтатусыРасходныхОрдеров.Отгружен);
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			МассивДокументов.Удалить(Индекс);
		Иначе
			Если ТипЗнч(СтрМас) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
				СтатусЗначениеПеречисления = Перечисления.СтатусыРасходныхОрдеров[СтатусДокумента];
			Иначе
				СтатусЗначениеПеречисления = Перечисления.СтатусыОрдеровНаПеремещение[СтатусДокумента];
			КонецЕсли;
			
			Если РеквизитыДокумента.Статус = СтатусЗначениеПеречисления Тогда
				
				ТекстСообщения = НСтр("ru = 'Статус документа %Документ% не изменен, т.к. документ уже находится в статусе %Статус%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", СтрМас);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Статус%", СтатусЗначениеПеречисления);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				МассивДокументов.Удалить(Индекс);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивДокументов = СкладыСервер.ПроверитьОрдераНаВозможностьИзмененияСтатуса(МассивДокументов);
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат МассивИзмененныхДокументов;
	КонецЕсли;
	
	Индекс = МассивДокументов.Количество();
	
	Пока Индекс > 0 Цикл
		
		Индекс = Индекс - 1;
		ДокСсылка = МассивДокументов[Индекс];
		
		МожноИзменитьСтатусБезПерезаполнения = Ложь;
		
		РеквизитыДокумента = ТаблицаДанныхДокументов.Найти(ДокСсылка,"Ссылка");
		
		Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			СтатусЗначениеПеречисления = Перечисления.СтатусыРасходныхОрдеров[СтатусДокумента];
			
			Если Не РеквизитыДокумента.ИспользоватьАдресноеХранение
				ИЛИ (РеквизитыДокумента.Статус = Перечисления.СтатусыРасходныхОрдеров.КПроверке
						ИЛИ РеквизитыДокумента.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен
						ИЛИ РеквизитыДокумента.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке
						ИЛИ РеквизитыДокумента.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен)
					И (СтатусЗначениеПеречисления = Перечисления.СтатусыРасходныхОрдеров.Проверен
						ИЛИ СтатусЗначениеПеречисления = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке
						ИЛИ СтатусЗначениеПеречисления= Перечисления.СтатусыРасходныхОрдеров.Отгружен)
				ИЛИ (РеквизитыДокумента.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен
					И СтатусЗначениеПеречисления = Перечисления.СтатусыРасходныхОрдеров.КОтбору) Тогда
				
				МожноИзменитьСтатусБезПерезаполнения = Истина;
			КонецЕсли;
		Иначе
			СтатусЗначениеПеречисления = Перечисления.СтатусыОрдеровНаПеремещение[СтатусДокумента];
			Если Не РеквизитыДокумента.ИспользоватьАдресноеХранение
				ИЛИ РеквизитыДокумента.Статус = Перечисления.СтатусыОрдеровНаПеремещение.КПроверке
					И СтатусЗначениеПеречисления = Перечисления.СтатусыОрдеровНаПеремещение.КОтгрузке Тогда
				
				МожноИзменитьСтатусБезПерезаполнения = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если МожноИзменитьСтатусБезПерезаполнения Тогда
			Попытка
				ДокументОбъект = ДокСсылка.ПолучитьОбъект();
				ДокументОбъект.Заблокировать();
			Исключение
				МассивДокументов.Удалить(Индекс);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				Продолжить;
			КонецПопытки;
			
			ДокументМенеджер = Документы[ДокументОбъект.Метаданные().Имя];
			ДокументОбъект.Статус = СтатусЗначениеПеречисления;
			
			Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
				ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
										НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект,ДокументМенеджер).ОтгружаемыеТовары);
			Иначе
				ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
										НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект,ДокументМенеджер));
			КонецЕсли;
									
			Если СтатусЗначениеПеречисления = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
				// Для ордеров на перемещение дата меняется при установке статуса "Принят"
				ДокументОбъект.ДатаОтгрузки = ТекущаяДатаСеанса();
			ИначеЕсли СтатусЗначениеПеречисления = Перечисления.СтатусыРасходныхОрдеров.КОтбору Тогда
				НоменклатураСервер.ЗаполнитьСерииПоFEFO(ДокументОбъект, ПараметрыУказанияСерий, Ложь); 
			КонецЕсли;                                          
			
			ДокументМенеджер.ЗаполнитьДействиеВСтроках(ДокументОбъект);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий);
			
			Если ДокументОбъект.ПроверитьЗаполнение() Тогда
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					МассивИзмененныхДокументов.Добавить(ДокСсылка);
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
			Иначе
				МассивСообщений = ПолучитьСообщенияПользователю(Истина);
				ТекстСообщения = НСтр("ru='Статус документа %ОрдерСсылка% не изменен, т.к. есть ошибки заполнения.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%ОрдерСсылка%",ДокументОбъект.Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ДокументОбъект.Ссылка);
				Для Каждого Сообщение Из МассивСообщений Цикл
					Сообщение.Сообщить();
				КонецЦикла;
			КонецЕсли;
			МассивДокументов.Удалить(Индекс);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		УстановитьОтборыВОсновныхСписках();
		Возврат МассивИзмененныхДокументов;
	КонецЕсли;
	
	МассивПерезаполненныхДокументов = ЗаполнитьОрдераОтобраннымиТоварамиСервер(МассивДокументов, Истина, СтатусДокумента);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивИзмененныхДокументов,МассивПерезаполненныхДокументов);
	
	УстановитьОтборыВОсновныхСписках();
	
	Возврат МассивИзмененныхДокументов;
	
КонецФункции

&НаСервере
Процедура ЗаменитьЗаданияНаПеревозкуСсылкамиНаРасходныеОрдераВМассиве(МассивДокументов)
	
	Если Не СкладыСервер.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку(Склад) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
	|	И РасходныйОрдерНаТовары.Проведен
	|	И РасходныйОрдерНаТовары.ЗаданиеНаПеревозку В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрдерНаПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ОрдерНаПеремещениеТоваров КАК ОрдерНаПеремещениеТоваров
	|ГДЕ
	|	ОрдерНаПеремещениеТоваров.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов",МассивДокументов);
	
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПользователяОбУстановкеСтатусаОрдеров(КоличествоОбработанных, КоличествоВсего, Статус)
	
	Если КоличествоОбработанных > 0 Тогда
		
		ТекстСообщения = НСтр("ru='Для %КоличествоОбработанных% из %КоличествоВсего% выделенных в списке ордеров на отгрузку товаров установлен статус ""%Статус%""'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоОбработанных%", КоличествоОбработанных);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоВсего%",        КоличествоВсего);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Статус%",                 Статус);
		ТекстЗаголовка = НСтр("ru='Статус ""%Статус%"" установлен'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Статус%", Статус);
		ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='Статус ""%Статус%"" не установлен ни для одного ордера на отгрузку'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Статус%", Статус);
		ТекстЗаголовка = НСтр("ru='Статус ""%Статус%"" не установлен'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Статус%", Статус);
		ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьОрдераОтобраннымиТоварамиСервер(МассивДокументов, ИзменениеСтатуса, СтатусДокумента = Неопределено)
	
	ЗаменитьЗаданияНаПеревозкуСсылкамиНаРасходныеОрдераВМассиве(МассивДокументов);
	
	ПараметрыЗаполнения = СкладыСервер.ПараметрыЗаполненияОрдеровОтобраннымиТоварами();
	ПараметрыЗаполнения.РежимЗаполнения   = "Множественное";	
	ПараметрыЗаполнения.ИзменениеСтатуса  = ИзменениеСтатуса;	
	ПараметрыЗаполнения.СтатусДокумента   = СтатусДокумента;	
	ПараметрыЗаполнения.МассивДокументов  = МассивДокументов;	
	
	Возврат СкладыСервер.ЗаполнитьОрдераОтобраннымиТоварами(ПараметрыЗаполнения);
	
КонецФункции

&НаСервере
Процедура НазначитьЗаданиеНаПеревозкуСервер(ЗаданиеНаПеревозку, ДополнительныеПараметры)
	
	ОбрабатываемыеОрдера = ДополнительныеПараметры.Ордера;
	НеобработанныеОрдера = ДополнительныеПараметры.НеобработанныеОрдера;
	
	СписокОрдеров = Элементы.ОрдераВРаботе;
	СтатусЗадания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаданиеНаПеревозку, "Статус");
	
	ОповеститьОбОшибкахВыбораЗаданияНаПеревозку(НеобработанныеОрдера);
	
	СтатусОтгружено = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	
	Для Каждого Ордер Из ОбрабатываемыеОрдера Цикл
		
		Если Ордер.Статус <> СтатусОтгружено
			И (СтатусЗадания = Перечисления.СтатусыЗаданийНаПеревозку.Отправлено
				Или СтатусЗадания = Перечисления.СтатусыЗаданийНаПеревозку.Закрыто) Тогда
			
			ТекстСообщения = НСтр("ru = 'Выбранное задание на перевозку находится в статусе ""%СтатусЗадания%"", поэтому его нельзя указать в ордере ""%Документ%"", который находится в статусе ""%СтатусОрдера%"". Измените статус ордера на ""%СтатусОтгружено%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусЗадания%", 	СтатусЗадания);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", 			Ордер.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусОрдера%", 		Ордер.Статус);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусОтгружено%", 	СтатусОтгружено);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
			
		КонецЕсли;
		
		Попытка
			ДокументОбъект = Ордер.Ссылка.ПолучитьОбъект();
			
			ДокументОбъект.Заблокировать();
			
			ДокументОбъект.ЗаданиеНаПеревозку 	= ЗаданиеНаПеревозку;
			ДокументОбъект.ПорядокДоставки 		= ДоставкаТоваров.ПорядокДоставкиВЗаданииНаПеревозку(ЗаданиеНаПеревозку,
				ДокументОбъект.Получатель);
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	Элементы.ОрдераВРаботе.Обновить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОповеститьОбОшибкахВыбораЗаданияНаПеревозку(НеобработанныеОрдера)
	
	Для Каждого Ордер Из НеобработанныеОрдера Цикл
		
		Если Не Ордер.ОтгрузкаПоЗаданиюНаПеревозку
			Или ТипЗнч(Ордер.Ссылка) <> Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			
			ТекстСообщения = НСтр("ru = 'Для ордера ""%Документ%"" не требуется доставка.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Ордер.Ссылка);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкиЗаданий

&НаСервере
Процедура ПодготовитьНоменклатуруДляЗаданийСервер(Знач МассивРаспоряжений,
												Переупаковка = Ложь,
												ПоРаспоряжениямТребуетсяПодпитка = Ложь)
	
	СтруктураПараметров = СкладыСервер.СтруктураПараметровСозданияЗаданийНаОтборПодпитку();
	СтруктураПараметров.Склад = Склад;
	СтруктураПараметров.Помещение = Помещение;
	СтруктураПараметров.НастройкаФормированияПоРабочимУчасткам = НастройкаФормированияПоРабочимУчасткам;
	СтруктураПараметров.ОграничиватьПоВесу = ОграничиватьПоВесу;
	СтруктураПараметров.ОграничиватьПоОбъему = ОграничиватьПоОбъему;
	СтруктураПараметров.ОграничениеПоВесу = ОграничениеПоВесу;
	СтруктураПараметров.ОграничениеПоОбъему = ОграничениеПоОбъему;
	СтруктураПараметров.РабочийУчасток = РабочийУчасток;
	СтруктураПараметров.Исполнитель = Исполнитель;
	СтруктураПараметров.ПоВсемРаспоряжениям = ПоВсемРаспоряжениям = 0;
	СтруктураПараметров.ПоРаспоряжениямТребуетсяПодпитка = ПоРаспоряжениямТребуетсяПодпитка; // используется только при создании заданий на переупаковку.
	СтруктураПараметров.ДействиеПриНехваткеУпаковок = ЗаданияНаПереупаковку; // используется только при создании заданий на отбор
																						// 0 - создать только задания на отбор
																						// 1 - создать задания на отбор и переупаковку
																						// 2 - создать только задания на переупаковку.
	Если НазначитьИсполнителя Тогда
		СтруктураПараметров.Исполнитель = Исполнитель;
	КонецЕсли;
	Если ПоВсемРаспоряжениям <> 0 Тогда
		СтруктураПараметров.МассивРаспоряжений = МассивРаспоряжений;
	КонецЕсли;
	
	Если Переупаковка Тогда
		СкладыСервер.СоздатьЗаданияНаПереупаковку(СтруктураПараметров);
	Иначе
		СкладыСервер.СоздатьЗаданияНаОтбор(СтруктураПараметров);
	КонецЕсли;
	УстановитьОтборыВОсновныхСписках();
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданияНаКлиенте(Переупаковка = Ложь)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	ПроверитьСкладПомещение(Отказ);
	
	Если Не Отказ Тогда
		
		МассивДокументов = Новый Массив;
		
		ПоРаспоряжениямТребуетсяПодпитка = Ложь;
		СостояниеТребуетсяПодпитка       = ПредопределенноеЗначение(
			"Перечисление.СостоянияРаспоряженийНаОтборТоваров.ТребуетсяПодпитка");
		
		Для каждого СтрМас Из Элементы.РаспоряженияНаОтбор.ВыделенныеСтроки Цикл
			МассивДокументов.Добавить(Элементы.РаспоряженияНаОтбор.ДанныеСтроки(СтрМас).Распоряжение);
			
			ПоРаспоряжениямТребуетсяПодпитка =
				Элементы.РаспоряженияНаОтбор.ДанныеСтроки(СтрМас).Состояние = СостояниеТребуетсяПодпитка;
		КонецЦикла;
		
		Если МассивДокументов.Количество() > 0 Тогда
			
			СтруктураОперации = Новый Структура;
			СтруктураОперации.Вставить("Помещение",Помещение);
			СтруктураОперации.Вставить("Склад",Склад);
			
			ФормаПараметры = Новый Структура("Заголовок, Операция, ПараметрОбъект");
			ФормаПараметры.Вставить("Заголовок", "УправлениеОтгрузкой");
			ФормаПараметры.Вставить("Операция", ?(Переупаковка, "ЗаданияНаПереупаковку", "ФормированиеЗаданий"));
			ФормаПараметры.Вставить("ПараметрОбъект", СтруктураОперации);
			
			Ответ = Неопределено;
			
			ПараметрыОповещения = Новый Структура("Переупаковка, МассивДокументов, ПоРаспоряжениямТребуетсяПодпитка",
												Переупаковка, МассивДокументов, ПоРаспоряжениямТребуетсяПодпитка И Переупаковка);
			ОписаниеОповещения  = Новый ОписаниеОповещения("СоздатьЗаданияНаКлиентеЗавершение", ЭтотОбъект, ПараметрыОповещения);
			
			ОткрытьФорму("Документ.ОтборРазмещениеТоваров.Форма.ФормаНастроек", ФормаПараметры,ЭтаФорма, , , ,
				ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданияНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.УправлениеОтгрузкой.Форма.Оповещение.СоздатьЗаданияНаКлиентеЗавершение");
	
	Переупаковка = ДополнительныеПараметры.Переупаковка;
	МассивДокументов = ДополнительныеПараметры.МассивДокументов;
	ПоРаспоряжениямТребуетсяПодпитка = ДополнительныеПараметры.ПоРаспоряжениямТребуетсяПодпитка;
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ПодготовитьНоменклатуруДляЗаданийСервер(МассивДокументов, Переупаковка, ПоРаспоряжениямТребуетсяПодпитка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура КонтрольРаботыФоновыхЗаданийФормированияОчереди()
	
	Получатели = ПолучателиПоКоторымНетФоновогоЗаданияПереоформленияОрдеров(Склад);
	
	Если Получатели.Количество() > 0 Тогда
		
		Элементы.АвтоматическоеФормированиеРасходныхОрдеров.ТекущаяСтраница = 
			Элементы.СтраницаПроблема;
			
	Иначе
		Элементы.АвтоматическоеФормированиеРасходныхОрдеров.ТекущаяСтраница = 
			Элементы.СтраницаНетПроблем;	
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучателиПоКоторымНетФоновогоЗаданияПереоформленияОрдеров(Склад)
	Возврат СкладыСервер.ПолучателиПоКоторымНетФоновогоЗаданияПереоформленияОрдеров(Склад);	
КонецФункции

&НаКлиенте
Процедура ПроверитьСкладПомещение(Отказ)
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ТекстСообщения = НСтр("ru='Перед выполнением операции необходимо выбрать склад.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  УменьшитьОрдераСервер(МассивДокументов)
	
	МассивИзмененныхДокументов = ЗаполнитьОрдераОтобраннымиТоварамиСервер(МассивДокументов, Ложь);
	УстановитьОтборыВОсновныхСписках();
	
	Возврат МассивИзмененныхДокументов;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьПомещений()
	
	ИспользоватьСкладскиеПомещения = СкладыСервер.ИспользоватьСкладскиеПомещения(Склад,,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеОтбораПриИзменении(Элемент)
		
	СостояниеОтбораПриИзмененииНаСервере();
	
КонецПроцедуры
	
&НаСервере
Процедура СостояниеОтбораПриИзмененииНаСервере()
	
	ОбновитьСостоянияРаспоряженийНаОтбор();
	Элементы.ЗаданияВРаботе.Обновить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Производительность

&НаКлиенте
Процедура ОрдераВРаботеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.УправлениеОтгрузкой.Форма.Элемент.ОрдераВРаботе.Выбор");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТоварыПриИзменении(Элемент)
	Элементы.Группа4.Видимость = ОтображатьТовары;
КонецПроцедуры

Процедура ЗаполнитьТовары(ЭтоОрдер,СсылкаНаДокумент)
	
	Если ЭтоОрдер Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество
		|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
		|ИЗ
		|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
		|ИЗ
		|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
		|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",СсылкаНаДокумент.ОтгружаемыеТовары.Выгрузить());
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("РабочиеУчастки",СсылкаНаДокумент.РабочийУчасток);
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
		|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК Количество,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|			,
		|			ДокументОтгрузки = &РаспоряжениеНаОтгрузку
		|				И Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ТоварыКОтгрузкеОстатки.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
		|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("РаспоряжениеНаОтгрузку",СсылкаНаДокумент);
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("РабочиеУчастки",ТекущийРабочийУчасток);
        Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьТекОрдера(СсылкаНаДокумент)

	ОрдераПоТекущемуРаспоряжению.Отбор.Элементы.Очистить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераПоТекущемуРаспоряжению, "Распоряжение", СсылкаНаДокумент,,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеУчасткиПриИзменении(Элемент)
	ОтображениеДеталейОтгрузка = Ложь;
	СкладПомещениеПриИзмененииСервер();
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоНомеруПриИзменении(Элемент)
	УстановитьОтборыВОсновныхСписках();
	УстановитьОтборыВЗависимыхСписках(ТекущиеРаспоряжения());
КонецПроцедуры

&НаКлиенте
Процедура ПоТекРаспоряжениюПриИзменении(Элемент)
	Элементы.ОрдераПоТекущемуРаспоряжению.Видимость = ПоТекРаспоряжению;
КонецПроцедуры

&НаКлиенте
Процедура ОрдераПоТекущемуРаспоряжениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
КонецПроцедуры

#КонецОбласти
