
&НаКлиенте
Процедура Док_ОтборыПравоеЗначениеНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Строка = Элементы.Отборы.ТекущиеДанные;
	
	Если Строка.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен") Тогда      
		Элементы.ОтборыПравоеЗначение.РежимВыбораИзСписка = Истина;
	    Элементы.ОтборыПравоеЗначение.СписокВыбора.Очистить();
	    Элементы.ОтборыПравоеЗначение.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокВидовЦен());
	КонецЕсли;	
	УстановитьПараметрыРедактирования(Строка);
	
	Если ВыборПереопределен(Строка, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидовЦен() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЦен.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен.ЭтоГруппа
		|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыЦен.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
