#Область HTTPСервисы

Функция ДанныеПоНомеруТелефонаGetInfoByTel(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Ответ.Заголовки.Вставить("Content-Type", "text/html");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "OPTIONS, GET"); 
	
	Партнер= Неопределено;
	
	Если Запрос.ПараметрыЗапроса.Количество() > 0 Тогда
		НомерТелефона= Запрос.ПараметрыЗапроса.Получить("tel");
		REF= Запрос.ПараметрыЗапроса.Получить("ref");
		
		Если Не ПустаяСтрока(REF) Тогда
			Партнер= АльтерраОбщегоНазначения.ПолучитьпартнераПоСсылке(REF);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Партнер) И ПустаяСтрока(НомерТелефона) Тогда
			Возврат ПодготовитьHTTPОтвет("Передан пустой номер телефона");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Партнер) Тогда
			ТЗ= АльтерраОбщегоНазначения.ПолучитьДанныеКлиентаПоТелефону(НомерТелефона);
		Иначе
			ТЗ= АльтерраОбщегоНазначения.ПолучитьДанныеПартнера(Партнер);
		КонецЕсли;
		
		Если ТЗ.Количество() > 0 Тогда
			//стрJSON= АльтерраОбщегоНазначения.СформироватьСтрокуJSON(ТЗ);
			мДанные= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
			
			Ответ= ПодготовитьHTTPОтвет("", мДанные);
		Иначе
			Ответ= ПодготовитьHTTPОтвет("Клиент не найден")
		КонецЕсли;
		
	Иначе
		Ответ= ПодготовитьHTTPОтвет("Переданы пустые параметры");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;
КонецФункции

Функция ПолучитьТелефонПоПочтеGetTelByEmale(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
		Ответ.УстановитьТеломСтроки("Переданы пустые параметры", КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	Почта= Запрос.ПараметрыЗапроса.Получить("emale");
	Если ПустаяСтрока(Почта) Тогда
		Ответ.УстановитьТелоИзСтроки("Передан пустой адрес электронной почты", КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	Партнер= АльтерраОбщегоНазначения.ПолучитьПартнераПоПочте(Почта);
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		Ответ.УстановитьТелоИзСтроки("Клиент не найден", КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	ТЗ= АльтерраОбщегоНазначения.ПолучитьДанныеПартнера(Партнер);
	Если ТЗ.Количество() > 0 Тогда
		стрJSON= АльтерраОбщегоНазначения.СформироватьСтрокуJSON(ТЗ);
		
		Ответ.УстановитьТелоИзСтроки(стрJSON, КодировкаТекста.UTF8);
		Возврат Ответ;
	Иначе
		Ответ.УстановитьТелоИзСтроки("Не удалось получить информацию о клиенте", КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
КонецФункции

Функция ОтдатьИнформациюПоЗонамДоставкиgetZones(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	стрJSON= ПолучитьJSON();
	Ответ.УстановитьТелоИзСтроки(стрJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
КонецФункции

Функция ОтдатьИнформациюПоЗонамДоставкиgetZonesCommon(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);

	Парам= Обработки.КартографическийИнтерфейсДоставка.ПолучитьСтруктуруПараметров();
	Парам.Вставить("ОткрытИзДокумента", Ложь);
	Парам.Вставить("ВидДоставки", Перечисления.ВидыДоставокДоКлиента.Розничная);
	
	стрJSON= Обработки.КартографическийИнтерфейсДоставка.ПолучитьJSON(Парам);
	
	Ответ.УстановитьТелоИзСтроки(стрJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
	
КонецФункции

Функция ДанныеПартнераПоИДGetInfoByID(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
		Ответ= ПодготовитьHTTPОтвет("Переданы пустые параметры");
		Возврат Ответ;
	КонецЕсли;
	
	ИД= Запрос.ПараметрыЗапроса.Получить("ID");
	Если ПустаяСтрока(ИД) Тогда
		Ответ= ПодготовитьHTTPОтвет("Передан пустой ИД");
		Возврат Ответ;
	КонецЕсли;
	
	Партнер= АльтерраОбщегоНазначения.ПолучитьпартнераПоСсылке(ИД);
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		Ответ= ПодготовитьHTTPОтвет("Клиент не найден");
		Возврат Ответ;
	КонецЕсли;
	
	ТЗ= АльтерраОбщегоНазначения.ПолучитьТелефонПочтуПартнера(Партнер);
	Если ТЗ.Количество() > 0 Тогда
		ТЗ.Колонки.Удалить("Партнер");
		
		//стрJSON= АльтерраОбщегоНазначения.СформироватьСтрокуJSON(ТЗ);
		//Ответ.УстановитьТелоИзСтроки(стрJSON, КодировкаТекста.UTF8);
		мДанные= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
		Ответ= ПодготовитьHTTPОтвет("", мДанные);
		Возврат Ответ;
	Иначе
		Ответ= ПодготовитьHTTPОтвет("Не удалось получить информацию о клиенте");
		Возврат Ответ;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
	
КонецФункции

Функция PayOrder(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
		Ответ.УстановитьТелоИзСтроки("Переданы пустые параметры", КодировкаТекста.UTF8);
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Переданы пустые параметры");
		Возврат Ответ;
	КонецЕсли;
	
	ИД = Запрос.ПараметрыЗапроса.Получить("XML_ID");
	СуммаОплаты = Число(Запрос.ПараметрыЗапроса.Получить("SUMMA"));
	
	Если ПустаяСтрока(ИД) Тогда
		Ответ.УстановитьТелоИзСтроки("Передан пустой XML_ID", КодировкаТекста.UTF8);
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Передан пустой XML_ID");
		Возврат Ответ;
	КонецЕсли;
	
	Если СтрДлина(ИД) > 7 Тогда
		Попытка
			УИД = Новый УникальныйИдентификатор(ИД);
		Исключение
			Ответ.УстановитьТелоИзСтроки("Не верный УИД", КодировкаТекста.UTF8);
			ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Не верный УИД");
			Возврат Ответ;
		КонецПопытки;
		
		Заказ = Документы.ЗаказКлиента.ПолучитьСсылку(УИД);
	Иначе
		Заказ = НайтиЗаказПоНомеруССайта(ИД);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Ответ.УстановитьТелоИзСтроки("Заказ не найден", КодировкаТекста.UTF8);
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Заказ не найден");
		Возврат Ответ;
	КонецЕсли;
	
	Если Не Заказ.Проведен Тогда
		Ответ.УстановитьТелоИзСтроки("Заказ не проведен", КодировкаТекста.UTF8);
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Заказ не проведен");
		Возврат Ответ;
	КонецЕсли;
	
	ЭквайринговыйТерминал = Документы.ОперацияПоПлатежнойКарте.ПолучитьТерминалССайтаПоУмолчанию();
	Эквайринг = Документы.ОперацияПоПлатежнойКарте.ПолучитьЭквайринговуюОперацию(Заказ, ЭквайринговыйТерминал);
	Если Не ЗначениеЗаполнено(Эквайринг) Тогда
		Ответ.УстановитьТелоИзСтроки("Нет эквайринговой операции к оплате", КодировкаТекста.UTF8);
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Нет эквайринговой операции к оплате");
		Возврат Ответ;
	КонецЕсли;
	
	Если Эквайринг.Проведен Тогда
		Ответ.УстановитьТелоИзСтроки("Эквайринг уже проведен", КодировкаТекста.UTF8);
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Эквайринг уже проведен");
		Возврат Ответ;
	КонецЕсли;
	
	Если СуммаОплаты <= 0 Тогда
		Ответ.УстановитьТелоИзСтроки("Сумма равна нулю", КодировкаТекста.UTF8);
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Сумма равна нулю");
		Возврат Ответ;
	КонецЕсли;
	
	//Если Эквайринг.СуммаДокумента <> СуммаОплаты Тогда
	//	Ответ.УстановитьТелоИзСтроки("Не совпадает сумма оплаты", КодировкаТекста.UTF8);
	//	Возврат Ответ;
	//КонецЕсли;
	
	Док = Эквайринг.ПолучитьОбъект();
	Док.Комментарий = Док.Комментарий + " Оплачена на сайте.";
	Док.Дата = ТекущаяДата();
	
	ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Док, СуммаОплаты, Ложь);
	Док.СуммаДокумента = Док.РасшифровкаПлатежа.Итог("Сумма");
	
	Попытка
		//Док.Записать(РежимЗаписиДокумента.Запись);
		Док.НомерПлатежнойКарты = "0202";
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
		Ответ.УстановитьТелоИзСтроки("Эквайринг проведен!", КодировкаТекста.UTF8);
		
		Попытка
			АльтерраОбщегоНазначения.ОтправитьСМСПоИнтернетЗаказу(Заказ);
			АльтерраОбщегоНазначения.ОтправитьОповещениеБ24ПоИнтернетЗаказу(Заказ);
		Исключение
			ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить сообщение в Битрикс24");
		КонецПопытки;
		
		Возврат Ответ;
	Исключение
		Ответ.УстановитьТелоИзСтроки("Ошибка записи Эквайринга", КодировкаТекста.UTF8);
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, ,	ИнформацияОбОшибке().Описание, "Ошибка записи Эквайринга");
		Возврат Ответ;
	КонецПопытки;		
	
	Ответ.УстановитьТелоИзСтроки("Неизвестная ситуация", КодировкаТекста.UTF8);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;
КонецФункции

Функция GetBarcode(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
		Ответ.УстановитьТелоИзСтроки("0", КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	ИД= Запрос.ПараметрыЗапроса.Получить("XML_ID");
	
	Если ПустаяСтрока(ИД) Тогда
		Ответ.УстановитьТелоИзСтроки("0", КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	Если СтрДлина(ИД) > 7 Тогда
		Попытка
			УИД= Новый УникальныйИдентификатор(ИД);
		Исключение
			Ответ.УстановитьТелоИзСтроки("0", КодировкаТекста.UTF8);
			Возврат Ответ;
		КонецПопытки;
		
		Заказ= Документы.ЗаказКлиента.ПолучитьСсылку(УИД);
	Иначе
		Заказ= НайтиЗаказПоНомеруССайта(ИД);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Ответ.УстановитьТелоИзСтроки("0", КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	Штрихкод= ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Заказ);
	
	Ответ.УстановитьТелоИзСтроки(Штрихкод, КодировкаТекста.UTF8);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьВсеВидыАвтомобилейGetAllTypesAuto(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	Возврат ПодготовитьHTTPОтвет(Ложь, АльтерраОбщегоНазначения.ПолучитьВсеВидыАвтомобилей());
КонецФункции

Функция CreateKlient(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ДанныеКлиентаJSON= Запрос.ПолучитьТелоКакСтроку("UTF-8");
	
	Если ПустаяСтрока(ДанныеКлиентаJSON) Тогда
		Ответ= ПодготовитьHTTPОтвет("Переданы пустые данные");
		Возврат Ответ;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеКлиентаJSON);
	СоответствиеКлиента    =  ПрочитатьJSON(ЧтениеJSON, Истина);
	
	//СоответствиеКлиента= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеКлиентаJSON);
	
	Если СоответствиеКлиента.Количество() = 0 Тогда
		Ответ= ПодготовитьHTTPОтвет("Не удалось радобрать JSON");
		Возврат Ответ;
	КонецЕсли;
	
	ДанныеПартнера= Новый Структура;
	
	Фамилия= СоответствиеКлиента["Фамилия"];
	Имя= СоответствиеКлиента["Имя"];
	Отчество= СоответствиеКлиента["Отчество"];
	
	ДанныеПартнера.Вставить("Наименование", СокрЛП(Фамилия+" "+Имя+" "+Отчество));
	ДанныеПартнера.Вставить("Телефон", СоответствиеКлиента["Телефон"]);
	ДанныеПартнера.Вставить("Почта", СоответствиеКлиента["E-mail"]);
	ДанныеПартнера.Вставить("СогласенПолучатьПочту",  Булево(Число(СоответствиеКлиента["soglasen"])));
	ДанныеПартнера.Вставить("ДатаРождения", Дата(СоответствиеКлиента["ДатаРождения"]));
	//ДанныеПартнера.Вставить("БизнесРегион= СоответствиеКлиента["Регион"];
	ДанныеПартнера.Вставить("БизнесРегион", "Сайт");
	ДанныеПартнера.Вставить("БонуснаяПрограммаАктивна", Ложь);
	ДанныеПартнера.Вставить("Комментарий", "Создан автоматически с сайта");
	ДанныеПартнера.Вставить("Б_Идентификатор", СоответствиеКлиента["Б_Идентификатор"]);
	
	Если Не ЗначениеЗаполнено(ДанныеПартнера.Телефон) Тогда
		Ответ= ПодготовитьHTTPОтвет("Не задан телефон");
		Возврат Ответ;
	КонецЕсли;
	
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(ДанныеПартнера.Телефон);
	
	//ПОИСК ПАРТНЕРА
	Если Не ПустаяСтрока(ДанныеПартнера.Телефон) Тогда
		Партнер= АльтерраОбщегоНазначения.ПолучитьПартнераПоТелефону(ДанныеПартнера.Телефон);
		
		Если ЗначениеЗаполнено(Партнер) Тогда
			//Проверим и присвоем ИД с сайта
			Если Не ПустаяСтрока(ДанныеПартнера.Б_Идентификатор) И ДанныеПартнера.Б_Идентификатор <> Партнер.Б_Идентификатор Тогда
				//ПрисвоитьБ_Идентификатор(Партнер, ДанныеПартнера.Б_Идентификатор, Ответ);
			Иначе
				Ответ= ПодготовитьHTTPОтвет("", XMLСтрока(Партнер));
				Возврат Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Партнер) И Не ПустаяСтрока(ДанныеПартнера.Почта) Тогда
		Партнер= АльтерраОбщегоНазначения.ПолучитьПартнераПоПочте(ДанныеПартнера.Почта);
		
		Если ЗначениеЗаполнено(Партнер) Тогда
			Ответ= ПодготовитьHTTPОтвет("Найден партнер по e-mail ("+Партнер.Код+") "+Партнер, XMLСтрока(Партнер));
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;
	
	//СОЗДАЕМ
	Если Не ЗначениеЗаполнено(Партнер) Тогда 
		Партнер= АльтерраОбщегоНазначения.СоздатьПартнера(ДанныеПартнера);
		
		Ответ= ПодготовитьHTTPОтвет("", XMLСтрока(Партнер));
		Возврат Ответ;
	КонецЕсли;
КонецФункции

Функция ОтдатьИнформациюПоСопутствующимТоварамgetSoputka(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СопутствующиеВидыНоменклатуры.Владелец КАК ВладелецСсылка,
	|	СопутствующиеВидыНоменклатуры.СопутствующийВидНоменклатуры КАК СопутствующийВидНоменклатуры,
	|	СопутствующиеВидыНоменклатурыСопутствующаяНоменклатура.Номенклатура КАК Номенклатура,
	|	СортировкаСопутствующихВидовНоменклатуры.Сортировка КАК Сортировка
	|ИЗ
	|	Справочник.СопутствующиеВидыНоменклатуры.СопутствующаяНоменклатура КАК СопутствующиеВидыНоменклатурыСопутствующаяНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СопутствующиеВидыНоменклатуры КАК СопутствующиеВидыНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СортировкаСопутствующихВидовНоменклатуры КАК СортировкаСопутствующихВидовНоменклатуры
	|			ПО (СопутствующиеВидыНоменклатуры.Ссылка = СортировкаСопутствующихВидовНоменклатуры.СопутствующийВидНоменклатуры)
	|		ПО (СопутствующиеВидыНоменклатурыСопутствующаяНоменклатура.Ссылка = СопутствующиеВидыНоменклатуры.Ссылка)
	|ГДЕ
	|	СопутствующиеВидыНоменклатурыСопутствующаяНоменклатура.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И СопутствующиеВидыНоменклатуры.Владелец.ПометкаУдаления = ЛОЖЬ
	|	И СопутствующиеВидыНоменклатуры.СопутствующийВидНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|	И СопутствующиеВидыНоменклатурыСопутствующаяНоменклатура.Номенклатура.ПометкаУдаления = ЛОЖЬ";

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивRelated = Новый Массив();	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтруктураRelated  = Новый Структура("UF_VLADELETS,UF_SOPUTSTVUYSHCHIY,UF_KODTOVARA,UF_SORT",); 
		СтруктураRelated.UF_VLADELETS = ВыборкаДетальныеЗаписи.ВладелецСсылка.УникальныйИдентификатор(); 
		СтруктураRelated.UF_SOPUTSTVUYSHCHIY = ВыборкаДетальныеЗаписи.СопутствующийВидНоменклатуры.УникальныйИдентификатор(); 
		СтруктураRelated.UF_KODTOVARA = ВыборкаДетальныеЗаписи.Номенклатура.УникальныйИдентификатор(); 
		СтруктураRelated.UF_SORT = ВыборкаДетальныеЗаписи.Сортировка;
		МассивRelated.Добавить(СтруктураRelated);
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комплектующие.Номенклатура КАК Номенклатура,
		|	Комплектующие.Комплектующее КАК Комплектующее
		|ИЗ
		|	РегистрСведений.Комплектующие КАК Комплектующие
		|ГДЕ
		|	НЕ Комплектующие.Номенклатура.ПометкаУдаления
		|	И НЕ Комплектующие.Комплектующее.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивAccessories = Новый Массив();	

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    СтруктураAccessories  = Новый Структура("UF_KODTOVARA,UF_KODACCESSORIES",); 
		СтруктураAccessories.UF_KODTOVARA = ВыборкаДетальныеЗаписи.Номенклатура.УникальныйИдентификатор(); 
		СтруктураAccessories.UF_KODACCESSORIES = ВыборкаДетальныеЗаписи.Комплектующее.УникальныйИдентификатор(); 
		МассивAccessories.Добавить(СтруктураAccessories);
	КонецЦикла;
	
    СтруктураОтвета = Новый Структура("related,accessories",МассивRelated,МассивAccessories); 
	
	стрJSON = АльтерраОбщегоНазначения.СформироватьСтрокуJSON(СтруктураОтвета);
	
	Ответ.УстановитьТелоИзСтроки(стрJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьREFПартнераПоТелефону(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
		Ответ= ПодготовитьHTTPОтвет("Переданы пустые параметры в запросе");
		Возврат Ответ;
	КонецЕсли;
	
	НомерТелефона= Запрос.ПараметрыЗапроса.Получить("tel");
	Почта= Запрос.ПараметрыЗапроса.Получить("email");
	
	Партнер= Неопределено;
	
	//Ищем по телефону
	Если Не ПустаяСтрока(НомерТелефона) Тогда
		АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона);
		
		Партнер= АльтерраОбщегоНазначения.ПолучитьПартнераПоТелефону(НомерТелефона);
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		//Ищем по почте
		Если Не ПустаяСтрока(Почта) Тогда
			Партнер= АльтерраОбщегоНазначения.ПолучитьПартнераПоПочте(Почта);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		Ответ= ПодготовитьHTTPОтвет("Не удалось найти партнера");
		Возврат Ответ;
	КонецЕсли;
	
	REF= XMLСтрока(Партнер);
	Ответ= ПодготовитьHTTPОтвет("", REF);
	
	Возврат Ответ;
КонецФункции

#КонецОбласти                         
                                                     
#Область ВспомогательныеЗоныДоставки
Функция ПолучитьJSON()
	РезультатЗапроса= ЗапросКТарифам();
	
	Зоны= "";	
	ВыборкаПоФилиалу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	Пока ВыборкаПоФилиалу.Следующий() Цикл
		
		ВыборкаЗон= ВыборкаПоФилиалу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗонаДоставки");
		Пока ВыборкаЗон.Следующий() Цикл
			
			мТарифс= Новый Массив;
			ПерваяСтрока= Истина;
			Выборка= ВыборкаЗон.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
			Пока Выборка.Следующий() Цикл
				Если ПерваяСтрока Тогда
					мСтрок= Новый Массив;
					
					Стоимость= Формат(Выборка.СтоимостьДляКлиента, "ЧРД=.; ЧРГ=' '; ЧГ=0");
					Если Не ЗначениеЗаполнено(Стоимость) Тогда
						Стоимость= 0;
					КонецЕсли;
					
					стрЦены= "Стоимость: "+Стоимость;	
					
					Цвет= Выборка.Цвет;
					Если Не ПустаяСтрока(Цвет) Тогда
						Цвет= СтрЗаменить(Цвет, " ","");
						Цвет= Прав(Цвет,6);
					КонецЕсли;
					
					мСтрок.Добавить(СтрШаблон("sZone: '%1',", Выборка.Координаты));
					мСтрок.Добавить(СтрШаблон("zone: '%1',", Выборка.Наименование));
					мСтрок.Добавить(СтрШаблон("branch: '%1',", Выборка.Подразделение));
					мСтрок.Добавить(СтрШаблон("price: %1,", Формат(Стоимость, "ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0")));
					мСтрок.Добавить(СтрШаблон("hintContent: '%1',", Выборка.Наименование+" - "+стрЦены));
					мСтрок.Добавить(СтрШаблон("opacity: %1,", "0.5"));
					мСтрок.Добавить(СтрШаблон("fillColor: '%1',", Цвет));
					
					ПерваяСтрока= Ложь;
				КонецЕсли;
				
				//тарифы
				мТарифов= Новый Массив;
				мТарифов.Добавить(СтрШаблон("name: '%1',", Выборка.ТарифНаименование));
				мТарифов.Добавить(СтрШаблон("cost: %1,", Формат(Выборка.СтоимостьДляКлиента, "ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0")));
				мТарифов.Добавить(СтрШаблон("cost_per_km: %1", Формат(Выборка.СтоимостьЗаКм, "ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0")));
				мТарифс.Добавить(мТарифов);
			КонецЦикла;
			
			Тарифы= "["+Символы.ПС;
			Для Каждого мТарифов Из мТарифс Цикл
				Тарифы= Тарифы+"{";
				Для Каждого стр Из мТарифов Цикл
					Тарифы= Тарифы+Символы.ПС+стр;	
				КонецЦикла;
				Тарифы= Тарифы+"},"+Символы.ПС;
			КонецЦикла;
			Тарифы= Лев(Тарифы, СтрДлина(Тарифы)-1);
			Тарифы= Тарифы+Символы.ПС+"]"+Символы.ПС;
			мСтрок.Добавить(СтрШаблон("tariffs: %1", Тарифы));
			
			//Формируем объект
			Зоны= Зоны+"{";
			Для Каждого стр Из мСтрок Цикл
				Зоны= Зоны+Символы.ПС+стр;
			КонецЦикла;
			
			Зоны= Зоны+"},"+Символы.ПС;
			
			//стрДЖОС= АльтерраОбщегоНазначения.СформироватьСтрокуJSON(мСтрок);
			
		КонецЦикла;
	КонецЦикла;
	стрJSON= Лев(Зоны, СтрДлина(Зоны)-1);
	
	Возврат стрJSON;
КонецФункции
Функция ЗапросКТарифам()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗоныДоставкиДоКлиента.Ссылка КАК Ссылка,
	|	ЗоныДоставкиДоКлиента.Наименование КАК Наименование,
	|	ЗоныДоставкиДоКлиента.Координаты КАК Координаты,
	|	ЗоныДоставкиДоКлиента.Цвет КАК Цвет,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляВодителя, 0) КАК СтоимостьДляВодителя,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляКлиента, 0) КАК СтоимостьДляКлиента,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.МинимальнаяСтоимость, 0) КАК МинимальнаяСтоимость,
	|	ЗоныДоставкиДоКлиента.Подразделение КАК Подразделение,
	|	СтоимостьДоставкиПоЗонамСрезПоследних.Тариф КАК Тариф
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.ЗоныДоставкиДоКлиента КАК ЗоныДоставкиДоКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьДоставкиПоЗонам.СрезПоследних(&Период,) КАК СтоимостьДоставкиПоЗонамСрезПоследних
	|		ПО (СтоимостьДоставкиПоЗонамСрезПоследних.ЗонаДоставки = ЗоныДоставкиДоКлиента.Ссылка)
	|ГДЕ
	|	ЗоныДоставкиДоКлиента.ПометкаУдаления = ЛОЖЬ
	|	И ЗоныДоставкиДоКлиента.ВидДоставки = &ВидДоставки
	|	И ЗоныДоставкиДоКлиента.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Подразделение КАК Подразделение,
	|	ВТ.Ссылка КАК ЗонаДоставки,
	|	ВТ.Тариф КАК Тариф,
	|	ВТ.Наименование КАК Наименование,
	|	ВТ.Координаты КАК Координаты,
	|	ВТ.Цвет КАК Цвет,
	|	ВТ.СтоимостьДляВодителя КАК СтоимостьДляВодителя,
	|	ВТ.СтоимостьДляКлиента КАК СтоимостьДляКлиента,
	|	ВТ.МинимальнаяСтоимость КАК МинимальнаяСтоимость,
	|	ЕСТЬNULL(СтоимостьДоставкиПоРасстоянию.Стоимость, 0) КАК СтоимостьЗаКм,
	|	ВТ.Тариф.Наименование КАК ТарифНаименование
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьДоставкиПоРасстоянию КАК СтоимостьДоставкиПоРасстоянию
	|		ПО ВТ.Подразделение = СтоимостьДоставкиПоРасстоянию.Подразделение
	|			И ВТ.Тариф = СтоимостьДоставкиПоРасстоянию.Тариф
	|ИТОГИ ПО
	|	Подразделение,
	|	ЗонаДоставки";
	
	Запрос.УстановитьПараметр("ВидДоставки", Перечисления.ВидыДоставокДоКлиента.Розничная);    
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции
#КонецОбласти 

#Область ВспомогательныеЗоныОплата
Функция НайтиЗаказПоНомеруССайта(НомерНаСайте)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.Проведен КАК Проведен,
	|	ЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.ССайта КАК ССайта,
	|	ЗаказКлиента.НомерНаСайте КАК НомерНаСайте,
	|	ЗаказКлиента.ПередатьНаСайт КАК ПередатьНаСайт
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.НомерНаСайте = &НомерНаСайте
	|	И ЗаказКлиента.ССайта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Проведен,
	|	ЗаказКлиента.ПометкаУдаления,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.ССайта,
	|	ЗаказКлиента.НомерНаСайте,
	|	ЗаказКлиента.ПередатьНаСайт
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.НомерНаСайте = &НомерНаСайте
	|	И ЗаказКлиента.ПередатьНаСайт";
	
	Запрос.УстановитьПараметр("НомерНаСайте", НомерНаСайте);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
#КонецОбласти 

#Область Вспомогательные
Функция ПодготовитьHTTPОтвет(Ошибка, Данные=Неопределено, БезОтступов = Истина)  Экспорт
	Ответ= ПодготовитьОтвет(Ошибка, Данные);
	
	ДанныеОтправки= ОбщийHTTPСервер.СериализоватьВJSON(Ответ, БезОтступов);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);      
	
	HTTPОтвет.УстановитьТелоИзСтроки(ДанныеОтправки, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат HTTPОтвет;   
	
КонецФункции
Функция ПодготовитьОтвет(Ошибка, Данные=Неопределено)  Экспорт
	Если Данные = Неопределено Тогда
		Данные= Новый Структура();
	КонецЕсли;
	
	Ответ= Новый Структура("Ошибка, Данные", Ошибка, Данные);
	
	Возврат Ответ;
КонецФункции

Функция ПрисвоитьБ_Идентификатор(Партнер, Б_Идентификатор, Ответ)
	ПартнерОбъект= Партнер.ПолучитьОбъект();
	ПартнерОбъект.Б_Идентификатор= Б_Идентификатор;
	ПартнерОбъект.Записать();
	
	Ответ.УстановитьТелоИзСтроки("Найден партнер по телефону ("+Партнер.Код+"). Установлен Б_Идентификатор "+Партнер, КодировкаТекста.UTF8);	
	Возврат Ответ;
КонецФункции

Функция ПолучитьФилиал(Имя)
	//	center (novoalt, barnaul, biysk)
	
	//Передается имя, если имя пустое - возврат Центральный. 
	Возврат АльтерраОбщегоНазначения.ОпределениеФилиалаМагазина(Имя); 
	//Если Имя = "center"	Тогда
	//	Возврат Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000001");
	//ИначеЕсли Имя = "novoalt" Тогда
	//	Возврат Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000003");
	//ИначеЕсли Имя = "barnaul" Тогда
	//	Возврат Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000002");
	//ИначеЕсли Имя = "biysk" Тогда
	//	Возврат Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000004");
	//Иначе 
	//	Возврат Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000001");
	//КонецЕсли;
КонецФункции

Функция ПолучитьПакет()
	 Запрос = Новый Запрос;
	 Запрос.Текст =   
	 
	 "ВЫБРАТЬ
	 |	ПартнерыСегмента.Партнер КАК Партнер,
	 |	МАКСИМУМ(ПартнерыСегмента.Сегмент) КАК СегментПартнеров
	 |ПОМЕСТИТЬ ВТ_ПартнерыСегментов
	 |ИЗ
	 |	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	 |ГДЕ
	 |	ПартнерыСегмента.Сегмент.ВыгружатьНаСайт = ИСТИНА
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ПартнерыСегмента.Партнер
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_ПартнерыСегментов.Партнер КАК Партнер,
	 |	ВТ_ПартнерыСегментов.СегментПартнеров КАК СегментПартнеров,
	 |	ПартнерыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	 |ПОМЕСТИТЬ ВТ_ПартнерыИАдресЭПСегментов
	 |ИЗ
	 |	ВТ_ПартнерыСегментов КАК ВТ_ПартнерыСегментов
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	 |		ПО ВТ_ПартнерыСегментов.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
	 |			И (ПартнерыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПартнера))
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СоглашенияДопРеквизиты.Ссылка КАК Соглашение,
	 |	СоглашенияДопРеквизиты.Ссылка.Партнер КАК Партнер,
	 |	СоглашенияДопРеквизиты.Ссылка.ВидЦен КАК ВидЦен,
	 |	ПартнерыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	 |ПОМЕСТИТЬ ВТ_СоглашенияКВыгрузкиНеИзСегментов
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами.ДополнительныеРеквизиты КАК СоглашенияДопРеквизиты
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	 |		ПО СоглашенияДопРеквизиты.Ссылка.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
	 |			И (ПартнерыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПартнера))
	 |ГДЕ
	 |	СоглашенияДопРеквизиты.Свойство = &Свойство
	 |	И СоглашенияДопРеквизиты.Значение = ИСТИНА
	 |	И СоглашенияДопРеквизиты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	 |	И НЕ &НовоеЦО
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	СоглашенияДопРеквизиты.Ссылка,
	 |	СоглашенияДопРеквизиты.Ссылка.Партнер,
	 |	ВидыЦен.Ссылка,
	 |	ПартнерыКонтактнаяИнформация.АдресЭП
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами.ДополнительныеРеквизиты КАК СоглашенияДопРеквизиты
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	 |		ПО СоглашенияДопРеквизиты.Ссылка.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
	 |			И (ПартнерыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПартнера))
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	 |		ПО СоглашенияДопРеквизиты.Ссылка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	 |			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	 |ГДЕ
	 |	СоглашенияДопРеквизиты.Свойство = &Свойство
	 |	И СоглашенияДопРеквизиты.Значение = ИСТИНА
	 |	И СоглашенияДопРеквизиты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	 |	И &НовоеЦО
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_СоглашенияКВыгрузкиНеИзСегментов.Соглашение КАК Соглашение,
	 |	ВТ_СоглашенияКВыгрузкиНеИзСегментов.Партнер КАК Партнер,
	 |	ВТ_СоглашенияКВыгрузкиНеИзСегментов.ВидЦен КАК ВидЦен,
	 |	ВТ_СоглашенияКВыгрузкиНеИзСегментов.АдресЭП КАК АдресЭП
	 |ПОМЕСТИТЬ ВТ_СоглашенияКВыгрузки
	 |ИЗ
	 |	ВТ_СоглашенияКВыгрузкиНеИзСегментов КАК ВТ_СоглашенияКВыгрузкиНеИзСегментов
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	МАКСИМУМ(СоглашенияСКлиентами.Ссылка),
	 |	ВТ_ПартнерыИАдресЭПСегментов.Партнер,
	 |	МАКСИМУМ(СоглашенияСКлиентами.ВидЦен),
	 |	МАКСИМУМ(ВТ_ПартнерыИАдресЭПСегментов.АдресЭП)
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПартнерыИАдресЭПСегментов КАК ВТ_ПартнерыИАдресЭПСегментов
	 |		ПО СоглашенияСКлиентами.СегментПартнеров = ВТ_ПартнерыИАдресЭПСегментов.СегментПартнеров
	 |			И (НЕ ВТ_ПартнерыИАдресЭПСегментов.Партнер В
	 |					(ВЫБРАТЬ
	 |						ВТ_СоглашенияКВыгрузкиНеИзСегментов.Партнер
	 |					ИЗ
	 |						ВТ_СоглашенияКВыгрузкиНеИзСегментов КАК ВТ_СоглашенияКВыгрузкиНеИзСегментов))
	 |ГДЕ
	 |	СоглашенияСКлиентами.Типовое = ИСТИНА
	 |	И СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	 |	И НЕ &НовоеЦО
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТ_ПартнерыИАдресЭПСегментов.Партнер
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	МАКСИМУМ(СоглашенияСКлиентами.Ссылка),
	 |	ВТ_ПартнерыИАдресЭПСегментов.Партнер,
	 |	МАКСИМУМ(ВидыЦен.Ссылка),
	 |	МАКСИМУМ(ВТ_ПартнерыИАдресЭПСегментов.АдресЭП)
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПартнерыИАдресЭПСегментов КАК ВТ_ПартнерыИАдресЭПСегментов
	 |		ПО СоглашенияСКлиентами.СегментПартнеров = ВТ_ПартнерыИАдресЭПСегментов.СегментПартнеров
	 |			И (НЕ ВТ_ПартнерыИАдресЭПСегментов.Партнер В
	 |					(ВЫБРАТЬ
	 |						ВТ_СоглашенияКВыгрузкиНеИзСегментов.Партнер
	 |					ИЗ
	 |						ВТ_СоглашенияКВыгрузкиНеИзСегментов КАК ВТ_СоглашенияКВыгрузкиНеИзСегментов))
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	 |		ПО СоглашенияСКлиентами.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	 |			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	 |ГДЕ
	 |	СоглашенияСКлиентами.Типовое = ИСТИНА
	 |	И СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	 |	И &НовоеЦО
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТ_ПартнерыИАдресЭПСегментов.Партнер
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение КАК Соглашение,
	 |	ВТ_СоглашенияКВыгрузки.ВидЦен КАК ВидЦен
	 |ИЗ
	 |	ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение КАК Соглашение,
	 |	СоглашенияСКлиентамиЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа,
	 |	СоглашенияСКлиентамиЦеновыеГруппы.ВидЦен КАК ВидЦен
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашенияСКлиентамиЦеновыеГруппы
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |		ПО СоглашенияСКлиентамиЦеновыеГруппы.Ссылка = ВТ_СоглашенияКВыгрузки.Соглашение
	 |ГДЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	 |	И НЕ &НовоеЦО
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение,
	 |	СоглашенияЦеновыеГруппы.ЦеноваяГруппа,
	 |	ВидыЦенЦеновыеГруппы.Ссылка
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашенияЦеновыеГруппы
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |		ПО СоглашенияЦеновыеГруппы.Ссылка = ВТ_СоглашенияКВыгрузки.Соглашение
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенЦеновыеГруппы
	 |		ПО СоглашенияЦеновыеГруппы.ГруппаВидовЦен = ВидыЦенЦеновыеГруппы.ГруппаВидовЦен
	 |			И (ВидыЦенЦеновыеГруппы.ФорматПодразделения = &ФорматПодразделения)
	 |ГДЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	 |	И &НовоеЦО
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Соглашение,
	 |	ЦеноваяГруппа
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение КАК Соглашение,
	 |	СоглашенияСКлиентамиТовары.Номенклатура КАК Номенклатура,
	 |	СоглашенияСКлиентамиТовары.ВидЦены КАК ВидЦены
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами.Товары КАК СоглашенияСКлиентамиТовары
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |		ПО СоглашенияСКлиентамиТовары.Ссылка = ВТ_СоглашенияКВыгрузки.Соглашение
	 |ГДЕ
	 |	НЕ &новоеЦО
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение,
	 |	СоглашенияСКлиентамиТовары.Номенклатура,
	 |	ВидыЦенТовары.Ссылка
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами.Товары КАК СоглашенияСКлиентамиТовары
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |		ПО СоглашенияСКлиентамиТовары.Ссылка = ВТ_СоглашенияКВыгрузки.Соглашение
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенТовары
	 |		ПО СоглашенияСКлиентамиТовары.ГруппаВидовЦен = ВидыЦенТовары.ГруппаВидовЦен
	 |			И (ВидыЦенТовары.ФорматПодразделения = &Форматподразделения)
	 |ГДЕ
	 |	&новоеЦО
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Соглашение,
	 |	Номенклатура,
	 |	ВидЦены
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	Номенклатура.Ссылка КАК Номенклатура,
	 |	Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |ГДЕ
	 |	Номенклатура.ВыгружаетсяНаСайт = ИСТИНА
	 |	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	 |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВТ_СоглашенияКВыгрузки.АдресЭП КАК АдресЭП,
	 |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК НомерТелефона,
	 |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Наименование КАК ФИО,
	 |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец КАК Партнер,
	 |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец.БизнесРегион КАК БизнесРегион,
	 |	ВТ_СоглашенияКВыгрузки.Соглашение КАК Соглашение
	 |ИЗ
	 |	ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	 |		ПО ВТ_СоглашенияКВыгрузки.Партнер = КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец
	 |			И (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица) = КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид)
	 |ГДЕ
	 |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
	 |	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление <> """"
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец.БизнесРегион КАК БизнесРегион
	 |ИЗ
	 |	ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	 |		ПО ВТ_СоглашенияКВыгрузки.Партнер = КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец
	 |			И (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица) = КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид)
	 |ГДЕ
	 |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
	 |	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление <> """"
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение КАК Соглашение,
	 |	СоглашенияСКлиентамиЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа,
	 |	СоглашенияСКлиентамиЦеновыеГруппы.ВидЦен КАК ВидЦен
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашенияСКлиентамиЦеновыеГруппы
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |		ПО СоглашенияСКлиентамиЦеновыеГруппы.Ссылка = ВТ_СоглашенияКВыгрузки.Соглашение
	 |ГДЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение.Склад.Транзит
	 |	И НЕ &НовоеЦО
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение,
	 |	СоглашенияЦеновыеГруппы.ЦеноваяГруппа,
	 |	ВидыЦен.Ссылка
	 |ИЗ
	 |	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашенияЦеновыеГруппы
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоглашенияКВыгрузки КАК ВТ_СоглашенияКВыгрузки
	 |		ПО СоглашенияЦеновыеГруппы.Ссылка = ВТ_СоглашенияКВыгрузки.Соглашение
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	 |		ПО СоглашенияЦеновыеГруппы.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
	 |			И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
	 |ГДЕ
	 |	ВТ_СоглашенияКВыгрузки.Соглашение.Склад.Транзит
	 |	И &НовоеЦО
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Соглашение,
	 |	ЦеноваяГруппа";
	 
	Запрос.УстановитьПараметр("ФорматПодразделения",Справочники.ФорматыПодразделений.НайтиПоНаименованию("ТСК"));
	 Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Выгружать на сайт (Соглашения об условиях продаж)"));
	 Запрос.УстановитьПараметр("НовоеЦО", ДопМодуль.НовоеЦенообразование());
	 
	 ПакетЗапросов = Запрос.ВыполнитьПакет();
	 
	 Возврат  ПакетЗапросов;
 КонецФункции
#КонецОбласти 

#Область ОбменСЛичнымКабинетомОбмен
Функция ОбменСЛичнымКабинетомОбмен(Запрос) 
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеJSON= Запрос.ПолучитьТелоКакСтроку("UTF-8");
	Попытка   
		ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);   
		
	//	Если ВходящиеДанные=НЕОПРЕДЕЛЕНО и Запрос.ПараметрыЗапроса.Количество() > 0 Тогда  
      //      ВходящиеДанные=Запрос.ПараметрыЗапроса;
	//	конецесли;	
			
	Исключение   
	КонецПопытки;  

		
	Метод= Запрос.ОтносительныйURL;
		
	//Маршрутизация
	Если Метод = "/GetIntervals" Тогда
		ОтветHTTP= GetIntervals(ВходящиеДанные);	
	ИначеЕсли Метод = "/UpdatePartner" Тогда
		ОтветHTTP= UpdatePartner(ВходящиеДанные);
	ИначеЕсли Метод = "/GetTarif" Тогда
		ОтветHTTP= GetTarif(ВходящиеДанные);
	ИначеЕсли Метод = "/CalculateBonuses" Тогда
	    ОтветHTTP= CalculateBonuses(ВходящиеДанные);
	ИначеЕсли Метод = "/PrintСheck" Тогда
		ОтветHTTP= PrintСheck(ВходящиеДанные);
	ИначеЕсли Метод = "/PrintСheckArray" Тогда
		ОтветHTTP= PrintСheckArray(Запрос, ВходящиеДанные);
	ИначеЕсли Метод = "/GetUnloadingCost" Тогда
		ОтветHTTP= GetUnloadingCost(ВходящиеДанные);
	ИначеЕсли Метод = "/GetInfoLegalEntity" Тогда
		ОтветHTTP= GetInfoLegalEntity(ВходящиеДанные); 
	ИначеЕсли Метод = "/AddClientToAuthLog" Тогда 
		ОтветHTTP= AddClientToAuthLog(ВходящиеДанные); 
	ИначеЕсли Метод = "/getDeliveryPrice" Тогда
		ОтветHTTP= getDeliveryPrice(ВходящиеДанные); 
	Иначе
		ОтветHTTP= ПодготовитьHTTPОтвет(Истина, "Передан неверный метод");
	КонецЕсли;
	
	Возврат ОтветHTTP;	
КонецФункции
#КонецОбласти 

#Область ОбменПрайсамиССайтомОбмен
Функция ОбменПрайсамиССайтомОбмен(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	ДанныеJSON = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	Попытка
		ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	Исключение
	КонецПопытки;

		
	Метод = Запрос.ОтносительныйURL;
		
	//Маршрутизация
	Если Метод = "/Prices/AgreementTypePrice" Тогда
		ОтветHTTP = AgreementTypePrice(ВходящиеДанные);	
	ИначеЕсли Метод = "/Prices/AgreementGroupPrice" Тогда
		ОтветHTTP = AgreementGroupPrice(ВходящиеДанные);
	ИначеЕсли Метод = "/Prices/AgreementProductsPrice" Тогда
		ОтветHTTP = AgreementProductsPrice(ВходящиеДанные);
	ИначеЕсли Метод = "/Prices/AgreementProductsGroup" Тогда
		ОтветHTTP = AgreementProductsGroup(ВходящиеДанные);
	ИначеЕсли Метод = "/Prices/AgreementKlients" Тогда
		ОтветHTTP = AgreementKlients(ВходящиеДанные);
	ИначеЕсли Метод = "/Prices/AgreementRegions" Тогда
		ОтветHTTP = AgreementRegions(ВходящиеДанные);
	ИначеЕсли Метод = "/Prices/AgreementGroupPriceTransit" Тогда
		ОтветHTTP = AgreementGroupPriceTransit(ВходящиеДанные);
	Иначе
		ОтветHTTP = ПодготовитьHTTPОтвет(Истина, "Передан неверный метод");
	КонецЕсли;
	
	Возврат ОтветHTTP;	
КонецФункции
#КонецОбласти

#Область ОбработкаМаршрутов
Функция GetIntervals(ВходящиеДанные)
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		//ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
		
		Подразделение       = ПолучитьФилиал(ВходящиеДанные["Branch"]);
		ДатаОтгрузки        = Дата(ВходящиеДанные["Date"]);
		Если ВходящиеДанные.Свойство("UnLoading") Тогда
			ДоставкаСРазгрузкой = Булево(ВходящиеДанные["UnLoading"]);
		Иначе
			ДоставкаСРазгрузкой = Ложь;
		КонецЕсли;
		DeliveryType        = ВходящиеДанные["DeliveryType"];
		КорИнтервала        = Число(ВходящиеДанные["delay"]);
		
		Если DeliveryType = "retail" Тогда
			ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная;
		ИначеЕсли DeliveryType = "ork" Тогда
			ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК;
		Иначе
			ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная;
		КонецЕсли;	
		
		ТекстЗапросаДляВыбораИнтервала = Справочники.ИнтервалыДоставки.ПолучитьТекстЗапросаДляВыбораИнтервала();
		Если ДоставкаСРазгрузкой Тогда
			ТекстЗапросаДляВыбораИнтервала = ТекстЗапросаДляВыбораИнтервала + " ГДЕ Результат1.КоличествоСРазгрузкойПоУмолчанию > 0 ";	
		КонецЕсли;
		
		ЗапросДляВыбораИнтервала = Новый Запрос(ТекстЗапросаДляВыбораИнтервала + " ИТОГИ ПО КодТипаДоставки");
		
		ЗапросДляВыбораИнтервала.УстановитьПараметр("ДатаОтгрузки",        ДатаОтгрузки);
		ЗапросДляВыбораИнтервала.УстановитьПараметр("Подразделение",       Подразделение);
		ЗапросДляВыбораИнтервала.УстановитьПараметр("ВидДоставки",         ВидДоставки);
		ЗапросДляВыбораИнтервала.УстановитьПараметр("ДоставкаСРазгрузкой", ДоставкаСРазгрузкой);
		ЗапросДляВыбораИнтервала.УстановитьПараметр("КорИнтервала",        КорИнтервала);
		ЗапросДляВыбораИнтервала.УстановитьПараметр("ТекДата",             ТекущаяДата());
		
		Если ДеньНедели(ДатаОтгрузки) < 6  И ВидДоставки <> Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
			ЗапросДляВыбораИнтервала.УстановитьПараметр("ДеньНедели", 0);
		Иначе
			ЗапросДляВыбораИнтервала.УстановитьПараметр("ДеньНедели", ДеньНедели(ДатаОтгрузки));
		КонецЕсли;		
		
		МассивТиповДоставки = Новый Массив;	
		ИтоговыеЗаписи = ЗапросДляВыбораИнтервала.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ИтоговыеЗаписи.Следующий() Цикл
			
			КодТипаДоставки = ИтоговыеЗаписи.КодТипаДоставки;
			Если ЗначениеЗаполнено(КодТипаДоставки) Тогда
				
				МассивЭлементовОдногоТипа = Новый Массив;
				ДетальныеЗаписи = ИтоговыеЗаписи.Выбрать();	
				Пока ДетальныеЗаписи.Следующий() Цикл		
					
					ДлительностьИнтервала = ДетальныеЗаписи.ВремяПо - ДетальныеЗаписи.ВремяС;               
					ДлительностьИнтервала = ДлительностьИнтервала - (ДлительностьИнтервала % 60); // отбрасываем секунды
					Минуты = ДлительностьИнтервала % 3600;
					
					МассивЭлементовОдногоТипа.Добавить(Новый Структура("interval_id, name, label, interval, is_active, range, unloading",
					Строка(ДетальныеЗаписи.УИД),
					ДетальныеЗаписи.Наименование,
					ДетальныеЗаписи.НаименованиеНаСайте,
					Новый Структура("from, to",
					// Формат(ДетальныеЗаписи.ВремяС, "ДФ=Ч:мм"), 
					// Формат(ДетальныеЗаписи.ВремяПо, "ДФ=Ч:мм")),
					Час(ДетальныеЗаписи.ВремяС) + (Минута(ДетальныеЗаписи.ВремяС) / 100), 
					Час(ДетальныеЗаписи.ВремяПо) + (Минута(ДетальныеЗаписи.ВремяПо) / 100)
					),
					(ДетальныеЗаписи.ДоступноНаСегодня > 0 И ДетальныеЗаписи.МожноВыбрать),
					(ДлительностьИнтервала - Минуты) / 3600 + (Минуты / 6000),
					(ДетальныеЗаписи.ДоступноНаСегодняСРазгрузкой > 0 И ДетальныеЗаписи.МожноВыбрать И ДетальныеЗаписи.МожноВыбратьРазгрузка)
					)
					);
				КонецЦикла;
				
				МассивТиповДоставки.Добавить(Новый Структура(КодТипаДоставки, МассивЭлементовОдногоТипа));
			КонецЕсли;
		КонецЦикла;
		
		Возврат ПодготовитьHTTPОтвет(Ложь, МассивТиповДоставки);		
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Не удалось получить интервалы доставки!");			
	КонецПопытки;
КонецФункции

Функция UpdatePartner(ВходящиеДанные)
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИД = ВходящиеДанные["ref"];
		Если Не ЗначениеЗаполнено(ИД) Тогда
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка обновления данных партнера: Передан пустой ИД");
		КонецЕсли;
		
		Партнер = АльтерраОбщегоНазначения.ПолучитьпартнераПоСсылке(ИД);
		Если Не ЗначениеЗаполнено(Партнер) Тогда                                              
			Возврат ОшибкаОбменаСИнтернетМагазином(СтрШаблон("Ошибка обновления данных партнера: Клиент по УИД %1 не найден; данные обновления: " + 
				"e-mail: %2, тел.: %3, дата рождения: %4",
				ВходящиеДанные["ref"], ВходящиеДанные["emale"], ВходящиеДанные["tel"], ВходящиеДанные["birthday"]));
		КонецЕсли;
		ТелефонПартнера =ВходящиеДанные["tel"]; 
		Если ДопМодульКлиентСервер.НомерСуществуетВБазе(Партнер, ТелефонПартнера) Тогда  
			 Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка обновления данных партнера: Такой номер уже существует в базе у другого партнера");
		КонецЕсли;
		Партнер = Партнер.ПолучитьОбъект();
		ДопМодульКлиентСервер.ОбновитьДП(
			Партнер, 
			"",  
			ВходящиеДанные["birthday"], 
			ВходящиеДанные["tel"], 
			ВходящиеДанные["emale"]);

			Возврат ПодготовитьHTTPОтвет(Ложь, XMLСтрока(Партнер.Ссылка));
		Исключение 
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка обновления данных партнера!");			
	КонецПопытки; 
КонецФункции

Функция GetTarif(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		МассивНоменклатур = ВходящиеДанные["goods"];
		DeliveryType      = ВходящиеДанные["DeliveryType"];
		ЭкспрессДоставка  = Булево(ВходящиеДанные["express"]);
		
		Если ЗначениеЗаполнено(МассивНоменклатур) И ТипЗнч(МассивНоменклатур) = Тип("Массив") Тогда
			ТЗ_Товары = Новый ТаблицаЗначений();
			ТЗ_Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТЗ_Товары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			Попытка
				Для Инд = 0 По МассивНоменклатур.Количество() - 1 Цикл
					Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивНоменклатур[Инд].ref));
					Если ПустаяСтрока(Номенклатура.Код) Тогда
						Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки: Передан неверный массив, пустой код номенклатуры в массиве");
					КонецЕсли;    
					СтрокаТЗ = ТЗ_Товары.Добавить();
					СтрокаТЗ.Номенклатура = Номенклатура;
					СтрокаТЗ.Количество = МассивНоменклатур[Инд].count;
				КонецЦикла;
			Исключение
				Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки: Передан неверный массив, ошибка в попытке добавить строку");
			КонецПопытки;
		Иначе
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки: Передан неверный массив, массив пустой или передан не массив");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(DeliveryType) Тогда
			Если DeliveryType = "retail" Тогда
				ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная;
			ИначеЕсли DeliveryType = "ork" Тогда
				ВидДоставки = Перечисления.ВидыДоставокДоКлиента.СборнаяОРК;
			Иначе
				ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная;
			КонецЕсли;
		КонецЕсли;
		
		//Восстановить после внедрения автоопределения тарифа
		//ПодходящийТариф = Документы.ЗаказНаДоставкуКлиенту.ПолучитьТариф(ТЗ_Товары, ВидДоставки, ЭкспрессДоставка);
		//Если ЗначениеЗаполнено(ПодходящийТариф) Тогда
		//	СтруктураОтвета = Новый Структура;
		//	СтруктураОтвета.Вставить("name", ПодходящийТариф.Наименование);
		//	СтруктураОтвета.Вставить("DeliveryType", ПодходящийТариф.ТипДоставки.Код);
		//	СтруктураОтвета.Вставить("CarTypeID", XMLСтрока(ПодходящийТариф.ВидАвтомобиля));
		//	Возврат ПодготовитьHTTPОтвет(Ложь, СтруктураОтвета);
		//Иначе
		//	Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки: Ошибка в методе 'ПолучитьТариф()'");
		//КонецЕсли;
		
		//Убрать после внедрения автоопределения тарифа +
		
		ТЗТарифов = ПолучитьТариф(ТЗ_Товары, ВидДоставки, ЭкспрессДоставка);
		
		МассивТарифов = Новый Массив;
						
		Для каждого СтрокаТаблицы из ТЗТарифов Цикл
			
			СтруктураОтвета = Новый Структура("name,DeliveryType,CarTypeID,MaxLength,Branch",);

			ЗаполнитьЗначенияСвойств(СтруктураОтвета,СтрокаТаблицы);
			СтруктураОтвета.DeliveryType = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТипДоставки),СтрокаТаблицы.ТипДоставки,Ложь);
			СтруктураОтвета.CarTypeID = ?(ЗначениеЗаполнено(СтрокаТаблицы.ВидАвтомобиля),XMLСтрока(СтрокаТаблицы.ВидАвтомобиля),Ложь);
			СтруктураОтвета.Branch = ПолучитьФилиалДляСайта(СтрокаТаблицы.Подразделение);
			
			МассивТарифов.Добавить(СтруктураОтвета);
			
		КонецЦикла;
		
		//Убрать после внедрения автоопределения тарифа -

		Если МассивТарифов.Количество()>0 Тогда
			Возврат ПодготовитьHTTPОтвет(Ложь, МассивТарифов);
		Иначе
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки: Ошибка в методе 'ПолучитьТариф()'");
		КонецЕсли;

	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки!");			
	КонецПопытки;
	
КонецФункции

Функция CalculateBonuses(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	    
	Попытка
		МассивНоменклатур = ВходящиеДанные["products"];
		IDПартнера = ВходящиеДанные["client_xml_id"];
		ИмяПодразделения = ВходящиеДанные["branch"];
		ПочтовыйАдресПартнера = ВходящиеДанные["client_email"];
		
		ОпределяемВсеВозможные = Ложь;
		
		Если ПустаяСтрока(IDПартнера) И ПустаяСтрока(ПочтовыйАдресПартнера) тогда
			ОпределяемВсеВозможные = Истина;
		  иначе
			  Партнер= АльтерраОбщегоНазначения.ПолучитьпартнераПоСсылке(IDПартнера);
			Если НЕ ЗначениеЗаполнено(Партнер) тогда
				Партнер= АльтерраОбщегоНазначения.ПолучитьПартнераПоПочте(ПочтовыйАдресПартнера);
			КонецЕсли;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Партнер) тогда
		   ОпределяемВсеВозможные = Истина;
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяПодразделения) тогда
					Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки: Не указано подразделение");
		иначе	
			        Подразделение = ПолучитьФилиал(ИмяПодразделения);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(МассивНоменклатур) И ТипЗнч(МассивНоменклатур) = Тип("Массив") Тогда
			ТЗ_Товары = Новый ТаблицаЗначений();
			ТЗ_Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТЗ_Товары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			ТЗ_Товары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
			ТЗ_Товары.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
			Попытка
				Для Инд = 0 По МассивНоменклатур.Количество() - 1 Цикл
					Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивНоменклатур[Инд].ref));
					Если ПустаяСтрока(Номенклатура.Код) Тогда
						Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки: Передан неверный массив, пустой код номенклатуры в массиве");
					КонецЕсли;    
					СтрокаТЗ = ТЗ_Товары.Добавить();
					СтрокаТЗ.Номенклатура = Номенклатура;
					СтрокаТЗ.Количество = МассивНоменклатур[Инд].count;
					СтрокаТЗ.Цена = МассивНоменклатур[Инд].price;
					СтрокаТЗ.Сумма = СтрокаТЗ.Количество*СтрокаТЗ.Цена;
				КонецЦикла;
			Исключение
				Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка расчета бонусов: Передан неверный массив, ошибка в попытке добавить строку");
			КонецПопытки;
		Иначе
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка расчета бонусов: Передан неверный массив, массив пустой или передан не массив");
		КонецЕсли;
		
		ТЗБонусов = РасчетБонусов(Партнер, ТЗ_Товары, Подразделение, ОпределяемВсеВозможные);

		            МассивБонусов = Новый Массив;
					СтруктураОтвета = Новый Структура;
					
                Для каждого СтрокаТаблицы из ТЗБонусов Цикл
                     СтруктураОтвета.Вставить(СтрокаТаблицы.Статус,СтрокаТаблицы.СуммаБаллов);
		       КонецЦикла;
			     МассивБонусов.Добавить(СтруктураОтвета);
		
		Если МассивБонусов.Количество()>0 Тогда
			Возврат ПодготовитьHTTPОтвет(Ложь, МассивБонусов);
		Иначе
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки: Ошибка в методе 'CalculateBonuses'");
		КонецЕсли;

	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения тарифа доставки!");			
	КонецПопытки;
	
	
КонецФункции	

Функция AgreementTypePrice(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПакетЗапросов = ПолучитьПакет();
		Массив = Новый Массив;
		Выборка = ПакетЗапросов[4].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("id_agreement", XMLСтрока(Выборка.Соглашение));
			СтруктураОтвета.Вставить("id_type_price", XMLСтрока(Выборка.ВидЦен));
			Массив.Добавить(СтруктураОтвета);
		КонецЦикла;
		Возврат ПодготовитьHTTPОтвет(Ложь, Массив);
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения вида цен соглашений!");			
	КонецПопытки;
	
КонецФункции

Функция AgreementGroupPrice(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПакетЗапросов = ПолучитьПакет();
		Массив = Новый Массив;
		Выборка = ПакетЗапросов[5].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("id_agreement", XMLСтрока(Выборка.Соглашение));
			СтруктураОтвета.Вставить("id_group_price", XMLСтрока(Выборка.ЦеноваяГруппа));
			СтруктураОтвета.Вставить("id_type_price", XMLСтрока(Выборка.ВидЦен));
			Массив.Добавить(СтруктураОтвета);
		КонецЦикла;
		Возврат ПодготовитьHTTPОтвет(Ложь, Массив);
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения вида цен ценовых групп!");			
	КонецПопытки;
	
КонецФункции

Функция AgreementProductsPrice(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПакетЗапросов = ПолучитьПакет();
		Массив = Новый Массив;
		Выборка = ПакетЗапросов[6].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("id_agreement", XMLСтрока(Выборка.Соглашение));
			СтруктураОтвета.Вставить("id_product", XMLСтрока(Выборка.Номенклатура));
			СтруктураОтвета.Вставить("id_type_price", XMLСтрока(Выборка.ВидЦены));
			Массив.Добавить(СтруктураОтвета);
		КонецЦикла;
		Возврат ПодготовитьHTTPОтвет(Ложь, Массив);
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения вида цен номенклатуры!");			
	КонецПопытки;
	
КонецФункции

Функция AgreementProductsGroup(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПакетЗапросов = ПолучитьПакет();
		Массив = Новый Массив;
		Выборка = ПакетЗапросов[7].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("id_group_price", XMLСтрока(Выборка.ЦеноваяГруппа));
			СтруктураОтвета.Вставить("id_product", XMLСтрока(Выборка.Номенклатура));
			Массив.Добавить(СтруктураОтвета);
		КонецЦикла;
		Возврат ПодготовитьHTTPОтвет(Ложь, Массив);
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения номенклатуры ценовой группы!");			
	КонецПопытки;
	
КонецФункции

Функция AgreementKlients(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПакетЗапросов = ПолучитьПакет();
		Массив = Новый Массив;
		Выборка = ПакетЗапросов[8].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("email", XMLСтрока(Выборка.АдресЭП));
			СтруктураОтвета.Вставить("name", XMLСтрока(Выборка.ФИО));
			СтруктураОтвета.Вставить("telephone", XMLСтрока(Выборка.НомерТелефона));
			СтруктураОтвета.Вставить("id_partner", XMLСтрока(Выборка.Партнер));
			СтруктураОтвета.Вставить("id_business_region", XMLСтрока(Выборка.БизнесРегион));
			СтруктураОтвета.Вставить("id_agreement", XMLСтрока(Выборка.Соглашение));
			СтруктураОтвета.Вставить("extra_delivery", Выборка.Соглашение.Доставка);
			СтруктураОтвета.Вставить("extra_delay", Выборка.Соглашение.Отсрочка);
			СтруктураОтвета.Вставить("extra_card", Выборка.Соглашение.ОплатаКартой);
			
			Массив.Добавить(СтруктураОтвета);
		КонецЦикла;
		Возврат ПодготовитьHTTPОтвет(Ложь, Массив);
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения клиентов и их соглашений!");			
	КонецПопытки;
	
КонецФункции

Функция AgreementRegions(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПакетЗапросов = ПолучитьПакет();
		Массив = Новый Массив;
		Выборка = ПакетЗапросов[9].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("id_business_region", XMLСтрока(Выборка.БизнесРегион));
			СтруктураОтвета.Вставить("business_region", Строка(Выборка.БизнесРегион));
			
			Массив.Добавить(СтруктураОтвета);
		КонецЦикла;
		Возврат ПодготовитьHTTPОтвет(Ложь, Массив);
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения бизнес-регионов!");			
	КонецПопытки;
	
КонецФункции

Функция AgreementGroupPriceTransit(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПакетЗапросов = ПолучитьПакет();
		Массив = Новый Массив;
		Выборка = ПакетЗапросов[10].Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("id_agreement", XMLСтрока(Выборка.Соглашение));
			СтруктураОтвета.Вставить("id_group_price", XMLСтрока(Выборка.ЦеноваяГруппа));
			СтруктураОтвета.Вставить("id_type_price", XMLСтрока(Выборка.ВидЦен));
			СтруктураОтвета.Вставить("group_price", Строка(Выборка.ЦеноваяГруппа));
			СтруктураОтвета.Вставить("type_price",Строка(Выборка.ВидЦен));
			
			Массив.Добавить(СтруктураОтвета);
		КонецЦикла;
		Возврат ПодготовитьHTTPОтвет(Ложь, Массив);
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения вида цен ценовых групп транзита!");			
	КонецПопытки;
	
КонецФункции

//начальные параметры: XML_ID, SUMMA, EMAIL, CARD_NUM
Функция PrintСheck(ПараметрыЗапроса) 
	Ответ = Новый HTTPСервисОтвет(200);
	
	УстановитьПривилегированныйРежим(Истина);
	Если ПараметрыЗапроса.Количество() = 0 Тогда
		Ответ = ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Отсутствуют параметры"); 
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Переданы пустые параметры");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("XML_ID") И ПараметрыЗапроса.XML_ID<>"" Тогда
		ИДЗаказа = ПараметрыЗапроса.XML_ID;
	Иначе
		Ответ = ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Передан пустой XML_ID");
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Передан пустой XML_ID");
		Возврат Ответ;
	КонецЕсли;
	
	СуммаОплаты = 0;
	Если ПараметрыЗапроса.Свойство("SUMMA") Тогда 
		СуммаОплаты = Число(ПараметрыЗапроса.SUMMA);
	КонецЕсли;
	
	Если СуммаОплаты <= 0 Тогда
		Ответ = ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Переданная сумма оплаты равна 0");
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "Передана сумма оплаты 0");
		Возврат Ответ;
	КонецЕсли;

	ИДПлатежнойСистемы = "21"; // Эквайринговый Терминал по умолчанию ("Сайт, СБП Альфа (Альтерра)") 
	Если ПараметрыЗапроса.Свойство("PS_ID") Тогда 
		ИДПлатежнойСистемы = Строка(ПараметрыЗапроса.PS_ID);
	КонецЕсли;
	
	//Временный костыль для СБП Альфа
	Если ИДПлатежнойСистемы = "19" Тогда
		ИДПлатежнойСистемы = "21";
	КонецЕсли;
	
	ЭквайринговыйТерминал = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду(ИДПлатежнойСистемы);
	
	//получить заказ клиента
	Ответ = НайтиЗаказКлиента(ИДЗаказа);
	//log
	ПараметрыЛоговДляКассы = Новый Структура("АдресХраненияЛогов,ВремяХраненияВДнях");
	УстановитьПривилегированныйРежим(Истина);
	КассаОплат = Константы.КассаИнтернетМагазина.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	ПараметрыЛоговДляКассы.АдресХраненияЛогов = КассаОплат.АдресХраненияЛогов;
	ПараметрыЛоговДляКассы.ВремяХраненияВДнях = КассаОплат.ВремяХраненияВДнях;
	
	АТОЛСревер.ЗаписатьЛогВФайл(ПараметрыЛоговДляКассы, "ИДЗаказа="+ИДЗаказа+";СуммаОплаты="+СуммаОплаты, "", "Параметры запроса");
	
	АТОЛСревер.ЗаписатьЛогВФайл(ПараметрыЛоговДляКассы, Ответ, Ответ, "Поиск заказа");
	Если ТипЗнч(Ответ) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ЗаказКлиента = Ответ;
	
	Ответ = НайтиДокументОплаты(ЗаказКлиента, СуммаОплаты, ЭквайринговыйТерминал);
	//log
	АТОЛСревер.ЗаписатьЛогВФайл(ПараметрыЛоговДляКассы, ЗаказКлиента, Ответ, "Поиск оплаты");
	
	Если ТипЗнч(Ответ)=Тип("HTTPСервисОтвет") Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ЭквайринговаяОперация = Ответ;

//получить данные партнера для отправки уведомления
	АдресУведомленияКлиента = ""; //email или телефон
	ОтправитьНаEmail = Ложь;
	Если ПараметрыЗапроса.Свойство("EMAIL") И СтрЗаменить(ПараметрыЗапроса.EMAIL, " ", "") <> "" Тогда
		АдресУведомленияКлиента = ПараметрыЗапроса.EMAIL;
		ОтправитьНаEmail = Истина;
	Иначе
		//получить данные партнёра
		КонтактныеДанныеПартнера = АльтерраОбщегоНазначения.ПолучитьТелефонПочтуПартнера(ЗаказКлиента.Партнер); 
		ЭПКлиента = "";
		НомерКлиента = "";
		Для каждого СтрДанных из КонтактныеДанныеПартнера Цикл
			Если СтрДанных.АдресЭП <> "" Тогда
				ЭПКлиента = СтрДанных.АдресЭП;
				Прервать;
			КонецЕсли;
			Если СтрДанных.НомерТелефона <> "" И НомерКлиента="" Тогда
				НомерКлиента = СтрДанных.НомерТелефона;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭПКлиента<>"" Тогда
			//если есть email,
			АдресУведомленияКлиента = ЭПКлиента;
			ОтправитьНаEmail = Истина;
		ИначеЕсли НомерКлиента <> "" Тогда
			//если нет - номер телефона в формате +{Ц}
			Если Лев(НомерКлиента,1) = "9" Тогда
				АдресУведомленияКлиента = "+7"+НомерКлиента;
			Иначе
				АдресУведомленияКлиента = НомерКлиента;
			КонецЕсли;
		Иначе
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "У клиента не найден email и номер телефона. Нужно либо отправить с сайта, либо указать в клиенте в 1С", "");
			ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , "У клиента не найден email и номер телефона");
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;
	
	//
	НомерКарты = "";
	Если ПараметрыЗапроса.Свойство("CARD_NUM") Тогда
		   НомерКарты = СтрЗаменить(ПараметрыЗапроса.CARD_NUM, " ", "");
	КонецЕсли;
	
	ИдентификаторОплаты = ?(ПараметрыЗапроса.Свойство("PS_INVOICE_ID"), ПараметрыЗапроса.PS_INVOICE_ID, "");	
	
	Ответ = АльтерраОбщегоНазначения.ПроверкаНаНаличиеЗаписейВРегистре(ЗаказКлиента, ЭквайринговаяОперация, СуммаОплаты, АдресУведомленияКлиента, НомерКарты, ЭквайринговыйТерминал, ИдентификаторОплаты);
	
	//log
	АТОЛСревер.ЗаписатьЛогВФайл(ПараметрыЛоговДляКассы, ЗаказКлиента, Ответ, "Ответ 1С сайту");
	
	Возврат Ответ;
КонецФункции // PrintСheck()    

Функция PrintСheckArray(Запрос, ПараметрыЗапроса)  
	УстановитьПривилегированныйРежим(Истина); 
	
	СтатусОшибки = Ложь;
	ТекстОтвета = "";
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Если ПараметрыЗапроса.Свойство("array") И ЗначениеЗаполнено(ПараметрыЗапроса.array) Тогда
			Массив = ПараметрыЗапроса.array;  
		КонецЕсли;
		
		Если ПараметрыЗапроса.Свойство("XML_ID") Тогда
			Массив = Новый Массив;
			Массив.Добавить(ПараметрыЗапроса);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Массив) Тогда
			НомерЭлемента = 1;
			Для Каждого ЭлементМассива Из Массив Цикл             
				Ответ = PrintСheck_ОбработатьЭлементМассива(ЭлементМассива);
				Если ТипЗнч(Ответ) = Тип("Структура") Тогда
					Если Ответ.СтатусОшибки Тогда
						СтатусОшибки = Истина;
					КонецЕсли;    
					
					ТекстОтвета = ТекстОтвета + " Элемент " + НомерЭлемента + ": " + Ответ.Сообщение;
				Иначе                  
					СтатусОшибки = Истина;      
					ТекстОтвета = ТекстОтвета + " Элемент " + НомерЭлемента + ": " + "Неверный формат данных";	
				КонецЕсли;
				
				НомерЭлемента = НомерЭлемента + 1;
			КонецЦикла;
		Иначе            
			СтатусОшибки = Истина;      
			ТекстОтвета = "Ошибка в данных";
		КонецЕсли;  
	Иначе                    
		СтатусОшибки = Истина;      
		ТекстОтвета = "Переданы пустые параметры";
	КонецЕсли;
	
	// Записать лог
	ПараметрыЗапроса = ДопМодульСервер.ПолучитьПараметрыHTTPЗапроса(Запрос);
	Тело = ДопМодульСервер.ФорматироватьJsonТекст(ОбщийHTTPСервер.ПодготовитьОтвет(СтатусОшибки, ТекстОтвета));  
	ДопМодульСервер.ЗаписатьЛогЛК(ПараметрыЗапроса, Тело, СтатусОшибки);
	
	Возврат ОбщийHTTPСервер.ПодготовитьHTTPОтвет(СтатусОшибки, ТекстОтвета);
	
КонецФункции    

Функция PrintСheck_ОбработатьЭлементМассива(ПараметрыЗапроса)
	Если ПараметрыЗапроса.Свойство("XML_ID") И ЗначениеЗаполнено(ПараметрыЗапроса.XML_ID) Тогда 
		ИДЗаказа = ПараметрыЗапроса.XML_ID;
	Иначе               
		Возврат Ошибка("Передан пустой XML_ID", Истина);
	КонецЕсли;
	
	Попытка
		Если ПараметрыЗапроса.Свойство("SUMMA") И ЗначениеЗаполнено(ПараметрыЗапроса.SUMMA) И Число(ПараметрыЗапроса.SUMMA) > 0 Тогда 
			СуммаОплаты = Число(ПараметрыЗапроса.SUMMA);    
		Иначе
			Возврат Ошибка("Переданная сумма оплаты равна 0", Истина);
		КонецЕсли; 
	Исключение
		Возврат Ошибка("Переданная сумма оплаты равна 0", Истина);
	КонецПопытки;
	
	Если ПараметрыЗапроса.Свойство("CARD_NUM") Тогда
		НомерКарты = СтрЗаменить(ПараметрыЗапроса.CARD_NUM, " ", "");
	Иначе
		НомерКарты = "";
	КонецЕсли;
	
	ИдентификаторОплаты = ПолучитьИдентификаторОплаты(ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Свойство("PS_ID") Тогда
		ИДПлатежнойСистемы = Строка(ПараметрыЗапроса.PS_ID);
		//Временный костыль для СБП Альфа
		Если ИДПлатежнойСистемы = "19" Тогда
			ИДПлатежнойСистемы = "21";
		КонецЕсли; 
		//-
		ЭквайринговыйТерминал = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду(ИДПлатежнойСистемы);
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда // Эквайринговый Терминал по умолчанию ("Сайт, СБП Открытие (Альтерра)" 
		ЭквайринговыйТерминал = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("21");
	КонецЕсли;                
	
	ЗаказКлиента = НайтиЗаказКлиента(ИДЗаказа, Истина);
	КассаОплат = Константы.КассаИнтернетМагазина.Получить();        
	ПараметрыЛоговДляКассы = Новый Структура("АдресХраненияЛогов, ВремяХраненияВДнях", КассаОплат.АдресХраненияЛогов, КассаОплат.ВремяХраненияВДнях);	
	АТОЛСревер.ЗаписатьЛогВФайл(ПараметрыЛоговДляКассы, "ИДЗаказа="+ИДЗаказа+";СуммаОплаты="+СуммаОплаты, "", "Параметры запроса");	
	АТОЛСревер.ЗаписатьЛогВФайл(ПараметрыЛоговДляКассы, ЗаказКлиента, ЗаказКлиента, "Поиск заказа");	
	Если ТипЗнч(ЗаказКлиента) = Тип("Структура") Тогда
		Возврат ЗаказКлиента; 
	ИначеЕсли Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Возврат Ошибка("Не найден Заказ Клиента", Истина);
	КонецЕсли;             
	
	ЭквайринговаяОперация = НайтиДокументОплаты(ЗаказКлиента, СуммаОплаты, ЭквайринговыйТерминал, Истина);
	АТОЛСревер.ЗаписатьЛогВФайл(ПараметрыЛоговДляКассы, ЗаказКлиента, ЭквайринговаяОперация, "Поиск оплаты");	
	Если ТипЗнч(ЭквайринговаяОперация) = Тип("Структура") Тогда
		Возврат ЭквайринговаяОперация;
	ИначеЕсли Не ЗначениеЗаполнено(ЭквайринговаяОперация) Тогда
		Возврат Ошибка("Не найдена Эквайринговая Операция", Истина);
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("EMAIL") И СтрЗаменить(ПараметрыЗапроса.EMAIL, " ", "") <> "" Тогда
		ОтправитьНаEmail = Истина;
		АдресУведомленияКлиента = ПараметрыЗапроса.EMAIL;
	Иначе                     
		//получить данные партнёра
		КонтактныеДанныеПартнера = АльтерраОбщегоНазначения.ПолучитьТелефонПочтуПартнера(ЗаказКлиента.Партнер); 
		ЭПКлиента = "";
		НомерКлиента = "";
		Для каждого СтрДанных из КонтактныеДанныеПартнера Цикл
			Если ЗначениеЗаполнено(СтрДанных.АдресЭП) Тогда
				ЭПКлиента = СтрДанных.АдресЭП;
				Прервать;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрДанных.НомерТелефона) И Не ЗначениеЗаполнено(НомерКлиента) Тогда
				НомерКлиента = СтрДанных.НомерТелефона;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЭПКлиента) Тогда // если есть email
			ОтправитьНаEmail = Истина;
			АдресУведомленияКлиента = ЭПКлиента;
		ИначеЕсли ЗначениеЗаполнено(НомерКлиента) Тогда // если нет - номер телефона в формате +{Ц}
			ОтправитьНаEmail = Ложь;
			Если Лев(НомерКлиента,1) = "9" Тогда
				АдресУведомленияКлиента = "+7" + НомерКлиента;
			Иначе
				АдресУведомленияКлиента = НомерКлиента;
			КонецЕсли;
		Иначе             
			Возврат Ошибка("У клиента не найден email и номер телефона. Нужно либо отправить с сайта, либо указать в клиенте в 1С", Истина);
		КонецЕсли;
	КонецЕсли;
	                      
	Ответ = ПроверкаНаНаличиеЗаписейВРегистре(ЗаказКлиента, ЭквайринговаяОперация, СуммаОплаты, АдресУведомленияКлиента, НомерКарты, ЭквайринговыйТерминал, ИдентификаторОплаты);
	АТОЛСревер.ЗаписатьЛогВФайл(ПараметрыЛоговДляКассы, ЗаказКлиента, Ответ, "Ответ 1С сайту");	
	Возврат Ответ;
КонецФункции

Функция ПолучитьИдентификаторОплаты(ПараметрыЗапроса)
	
	ИдентификаторОплаты = "";
	НомерЗаказа = "";
	
	Если ПараметрыЗапроса.Свойство("PS_INVOICE_ID") Тогда
		ИдентификаторОплаты = ПараметрыЗапроса.PS_INVOICE_ID;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторОплаты) И ПараметрыЗапроса.Свойство("PS_STATUS_MESSAGE") И ЗначениеЗаполнено(ПараметрыЗапроса.PS_STATUS_MESSAGE) Тогда
		МассивСообщения = СтрРазделить(ПараметрыЗапроса.PS_STATUS_MESSAGE, " ");
		Если МассивСообщения.Количество() > 0 Тогда
			Попытка
				НомерЗаказаСтрока = МассивСообщения[МассивСообщения.Количество() - 1];
				НомерЗаказаЧисло = Число(НомерЗаказаСтрока);
				НомерЗаказа = НомерЗаказаСтрока;
			Исключение
				НомерЗаказа = "";
			КонецПопытки;
		КонецЕсли;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ИдентификаторОплаты) И ЗначениеЗаполнено(НомерЗаказа) Тогда
		
		ТекДата = ТекущаяДатаСеанса();
		Сутки = 24 * 60 * 60;
		
		НастройкиДС = ИнтеграцияБанки.ПолучитьНастройкиДинамическиеСсылки(ПредопределенноеЗначение("Перечисление.ТипДинамическойСсылки.Сайт")).Ответ;
		ПараметрыСтатистикиДС = ИнтеграцияБанки.ПараметрыСтатистикаДинамическихСсылок(НастройкиДС, 
			НачалоДня(ТекДата - Сутки), НачалоДня(ТекДата + Сутки));
		ОплатаЗаказа = ИнтеграцияБанки.ПолучитьСтатистикуДинамическихСсылок(НастройкиДС, ПараметрыСтатистикиДС, НомерЗаказа).Ответ;
		
		Если ТипЗнч(ОплатаЗаказа) = Тип("Структура") И ОплатаЗаказа.Свойство("УИД") Тогда
			ИдентификаторОплаты = ОплатаЗаказа.УИД; 
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат ИдентификаторОплаты;
	
КонецФункции

Функция GetUnloadingCost(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		//Входящие данные
		Этаж = Число(ВходящиеДанные["level"]);
		Разгрузка = Булево(ВходящиеДанные["unloading"]);
		ПодъемНаЭтаж = Булево(ВходящиеДанные["risetothefloor"]);
		Лифт = Булево(ВходящиеДанные["lift"]);
		ЛифтГрузовой = Булево(ВходящиеДанные["servicelift"]);
		Зона = Число(ВходящиеДанные["zone"]);
		
		МассивНоменклатур = ВходящиеДанные["goods"];
		
		Если ВходящиеДанные.Свойство("slicing") Тогда
			МассивНарезки = ВходящиеДанные["slicing"];
		Иначе
			МассивНарезки = Новый Массив();
		КонецЕсли;
		
		ТЗ_Товары = Новый ТаблицаЗначений();
		ТЗ_Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗ_Товары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		
		//Товары
		Если ЗначениеЗаполнено(МассивНоменклатур) И ТипЗнч(МассивНоменклатур) = Тип("Массив") Тогда
			Попытка
				Для Инд = 0 По МассивНоменклатур.Количество() - 1 Цикл
					Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивНоменклатур[Инд].ref));
					Если ПустаяСтрока(Номенклатура.Код) Тогда
						Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения стоимости разгрузки: Передан неверный массив");
					КонецЕсли;    
					СтрокаТЗ = ТЗ_Товары.Добавить();
					СтрокаТЗ.Номенклатура = Номенклатура;
					СтрокаТЗ.Количество = МассивНоменклатур[Инд].count;
				КонецЦикла;
			Исключение
				Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения стоимости разгрузки: Передан неверный массив");
			КонецПопытки;
		Иначе
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения стоимости разгрузки: Передан неверный массив");
		КонецЕсли;
		
		ТЗ_ТоварыНарезки = Новый ТаблицаЗначений();
		ТЗ_ТоварыНарезки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗ_ТоварыНарезки.Колонки.Добавить("КоличествоРезов", Новый ОписаниеТипов("Число"));
		
		//Нарезка
		Если ЗначениеЗаполнено(МассивНарезки) И ТипЗнч(МассивНарезки) = Тип("Массив") Тогда				
			Попытка
				Для Инд = 0 По МассивНарезки.Количество() - 1 Цикл
					Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивНоменклатур[Инд].ref));
					Если ПустаяСтрока(Номенклатура.Код) Тогда
						Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения стоимости разгрузки: Передан неверный массив нарезки");
					КонецЕсли;    
					СтрокаТЗ = ТЗ_ТоварыНарезки.Добавить();
					СтрокаТЗ.Номенклатура = Номенклатура;
					СтрокаТЗ.КоличествоРезов = МассивНарезки[Инд].numberofcuts;
				КонецЦикла;
			Исключение
				Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения стоимости разгрузки: Передан неверный массив нарезки");
			КонецПопытки;
		КонецЕсли;
		
		СтруктураНоменклатуры = Новый Структура();
		СтруктураНоменклатуры.Вставить("Товары",ТЗ_Товары);
		СтруктураНоменклатуры.Вставить("Нарезка",ТЗ_ТоварыНарезки);
		
		//Вариант разгрузки
		СпособРазгрузки = Перечисления.СпособыРазгрузки.ПустаяСсылка(); 
		
		Если ПодъемНаЭтаж Тогда
			Если ЛифтГрузовой ИЛИ Лифт Тогда
				СпособРазгрузки = Перечисления.СпособыРазгрузки.Лифт;
			Иначе
				СпособРазгрузки = Перечисления.СпособыРазгрузки.Лестница;
			КонецЕсли;
		ИначеЕсли Разгрузка Тогда
			СпособРазгрузки = Перечисления.СпособыРазгрузки.Разгрузка;
		КонецЕсли;	
		
		ВариантРазгрузки = УправлениеЛогистикойСервер.ПолучитьВариантРазгрузкиПоСпособу(СпособРазгрузки,ЛифтГрузовой);
		
		Если ВариантРазгрузки.Пустая() Тогда
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения стоимости разгрузки: вариант разгрузки не определен");
		КонецЕсли;
		
		//Зона
		ГлобальнаяЗона = Перечисления.ЗоныДоставкиКлиента.ПустаяСсылка();
		
		Если Зона = 1 Тогда
			ГлобальнаяЗона = Перечисления.ЗоныДоставкиКлиента.Зона1; 
		ИначеЕсли Зона = 2 Тогда
			ГлобальнаяЗона = Перечисления.ЗоныДоставкиКлиента.Зона2; 
		Конецесли;
		
		Если ГлобальнаяЗона.Пустая() Тогда
			Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения стоимости разгрузки: зона не определена");
		КонецЕсли;
		
		//Расчет
		ТоварыКРазгрузке = УправлениеЛогистикойСервер.ПолучитьТаблицуРазгрузкиТовара(СтруктураНоменклатуры);
		
		Если ЛифтГрузовой Тогда
			ПараметрыОтбора = Новый Структура("Разгрузка,Лестница,Лифт,ЛифтГрузовой",Истина,Ложь,Ложь,Ложь);
		ИначеЕсли Лифт Тогда
			ПараметрыОтбора = Новый Структура("Разгрузка,Лестница,Лифт",Истина,Ложь,Ложь);
		Иначе	
			ПараметрыОтбора = Новый Структура("Разгрузка,Лестница",Истина,Ложь);
		КонецЕсли;
		
		НеГабаритМассивСтрок = ТоварыКРазгрузке.НайтиСтроки(ПараметрыОтбора);
		
		МассивНеГабарит = Новый Массив();
		
		Для каждого СтрокаНеГабарита из НеГабаритМассивСтрок Цикл
			МассивНеГабарит.Добавить(XMLСтрока(СтрокаНеГабарита.Номенклатура.УникальныйИдентификатор()));
		КонецЦикла;
		
		ЕстьНеГабарит = МассивНеГабарит.Количество()>0;
		
		МассивСпособов = Новый Массив;
		МассивСпособов.Добавить(СпособРазгрузки);
		
		Если СпособРазгрузки = Перечисления.СпособыРазгрузки.Лифт Тогда
			МассивСпособов.Добавить(Перечисления.СпособыРазгрузки.Лестница);
			МассивСпособов.Добавить(Перечисления.СпособыРазгрузки.Разгрузка);
		ИначеЕсли СпособРазгрузки = Перечисления.СпособыРазгрузки.Лестница Тогда
			МассивСпособов.Добавить(Перечисления.СпособыРазгрузки.Разгрузка);
		КонецЕсли;
		
		ИтоговыйВес = 0;
		ИтоговыйОбъем = 0;
		СтоимостьРазгрузки = 0;
		СтоимостьПодъемаНаЭтаж = 0;
		КоличествоСпособовРазгрузки = 0;
		ВремяРазгрузки = 0;
		
		Для каждого ЗначениеМассива из МассивСпособов Цикл
			
			СтоимостьУслуги = 0;
			СтоимостьУслугиНегабарит = 0;
			Вес = 0;
			ВесНегабарит = 0;
			Объем = 0;
			
			Если ЗначениеМассива = Перечисления.СпособыРазгрузки.Лифт Тогда
				ИмяКолонки = Строка(ЗначениеМассива) + ?(ЛифтГрузовой,"Грузовой","");
			Иначе
				ИмяКолонки = Строка(ЗначениеМассива);
			КонецЕсли;
			
			МассивСтрок = ТоварыКРазгрузке.НайтиСтроки(Новый Структура(ИмяКолонки,Истина));
			
			Если МассивСтрок.Количество()> 0 Тогда 								
				
				Для каждого СтрокаТовара из МассивСтрок Цикл
					Если СтрокаТовара.Негабарит Тогда
						ВесНегабарит = ВесНегабарит + СтрокаТовара.Вес;
					Иначе
						Вес = Вес+СтрокаТовара.Вес;
					КонецЕсли;
					ТоварыКРазгрузке.Удалить(СтрокаТовара);
				КонецЦикла;
				
				//Если ВесНегабарит>0 Тогда
				//	СтруктураСтоимостиНегабарит = УправлениеЛогистикойСервер.ПолучитьСтоимостиРазгрузки(ВесНегабарит,Этаж,ТекущаяДата(),ГлобальнаяЗона,Истина,ЗначениеМассива); 
				//	СтоимостьУслугиНегабарит = СтруктураСтоимостиНегабарит.ЦенаДляКлиента;
				//	ВремяРазгрузки = ВремяРазгрузки + СтруктураСтоимостиНегабарит.ВремяРазгрузки
				//КонецЕсли;
				//
				//Если Вес>0 Тогда
				//	СтруктураСтоимости = УправлениеЛогистикойСервер.ПолучитьСтоимостиРазгрузки(Вес,Этаж,ТекущаяДата(),ГлобальнаяЗона,Ложь,ЗначениеМассива);
				//	СтоимостьУслуги = СтруктураСтоимости.ЦенаДляКлиента;
				//	ВремяРазгрузки = ВремяРазгрузки + СтруктураСтоимости.ВремяРазгрузки
				//КонецЕсли;
				
				Если Вес + ВесНегабарит > 0 Тогда
					СтруктураСтоимостиНегабарит = УправлениеЛогистикойСервер.ПолучитьСтоимостиРазгрузки(Вес + ВесНегабарит,Этаж,ТекущаяДата(),ГлобальнаяЗона,ВесНегабарит > 0, ЗначениеМассива); 
					СтоимостьУслуги = СтруктураСтоимостиНегабарит.ЦенаДляКлиента;
					ВремяРазгрузки = ВремяРазгрузки + СтруктураСтоимостиНегабарит.ВремяРазгрузки
				КонецЕсли;
				
				//Если ЗначениеМассива=Перечисления.СпособыРазгрузки.Разгрузка Тогда
				//	СтоимостьРазгрузки = СтоимостьРазгрузки + СтоимостьУслугиНегабарит + СтоимостьУслуги;
				//Иначе
				//	СтоимостьПодъемаНаЭтаж = СтоимостьПодъемаНаЭтаж + СтоимостьУслугиНегабарит + СтоимостьУслуги;
				//КонецЕсли;
				
				Если ЗначениеМассива=Перечисления.СпособыРазгрузки.Разгрузка Тогда
					СтоимостьРазгрузки = СтоимостьРазгрузки + СтоимостьУслуги;
				Иначе
					СтоимостьПодъемаНаЭтаж = СтоимостьПодъемаНаЭтаж + СтоимостьУслуги;
				КонецЕсли;
				
				КоличествоСпособовРазгрузки = КоличествоСпособовРазгрузки + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		МинимальнаяСтоимостьДляКлиента = УправлениеЛогистикойСервер.МинимальнаяСтоимостьРазгрузкиДляКлиента();
		
		Если КоличествоСпособовРазгрузки>1 Тогда
			
			Если ВремяРазгрузки< 1 Тогда 
				СтоимостьПодъемаНаЭтаж = СтоимостьПодъемаНаЭтаж - МинимальнаяСтоимостьДляКлиента;
			КонецЕсли;
			
		КонецЕсли;
		
		//Исходящие данные
		
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("unloadingcost",СтоимостьРазгрузки);
		СтруктураОтвета.Вставить("liftingcost",СтоимостьПодъемаНаЭтаж);
		СтруктураОтвета.Вставить("oversized",МассивНеГабарит);
		
		Возврат ПодготовитьHTTPОтвет(Ложь, СтруктураОтвета);
		
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка получения стоимости разгрузки!");			
	КонецПопытки;
	
КонецФункции

Функция GetInfoLegalEntity(ВходящиеДанные) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		АдресЭП = ВходящиеДанные["Email"];		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Партнер,
		|	Партнеры.Наименование КАК ПартнерНаименование,	
		|	Партнеры.БизнесРегион,	
		|	ЕСТЬNULL(БизнесРегионы.Наименование, &ПустаяСтрока) КАК БизнесРегионНаименование,	
		|	ЕСТЬNULL(ПартнерыТелефон.НомерТелефона, &ПустаяСтрока) КАК НомерТелефона, 
		|	ЕСТЬNULL(ПартнерыАдресЭП.АдресЭП, &ПустаяСтрока) КАК АдресЭП,
		|	НЕ ГруппаПартнеров.Ссылка ЕСТЬ NULL КАК ЭтоБригадир
		|ПОМЕСТИТЬ втАдресЭП
		|ИЗ 
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыАдресЭП
		|	СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры    
		|		ПО ПартнерыАдресЭП.АдресЭП = &АдресЭП
		|		И ПартнерыАдресЭП.Ссылка = Партнеры.Ссылка  
		|		И ПартнерыАдресЭП.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПартнера) 
		|		И НЕ Партнеры.ПометкаУдаления	    		
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыТелефон  
		|		ПО Партнеры.Ссылка = ПартнерыТелефон.Ссылка
		|		И ПартнерыТелефон.НомерТелефона <> &ПустаяСтрока    
		|		И ПартнерыТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера)   
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ГруппаПартнеров
		|		ПО ГруппаПартнеров.Ссылка = Партнеры.Ссылка
		|		И ГруппаПартнеров.Свойство.Имя = &ИмяГруппыПартнеров
		|		И ГруппаПартнеров.Значение.Наименование = &ГруппаБригадиры
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БизнесРегионы КАК БизнесРегионы
		|		ПО Партнеры.БизнесРегион = БизнесРегионы.Ссылка 
		|ГДЕ				  
		|	ПартнерыАдресЭП.АдресЭП = &АдресЭП  
		|	И (НЕ ГруппаПартнеров.Ссылка ЕСТЬ NULL
		|		ИЛИ Партнеры.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.Компания))
		|;		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Партнер,
		|	ПартнерНаименование,	
		|	БизнесРегион,	
		|	БизнесРегионНаименование,	
		|	НомерТелефона, 
		|	АдресЭП,
		|	ЭтоБригадир   
		|ПОМЕСТИТЬ втПартнер

		|ИЗ 
		|	втАдресЭП     
		|;		
		|////////////////////////////////////////////////////////////////////////////////
		|// Дубли по почте
		|ВЫБРАТЬ	 
		|	втАдресЭП.Партнер,
		|	втАдресЭП.ПартнерНаименование,	
		|	втАдресЭП.БизнесРегион,	
		|	втАдресЭП.БизнесРегионНаименование,	
		|	втАдресЭП.НомерТелефона, 
		|	втАдресЭП.АдресЭП,
		|	втАдресЭП.ЭтоБригадир  
		|ИЗ 	
		|	втАдресЭП
		|	ЛЕВОЕ СОЕДИНЕНИЕ втПартнер
		|		ПО втАдресЭП.Партнер = втПартнер.Партнер
		|ГДЕ 
		|	втПартнер.Партнер ЕСТЬ NULL	
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПартнер.Партнер, 
		|	втПартнер.ПартнерНаименование,	
		|	втПартнер.БизнесРегион,	
		|	втПартнер.БизнесРегионНаименование,	
		|	втПартнер.НомерТелефона, 
		|	втПартнер.АдресЭП,
		|	втПартнер.ЭтоБригадир,  	
		|	ПартнерыСегмента.Сегмент 
		|ПОМЕСТИТЬ втСегменты
		|ИЗ     
		|	втПартнер
		|	СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|	ПО втПартнер.Партнер = ПартнерыСегмента.Партнер 
		|;             
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ     
		|	втСегменты.Партнер, 
		|	втСегменты.ПартнерНаименование,	
		|	втСегменты.БизнесРегион,
		|	втСегменты.БизнесРегионНаименование,
		|	втСегменты.НомерТелефона, 
		|	втСегменты.АдресЭП,
		|	втСегменты.ЭтоБригадир,
		|	СоглашенияСКлиентами.Ссылка КАК Соглашение, 
		|	СоглашенияСКлиентами.Наименование КАК СоглашениеНаименование, 
		|	-1 КАК Приоритет,
		|	СоглашенияСКлиентами.Отсрочка КАК Отсрочка,
		|	СоглашенияСКлиентами.Доставка КАК Доставка,
		|	СоглашенияСКлиентами.ОплатаКартой КАК ОплатаКартой,
		|	СоглашенияСКлиентами.Склад КАК Склад,
		|	СоглашенияСКлиентами.ГруппаВидовЦен КАК ГруппаВидовЦен
		|ПОМЕСТИТЬ втСоглашения
		|ИЗ
		|	втСегменты
		|	СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами     
		|		ПО втСегменты.Партнер = СоглашенияСКлиентами.Партнер
		|	СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ДополнительныеРеквизиты КАК СоглашенияРеквизиты
		|		ПО СоглашенияСКлиентами.Ссылка = СоглашенияРеквизиты.Ссылка
		|ГДЕ
		|	СоглашенияРеквизиты.Свойство.Имя = &ВыгружатьНаСайт
		|	И СоглашенияРеквизиты.Значение = ИСТИНА
		|	И СоглашенияРеквизиты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|ОБЪЕДИНИТЬ ВСЕ     
		|ВЫБРАТЬ РАЗЛИЧНЫЕ  
		|	втСегменты.Партнер, 
		|	втСегменты.ПартнерНаименование,	
		|	втСегменты.БизнесРегион,		
		|	втСегменты.БизнесРегионНаименование,		
		|	втСегменты.НомерТелефона, 
		|	втСегменты.АдресЭП,
		|	втСегменты.ЭтоБригадир,
		|	СоглашенияСКлиентами.Ссылка КАК Соглашение,       
		|	СоглашенияСКлиентами.Наименование КАК СоглашениеНаименование, 
		|	ВЫБОР
		|		КОГДА СоглашенияСКлиентами.Приоритет > 1 
		|		ТОГДА СоглашенияСКлиентами.Приоритет
		|		ИНАЧЕ 100
		|	КОНЕЦ КАК Приоритет,
		|	СоглашенияСКлиентами.Отсрочка КАК Отсрочка,
		|	СоглашенияСКлиентами.Доставка КАК Доставка,
		|	СоглашенияСКлиентами.ОплатаКартой КАК ОплатаКартой,
		|	СоглашенияСКлиентами.Склад КАК Склад,
		|	СоглашенияСКлиентами.ГруппаВидовЦен КАК ГруппаВидовЦен
		|ИЗ
		|	втСегменты
		|	СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами        
		|		ПО втСегменты.Сегмент = СоглашенияСКлиентами.СегментПартнеров
		|ГДЕ
		|	СоглашенияСКлиентами.Типовое
		|	И СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|	И СоглашенияСКлиентами.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|;           
		|////////////////////////////////////////////////////////////////////////////////
		|// Все соглашения по приоритетам
		|ВЫБРАТЬ 
		|	Соглашение, 
		|	СоглашениеНаименование, 
		|	Приоритет
		|ИЗ
		|	втСоглашения         
		|УПОРЯДОЧИТЬ ПО 
		|	Приоритет,
		|	СоглашениеНаименование
		|;	        
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	втСоглашения.Партнер, 
		|	втСоглашения.ПартнерНаименование,	
		|	втСоглашения.БизнесРегион,		
		|	втСоглашения.БизнесРегионНаименование,		
		|	втСоглашения.НомерТелефона, 
		|	втСоглашения.АдресЭП,
		|	втСоглашения.ЭтоБригадир,
		|	втСоглашения.Соглашение, 
		|	втСоглашения.СоглашениеНаименование, 
		|	ВидыЦен.Ссылка КАК ВидЦены,
		|	ВидыЦен.Наименование КАК ВидЦеныНаименование,
		|	СтруктураПредприятия.ИдентификаторСайта КАК ИдентификаторСайта,
		|	втСоглашения.Приоритет,
		|	втСоглашения.Отсрочка,
		|	втСоглашения.Доставка,
		|	втСоглашения.ОплатаКартой,
		|	втСоглашения.Склад         
		|ПОМЕСТИТЬ 
		|	втСоглашенияВидыЦен	
		|ИЗ
		|	втСоглашения            
		|	СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
		|		ПО втСоглашения.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
		|		И ВидыЦен.ФорматПодразделения = &ФорматПодразделения
		|	СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО СтруктураПредприятия.РегионПрисутствия = ВидыЦен.РегионПрисутствия
		|		И СтруктураПредприятия.ФорматПодразделения = ВидыЦен.ФорматПодразделения
		|		И СтруктураПредприятия.ИдентификаторСайта <> &ПустаяСтрока
		|;	
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1  
		|	Партнер, 
		|	ПартнерНаименование,	
		|	БизнесРегион,		
		|	БизнесРегионНаименование,		
		|	НомерТелефона, 
		|	АдресЭП,
		|	ЭтоБригадир,
		|	Соглашение, 
		|	СоглашениеНаименование, 
		|	ВидЦены,
		|	ВидЦеныНаименование,
		|	ИдентификаторСайта,
		|	Приоритет,
		|	Отсрочка,
		|	Доставка,
		|	ОплатаКартой,
		|	Склад         
		|ПОМЕСТИТЬ 
		|	втОсновноеСоглашение	
		|ИЗ
		|	втСоглашенияВидыЦен         
		|УПОРЯДОЧИТЬ ПО 
		|	Приоритет,
		|	СоглашениеНаименование, 
		|	ВидЦены
		|;	
		|////////////////////////////////////////////////////////////////////////////////   
		|// Основные данные по партнеру
		|ВЫБРАТЬ *
		|ИЗ	втОсновноеСоглашение
		|;	 
		|////////////////////////////////////////////////////////////////////////////////        
		|// Цены по умолчанию
		|ВЫБРАТЬ 
		|	втСоглашенияВидыЦен.ВидЦены,
		|	втСоглашенияВидыЦен.ВидЦеныНаименование,
		|	втСоглашенияВидыЦен.ИдентификаторСайта
		|ИЗ
		|	втОсновноеСоглашение 
		|	СОЕДИНЕНИЕ втСоглашенияВидыЦен
		|		ПО втОсновноеСоглашение.Соглашение = втСоглашенияВидыЦен.Соглашение       
		|;                    
		|////////////////////////////////////////////////////////////////////////////////
		|// Уточнения по ценовым группам
		|ВЫБРАТЬ 
		|	СпрЦеновыеГруппы.Ссылка КАК ЦеноваяГруппа,
		|	СпрЦеновыеГруппы.Наименование КАК ЦеноваяГруппаНаименование,
		|	ВидыЦен.Ссылка КАК ВидЦены,
		|	ВидыЦен.Наименование КАК ВидЦеныНаименование,
		|	СтруктураПредприятия.ИдентификаторСайта КАК ИдентификаторСайта,  
		|	СоглашениеЦеновыеГруппы.НомерСтроки,
		|	СтруктураПредприятия.РегионПрисутствия		
		|ИЗ           
		|	втОсновноеСоглашение
		|	СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы   
		|		ПО втОсновноеСоглашение.Соглашение = СоглашениеЦеновыеГруппы.Ссылка 
		|	СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы КАК СпрЦеновыеГруппы   
		|		ПО СоглашениеЦеновыеГруппы.ЦеноваяГруппа = СпрЦеновыеГруппы.Ссылка
		|	СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен               
		|		ПО СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
		|		И ВидыЦен.ФорматПодразделения = &ФорматПодразделения
		|	СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО ВидыЦен.ФорматПодразделения = СтруктураПредприятия.ФорматПодразделения
		|		И ВидыЦен.РегионПрисутствия = СтруктураПредприятия.РегионПрисутствия
		|		И СтруктураПредприятия.ИдентификаторСайта <> &ПустаяСтрока
		|ГДЕ
		|	втОсновноеСоглашение.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) 
		|УПОРЯДОЧИТЬ ПО
		|	СоглашениеЦеновыеГруппы.НомерСтроки,
		|	СтруктураПредприятия.РегионПрисутствия		
		|;                  
		|//////////////////////////////////////////////////////////////////////////////// 
		|// Уточнения по номенклатуре
		|ВЫБРАТЬ 
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		|	СпрНоменклатура.Наименование КАК НоменклатураНаименование,
		|	ВидыЦен.Ссылка КАК ВидЦены,     
		|	ВидыЦен.Наименование КАК ВидЦеныНаименование,
		|	СтруктураПредприятия.ИдентификаторСайта КАК ИдентификаторСайта
		|ИЗ          
		|	втОсновноеСоглашение
		|	СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
		|		ПО втОсновноеСоглашение.Соглашение = СоглашениеТовары.Ссылка    
		|	СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СоглашениеТовары.Номенклатура = СпрНоменклатура.Ссылка
		|	СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
		|		ПО СоглашениеТовары.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
		|		И ВидыЦен.ФорматПодразделения = &ФорматПодразделения    
		|	СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО ВидыЦен.ФорматПодразделения = СтруктураПредприятия.ФорматПодразделения
		|		И ВидыЦен.РегионПрисутствия = СтруктураПредприятия.РегионПрисутствия
		|		И СтруктураПредприятия.ИдентификаторСайта <> &ПустаяСтрока
		|;                                                                       
		|////////////////////////////////////////////////////////////////////////////////
		|// Контактные лица
		|ВЫБРАТЬ                                               
		|	КонтактныеЛица.Ссылка КАК КонтактноеЛицо,
		|	КонтактныеЛица.Наименование КАК КонтактноеЛицоНаименование,
		|	ЕСТЬNULL(ТелефонКонтактногоЛица.НомерТелефона, &ПустаяСтрока) КАК НомерТелефона
		|ИЗ                        
		|	втПартнер                                         
		|	СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛица
		|		ПО втПартнер.Партнер = КонтактныеЛица.Владелец   
		|		И НЕ КонтактныеЛица.ПометкаУдаления     
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ТелефонКонтактногоЛица
		|		ПО ТелефонКонтактногоЛица.Ссылка = КонтактныеЛица.Ссылка
		|		И ТелефонКонтактногоЛица.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица)";
		
		Запрос.УстановитьПараметр("АдресЭП", АдресЭП);                  
		Запрос.УстановитьПараметр("ИмяГруппыПартнеров", "ГруппыПартнеров");
		Запрос.УстановитьПараметр("ГруппаБригадиры", "Бригадиры");
		Запрос.УстановитьПараметр("ФорматПодразделения",Справочники.ФорматыПодразделений.НайтиПоНаименованию("ТСК"));           
		Запрос.УстановитьПараметр("ВыгружатьНаСайт", "ВыгружатьНаСайт");                  
		Запрос.УстановитьПараметр("ПустаяСтрока", "");                  
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		
		ВыборкаПартнер = ПакетЗапросов[8].Выбрать();
		Если ВыборкаПартнер.Количество() = 0 Тогда
			Возврат ОшибкаОбменаСИнтернетМагазином(Новый Структура("description","Клиент не найден"));	
		КонецЕсли;
		
		ВыборкаПартнер.Следующий();

		СтруктураОтвета = Новый Структура("email, partner, name, phone, business_region, business_region_name, legal_entity, agreement, agreement_name, price_type, price_type_name", 
			ВыборкаПартнер.АдресЭП, XMLСтрока(ВыборкаПартнер.Партнер), ВыборкаПартнер.ПартнерНаименование, ВыборкаПартнер.НомерТелефона, 
			XMLСтрока(ВыборкаПартнер.БизнесРегион), ВыборкаПартнер.БизнесРегионНаименование, Не ВыборкаПартнер.ЭтоБригадир, 
			XMLСтрока(ВыборкаПартнер.Соглашение), ВыборкаПартнер.СоглашениеНаименование, XMLСтрока(ВыборкаПартнер.ВидЦены), ВыборкаПартнер.ВидЦеныНаименование);  
			
		СтруктураОтвета.Вставить("extra", Новый Структура("card, delay, delivery", ВыборкаПартнер.ОплатаКартой, ВыборкаПартнер.Отсрочка, ВыборкаПартнер.Доставка));	        
		
		ВыборкаДубли = ПакетЗапросов[2].Выбрать(); 
		МассивДубли = Новый Массив();
		Пока ВыборкаДубли.Следующий() Цикл 
			МассивДубли.Добавить(Новый Структура("email, partner, name, phone, business_region, business_region_name, legal_entity", 
				ВыборкаДубли.АдресЭП, XMLСтрока(ВыборкаДубли.Партнер), ВыборкаДубли.ПартнерНаименование, ВыборкаДубли.НомерТелефона, 
				XMLСтрока(ВыборкаДубли.БизнесРегион), ВыборкаДубли.БизнесРегионНаименование, ВыборкаДубли.ЭтоБригадир)); 
		КонецЦикла;
		СтруктураОтвета.Вставить("doubles", МассивДубли); 
		
		ВыборкаДубли = ПакетЗапросов[5].Выбрать(); 
		МассивДубли = Новый Массив();
		Пока ВыборкаДубли.Следующий() Цикл 
			МассивДубли.Добавить(Новый Структура("id, name, priority", 
				XMLСтрока(ВыборкаДубли.Соглашение), ВыборкаДубли.СоглашениеНаименование, ВыборкаДубли.Приоритет));
		КонецЦикла;
		СтруктураОтвета.Вставить("agreements", МассивДубли);
		
		ВыборкаВидЦены = ПакетЗапросов[9].Выбрать();
		МассивВидовЦен = Новый Массив;
		Пока ВыборкаВидЦены.Следующий() Цикл
			МассивВидовЦен.Добавить(Новый Структура("shop, price_type, price_type_name", ВыборкаВидЦены.ИдентификаторСайта, XMLСтрока(ВыборкаВидЦены.ВидЦены), ВыборкаВидЦены.ВидЦеныНаименование));	
		КонецЦикла;    
		СтруктураОтвета.Вставить("default_prices", МассивВидовЦен); 
		
		ВыборкаКонтактныеЛица = ПакетЗапросов[12].Выбрать();
		МассивКонтактныхЛиц = Новый Массив();
		Пока ВыборкаКонтактныеЛица.Следующий() Цикл 
			МассивКонтактныхЛиц.Добавить(Новый Структура("id, name, phone", XMLСтрока(ВыборкаКонтактныеЛица.КонтактноеЛицо), ВыборкаКонтактныеЛица.КонтактноеЛицоНаименование, ВыборкаКонтактныеЛица.НомерТелефона));
		КонецЦикла;
		СтруктураОтвета.Вставить("contacts", МассивКонтактныхЛиц); 
		
		ВыборкаОтклонениеГруппы = ПакетЗапросов[10].Выбрать();
		МассивОтклоненияГруппы = Новый Массив;
		Пока ВыборкаОтклонениеГруппы.Следующий() Цикл
			МассивОтклоненияГруппы.Добавить(Новый Структура("id, name, price_type, price_type_name, shop",
				XMLСтрока(ВыборкаОтклонениеГруппы.ЦеноваяГруппа), ВыборкаОтклонениеГруппы.ЦеноваяГруппаНаименование, 
				XMLСтрока(ВыборкаОтклонениеГруппы.ВидЦены), ВыборкаОтклонениеГруппы.ВидЦеныНаименование, ВыборкаОтклонениеГруппы.ИдентификаторСайта));
		КонецЦикла;
		
		ВыборкаОтклонениеТовары = ПакетЗапросов[11].Выбрать();  
		МассивОтклоненияТовары = Новый Массив;
		Пока ВыборкаОтклонениеТовары.Следующий() Цикл
			МассивОтклоненияТовары.Добавить(Новый Структура("id, name, price_type, price_type_name, shop",
			XMLСтрока(ВыборкаОтклонениеТовары.Номенклатура), ВыборкаОтклонениеТовары.НоменклатураНаименование, 
			XMLСтрока(ВыборкаОтклонениеТовары.ВидЦены), ВыборкаОтклонениеТовары.ВидЦеныНаименование, ВыборкаОтклонениеТовары.ИдентификаторСайта));
		КонецЦикла;		
		
		СтруктураОтвета.Вставить("deviations", Новый Структура("groups, products", МассивОтклоненияГруппы, МассивОтклоненияТовары));
		
		Возврат ПодготовитьHTTPОтвет(Ложь, СтруктураОтвета, Ложь);	
		
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Ошибка выполнения запроса!");			
	КонецПопытки;
	
КонецФункции

функция AddClientToAuthLog(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);  
	HTTPОтвет = Новый HTTPСервисОтвет(200);   
		
	Попытка 
		УИД = ВходящиеДанные.XML_ID;
		ПартнерСсылка = Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД)); 
	Исключение 
		ПартнерСсылка = Справочники.Партнеры.ПустаяСсылка();
	КонецПопытки;

	Попытка
    ПочтаПартнера = ВходящиеДанные.Email;	
	ТелефонКонтактногоЛица = ВходящиеДанные.Tel;
	
	Запрос = Новый Запрос;
	Запрос.Текст =                   
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партнеры.Ссылка КАК Клиент,
	|	МАКСИМУМ(Почта.Представление) КАК Почта
	|ПОМЕСТИТЬ ПартнерыИПочта
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК Почта
	|		ПО (Партнеры.Ссылка = Почта.Ссылка)
	|ГДЕ
	|	НЕ Партнеры.ПометкаУдаления
	|	И Почта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПартнера)
	|	И (Партнеры.Ссылка = &Ссылка
	|			ИЛИ Почта.Представление = &Почта
	|				И &Почта <> """")
	|
	|СГРУППИРОВАТЬ ПО
	|	Партнеры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПартнерыИПочта.Клиент КАК Клиент,
	|	ПартнерыИПочта.Почта КАК Почта,
	|	Телефон.Представление КАК Телефон,
	|	NULL КАК НомерКарты,
	|	NULL КАК КонтактноеЛицо,
	|	NULL КАК ТелефонКонтактногоЛица
	|ПОМЕСТИТЬ Вт_Объединение
	|ИЗ
	|	ПартнерыИПочта КАК ПартнерыИПочта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК Телефон
	|		ПО (ПартнерыИПочта.Клиент = Телефон.Ссылка)
	|ГДЕ
	|	Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|   ПартнерыИПочта.Клиент,
	|	ПартнерыИПочта.Почта, 
	|	NULL,
	|	Карта.Штрихкод,
	|	NULL,
	|	NULL
	|	
	|ИЗ
	|	ПартнерыИПочта КАК ПартнерыИПочта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыЛояльности КАК Карта
	|		ПО ПартнерыИПочта.Клиент = Карта.Партнер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   ПартнерыИПочта.Клиент,
	|	ПартнерыИПочта.Почта,
	|	NULL,
	|	NULL,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона
	|ИЗ
	|	ПартнерыИПочта КАК ПартнерыИПочта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	|		ПО (КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец = ПартнерыИПочта.Клиент)
	|ГДЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона = &Тел
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона <> """"
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вт_Объединение.Клиент КАК Клиент,
	|	МАКСИМУМ(Вт_Объединение.Почта) КАК Почта,
	|	МАКСИМУМ(Вт_Объединение.Телефон) КАК Телефон,
	|	МАКСИМУМ(Вт_Объединение.НомерКарты) КАК НомерКарты,
	|	МАКСИМУМ(Вт_Объединение.КонтактноеЛицо) КАК КонтактноеЛицо,
	|	МАКСИМУМ(Вт_Объединение.ТелефонКонтактногоЛица) КАК ТелефонКонтактногоЛица
	|ИЗ
	|	Вт_Объединение КАК Вт_Объединение
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_Объединение.Клиент";
		
	Запрос.УстановитьПараметр("Ссылка",ПартнерСсылка);
    Запрос.УстановитьПараметр("Почта",ПочтаПартнера);
	Запрос.УстановитьПараметр("Тел",ТелефонКонтактногоЛица);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекДата = ТекущаяДата();
		РегистрВходКлиент = РегистрыСведений.ИсторияИдентификацииКлиентовСайт;
		Отбор = Новый Структура("Клиент", Выборка.Клиент);
		ПоследняяЗапись = РегистрВходКлиент.СрезПоследних(ТекДата,Отбор);
		ПослДатаВхода = ?(ПоследняяЗапись.Количество() = 0,'00010101',ПоследняяЗапись[0].Период);
		Если ПослДатаВхода < ТекДата-20 Тогда
			Запись = РегистрВходКлиент.СоздатьМенеджерЗаписи();
			Запись.Период = ТекДата;
			ЗаполнитьЗначенияСвойств(Запись,Выборка);
			Запись.Записать(); 
		КонецЕсли;
	КонецЕсли;	
	
        HTTPОтвет.УстановитьТелоИзСтроки("error: false", КодировкаТекста.UTF8);
    	Возврат HTTPОтвет;
		
   Исключение 
		HTTPОтвет.УстановитьТелоИзСтроки("error: true", КодировкаТекста.UTF8);
		Возврат HTTPОтвет;
   КонецПопытки;
                                                       
КонецФункции		

Функция getDeliveryPrice(ВходящиеДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
	
	МаксимальнаяДлина =(ВходящиеДанные["max_length"]);
	Интервал = Справочники.ИнтервалыДоставки.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные["interval_id"]));
	ЗонаДоставкиДляВодителя = Справочники.ЗоныДоставкиДоКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящиеДанные["zone_id"]));
	ПрибытиеНаОтгрузку = Дата((ВходящиеДанные["Date"]));
	Вес = (ВходящиеДанные["weight"]); 
	
	Товары = Новый ТаблицаЗначений(); 
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
	
	Для Каждого Строка Из ВходящиеДанные["products"] Цикл   
		НС = Товары.Добавить();
		НС.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор (Строка.xml_id));
		НС.КоличествоУпаковок = Строка.count;
	КонецЦикла;
		
	СтруктураОбъекта = Новый Структура("Интервал, Товары, МаксимальнаяДлина,ЗонаДоставкиДляВодителя,ПрибытиеНаОтгрузку,Вес",
	Интервал,Товары, МаксимальнаяДлина,ЗонаДоставкиДляВодителя,ПрибытиеНаОтгрузку,Вес);
	
	СтруктураТарифыТипы = УправлениеЛогистикойСервер.ОпределениеТарифаСайт(СтруктураОбъекта);
	
	Если СтруктураТарифыТипы.СообщениеОбОшибке <> "" Тогда
		Возврат ОшибкаОбменаСИнтернетМагазином(СтруктураТарифыТипы.СообщениеОбОшибке);
	КонецЕсли;
	
	МассивТарифов = Новый Массив;	
	Для Каждого Строка Из  СтруктураТарифыТипы.ТарифыТипы Цикл
		МассивТарифов.Добавить(Новый Структура("price,tariff,car_id", Строка.СтоимостьДляКлиента,Строка(Строка.УИД_Тарифа),Строка(Строка.УИД_ТипаТС)));
	КонецЦикла;
	
	Возврат ПодготовитьHTTPОтвет(Ложь, МассивТарифов);		
	Исключение
		Возврат ОшибкаОбменаСИнтернетМагазином("Не удалось получить цены доставки");			
	КонецПопытки; 
	УстановитьПривилегированныйРежим(Ложь);

КонецФункции


Функция ОшибкаОбменаСИнтернетМагазином(ТекстОшибки)
	Ответ = ПодготовитьHTTPОтвет(Истина, ТекстОшибки);
	ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазином", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область ВспомогательныеОплата 

Функция Ошибка(Сообщение, ВернутьСтруктуру = Ложь, СтатусОшибки = Истина, ЗаписьВЖурналРегистрации = Истина) 
	Если ЗаписьВЖурналРегистрации Тогда
		ЗаписьЖурналаРегистрации("ОбменСИнтернетМагазиномОплата", УровеньЖурналаРегистрации.Ошибка, , , Сообщение);
	КонецЕсли;
	
	Если ВернутьСтруктуру Тогда
		Возврат Новый Структура("СтатусОшибки, Сообщение", СтатусОшибки, Сообщение);
	Иначе
		Возврат ОбщийHTTPСервер.ПодготовитьHTTPОтвет(СтатусОшибки, Сообщение); 
	КонецЕсли;
КонецФункции

Функция ПроверкаНаНаличиеЗаписейВРегистре(ЗаказКлиента, ЭквайринговаяОперация, СуммаОплаты, АдресУведомленияКлиента, НомерКарты, ЭквайринговыйТерминал, ИдентификаторОплаты) Экспорт
	МаксимальноеКоличествоПопытокПробития = 5;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьЧековКПробитию.КоличествоПопытокПробития КАК КоличествоПопытокПробития,
		|	ОчередьЧековКПробитию.СтатусОшибки КАК СтатусОшибки,
		|	ОчередьЧековКПробитию.Информация КАК Информация
		|ИЗ
		|	РегистрСведений.ОчередьЧековКПробитию КАК ОчередьЧековКПробитию
		|ГДЕ
		|	ОчередьЧековКПробитию.ЗаказКлиента = &ЗаказКлиента";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	Если РезультатЗапроса.Следующий() Тогда
		Если РезультатЗапроса.СтатусОшибки Тогда
			СтатусОшибки = МаксимальноеКоличествоПопытокПробития <= РезультатЗапроса.КоличествоПопытокПробития;  
			Возврат Ошибка( 
				"Чек находится в очереди к пробитию!" + Символы.ПС +
				"Количество попыток пробития - " + РезультатЗапроса.КоличествоПопытокПробития + Символы.ПС + 
				"Информация по текущему статусу: " + Символы.ПС + РезультатЗапроса.Информация, Истина, СтатусОшибки, СтатусОшибки);
		Иначе 
			Возврат Ошибка("Чек пробит!", Истина, Ложь, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ДатаПостановки = ТекущаяДатаСеанса();     
	
	ТипСсылки = ПредопределенноеЗначение("Перечисление.ТипДинамическойСсылки.Сайт");
	НастройкиДинамическиеСсылки = ИнтеграцияБанки.ПолучитьНастройкиДинамическиеСсылки(ТипСсылки);
	Если НастройкиДинамическиеСсылки.Результат Тогда
		Касса = НастройкиДинамическиеСсылки.Ответ.ККТ;    
	Иначе
		Касса = Константы.КассаИнтернетМагазина.Получить();
	КонецЕсли;
	
	ТекстСообщения = "Чек помещен в очередь!";
	НоваяЗапись = РегистрыСведений.ОчередьЧековКПробитию.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипСсылки            		= ТипСсылки;
	НоваяЗапись.Касса	            		= Касса;
	НоваяЗапись.ДатаПостановки            	= ДатаПостановки;
	НоваяЗапись.ЗаказКлиента              	= ЗаказКлиента;
	НоваяЗапись.ЭквайринговаяОперация     	= ЭквайринговаяОперация;
	НоваяЗапись.СуммаОплаты               	= СуммаОплаты;
	НоваяЗапись.АдресУведомленияКлиента   	= АдресУведомленияКлиента;
	НоваяЗапись.НомерКарты                	= НомерКарты;
	НоваяЗапись.ЭквайринговыйТерминал     	= ЭквайринговыйТерминал;	
	НоваяЗапись.ДинамическаяСсылка			= ИдентификаторОплаты;
	НоваяЗапись.КоличествоПопытокПробития 	= 0;
	НоваяЗапись.СтатусОшибки              	= Истина;
	НоваяЗапись.Информация                	= ТекстСообщения;
    НоваяЗапись.Записать(Истина);
    
    // Сразу пробить чек
	ДопМодульСервер.ВыполнитьПробитиеЧека(ДатаПостановки, ЗаказКлиента);
	
	Возврат Ошибка(ТекстСообщения, Истина, Ложь, Ложь);
	
КонецФункции

Функция НайтиЗаказКлиента(Ид, ВернутьСтруктуру = Ложь)
	Ответ = Новый HTTPСервисОтвет(200);
	Если СтрДлина(ИД) > 7 Тогда
		Попытка
			УИД = Новый УникальныйИдентификатор(ИД);
		Исключение                  
			Возврат Ошибка("Не верный УИД", ВернутьСтруктуру);
		КонецПопытки;
		
		Заказ = Документы.ЗаказКлиента.ПолучитьСсылку(УИД);
	Иначе
		Заказ = НайтиЗаказПоНомеруССайта(ИД);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ) Тогда     
		Возврат Ошибка("Заказ не найден", ВернутьСтруктуру);
	КонецЕсли;
	
	Если Не Заказ.Проведен Тогда             
		Возврат Ошибка("Заказ не проведен", ВернутьСтруктуру);
	КонецЕсли;
	
	Возврат Заказ;
КонецФункции

Функция НайтиДокументОплаты(Заказ, СуммаОплаты, ЭквайринговыйТерминал, ВернутьСтруктуру = Ложь)
	ЭквайринговаяОперация = Документы.ОперацияПоПлатежнойКарте.ПолучитьЭквайринговуюОперацию(Заказ, ЭквайринговыйТерминал);	
	Если ЗначениеЗаполнено(ЭквайринговаяОперация) Тогда
		//проверка на пробитие чека и оплату
		ФискальнаяОперацияДанныеЖурнала = ОборудованиеЧекопечатающиеУстройстваВызовСервера.ДанныеФискальнойОперации(ЭквайринговаяОперация);
		Если ЗначениеЗаполнено(ФискальнаяОперацияДанныеЖурнала) Тогда
			//чек уже пробит, вернуть ошибку 
			Возврат Ошибка("По заказу " + Строка(Заказ) + " уже есть пробитая оплата!" + Строка(ЭквайринговаяОперация), ВернутьСтруктуру, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЭквайринговаяОперация;
КонецФункции

#Область Временно_убрать_после_внедрения_автоопределняи_тарифа

Функция ПолучитьТариф(ТЗ_Товары, ВидДоставки, ЭкспрессДоставка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ Товар ИЗ &ТЗ_Товары КАК ТЗ_Товары";
	Запрос.УстановитьПараметр("ТЗ_Товары", ТЗ_Товары);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товар.Номенклатура КАК Номенклатура,
	|	Товар.Количество КАК Количество
	|ИЗ
	|	Товар КАК Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товар.Количество * &ТекстЗапросаВесНоменклатуры), 0) КАК ВесГруза,
	|	ЕСТЬNULL(СУММА(Товар.Количество * &ТекстЗапросаОбъемНоменклатуры), 0) КАК ОбъемГруза
	|ИЗ
	|	Товар КАК Товар";
	
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"Товар.Номенклатура.ЕдиницаИзмерения",
	"Товар.Номенклатура"));
	
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаОбъемНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
	"Товар.Номенклатура.ЕдиницаИзмерения",
	"Товар.Номенклатура"));
		
	ВесГруза = Запрос.Выполнить().Выбрать();
	Если ВесГруза.Следующий() Тогда 
		Возврат ЗапросДляВыбораТарифа(ВидДоставки, ЭкспрессДоставка, ВесГруза.ВесГруза/1000, ВесГруза.ОбъемГруза);
	Иначе
		Возврат ЗапросДляВыбораТарифа(ВидДоставки, ЭкспрессДоставка, 0, 0);
	КонецЕсли;
	
КонецФункции

Функция ЗапросДляВыбораТарифа(ВидДоставки, Экспресс, ВесГруза, ОбъемГруза)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТарифыПеревозчиков.Наименование КАК name,
	               |	ТарифыПеревозчиков.ТипДоставки.Код КАК ТипДоставки,
	               |	ТарифыПеревозчиков.МаксимальнаяДлинаГруза КАК MaxLength,
	               |	ТарифыПеревозчиков.ГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннах,
	               |	ТарифыПеревозчиков.Приоритет КАК Приоритет,
	               |	ТарифыПеревозчиков.Подразделение.Код КАК Подразделение,
	               |	ТарифыПеревозчиков.ВидАвтомобиля КАК ВидАвтомобиля
	               |ИЗ
	               |	Справочник.ТарифыПеревозчиков КАК ТарифыПеревозчиков
	               |ГДЕ
	               |	ТарифыПеревозчиков.Экспресс = &Экспресс
	               |	И ТарифыПеревозчиков.ГрузоподъемностьВТоннах >= &ВесГруза
	               |	И ТарифыПеревозчиков.ВидДоставки = &ВидДоставки
	               |	И ТарифыПеревозчиков.ПометкаУдаления = ЛОЖЬ
	               |	И ТарифыПеревозчиков.ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.Розничная)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТарифыПеревозчиков.Наименование,
	               |	ТарифыПеревозчиков.ТипДоставки.Код,
	               |	ТарифыПеревозчиков.МаксимальнаяДлинаГруза,
	               |	ТарифыПеревозчиков.ГрузоподъемностьВТоннах,
	               |	NULL,
	               |	ТарифыПеревозчиков.Подразделение.Код,
	               |	ТарифыПеревозчиков.ВидАвтомобиля
	               |ИЗ
	               |	Справочник.ТарифыПеревозчиков КАК ТарифыПеревозчиков
	               |ГДЕ
	               |	ТарифыПеревозчиков.ВидДоставки = &ВидДоставки
	               |	И ТарифыПеревозчиков.ПометкаУдаления = ЛОЖЬ
	               |	И ТарифыПеревозчиков.ВидДоставки <> ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.Розничная)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	MaxLength,
	               |	ГрузоподъемностьВТоннах,
	               |	Приоритет УБЫВ";
	
	Запрос.УстановитьПараметр("ВидДоставки", ВидДоставки);
	Запрос.УстановитьПараметр("Экспресс", Экспресс);
	Запрос.УстановитьПараметр("ВесГруза", ВесГруза);
	//Запрос.УстановитьПараметр("ОбъемГруза", ОбъемГруза);
	
	ВыборкаТарифов = Запрос.Выполнить().Выгрузить();
	
	Возврат ВыборкаТарифов;
	
КонецФункции

Функция ПолучитьФилиалДляСайта(Код)

	Если Код = Null Тогда
		Возврат Ложь;
	Иначе
		Если Код = "0А-000001" Тогда
			Возврат "center";
		ИначеЕсли Код = "0А-000003" Тогда
			Возврат "novoalt";
		ИначеЕсли Код = "0А-000002" Тогда
			Возврат "barnaul";
		ИначеЕсли Код = "0А-000004" Тогда
			Возврат "biysk";
		КонецЕсли;
	КонецЕсли;
			
КонецФункции

#КонецОбласти
#Область РасчетБонусов

Функция ПолучитьТоварыКРасчетуБаллов(Товары, ЭтоЗаказ = Ложь, Дата = Неопределено, ОставитьТоварБезБонусов = Ложь)
	
	ТаблицаТоваров = ?(ТипЗнч(Товары) = Тип("ТаблицаЗначений"), Товары, Товары.Выгрузить());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура,
		|	Сумма
		|ПОМЕСТИТЬ Товар
		|ИЗ
		|	&Товар КАК Товар
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура,
		|	Сумма
		|ПОМЕСТИТЬ ТоварБезТары	
		|ИЗ
		|	Товар 
		|ГДЕ
		|	Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ Номенклатура В ИЕРАРХИИ (&ГрТара)
		|;
		|////////////////////////////////////////////////////////////////////////////////     
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа,
		|	ДатаОкончанияДействия
		|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусовПоследние
		|ИЗ
		|	РегистрСведений.ЦеновыеГруппыБезБонусов.СрезПоследних(&Дата)
		|;
		|////////////////////////////////////////////////////////////////////////////////     
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа    
		|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусов
		|ИЗ
		|	втЦеновыеГруппыБезБонусовПоследние
		|ГДЕ 
		|	ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)  
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ 
		|	ЦеноваяГруппа    
		|ИЗ
		|	втЦеновыеГруппыБезБонусовПоследние
		|ГДЕ 
		|	ДатаОкончанияДействия >= &Дата
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварБезТары.Номенклатура,
		|	ТоварБезТары.Сумма
		|   ГДЕ 
		|   ТоварБезТары.Номенклатура.ЦеноваяГруппа НЕ В 
		|  (ВЫБРАТЬ * ИЗ втЦеновыеГруппыБезБонусов)
		|  ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеБезБонусов", ?(ОставитьТоварБезБонусов, "", "ГДЕ втЦеновыеГруппыБезБонусов.ЦеноваяГруппа ЕСТЬ NULL"));
	
    Запрос.УстановитьПараметр("Товар", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ГрТара", Справочники.Номенклатура.НайтиПоКоду("00448      "));
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(Дата)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции



Функция РасчетБонусов(Партнер, ТаблицаДляРасчета, Подразделение, ОпределяемВсеВозможные=Истина)

	ТЗТовары = ПолучитьТоварыКрасчетуБаллов(ТаблицаДляРасчета, Ложь , ТекущаяДатаСеанса());

	//Дополнительный расчет бонусов за крупную покупку
	СуммаКРасчету = ТЗТовары.Итог("Сумма");
	
	КоэффициентЗаКрупнуюПокупку = 0;
	Если СуммаКРасчету >= 90000 Тогда
		КоэффициентЗаКрупнуюПокупку = 0.03;
	ИначеЕсли СуммаКРасчету >= 50000 Тогда
		КоэффициентЗаКрупнуюПокупку =  0.02;
	ИначеЕсли СуммаКРасчету >= 30000 Тогда
		КоэффициентЗаКрупнуюПокупку =  0.01;
	КонецЕсли;  
	
	Если Не ОпределяемВсеВозможные тогда
	ПартнерВПрограмме=Истина; 
	 
	ЭтоБригадир = АльтерраОбщегоНазначения.ЭтоБригадир(Партнер);
	
	РезервБаллов			 = БонусыАльтерраРезерв.ПолучитьОбщийРезервБонусныхБаллов(Партнер, Неопределено);
	
	Текст = 
		"ВЫБРАТЬ
		|	СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|   СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СрезПоследних(
		|			&Период,
		|				 Партнер = &Партнер) КАК СтатусыПартнеровВПрограммеЛояльности_АльтерраСрезПоследних";
	
	Запрос = Новый Запрос(Текст);
    Период = ТекущаяДата(); 
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Партнер", Партнер);
    ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = ПакетРезультатов[0].Выбрать();
	Статус = ?(Выборка.Следующий(), Выборка.Статус, Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.Умелец);
	КоэффициентЗаСтатус = ?(ЗначениеЗаполнено(Статус.Коэффициент), Статус.Коэффициент, 0.01);
    БонуснаяПрограммаЛояльности = Выборка.БонуснаяПрограммаЛояльности;
	МаксимальныйПроцентОплаты	 = БонуснаяПрограммаЛояльности.МаксимальныйПроцентОплатыБонусами / 100;

	
	
	    	//Бригадиры
	Если ЭтоБригадир Тогда
		Текст = "ВЫБРАТЬ
				|СоглашенияСКлиентами.Ссылка КАК Соглашение,
				|СоглашенияСКлиентами.СегментПартнеров КАК СегментПартнеров,
				|&Партнер КАК Партнер
			    |ИЗ
				|Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
			    |ГДЕ
				|СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
				|И СоглашенияСКлиентами.НачислятьБаллыЗаСтатус = Истина
				|И (СоглашенияСКлиентами.ДатаОкончанияДействия >= &ДатаДействия
				|		ИЛИ СоглашенияСКлиентами.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
				|И (СоглашенияСКлиентами.ДатаНачалаДействия <= &ДатаДействия
				|		ИЛИ СоглашенияСКлиентами.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1))
				|И (СоглашенияСКлиентами.Партнер = &Партнер
				|		ИЛИ СоглашенияСКлиентами.СегментПартнеров В
				|			(ВЫБРАТЬ
				|				ПартнерыСегмента.Сегмент
				|			ИЗ
				|				РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
				|			ГДЕ
				|				ПартнерыСегмента.Партнер = &Партнер))";

		Запрос = Новый Запрос(Текст);
		Запрос.УстановитьПараметр("Партнер",Партнер);
		Запрос.УстановитьПараметр("ДатаДействия",Период);
		КоэффициентЗаКрупнуюПокупку =0;
		НачислятьБаллыЗаСтатус = Ложь;
		ВсеСоглашенияСбаллами = Запрос.Выполнить().Выбрать();
		Пока ВсеСоглашенияСбаллами.Следующий() Цикл
			Соглашение = ВсеСоглашенияСбаллами.Соглашение;
			Если ВсеСоглашенияСбаллами.Соглашение.НачислятьБаллыЗаСтатус тогда
				НачислятьБаллыЗаСтатус = Истина;
			КонецЕсли;	
		    Если (ВсеСоглашенияСбаллами.Соглашение.КоэффициентНачисленияББРозничнаяЦена> КоэффициентЗаКрупнуюПокупку) тогда
			   КоэффициентЗаКрупнуюПокупку = ВсеСоглашенияСбаллами.Соглашение.КоэффициентНачисленияББРозничнаяЦена;
		    КонецЕсли;	
		КонецЦикла;
		КоэффициентЗаСтатус = ?(НачислятьБаллыЗаСтатус, КоэффициентЗаСтатус, 0);
		    //Истина - Соглашение 1 или 2, Ложь - соглашение без бонусов за статус
	КонецЕсли;
	
	ОбщийКоэффициент = КоэффициентЗаСтатус + КоэффициентЗаКрупнуюПокупку;
	
	РасчитанныеБаллы = Цел(СуммаКРасчету * ОбщийКоэффициент);
	
	КонецЕсли;
	

	ТаблицаПримененныхАкций = Новый ТаблицаЗначений();
	ТаблицаПримененныхАкций.Колонки.Добавить("МаркетинговоеМероприятие");
	ТаблицаПримененныхАкций.Колонки.Добавить("Действие");
	ТаблицаПримененныхАкций.Колонки.Добавить("Баллы");
	ТаблицаПримененныхАкций.Колонки.Добавить("НеПрименено");
	
	
	
	АкцииЗаТовар = Справочники.МаркетинговыеМероприятия.ДействующиеМаркетинговыеМероприятияПоАлгоритмуАкции(Перечисления.АлгоритмыАкций.ЗаТовар,Подразделение, ТекущаяДатаСеанса());  
    МассивМероприятий = АкцииЗаТовар.ВыгрузитьКолонку("Ссылка");
		
    Если Не ОпределяемВсеВозможные тогда
	СтруктураДействийИМероприятий = Справочники.МаркетинговыеМероприятия.ПолучитьСтруктуруДействийИМероприятийПоОтборуПартнураИНоменклатуры(Партнер, ТЗТовары.ВыгрузитьКолонку("Номенклатура"), АкцииЗаТовар,ТаблицаПримененныхАкций);
	ЗаполнитьЗначенияСвойств(ТаблицаПримененныхАкций,СтруктураДействийИМероприятий);
		
    иначе
	МероприятияПоОтборуНоменклатуры = Справочники.МаркетинговыеМероприятия.ПолучитьМероприятияПоОтборуНоменклатуры(ТЗТовары.ВыгрузитьКолонку("Номенклатура"),МассивМероприятий);
			Если МероприятияПоОтборуНоменклатуры.Количество()>0 Тогда
					Для каждого СтрокаМероприятие из МероприятияПоОтборуНоменклатуры Цикл
						Для каждого СтрокаДействие из СтрокаМероприятие.Ссылка.Действия Цикл
							НоваяСтрока = ТаблицаПримененныхАкций.Добавить();
							НоваяСтрока.МаркетинговоеМероприятие = СтрокаМероприятие.Ссылка;
							НоваяСтрока.Действие = СтрокаДействие.Действие;
						КонецЦикла;	
					КонецЦикла;	
		  КонецЕсли;
	КонецЕсли;
	
         СуммаББПрочее =0;
		Для каждого СтрокаТаблицы из ТаблицаПримененныхАкций Цикл
	
					Если СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом Тогда      
					СуммаДополнительныхБонусов = 0;
					Для Каждого СтрокаТовар Из ТЗТовары Цикл			
						
							ДополнительныйПроцент = 0;
							Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
							ДополнительныйПроцент = Справочники.МаркетинговыеМероприятия.ПолучитьПроцентБонусовВидЦеныПоНоменклатуре(СтрокаТаблицы.МаркетинговоеМероприятие,СтрокаТовар.Номенклатура,Характеристика,СтрокаТаблицы.Действие);
							Если ДополнительныйПроцент > 0 Тогда
								СуммаДополнительныхБонусовПоНоменклатуре = Цел(СтрокаТовар.Сумма*ДополнительныйПроцент);
								СуммаДополнительныхБонусов = СуммаДополнительныхБонусов + СуммаДополнительныхБонусовПоНоменклатуре;	
								ПримененоНаТовар = Истина;	
							КонецЕсли;	
					КонецЦикла;
					
			
				 ИначеЕсли СтрокаТаблицы.Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой Тогда 
				
				    
				
				    СуммаДополнительныхБонусовПоНоменклатуре = СтрокаТаблицы.Действие.СуммаБонусов;
					 
					 
				 КонецЕсли;
                	СтрокаТаблицы.Баллы = СуммаДополнительныхБонусов;
					СуммаББПрочее = СуммаББПрочее + СуммаДополнительныхБонусов;
		КонецЦикла;	
	
	
	
	
	ТаблицаБонусов = Новый ТаблицаЗначений;
	ТаблицаБонусов.Колонки.Добавить("Статус");
	ТаблицаБонусов.Колонки.Добавить("СуммаБаллов");
	
	Текст = "ВЫБРАТЬ
	        |	Таб_Наименований.ИмяСтатусаРус КАК ИмяСтатусаРус,
	        |	Таб_Наименований.ИмяСтатусаАнг КАК ИмяСтатусаАнг
	        |ПОМЕСТИТЬ ТабНаименований
	        |ИЗ
	        |	&АнглийскоеНаименование КАК Таб_Наименований
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтатусыПартнеровВПрограммеЛояльности_Альтерра.Ссылка КАК Ссылка,
	        |	СтатусыПартнеровВПрограммеЛояльности_Альтерра.Коэффициент КАК Коэффициент,
	        |	СтатусыПартнеровВПрограммеЛояльности_Альтерра.Наименование КАК Наименование,
	        |	ТабНаименований.ИмяСтатусаАнг КАК ИмяСтатусаАнг
	        |ИЗ
	        |	Справочник.СтатусыПартнеровВПрограммеЛояльности_Альтерра КАК СтатусыПартнеровВПрограммеЛояльности_Альтерра
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТабНаименований КАК ТабНаименований
	        |		ПО СтатусыПартнеровВПрограммеЛояльности_Альтерра.Наименование ПОДОБНО ТабНаименований.ИмяСтатусаРус
	        |ГДЕ
	        |	НЕ СтатусыПартнеровВПрограммеЛояльности_Альтерра.ПометкаУдаления
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	СтатусыПартнеровВПрограммеЛояльности_Альтерра.НижнийПорог";
	АнглийскоеНаименование = Новый ТаблицаЗначений;
	АнглийскоеНаименование.Колонки.Добавить("ИмяСтатусаРус",Новый ОписаниеТипов("Строка"));
	АнглийскоеНаименование.Колонки.Добавить("ИмяСтатусаАнг",Новый ОписаниеТипов("Строка"));
	НоваяСтрока = АнглийскоеНаименование.Добавить();
	НоваяСтрока.ИмяСтатусаРус = "Умелец";
	НоваяСтрока.ИмяСтатусаАнг = "craftsman";
	НоваяСтрока = АнглийскоеНаименование.Добавить();
	НоваяСтрока.ИмяСтатусаРус = "Мастер";
	НоваяСтрока.ИмяСтатусаАнг = "master";
	НоваяСтрока = АнглийскоеНаименование.Добавить();
	НоваяСтрока.ИмяСтатусаРус = "Профи";
	НоваяСтрока.ИмяСтатусаАнг = "professional";
	НоваяСтрока = АнглийскоеНаименование.Добавить();
	НоваяСтрока.ИмяСтатусаРус = "Эксперт";
	НоваяСтрока.ИмяСтатусаАнг = "expert";
	НоваяСтрока = АнглийскоеНаименование.Добавить();
	НоваяСтрока.ИмяСтатусаРус = "Бригадир";
	НоваяСтрока.ИмяСтатусаАнг = "brigadier";
	
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("АнглийскоеНаименование", АнглийскоеНаименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
 Если Не ОпределяемВсеВозможные тогда
	Пока Выборка.Следующий() Цикл
	      СтрокаТаблицы = ТаблицаБонусов.Добавить();
	      СтрокаТаблицы.Статус = Выборка.ИмяСтатусаАнг;
	   Если Выборка.Ссылка = Статус тогда
	      СтрокаТаблицы.СуммаБаллов = РасчитанныеБаллы+СуммаББПрочее; 
       иначе	   
		   СтрокаТаблицы.СуммаБаллов = 0;
	   КонецЕсли;	   
   КонецЦикла;   
	 
иначе
  	Пока Выборка.Следующий() Цикл
	      СтрокаТаблицы = ТаблицаБонусов.Добавить();
	      СтрокаТаблицы.Статус = Выборка.ИмяСтатусаАнг;
		  СтрокаТаблицы.СуммаБаллов = Цел(СуммаКРасчету*(Выборка.Коэффициент+КоэффициентЗаКрупнуюПокупку))+СуммаББПрочее; 
   КонецЦикла;    
КонецЕсли;  

   
Возврат ТаблицаБонусов;	
КонецФункции
#КонецОбласти
#КонецОбласти