Функция ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(Знач Значение) Экспорт
	
	Значение = НРег(Значение);
	ДлинаСтроки = СтрДлина(Значение);
	
	Результат = 0;
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Результат = Результат * 16 + Найти("0123456789abcdef", Сред(Значение, НомерСимвола, 1)) - 1;
	КонецЦикла;
	
	Возврат Формат(Результат, "ЧГ=0");
	
КонецФункции

Функция ПользовательИспользуетПроверкуПоШтрихкоду(ТекПользователь) Экспорт
	
	СвойствоИспШК = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Использование проверки накладных по штрихкоду"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", ТекПользователь);
	Запрос.УстановитьПараметр("Свойство", СвойствоИспШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ИспользуетсяПроверкаШК = Ложь;
	
	Если Выборка.Следующий() Тогда
		ИспользуетсяПроверкаШК = Выборка.Значение;
	КонецЕсли;
	
	Возврат ИспользуетсяПроверкаШК;
	
КонецФункции

Процедура СозданиеШтрихкодовПоСекциям(ДополнительныеСвойства, Объект, Изменилась, Отказ) Экспорт
	
	ЕстьШтрихкоды= ЕстьШтрихкодыПоСекции(Объект.Ссылка);
	Если Не Изменилась И ЕстьШтрихкоды Тогда
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			Если ЗначениеЗаполнено(Объект.Кассир) Тогда
				Возврат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЧекККМ") Тогда
			Если Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит ИЛИ Объект.СвернутИзРеализации Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	ДатаФормирования = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга,
	|	РеализацияТоваровУслугТовары.Назначение КАК Назначение
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И РеализацияТоваровУслугТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	РеализацияТоваровУслугТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	СУММА(ЧекККМТовары.Сумма),
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ЧекККМТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ЧекККМТовары.Ссылка.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	ЧекККМТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РСНЗШтрихкодыПоСекциям = РегистрыСведений.ШтрихкодыПоСекциямДокумента.СоздатьНаборЗаписей();
	РСНЗШтрихкодыПоСекциям.Отбор.Документ.Установить(Объект.Ссылка);
	Если Не ЕстьШтрихкоды ИЛИ Изменилась Тогда //Если нет штрихкодов или сумма изменилась
		Пока Выборка.Следующий() Цикл
			Запись = РСНЗШтрихкодыПоСекциям.Добавить();
			
			Запись.Документ			= Объект.Ссылка;
			Если Выборка.ЭтоУслуга Тогда
				Запись.Штрихкод			= РСОбщийМодульВызовСервера.ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(СокрЛП(СтрЗаменить(Строка(Объект.Ссылка.УникальныйИдентификатор()),"-","")));
			Иначе
				Запись.Штрихкод			= РСОбщийМодульВызовСервера.ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(СокрЛП(СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","")));
			КонецЕсли;
			Запись.QRкод = ГенерацияШтрихкода.СформироватьQRКод(Объект.Ссылка); 
			Запись.ДатаФормирования	= ДатаФормирования;
			Запись.Проверен			= Ложь;
			Запись.Сумма			= Выборка.Сумма;
			Запись.Секция			= ?(ЗначениеЗаполнено(Выборка.Секция), Выборка.Секция, "");
			Запись.Назначение			= Выборка.Назначение;
		КонецЦикла;
		
		Попытка
			РСНЗШтрихкодыПоСекциям.Записать(истина);
		Исключение
			СообщениеОбОшибке = Новый СообщениеПользователю;
			СообщениеОбОшибке.Текст = "Ошибка формирования штрихкода по секциям документа!";
			СообщениеОбОшибке.Сообщить();
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
Процедура УдалениеСвязанныхДанныхПоРегистрамСведений(Объект, Отказ) Экспорт
	
	РСНЗШтрихкодыПоСекциям = РегистрыСведений.ШтрихкодыПоСекциямДокумента.СоздатьНаборЗаписей();
	РСНЗШтрихкодыПоСекциям.Отбор.Документ.Установить(Объект.Ссылка);
	
	РСНЗСостояниеСборкиЗаказов = РегистрыСведений.СостояниеСборкиЗаказов.СоздатьНаборЗаписей();
	РСНЗСостояниеСборкиЗаказов.Отбор.Документ.Установить(Объект.Ссылка);
	
	Попытка
		РСНЗШтрихкодыПоСекциям.Записать(Истина);
		РСНЗСостояниеСборкиЗаказов.Записать(Истина);
	Исключение
		Отказ = Истина;
	КонецПопытки
	
КонецПроцедуры

Процедура ОбновитьШтрихкодыПоСекциям(Объект, Отказ) Экспорт
	
	СсылкаНаДокумент = Объект.Ссылка;
	СуммаПоСекциям = ПолучитьСуммуПоСекциям(СсылкаНаДокумент);
	
	Если СуммаПоСекциям <> Объект.СуммаДокумента ИЛИ СсылкаНаДокумент.Склад <> Объект.Склад Тогда
		ЗаписатьШтрихкодыПоСекциямДокумента(СсылкаНаДокумент, Отказ)			
	КонецЕсли;
	
КонецПроцедуры

Функция ПоискШтрихкодаСекцииСервер(Ссылка, ШК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод,
	|	ШтрихкодыПоСекциямДокумента.Секция,
	|	ШтрихкодыПоСекциямДокумента.Назначение,
	|	ШтрихкодыПоСекциямДокумента.Сумма
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Документ = &Документ
	|	И ШтрихкодыПоСекциямДокумента.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("Штрихкод", ШК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьШтрихкодыПоСекции(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод КАК Штрихкод,
	|	ШтрихкодыПоСекциямДокумента.Секция КАК Секция,
	|	ШтрихкодыПоСекциямДокумента.Назначение КАК Назначение,
	|	ШтрихкодыПоСекциямДокумента.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьСуммуПоСекциям(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ШтрихкодыПоСекциямДокумента.Сумма) КАК Сумма
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПоискДокументаПоШК(Штрихкод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыПоСекциямДокумента.Штрихкод КАК Штрихкод,
	|	ШтрихкодыПоСекциямДокумента.Секция КАК Секция,
	|	ШтрихкодыПоСекциямДокумента.Назначение КАК Назначение,
	|	ШтрихкодыПоСекциямДокумента.Сумма КАК Сумма,
	|	ШтрихкодыПоСекциямДокумента.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Документ;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ПоискШтрихкодаПОQRкоду(QRкод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыПоСекциямДокумента.Штрихкод КАК Штрихкод,
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.QRкод = &QRкод";
	
	Запрос.УстановитьПараметр("QRкод", QRкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Штрихкод;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции


Процедура ЗаписатьШтрихкодыПоСекциямДокумента(Ссылка, Отказ) Экспорт
		
	Выборка = ПолучитьШтрихкодыПоСекциямДокумента(Ссылка);
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаФормирования = ТекущаяДата();
	РСНЗШтрихкодыПоСекциям = РегистрыСведений.ШтрихкодыПоСекциямДокумента.СоздатьНаборЗаписей();
	РСНЗШтрихкодыПоСекциям.Отбор.Документ.Установить(Ссылка);
	Пока Выборка.Следующий() Цикл
		Запись = РСНЗШтрихкодыПоСекциям.Добавить();
		
		Запись.Документ = Ссылка;
		Если Выборка.ЭтоУслуга Тогда
			Запись.Штрихкод = РСОбщийМодульВызовСервера.ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(СокрЛП(СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()),"-","")));
		Иначе
			Запись.Штрихкод	= РСОбщийМодульВызовСервера.ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(СокрЛП(СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","")));
		КонецЕсли;
		Запись.QRкод = ГенерацияШтрихкода.СформироватьQRКод(Ссылка); 
		Запись.ДатаФормирования	= ДатаФормирования;
		Запись.Проверен	= Ложь;
		Запись.Сумма = Выборка.Сумма;
		Запись.Секция = ?(ЗначениеЗаполнено(Выборка.Секция), Выборка.Секция, "");
		Запись.Назначение = Выборка.Назначение;
	КонецЦикла;
	
	Попытка
		РСНЗШтрихкодыПоСекциям.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации("ЗаписатьШтрихкодыПоСекциямДокумента", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		СообщениеОбОшибке = Новый СообщениеПользователю;
		СообщениеОбОшибке.Текст = "Ошибка формирования штрихкода по секциям документа!";
		СообщениеОбОшибке.Сообщить();
		Отказ = Истина;
	КонецПопытки;
		
КонецПроцедуры 

Функция ПолучитьШтрихкодыПоСекциямДокумента(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга,
	|	РеализацияТоваровУслугТовары.Назначение КАК Назначение
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И РеализацияТоваровУслугТовары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	РеализацияТоваровУслугТовары.Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	СУММА(ЧекККМТовары.Сумма),
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ЧекККМТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ЧекККМТовары.Ссылка.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|ГДЕ
	|	ЧекККМТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА ЧекККМТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

