Функция ПолучитьПараметрыЗаполненияПоВодителю(Водитель) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьВодителейТСПартнеров.Водитель,
	|	СвязьВодителейТСПартнеров.Автомобиль,
	|	СвязьВодителейТСПартнеров.ПеревозчикПартнер,
	|	СвязьВодителейТСПартнеров.ПеревозчикКонтрагент КАК Перевозчик
	|ИЗ
	|	РегистрСведений.СвязьВодителейТСПартнеров КАК СвязьВодителейТСПартнеров
	|ГДЕ
	|	СвязьВодителейТСПартнеров.Водитель = &Водитель";
	
	Запрос.УстановитьПараметр("Водитель", Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьВодителя(Партнер, Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьВодителейТСПартнеров.Водитель КАК Водитель,
	|	СвязьВодителейТСПартнеров.Автомобиль КАК Автомобиль,
	|	СвязьВодителейТСПартнеров.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	СвязьВодителейТСПартнеров.ПеревозчикКонтрагент КАК Перевозчик
	|ИЗ
	|	РегистрСведений.СвязьВодителейТСПартнеров КАК СвязьВодителейТСПартнеров
	|ГДЕ
	|	СвязьВодителейТСПартнеров.ПеревозчикПартнер = &Партнер
	|	И СвязьВодителейТСПартнеров.ПеревозчикКонтрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Водитель;
	Иначе
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
КонецФункции