#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Заполнение 

Процедура ЗаполнитьДанныеПоОснованию(Основания, Объект)   Экспорт
	
	мОснований= Новый Массив;
	Если ТипЗнч(Основания) = Тип("Массив") Тогда
		мОснований= Основания;
	Иначе
		мОснований.Добавить(Основания);
	КонецЕсли;
	
	Для Каждого Основание Из мОснований Цикл
		Если ЗначениеЗаполнено(Основание) Тогда
			ТЗОснований= Объект.Основания.Выгрузить();
			НоваяСтрока= ТЗОснований.Найти(Основание, "Документ");
			Если НоваяСтрока= Неопределено Тогда 
				НоваяСтрока= Объект.Основания.Добавить();
				НоваяСтрока.Документ= Основание;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Объект, Основание, , "Дата,Номер,Проведен,Комментарий");
			Объект.ФилиалВыгрузки= Основание.Склад.Подразделение;
			Если ТипЗнч(Основание)  = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(Основание)  = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				Объект.НаправлениеДоставки= Основание.Партнер.БизнесРегион;
				ОбновитьРеквизитыДоставки(Объект);
			КонецЕсли;
			
			Объект.Автор= Пользователи.ТекущийПользователь();
			
			ОбновитьИтогиПоОснованиям(Объект);
		КонецЕсли;
	КонецЦикла;
	
	Если мОснований.Количество() > 0 Тогда
		ЗаказПоставщику= мОснований[0];
		Если ТипЗнч(ЗаказПоставщику) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ЗаказКлиента= ЗаказПоставщику.ДокументОснование;
			Если ЗначениеЗаполнено(ЗаказКлиента) И ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				Объект.Транзит= ЗаказКлиента.Склад.Транзит;
				Объект.ТранзитФизЛицо= ЗаказКлиента.ТранзитФизЛицо;
				Объект.Клиент= ЗаказКлиента.Партнер;
				Объект.КонтрагентКлиента= ЗаказКлиента.Контрагент;
				Объект.ТелефонНаВыгрузке= ЗаказКлиента.ТелефонКлиентаНаВыгрузке;
				Объект.АдресНаВыгрузке= ЗаказКлиента.АдресДоставки;
				Объект.АдресНаВыгрузкеЗначенияПолей= ЗаказКлиента.АдресДоставкиЗначенияПолей;
				Объект.СтоимостьДоставки= ЗаказКлиента.РазмерТранспортных;
				Объект.Комментарий= ЗаказКлиента.Комментарий;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРеквизитыДоставки(Объект) Экспорт

	Объект.АдресНаПогрузке = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, ТекущаяДата());
	Объект.ТелефонНаПогрузке = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, ТекущаяДата());
	
	Объект.АдресНаВыгрузке = АльтерраОбщегоНазначения.ПолучитьАдресФилиала(Объект.ФилиалВыгрузки);     
	
КонецПроцедуры

Процедура ОбновитьИтогиПоОснованиям(Объект) Экспорт
	
	мСсылок = ПолучитьМассивОснований(Объект);
	
	Итоги = ПолучитьИтогиПоДокументам(мСсылок);
	
	ЗаполнитьЗначенияСвойств(Объект, Итоги);  
	
КонецПроцедуры

Функция ПолучитьМассивОснований(Объект)
	
	мСсылок = Новый Массив;
	Для Каждого стрОснование Из Объект.Основания Цикл
		мСсылок.Добавить(стрОснование.Документ);
	КонецЦикла;
	
	Возврат мСсылок;  
	
КонецФункции

Функция ПолучитьИтогиПоДокументам(мСсылок)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	|	ПоступлениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСтрокВДокументе,
	|	ПоступлениеТоваровУслугТовары.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ Товар
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В(&мСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Сумма,
	|	ЗаказПоставщикуТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗаказПоставщикуТовары.Ссылка.СуммаДокумента
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&мСсылок)
	|	И НЕ ЗаказПоставщикуТовары.Отменено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Номенклатура,
	|	0,
	|	ЗаказНаПеремещениеТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка В(&мСсылок)
	|	И НЕ ЗаказНаПеремещениеТовары.Отменено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	0,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&мСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Номенклатура,
	|	-ВозвратТоваровПоставщикуТовары.Сумма,
	|	-ВозвратТоваровПоставщикуТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	-ВозвратТоваровПоставщикуТовары.Ссылка.СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ДокументПоступления В(&мСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Товар.Сумма) КАК СтоимостьТовара,
	|	СУММА(Товар.КоличествоУпаковок * &ТекстЗапросаВесНоменклатуры) КАК Вес,
	|	СУММА(Товар.КоличествоУпаковок * &ТекстЗапросаОбъемНоменклатуры) КАК Объем,
	|	СУММА(Товар.СуммаДокумента) КАК Стоимость,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Товар.Номенклатура.ДлинаЗнаменатель <> 0
	|				ТОГДА Товар.Номенклатура.ДлинаЧислитель / Товар.Номенклатура.ДлинаЗнаменатель
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МаксимальнаяДлина
	|ИЗ
	|	Товар КАК Товар" ;
	
	Запрос.УстановитьПараметр("мСсылок", мСсылок);
	
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"Товар.Номенклатура.ЕдиницаИзмерения",
	"Товар.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаОбъемНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
	"Товар.Номенклатура.ЕдиницаИзмерения",
	"Товар.Номенклатура"));
	
	Рез = Новый Структура("Вес,Объем,СтоимостьТовара,МаксимальнаяДлина,Стоимость",0,0,0,0);
	
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

#КонецОбласти

#Область Печать   

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные 

Процедура УбратьПодстановкиИзКода(стрМакет) Экспорт
	
	стрМакет = СтрЗаменить(стрМакет, "#стрФункций#", "");
	стрМакет = СтрЗаменить(стрМакет, "#стрСобытий#", "");

КонецПроцедуры

Функция ПолучитьТоварыОснований(ЗаказНаДоставку)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК Документ,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент КАК Контрагент,
	|	NULL КАК ПрибытиеНаОтгрузку,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдИзм,
	|	СУММА(ЗаказПоставщикуТовары.Цена) КАК Цена,
	|	СУММА(ЗаказПоставщикуТовары.СуммаСНДС) КАК Сумма,
	|	СУММА(ЗаказПоставщикуТовары.СуммаНДС) КАК СуммаНДС,
	|	ЗаказПоставщикуТовары.Ссылка.Дата КАК Дата,
	|	ЗаказПоставщикуТовары.Номенклатура.Код КАК Код,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Склад.Ссылка, ЗаказПоставщикуТовары.Ссылка.Склад) КАК Склад,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ЗаказПоставщикуТовары.Упаковка
	|		ИНАЧЕ ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК Упаковка
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ЗаказПоставщикуТовары.Ссылка.Дата,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент,
	|	ЗаказПоставщикуТовары.Номенклатура.Код,
	|	ЗаказПоставщикуТовары.Склад,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Склад.Ссылка, ЗаказПоставщикуТовары.Ссылка.Склад),
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ЗаказПоставщикуТовары.Упаковка
	|		ИНАЧЕ ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент,
	|	NULL,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	СУММА(ПоступлениеТоваровУслугТовары.Цена),
	|	СУММА(ПоступлениеТоваровУслугТовары.СуммаСНДС),
	|	СУММА(ПоступлениеТоваровУслугТовары.СуммаНДС),
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Код,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Склад.Ссылка, ПоступлениеТоваровУслугТовары.Ссылка.Склад),
	|	ПоступлениеТоваровУслугТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ПоступлениеТоваровУслугТовары.Упаковка
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Код,
	|	ПоступлениеТоваровУслугТовары.Склад,
	|	ПоступлениеТоваровУслугТовары.Характеристика,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Склад.Ссылка, ПоступлениеТоваровУслугТовары.Ссылка.Склад),
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ПоступлениеТоваровУслугТовары.Упаковка
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ПеремещениеТоваровТовары.Упаковка
	|		ИНАЧЕ ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ПеремещениеТоваровТовары.Упаковка
	|		ИНАЧЕ ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Ссылка.Организация,
	|	NULL,
	|	ЗаказНаПеремещениеТовары.Номенклатура,
	|	СУММА(ЗаказНаПеремещениеТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказНаПеремещениеТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ЗаказНаПеремещениеТовары.Ссылка.Дата,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Код,
	|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
	|	ЗаказНаПеремещениеТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ЗаказНаПеремещениеТовары.Упаковка
	|		ИНАЧЕ ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура,
	|	ЗаказНаПеремещениеТовары.Ссылка.Дата,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Код,
	|	ЗаказНаПеремещениеТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказНаПеремещениеТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ЗаказНаПеремещениеТовары.Ссылка.Организация,
	|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ЗаказНаПеремещениеТовары.Упаковка
	|		ИНАЧЕ ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.Количество) КАК КоличествоУпаковок,
	|	МАКСИМУМ(Товары.Цена) КАК Цена,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_Товары КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Упаковка,
	|	Товары.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МассивДокументов", ЗаказНаДоставку.Основания.Выгрузить().ВыгрузитьКолонку("Документ"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти 

#Область Проверки
//Проведение
Процедура КонтрольОстатков(Объект, Отказ)  Экспорт
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_Основания
	|ИЗ
	|	Документ.ЗаказНаДоставкуОтПоставщика.Основания КАК ЗаказНаДоставкуОтПоставщикаОснования
	|ГДЕ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Ссылка = &Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыКДоставкеОтПоставщика.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗаказыКДоставкеОтПоставщика.Документ КАК Документ
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика КАК ЗаказыКДоставкеОтПоставщика
	|ГДЕ
	|	ЗаказыКДоставкеОтПоставщика.Документ В
	|			(ВЫБРАТЬ
	|				ВТ_Основания.Документ КАК Основание
	|			ИЗ
	|				ВТ_Основания КАК ВТ_Основания)
	|	И ЗаказыКДоставкеОтПоставщика.ВидДвижения = &ВидДвижения
	|	И ЗаказыКДоставкеОтПоставщика.Регистратор <> &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщить("Документы присутствуют в других заказах!");
		Отказ= Истина;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		АльтерраОбщегоНазначения.СообщитьПользователю(Выборка.ЗаказНаДоставку, Строка(Выборка.Документ));
	КонецЦикла; 
	
КонецПроцедуры

//Перед записью
Процедура ПроверитьЧтоЕстьДругиеЗаказы(Объект, Отказ)  Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Основания.Документ КАК Основание
	|ПОМЕСТИТЬ ВТ_Основания
	|ИЗ
	|	&Основания КАК ВТ_Основания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗаказыКДоставке.Документ КАК Документ
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика КАК ЗаказыКДоставке
	|ГДЕ
	|	ЗаказыКДоставке.Документ В
	|			(ВЫБРАТЬ
	|				ВТ_Основания.Основание КАК Основание
	|			ИЗ
	|				ВТ_Основания КАК ВТ_Основания)
	|	И ЗаказыКДоставке.ЗаказНаДоставку <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Основания", Объект.Основания.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ: "+Выборка.Документ+" присутствует в другом заказе: "+Выборка.ЗаказНаДоставку, Объект.Ссылка, "ОснованияДокумент", "Основания.Документ");
		Отказ= Истина;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры   

//При отмене проведения
Процедура ПроверитьЧтоЕстьРейсы(Объект, Отказ)  Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Основания.Документ КАК Основание
	|ПОМЕСТИТЬ ВТ_Основания
	|ИЗ
	|	&Основания КАК ВТ_Основания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыКДоставкеОтПоставщика.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗаказыКДоставкеОтПоставщика.Документ КАК Документ
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика КАК ЗаказыКДоставкеОтПоставщика
	|ГДЕ
	|	ЗаказыКДоставкеОтПоставщика.Документ В
	|			(ВЫБРАТЬ
	|				ВТ_Основания.Основание КАК Основание
	|			ИЗ
	|				ВТ_Основания КАК ВТ_Основания)
	|	И ЗаказыКДоставкеОтПоставщика.ЗаказНаДоставку <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Основания", Объект.Основания.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		АльтерраОбщегоНазначения.СообщитьПользователю(ВыборкаДетальныеЗаписи.ЗаказНаДоставку, "По " + ВыборкаДетальныеЗаписи.ЗаказНаДоставку + " существует активный рейс!");
		Отказ = Истина;                                                                                                                      
	КонецЦикла; 
	
КонецПроцедуры  

#КонецОбласти 

#Область СозданиеНаОсновании  

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	ИмяДокумента = "ЗаказНаДоставкуОтПоставщика";
	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяДокумента]) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы[ИмяДокумента].ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Строка(ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы[ИмяДокумента])) + " (множественный выбор)";
		КомандаСоздатьНаОсновании.МножественныйВыбор= Истина;
		КомандаСоздатьНаОсновании.Идентификатор = "ЗаказНаДоставкуОтПоставщика_ЗаказПоставщику";
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииДополнительноКлиент.ВводНаОснованииКлиент";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДоверенность(ЗаказНаДоставку, Водитель)  Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоверенностьВыданная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДоверенностьВыданная КАК ДоверенностьВыданная
	|ГДЕ
	|	ДоверенностьВыданная.Проведен
	|	И ДоверенностьВыданная.ДокументОснование = &ЗаказНаДоставку
	|	И ДоверенностьВыданная.ФизЛицо = &Водитель";
	
	Запрос.УстановитьПараметр("ЗаказНаДоставку", ЗаказНаДоставку);
	Запрос.УстановитьПараметр("Водитель", Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка= РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ДоверенностьВыданная.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции 

Функция СоздатьДоверенность(ЗаказНаДоставку, Рейс)  Экспорт
	
	ДокДоверенность = Документы.ДоверенностьВыданная.СоздатьДокумент();
	ДокДоверенность.Дата = ТекущаяДата();
	ДокДоверенность.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокДоверенность.ДокументОснование = ЗаказНаДоставку;
	ДокДоверенность.Должность = "Водитель"; 
	ДокДоверенность.Комментарий = "На основании: "+ ЗаказНаДоставку;
	ДокДоверенность.Контрагент = ЗаказНаДоставку.Контрагент;
	ДокДоверенность.Организация = ЗаказНаДоставку.Организация;
	БанковскийСчет = АльтерраОбщегоНазначения.ПолучитьБанковскийСчетПоУмолчанию(ДокДоверенность.Организация);
	ДокДоверенность.БанковскийСчет = БанковскийСчет;
	ДокДоверенность.Ответственный = Пользователи.ТекущийПользователь();
	ДокДоверенность.Партнер = ЗаказНаДоставку.Партнер;
	ДокДоверенность.Статус = Перечисления.СтатусыДоверенностей.НеВыдана; 
	ДокДоверенность.СрокДействия = 10;
	ДокДоверенность.ДатаОкончанияДействия = ТекущаяДата()+3600*24*ДокДоверенность.СрокДействия;
	ДокДоверенность.СуммаДокумента = ЗаказНаДоставку.СтоимостьТовара;
	ДокДоверенность.СуммаОплатПоДокументу =  ЗаказНаДоставку.СтоимостьДоставки;
	ДокДоверенность.ФизЛицо = Рейс.Водитель;
	ДокДоверенность.ПоДокументу = ЗаказНаДоставку.ПоДокументу;
	
	СписокГрузополучателей = ПолучитьНастройкиХранилища("СоотвтетствиеСкладовИГрузополучатеей");
	СкладПолучатель = Рейс.РасчетДоставки[0].СкладРазгрузки;
	
	Для каждого Склад Из СписокГрузополучателей.ТаблицаНастройки Цикл
		Если Склад.СкладПолучатель = СкладПолучатель Тогда
			ДокДоверенность.Грузополучатель = Склад.Грузополучатель
		КонецЕсли;
	КонецЦикла;
		
	ЗаполнитьПаспортныеДанные(ДокДоверенность, ДокДоверенность.ФизЛицо);
	
	ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ДокДоверенность.Организация, ДокДоверенность.Дата);
	ДокДоверенность.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтерСсылка;
	ДокДоверенность.Руководитель = ОтветственныеЛица.РуководительСсылка;
	
	ДокДоверенность.ТипДоверенности = Перечисления.ТипыВыданныхДоверенностей.НаПолучениеТоваров;
	ДокДоверенность.Товары.Загрузить(Документы.ЗаказНаДоставкуОтПоставщика.ПолучитьТоварыОснований(ЗаказНаДоставку));
	
	ДокДоверенность.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокДоверенность.Ссылка;   
	
КонецФункции

Процедура ЗаполнитьПаспортныеДанные(ДокДоверенность, ФизЛицо) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК СерияДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК НомерДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыданДокументФизлица,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачиДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК ПредставлениеДокументаФизЛица
	|ПОМЕСТИТЬ ПаспортРФ
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|ГДЕ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо = &ФизЛицо
	|	И ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК СерияДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК НомерДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыданДокументФизлица,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачиДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК ПредставлениеДокументаФизЛица
	|ПОМЕСТИТЬ ДокументУдостоверяющийЛичность
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|ГДЕ
	|	ДокументыФизическихЛицСрезПоследних.ЯвляетсяДокументомУдостоверяющимЛичность
	|	И ДокументыФизическихЛицСрезПоследних.Физлицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыФизическихЛицСрезПоследних.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПаспортРФ.ВидДокументаФизЛица ЕСТЬ NULL 
	|			ТОГДА ДокументУдостоверяющийЛичность.ВидДокументаФизЛица
	|		ИНАЧЕ ПаспортРФ.ВидДокументаФизЛица
	|	КОНЕЦ КАК ВидДокументаФизЛица
	|ПОМЕСТИТЬ ВыбранныйВидДокумента
	|ИЗ
	|	ПаспортРФ КАК ПаспортРФ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДокументУдостоверяющийЛичность КАК ДокументУдостоверяющийЛичность
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК СерияДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК НомерДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыданДокументФизлица,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачиДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК ПредставлениеДокументаФизЛица
	|ИЗ
	|	ВыбранныйВидДокумента КАК ВыбранныйВидДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|		ПО ВыбранныйВидДокумента.ВидДокументаФизЛица = ДокументыФизическихЛицСрезПоследних.ВидДокумента
	|ГДЕ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДокДоверенность, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


// Возвращает структуру из настроек хранилища дополнительной обработки.
//
// Параметры:
//	ИмяФайла - поиск элемента справочника по имени файла 
//  ИмяСтруктуры - название структуры в структуре хранилища значений
// Возвращаемое значение:
//	Структура со значениями сохраненных настроек.
//
Функция ПолучитьНастройкиХранилища(ИмяСтруктуры,ИмяФайла="НастройкиХранилища.epf") экспорт
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", имяФайла);		
	СтруктураХранилища=ДополнительнаяОбработка.ХранилищеНастроек.Получить();
	если типзнч(СтруктураХранилища)=тип("Структура") и СтруктураХранилища.Свойство(ИмяСтруктуры) тогда
		Возврат СтруктураХранилища[ИмяСтруктуры] ;
	конецесли;
	возврат неопределено;
КонецФункции

#КонецЕсли