#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	Документы.ЗаказНаДоставкуОтПоставщика.ЗаполнитьДанныеПоОснованию(Основание, ЭтотОбъект);
	
КонецПроцедуры

//Проверки
&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Проверки
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если Транзит Тогда
		Если Не ЗначениеЗаполнено(ТелефонНаВыгрузке) Тогда
			АльтерраОбщегоНазначения.СообщитьПользователю(Ссылка, "Не заполнено поле Телефон на выгрузке", "Объект.ТелефонНаВыгрузке");
			Отказ= Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Расчеты
	Если Не Отказ Тогда 
		Документы.ЗаказНаДоставкуОтПоставщика.ОбновитьИтогиПоОснованиям(ЭтотОбъект);
	КонецЕсли; 
	
	//ЕстьНакладныеЭТрН(Отказ);
	
КонецПроцедуры

Процедура ЕстьНакладныеЭТрН(Отказ)
	
	Если НЕ Отказ И Не ЭтоНовый() И Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =	
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК Результат
			|ИЗ
			|	Документ.Saby_ТранспортнаяНакладная.ЗаказыНаДоставкуОтПоставщика КАК Накладная
			|ГДЕ
			|	Накладная.Заказ = &Заказ
			|	И НЕ Накладная.Ссылка.ПометкаУдаления";

		Запрос.УстановитьПараметр("Заказ", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По заказу есть накладные!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Расчеты
&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ)
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Если Не Проведен И Не ПометкаУдаления И Не ОбменДанными.Загрузка Тогда
			Сообщить("Запрещено распроводить документ!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

//Проведение
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Проверим нет ли документов продажи в других заказах
	Документы.ЗаказНаДоставкуОтПоставщика.КонтрольОстатков(ЭтотОбъект, Отказ);

	Если Не Отказ Тогда
		//ЗаказыКДоставке
		Движения.ЗаказыКДоставкеОтПоставщика.Записывать = Истина;
		Для Каждого ТекСтрокаОснования Из Основания Цикл
			Движение = Движения.ЗаказыКДоставкеОтПоставщика.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ЗаказНаДоставку = Ссылка;
			Движение.Документ = ТекСтрокаОснования.Документ;
			Движение.Количество = 1;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Проверим нет ли активных рейсов
	Документы.ЗаказНаДоставкуОтПоставщика.ПроверитьЧтоЕстьРейсы(Ссылка, Отказ);
	Документы.РейсОтПоставщика.ПроверитьЧтоНетРейсовИлиЗаказовНаДоставку(ЭтотОбъект, Отказ);   
	
КонецПроцедуры

#КонецЕсли
