
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Партнер = Неопределено;
	УсловиеПоПартнеру = Ложь;
	
	Если Параметры.ВыборОснованияПлатежа 
		И ТипЗнч(Параметры.РедактируемыйДокумент) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
		
		Партнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отбор.Контрагент, "Партнер");
		УсловиеПоПартнеру = Истина;
	КонецЕсли;
		
	Если УсловиеПоПартнеру Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				СписокОснованийПлатежа,
				"Партнер",
				Партнер,
				ВидСравненияКомпоновкиДанных.Равно,
				,
				ЗначениеЗаполнено(Партнер));
	КонецЕсли;
		
КонецПроцедуры
