#Область НовоеЦенообразование

Процедура ЗаполнитьУсловияПродажВСтрокеТЧ_НЦ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Перем СтруктураПараметровДействия;

	Если СтруктураДействий.Свойство("ЗаполнитьУсловияПродаж", СтруктураПараметровДействия) 
		И СтруктураПараметровДействия.Свойство("Подразделение") Тогда

		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	ВложенныйЗапрос.Валюта КАК Валюта,
		                      |	ВложенныйЗапрос.ВидЦены КАК ВидЦены,
		                      |	ВЫБОР
		                      |		КОГДА ВложенныйЗапрос.Цена > 0
		                      |			ТОГДА ВЫБОР
		                      |					КОГДА &Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		                      |						ТОГДА &ТекстЗапросаКоэффициентУпаковки1
		                      |					ИНАЧЕ 1
		                      |				КОНЕЦ * ВложенныйЗапрос.Цена / ЕСТЬNULL(ВложенныйЗапрос.КоэффициентУпаковкиСоглашения, 1) * ВЫБОР
		                      |					КОГДА &Валюта <> ВложенныйЗапрос.Валюта
		                      |						ТОГДА ВЫБОР
		                      |								КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.Кратность, 0) > 0
		                      |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.Курс, 0) > 0
		                      |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
		                      |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
		                      |									ТОГДА КурсыСрезПоследнихВалютаСоглашения.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаСоглашения.Кратность)
		                      |								ИНАЧЕ 0
		                      |							КОНЕЦ
		                      |					ИНАЧЕ 1
		                      |				КОНЕЦ
		                      |		КОГДА ВложенныйЗапрос.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		                      |				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
		                      |			ТОГДА ВЫБОР
		                      |					КОГДА &Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		                      |						ТОГДА &ТекстЗапросаКоэффициентУпаковки1
		                      |					ИНАЧЕ 1
		                      |				КОНЕЦ * ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
		                      |					КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
		                      |						ТОГДА ВЫБОР
		                      |								КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Кратность, 0) > 0
		                      |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Курс, 0) > 0
		                      |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
		                      |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
		                      |									ТОГДА КурсыСрезПоследнихВалютаЦены.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаЦены.Кратность)
		                      |								ИНАЧЕ 0
		                      |							КОНЕЦ
		                      |					ИНАЧЕ 1
		                      |				КОНЕЦ
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК Цена,
		                      |	ВложенныйЗапрос.СрокПоставки КАК СрокПоставки
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		СоглашениеШапка.Валюта КАК Валюта,
                              |   	&ПолеВидЦены    как ВидЦены,
							  |		ЕСТЬNULL(СоглашениеТовары.Цена, 0) КАК Цена,
		                      |		СоглашениеТовары.Упаковка КАК Упаковка,
		                      |		&ТекстЗапросаКоэффициентУпаковки3 КАК КоэффициентУпаковкиСоглашения,
		                      |		ВЫБОР
		                      |			КОГДА ЕСТЬNULL(СоглашениеТовары.СрокПоставки, 0) > 0
		                      |				ТОГДА СоглашениеТовары.СрокПоставки
		                      |			ИНАЧЕ ВЫБОР
		                      |					КОГДА ЕСТЬNULL(СоглашениеЦеновыеГруппы.СрокПоставки, 0) > 0
		                      |						ТОГДА СоглашениеЦеновыеГруппы.СрокПоставки
		                      |					ИНАЧЕ СоглашениеШапка.СрокПоставки
		                      |				КОНЕЦ
		                      |		КОНЕЦ КАК СрокПоставки
		                      |	ИЗ
		                      |		Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
		                      |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		                      |			ПО (СправочникНоменклатура.Ссылка = &Номенклатура)
		                      |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
		                      |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |					ВидыЦен.Ссылка КАК Ссылка,
		                      |					ВидыЦен.ГруппаВидовЦен КАК ГруппаВидовЦен
		                      |				ИЗ
		                      |					Справочник.ВидыЦен КАК ВидыЦен
		                      |				ГДЕ
		                      |					ВидыЦен.ФорматПодразделения = &ФорматПодразделения
		                      |					И ВидыЦен.РегионПрисутствия = &РегионПрисутствия) КАК ВидыЦенТовары
		                      |				ПО СоглашениеТовары.ГруппаВидовЦен = ВидыЦенТовары.ГруппаВидовЦен
		                      |			ПО СоглашениеШапка.Ссылка = СоглашениеТовары.Ссылка
		                      |				И (СоглашениеТовары.Номенклатура = &Номенклатура)
		                      |				И (СоглашениеТовары.Характеристика = &Характеристика)
		                      |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
		                      |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |					ВидыЦен.Ссылка КАК Ссылка,
		                      |					ВидыЦен.ГруппаВидовЦен КАК ГруппаВидовЦен
		                      |				ИЗ
		                      |					Справочник.ВидыЦен КАК ВидыЦен
		                      |				ГДЕ
		                      |					ВидыЦен.ФорматПодразделения = &ФорматПодразделения
		                      |					И ВидыЦен.РегионПрисутствия = &РегионПрисутствия) КАК ВидыЦенЦеновыеГруппы
		                      |				ПО СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ВидыЦенЦеновыеГруппы.ГруппаВидовЦен
		                      |			ПО СоглашениеШапка.Ссылка = СоглашениеЦеновыеГруппы.Ссылка
		                      |				И (СправочникНоменклатура.Ссылка.ЦеноваяГруппа = СоглашениеЦеновыеГруппы.ЦеноваяГруппа)
		                      |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
		                      |			ПО СоглашениеШапка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
		                      |				И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
		                      |				И (ВидыЦен.РегионПрисутствия = &регионПрисутствия)
		                      |	ГДЕ
		                      |		СоглашениеШапка.Ссылка = &Соглашение) КАК ВложенныйЗапрос
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                      |				КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
		                      |				Номенклатура = &Номенклатура
		                      |					И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних
		                      |		ПО ВложенныйЗапрос.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыСрезПоследнихВалютаЦены
		                      |		ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатурыСрезПоследних.Валюта)
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыСрезПоследнихВалютаДокумента
		                      |		ПО (ИСТИНА)
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыСрезПоследнихВалютаСоглашения
		                      |		ПО (КурсыСрезПоследнихВалютаСоглашения.Валюта = ВложенныйЗапрос.Валюта)");
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВЫРАЗИТЬ(&Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
		"ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура)"));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЦеныНоменклатурыСрезПоследних.Упаковка",
		"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки3",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"СоглашениеТовары.Упаковка",
		"СоглашениеТовары.Номенклатура"));
		
		Запрос.УстановитьПараметр("Упаковка"        , ТекущаяСтрока.Упаковка); 
		

    КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьУсловияПродажУслуги", СтруктураПараметровДействия) 
		И СтруктураПараметровДействия.Свойство("Подразделение") Тогда
		    Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                          |	ВложенныйЗапрос.Валюта КАК Валюта,
		                          |	ВложенныйЗапрос.ВидЦены КАК ВидЦены,
		                          |	ВЫБОР
		                          |		КОГДА ВложенныйЗапрос.Цена > 0
		                          |			ТОГДА ВложенныйЗапрос.Цена * ВЫБОР
		                          |					КОГДА &Валюта <> ВложенныйЗапрос.Валюта
		                          |						ТОГДА ВЫБОР
		                          |								КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.Кратность, 0) > 0
		                          |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.Курс, 0) > 0
		                          |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
		                          |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
		                          |									ТОГДА КурсыСрезПоследнихВалютаСоглашения.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаСоглашения.Кратность)
		                          |								ИНАЧЕ 0
		                          |							КОНЕЦ
		                          |					ИНАЧЕ 1
		                          |				КОНЕЦ
		                          |		КОГДА ВложенныйЗапрос.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		                          |				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
		                          |			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * ВЫБОР
		                          |					КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
		                          |						ТОГДА ВЫБОР
		                          |								КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Кратность, 0) > 0
		                          |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Курс, 0) > 0
		                          |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
		                          |										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
		                          |									ТОГДА КурсыСрезПоследнихВалютаЦены.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаЦены.Кратность)
		                          |								ИНАЧЕ 0
		                          |							КОНЕЦ
		                          |					ИНАЧЕ 1
		                          |				КОНЕЦ
		                          |		ИНАЧЕ 0
		                          |	КОНЕЦ КАК Цена
		                          |ИЗ
		                          |	(ВЫБРАТЬ
		                          |		СоглашениеШапка.Валюта КАК Валюта,
		                          |		&ПолеВидЦены КАК ВидЦены,
		                          |		ЕСТЬNULL(СоглашениеТовары.Цена, 0) КАК Цена
		                          |	ИЗ
		                          |		Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
		                          |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		                          |			ПО (СправочникНоменклатура.Ссылка = &Номенклатура)
		                          |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
		                          |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенТовары
		                          |				ПО СоглашениеТовары.ГруппаВидовЦен = ВидыЦенТовары.ГруппаВидовЦен
		                          |					И (ВидыЦенТовары.ФорматПодразделения = &ФорматПодразделения)
		                          |					И (ВидыЦенТовары.РегионПрисутствия = &регионПрисутствия)
		                          |			ПО СоглашениеШапка.Ссылка = СоглашениеТовары.Ссылка
		                          |				И (СоглашениеТовары.Номенклатура = &Номенклатура)
		                          |				И (СоглашениеТовары.Характеристика = &Характеристика)
		                          |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
		                          |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦенЦеновыеГруппы
		                          |				ПО СоглашениеЦеновыеГруппы.ГруппаВидовЦен = ВидыЦенЦеновыеГруппы.ГруппаВидовЦен
		                          |					И (ВидыЦенЦеновыеГруппы.ФорматПодразделения = &ФорматПодразделения)
		                          |					И (ВидыЦенЦеновыеГруппы.РегионПрисутствия = &регионПрисутствия)
		                          |			ПО СоглашениеШапка.Ссылка = СоглашениеЦеновыеГруппы.Ссылка
		                          |				И (СправочникНоменклатура.Ссылка.ЦеноваяГруппа = СоглашениеЦеновыеГруппы.ЦеноваяГруппа)
		                          |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
		                          |			ПО СоглашениеШапка.ГруппаВидовЦен = ВидыЦен.ГруппаВидовЦен
		                          |				И (ВидыЦен.ФорматПодразделения = &ФорматПодразделения)
		                          |				И (ВидыЦен.РегионПрисутствия = &регионПрисутствия)
		                          |	ГДЕ
		                          |		СоглашениеШапка.Ссылка = &Соглашение) КАК ВложенныйЗапрос
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                          |				КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
		                          |				Номенклатура = &Номенклатура
		                          |					И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних
		                          |		ПО ВложенныйЗапрос.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыСрезПоследнихВалютаЦены
		                          |		ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатурыСрезПоследних.Валюта)
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыСрезПоследнихВалютаДокумента
		                          |		ПО (ИСТИНА)
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыСрезПоследнихВалютаСоглашения
		                          |		ПО (КурсыСрезПоследнихВалютаСоглашения.Валюта = ВложенныйЗапрос.Валюта)");
 	КонецЕсли;

	
	Если (СтруктураДействий.Свойство("ЗаполнитьУсловияПродаж", СтруктураПараметровДействия) 
	 ИЛИ СтруктураДействий.Свойство("ЗаполнитьУсловияПродажУслуги", СтруктураПараметровДействия))
	 	И СтруктураПараметровДействия.Свойство("Подразделение") Тогда

		Запрос.УстановитьПараметр("Соглашение"      , СтруктураПараметровДействия.Соглашение);
		Запрос.УстановитьПараметр("Дата"            , СтруктураПараметровДействия.Дата);
		Запрос.УстановитьПараметр("Номенклатура"    , ТекущаяСтрока.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика"  , ТекущаяСтрока.Характеристика);
		Запрос.УстановитьПараметр("Валюта"          , СтруктураПараметровДействия.Валюта);
		если ТекущаяСтрока.Свойство("Обособленно") и ТекущаяСтрока.Обособленно и СтруктураПараметровДействия.Подразделение.ФорматПодразделения<>Справочники.ФорматыПодразделений.МДР тогда  
			ФорматПодразделения=Справочники.ФорматыПодразделений.ТСК;
		иначе     
			ФорматПодразделения=СтруктураПараметровДействия.Подразделение.ФорматПодразделения;
		конецесли;	
		Запрос.УстановитьПараметр("ФорматПодразделения"          , ФорматПодразделения);
		Запрос.УстановитьПараметр("РегионПрисутствия"          , СтруктураПараметровДействия.Подразделение.РегионПрисутствия);
	       Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ПолеВидЦены",ЦеныПредприятияЗаполнениеСервер.ПолеВидаЦены());

	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
		
			ТекущаяСтрока.Цена = Выборка.Цена;
			
			Если ТекущаяСтрока.Свойство("ВидЦены") Тогда
				
				Если ЗначениеЗаполнено(Выборка.ВидЦены) Тогда
					ТекущаяСтрока.ВидЦены = Выборка.ВидЦены;
				Иначе
					ТекущаяСтрока.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекущаяСтрока.Свойство("СрокПоставки") Тогда
				
				ТекущаяСтрока.СрокПоставки = Выборка.СрокПоставки;
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&Вместо ("ЗаполнитьУсловияПродаж")
Процедура Док_ЗаполнитьУсловияПродаж(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если ДопМодуль.НовоеЦенообразование() Тогда
		ЗаполнитьУсловияПродажВСтрокеТЧ_НЦ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
	Иначе
		ПродолжитьВызов(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	КонецЕсли;	

КонецПроцедуры   


#КонецОбласти

&Вместо ("ШаблонПоляВыборкиПоКлючуДействия")
Функция Док_ШаблонПоляВыборкиПоКлючуДействия(КлючДействия, ТолькоПроверитьПоддерживаемыеКлючи = Ложь)

	Если КлючДействия = "ЗаполнитьИндексМТ" Тогда
		Возврат ",
		|	ВЫБОР КОГДА втТаблицаНоменклатуры.Номенклатура.ВидНоменклатуры.ПродукцияМаркируемаяДляГИСМ
		|   ТОГДА 1
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК ИндексМТ";
	КонецЕсли;
    возврат ПродолжитьВызов(КлючДействия, ТолькоПроверитьПоддерживаемыеКлючи);
	
КонецФункции
