&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗагрузитьНаСервере()
	НомерСтроки = 2;
	ЦветОшибка= Новый Цвет(255,0,0);
	
	Пока Истина Цикл
		Ошибка= Ложь;
		стрНомерСтроки= Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
		
		//Читаем данные
		стрЗонаДоставки= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").Текст);
		Если ПустаяСтрока(стрЗонаДоставки) Тогда 
			Прервать;
		КонецЕсли;
		стрФилиал= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").Текст);
	    стрГлобальнаяЗона = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").Текст);

		//Получаем значения
		ЗонаДоставки= Обработки.КартографическийИнтерфейсДоставка.ПолучитьЗонуДоставкиПоНаименованию(стрЗонаДоставки);
		Если Не ЗначениеЗаполнено(ЗонаДоставки) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").ЦветФона= ЦветОшибка;
		КонецЕсли;
				
		Филиал= Справочники.СтруктураПредприятия.НайтиПоНаименованию(стрФилиал, Истина);
		Если Не ЗначениеЗаполнено(Филиал) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").ЦветФона= ЦветОшибка;
		КонецЕсли;
						
		ГлобальнаяЗона = Перечисления.ЗоныДоставкиКлиента[стрГлобальнаяЗона];
		Если Не ЗначениеЗаполнено(ГлобальнаяЗона) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").ЦветФона= ЦветОшибка;
		КонецЕсли;
		
		//Пишем данные
		Если Не Ошибка Тогда
			НаборЗаписей= РегистрыСведений.ГлобальныеЗоныПоЗонамДоставкиДоКлиента.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Зона.Установить(ЗонаДоставки);
			НаборЗаписей.Отбор.Подразделение.Установить(Филиал);
			
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись= НаборЗаписей.Добавить();
			Иначе
				НоваяЗапись= НаборЗаписей[0];
			КонецЕсли;
			
			НоваяЗапись.Зона= ЗонаДоставки;
			НоваяЗапись.Подразделение= Филиал;
			НоваяЗапись.ГлобальнаяЗона= ГлобальнаяЗона;			
			
			НаборЗаписей.Записать();
		КонецЕсли;
		
		НомерСтроки= НомерСтроки+1;
	КонецЦикла;
КонецПроцедуры
