&НаСервере
Функция ПолучитьСтатусАннулирована()
    Возврат Перечисления.СтатусыКартЛояльности.Аннулирована;
КонецФункции

&НаСервере

Функция ПолучитьЗначениеДопСведений(Ссылка ,Свойство) //Экспорт

    Запрос = Новый Запрос;

    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("Свойство", Свойство);

    Запрос.Текст = "ВЫБРАТЬ
               |    ДополнительныеСведения.Значение
               |ИЗ
               |    РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
               |ГДЕ
               |    ДополнительныеСведения.Объект = &Ссылка
               |    И ДополнительныеСведения.Свойство = &Свойство";   

    Результат = Запрос.Выполнить().Выбрать();

    Если Результат.Количество() = 0 Тогда
        Возврат Неопределено;
    Иначе
        Результат.Следующий();

        Возврат Результат.Значение;
    КонецЕсли;
КонецФункции

Функция ЗаписатьЗначениеДопСведения(Объект, Свойство, Значение)
    Попытка
        НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();

        НаборЗаписей.Отбор.Объект.Установить(Объект);
        НаборЗаписей.Отбор.Свойство.Установить(Свойство);

        НоваяСтрокаНабора = НаборЗаписей.Добавить();

        НоваяСтрокаНабора.Объект = Объект;
        НоваяСтрокаНабора.Свойство = Свойство;

        НоваяСтрокаНабора.Значение = Значение;

        НаборЗаписей.Записать();

        Возврат Истина;
    Исключение
        Возврат Ложь;
    КонецПопытки;
КонецФункции


&НаСервере
Процедура Спр_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	    ДатаАннул = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата аннулирования карты");
		ЗаполненаДатаАннулирования = ПолучитьЗначениеДопСведений(ТекущийОбъект.Ссылка, ДатаАннул);
		Если ТекущийОбъект.Статус = ПолучитьСтатусАннулирована() тогда    //Аннулирована
			//Бригадиры
			Если АльтерраОбщегоНазначения.ЭтоБригадир(ТекущийОбъект.Партнер) и ТекущийОбъект.Партнер.ПИН_Код <> "" тогда
              ОчиститьПИНПартнера(ТекущийОбъект.Партнер.Код);
		    Конецесли;  
		    //Бригадиры.
			если  (ЗаполненаДатаАннулирования = Неопределено) тогда   //Не было даты аннулирования
			  ЗаписатьЗначениеДопСведения(ТекущийОбъект.Ссылка, ДатаАннул, ТекущаяДата());
		    иначе
			конецесли;  
		Иначе      //действует
		     ЗаписатьЗначениеДопСведения(ТекущийОбъект.Ссылка, ДатаАннул, Неопределено);
			 //Бригадиры  Если карта была аннулирована, а потом снова действует, нужен ли новый ПИН и нужно ли ЕГО отправлять????
			 Если АльтерраОбщегоНазначения.ЭтоБригадир(ТекущийОбъект.Партнер) и ТекущийОбъект.Партнер.ПИН_Код = "" тогда
			  АльтерраОбщегоНазначения.СгенерироватьПИНПартнера(ТекущийОбъект.Партнер.Код);
			 Конецесли; 
		     //Бригадиры.
	    конецесли;
			
КонецПроцедуры
	

Процедура ОчиститьПИНПартнера(Код)
	ПартнерСсылка = Справочники.Партнеры.НайтиПоКоду(Код);
    ПартнерОбъект = ПартнерСсылка.ПолучитьОбъект();
    ПартнерОбъект.ПИН_Код = "";
    ПартнерОбъект.Записать();
	
КонецПроцедуры // ОчиститьПИНПартнера()




 &НаКлиенте
 &После("Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта")
 Процедура Спр_Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	 // Альтерра Беспалов
	 Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		 Элементы.Владелец.ТолькоПросмотр= Истина;
	 КонецЕсли;
	 //-
 КонецПроцедуры

