
&ИзменениеИКонтроль("ПолучитьДанныеВыбораСтавкиНДС")
Процедура Док_ПолучитьДанныеВыбораСтавкиНДС(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос();
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтавкиНДСТипыНалогообложенияНДС.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(СтавкиНДСТипыНалогообложенияНДС.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.СтавкиНДС.ТипыНалогообложенияНДС КАК СтавкиНДСТипыНалогообложенияНДС
	|ГДЕ
	|	(СтавкиНДСТипыНалогообложенияНДС.Ссылка.Страна = &Страна 
	|		ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
	|	И &ОтборПоДате
	|	И &ОтборПоТипамНалогообложения
	|	И &ОтборПоПараметрам
	|	И &ФильтрПоРассчетнойСтавке
	|";
	
	Страна = Неопределено;
	Если Параметры.Свойство("Организация") Тогда
		Страна = ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(Параметры.Организация);
	ИначеЕсли Параметры.Свойство("Страна") Тогда
		Страна = Параметры.Страна;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Страна) Тогда
		Страна = ЗначениеНастроекКлиентСерверПовтИсп.ОсновнаяСтрана();
	КонецЕсли;
	Запрос.УстановитьПараметр("Страна", Страна);
	
	БезОтбораПоДате = Ложь;
	ОтборДействующихВПериоде = Ложь;
	Если Параметры.Свойство("БезОтбораПоДате") Тогда
		БезОтбораПоДате = Параметры.БезОтбораПоДате;
	КонецЕсли;
	Если Параметры.Свойство("НачалоПериода") И Параметры.Свойство("КонецПериода") Тогда
		ОтборДействующихВПериоде = Истина;
	КонецЕсли; 
	Дата = ТекущаяДатаСеанса();
	Если Параметры.Свойство("Дата") И ЗначениеЗаполнено(Параметры.Дата) Тогда
		Дата = Параметры.Дата;
	КонецЕсли;
	БезОтбораПоДате = Истина;
	Если БезОтбораПоДате Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДате", "ИСТИНА");
	ИначеЕсли ОтборДействующихВПериоде Тогда
		ТекстОтбораПоДате = "";
		Если ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
			ТекстОтбораПоДате = "(СтавкиНДСТипыНалогообложенияНДС.Ссылка.КонецПериода >= &НачалоПериода
			|	ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.КонецПериода = ДАТАВРЕМЯ(1,1,1))";
			Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
		КонецЕсли;
		Если ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
			ТекстОтбораПоДате = ТекстОтбораПоДате
				+ ?(ТекстОтбораПоДате = "", "", " И ")
				+ "(СтавкиНДСТипыНалогообложенияНДС.Ссылка.НачалоПериода <= &КонецПериода
				|	ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.НачалоПериода = ДАТАВРЕМЯ(1,1,1))";
			Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
		КонецЕсли;
		Если ТекстОтбораПоДате = "" Тогда
			ТекстОтбораПоДате = "ИСТИНА";
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДате", ТекстОтбораПоДате);
	Иначе
		ТекстОтбораПоДате = "(СтавкиНДСТипыНалогообложенияНДС.Ссылка.НачалоПериода <= &Дата
							|		ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.НачалоПериода = ДАТАВРЕМЯ(1,1,1))
							|	И (КОНЕЦПЕРИОДА(СтавкиНДСТипыНалогообложенияНДС.Ссылка.КонецПериода, ДЕНЬ) >= &Дата
							|		ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.КонецПериода = ДАТАВРЕМЯ(1,1,1))";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДате", ТекстОтбораПоДате);
		Запрос.УстановитьПараметр("Дата", Дата);
	КонецЕсли;
	
	НалогообложениеНДС = Неопределено;
	Если Параметры.Свойство("НалогообложениеНДС", НалогообложениеНДС) Тогда
		#Вставка 
		Если ТипЗнч(Параметры.НалогообложениеНДС) = Тип("ДанныеФормыСтруктура") Тогда
			Параметры.НалогообложениеНДС.Свойство("НалогообложениеНДС", НалогообложениеНДС);
		КонецЕсли;	 
		#КонецВставки 
		Если Не ЗначениеЗаполнено(НалогообложениеНДС) Тогда
			НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоТипамНалогообложения", "СтавкиНДСТипыНалогообложенияНДС.ТипНалогообложенияНДС В(&ТипыНалогообложения)");
		Запрос.УстановитьПараметр("ТипыНалогообложения", НалогообложениеНДС);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоТипамНалогообложения", "ИСТИНА");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Ссылка") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоПараметрам", "СтавкиНДСТипыНалогообложенияНДС.Ссылка В (&ОтборПоСсылке)");
		Запрос.УстановитьПараметр("ОтборПоСсылке", Параметры.Отбор.Ссылка);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоПараметрам", "ИСТИНА");
	КонецЕсли;
	
	Если Параметры.Свойство("ИсключатьДробныеСтавки") И Параметры.ИсключатьДробныеСтавки Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФильтрПоРассчетнойСтавке", "СтавкиНДСТипыНалогообложенияНДС.Ссылка.РасчетнаяСтавка = ЛОЖЬ"); 
	ИначеЕсли Параметры.Свойство("ТолькоДробныеСтавки") И Параметры.ТолькоДробныеСтавки Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФильтрПоРассчетнойСтавке", "СтавкиНДСТипыНалогообложенияНДС.Ссылка.РасчетнаяСтавка = ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФильтрПоРассчетнойСтавке", "ИСТИНА");
	КонецЕсли; 
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Параметры.СтрокаПоиска)
			ИЛИ СтрНайти(НРег(Выборка.Представление), НРег(Параметры.СтрокаПоиска)) = 1 Тогда
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
