
Процедура ЗаблокироватьВсёНаСервере(ПричинаБлокировки, Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Объект.Проведен Тогда
		
		БлокировкиПоПриходномуОрдеру = Альтерра_СкладСервер.ПолучитьБлокировкиПоОснования(Объект.Ссылка).Выгрузить();
		
		Если БлокировкиПоПриходномуОрдеру.Количество() = 0 Тогда
			
			ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
			
			ПараметрыЗаполнения = Новый Структура();
			ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
			ПараметрыЗаполнения.Вставить("Склад",Объект.Склад);
			ПараметрыЗаполнения.Вставить("ДокументОснование",Объект.Ссылка);
			ПараметрыЗаполнения.Вставить("Статус",Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
			ПараметрыЗаполнения.Вставить("ПричинаБлокировки",Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(ПричинаБлокировки));
			ПараметрыЗаполнения.Вставить("Комментарий","Создан по кнопке 'Заблокировать всё на пересортицу'");
			ПараметрыЗаполнения.Вставить("Товары",Объект.Товары);
			
			Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировки,ПараметрыЗаполнения);
			
		Иначе
			Сообщить("По данному основанию уже созданы блокировки движения товаров!");
		КонецЕсли;
		
	Иначе
		Сообщить("Документ не проведен!");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
