
&ИзменениеИКонтроль("ШтрихкодыУпаковокПоДокументамЗаполнены")
Функция Док_ШтрихкодыУпаковокПоДокументамЗаполнены(ДокументыРеализации) Экспорт
	Результат = Ложь;

	//++ Локализация

	СтатусыДокументовРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ДокументыРеализации, "Статус");
	Для Каждого СтатусДокументаРеализации из СтатусыДокументовРеализации Цикл
		Если СтатусДокументаРеализации.Значение = Перечисления.СтатусыРеализацийТоваровУслуг.КПредоплате Тогда
			ИндексДокументаРеализации = ДокументыРеализации.Найти(СтатусДокументаРеализации.Ключ);
			Если ИндексДокументаРеализации <> Неопределено Тогда
				ДокументыРеализации.Удалить(ИндексДокументаРеализации);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ДокументыРеализации.Количество() > 0
		И ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда

#Удаление
		ИнтеграцияИСУТ.ПроверитьЗаполнениеАкцизныхМарокПоСсылкам(ДокументыРеализации, Результат);
#КонецУдаления
	КонецЕсли;

	//-- Локализация

	Возврат НЕ Результат;

КонецФункции
&ИзменениеИКонтроль("ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа")
Функция Док_ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа(ДокументСсылка)

	РасшифровкаПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "РасшифровкаПлатежа").Выгрузить();

	Если ТипЗнч(РасшифровкаПлатежа) = Тип("ТаблицаЗначений") Тогда

		Если ДокументОплатыСВозможностьюПробитияЕдиногоЧека(ДокументСсылка) Тогда
			Если РасшифровкаПлатежа.Колонки.Найти("ОснованиеПлатежа") = Неопределено Тогда
				РасшифровкаПлатежа.Колонки.Добавить("ОснованиеПлатежа");
			КонецЕсли;
			РасшифровкаПлатежа.Свернуть("ОбъектРасчетов, ОснованиеПлатежа, СтавкаНДС", "СуммаНДС, Сумма");
			
			Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
				ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ДокументОснование");

				#Вставка  
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АрендаНоменклатурыВозврат") Тогда
					 ДокументОснование = Неопределено; 
				КонецЕсли;
				#КонецВставки
				Для Каждого СтрокаПлатежа Из РасшифровкаПлатежа Цикл
					СтрокаПлатежа.ОснованиеПлатежа = ДокументОснование;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если РасшифровкаПлатежа.Колонки.Найти("СтавкаНДС") <> Неопределено Тогда
				РасшифровкаПлатежа.Свернуть("ОбъектРасчетов, СтавкаНДС", "СуммаНДС, Сумма");
			Иначе
				РасшифровкаПлатежа.Свернуть("ОбъектРасчетов", "Сумма");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	РасшифровкаПлатежа.Колонки.Добавить("Заказ");
	Для Каждого СтрокаРасшифровкиПлатежа Из РасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(СтрокаРасшифровкиПлатежа.ОбъектРасчетов) Тогда
			Объект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасшифровкиПлатежа.ОбъектРасчетов, "Объект");

			Если (ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаказКлиента")
				ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента"))
				И РасшифровкаПлатежа.Колонки.Найти("ОснованиеПлатежа") <> НЕОПРЕДЕЛЕНО
				И ЗначениеЗаполнено(СтрокаРасшифровкиПлатежа.ОснованиеПлатежа)
				И ДокументОплатыСВозможностьюПробитияЕдиногоЧека(ДокументСсылка)
				И ДокументПоставкиСВозможностьюПробитияЕдиногоЧека(СтрокаРасшифровкиПлатежа.ОснованиеПлатежа) Тогда

				СтрокаРасшифровкиПлатежа.Заказ = СтрокаРасшифровкиПлатежа.ОснованиеПлатежа;
			Иначе
				СтрокаРасшифровкиПлатежа.Заказ = Объект;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПлатежа.ОбъектРасчетов)
			И НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПлатежа.Заказ) Тогда
			СтрокаРасшифровкиПлатежа.Заказ = ДокументСсылка;
		КонецЕсли;	

	КонецЦикла;

	Возврат РасшифровкаПлатежа;

КонецФункции

&ИзменениеИКонтроль("СуммаОплатыБольшеСуммыПоставок")
Функция Док_СуммаОплатыБольшеСуммыПоставок(ДокументОплаты, ОбъектыРасчетов)
	СуммаОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "СуммаДокумента");

	СуммаПоставки = 0;
	Для Каждого СтрокаОбъектыРасчетов Из ОбъектыРасчетов Цикл
		ИмяРеквизитаСуммыЗаказа = "СуммаДокумента";
		Если ТипЗнч(СтрокаОбъектыРасчетов.Заказ) = Тип("СправочникСсылка.ПодарочныеСертификаты") Тогда
			ИмяРеквизитаСуммыЗаказа = "Владелец.Номинал";
		#Вставка
		ИначеЕсли ТипЗнч(СтрокаОбъектыРасчетов.Заказ) = Тип("ДокументСсылка.АрендаНоменклатуры") ИЛИ ТипЗнч(СтрокаОбъектыРасчетов.Заказ) = Тип("ДокументСсылка.АрендаНоменклатурыВозврат") Тогда
			ИмяРеквизитаСуммыЗаказа = "СуммаЗалога";	
		#КонецВставки
		КонецЕсли;
		СуммаПоставки = СуммаПоставки + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОбъектыРасчетов.Заказ, ИмяРеквизитаСуммыЗаказа);
	КонецЦикла;

	Возврат СуммаОплаты > СуммаПоставки;
КонецФункции

&ИзменениеИКонтроль("ОбновитьПараметрыФискальногоЧекаПараметрыКоррекции")
Процедура Док_ОбновитьПараметрыФискальногоЧекаПараметрыКоррекции(ПараметрыОперацииФискализацииЧека, ПараметрыОперацииЧека)

Если ПараметрыОперацииЧека.ТипФискальногоДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции Тогда
		#Удаление
		ИмяРеквизита = "ДокументОснование";
		
		ФормированиеПараметровФискальногоЧекаСервер.ПараметрыФискальногоЧекаЗаполнитьПараметрыКоррекции(
			ПараметрыОперацииФискализацииЧека,
			?(ПараметрыОперацииЧека.ВидЧекаКоррекции = Перечисления.ВидыЧековКоррекции.ИсправлениеОшибки,
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОперацииЧека.ДокументСсылка, ИмяРеквизита),
				Неопределено),
			ПараметрыОперацииЧека.ВидЧекаКоррекции,
			ПараметрыОперацииЧека.ДанныеКоррекции);
		#КонецУдаления
		#Вставка
		ФормированиеПараметровФискальногоЧекаСервер.ПараметрыФискальногоЧекаЗаполнитьПараметрыКоррекции(
		ПараметрыОперацииФискализацииЧека,
		?(ПараметрыОперацииЧека.ВидЧекаКоррекции = Перечисления.ВидыЧековКоррекции.ИсправлениеОшибки, ПараметрыОперацииЧека.ДокументСсылка, Неопределено),
		ПараметрыОперацииЧека.ВидЧекаКоррекции,
		ПараметрыОперацииЧека.ДанныеКоррекции); 		
		#КонецВставки	
	Иначе
		
		ФормированиеПараметровФискальногоЧекаСервер.ПараметрыФискальногоЧекаУдалитьПараметрыКоррекции(ПараметрыОперацииФискализацииЧека);
		
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("СтавкиНДСПоОбъектуРасчетовПоДокументуОплаты")
Функция Док_СтавкиНДСПоОбъектуРасчетовПоДокументуОплаты(ДокументОплаты, ОбъектРасчета, СистемаНалогообложения, ИмяКомандыПробитияЧека) Экспорт
	
	СтавкиНДСПоОбъектуРасчетов = Новый ТаблицаЗначений();
	СтавкиНДСПоОбъектуРасчетов.Колонки.Добавить("СтавкаНДС");
	СтавкиНДСПоОбъектуРасчетов.Колонки.Добавить("СуммаНДС");
	СтавкиНДСПоОбъектуРасчетов.Колонки.Добавить("Сумма");
	
	Если СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход
		ИЛИ СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
		
		СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
	Иначе                  
		#Удаление
		СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"));
		#КонецУдаления
		#Вставка     
		СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22"));
		#КонецВставки
	КонецЕсли;
	
	ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ДокументОплаты)
		ИЛИ НЕ ДокументОплатыСВозможностьюПробитияЧеков(ДокументОплаты)
		ИЛИ ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
		СтавкаНДСПоОбъектуРасчетов = СтавкиНДСПоОбъектуРасчетов.Добавить();
		СтавкаНДСПоОбъектуРасчетов.СтавкаНДС = СтавкаНДС;
		Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
			СтавкаНДСПоОбъектуРасчетов.Сумма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "СуммаРегл");
		Иначе
			СтавкаНДСПоОбъектуРасчетов.Сумма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "СуммаДокумента");
		КонецЕсли;
		
		Возврат СтавкиНДСПоОбъектуРасчетов;
	КонецЕсли;
	
	Если ЕстьТаблицаОбъекта("РасшифровкаПлатежа", ДокументОплаты.Метаданные()) Тогда
		ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа = ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа(ДокументОплаты);
	Иначе
		МодульЛокализации = ОбщегоНазначенияУТ.ПолучитьМодульЛокализации(ДокументОплаты.Метаданные().Имя);
		ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа = МодульЛокализации.ДанныеПоОбъектамРасчетовПоДокументу(
			ДокументОплаты,
			ИмяКомандыПробитияЧека);
	КонецЕсли;
	
	Если ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа <> Неопределено Тогда
		
		Для Каждого ДанныеПоОбъектуРасчетов Из ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа Цикл
			
			Если ДанныеПоОбъектуРасчетов.Заказ = ОбъектРасчета
				ИЛИ ТипЗнч(ДанныеПоОбъектуРасчетов.Заказ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				
				СтавкаНДСПоОбъектуРасчетов = СтавкиНДСПоОбъектуРасчетов.Добавить();
				
				Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДанныеПоОбъектуРасчетов, "СтавкаНДС")
					И ЗначениеЗаполнено(ДанныеПоОбъектуРасчетов.СтавкаНДС) Тогда
					
					СтавкаНДСПоОбъектуРасчетов.СтавкаНДС = ДанныеПоОбъектуРасчетов.СтавкаНДС;
				Иначе
					СтавкаНДСПоОбъектуРасчетов.СтавкаНДС = СтавкаНДС;
				КонецЕсли;
				
				Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДанныеПоОбъектуРасчетов, "СуммаНДС")
					И ЗначениеЗаполнено(ДанныеПоОбъектуРасчетов.СуммаНДС) Тогда
					
					СтавкаНДСПоОбъектуРасчетов.СуммаНДС = ДанныеПоОбъектуРасчетов.СуммаНДС;
				Иначе
					СтавкаНДСПоОбъектуРасчетов.СуммаНДС = 0;
				КонецЕсли;
				
				СтавкаНДСПоОбъектуРасчетов.Сумма = ДанныеПоОбъектуРасчетов.Сумма;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		СтавкаНДСПоОбъектуРасчетов = СтавкиНДСПоОбъектуРасчетов.Добавить();
		СтавкаНДСПоОбъектуРасчетов.СтавкаНДС = СтавкаНДС;
		СтавкаНДСПоОбъектуРасчетов.СуммаНДС = 0;
		
		Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
			СтавкаНДСПоОбъектуРасчетов.Сумма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "СуммаРегл");
		Иначе
			СтавкаНДСПоОбъектуРасчетов.Сумма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "СуммаДокумента");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтавкиНДСПоОбъектуРасчетов.Количество() > 0 Тогда
		СтавкиНДСПоОбъектуРасчетов.Свернуть("СтавкаНДС", "СуммаНДС, Сумма");
	Иначе
		
		Для Каждого ДанныеПоОбъектуРасчетов Из ДанныеПоОбъектамРасчетовИзРасшифровкиПлатежа Цикл
			
			Если ДокументОплатыСВозможностьюПробитияЧеков(ДанныеПоОбъектуРасчетов.Заказ) Тогда
				СтавкаНДСПоОбъектуРасчетов = СтавкиНДСПоОбъектуРасчетов.Добавить();
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПоОбъектуРасчетов, "СтавкаНДС") Тогда
					СтавкаНДСПоОбъектуРасчетов.СтавкаНДС = ДанныеПоОбъектуРасчетов.СтавкаНДС;
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПоОбъектуРасчетов, "СуммаНДС") Тогда
					СтавкаНДСПоОбъектуРасчетов.СуммаНДС = ДанныеПоОбъектуРасчетов.СуммаНДС;
				КонецЕсли;
				СтавкаНДСПоОбъектуРасчетов.Сумма = ДанныеПоОбъектуРасчетов.Сумма;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтавкиНДСПоОбъектуРасчетов;
	
КонецФункции
