////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		
		Элементы.Список.РежимВыбора = Истина;
		
		РежимВыбораИнформацииОВидеВремени = Параметры.РежимВыбораИнформацииОВидеВремени;
		
		Если РежимВыбораИнформацииОВидеВремени Тогда
			РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если РежимВыбораИнформацииОВидеВремени Тогда
		СтандартнаяОбработка = Ложь;
	
		ДанныеТекущейСтроки = Элементы.Список.ТекущиеДанные;
		
		ДанныеВыбора = Новый Структура("ВидВремени, БуквенноеОбозначение, Наименование, Целосменное"); 
		
		ДанныеВыбора.ВидВремени = ВыбраннаяСтрока;
		
		Если ДанныеТекущейСтроки <> Неопределено Тогда
			ДанныеВыбора.БуквенноеОбозначение = ДанныеТекущейСтроки.БуквенныйКод;
			ДанныеВыбора.Наименование = ДанныеТекущейСтроки.Наименование;
			ДанныеВыбора.Целосменное = ДанныеТекущейСтроки.Целосменное;
		КонецЕсли;
		
	 	ОповеститьОВыборе(ДанныеВыбора);	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчаниюНаСервере()
Справочники.ВидыИспользованияРабочегоВремени.СоздатьВидыИспользованияРабочегоВремениПоНастройкам();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЗначениямиПоУмолчанию(Команда)
	ЗаполнитьЗначениямиПоУмолчаниюНаСервере();
КонецПроцедуры

