Функция ЗапуститьФоновоеВыполнение(ТекстПроцедуры,СтруктураПараметров=Неопределено) Экспорт
    УникальныйИдентификатор = Новый УникальныйИдентификатор;
    ПараметрыВыполнения = Новый Массив;
    ПараметрыВыполнения.Добавить(ТекстПроцедуры);
    ПараметрыВыполнения.Добавить(СтруктураПараметров);
    
    ФоновыеЗадания.Выполнить("ОбменУТМПСервер.ФоноваяПроцедураОбменСМП",ПараметрыВыполнения,УникальныйИдентификатор);
    Возврат УникальныйИдентификатор;
КонецФункции

Процедура ФоноваяПроцедураОбменСМП(ТекстМодуля,ПараметрыВыполнения) Экспорт  

	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ТипОбмена = ПараметрыВыполнения.ТипОбмена;
		
		Если ТипОбмена = "ОбменДокументами" Тогда	
			Журнал = ПараметрыВыполнения.Журнал;
			Секция = ПараметрыВыполнения.Секция;
			Накладная = ПараметрыВыполнения.Накладная;
			ДатаВХ = ПараметрыВыполнения.ДатаВХ;
			НомерВХ = ПараметрыВыполнения.НомерВХ;
			
			Запрос = Новый Запрос;
			Запрос.Текст =  
			"ВЫБРАТЬ
			|	СостоянияДокументовОбменМП.Склад КАК Склад,
			|	СостоянияДокументовОбменМП.РабочийУчасток КАК РабочийУчасток,
			|	СостоянияДокументовОбменМП.ДокументНакладная КАК ДокументНакладная,
			|	СостоянияДокументовОбменМП.ДокументОрдер КАК ДокументОрдер,
			|	СостоянияДокументовОбменМП.Состояние КАК Состояние,
			|	СостоянияДокументовОбменМП.Обработано КАК Обработано,
			|	СостоянияДокументовОбменМП.ЯПХ КАК ЯПХ,
			|	СостоянияДокументовОбменМП.Сотрудник КАК Сотрудник,
			|	СостоянияДокументовОбменМП.ИДклиента КАК ИДклиента
			|ИЗ
			|	РегистрСведений.СостоянияДокументовОбменМП КАК СостоянияДокументовОбменМП
			|ГДЕ
			|	СостоянияДокументовОбменМП.ДокументНакладная = &ДокументНакладная
			|	И СостоянияДокументовОбменМП.РабочийУчасток = &РабочийУчасток
			|   И НЕ СостоянияДокументовОбменМП.Обработано";
			
			Запрос.УстановитьПараметр("ДокументНакладная", Накладная);
			Запрос.УстановитьПараметр("РабочийУчасток", Секция);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ПопыткаЗаписи = 0;
			
			Для ПопыткаЗаписи = 0 По 4 Цикл
				ВыборкаДетальныеЗаписи.Следующий();
				
				ПопыткаЗаписи = ПопыткаЗаписи + 1;
				Ордер = ВыборкаДетальныеЗаписи.ДокументОрдер;
				
				ИмяТЧ = ?(Журнал = "Отгрузка","ОтгружаемыеТовары","Товары");
				
				Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.СостоянияДокументовТСД.ВРаботе Тогда
					
					Статус = ?(Журнал = "Отгрузка",Перечисления.СтатусыРасходныхОрдеров.КОтбору,Перечисления.СтатусыПриходныхОрдеров.ВРаботе);
					
					Попытка
						НачатьТранзакцию();
						
						ОрдерОбъект = Ордер.ПолучитьОбъект();
						ОрдерОбъект.Заблокировать();
						ОрдерОбъект.ПометкаУдаления = Ложь;
						ОрдерОбъект.Статус = Статус;  
						
						ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
						Для Каждого Строка Из ОрдерОбъект[ИмяТЧ] Цикл
							
							Строка.КоличествоУпаковок = 0;
							Строка.Количество = 0;
							
						КонецЦикла;
						
						Если Журнал = "Отгрузка" Тогда
							ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОрдерОбъект, Истина);
						Иначе 
							ОрдерОбъект.Комментарий = ПараметрыВыполнения.Комментарий;
							ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОрдерОбъект,,,РежимЗаписиДокумента.Проведение);
						КонецЕсли;
						
						Если ПараметрыВыполнения.Отмена Тогда
							
							УдалитьСвязанныеЗаписиОбменМП(Ордер);
							
						Иначе
							
							ЗафиксироватьСтатусВыполненияОперацииВРегистре(ВыборкаДетальныеЗаписи);
							
						КонецЕсли;
						
						ЗафиксироватьТранзакцию();
						
						Прервать;
						
					Исключение  
						
						ОтменитьТранзакцию();  
						ЗаписьЖурналаРегистрации("ФоновоеОбменМП.СозданиеОрдера", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
						
					КонецПопытки;
				Иначе
					
					Если Журнал = "Отгрузка" Тогда
						
						Статус = ?((ВыборкаДетальныеЗаписи.Состояние
						= Перечисления.СостоянияДокументовТСД.Преднаборка),
						Перечисления.СтатусыРасходныхОрдеров.КОтгрузке,
						Перечисления.СтатусыРасходныхОрдеров.Отгружен);
						
					Иначе
						
						Статус = ?((ВыборкаДетальныеЗаписи.Состояние
						= Перечисления.СостоянияДокументовТСД.Преднаборка),
						Перечисления.СтатусыПриходныхОрдеров.ТребуетсяОбработка,
						Перечисления.СтатусыПриходныхОрдеров.Принят);
						
					КонецЕсли;
					
					Попытка
						НачатьТранзакцию();
						ОрдерОбъект = Ордер.ПолучитьОбъект();
						ОрдерОбъект.Заблокировать();
						
						ОрдерОбъект.Статус = Статус;
						
						
						Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЯчейкаПромежуточногоХранения",
							ОрдерОбъект.Метаданные()) И ОрдерОбъект.Статус
							= Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Тогда
							ОрдерОбъект.ЯчейкаПромежуточногоХранения = ВыборкаДетальныеЗаписи.ЯПХ;
						КонецЕсли;
						
						ИзменитьДанныеСтроки(ОрдерОбъект, ИмяТЧ);
						
						Если Журнал = "Отгрузка" Тогда
							
							МассивСтрок = ОрдерОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("КоличествоУпаковок",
							0));
							
							
							Для Каждого Строка Из МассивСтрок Цикл
								ОрдерОбъект.ОтгружаемыеТовары.Удалить(Строка);
							КонецЦикла;
							
							Документы.РасходныйОрдерНаТовары.ИзменитьТоварыПоРаспоряжениямПоОтгружаемымТоварам(
							ОрдерОбъект);
							Если ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен
								Или ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Тогда
								Документы.РасходныйОрдерНаТовары.ЗаполнитьДействиеВСтроках(ОрдерОбъект);
								Если ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
									ОрдерОбъект.Дата = ТекущаяДата();
									ОрдерОбъект.ДатаОтгрузки = ТекущаяДата();
								КонецЕсли;
							КонецЕсли; 
							
						КонецЕсли;
						
						Если Журнал = "Приемка" Тогда
							Если ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда	
								МассивСтрок = ОрдерОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("КоличествоУпаковок",
								0));
								
								Для Каждого Строка Из МассивСтрок Цикл
									ОрдерОбъект.Товары.Удалить(Строка);
								КонецЦикла;
							КонецЕсли;
							ОрдерОбъект.Комментарий = ПараметрыВыполнения.Комментарий;
						КонецЕсли;
						
						Если Журнал = "Пересчет" Тогда
							ОрдерОбъект.ВремяОкончания = ТекущаяДата();
							ОрдерОбъект.Просчитано = Истина;
							ОрдерОбъект.ПодтвержденСкладом = Истина;
						КонецЕсли;
						
						ОрдерОбъект.ПометкаУдаления = Ложь;
						ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
						ЗафиксироватьСтатусВыполненияОперацииВРегистре(ВыборкаДетальныеЗаписи);
						
						ЗафиксироватьТранзакцию(); 
						
						Прервать;   
						
					Исключение
						
						ОтменитьТранзакцию();  
						ЗаписьЖурналаРегистрации("ФоновоеОбменМП.ИзменениеОрдера", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
						
					КонецПопытки; 
					
				КонецЕсли;
			КонецЦикла; 
			
		Иначе
			
			ОрдерОбъект = ПараметрыВыполнения.Документ.ПолучитьОбъект();
			
			Если ИзменитьДанныеСтроки(ОрдерОбъект, ПараметрыВыполнения.ИмяТЧ) Тогда
				
				//ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОрдерОбъект, Истина);
				Если ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОрдерОбъект,,,РежимЗаписиДокумента.Проведение);
				Иначе
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОрдерОбъект, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ФоновоеОбменМП", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки()); 
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры          

Функция СоздатьРасходныйОрдерПоНакладной(СтруктураДокумента) Экспорт
	
	РасходныйОрдер = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(РасходныйОрдер,СтруктураДокумента,"Склад,РабочийУчасток,Сотрудник");
	РасходныйОрдер.Накладная = СтруктураДокумента.Документ; 
	ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	РасходныйОрдер.Дата = ТекущаяДата(); 
	РасходныйОрдер.ДатаОтгрузки = ТекущаяДата();
	РасходныйОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору;
	РасходныйОрдер.Ответственный = ТекущийПользователь;
	РасходныйОрдер.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(РасходныйОрдер.Приоритет);
	РасходныйОрдер.Получатель = Документы.РасходныйОрдерНаТовары.ПолучательДляЗаполнения(РасходныйОрдер.Накладная); 
	РасходныйОрдер.Контролер = ТекущийПользователь;
	РасходныйОрдер.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
	РасходныйОрдер.СкладскаяОперация = ПолучитьСкладскуюОперацию(РасходныйОрдер.Накладная);
	
	ТЧТовары = Документы.РасходныйОрдерНаТовары.ПолучитьТоварыДляЗаполнения(РасходныйОрдер.Накладная,РасходныйОрдер.РабочийУчасток,РасходныйОрдер.Склад);
	РасходныйОрдер.ТоварыПоРаспоряжениям.Загрузить(ТЧТовары);				
	РасходныйОрдер.ОтгружаемыеТовары.Загрузить(ТЧТовары); 
	РасходныйОрдер.ОтгружаемыеТовары.Свернуть("Действие,Номенклатура,Характеристика,Назначение,Серия,Упаковка","Количество,КоличествоУпаковок");
		
	//Попытка
		РасходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);    
	//Исключение 
	//	ОписаниеОшибки();
	//КонецПопытки   
	
	Возврат РасходныйОрдер.Ссылка;	
	
КонецФункции

Функция СоздатьПриходныйОрдерПоНакладной(СтруктураДокумента) Экспорт
	
	ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ПриходныйОрдер,СтруктураДокумента,"Склад,РабочийУчасток,Сотрудник,НомерВходящегоДокумента,ДатаВходящегоДокумента");
	ПриходныйОрдер.Распоряжение = СтруктураДокумента.Документ; 
	ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	ПриходныйОрдер.Дата = ТекущаяДата();
	ПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.ВРаботе;
	ПриходныйОрдер.Ответственный = ТекущийПользователь;
	ПриходныйОрдер.Отправитель = ОтправительДляЗаполнения(ПриходныйОрдер.Распоряжение); 
	ПриходныйОрдер.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению;
	ПриходныйОрдер.ХозяйственнаяОперация = СтруктураДокумента.ХозяйственнаяОперация;
	ПриходныйОрдер.ЗаполнитьТоварыПоТоварамКПоступлению("НоменклатураКоличество",ТекущаяДата());
	
	//Попытка
		ПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);    
	//Исключение 
	//	ОписаниеОшибки();
	//КонецПопытки   
	
	Возврат ПриходныйОрдер.Ссылка;	
	
КонецФункции

Функция ИзменитьДанныеСтроки(ОрдерОбъект, ИмяТЧ)

    ДанныеИзменены = Ложь;
    
	КоличествоЗаполнено = ЗаполнитьКоличествоВОрдере(ОрдерОбъект, ИмяТЧ);
	МаркировкаЗаполнена = ЗаполнитьМаркировкуВОрдере(ОрдерОбъект);

    ДанныеИзменены = КоличествоЗаполнено ИЛИ МаркировкаЗаполнена;
    
    Возврат ДанныеИзменены;
    
КонецФункции

Функция ЗаполнитьКоличествоВОрдере(ОрдерОбъект, ИмяТЧ)
	
	КоличествоЗаполнено = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СостоянияТоваровОбменМП.ДокументОрдер,
	|	СостоянияТоваровОбменМП.Номенклатура,
	|	СостоянияТоваровОбменМП.Назначение,
	|	СостоянияТоваровОбменМП.Характеристика,
	|	СостоянияТоваровОбменМП.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.СостоянияТоваровОбменМП КАК СостоянияТоваровОбменМП
	|ГДЕ
	|	НЕ СостоянияТоваровОбменМП.Обработано
	|	И СостоянияТоваровОбменМП.ДокументОрдер = &ДокументОрдер";
	
	Запрос.УстановитьПараметр("ДокументОрдер", ОрдерОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Количество = 0;
		Количество = ВыборкаДетальныеЗаписи.Количество;

		МассивСтрок = ОрдерОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Назначение",ВыборкаДетальныеЗаписи.Номенклатура,ВыборкаДетальныеЗаписи.Характеристика,ВыборкаДетальныеЗаписи.Назначение));
		
		Если МассивСтрок.Количество() > 0 Тогда
			Для Каждого Строка Из МассивСтрок Цикл
				Строка.КоличествоУпаковок = Количество;
				Строка.Количество = Количество;
			КонецЦикла;
		Иначе 
			НоваяСтрока = ОрдерОбъект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			//НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
			НоваяСтрока.КоличествоУпаковок = Количество;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.СостоянияТоваровОбменМП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Обработано = Истина;

		МенеджерЗаписи.Записать();
		
		КоличествоЗаполнено = Истина;
		
     КонецЦикла;

     Возврат КоличествоЗаполнено;
     
КонецФункции

Функция ЗаполнитьМаркировкуВОрдере(ОрдерОбъект) Экспорт
		
	МаркировкаЗаполнена = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостояниеМаркировкиОбменМП.ДокументОрдер КАК ДокументОрдер,
	|	СостояниеМаркировкиОбменМП.ШтрихкодМаркировки КАК ШтрихкодМаркировки,
	|	СостояниеМаркировкиОбменМП.Действие КАК Действие
	|ИЗ
	|	РегистрСведений.СостояниеМаркировкиОбменМП КАК СостояниеМаркировкиОбменМП
	|ГДЕ
	|	НЕ СостояниеМаркировкиОбменМП.Обработано
	|	И СостояниеМаркировкиОбменМП.ДокументОрдер = &ДокументОрдер";

	Запрос.УстановитьПараметр("ДокументОрдер", ОрдерОбъект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		МассивСтрок = ОрдерОбъект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ВыборкаДетальныеЗаписи.ШтрихкодМаркировки));
		
		Если ВыборкаДетальныеЗаписи.Действие = Перечисления.ТипыЗаданий.Удаление Тогда
            Для Каждого Строка Из МассивСтрок Цикл
				ОрдерОбъект.ШтрихкодыУпаковок.Удалить(Строка);
			КонецЦикла;
		Иначе
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока = ОрдерОбъект.ШтрихкодыУпаковок.Добавить();
				НоваяСтрока.ШтрихкодУпаковки = ВыборкаДетальныеЗаписи.ШтрихкодМаркировки;
			КонецЕсли;
		КонецЕсли;

		//МассивСтрок = ОрдерОбъект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки",
		//	ВыборкаДетальныеЗаписи.ШтрихкодМаркировки));

		//Если МассивСтрок.Количество() = 0 Тогда
		//	НоваяСтрока = ОрдерОбъект.ШтрихкодыУпаковок.Добавить();
		//	НоваяСтрока.ШтрихкодУпаковки = ВыборкаДетальныеЗаписи.ШтрихкодМаркировки;
		//КонецЕсли;

		МенеджерЗаписи = РегистрыСведений.СостояниеМаркировкиОбменМП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Обработано = Истина;

		МенеджерЗаписи.Записать();

		МаркировкаЗаполнена = Истина;
	КонецЦикла;

	Возврат МаркировкаЗаполнена;

КонецФункции

Функция ПолучитьРасходныйОрдер(Склад,Секция,Накладная) 
	
	Ордер = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Проведен
		|	И РасходныйОрдерНаТовары.РабочийУчасток = &РабочийУчасток
		|	И РасходныйОрдерНаТовары.Накладная = &Накладная
		|	И РасходныйОрдерНаТовары.Склад = &Склад
		|	И НЕ РасходныйОрдерНаТовары.Статус = &СтатусРО";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СтатусРО", Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ордер = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
    Возврат Ордер; 
	
КонецФункции

Функция ПолучитьПриходныйОрдер(Склад,Секция,Накладная) 
	
	Ордер = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ  
		|	ПриходныйОрдерНаТовары.Проведен
		|	И ПриходныйОрдерНаТовары.РабочийУчасток = &РабочийУчасток
		|	И ПриходныйОрдерНаТовары.Распоряжение = &Накладная
		|	И ПриходныйОрдерНаТовары.Статус = &СтатусПО
		|	И ПриходныйОрдерНаТовары.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СтатусПО", Перечисления.СтатусыПриходныхОрдеров.Принят);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ордер = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
    Возврат Ордер; 
	
КонецФункции

Функция ПолучитьСкладскуюОперацию(Накладная) Экспорт 
	
	СкладскаяОперация = Перечисления.СкладскиеОперации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СкладыСервер.ТекстЗапросаСкладскаяОперацияТипДокумента()+ " 
	|ВЫБРАТЬ
	|	СкладскаяОперацияТипДокумента.СкладскаяОперация КАК СкладскаяОперация
	|ИЗ
	|	СкладскаяОперацияТипДокумента КАК СкладскаяОперацияТипДокумента
	|ГДЕ
	|	СкладскаяОперацияТипДокумента.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип",ТипЗнч(Накладная));
	
	Результат = Запрос.Выполнить().Выбрать();  
	Результат.Следующий();
	
	СкладскаяОперация = Результат.СкладскаяОперация;
	
	Возврат  СкладскаяОперация;
	
КонецФункции 

Функция ОтправительДляЗаполнения(Накладная)    

	Возврат ?(ТипЗнч(Накладная) = Тип("ДокументСсылка.ПеремещениеТоваров"), Накладная.СкладОтправитель, Накладная.Партнер);
	
КонецФункции

Процедура УдалитьСвязанныеЗаписиОбменМП(Документ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СостоянияДокументовОбменМП = РегистрыСведений.СостоянияДокументовОбменМП;
	НаборЗапись = СостоянияДокументовОбменМП.СоздатьНаборЗаписей();
			 
	НаборЗапись.Отбор.ДокументОрдер.Установить(Документ);
	НаборЗапись.Записать();
	
	СостоянияТоваровОбменМП = РегистрыСведений.СостоянияТоваровОбменМП;
	НаборЗапись = СостоянияТоваровОбменМП.СоздатьНаборЗаписей();
			 
	НаборЗапись.Отбор.ДокументОрдер.Установить(Документ);
	НаборЗапись.Записать();

	УстановитьПривилегированныйРежим(Ложь);  

КонецПроцедуры

Процедура ЗафиксироватьСтатусВыполненияОперацииВРегистре(ВыборкаДетальныеЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.СостоянияДокументовОбменМП.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
	МенеджерЗаписи.Обработано = Истина;
	
	МенеджерЗаписи.Записать();  
	
КонецПроцедуры

Функция ОрдерЗаполнялсяВМП(Ордер, Накладная) Экспорт
	УстановитьПривилегированныйРежим(Истина);	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияДокументовОбменМП.ДокументНакладная КАК ДокументНакладная,
	|	СостоянияДокументовОбменМП.ДокументОрдер КАК ДокументОрдер
	|ИЗ
	|	РегистрСведений.СостоянияДокументовОбменМП КАК СостоянияДокументовОбменМП
	|ГДЕ
	|	СостоянияДокументовОбменМП.ДокументНакладная = &ДокументНакладная
	|	И СостоянияДокументовОбменМП.ДокументОрдер = &ДокументОрдер";
	
	Запрос.УстановитьПараметр("ДокументНакладная", Накладная);
	Запрос.УстановитьПараметр("ДокументОрдер", Ордер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции 

Функция ПолучитьТоварыИзРегистра(Ордер, Обработанные = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СостоянияТоваровОбменМП.ДокументОрдер,
	|	СостоянияТоваровОбменМП.Номенклатура,
	|	СостоянияТоваровОбменМП.Назначение,
	|	СостоянияТоваровОбменМП.Характеристика,
	|	СостоянияТоваровОбменМП.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.СостоянияТоваровОбменМП КАК СостоянияТоваровОбменМП
	|ГДЕ
	|	СостоянияТоваровОбменМП.ДокументОрдер = &ДокументОрдер
	|	И СостоянияТоваровОбменМП.Обработано = &Обработано";
	
	Запрос.УстановитьПараметр("ДокументОрдер", Ордер);
	Запрос.УстановитьПараметр("Обработано", Обработанные);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	Возврат ТЗ;
		
КонецФункции 

Функция ЗаполнитьОрдер(ОрдерОбъект, ИмяТЧ, Отработаные) Экспорт
    УстановитьПривилегированныйРежим(Истина);
	КоличествоЗаполнено = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СостоянияТоваровОбменМП.ДокументОрдер,
	|	СостоянияТоваровОбменМП.Номенклатура,
	|	СостоянияТоваровОбменМП.Назначение,
	|	СостоянияТоваровОбменМП.Характеристика,
	|	СостоянияТоваровОбменМП.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.СостоянияТоваровОбменМП КАК СостоянияТоваровОбменМП
	|ГДЕ
	|	СостоянияТоваровОбменМП.ДокументОрдер = &ДокументОрдер
	|	И СостоянияТоваровОбменМП.Обработано = &Обработано";
	
	Запрос.УстановитьПараметр("ДокументОрдер", ОрдерОбъект.Ссылка);
	Запрос.УстановитьПараметр("Обработано", Отработаные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Количество = 0;
		Количество = ВыборкаДетальныеЗаписи.Количество;

		МассивСтрок = ОрдерОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Назначение",ВыборкаДетальныеЗаписи.Номенклатура,ВыборкаДетальныеЗаписи.Характеристика,ВыборкаДетальныеЗаписи.Назначение));
		
		Если МассивСтрок.Количество() > 0 Тогда
			Для Каждого Строка Из МассивСтрок Цикл
				Строка.КоличествоУпаковок = Количество;
				Строка.Количество = Количество;
			КонецЦикла;
		Иначе 
			НоваяСтрока = ОрдерОбъект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			Если ИмяТЧ = "ОтгружаемыеТовары" Тогда
				НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
			КонецЕсли;
			НоваяСтрока.КоличествоУпаковок = Количество;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.СостоянияТоваровОбменМП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Обработано = Истина;

		МенеджерЗаписи.Записать();
		
		КоличествоЗаполнено = Истина;
		
     КонецЦикла;

     Возврат КоличествоЗаполнено;
     УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

