&ИзменениеИКонтроль ("ПараметрыДоставки")  
Функция Док_ПараметрыДоставки() Экспорт	
	ПараметрыДоставки = РассылкаОтчетовКлиентСервер.ПараметрыДоставки();
	ПараметрыДоставки.ДатаВыполнения = ТекущаяДатаСеанса();
	ПараметрыДоставки.Автор = Пользователи.ТекущийПользователь();
	ПараметрыДоставки.КаталогВременныхФайлов = ФайловаяСистема.ОбщийКаталогВременныхФайлов("RP" + НомерСеансаИнформационнойБазы()) + ПолучитьРазделительПутиСервера();
	ПараметрыДоставки.ПараметрыПисьма.Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
	
	Если ПолучитьФункциональнуюОпцию("ХранитьИсториюРассылкиОтчетов") Тогда
		ПараметрыДоставки.ПараметрыПисьма.УведомитьОДоставке = Истина;
		#Вставка
		ПараметрыДоставки.ПараметрыПисьма.УведомитьОПрочтении = Истина; 
		#КонецВставки
	КонецЕсли;
#Вставка
	ПараметрыДоставки.Вставить("ФорматДаты", "");  	
#КонецВставки
	Возврат ПараметрыДоставки;
	
КонецФункции	

&ИзменениеИКонтроль ("ВыполнитьРассылкуОтчетов") 
Функция Док_ВыполнитьРассылкуОтчетов(Рассылка, ПараметрыЖурнала = Неопределено, ДополнительныеНастройки = Неопределено) Экспорт

	ПараметрыЖурналаПоУмолчанию = ПараметрыЖурнала(Рассылка);
	Если ПараметрыЖурнала <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЖурналаПоУмолчанию, ПараметрыЖурнала);
	КонецЕсли;
	ПараметрыЖурнала = ПараметрыЖурналаПоУмолчанию;
	
	// Проверка прав доступа
	Если Не ПравоВывода(ПараметрыЖурнала) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РассылкаОбъект = Рассылка.ПолучитьОбъект();
	
	// Проверка базовых реквизитов рассылки.
	Если Не РассылкаОбъект.Подготовлена
		Или РассылкаОбъект.ПометкаУдаления Тогда
		
		Причина = "";
		Если Не РассылкаОбъект.Подготовлена Тогда
			Причина = Причина + Символы.ПС + НСтр("ru = 'Рассылка не подготовлена'");
		КонецЕсли;
		Если РассылкаОбъект.ПометкаУдаления Тогда
			Причина = Причина + Символы.ПС + НСтр("ru = 'Рассылка помечена на удаление'");
		КонецЕсли;
		
		ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурналаРегистрации.Предупреждение,
			НСтр("ru = 'Завершение'"), СокрЛП(Причина));
		Возврат Ложь;
		
	КонецЕсли;
	
	ЗапускЗафиксирован = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, "ЗапускЗафиксирован");
	Если ЗапускЗафиксирован <> Истина Тогда
		// Регистрация запуска (запущена, но не выполнена).
		РегистрыСведений.СостоянияРассылокОтчетов.ЗафиксироватьЗапускРассылки(Рассылка);
		ЗапускЗафиксирован = Истина;
	КонецЕсли;
	
	// Форматы по умолчанию
	ФорматыПоУмолчанию = Новый Массив;
	Найденные = РассылкаОбъект.ФорматыОтчетов.НайтиСтроки(Новый Структура("Отчет", ПустоеЗначениеОтчета()));
	Для Каждого СтрокаФормат Из Найденные Цикл
		ФорматыПоУмолчанию.Добавить(СтрокаФормат.Формат);
	КонецЦикла;
	Если ФорматыПоУмолчанию.Количество() = 0 Тогда
		СписокФорматов = СписокФорматов();
		Для Каждого ЗначениеСписка Из СписокФорматов Цикл
			Если ЗначениеСписка.Пометка Тогда
				ФорматыПоУмолчанию.Добавить(ЗначениеСписка.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ФорматыПоУмолчанию.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не установлены форматы по умолчанию.'");
	КонецЕсли;
	
	// Заполнение таблицы отчетов
	ТаблицаОтчетов = ОтчетыДляРассылки();
	Для Каждого СтрокаОтчет Из РассылкаОбъект.Отчеты Цикл
		Стр = ТаблицаОтчетов.Добавить();
		Стр.Отчет = СтрокаОтчет.Отчет;
		Стр.ОтправлятьЕслиПустой = СтрокаОтчет.ОтправлятьЕслиПустой;
		Стр.ШаблонНаименования = СтрокаОтчет.ШаблонНаименования;
		
		// Настройки
		Настройки = СтрокаОтчет.Настройки.Получить();
		#Вставка
		Если СтрокаОтчет.ПредыдущийГод тогда 
			Для каждого Элемент Из Настройки.Элементы Цикл
				Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
					Если ТипЗнч(Элемент.Значение) = Тип("СтандартныйПериод") Тогда
						Элемент.Значение.ДатаНачала = ДобавитьМесяц(Элемент.Значение.ДатаНачала, -12);
						Элемент.Значение.ДатаОкончания = ДобавитьМесяц(Элемент.Значение.ДатаОкончания, -12);						
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		#КонецВставки
		Если ТипЗнч(Настройки) = Тип("ТаблицаЗначений") Тогда
			Стр.Настройки = Новый Структура;
			Найденные = Настройки.НайтиСтроки(Новый Структура("Использование", Истина));
			Для Каждого СтрокаНастройка Из Найденные Цикл
				Стр.Настройки.Вставить(СтрокаНастройка.Реквизит, СтрокаНастройка.Значение);
			КонецЦикла;
		Иначе
			Стр.Настройки = Настройки;
		КонецЕсли;
		
		// Форматы
		Найденные = РассылкаОбъект.ФорматыОтчетов.НайтиСтроки(Новый Структура("Отчет", СтрокаОтчет.Отчет));
		Если Найденные.Количество() = 0 Тогда
			Стр.Форматы = ФорматыПоУмолчанию;
		Иначе
			Для Каждого СтрокаФормат Из Найденные Цикл
				Стр.Форматы.Добавить(СтрокаФормат.Формат);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Подготовка параметров доставки.
	ПараметрыДоставки = ПараметрыДоставки();
	ПараметрыДоставки.ИспользоватьПапку = РассылкаОбъект.ИспользоватьПапку;
	ПараметрыДоставки.ИспользоватьСетевойКаталог = РассылкаОбъект.ИспользоватьСетевойКаталог;
	ПараметрыДоставки.ИспользоватьFTPРесурс = РассылкаОбъект.ИспользоватьFTPРесурс;
	ПараметрыДоставки.ИспользоватьЭлектроннуюПочту = РассылкаОбъект.ИспользоватьЭлектроннуюПочту;
	ПараметрыДоставки.ТранслитерироватьИменаФайлов = РассылкаОбъект.ТранслитерироватьИменаФайлов;
	ПараметрыДоставки.Личная = РассылкаОбъект.Личная;
	
	ТаблицаТиповПолучателей = РассылкаОтчетовПовтИсп.ТаблицаТиповПолучателей();
	Найденные = ТаблицаТиповПолучателей.НайтиСтроки(Новый Структура("ИдентификаторОбъектаМетаданных", РассылкаОбъект.ТипПолучателейРассылки));
	Если Найденные.Количество() = 1 Тогда
		ПараметрыДоставки.ТипПолучателейРассылки = Найденные[0].ТипПолучателей;
	КонецЕсли;
	
	// Проверки отмеченных способов доставки.
	Если Не ПараметрыДоставки.ИспользоватьПапку
		И Не ПараметрыДоставки.ИспользоватьСетевойКаталог
		И Не ПараметрыДоставки.ИспользоватьFTPРесурс
		И Не ПараметрыДоставки.ИспользоватьЭлектроннуюПочту Тогда
		ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурналаРегистрации.Предупреждение, НСтр("ru = 'Не выбран способ доставки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыДоставки.Персонализирована = РассылкаОбъект.Персонализирована;
	ПараметрыДоставки.Архивировать = РассылкаОбъект.Архивировать;
	ПараметрыДоставки.ИмяАрхива = РассылкаОбъект.ИмяАрхива;
	
	// Подготовка параметров доставки в папку.
	Если ПараметрыДоставки.ИспользоватьПапку Тогда
		ПараметрыДоставки.Папка = РассылкаОбъект.Папка;
	КонецЕсли;
	
	// Подготовка параметров доставки в сетевой каталог.
	Если ПараметрыДоставки.ИспользоватьСетевойКаталог Тогда
		ПараметрыДоставки.СетевойКаталогWindows = РассылкаОбъект.СетевойКаталогWindows;
		ПараметрыДоставки.СетевойКаталогLinux = РассылкаОбъект.СетевойКаталогLinux;
	КонецЕсли;
	
	// Подготовка параметров доставки на FTP ресурс.
	Если ПараметрыДоставки.ИспользоватьFTPРесурс Тогда
		ПараметрыДоставки.Сервер = РассылкаОбъект.FTPСервер;
		ПараметрыДоставки.Порт = РассылкаОбъект.FTPПорт;
		ПараметрыДоставки.Логин = РассылкаОбъект.FTPЛогин;
		
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыДоставки.Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Рассылка, "FTPПароль");
		УстановитьПривилегированныйРежим(Ложь);
		
		ПараметрыДоставки.Каталог = РассылкаОбъект.FTPКаталог;
		ПараметрыДоставки.ПассивноеСоединение = РассылкаОбъект.FTPПассивноеСоединение;
	КонецЕсли;
	
	ПараметрыДоставки.ВставлятьОтчетыВТекстПисьма = РассылкаОбъект.ВставлятьОтчетыВТекстПисьма;
	ПараметрыДоставки.ПрикреплятьОтчетыВоВложения = РассылкаОбъект.ПрикреплятьОтчетыВоВложения;
	ПараметрыДоставки.УстановитьПаролиЗашифровать = РассылкаОбъект.УстановитьПаролиЗашифровать;
	#Вставка
	ПараметрыДоставки.ФорматДаты = Рассылка.ФорматДаты;
	#КонецВставки
	
	// Подготовка параметров доставки по электронной почте.
	Если ПараметрыДоставки.ИспользоватьЭлектроннуюПочту Тогда
		ПараметрыДоставки.УчетнаяЗапись = РассылкаОбъект.УчетнаяЗапись;
		ПараметрыДоставки.ТолькоУведомить = РассылкаОбъект.ТолькоУведомить;
		ПараметрыДоставки.СкрытыеКопии = РассылкаОбъект.СкрытыеКопии;
		ПараметрыДоставки.ШаблонТемы = РассылкаОбъект.ТемаПисьма;
		ПараметрыДоставки.ШаблонТекста = ?(РассылкаОбъект.ПисьмоВФорматеHTML,
			РассылкаОбъект.ТекстПисьмаВФорматеHTML, РассылкаОбъект.ТекстПисьма);
		
		ПолучателиРассылкиВыбраны = ПолучателиРассылкиВыбраны(
			Рассылка, ПараметрыДоставки, ПараметрыЖурнала, ДополнительныеНастройки);
		
		Если Не ПолучателиРассылкиВыбраны Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		ПараметрыДоставки.ПараметрыПисьма.ТипТекста = ?(РассылкаОбъект.ПисьмоВФорматеHTML, "HTML", "ПростойТекст");
		ПараметрыДоставки.ПараметрыПисьма.АдресОтвета = РассылкаОбъект.АдресОтвета;
		ПараметрыДоставки.ПараметрыПисьма.Важность = ?(ЗначениеЗаполнено(РассылкаОбъект.ВажностьПисьма),
			РаботаСПочтовымиСообщениямиСлужебный.ВажностьИнтернетПочтовогоСообщенияИзСтроки(РассылкаОбъект.ВажностьПисьма),
			ВажностьИнтернетПочтовогоСообщения.Обычная);
		
		Если РассылкаОбъект.ПисьмоВФорматеHTML Тогда
			КартинкиПисьмаВФорматеHTML = РассылкаОбъект.КартинкиПисьмаВФорматеHTML.Получить();
			Если КартинкиПисьмаВФорматеHTML <> Неопределено Тогда
				ПараметрыДоставки.Картинки = КартинкиПисьмаВФорматеHTML;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗапускЗафиксирован Тогда
		РегистрыСведений.СостоянияРассылокОтчетов.ЗафиксироватьЗапускРассылки(Рассылка);
		ЗапускЗафиксирован = Истина;
	КонецЕсли;
	
	ПараметрыДоставки.ЗапускЗафиксирован = ЗапускЗафиксирован;
	
	ПараметрыДоставки.АдресРезультата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, "АдресРезультата");
	
	Результат = ВыполнитьРассылку(ТаблицаОтчетов, ПараметрыДоставки, Рассылка, ПараметрыЖурнала);
	РегистрыСведений.СостоянияРассылокОтчетов.ЗафиксироватьРезультатВыполненияРассылки(Рассылка, ПараметрыДоставки);
	
	Возврат Результат;
	
КонецФункции

&ИзменениеИКонтроль ("ПолноеИмяФайлаПоШаблону") 
Функция Док_ПолноеИмяФайлаПоШаблону(Каталог, НаименованиеОтчета, Формат, ПараметрыДоставки, ШаблонНаименования, Период)  	
	ПараметрыИмениФайла = Новый Структура("НаименованиеОтчета, ФорматОтчета, ДатаРассылки, РасширениеФайла");
	ПараметрыИмениФайла.НаименованиеОтчета = НаименованиеОтчета;
	ПараметрыИмениФайла.ФорматОтчета = Формат.Имя;
	ПараметрыИмениФайла.РасширениеФайла = ?(Формат.Расширение = Неопределено, "", Формат.Расширение);
	Если ЗначениеЗаполнено(ШаблонНаименования) Тогда 
		#Вставка	
		Если Не значениезаполнено(ПараметрыДоставки.ФорматДаты) Тогда
			ПараметрыИмениФайла.ДатаРассылки = Формат(ТекущаяДатаСеанса(), НСтр("ru = 'ДФ=yyyy-MM-dd'"));			
		Иначе
			ПараметрыИмениФайла.ДатаРассылки = Формат(ТекущаяДатаСеанса(), НСтр("ru = 'ДФ="+СОКРЛП(ПараметрыДоставки.ФорматДаты)+"'"));		
		КонецЕсли; 
		#КонецВставки
		ШаблонИмениФайла = ШаблонНаименования + "[РасширениеФайла]"; 
		#Удаление
		ПараметрыИмениФайла.ДатаРассылки = ТекущаяДатаСеанса(); 
		#КонецУдаления
		Если Период <> Неопределено Тогда
			ПараметрыИмениФайла.Вставить("Период", Период);
		КонецЕсли;
		ИмяФайла = ЗаполнитьШаблон(ШаблонИмениФайла, ПараметрыИмениФайла);  	
	
	Иначе
		ШаблонИмениФайла = "[НаименованиеОтчета] ([ФорматОтчета])[РасширениеФайла]"; // АПК:1297 Это шаблон.
		ИмяФайла = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонИмениФайла, ПараметрыИмениФайла);
	КонецЕсли;
	
	Возврат Каталог + ПривестиИмяФайла(ИмяФайла, ПараметрыДоставки.ТранслитерироватьИменаФайлов);
	
КонецФункции

