
// Процедура выполняет заполнение или очистку аналитики доходов при изменении статьи доходов.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - данные документа.
//	СтатьяДоходов - ПланВидовХарактеристикСсылка.СтатьиДоходов - указанная в документе статья доходов.
//	Подразделение - Справочник.СтруктураПредприятия - указанное в документе подразделение.
//	АналитикаДоходов - Характеристика.СтатьиДоходов - аналитика статьи доходов.
//
Процедура СтатьяДоходовПриИзменении(Объект, СтатьяДоходов, Подразделение, АналитикаДоходов) Экспорт
	
	Если ЗначениеЗаполнено(АналитикаДоходов) Тогда
		Если ЗначениеЗаполнено(СтатьяДоходов) Тогда
			ОписаниеТипов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяДоходов, "ТипЗначения");
			ОчиститьАналитику = НЕ ОписаниеТипов.СодержитТип(ТипЗнч(АналитикаДоходов)); 
		Иначе
			ОчиститьАналитику = Истина;
		КонецЕсли;
		Если ОчиститьАналитику Тогда
			АналитикаДоходов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АналитикаДоходов) Тогда
		АналитикаДоходов = ПланыВидовХарактеристик.СтатьиДоходов.ПолучитьАналитикуДоходовПоУмолчанию(
			СтатьяДоходов,
			Объект,
			Подразделение);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет заполнение или очистку аналитики расходов при изменении статьи расходов.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Данные документа
//	СтатьяРасходов - ПланВидовХарактеристикСсылка.СтатьиРасходов - Указанная в документе статья расходов
//	АналитикаРасходов - Характеристика.СтатьиРасходов - Аналитика статьи расходов.
//
Процедура СтатьяРасходовПриИзменении(Объект, СтатьяРасходов, АналитикаРасходов) Экспорт
	
	Если СтатьяРасходов.ЭтоГруппа Тогда
		СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АналитикаРасходов) Тогда
		Если ЗначениеЗаполнено(СтатьяРасходов) Тогда
			ОписаниеТипов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяРасходов, "ТипЗначения");
			ОчиститьАналитику = НЕ ОписаниеТипов.СодержитТип(ТипЗнч(АналитикаРасходов)); 
		Иначе
			ОчиститьАналитику = Истина;
		КонецЕсли;
		Если ОчиститьАналитику Тогда
			АналитикаРасходов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АналитикаРасходов) Тогда
		АналитикаРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПолучитьАналитикуРасходовПоУмолчанию(
			СтатьяРасходов,
			Объект);
	Иначе
		ОчиститьАналитикуПрочихРасходов(СтатьяРасходов, АналитикаРасходов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьАналитикуПрочихРасходов(СтатьяРасходов, АналитикаРасходов) Экспорт
	
	Если ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.ПрочиеРасходы") Тогда
	
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ИСТИНА КАК ОчиститьАналитику
		|ИЗ
		|	Справочник.ПрочиеРасходы КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Ссылка = &АналитикаРасходов
		|	И ДанныеСправочника.Владелец <> &СтатьяРасходов
		|");
		Запрос.УстановитьПараметр("СтатьяРасходов", СтатьяРасходов);
		Запрос.УстановитьПараметр("АналитикаРасходов", АналитикаРасходов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ОчиститьАналитику Тогда
				АналитикаРасходов = Справочники.ПрочиеРасходы.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
