
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Очередь.Очистить();
	Текст = "";
	ПолучитьДанныеОчередиНаСервере();
КонецПроцедуры
			
&НаКлиенте
Процедура ОбновитьДанныеОчереди(Команда) 
	Очередь.Очистить();
	Текст = "";
	ПолучитьДанныеОчередиНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеОчередиНаСервере()
	Пользователь = Пользователи.ТекущийПользователь();
	Настройки = ТелефонияСервер.НастройкиАстериск();

	РезультатАвторизации = ТелефонияСервер.Авторизация(Настройки);	
	
	Если РезультатАвторизации.КодСостояния = 200 Тогда
		Cookie = РезультатАвторизации.Заголовки.Получить("Set-Cookie");
	Иначе
		Возврат;
	КонецЕсли;  	      
	
	ТекстКоманды = "/asterisk/rawman?action=QueueStatus&Queue=queue_overall";    
		
	РезультатЗапроса = ТелефонияСервер.ВыполнитьЗапрос(Настройки,ТекстКоманды,Cookie);	
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
	Текст = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ОбработатьТекстЗапроса(Текст);
	Иначе  
		Попытка
			ЗаписьЖурналаРегистрации("Получение очереди колл-центра",УровеньЖурналаРегистрации.Ошибка,,,"" + Пользователь + "  " + РезультатЗапроса.ПолучитьТелоКакСтроку(),); 
		Исключение 
			ЗаписьЖурналаРегистрации("Получение очереди колл-центра",УровеньЖурналаРегистрации.Ошибка,,,"" + Пользователь + "Ошибка при получении тела Результата запроса" ,); 
		Конецпопытки;
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере  
Процедура ОбработатьТекстЗапроса(Текст) 

	НачНомер   = "Name: SIP/";
	КонНомер   = "Location:"; 
	
	НачСтатус  = "Status:"; 
	КонСтатус  = "Paused:"; 
	
	НачПозиция = 1; 
	Пока НачПозиция <> 0 Цикл 
		
		НачПозиция = СтрНайти(Текст,НачНомер,,НачПозиция) + СтрДлина(НачНомер);
		
		Если НачПозиция - СтрДлина(НачНомер) = 0 Тогда
			Возврат;
		КонецЕсли;
		
		КонПозиция = СтрНайти(Текст,КонНомер,,НачПозиция);
		Телефон = СокрЛП(Сред(Текст,НачПозиция,КонПозиция - НачПозиция));
		
		Если Телефон <> "" Тогда 
			НС = Очередь.Добавить();
			НС.Телефон = Телефон;  
			НачПозиция = СтрНайти(Текст,НачСтатус,,НачПозиция) + СтрДлина(НачСтатус);
			КонПозиция = СтрНайти(Текст,КонСтатус,,НачПозиция);
			Статус = СокрЛП(Сред(Текст,НачПозиция,КонПозиция - НачПозиция)); 
			НС.Сотрудник = ТелефонияСервер.ПолучитьСотрудникаПоВнутреннемуНомеру(Телефон);
			Если Статус = "0" Тогда 
				Статус = "Неизвестен";
			ИначеЕсли Статус = "1" Тогда
				Статус = "Свободен";
			ИначеЕсли Статус = "2" Тогда
				Статус = "Занят";  //Используется
			ИначеЕсли Статус = "3" Тогда
				Статус = "Занят (call-limit задан)";   
			ИначеЕсли Статус = "4" Тогда
				Статус = "Не существует"; 
			ИначеЕсли Статус = "5" Тогда
				Статус = "Не зарегистрирован"; 
			ИначеЕсли Статус = "6" Тогда
				Статус = "В процессе звонка";
			ИначеЕсли Статус = "7" Тогда
				Статус = "Занят и в процессе звонка"; 
			ИначеЕсли Статус = "8" Тогда
				Статус = "На паузе";
			ИначеЕсли Статус = "20" Тогда
				Статус = "Абонент недоступен";
			КонецЕсли;
			НС.Статус = Статус;	
		КонецЕсли;
		
	КонецЦикла;	
	
	
	КонецПроцедуры                         
