
&ИзменениеИКонтроль("ИзменитьНомерПлатежногоПоручения")
Процедура Док_ИзменитьНомерПлатежногоПоручения(Объект)
  	
	ПоследниеТриСимвола = Прав(СокрЛП(Объект.Номер), 3);
	ЭтоПлатежныйДокументКВыгрузке = (ТипЗнч(Объект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств")
	И Объект.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение)
	ИЛИ (ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств")
	И Объект.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование);

	Если ПоследниеТриСимвола = "000"
		И ЭтоПлатежныйДокументКВыгрузке
		И Не (ЗначениеЗаполнено(Объект.НомерВходящегоДокумента)
		ИЛИ ЗначениеЗаполнено(Объект.ДатаВходящегоДокумента)) Тогда

		ПозицияДефис = Найти(Объект.Номер, "-");
		ОсновнойПрефикс = Лев(Объект.Номер, ПозицияДефис);
		ПользовательскийПрефикс = ПрефиксацияОбъектовКлиентСервер.ПользовательскийПрефикс(Объект.Номер);
		Префикс = ОсновнойПрефикс + ПользовательскийПрефикс;

		ДлинаНомера = СтрДлина(СокрЛП(Объект.Номер)) - СтрДлина(Префикс);
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер, Истина, Истина); 
		#Вставка
		НомерДокумента = СокрЛП(НомерДокумента);
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерДокумента);
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НомерДокумента);  
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(НомерДокумента, Истина,Истина);
		#КонецВставки
		НомерДокумента = ?(НомерДокумента = "", 0, Число(НомерДокумента));
		НомерДокумента = Формат(НомерДокумента + 1, "ЧГ=0");

		Пока СтрДлина(НомерДокумента) < ДлинаНомера Цикл
			НомерДокумента = "0" + НомерДокумента;
		КонецЦикла;

		Объект.Номер = Префикс + НомерДокумента;

	КонецЕсли;

КонецПроцедуры
    
