#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		СформироватьПечатнуюФорму(Ссылка, ТабДок, ПараметрыПечати);
	КонецЦикла;
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПечатнаяФорма", НСтр("ru = 'ТабельУчетаРабочегоВремени'"), ТабДок);
КонецПроцедуры

Процедура СформироватьПечатнуюФорму(Ссылка, ТабДок, ПараметрыПечати)
	
	ПечататьПлан = ПараметрыПечати.ТипДанных = "План";
	ДополнениеСтроки = ?(ПечататьПлан, "План", "");
	
	Макет = ПолучитьМакет("ПечатнаяФорма");
	Если ПечататьПлан Тогда
		Макет.УдалитьОбласть(Макет.Область("КТУ"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		Макет.УдалитьОбласть(Макет.Область("ИтогоВПраздники"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		Макет.Область("День").ШиринаКолонки = 3; 
	КонецЕсли;
	
	КолДнейВМес = День(КонецМесяца(Ссылка.ПериодРегистрации));
	ГраницаДляОстальных = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	ГраницаДляПоследней = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	
	ОбластьЗаголовокОсн = Макет.ПолучитьОбласть("Заголовок|Осн");
	ОбластьЗаголовокДень = Макет.ПолучитьОбласть("Заголовок|День");
	
	ОбластьШапкаОсн = Макет.ПолучитьОбласть("Шапка|Осн");
	ОбластьШапкаДень = Макет.ПолучитьОбласть("Шапка|День");
	
	ОбластьСтрокаОсн = Макет.ПолучитьОбласть("Строка|Осн");
	ОбластьСтрокаДень = Макет.ПолучитьОбласть("Строка|День");
	
	ОбластьЛинияОсн = Макет.ПолучитьОбласть("Линия|Осн");
	ОбластьЛинияДень = Макет.ПолучитьОбласть("Линия|День");
	
	ОбластьПодвалОсн = Макет.ПолучитьОбласть("Подвал|Осн");
	ОбластьПодвалДень = Макет.ПолучитьОбласть("Подвал|День");
	
	//ОбластьОтдел = Макет.ПолучитьОбласть(?(ПечататьПлан, "Отдел|Осн", "Отдел"));
	ОбластьОтдел = Макет.ПолучитьОбласть("Отдел|Осн");
	ОбластьОтделДень = Макет.ПолучитьОбласть("Отдел|День");
	ОбластьОтделИтого = Макет.ПолучитьОбласть("ОтделИтого");
	
	//Заголовок
	ОбластьЗаголовокОсн.Параметры.Номер = Ссылка.Номер;
	ОбластьЗаголовокОсн.Параметры.Дата = Формат(Ссылка.Дата, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовокОсн.Параметры.ПериодРегистрации = Формат(Ссылка.ПериодРегистрации, "ДФ='ММММ гггг'");
	Для Каждого СтрОтдел Из Ссылка.Отделы Цикл
		Если ЗначениеЗаполнено(ОбластьЗаголовокОсн.Параметры.Отдел) Тогда
			ОбластьЗаголовокОсн.Параметры.Отдел = ОбластьЗаголовокОсн.Параметры.Отдел + ", " + Строка(СтрОтдел.Отдел);
		Иначе                                                  
			ОбластьЗаголовокОсн.Параметры.Отдел = Строка(СтрОтдел.Отдел);
		КонецЕсли;
	КонецЦикла;
	ОбластьЗаголовокОсн.Параметры.ГрафикРаботы = Ссылка.ГрафикРаботы;
	Если ПечататьПлан Тогда
		ОбластьЗаголовокОсн.Параметры.ПланФакт = "Плановые показатели учета времени";
	Иначе
		ОбластьЗаголовокОсн.Параметры.ПланФакт = "Фактические данные по учету времени";
	КонецЕсли;
	ТабДок.Вывести(ОбластьЗаголовокОсн);
	
	Для НомерДня = 1 По КолДнейВМес Цикл
		ТабДок.Присоединить(ОбластьЗаголовокДень);
	КонецЦикла;	
	
	//Шапка
	ТабДок.Вывести(ОбластьШапкаОсн);
	Для НомерДня = 1 По КолДнейВМес Цикл
		ОбластьШапкаДень.Параметры.День = НомерДня;
		Если НомерДня = КолДнейВМес Тогда
			ОбластьШапкаДень.ТекущаяОбласть.ГраницаСправа = ГраницаДляПоследней;
		Иначе
			ОбластьШапкаДень.ТекущаяОбласть.ГраницаСправа = ГраницаДляОстальных;
		КонецЕсли;
		ТабДок.Присоединить(ОбластьШапкаДень);
	КонецЦикла;
	
	//Строки
	
	Результат = ПолучитьДанныеЗапроса(Ссылка);
	
	ВыборкаОтдел = Результат[1].Выбрать();
	Выборка = Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Результат = ПолучитьДанныеЗапроса(Ссылка);
	//
	//ВыборкаОтдел = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	//НомерСтроки = 1;
	
	//ДополнениеСтроки = ?(ПечататьПлан, " / количество сотрудников в день:", "");
	
	Пока ВыборкаОтдел.Следующий() Цикл
		
		ИтогоЧасовПоОтделу = 0;
		ИтогоЧасовПоОтделуПлан = 0;
		ИтогоЧасовЗаОтчетныйПериод = 0;
		ИтогоЧасовВПримечании = 0;
		ОбластьОтдел.Параметры.Отдел = ВыборкаОтдел.ОтделИмя + ?(ПечататьПлан, " / количество сотрудников в день:", "");
		Если ПечататьПлан Тогда
			ОбластьОтдел.ТекущаяОбласть.ГраницаСправа = ГраницаДляПоследней;
		КонецЕсли;
		ТабДок.Вывести(ОбластьОтдел);
		
		Если ПечататьПлан Тогда
			ОбластьОтделДень.ТекущаяОбласть.ГраницаСправа = ГраницаДляОстальных;
			Для НомерДня = 1 По КолДнейВМес Цикл
				ОбластьОтделДень.Параметры.СотрудниковВДень = ВыборкаОтдел["СотрудниковВДень" + НомерДня];
				
				//Если НомерДня = 1 Тогда
				//	ОбластьОтделДень.ТекущаяОбласть.ГраницаСправа = ГраницаДляПоследней;
				//Иначе
					//ОбластьОтделДень.ТекущаяОбласть.ГраницаСправа = ГраницаДляОстальных;
				//КонецЕсли;
				ТабДок.Присоединить(ОбластьОтделДень);
			КонецЦикла;
		КонецЕсли;
			
		Выборка.Сбросить();
		
		Пока Выборка.НайтиСледующий(Новый Структура("Отдел", ВыборкаОтдел.Отдел)) Цикл
			
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаОсн.Параметры, ВыборкаДетальныеЗаписи);
				
				ОбластьСтрокаОсн.Параметры.ИтогоЧасов = ВыборкаДетальныеЗаписи["ИтогоЧасов" + ДополнениеСтроки];
				ОбластьСтрокаОсн.Параметры.ИтогоДней = ВыборкаДетальныеЗаписи["ИтогоДней" + ДополнениеСтроки];
				
				//ОбластьСтрокаОсн.Параметры.Ном = НомерСтроки;
				//ОбластьСтрокаОсн.Параметры.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				//ОбластьСтрокаОсн.Параметры.Уволен = ВыборкаДетальныеЗаписи.Уволен;
				//ОбластьСтрокаОсн.Параметры.ТабНомер = ВыборкаДетальныеЗаписи.ТабНомер;
				//ОбластьСтрокаОсн.Параметры.Должность = ВыборкаДетальныеЗаписи.Должность;
				//ОбластьСтрокаОсн.Параметры.ИтогоЧасов = ВыборкаДетальныеЗаписи["ИтогоЧасов" + ДополнениеСтроки];
				//ОбластьСтрокаОсн.Параметры.ИтогоДней = ВыборкаДетальныеЗаписи["ИтогоДней" + ДополнениеСтроки];
				//ОбластьСтрокаОсн.Параметры.ИтогоЧасовОтпуск = ВыборкаДетальныеЗаписи.ИтогоЧасовОтпуск; 
				//ОбластьСтрокаОсн.Параметры.ИтогоВПраздники = ВыборкаДетальныеЗаписи.ИтогоВПраздники;
				//ОбластьСтрокаОсн.Параметры.ИтогоДней = ВыборкаДетальныеЗаписи.ИтогоДней;
				//ОбластьСтрокаОсн.Параметры.ИтогоДнейОтпуск = ВыборкаДетальныеЗаписи.ИтогоДнейОтпуск;
				//ОбластьСтрокаОсн.Параметры.ИтогоКТУ = ВыборкаДетальныеЗаписи.ИтогоКТУ;
				
				ТабДок.Вывести(ОбластьСтрокаОсн);
				
				Для НомерДня = 1 По КолДнейВМес Цикл
					
					ОбластьСтрокаДень.Параметры.Представление = ВыборкаДетальныеЗаписи["Представление" + ДополнениеСтроки + НомерДня];
					ДанныеПримечание = ВыборкаДетальныеЗаписи["Примечание" + НомерДня];
					ДанныеСмена = Формат(ВыборкаДетальныеЗаписи["НачалоСменыПлан" + НомерДня], "ДФ=hh:mm");
					
					ОбластьСтрокаДень.Параметры.Примечание = ?(ПечататьПлан, ДанныеСмена, ДанныеПримечание);
					
					//Если НомерДня = КолДнейВМес Тогда
					//	ОбластьСтрокаДень.ТекущаяОбласть.ГраницаСправа = ГраницаДляПоследней;
					//Иначе
						ОбластьСтрокаДень.ТекущаяОбласть.ГраницаСправа = ГраницаДляОстальных;
					//КонецЕсли;
					ТабДок.Присоединить(ОбластьСтрокаДень);
				КонецЦикла;
				
				ИтогоЧасовЗаОтчетныйПериод = ИтогоЧасовЗаОтчетныйПериод + ВыборкаДетальныеЗаписи.ИтогоЧасов;
				ИтогоЧасовВПримечании = ИтогоЧасовВПримечании + ВыборкаДетальныеЗаписи.ИтогоЧасовОтпуск;
				//НомерСтроки = НомерСтроки+1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Не ПечататьПлан Тогда
			ОбластьОтделИтого.Параметры.ИтогоЧасовЗаОтчетныйПериод = ИтогоЧасовЗаОтчетныйПериод;
			ОбластьОтделИтого.Параметры.ИтогоЧасовВПримечании = ИтогоЧасовВПримечании;
			ОбластьОтделИтого.Параметры.ИтогоЧасовПоОтделу = ИтогоЧасовЗаОтчетныйПериод + ИтогоЧасовВПримечании;
			ТабДок.Вывести(ОбластьОтделИтого);
		КонецЕсли;

	КонецЦикла;
	
	//Линия
	ТабДок.Вывести(ОбластьЛинияОсн);
	
	Для НомерДня = 1 По КолДнейВМес Цикл
		ТабДок.Присоединить(ОбластьЛинияДень);
	КонецЦикла;
	
	//Подвал
	ОбластьПодвалОсн.Параметры.Комментарий = Ссылка.Комментарий;
	ОбластьПодвалОсн.Параметры.Автор = Ссылка.Автор;
	ТабДок.Вывести(ОбластьПодвалОсн);
	
	Для НомерДня = 1 По КолДнейВМес Цикл
		ТабДок.Присоединить(ОбластьПодвалДень);
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДок.АвтоМасштаб = Истина;
	
КонецПроцедуры

Функция ПолучитьДанныеЗапроса(СсылкаНаОбъект)
  	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	Отделы.Наименование КАК ОтделИмя,
	              |	Отделы.Ссылка КАК Отдел,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Ссылка КАК Ссылка,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НомерСтроки КАК Ном,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Сотрудник КАК Сотрудник,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан1 КАК ПредставлениеПлан1,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан2 КАК ПредставлениеПлан2,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан3 КАК ПредставлениеПлан3,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан4 КАК ПредставлениеПлан4,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан5 КАК ПредставлениеПлан5,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан6 КАК ПредставлениеПлан6,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан7 КАК ПредставлениеПлан7,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан8 КАК ПредставлениеПлан8,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан9 КАК ПредставлениеПлан9,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан10 КАК ПредставлениеПлан10,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан11 КАК ПредставлениеПлан11,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан12 КАК ПредставлениеПлан12,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан13 КАК ПредставлениеПлан13,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан14 КАК ПредставлениеПлан14,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан15 КАК ПредставлениеПлан15,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан16 КАК ПредставлениеПлан16,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан17 КАК ПредставлениеПлан17,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан18 КАК ПредставлениеПлан18,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан19 КАК ПредставлениеПлан19,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан20 КАК ПредставлениеПлан20,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан21 КАК ПредставлениеПлан21,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан22 КАК ПредставлениеПлан22,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан23 КАК ПредставлениеПлан23,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан24 КАК ПредставлениеПлан24,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан25 КАК ПредставлениеПлан25,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан26 КАК ПредставлениеПлан26,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан27 КАК ПредставлениеПлан27,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан28 КАК ПредставлениеПлан28,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан29 КАК ПредставлениеПлан29,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан30 КАК ПредставлениеПлан30,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ПредставлениеПлан31 КАК ПредставлениеПлан31,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление1 КАК Представление1,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление2 КАК Представление2,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление3 КАК Представление3,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление4 КАК Представление4,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление5 КАК Представление5,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление6 КАК Представление6,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление7 КАК Представление7,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление8 КАК Представление8,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление9 КАК Представление9,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление10 КАК Представление10,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление11 КАК Представление11,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление12 КАК Представление12,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление13 КАК Представление13,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление14 КАК Представление14,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление15 КАК Представление15,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление16 КАК Представление16,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление17 КАК Представление17,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление18 КАК Представление18,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление19 КАК Представление19,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление20 КАК Представление20,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление21 КАК Представление21,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление22 КАК Представление22,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление23 КАК Представление23,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление24 КАК Представление24,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление25 КАК Представление25,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление26 КАК Представление26,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление27 КАК Представление27,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление28 КАК Представление28,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление29 КАК Представление29,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление30 КАК Представление30,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Представление31 КАК Представление31,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание1 КАК Примечание1,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание2 КАК Примечание2,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание3 КАК Примечание3,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание4 КАК Примечание4,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание5 КАК Примечание5,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание6 КАК Примечание6,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание7 КАК Примечание7,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание8 КАК Примечание8,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание9 КАК Примечание9,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание10 КАК Примечание10,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание11 КАК Примечание11,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание12 КАК Примечание12,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание13 КАК Примечание13,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание14 КАК Примечание14,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание15 КАК Примечание15,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание16 КАК Примечание16,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание17 КАК Примечание17,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание18 КАК Примечание18,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание19 КАК Примечание19,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание20 КАК Примечание20,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание21 КАК Примечание21,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание22 КАК Примечание22,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание23 КАК Примечание23,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание24 КАК Примечание24,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание25 КАК Примечание25,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание26 КАК Примечание26,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание27 КАК Примечание27,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание28 КАК Примечание28,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание29 КАК Примечание29,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание30 КАК Примечание30,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Примечание31 КАК Примечание31,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан1 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень1,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан2 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень2,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан3 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень3,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан4 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень4,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан5 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень5,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан6 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень6,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан7 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень7,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан8 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень8,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан9 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень9,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан10 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень10,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан11 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень11,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан12 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень12,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан13 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень13,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан14 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень14,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан15 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень15,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан16 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень16,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан17 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень17,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан18 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень18,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан19 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень19,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан20 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень20,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан21 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень21,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан22 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень22,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан23 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень23,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан24 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень24,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан25 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень25,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан26 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень26,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан27 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень27,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан28 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень28,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан29 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень29,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан30 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень30,
	              |	ВЫБОР
	              |		КОГДА ТабельУчетаРабочегоВремениДанныеОВремени.ЧасовПлан31 > 0
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СотрудниковВДень31,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан1 КАК НачалоСменыПлан1,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан2 КАК НачалоСменыПлан2,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан3 КАК НачалоСменыПлан3,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан4 КАК НачалоСменыПлан4,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан5 КАК НачалоСменыПлан5,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан6 КАК НачалоСменыПлан6,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан7 КАК НачалоСменыПлан7,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан8 КАК НачалоСменыПлан8,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан9 КАК НачалоСменыПлан9,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан10 КАК НачалоСменыПлан10,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан11 КАК НачалоСменыПлан11,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан12 КАК НачалоСменыПлан12,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан13 КАК НачалоСменыПлан13,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан14 КАК НачалоСменыПлан14,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан15 КАК НачалоСменыПлан15,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан16 КАК НачалоСменыПлан16,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан17 КАК НачалоСменыПлан17,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан18 КАК НачалоСменыПлан18,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан19 КАК НачалоСменыПлан19,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан20 КАК НачалоСменыПлан20,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан21 КАК НачалоСменыПлан21,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан22 КАК НачалоСменыПлан22,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан23 КАК НачалоСменыПлан23,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан24 КАК НачалоСменыПлан24,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан25 КАК НачалоСменыПлан25,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан26 КАК НачалоСменыПлан26,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан27 КАК НачалоСменыПлан27,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан28 КАК НачалоСменыПлан28,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан29 КАК НачалоСменыПлан29,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан30 КАК НачалоСменыПлан30,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.НачалоСменыПлан31 КАК НачалоСменыПлан31,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ИтогоЧасовПлан КАК ИтогоЧасовПлан,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ИтогоЧасов КАК ИтогоЧасов,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ИтогоВПраздники КАК ИтогоВПраздники,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ИтогоЧасовОтпуск КАК ИтогоЧасовОтпуск,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ИтогоДнейПлан КАК ИтогоДнейПлан,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ИтогоДней КАК ИтогоДней,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ИтогоДнейОтпуск КАК ИтогоДнейОтпуск,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.ИтогоКТУ КАК ИтогоКТУ,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Сотрудник.Наименование КАК СотрудникИмя,
	              |	Должности.Наименование КАК ДолжностьИмя,
	              |	Должности.Ссылка КАК Должность,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Сотрудник.ТабельныйНомер КАК ТабНомер,
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Сотрудник.Уволен КАК Уволен
	              |ПОМЕСТИТЬ ВТ
	              |ИЗ
	              |	Документ.ТабельУчетаРабочегоВремени.ДанныеОВремени КАК ТабельУчетаРабочегоВремениДанныеОВремени
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Отделы КАК Отделы
	              |		ПО ТабельУчетаРабочегоВремениДанныеОВремени.Сотрудник.Отдел = Отделы.Ссылка
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	              |		ПО ТабельУчетаРабочегоВремениДанныеОВремени.Сотрудник.Должность = Должности.Ссылка
	              |ГДЕ
	              |	ТабельУчетаРабочегоВремениДанныеОВремени.Ссылка = &Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ.ОтделИмя КАК ОтделИмя,
	              |	ВТ.Отдел КАК Отдел,
	              |	СУММА(ВТ.СотрудниковВДень1) КАК СотрудниковВДень1,
	              |	СУММА(ВТ.СотрудниковВДень2) КАК СотрудниковВДень2,
	              |	СУММА(ВТ.СотрудниковВДень3) КАК СотрудниковВДень3,
	              |	СУММА(ВТ.СотрудниковВДень4) КАК СотрудниковВДень4,
	              |	СУММА(ВТ.СотрудниковВДень5) КАК СотрудниковВДень5,
	              |	СУММА(ВТ.СотрудниковВДень6) КАК СотрудниковВДень6,
	              |	СУММА(ВТ.СотрудниковВДень7) КАК СотрудниковВДень7,
	              |	СУММА(ВТ.СотрудниковВДень8) КАК СотрудниковВДень8,
	              |	СУММА(ВТ.СотрудниковВДень9) КАК СотрудниковВДень9,
	              |	СУММА(ВТ.СотрудниковВДень10) КАК СотрудниковВДень10,
	              |	СУММА(ВТ.СотрудниковВДень11) КАК СотрудниковВДень11,
	              |	СУММА(ВТ.СотрудниковВДень12) КАК СотрудниковВДень12,
	              |	СУММА(ВТ.СотрудниковВДень13) КАК СотрудниковВДень13,
	              |	СУММА(ВТ.СотрудниковВДень14) КАК СотрудниковВДень14,
	              |	СУММА(ВТ.СотрудниковВДень15) КАК СотрудниковВДень15,
	              |	СУММА(ВТ.СотрудниковВДень16) КАК СотрудниковВДень16,
	              |	СУММА(ВТ.СотрудниковВДень17) КАК СотрудниковВДень17,
	              |	СУММА(ВТ.СотрудниковВДень18) КАК СотрудниковВДень18,
	              |	СУММА(ВТ.СотрудниковВДень19) КАК СотрудниковВДень19,
	              |	СУММА(ВТ.СотрудниковВДень20) КАК СотрудниковВДень20,
	              |	СУММА(ВТ.СотрудниковВДень21) КАК СотрудниковВДень21,
	              |	СУММА(ВТ.СотрудниковВДень22) КАК СотрудниковВДень22,
	              |	СУММА(ВТ.СотрудниковВДень23) КАК СотрудниковВДень23,
	              |	СУММА(ВТ.СотрудниковВДень24) КАК СотрудниковВДень24,
	              |	СУММА(ВТ.СотрудниковВДень25) КАК СотрудниковВДень25,
	              |	СУММА(ВТ.СотрудниковВДень26) КАК СотрудниковВДень26,
	              |	СУММА(ВТ.СотрудниковВДень27) КАК СотрудниковВДень27,
	              |	СУММА(ВТ.СотрудниковВДень28) КАК СотрудниковВДень28,
	              |	СУММА(ВТ.СотрудниковВДень29) КАК СотрудниковВДень29,
	              |	СУММА(ВТ.СотрудниковВДень30) КАК СотрудниковВДень30,
	              |	СУММА(ВТ.СотрудниковВДень31) КАК СотрудниковВДень31
	              |ИЗ
	              |	ВТ КАК ВТ
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВТ.ОтделИмя,
	              |	ВТ.Отдел
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ.ОтделИмя КАК ОтделИмя,
	              |	ВТ.Отдел КАК Отдел,
	              |	ВТ.Ссылка КАК Ссылка,
	              |	ВТ.Ном КАК Ном,
	              |	ВТ.Сотрудник КАК Сотрудник,
	              |	ВТ.ПредставлениеПлан1 КАК ПредставлениеПлан1,
	              |	ВТ.ПредставлениеПлан2 КАК ПредставлениеПлан2,
	              |	ВТ.ПредставлениеПлан3 КАК ПредставлениеПлан3,
	              |	ВТ.ПредставлениеПлан4 КАК ПредставлениеПлан4,
	              |	ВТ.ПредставлениеПлан5 КАК ПредставлениеПлан5,
	              |	ВТ.ПредставлениеПлан6 КАК ПредставлениеПлан6,
	              |	ВТ.ПредставлениеПлан7 КАК ПредставлениеПлан7,
	              |	ВТ.ПредставлениеПлан8 КАК ПредставлениеПлан8,
	              |	ВТ.ПредставлениеПлан9 КАК ПредставлениеПлан9,
	              |	ВТ.ПредставлениеПлан10 КАК ПредставлениеПлан10,
	              |	ВТ.ПредставлениеПлан11 КАК ПредставлениеПлан11,
	              |	ВТ.ПредставлениеПлан12 КАК ПредставлениеПлан12,
	              |	ВТ.ПредставлениеПлан13 КАК ПредставлениеПлан13,
	              |	ВТ.ПредставлениеПлан14 КАК ПредставлениеПлан14,
	              |	ВТ.ПредставлениеПлан15 КАК ПредставлениеПлан15,
	              |	ВТ.ПредставлениеПлан16 КАК ПредставлениеПлан16,
	              |	ВТ.ПредставлениеПлан17 КАК ПредставлениеПлан17,
	              |	ВТ.ПредставлениеПлан18 КАК ПредставлениеПлан18,
	              |	ВТ.ПредставлениеПлан19 КАК ПредставлениеПлан19,
	              |	ВТ.ПредставлениеПлан20 КАК ПредставлениеПлан20,
	              |	ВТ.ПредставлениеПлан21 КАК ПредставлениеПлан21,
	              |	ВТ.ПредставлениеПлан22 КАК ПредставлениеПлан22,
	              |	ВТ.ПредставлениеПлан23 КАК ПредставлениеПлан23,
	              |	ВТ.ПредставлениеПлан24 КАК ПредставлениеПлан24,
	              |	ВТ.ПредставлениеПлан25 КАК ПредставлениеПлан25,
	              |	ВТ.ПредставлениеПлан26 КАК ПредставлениеПлан26,
	              |	ВТ.ПредставлениеПлан27 КАК ПредставлениеПлан27,
	              |	ВТ.ПредставлениеПлан28 КАК ПредставлениеПлан28,
	              |	ВТ.ПредставлениеПлан29 КАК ПредставлениеПлан29,
	              |	ВТ.ПредставлениеПлан30 КАК ПредставлениеПлан30,
	              |	ВТ.ПредставлениеПлан31 КАК ПредставлениеПлан31,
	              |	ВТ.Представление1 КАК Представление1,
	              |	ВТ.Представление2 КАК Представление2,
	              |	ВТ.Представление3 КАК Представление3,
	              |	ВТ.Представление4 КАК Представление4,
	              |	ВТ.Представление5 КАК Представление5,
	              |	ВТ.Представление6 КАК Представление6,
	              |	ВТ.Представление7 КАК Представление7,
	              |	ВТ.Представление8 КАК Представление8,
	              |	ВТ.Представление9 КАК Представление9,
	              |	ВТ.Представление10 КАК Представление10,
	              |	ВТ.Представление11 КАК Представление11,
	              |	ВТ.Представление12 КАК Представление12,
	              |	ВТ.Представление13 КАК Представление13,
	              |	ВТ.Представление14 КАК Представление14,
	              |	ВТ.Представление15 КАК Представление15,
	              |	ВТ.Представление16 КАК Представление16,
	              |	ВТ.Представление17 КАК Представление17,
	              |	ВТ.Представление18 КАК Представление18,
	              |	ВТ.Представление19 КАК Представление19,
	              |	ВТ.Представление20 КАК Представление20,
	              |	ВТ.Представление21 КАК Представление21,
	              |	ВТ.Представление22 КАК Представление22,
	              |	ВТ.Представление23 КАК Представление23,
	              |	ВТ.Представление24 КАК Представление24,
	              |	ВТ.Представление25 КАК Представление25,
	              |	ВТ.Представление26 КАК Представление26,
	              |	ВТ.Представление27 КАК Представление27,
	              |	ВТ.Представление28 КАК Представление28,
	              |	ВТ.Представление29 КАК Представление29,
	              |	ВТ.Представление30 КАК Представление30,
	              |	ВТ.Представление31 КАК Представление31,
	              |	ВТ.Примечание1 КАК Примечание1,
	              |	ВТ.Примечание2 КАК Примечание2,
	              |	ВТ.Примечание3 КАК Примечание3,
	              |	ВТ.Примечание4 КАК Примечание4,
	              |	ВТ.Примечание5 КАК Примечание5,
	              |	ВТ.Примечание6 КАК Примечание6,
	              |	ВТ.Примечание7 КАК Примечание7,
	              |	ВТ.Примечание8 КАК Примечание8,
	              |	ВТ.Примечание9 КАК Примечание9,
	              |	ВТ.Примечание10 КАК Примечание10,
	              |	ВТ.Примечание11 КАК Примечание11,
	              |	ВТ.Примечание12 КАК Примечание12,
	              |	ВТ.Примечание13 КАК Примечание13,
	              |	ВТ.Примечание14 КАК Примечание14,
	              |	ВТ.Примечание15 КАК Примечание15,
	              |	ВТ.Примечание16 КАК Примечание16,
	              |	ВТ.Примечание17 КАК Примечание17,
	              |	ВТ.Примечание18 КАК Примечание18,
	              |	ВТ.Примечание19 КАК Примечание19,
	              |	ВТ.Примечание20 КАК Примечание20,
	              |	ВТ.Примечание21 КАК Примечание21,
	              |	ВТ.Примечание22 КАК Примечание22,
	              |	ВТ.Примечание23 КАК Примечание23,
	              |	ВТ.Примечание24 КАК Примечание24,
	              |	ВТ.Примечание25 КАК Примечание25,
	              |	ВТ.Примечание26 КАК Примечание26,
	              |	ВТ.Примечание27 КАК Примечание27,
	              |	ВТ.Примечание28 КАК Примечание28,
	              |	ВТ.Примечание29 КАК Примечание29,
	              |	ВТ.Примечание30 КАК Примечание30,
	              |	ВТ.Примечание31 КАК Примечание31,
	              |	ВТ.НачалоСменыПлан1 КАК НачалоСменыПлан1,
	              |	ВТ.НачалоСменыПлан2 КАК НачалоСменыПлан2,
	              |	ВТ.НачалоСменыПлан3 КАК НачалоСменыПлан3,
	              |	ВТ.НачалоСменыПлан4 КАК НачалоСменыПлан4,
	              |	ВТ.НачалоСменыПлан5 КАК НачалоСменыПлан5,
	              |	ВТ.НачалоСменыПлан6 КАК НачалоСменыПлан6,
	              |	ВТ.НачалоСменыПлан7 КАК НачалоСменыПлан7,
	              |	ВТ.НачалоСменыПлан8 КАК НачалоСменыПлан8,
	              |	ВТ.НачалоСменыПлан9 КАК НачалоСменыПлан9,
	              |	ВТ.НачалоСменыПлан10 КАК НачалоСменыПлан10,
	              |	ВТ.НачалоСменыПлан11 КАК НачалоСменыПлан11,
	              |	ВТ.НачалоСменыПлан12 КАК НачалоСменыПлан12,
	              |	ВТ.НачалоСменыПлан13 КАК НачалоСменыПлан13,
	              |	ВТ.НачалоСменыПлан14 КАК НачалоСменыПлан14,
	              |	ВТ.НачалоСменыПлан15 КАК НачалоСменыПлан15,
	              |	ВТ.НачалоСменыПлан16 КАК НачалоСменыПлан16,
	              |	ВТ.НачалоСменыПлан17 КАК НачалоСменыПлан17,
	              |	ВТ.НачалоСменыПлан18 КАК НачалоСменыПлан18,
	              |	ВТ.НачалоСменыПлан19 КАК НачалоСменыПлан19,
	              |	ВТ.НачалоСменыПлан20 КАК НачалоСменыПлан20,
	              |	ВТ.НачалоСменыПлан21 КАК НачалоСменыПлан21,
	              |	ВТ.НачалоСменыПлан22 КАК НачалоСменыПлан22,
	              |	ВТ.НачалоСменыПлан23 КАК НачалоСменыПлан23,
	              |	ВТ.НачалоСменыПлан24 КАК НачалоСменыПлан24,
	              |	ВТ.НачалоСменыПлан25 КАК НачалоСменыПлан25,
	              |	ВТ.НачалоСменыПлан26 КАК НачалоСменыПлан26,
	              |	ВТ.НачалоСменыПлан27 КАК НачалоСменыПлан27,
	              |	ВТ.НачалоСменыПлан28 КАК НачалоСменыПлан28,
	              |	ВТ.НачалоСменыПлан29 КАК НачалоСменыПлан29,
	              |	ВТ.НачалоСменыПлан30 КАК НачалоСменыПлан30,
	              |	ВТ.НачалоСменыПлан31 КАК НачалоСменыПлан31,
	              |	ВТ.ИтогоЧасовПлан КАК ИтогоЧасовПлан,
	              |	ВТ.ИтогоЧасов КАК ИтогоЧасов,
	              |	ВТ.ИтогоВПраздники КАК ИтогоВПраздники,
	              |	ВТ.ИтогоЧасовОтпуск КАК ИтогоЧасовОтпуск,
	              |	ВТ.ИтогоДнейПлан КАК ИтогоДнейПлан,
	              |	ВТ.ИтогоДней КАК ИтогоДней,
	              |	ВТ.ИтогоДнейОтпуск КАК ИтогоДнейОтпуск,
	              |	ВТ.ИтогоКТУ КАК ИтогоКТУ,
	              |	ВТ.СотрудникИмя КАК СотрудникИмя,
	              |	ВТ.ДолжностьИмя КАК ДолжностьИмя,
	              |	ВТ.Должность КАК Должность,
	              |	ВТ.ТабНомер КАК ТабНомер,
	              |	ВТ.Уволен КАК Уволен
	              |ИЗ
	              |	ВТ КАК ВТ
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	ОтделИмя,
	              |	ДолжностьИмя,
	              |	СотрудникИмя
	              |ИТОГИ ПО
	              |	Отдел";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса;
 	
КонецФункции

#Область КонтрольИзмененийТЧПриНаличииСтатуса_УтвержденКАвансу

Процедура КонтрольИзмененийТЧПриНаличииСтатуса_УтвержденКАвансу(Отказ, Объект, ПередЗаписью_ПриЗаписи) Экспорт
	
	Если НЕ Отказ Тогда
		Если ПередЗаписью_ПриЗаписи И // ПередЗаписью 
			ЗначениеЗаполнено(Объект.Ссылка) И
			НЕ Объект.ПометкаУдаления И
			НЕ РольДоступна("ИзменениеУтвержденныхСтатусов") Тогда  
			
			КонтрольнаяСуммаТЧ = КонтрольнаяСуммаТЧ(Объект.Ссылка);
			Объект.ДополнительныеСвойства.Вставить("КонтрольнаяСуммаТЧ", КонтрольнаяСуммаТЧ.Хэш);
			Объект.ДополнительныеСвойства.Вставить("КоличествоСтрокТЧ", КонтрольнаяСуммаТЧ.КоличествоСтрокТЧ);
			
		ИначеЕсли НЕ ПередЗаписью_ПриЗаписи И // ПриЗаписи 
			Объект.ДополнительныеСвойства.Свойство("КонтрольнаяСуммаТЧ") И
			Объект.ДополнительныеСвойства.Свойство("КоличествоСтрокТЧ") И
			Объект.ДополнительныеСвойства.КонтрольнаяСуммаТЧ <> КонтрольнаяСуммаТЧ(Объект.Ссылка, Объект.ДополнительныеСвойства.КоличествоСтрокТЧ).Хэш Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя изменять ячейки до 15-го числа!",,,,Отказ);
	    КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция КонтрольнаяСуммаТЧ(Ссылка, КоличествоСтрокТЧ = Неопределено)
	Запрос = Новый Запрос( 
		"ВЫБРАТЬ
		|	Данные.Сотрудник КАК Сотрудник,
		|	Данные.НомерСтроки КАК НомерСтроки,
		|	Данные.Часов1 КАК Часов1,
		|	Данные.Часов2 КАК Часов2,
		|	Данные.Часов3 КАК Часов3,
		|	Данные.Часов4 КАК Часов4,
		|	Данные.Часов5 КАК Часов5,
		|	Данные.Часов6 КАК Часов6,
		|	Данные.Часов7 КАК Часов7,
		|	Данные.Часов8 КАК Часов8,
		|	Данные.Часов9 КАК Часов9,
		|	Данные.Часов10 КАК Часов10,
		|	Данные.Часов11 КАК Часов11,
		|	Данные.Часов12 КАК Часов12,
		|	Данные.Часов13 КАК Часов13,
		|	Данные.Часов14 КАК Часов14,
		|	Данные.Часов15 КАК Часов15,
		|	Данные.ВидВремени1 КАК ВидВремени1,
		|	Данные.ВидВремени2 КАК ВидВремени2,
		|	Данные.ВидВремени3 КАК ВидВремени3,
		|	Данные.ВидВремени4 КАК ВидВремени4,
		|	Данные.ВидВремени5 КАК ВидВремени5,
		|	Данные.ВидВремени6 КАК ВидВремени6,
		|	Данные.ВидВремени7 КАК ВидВремени7,
		|	Данные.ВидВремени8 КАК ВидВремени8,
		|	Данные.ВидВремени9 КАК ВидВремени9,
		|	Данные.ВидВремени10 КАК ВидВремени10,
		|	Данные.ВидВремени11 КАК ВидВремени11,
		|	Данные.ВидВремени12 КАК ВидВремени12,
		|	Данные.ВидВремени13 КАК ВидВремени13,
		|	Данные.ВидВремени14 КАК ВидВремени14,
		|	Данные.ВидВремени15 КАК ВидВремени15,
		|	Данные.Представление1 КАК Представление1,
		|	Данные.Представление2 КАК Представление2,
		|	Данные.Представление3 КАК Представление3,
		|	Данные.Представление4 КАК Представление4,
		|	Данные.Представление5 КАК Представление5,
		|	Данные.Представление6 КАК Представление6,
		|	Данные.Представление7 КАК Представление7,
		|	Данные.Представление8 КАК Представление8,
		|	Данные.Представление9 КАК Представление9,
		|	Данные.Представление10 КАК Представление10,
		|	Данные.Представление11 КАК Представление11,
		|	Данные.Представление12 КАК Представление12,
		|	Данные.Представление13 КАК Представление13,
		|	Данные.Представление14 КАК Представление14,
		|	Данные.Представление15 КАК Представление15,
		|	Данные.Примечание1 КАК Примечание1,
		|	Данные.Примечание2 КАК Примечание2,
		|	Данные.Примечание3 КАК Примечание3,
		|	Данные.Примечание4 КАК Примечание4,
		|	Данные.Примечание5 КАК Примечание5,
		|	Данные.Примечание6 КАК Примечание6,
		|	Данные.Примечание7 КАК Примечание7,
		|	Данные.Примечание8 КАК Примечание8,
		|	Данные.Примечание9 КАК Примечание9,
		|	Данные.Примечание10 КАК Примечание10,
		|	Данные.Примечание11 КАК Примечание11,
		|	Данные.Примечание12 КАК Примечание12,
		|	Данные.Примечание13 КАК Примечание13,
		|	Данные.Примечание14 КАК Примечание14,
		|	Данные.Примечание15 КАК Примечание15,
		|	Данные.ЧасовПлан1 КАК ЧасовПлан1,
		|	Данные.ЧасовПлан2 КАК ЧасовПлан2,
		|	Данные.ЧасовПлан3 КАК ЧасовПлан3,
		|	Данные.ЧасовПлан4 КАК ЧасовПлан4,
		|	Данные.ЧасовПлан5 КАК ЧасовПлан5,
		|	Данные.ЧасовПлан6 КАК ЧасовПлан6,
		|	Данные.ЧасовПлан7 КАК ЧасовПлан7,
		|	Данные.ЧасовПлан8 КАК ЧасовПлан8,
		|	Данные.ЧасовПлан9 КАК ЧасовПлан9,
		|	Данные.ЧасовПлан10 КАК ЧасовПлан10,
		|	Данные.ЧасовПлан11 КАК ЧасовПлан11,
		|	Данные.ЧасовПлан12 КАК ЧасовПлан12,
		|	Данные.ЧасовПлан13 КАК ЧасовПлан13,
		|	Данные.ЧасовПлан14 КАК ЧасовПлан14,
		|	Данные.ЧасовПлан15 КАК ЧасовПлан15,
		|	Данные.НачалоСменыПлан1 КАК НачалоСменыПлан1,
		|	Данные.НачалоСменыПлан2 КАК НачалоСменыПлан2,
		|	Данные.НачалоСменыПлан3 КАК НачалоСменыПлан3,
		|	Данные.НачалоСменыПлан4 КАК НачалоСменыПлан4,
		|	Данные.НачалоСменыПлан5 КАК НачалоСменыПлан5,
		|	Данные.НачалоСменыПлан6 КАК НачалоСменыПлан6,
		|	Данные.НачалоСменыПлан7 КАК НачалоСменыПлан7,
		|	Данные.НачалоСменыПлан8 КАК НачалоСменыПлан8,
		|	Данные.НачалоСменыПлан9 КАК НачалоСменыПлан9,
		|	Данные.НачалоСменыПлан10 КАК НачалоСменыПлан10,
		|	Данные.НачалоСменыПлан11 КАК НачалоСменыПлан11,
		|	Данные.НачалоСменыПлан12 КАК НачалоСменыПлан12,
		|	Данные.НачалоСменыПлан13 КАК НачалоСменыПлан13,
		|	Данные.НачалоСменыПлан14 КАК НачалоСменыПлан14,
		|	Данные.НачалоСменыПлан15 КАК НачалоСменыПлан15,
		|	Данные.НачалоСмены1 КАК НачалоСмены1,
		|	Данные.НачалоСмены2 КАК НачалоСмены2,
		|	Данные.НачалоСмены3 КАК НачалоСмены3,
		|	Данные.НачалоСмены4 КАК НачалоСмены4,
		|	Данные.НачалоСмены5 КАК НачалоСмены5,
		|	Данные.НачалоСмены6 КАК НачалоСмены6,
		|	Данные.НачалоСмены7 КАК НачалоСмены7,
		|	Данные.НачалоСмены8 КАК НачалоСмены8,
		|	Данные.НачалоСмены9 КАК НачалоСмены9,
		|	Данные.НачалоСмены10 КАК НачалоСмены10,
		|	Данные.НачалоСмены11 КАК НачалоСмены11,
		|	Данные.НачалоСмены12 КАК НачалоСмены12,
		|	Данные.НачалоСмены13 КАК НачалоСмены13,
		|	Данные.НачалоСмены14 КАК НачалоСмены14,
		|	Данные.НачалоСмены15 КАК НачалоСмены15,
		|	Данные.ПредставлениеПлан1 КАК ПредставлениеПлан1,
		|	Данные.ПредставлениеПлан2 КАК ПредставлениеПлан2,
		|	Данные.ПредставлениеПлан3 КАК ПредставлениеПлан3,
		|	Данные.ПредставлениеПлан4 КАК ПредставлениеПлан4,
		|	Данные.ПредставлениеПлан5 КАК ПредставлениеПлан5,
		|	Данные.ПредставлениеПлан6 КАК ПредставлениеПлан6,
		|	Данные.ПредставлениеПлан7 КАК ПредставлениеПлан7,
		|	Данные.ПредставлениеПлан8 КАК ПредставлениеПлан8,
		|	Данные.ПредставлениеПлан9 КАК ПредставлениеПлан9,
		|	Данные.ПредставлениеПлан10 КАК ПредставлениеПлан10,
		|	Данные.ПредставлениеПлан11 КАК ПредставлениеПлан11,
		|	Данные.ПредставлениеПлан12 КАК ПредставлениеПлан12,
		|	Данные.ПредставлениеПлан13 КАК ПредставлениеПлан13,
		|	Данные.ПредставлениеПлан14 КАК ПредставлениеПлан14,
		|	Данные.ПредставлениеПлан15 КАК ПредставлениеПлан15
		|ИЗ
		|	Документ.ТабельУчетаРабочегоВремени.ДанныеОВремени КАК Данные
		|ГДЕ
		|	Данные.Ссылка = &Ссылка   
		|	%КоличествоСтрокТЧ
		|УПОРЯДОЧИТЬ ПО
		|	Данные.НомерСтроки");          
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%КоличествоСтрокТЧ", ?(КоличествоСтрокТЧ = Неопределено, "", "И Данные.НомерСтроки <= &КоличествоСтрокТЧ"));
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	Если КоличествоСтрокТЧ <> Неопределено Тогда
		Запрос.УстановитьПараметр("КоличествоСтрокТЧ", КоличествоСтрокТЧ);  	
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат Новый Структура("Хэш, КоличествоСтрокТЧ", ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ТЗ), ТЗ.Количество());     
	
КонецФункции  

#КонецОбласти

#КонецЕсли
