#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	&Вместо("ОбработкаПроведения")
	Процедура ОбработкаПроведения(Отказ, Режим)
		КолДнейВМес= День(КонецМесяца(ПериодРегистрации));
		// регистр РабочееВремяСотрудников            
		Примечание = Справочники.ВидыИспользованияРабочегоВремени.НайтиПоНаименованию("Примечание");
		Движения.РабочееВремяСотрудников.Записывать = Истина;
		
		Для Каждого ТекСтрокаДанныеОВремени Из ДанныеОВремени Цикл
			Для День=1 По КолДнейВМес Цикл
				
				Если ЗначениеЗаполнено(ТекСтрокаДанныеОВремени["ВидВремени"+День]) Тогда
					
					Движение = Движения.РабочееВремяСотрудников.Добавить();
					Движение.Период = ПериодРегистрации+((День-1)*3600*24);  
					Движение.Сотрудник = ТекСтрокаДанныеОВремени.Сотрудник;
					Движение.ВидУчетаВремени = ТекСтрокаДанныеОВремени["ВидВремени"+День];
					Движение.ПериодРегистрации = ПериодРегистрации; 
					Движение.Примечание = ТекСтрокаДанныеОВремени["Примечание"+День];
					Движение.ПланФакт = ПланФакт;
					Движение.ПредставлениеВремени = ТекСтрокаДанныеОВремени["Представление"+День];
					Движение.Дней = ?(Движение.ВидУчетаВремени.РабочееВремя, 1, 0);
					Движение.Часов = ТекСтрокаДанныеОВремени["Часов"+День];
					Движение.ДеньНедели= АльтерраОбщегоНазначения.ДеньНеделиПрописьюСокр(ДеньНедели(Движение.Период));
					
				ИначеЕсли ЗначениеЗаполнено(ТекСтрокаДанныеОВремени["Примечание"+День]) Тогда
					
					Движение = Движения.РабочееВремяСотрудников.Добавить();
					Движение.Период = ПериодРегистрации+((День-1)*3600*24);  
					Движение.Сотрудник = ТекСтрокаДанныеОВремени.Сотрудник;
					Движение.ВидУчетаВремени = Примечание;
					Движение.ПериодРегистрации = ПериодРегистрации; 
					Движение.Примечание = ТекСтрокаДанныеОВремени["Примечание"+День];
					Движение.ПланФакт = ПланФакт;
					Движение.ДеньНедели= АльтерраОбщегоНазначения.ДеньНеделиПрописьюСокр(ДеньНедели(Движение.Период));	
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецПроцедуры
	
	&Перед("ПередЗаписью")
	Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если Статус = Перечисления.ТабельУчетаРабочегоВремениСтатус.Проверен Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеОВремени.Сотрудник КАК Сотрудник,
			|	ДанныеОВремени.Отдел КАК Отдел,
			|	ДанныеОВремени.Подразделение КАК Подразделение,
			|	ДанныеОВремени.Должность КАК Должность
			|ПОМЕСТИТЬ ДанныеОВремени1
			|ИЗ
			|	&ДанныеОВремени КАК ДанныеОВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Сотрудники.Ссылка КАК Сотрудник,
			|	Сотрудники.Отдел КАК Отдел,
			|	Сотрудники.Должность КАК Должность,
			|	Сотрудники.Подразделение КАК Подразделение
			|ИЗ
			|	ДанныеОВремени1 КАК ДанныеОВремени1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО ДанныеОВремени1.Сотрудник = Сотрудники.Ссылка
			|ГДЕ
			|	Сотрудники.ДатаПеревода = &Дата
			|	И (ДанныеОВремени1.Отдел <> Сотрудники.Отдел
			|			ИЛИ ДанныеОВремени1.Подразделение <> Сотрудники.Подразделение
			|			ИЛИ ДанныеОВремени1.Должность <> Сотрудники.Должность)";
			
			Запрос.УстановитьПараметр("ДанныеОВремени",ДанныеОВремени.Выгрузить(,"Сотрудник,Отдел,Подразделение,Должность"));
			Запрос.УстановитьПараметр("Дата", НачалоМесяца(ПериодРегистрации));
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Строка = ДанныеОВремени.Найти(Выборка.Сотрудник,"Сотрудник");
				Строка.Отдел = Выборка.Отдел;
				Строка.Подразделение = Выборка.Подразделение;
				Строка.Должность = Выборка.Должность;
			КонецЦикла;
		ИначеЕсли Статус = Перечисления.ТабельУчетаРабочегоВремениСтатус.УтвержденКАвансу Тогда
			Документы.ТабельУчетаРабочегоВремени.КонтрольИзмененийТЧПриНаличииСтатуса_УтвержденКАвансу(Отказ, ЭтотОбъект, Истина);
		КонецЕсли;
		
		ЗапретСозданияТабеляСДублируемымиДанными(Отказ);
		
	КонецПроцедуры
	
	&После("ПриЗаписи")
	Процедура Док_ПриЗаписи(Отказ)
		Документы.ТабельУчетаРабочегоВремени.КонтрольИзмененийТЧПриНаличииСтатуса_УтвержденКАвансу(Отказ, ЭтотОбъект, Ложь);
	КонецПроцедуры
	
	Процедура ЗапретСозданияТабеляСДублируемымиДанными(Отказ) 
		Если НЕ Отказ И НЕ ПометкаУдаления Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДанныеОВремени.Сотрудник КАК Сотрудник,
				|	ДанныеОВремени.Отдел КАК Отдел,
				|	ДанныеОВремени.Подразделение КАК Подразделение,
				|	ДанныеОВремени.Должность КАК Должность,
				|	&ПериодРегистрации КАК ПериодРегистрации,
				|	&Организация КАК Организация
				|ПОМЕСТИТЬ ВТДанныеОВремени
				|ИЗ
				|	&ДанныеОВремени КАК ДанныеОВремени
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Табель.Ссылка КАК ДублируемыйТабель,
				|	ДанныеОВремени.Сотрудник КАК Сотрудник
				|ИЗ
				|	ВТДанныеОВремени КАК ДанныеОВремени
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТабельУчетаРабочегоВремени.ДанныеОВремени КАК Табель
				|		ПО ДанныеОВремени.Сотрудник = Табель.Сотрудник
				|			И ДанныеОВремени.Отдел = Табель.Отдел
				|			И ДанныеОВремени.Подразделение = Табель.Подразделение
				|			И ДанныеОВремени.Должность = Табель.Должность
				|			И ДанныеОВремени.ПериодРегистрации = Табель.Ссылка.ПериодРегистрации
				|			И ДанныеОВремени.Организация = Табель.Ссылка.Организация
				|ГДЕ
				|	НЕ Табель.Ссылка.ПометкаУдаления
				|	И НЕ Табель.Ссылка = &Ссылка
				|
				|УПОРЯДОЧИТЬ ПО
				|	Табель.Ссылка.Дата УБЫВ";
			
			Запрос.УстановитьПараметр("ДанныеОВремени",ДанныеОВремени.Выгрузить(,"Сотрудник,Отдел,Подразделение,Должность"));
			Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ПериодРегистрации));
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();	
			Пока Выборка.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные по сотруднику '" + Выборка.Сотрудник + "' уже используются в табеле: '" + Выборка.ДублируемыйТабель + "'", Выборка.ДублируемыйТабель,,,Отказ);  
			КонецЦикла;
		КонецЕсли; 
	КонецПроцедуры

#КонецЕсли



