////////////////////////////////////////////////////////////////////////////////
// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
	НаименованиеОтчета= "Анализ движений по бонусной программе";
	Идентификатор = "АнализДвиженийПоБонуснойПрограмме";
	
	ВерсияБСП= СтандартныеПодсистемыСервер.ВерсияБиблиотеки();	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);
	//ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.3.44");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "1.04";
	ПараметрыРегистрации.БезопасныйРежим = Истина;
	ПараметрыРегистрации.Информация = НаименованиеОтчета;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	стрНаименованиеОтчета= СтрЗаменить("ru = '&НаименованиеОтчета'", "&НаименованиеОтчета", НаименованиеОтчета);
	НоваяКоманда.Представление = НСтр(стрНаименованиеОтчета);
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	НоваяКоманда.Модификатор = Идентификатор;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////