
#Область ПрограммныйИнтерфейс

Процедура ПодключитьОбработчикНовыхСообщенийСистемыВзаимодействия() Экспорт
	
	СлужебныйЖурналЗвонков = Неопределено;
	СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске().Свойство("СлужебныйЖурналЗвонков", СлужебныйЖурналЗвонков);
	
	Если НЕ ЗначениеЗаполнено(СлужебныйЖурналЗвонков) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСообщенияОбсуждениеЖурналЗвонков", ТелефонияКлиент);
	
	СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(,
		СлужебныйЖурналЗвонков,
		ОписаниеОповещения
	);
	
КонецПроцедуры

Процедура СоздатьСлужебныйЖурналЗвонковСистемыВзаимодействия() Экспорт
	
	СлужебныйЖурналЗвонков = ТелефонияВызовСервера.СоздатьОбсуждениеЖурналЗвонков();
	Если СлужебныйЖурналЗвонков <> Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСообщенияОбсуждениеЖурналЗвонков", ТелефонияКлиент);
		
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(,
			СлужебныйЖурналЗвонков,
			ОписаниеОповещения
		);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредложитьРегистрациюСистемыВзаимодействия() Экспорт
	
	ТелефонияКлиент.ПредложитьРегистрацияИнформационнойБазыСистемыВзаимодействия(Истина);
	УправлениеНебольшойФирмойСервер.УстановитьНастройкуПользователя(Истина, "ПредложениеИспользованияСистемыВзаимодействияДляТелефонииПоказано");
	
КонецПроцедуры

Процедура ПредложитьИспользованиеСистемыВзаимодействия() Экспорт
	
	ТелефонияКлиент.ПредложитьРегистрацияИнформационнойБазыСистемыВзаимодействия(Ложь);
	УправлениеНебольшойФирмойСервер.УстановитьНастройкуПользователя(Истина, "ПредложениеИспользованияСистемыВзаимодействияДляТелефонииПоказано");
	
КонецПроцедуры

#КонецОбласти
