
&НаКлиенте
Процедура ОтделыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Отделы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Ссылка) И Не ТекущиеДанные.ЭтоГруппа Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Отдел", ТекущиеДанные.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Отдел", Неопределено, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.СписокКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения); 
КонецПроцедуры

/////////////////////// Оборудование ////////////////////////////////
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"  И ВводДоступен()  Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	Сотрудник = НайтиЭлементНаСервере(Данные.Штрихкод);
	Если Не Сотрудник.Пустая() Тогда
		Элементы.Список.ТекущаяСтрока = Сотрудник;
		ОткрытьЗначение(Сотрудник);
	Иначе
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сотрудник по штрихкоду не найден!");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция НайтиЭлементНаСервере(Штрихкод)
	Возврат Справочники.Сотрудники.НайтиПоКоду(Штрихкод, Истина);
КонецФункции
