#Область События

//Открытие и закрытие формы Контрагента для заполения Доп.Реквизита ОГРН с ПомошникНового
&НаКлиенте
Процедура Док_ПриЗакрытииПосле(ЗавершениеРаботы)
	СсылкаНаКонтрагента 	= КонтрагентВыбор;
   	ПараметрыФормы 			= Новый Структура("Ключ, ЗаполнятьОГРН", СсылкаНаКонтрагента);
   	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрыФормы);

	ФормаСОГРН 				= ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрыФормы);
	ФормаСОГРН.Закрыть();
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Элементы.ИсточникПервичногоИнтересаЧастноеЛицо.СвязьПоТипу = Новый СвязьПоТипу("КаналПервичногоИнтереса",0);
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ОсновнойМенеджер = "";
	МАП = "";
	УказатьДанныеКонтактногоЛица = Истина;
	УстановитьДоступностьДанныхКонтактногоЛица(ЭтотОбъект);
	Элементы.Парсинг.Доступность = АльтерраОбщегоНазначения._ЕстьРоль("УстановкаФлажкаПарсингВПартнерах");
	
	ИнициализацияПомощникаЗаведенияЧастногоКлиента(Параметры);
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ИнициализацияПомощникаЗаведенияЧастногоКлиента_НаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = НеЗакрыватьФормуАвтоматически;
КонецПроцедуры

&НаКлиенте
&Перед("ОбработкаСобытияЭлементаКИТелефон")
Процедура Док_ОбработкаСобытияЭлементаКИТелефон(Элемент, ВидКонтактнойИнформации, ИмяРеквизитаПредставление, ИмяРеквизитаЗначенияПолей, Событие)
	СбросАктивацииБонуснойПрограммыПартнера(Истина);
КонецПроцедуры

#Область ИдентификацияПоТелефону 

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	
	СбросАктивацииБонуснойПрограммыПартнера();
	
	Отказ = Ложь;
	ПроверкаЗаполнения(ТелефонПартнераФизЛицо, "ТелефонПартнераФизЛицо", "'Телефон'", Отказ);
	
	Если Не Отказ И Не ЕстьПартнерЧастноеЛицоСТакимТелефономНаСервере(Неопределено, Ложь, ТелефонПартнераФизЛицо) Тогда

		Оповещение = Новый ОписаниеОповещения("ЗавершениеИдентификацииПоКоду",ЭтотОбъект);   	
		ПараметрыФормы = Новый Структура("ТолькоОтправкаКода, НовыйПартнер, ФИОПартнера, НомерТелефона, Действие", 
			Истина, Истина, СтрШаблон("%1 %2 %3", ФамилияПартнера, ИмяПартнера, ОтчествоПартнера), ТелефонПартнераФизЛицо, "1c_register_card");
		ОткрытьФорму("Справочник.БонусныеПрограммыЛояльности.Форма.Спр_СМСИдентификация", ПараметрыФормы,ЭтаФорма,,,,Оповещение,);

	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура СбросАктивацииБонуснойПрограммыПартнера(ВыводСообщения = Ложь)
	
	Если РежимПомощникаЗаведенияЧастногоКлиента Тогда  
		
		ОчиститьСообщения(); 
		
		Если АктивироватьБонуснуюПрограммуПартнера Тогда
           УстановитьБонуснуюПрограммуКлиента(Ложь);
			
			Если ВыводСообщения И _ГруппыПартнеров <> 3 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При редактировании номера телефона происходит сброс активации бонусной программы! Отправьте код повторно!");
			КонецЕсли;
		КонецЕсли;  
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗавершениеИдентификацииПоКоду(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина тогда
		УстановитьБонуснуюПрограммуКлиента(Истина);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Бонусная программа будет активирована после записи данных")		
	Иначе
		 Сообщить("Клиент не идентифицирован. Бонусная программа не активирована.");
	КонецЕсли;   
	 
КонецПроцедуры      

Процедура УстановитьБонуснуюПрограммуКлиента(Активация)
	
	АктивироватьБонуснуюПрограммуПартнера = Активация;
	Элементы.ДекорацияАктивацияБонуснойПрограммы.Заголовок = СтрШаблон("Бонусная программа %1активирована", ?(Активация, "", "не "));
	Элементы.ДекорацияАктивацияБонуснойПрограммы.ЦветТекста = ?(Активация, WebЦвета.Зеленый, WebЦвета.Кирпичный);
	
КонецПроцедуры	

#КонецОбласти 

&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьНеобходимыеДействияПриПереходеПоСтраницам")
Процедура Док_ВыполнитьНеобходимыеДействияПриПереходеПоСтраницам(Знач Оповещение, Команда)

	Если Команда.Имя = "Далее" Тогда

		Если Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаПервичнаяИнформация Тогда

			ВыполнитьПоискПоПервичнойИнформации();
#Удаление
			Если ТаблицаНайдено.Количество() > 0 Тогда
#КонецУдаления
#Вставка
			Если ТаблицаНайдено.Количество() > 0 И НЕ РежимПомощникаЗаведенияЧастногоКлиента Тогда
#КонецВставки
				ПерейтиНаСтраницуНайденныхСовпадений();
			Иначе
				ПерейтиНаСтраницуДополнительныхСведений();
			КонецЕсли;

		ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаНайдено Тогда

			ВыборПользователяПоРезультатамНайдено(Новый ОписаниеОповещения("ВыполнитьНеобходимыеДействияПриПереходеПоСтраницамПослеВыбора", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)));
			Возврат;

		ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаДополнительныеСведения Тогда

			Если ИспользоватьДополнительныеРеквизиты Тогда

				Если ТребуетсяОбновлениеЭлементовДопРеквизитов Тогда
					ОбновитьЭлементыДополнительныхРеквизитов();
					ТребуетсяОбновлениеЭлементовДопРеквизитов = Ложь;
				КонецЕсли;

				Если Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы.Количество() > 0 Тогда
					ПерейтиНаСтраницуДополнительныхРеквизитов();
				Иначе
					ПерейтиНаСтраницуРасчетногоСчетаИлиФинальную();
				КонецЕсли;

			Иначе

				ПерейтиНаСтраницуРасчетногоСчетаИлиФинальную();

			КонецЕсли;

		ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаДополнительныеРеквизиты Тогда

			ПерейтиНаСтраницуРасчетногоСчетаИлиФинальную();

		ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаРасчетныйСчет Тогда

			Если ИспользуютсяТолькоПартнеры
				Или (ДействиеСКонтрагентом = 1 И Не НаОснованииКонтрагента И УказыватьЮридическиеРеквизиты) Тогда

				Если ВидКомпании = 3 И Не ИспользуютсяТолькоПартнеры Тогда
					ПерейтиНаСтраницуВыбораГоловногоКонтрагента();
				ИначеЕсли ВидКомпании = 0 И ПартнерыИКонтрагентыЛокализацияКлиент.НеобходимПоискНепривязанныхОбособленныхПодразделений(ЭтотОбъект) Тогда
					ВыполнитьПоискНепривязанныхОбособленныхПодразделений();
					Если ОбособленныеПодразделения.Количество() > 0 Тогда
						ПерейтиНаСтраницуОбособленныхПодразделений();
					КонецЕсли;
				КонецЕсли;

			КонецЕсли;

			Если Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаРасчетныйСчет Тогда
				ПерейтиНаФинальнуюСтраницу();
			КонецЕсли;

		ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаОбособленныеПодразделения Тогда

			ПерейтиНаФинальнуюСтраницу();

		ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаГоловнойКонтрагент Тогда

			Если ВыбратьГоловногоКонтрагента = 1 Тогда
				ПерейтиНаСтраницуРасчетногоСчетаГоловногоКонтрагента();
			Иначе
				ПерейтиНаФинальнуюСтраницу();
			КонецЕсли;

		ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаРасчетныйСчетГоловногоКонтрагента Тогда

			ПерейтиНаФинальнуюСтраницу();

		ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда

			СписокСозданных = Новый СписокЗначений;
			ТребуетсяПереходНаСтраницуСовпадений = Ложь;
			СоздатьПартнера(СписокСозданных, ТребуетсяПереходНаСтраницуСовпадений);

			Если ТребуетсяПереходНаСтраницуСовпадений Тогда
				ПерейтиНаСтраницуНайденныхСовпадений();
				Возврат;
			КонецЕсли;

			Если СозданиеВыполнено Тогда

				РеквизитыПартнера = Новый Структура;

				Для Каждого ЭлементСписка Из СписокСозданных Цикл
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("СправочникСсылка.Партнеры") Тогда
						РеквизитыПартнера.Вставить("Наименование", ЭлементСписка.Представление);
						РеквизитыПартнера.Вставить("ОсновнойМенеджер", ОсновнойМенеджер);
					КонецЕсли;
					ПоказатьОповещениеПользователя("Создание", ЭлементСписка.Значение, ЭлементСписка.Представление);
				КонецЦикла;

				Если РеквизитыПартнера.Количество() = 0 Тогда
					РеквизитыПартнера = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(ПартнерВыбор, "ОсновнойМенеджер, Наименование");
				КонецЕсли;

				ВыполнитьДействияЗакрытияФормы(Новый ОписаниеОповещения("ВыполнитьНеобходимыеДействияПриПереходеПоСтраницамЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), РеквизитыПартнера, Истина);
				Возврат;

			КонецЕсли;

		КонецЕсли;

	Иначе

		РазмерСписка = СтекПредыдущихСтраниц.Количество();
		ИмяПредыдущейСтраницы = СтекПредыдущихСтраниц[РазмерСписка - 1].Значение;
		Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы[ИмяПредыдущейСтраницы];
		СтекПредыдущихСтраниц.Удалить(РазмерСписка -1);

	КонецЕсли;

	ВыполнитьНеобходимыеДействияПриПереходеПоСтраницамФрагмент(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Спр_ДалееВместо(Команда)   
	ПолноеНаименование_ЕстьПарсинг = ДопМодульКлиентСервер.ЕстьПарсинг(ПолноеНаименование);
	Название_ЕстьПарсинг = ДопМодульКлиентСервер.ЕстьПарсинг(Название);
	
	// +Альтерра +
	Отказ = Ложь;		
	Если ЭтоКомпания = 1 Тогда
		Если ПустаяСтрока(ТелефонПартнераФизЛицо) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо задать номер телефона!'"),ИспользуютсяТолькоПартнеры,"ТелефонПартнераФизЛицо");
			Отказ = Истина;
		КонецЕсли;
		Если ПустаяСтрока(ОтчествоПартнера) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо задать отчество!'"),ИспользуютсяТолькоПартнеры,"ОтчествоПартнера");
			Отказ = Истина;
		КонецЕсли;
		АдресЭПКонтактногоЛицаОбязателен = ложь;
		
		Отказ = ЕстьПартнерЧастноеЛицоСТакимТелефономНаСервере(, Отказ, ТелефонПартнераФизЛицо);
		
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
	иначе                      
		Если ПолноеНаименование_ЕстьПарсинг Тогда  
			АдресЭПКонтактногоЛицаОбязателен = Ложь;
		Иначе                           
			АдресЭПКонтактногоЛицаОбязателен = истина;
			Если ПустаяСтрока(АдресЭПКЛ) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо задать E-mail контактного лица!'"),ИспользуютсяТолькоПартнеры,"АдресЭПКЛ");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Страница = Элементы.СтраницыПомощника.ТекущаяСтраница; 
	
	//СтраницаПервичнаяИнформация
	Если Страница = Элементы.СтраницаПервичнаяИнформация Тогда
		Если ЭтоКомпания = 1 Тогда
			Если ПолноеНаименование_ЕстьПарсинг Тогда
				ПолноеНаименование = АльтерраОбщегоНазначения.СтрЗаменить_(ПолноеНаименование, "(ПАРСИНГ)");
			КонецЕсли; 
			
			Если Название_ЕстьПарсинг Тогда       
				Название = АльтерраОбщегоНазначения.СтрЗаменить_(Название, "(ПАРСИНГ)");
			КонецЕсли;    
			
			ОчиститьФлажки();
		Иначе
			Если ПолноеНаименование_ЕстьПарсинг Тогда  
				Если ЗначениеЗаполнено(Название) И Не Название_ЕстьПарсинг Тогда       
					Название = Название + " (Парсинг)";
				КонецЕсли;
				
				ОчиститьФлажки(Истина);       
			Иначе      
				Если Название_ЕстьПарсинг Тогда       
					Название = АльтерраОбщегоНазначения.СтрЗаменить_(Название, "(ПАРСИНГ)");
				КонецЕсли;    
				
				ОчиститьФлажки();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//СтраницаДополнительныеСведения
	Если Страница = Элементы.СтраницаДополнительныеСведения Тогда
		Если ПустаяСтрока(БизнесРегион) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать Бизнес-регион!'"),ИспользуютсяТолькоПартнеры,"БизнесРегион");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//СтраницаДополнительныеРеквизиты
	Если Страница = Элементы.СтраницаДополнительныеРеквизиты Тогда
		
		ГруппаПартнер = Спр_ПолучитьЗначениеДополнительногоРеквизитаНаФорме("Группы партнеров");
		Если ГруппаПартнер.Пустая() Тогда
			Сообщить(НСтр("ru = 'Необходимо выбрать Группу партнера!'"));
			Отказ = Истина;
		ИначеЕсли ГруппаПартнер = Спр_НайтиПоНаименованию("Частные лица") И Не ЗначениеЗаполнено(ДатаРождения) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить Дату рождения на предыдущем шаге!");
			Отказ = Истина;
		КонецЕсли;
		
		ТипПокупателя = Спр_ПолучитьЗначениеДополнительногоРеквизитаНаФорме("Тип покупателя");
		
		Если Не ГруппаПартнер.Пустая() Тогда
			мГруппаПартнера = Новый Массив;
			мГруппаПартнера.Добавить("Покупатели (организация/ИП)");
			мГруппаПартнера.Добавить("Покупатели-поставщики");                     
			
			Для каждого Группа Из мГруппаПартнера Цикл
				Если ГруппаПартнер = Спр_НайтиПоНаименованию(Группа) И ТипПокупателя.Пустая() Тогда
					Сообщить(НСтр("ru = 'Необходимо заполнить Тип покупателя!'"));
					Отказ = Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
		
		Если НРег(ТипПокупателя) = НРег(Спр_НайтиПоНаименованию("строительная"))
			Или ГруппаПартнер = Спр_НайтиПоНаименованию("Бригадиры") Тогда
			ВидДеятельности = Спр_ПолучитьЗначениеДополнительногоРеквизитаНаФорме("Вид деятельности");
			Если ВидДеятельности.Пустая() Тогда
				Сообщить(НСтр("ru = 'Необходимо заполнить Вид деятельности!'"));
				Отказ = Истина;
			КонецЕсли; 
		КонецЕсли;
		
		Если ПустаяСтрока(ТелефонПартнера) И Не ЭтоКомпания = 1 И Не Отказ Тогда
			мГруппаПартнераТел = Новый Массив;
			мГруппаПартнераТел.Добавить("Покупатели (организация/ИП)");
			мГруппаПартнераТел.Добавить("Бригадиры");
			мГруппаПартнераТел.Добавить("Частные лица");
			мГруппаПартнераТел.Добавить("Сотрудники");
			
			Для каждого ГруппаТел Из мГруппаПартнераТел Цикл
				Если ГруппаПартнер = Спр_НайтиПоНаименованию(ГруппаТел) Тогда
					Сообщить(НСтр("ru = 'Необходимо заполнить Телефон Партнера!'"));
					Отказ = Истина;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	// -Альтерра +
	
	ВыполнитьПереходПоСтраницам(Неопределено, Команда); 
	
КонецПроцедуры

&НаСервере
Функция Спр_ПолучитьПолеДополнительногоРеквизитаНаФорме(ИмяРеквизита) 
	
	Список = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов;
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ИмяРеквизита);
	
	Если ЗначениеЗаполнено(Свойство) Тогда
	    НайденныеСтроки = Список.НайтиСтроки(Новый Структура("Свойство", Свойство));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0];		
		КонецЕсли; 		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция Спр_ПолучитьЗначениеДополнительногоРеквизитаНаФорме(ИмяРеквизита)
	Перем ЗначениеРеквизита;
	
	ПолеДополнительногоРеквизитаНаФорме = Спр_ПолучитьПолеДополнительногоРеквизитаНаФорме(ИмяРеквизита);
	
	Если не ПолеДополнительногоРеквизитаНаФорме = Неопределено Тогда
		Возврат ЭтаФорма[ПолеДополнительногоРеквизитаНаФорме.ИмяРеквизитаЗначение];
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция Спр_НайтиПоНаименованию(ИмяРеквизита)
	
	Реквизит = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ИмяРеквизита);
	
	Если не Реквизит = Неопределено Тогда
		Возврат Реквизит;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПомощникЗаведенияЧастногоКлиента

&НаСервере
Процедура ИнициализацияПомощникаЗаведенияЧастногоКлиента(Параметры)
	Если Параметры.Свойство("РежимПомощникаЗаведенияЧастногоКлиента") Тогда
		Элементы.Переместить(Элементы.ФамилияПартнера, Элементы.ФормаРегистрацииЧЛ_ОсновныеРеквизиты);
		Элементы.Переместить(Элементы.ИмяПартнера, Элементы.ФормаРегистрацииЧЛ_ОсновныеРеквизиты);
		Элементы.Переместить(Элементы.ОтчествоПартнера, Элементы.ФормаРегистрацииЧЛ_ОсновныеРеквизиты);
		Элементы.Переместить(Элементы.ДатаРождения, Элементы.ФормаРегистрацииЧЛ_ОсновныеРеквизиты);
		Элементы.Переместить(Элементы.Пол, Элементы.ФормаРегистрацииЧЛ_ОсновныеРеквизиты); 
		Элементы.ФамилияПартнера.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ИмяПартнера.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ОтчествоПартнера.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.Переместить(Элементы.ФактическийАдресЧастноеЛицо, Элементы.ФормаРегистрацииЧЛ_Адрес, Элементы.УказатьАдресНаКарте);
		Элементы.ФактическийАдресЧастноеЛицо.РедактированиеТекста = Ложь;
		
		Элементы.Переместить(Элементы.БизнесРегионЧастноеЛицо, Элементы.ФормаРегистрацииЧЛ_ДопРеквизиты_Основные);
		Элементы.Переместить(Элементы.АдресЭППартнераФизЛицо, Элементы.ФормаРегистрацииЧЛ_ДопРеквизиты_Основные);
		
		Элементы.Переместить(Элементы.ТелефонПартнераФизЛицо, Элементы.ФормаРегистрацииЧЛ_ДопРеквизиты_Телефон_1, Элементы.ОтправитьСМС);
		
		ДопМодуль.ПереместитьДополнительныйРеквизит(ЭтаФорма, "ВидДеятельности", "ФормаРегистрацииЧЛ_ДопРеквизиты_Прочее");
		
		Элементы.Переместить(Элементы.Сегмент, Элементы.ФормаРегистрацииЧЛ_ДопРеквизиты_Прочее);
		
		РежимПомощникаЗаведенияЧастногоКлиента = Истина;
		Элементы.ВыбратьПартнера.Видимость = Параметры.Свойство("РежимПомощникаЗаведенияЧастногоКлиента_ФормаВыбора");
		
		_ГруппыПартнеров = 1; // "Частные лица"
		ДопМодуль.УстановитьЗначениеДополнительногоРеквизитаНаФорме(ЭтаФорма, "ГруппыПартнеров", Спр_НайтиПоНаименованию("Частные лица"));
		ПолучитьЭлементДополнительногоРеквизита("ВидДеятельности").Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияПомощникаЗаведенияЧастногоКлиента_НаКлиенте()
	Если РежимПомощникаЗаведенияЧастногоКлиента Тогда
		ЭтаФорма.Заголовок = "Помощник заведения частного клиента";
		
		ЭтоКомпания = 1;
		ЭтоКомпанияПриИзменении(Элементы.ЭтоКомпания);
		Спр_ЭтоКомпанияПриИзмененииПосле(Элементы.ЭтоКомпания);
		
		Клиент = Истина;
		ФлагПризнакПартнераПриИзменении(Элементы.Клиент);
		Док_КлиентПриИзмененииПосле(Элементы.Клиент);
		
		ДействиеПоРезультатамНайдено = 2;
		ДействиеСКонтрагентом = 1;
		ОткрытьПослеСоздания = Ложь;
		
		Элементы.СтраницыПомощника.Видимость = Ложь;
		Элементы.ГруппаПодвал.Видимость = Ложь;
		
		ТребуетсяОбновлениеЭлементовДопРеквизитов = Ложь;
	Иначе
		Элементы.ФормаРегистрацииЧЛ.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УказатьАдресНаКарте(Команда)
	ОткрытьФорму(
		"Обработка.КартографическийИнтерфейсДоставка.Форма.УказатьАдресНаКарте",
		, 
		ЭтаФорма,
		,
		,
		,
		Новый ОписаниеОповещения("УказатьАдресНаКартеЗавершение", ЭтаФорма), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УказатьАдресНаКартеЗавершение(НовыйАдрес, ДопПараметры) Экспорт 
	Если ЗначениеЗаполнено(НовыйАдрес) Тогда
		ФактическийАдрес = НовыйАдрес;
		ФактическийАдресЧастноеЛицоПриИзменении(Элементы.ФактическийАдресЧастноеЛицо);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда) 
	
	Отказ = Ложь;
	
	ПроверкаЗаполнения(ФамилияПартнера,        "ФамилияПартнера", 			  "'Фамилия'", 			Отказ);
	ПроверкаЗаполнения(ИмяПартнера,            "ИмяПартнера", 				  "'Имя'", 				Отказ);
	ПроверкаЗаполнения(ОтчествоПартнера,       "ОтчествоПартнера", 			  "'Отчество'", 		Отказ);
	ПроверкаЗаполнения(ДатаРождения,           "ДатаРождения", 				  "'Дата рождения'",    Отказ);
	ПроверкаЗаполнения(Пол,                    "Пол", 						  "'Пол'", 				Отказ);
	ПроверкаЗаполнения(ФактическийАдрес,       "ФактическийАдресЧастноеЛицо", "'Адрес проживания'", Отказ);
	ПроверкаЗаполнения(БизнесРегион,           "БизнесРегионЧастноеЛицо", 	  "'Бизнес-регион'",    Отказ);
	ПроверкаЗаполнения(ТелефонПартнераФизЛицо, "ТелефонПартнераФизЛицо", 	  "'Телефон'", 			Отказ);
	ПроверкаЗаполнения(Сегмент,                "Сегмент",                	  "'Сегмент'", 			Отказ);
	ПроверкаЗаполнения(_ГруппыПартнеров,       "_ГруппыПартнеров",            "'Группы партнеров'", Отказ);
	
	ПроверкаЗаполненияНаСервере(Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если _ГруппыПартнеров = 3 Тогда // Сотрудники
		Если Не АктивироватьБонуснуюПрограммуПартнера И ЕстьПартнерЧастноеЛицоСТакимТелефономНаСервере(Неопределено, Ложь, ТелефонПартнераФизЛицо) Тогда
			Возврат;
		КонецЕсли;
		НеобходимоАктивироватьПартнера = Ложь;
	ИначеЕсли Не АктивироватьБонуснуюПрограммуПартнера Тогда
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Бонусная программа не активирована!", , "АктивироватьБонуснуюПрограмму");
         НеобходимоАктивироватьПартнера = Ложь;
         ОтправитьИнформационноеСМСНаСервере(ТелефонПартнераФизЛицо);  	
	Иначе
		НеобходимоАктивироватьПартнера = Истина;
	КонецЕсли;
	
	НеЗакрыватьФормуАвтоматически = Истина;
	
	Попытка
		КомандаДалее = ЭтаФорма.Команды.Найти("Далее");
		Пока Не СозданиеВыполнено Цикл
			ПредыдущаяСтраница = Элементы.СтраницыПомощника.ТекущаяСтраница;
			
			Спр_ДалееВместо(КомандаДалее);
								
			Если Элементы.СтраницыПомощника.ТекущаяСтраница = ПредыдущаяСтраница Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;   
		
		Если СозданиеВыполнено Тогда
			ЭтаФорма.Модифицированность = Ложь;
			Элементы.ФормаРегистрацииЧЛ_Заполнение.Доступность = Ложь;
			
			Если НеобходимоАктивироватьПартнера Тогда
				АльтерраОбщегоНазначения.АктивироватьПартнера(ПартнерВыбор);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	НеЗакрыватьФормуАвтоматически = Ложь;
	
КонецПроцедуры


&НаСервере
Процедура ОтправитьИнформационноеСМСНаСервере(Знач НомерТелефона)
	
	УстановитьПривилегированныйРежим(Истина);
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона);
	НомераТелефонов = Новый Массив;
	НомераТелефонов.Добавить( "7" + НомерТелефона); 
	  
	РезультатОтправки = ОтправкаSMS.ОтправитьSMS(НомераТелефонов, "Для активации бонусного баланса перейдите по ссылке https://tg-alterra.ru/stroiklub/");
	 
	Если Не ПустаяСтрока(РезультатОтправки.ОписаниеОшибки) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОтправки.ОписаниеОшибки);
		Возврат;
	КонецЕсли;

	Если РезультатОтправки.ОтправленныеСообщения.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение отправлено!");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОтправки.ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПроверкаЗаполненияНаСервере(Отказ)
	
	Если Не Отказ И _ГруппыПартнеров = 2 Тогда // "Бригадиры"
		ПроверкаЗаполнения(
			ДопМодуль.ПолучитьЗначениеДополнительногоРеквизитаНаФорме(ЭтаФорма, "ВидДеятельности"),
			ПолучитьЭлементДополнительногоРеквизита("ВидДеятельности"),
			"'Вид деятельности'", 
			Отказ);
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверкаЗаполнения(Реквизит, Поле, НаименованиеРеквизита, Отказ)   
	Если Не Отказ И Не ЗначениеЗаполнено(Реквизит) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реквизит " + НаименованиеРеквизита + " не заполнен!", , Поле, , Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьКартуЛояльности(Команда)
	Если СозданиеВыполнено И ЗначениеЗаполнено(ПартнерВыбор) Тогда
		ОткрытьФорму(
			"Справочник.КартыЛояльности.Форма.ПомощникРегистрации", 
			Новый Структура("Партнер, Контрагент, Соглашение, Режим", ПартнерВыбор, КонтрагентВыбор, ВернутьСоглашениеПоГруппеПартнеров(), "РегистрацияНовойКартыЛояльности"), 
			ЭтаФорма,
			,
			,
			, 
			Новый ОписаниеОповещения("АктивироватьКартуЛояльностиЗавершение", ЭтаФорма), 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала необходимо записать данные!");
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция ВернутьСоглашениеПоГруппеПартнеров() 

	Если _ГруппыПартнеров = 1 Тогда // "Частные лица"
		Возврат Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Бонусные карты ТЗ");
	ИначеЕсли _ГруппыПартнеров = 2 Тогда // "Бригадиры"
		Возврат Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Бригадиры 5 ТЗ");
	ИначеЕсли _ГруппыПартнеров = 3 Тогда // "Сотрудники"
		Возврат Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Сотрудники ТЗ");
	КонецЕсли;

КонецФункции

&НаКлиенте 
Процедура АктивироватьКартуЛояльностиЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	ИнициализацияКартыЛояльности();
КонецПроцедуры

&НаСервере 
Процедура ИнициализацияКартыЛояльности() 
	КартаЛояльности = Справочники.КартыЛояльности.НайтиПоРеквизиту("Партнер", ПартнерВыбор);
	Если ЗначениеЗаполнено(КартаЛояльности) Тогда
		Элементы.АктивироватьКартуЛояльности.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПартнерскаяПрограммаПриИзменении(Элемент) 
	ПартнерскаяПрограммаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПартнерскаяПрограммаПриИзмененииНаСервере()
	
	Если ПартнерскаяПрограмма = 1 Тогда
		ПартнерскаяПрограммаПроверкиПриИзменении("Фирсова Слобода", "0А-00000075");
	ИначеЕсли ПартнерскаяПрограмма = 2 Тогда
		ПартнерскаяПрограммаПроверкиПриИзменении("Банк Открытие", "0А-00000074");
	Иначе
		ОчиститьПартнерскуюПрограмму();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьПартнерскуюПрограмму()      
	ПартнерскаяПрограмма = 0;
	КаналПервичногоИнтереса = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка();
	ИсточникПервичногоИнтереса = Неопределено;		
КонецПроцедуры

&НаСервере
Процедура ПартнерскаяПрограммаПроверкиПриИзменении(КаналПервичногоИнтереса_Наименование, ИсточникПервичногоИнтереса_Код)
	
	Если _ГруппыПартнеров <> 1 Тогда // "Частные лица"
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реквизит 'Группы партнеров' должен иметь значение 'Частные лица'!", , "_ГруппыПартнеров"); 
	Иначе
		КаналПервичногоИнтереса = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию(КаналПервичногоИнтереса_Наименование);
		Если ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
			ИсточникПервичногоИнтереса = Справочники.МаркетинговыеМероприятия.НайтиПоКоду(ИсточникПервичногоИнтереса_Код);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ОчиститьПартнерскуюПрограмму();
		
КонецПроцедуры

&НаКлиенте
Процедура Док_ГруппыПартнеровПриИзмененииПосле(Элемент)
	ГруппыПартнеровПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ГруппыПартнеровПриИзмененииСервер()
	Если _ГруппыПартнеров = 1 Тогда
		ДопМодуль.УстановитьЗначениеДополнительногоРеквизитаНаФорме(ЭтаФорма, "ГруппыПартнеров", Спр_НайтиПоНаименованию("Частные лица"));
		ДопМодуль.УстановитьЗначениеДополнительногоРеквизитаНаФорме(ЭтаФорма, "ВидДеятельности", Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка());
		ПолучитьЭлементДополнительногоРеквизита("ВидДеятельности").Доступность = Ложь;
		
		Элементы.ОтправитьСМС.Доступность = Истина;
		Элементы.ФормаРегистрацииЧЛ_ДопРеквизиты_Телефон_2.Доступность = Истина;
		
		Сегмент = СегментБонусы();
	ИначеЕсли _ГруппыПартнеров = 2 Тогда
		ДопМодуль.УстановитьЗначениеДополнительногоРеквизитаНаФорме(ЭтаФорма, "ГруппыПартнеров", Спр_НайтиПоНаименованию("Бригадиры"));
		ПолучитьЭлементДополнительногоРеквизита("ВидДеятельности").Доступность = Истина;
		ОчиститьПартнерскуюПрограмму();
		
		Элементы.ОтправитьСМС.Доступность = Истина;
		Элементы.ФормаРегистрацииЧЛ_ДопРеквизиты_Телефон_2.Доступность = Истина;
		
		Сегмент = СегментБригадиры();
	ИначеЕсли _ГруппыПартнеров = 3 Тогда
		ДопМодуль.УстановитьЗначениеДополнительногоРеквизитаНаФорме(ЭтаФорма, "ГруппыПартнеров", Спр_НайтиПоНаименованию("Сотрудники"));
		ДопМодуль.УстановитьЗначениеДополнительногоРеквизитаНаФорме(ЭтаФорма, "ВидДеятельности", Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка());
		ПолучитьЭлементДополнительногоРеквизита("ВидДеятельности").Доступность = Ложь;
		ОчиститьПартнерскуюПрограмму();   
		
		Элементы.ОтправитьСМС.Доступность = Ложь;
		Элементы.ФормаРегистрацииЧЛ_ДопРеквизиты_Телефон_2.Доступность = Ложь;
		
		Сегмент = СегментСотрудники();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ВыбратьПартнераПосле(Команда)
	Если СозданиеВыполнено И ЗначениеЗаполнено(ПартнерВыбор) Тогда
		Закрыть(ПартнерВыбор);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала необходимо записать данные!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементДополнительногоРеквизита(ИмяРеквизита)
	Возврат Элементы[ДопМодуль.ПолучитьПолеДополнительногоРеквизитаНаФорме(ЭтаФорма, ИмяРеквизита).ИмяРеквизитаЗначение];	
КонецФункции

#КонецОбласти

#Область Замены

&НаСервере
&После("ЗаполнитьРезультатыНайдено")
Процедура Спр_ЗаполнитьРезультатыНайдено(РезультатЗапроса, ПредставленияРеквизитов, РеквизитыИнформацииБезПоиска)
	Если ЭтоКомпания = 1 Тогда
		
		ЕстьДубли= Ложь;
		
		АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(ТелефонПартнераФизЛицо);
		Если ЗначениеЗаполнено(ТелефонПартнераФизЛицо) Тогда
			НайденыйПартнерПоТелефону= АльтерраОбщегоНазначения.ПолучитьПартнераПоТелефону(ТелефонПартнераФизЛицо);
			Если ЗначениеЗаполнено(НайденыйПартнерПоТелефону) Тогда
				АльтерраОбщегоНазначения.СообщитьПользователю(НайденыйПартнерПоТелефону, "По введенному телефону найден: "+НайденыйПартнерПоТелефону);
				ЕстьДубли= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресЭППартнераФизЛицо) Тогда
			НайденыйПартнерПоПочте= АльтерраОбщегоНазначения.ПолучитьПартнераПоПочте(АдресЭППартнераФизЛицо);	
			Если ЗначениеЗаполнено(НайденыйПартнерПоПочте) Тогда
				АльтерраОбщегоНазначения.СообщитьПользователю(НайденыйПартнерПоПочте, "По введенному телефону найден: "+НайденыйПартнерПоПочте);
				ЕстьДубли= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьДубли Тогда
			ДействиеПоРезультатамНайдено= 0;
			Элементы.ДействиеПоРезультатамНайдено.Доступность= Ложь;
			Элементы.ДействиеСКонтрагентом.Доступность= Ложь;
			Элементы.ДействиеПоРезультатамНайдено.Видимость= Ложь;
			Элементы.ДействиеСКонтрагентом.Видимость= Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&Вместо("ЗаписатьПартнераИСвязанныеДанные")
Процедура Док_ЗаписатьПартнераИСвязанныеДанные(СписокСозданных)
	
	Если ДействиеПоРезультатамНайдено <> 0 Тогда
		
		//Партнер
		ОбъектПартнер = Справочники.Партнеры.СоздатьЭлемент();
		ОбъектПартнер.Наименование                          = Название;
		ОбъектПартнер.Родитель                              = Родитель;
		ОбъектПартнер.БизнесРегион                          = БизнесРегион;
		ОбъектПартнер.ГруппаДоступа                         = ГруппаДоступа;
		ОбъектПартнер.ДатаРегистрации                       = ТекущаяДатаСеанса();
		ОбъектПартнер.Клиент                                = Клиент;
		ОбъектПартнер.Конкурент                             = Конкурент;
		ОбъектПартнер.Поставщик                             = Поставщик;
		// +Альтерра +
		ОбъектПартнер.Парсинг                               = Парсинг;
		ОбъектПартнер.ДатаПодтвержденияНомераТелефона = ТекущаяДата();
		ОбъектПартнер.СостояниеНомераТелефона = Перечисления.СостояниеНомераТелефона.Актуален;
		// -Альтерра +
		ОбъектПартнер.ОбслуживаетсяТорговымиПредставителями = ОбслуживаетсяТорговымиПредставителями;
		ОбъектПартнер.ПрочиеОтношения                       = ПрочиеОтношения;
		ОбъектПартнер.ОсновнойМенеджер                      = ОсновнойМенеджер;
		ОбъектПартнер.НаименованиеПолное                    = НаименованиеПартнера();
		ОбъектПартнер.ЮрФизЛицо                             = ТипЮрФизЛицаПартнера(ЭтоКомпания);
		ОбъектПартнер.Пол                                   = Пол;
		ОбъектПартнер.ДатаРождения                          = ДатаРождения;
		ОбъектПартнер.Перевозчик                            = Перевозчик;
		ОбъектПартнер.ВариантОтправкиЭлектронногоЧека       = ВариантОтправкиЭлектронногоЧека;
		
		// контактная информация партнера
		Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
			НоваяСтрокаКИ.Представление     = ФактическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей     = ФактическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение          = ЗначениеКонтактнойИнформацииJSONСервер("ФактическийАдресЗначенияПолей");
		КонецЕсли;
		
		Если ЭтоКомпания = 0 Тогда
			ИмяРеквизитаТелефон = "ТелефонПартнера";
			ИмяРеквизитаТелефонЗначенияПолей = "ТелефонПартнераЗначенияПолей";
			ИмяРеквизитаАдресЭП = "АдресЭППартнера";
		Иначе
			ИмяРеквизитаТелефон = "ТелефонПартнераФизЛицо";
			ИмяРеквизитаТелефонЗначенияПолей = "ТелефонПартнераФизЛицоЗначенияПолей";
			ИмяРеквизитаАдресЭП = "АдресЭППартнераФизЛицо";
		КонецЕсли;
		
		Если ЗначенияПолейВСписокЗначений(ЭтотОбъект[ИмяРеквизитаТелефонЗначенияПолей]).Количество()> 0 Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			НоваяСтрокаКИ.Представление     = ЭтотОбъект[ИмяРеквизитаТелефон];
			НоваяСтрокаКИ.ЗначенияПолей     = ЭтотОбъект[ИмяРеквизитаТелефонЗначенияПолей];
			НоваяСтрокаКИ.Значение          = ЗначениеКонтактнойИнформацииJSONСервер(ИмяРеквизитаТелефонЗначенияПолей);
			// +Альтерра +
			ДозаполнитьСтрокуТелефона(НоваяСтрокаКИ, ЭтотОбъект[ИмяРеквизитаТелефонЗначенияПолей]);
			// -Альтерра +
		КонецЕсли;
		
		Если Не ПустаяСтрока(ЭтотОбъект[ИмяРеквизитаАдресЭП]) Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
			НоваяСтрокаКИ.Представление     = ЭтотОбъект[ИмяРеквизитаАдресЭП];
			НоваяСтрокаКИ.Значение     		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
			НоваяСтрокаКИ.ЗначенияПолей     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрокаКИ.Значение, НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
			НоваяСтрокаКИ.АдресЭП           = ЭтотОбъект[ИмяРеквизитаАдресЭП];
			Поз = СтрНайти(ЭтотОбъект[ИмяРеквизитаАдресЭП], "@");
			Если Поз <> 0 Тогда
				НоваяСтрокаКИ.ДоменноеИмяСервера = Сред(ЭтотОбъект[ИмяРеквизитаАдресЭП], Поз+1);
			КонецЕсли;
		КонецЕсли;
		
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ПартнерОбъектДопРеквизиты);
		ОбъектПартнер.ДополнительныеРеквизиты.Загрузить(ПартнерОбъектДопРеквизиты.ДополнительныеРеквизиты.Выгрузить());
		// Конец СтандартныеПодсистемы.Свойства
		
		ОбъектПартнер.Записать();
		ПартнерВыбор = ОбъектПартнер.Ссылка;
		СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ПартнерВыбор), ОбъектПартнер.Наименование);
		
		// зафиксировать первичный интерес
		Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") И ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
		
			УстановитьПривилегированныйРежим(Истина);
			Запись = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьМенеджерЗаписи();
			Запись.Партнер                    = ПартнерВыбор;
			Запись.КаналПервичногоИнтереса    = КаналПервичногоИнтереса;
			Запись.ИсточникПервичногоИнтереса = ИсточникПервичногоИнтереса;
			Запись.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		
		КонецЕсли;
		
		//сегмент
		Если ЗначениеЗаполнено(Сегмент)
			И ЕстьПравоВключенияВСегмент
			И Сегмент.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда
			СегментыСервер.ДобавитьПартнераВСегмент(Сегмент, ПартнерВыбор);
		КонецЕсли;
		
		// Контактное лицо
		Если ЭтоКомпания = 0 И УказатьДанныеКонтактногоЛица И НЕ ПустаяСтрока(ФамилияКЛ) Тогда
		
			ОбъектКонтактноеЛицо = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
			ОбъектКонтактноеЛицо.Владелец               = ПартнерВыбор;
			ОбъектКонтактноеЛицо.ДатаРегистрацииСвязи   = ТекущаяДатаСеанса();
			ОбъектКонтактноеЛицо.Наименование           = ФИО_ОднойСтрокой(ФамилияКЛ, ИмяКЛ, ОтчествоКЛ);
			ОбъектКонтактноеЛицо.Автор                  = Пользователи.ТекущийПользователь();
			Если Не Роль.Пустая() Тогда
				СтрокаРоли = ОбъектКонтактноеЛицо.РолиКонтактногоЛица.Добавить();
				СтрокаРоли.РольКонтактногоЛица = Роль;
			КонецЕсли;
			
			Если Не ПустаяСтрока(АдресЭПКЛ) Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = АдресЭПКЛ;
				НоваяСтрокаКИ.Значение		    = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
				НоваяСтрокаКИ.ЗначенияПолей     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрокаКИ.Значение, НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
				НоваяСтрокаКИ.АдресЭП           = АдресЭПКЛ;
				Поз = СтрНайти(АдресЭПКЛ, "@");
				Если Поз <> 0 Тогда
					НоваяСтрокаКИ.ДоменноеИмяСервера = Сред(АдресЭПКЛ, Поз+1);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначенияПолейВСписокЗначений(ТелефонКЛЗначенияПолей).Количество()> 0 Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = ТелефонКЛ;
				НоваяСтрокаКИ.ЗначенияПолей     = ТелефонКЛЗначенияПолей;
				НоваяСтрокаКИ.Значение          = ЗначениеКонтактнойИнформацииJSONСервер("ТелефонКЛЗначенияПолей");
				// +Альтерра +
				ДозаполнитьСтрокуТелефона(НоваяСтрокаКИ, ТелефонКЛЗначенияПолей);
				// -Альтерра +
			КонецЕсли;
			
			Если ЗначенияПолейВСписокЗначений(МобильныйТелефонКЛЗначенияПолей).Количество()> 0 Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = МобильныйТелефонКЛ;
				НоваяСтрокаКИ.ЗначенияПолей     = МобильныйТелефонКЛЗначенияПолей;
				НоваяСтрокаКИ.Значение          = ЗначениеКонтактнойИнформацииJSONСервер("МобильныйТелефонКЛЗначенияПолей");
				// +Альтерра +
				ДозаполнитьСтрокуТелефона(НоваяСтрокаКИ, МобильныйТелефонКЛЗначенияПолей);
				// -Альтерра +
			КонецЕсли;
			
			ОбъектКонтактноеЛицо.Записать();
			СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ОбъектКонтактноеЛицо.Ссылка), ОбъектКонтактноеЛицо.Наименование);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Контрагент
	Если ИспользуютсяТолькоПартнеры Или (ДействиеСКонтрагентом = 1 И НЕ НаОснованииКонтрагента И УказыватьЮридическиеРеквизиты) Тогда
		
		ОбъектКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		ОбъектКонтрагент.Наименование          = ?(ИспользуютсяТолькоПартнеры, Название, НаименованиеКонтрагента());
		ОбъектКонтрагент.ЮрФизЛицо             = ПартнерыИКонтрагентыЛокализацияКлиентСервер.ТипЮрФизЛицаКонтрагента(ЭтоКомпания, ВидКомпании);
		ОбъектКонтрагент.Партнер               = ПартнерВыбор;
		ОбъектКонтрагент.СтранаРегистрации     = СтранаРегистрации;
		ОбъектКонтрагент.НаименованиеПолное    = ?(ЭтоКомпания = 0,ПолноеЮридическоеНаименование,ФИО_ОднойСтрокой(ФамилияПартнера, ИмяПартнера, ОтчествоПартнера));
		ОбъектКонтрагент.РегистрационныйНомер  = ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, РегистрационныйНомер, "");
		ОбъектКонтрагент.НалоговыйНомер        = ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, НалоговыйНомер, "");
		
		ОбъектКонтрагент.ИсторияНаименований.Загрузить(ИсторияНаименований.Выгрузить());
		ПартнерыИКонтрагентыЛокализация.ДополнитьДанныеКонтрагентаПриЗаписи(ОбъектКонтрагент, ЭтотОбъект);
		
		// контактная информация контрагента
		Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			НоваяСтрокаКИ.Представление = ФактическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей = ФактическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ФактическийАдресЗначенияПолей");
			
			Если ЭтоКомпания = 1
				И ЮрАдресКонтрагентаОбязателен Тогда
				
				НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
				НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
				НоваяСтрокаКИ.Представление = ФактическийАдрес;
				НоваяСтрокаКИ.ЗначенияПолей = ФактическийАдресЗначенияПолей;
				НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ФактическийАдресЗначенияПолей");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИсторияКонтактнойИнформации.Количество() > 0 Тогда
			ПартнерыИКонтрагенты.ВключитьХранениеИсторииИзменений("ЮрАдресКонтрагента");
			ИсторияКонтактнойИнформации[0].Дата = Неопределено;
			УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ОбъектКонтрагент, ИсторияКонтактнойИнформации);
		ИначеЕсли НЕ ПустаяСтрока(ЮридическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
			НоваяСтрокаКИ.Представление = ЮридическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей = ЮридическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ЮридическийАдресЗначенияПолей");
		КонецЕсли;
		
		Если ЭтоКомпания = 0 И НЕ ПустаяСтрока(ТелефонПартнера) Тогда
			
			Если ИспользуютсяТолькоПартнеры Тогда
			
				НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				НоваяСтрокаКИ.Представление = ТелефонПартнера;
				НоваяСтрокаКИ.ЗначенияПолей = ТелефонПартнераЗначенияПолей;
				НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ТелефонПартнераЗначенияПолей");
				// +Альтерра +
				ДозаполнитьСтрокуТелефона(НоваяСтрокаКИ, ТелефонПартнераЗначенияПолей);
				// -Альтерра +
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если ЭтоКомпания = 1 И НЕ ПустаяСтрока(ТелефонПартнераФизЛицо) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			НоваяСтрокаКИ.Представление = ТелефонПартнераФизЛицо;
			НоваяСтрокаКИ.ЗначенияПолей = ТелефонПартнераФизЛицоЗначенияПолей;
			НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ТелефонПартнераФизЛицоЗначенияПолей");
			// +Альтерра +
			ДозаполнитьСтрокуТелефона(НоваяСтрокаКИ, ТелефонПартнераФизЛицоЗначенияПолей);
			// -Альтерра +
		КонецЕсли;
		
		// головной контрагент
		Если ЭтоКомпания = 0 И ВидКомпании = 3 Тогда
			
			ОбъектКонтрагент.ОбособленноеПодразделение = Истина;
			
			Если ИспользуютсяТолькоПартнеры Или ВыбратьГоловногоКонтрагента = 0 Тогда
				ОбъектКонтрагент.ГоловнойКонтрагент = ГоловнойКонтрагент;
			ИначеЕсли ВыбратьГоловногоКонтрагента = 1 Тогда
				
				ОбъектГоловнойКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
				
				ОбъектГоловнойКонтрагент.Наименование       = НаименованиеГоловнойКонтрагент;
				ОбъектГоловнойКонтрагент.НаименованиеПолное = ПолноеНаименованиеГоловногоКонтрагента;
				ОбъектГоловнойКонтрагент.ЮрФизЛицо          = Перечисления.ЮрФизЛицо.ЮрЛицо;
				ПартнерыИКонтрагентыЛокализация.ДополнитьДанныеГоловногоКонтрагентаПриЗаписи(ОбъектГоловнойКонтрагент, ЭтотОбъект);
				
				ОбъектГоловнойКонтрагент.Партнер = ?(ЗначениеЗаполнено(ПартнерГоловногоКонтрагента),
					ПартнерГоловногоКонтрагента, ПартнерВыбор);
				
				// контактная информация головного контрагента
				Если НЕ ПустаяСтрока(ФактическийАдресГоловногоКонтрагента) Тогда
					НоваяСтрокаКИ = ОбъектГоловнойКонтрагент.КонтактнаяИнформация.Добавить();
					НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
					НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
					НоваяСтрокаКИ.Представление = ФактическийАдресГоловногоКонтрагента;
					НоваяСтрокаКИ.ЗначенияПолей = ФактическийАдресГоловногоКонтрагентаЗначенияПолей;
					НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ФактическийАдресГоловногоКонтрагентаЗначенияПолей");
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ЮридическийАдресГоловногоКонтрагента) Тогда
					НоваяСтрокаКИ = ОбъектГоловнойКонтрагент.КонтактнаяИнформация.Добавить();
					НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
					НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
					НоваяСтрокаКИ.Представление = ЮридическийАдресГоловногоКонтрагента;
					НоваяСтрокаКИ.ЗначенияПолей = ЮридическийАдресГоловногоКонтрагентаЗначенияПолей;
					НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ЮридическийАдресГоловногоКонтрагентаЗначенияПолей");
				КонецЕсли;
				
				ОбъектГоловнойКонтрагент.Записать();
				СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ОбъектГоловнойКонтрагент.Ссылка), ОбъектГоловнойКонтрагент.Наименование);
				ОбъектКонтрагент.ГоловнойКонтрагент = ОбъектГоловнойКонтрагент.Ссылка;
				
				// банковский счет головного контрагента
				Если УказатьБанковскийСчетГоловногоКонтрагента Тогда
					
					Валютный = (ВалютаДенежныхСредствГоловнойКонтрагент <> ВалютаРеглУчета);
					
					БанковскийСчет = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
					БанковскийСчет.Владелец = ОбъектГоловнойКонтрагент.Ссылка;
					БанковскийСчет.Наименование = АвтоНаименованиеБанковскогоСчета(
						НомерСчетаГоловнойКонтрагент, БанкГоловнойКонтрагент, ВалютаДенежныхСредствГоловнойКонтрагент);
					БанковскийСчет.ВалютаДенежныхСредств = ВалютаДенежныхСредствГоловнойКонтрагент;
					БанковскийСчет.НомерСчета = НомерСчетаГоловнойКонтрагент;
					БанковскийСчет.Банк = БанкГоловнойКонтрагент;
					БанковскийСчет.БанкДляРасчетов = БанкДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.СчетВБанкеДляРасчетов = СчетВБанкеДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.ИностранныйБанк = ИностранныйБанкГоловнойКонтрагент;
					БанковскийСчет.РучноеИзменениеРеквизитовБанка = СпособУказанияБанкаГоловнойКонтрагент = "РучноеЗаполнениеРеквизитов";
					БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = СпособУказанияБанкаДляРасчетовГоловнойКонтрагент = "РучноеЗаполнениеРеквизитов";
					БанковскийСчет.БИКБанка = БИКБанкаГоловнойКонтрагент;
					БанковскийСчет.КоррСчетБанка = КоррСчетБанкаГоловнойКонтрагент;
					БанковскийСчет.БИКБанкаДляРасчетов = БИКБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.НаименованиеБанка = НаименованиеБанкаГоловнойКонтрагент;
					БанковскийСчет.НаименованиеБанкаДляРасчетов = НаименованиеБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.АдресБанка = АдресБанкаГоловнойКонтрагент;
					БанковскийСчет.АдресБанкаДляРасчетов = АдресБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.СВИФТБанка = СВИФТБанкаГоловнойКонтрагент;
					БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.КоррСчетБанкаДляРасчетов = КоррСчетБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.НаименованиеБанкаМеждународное = НаименованиеБанкаМеждународноеГоловнойКонтрагент;
					БанковскийСчет.ГородБанкаМеждународный = ГородБанкаМеждународныйГоловнойКонтрагент;
					БанковскийСчет.АдресБанкаМеждународный = АдресБанкаМеждународныйГоловнойКонтрагент;
					БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.ЭтоIBAN = ЭтоIBANГоловнойКонтрагент;
					БанковскийСчет.НаименованиеБанкаДляРасчетовМеждународное = НаименованиеБанкаДляРасчетовМеждународноеГоловнойКонтрагент;
					БанковскийСчет.СтранаБанкаДляРасчетов = СтранаБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.ГородБанкаДляРасчетов = ГородБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.ГородБанкаДляРасчетовМеждународный = ГородБанкаДляРасчетовМеждународныйГоловнойКонтрагент;
					БанковскийСчет.АдресБанкаДляРасчетовМеждународный = АдресБанкаДляРасчетовМеждународныйГоловнойКонтрагент;
					
					БанковскийСчет.Записать();
					СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(БанковскийСчет.Ссылка), БанковскийСчет.Наименование);
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		ОбъектКонтрагент.Записать();
		КонтрагентВыбор = ОбъектКонтрагент.Ссылка;
		СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(КонтрагентВыбор), ОбъектКонтрагент.Наименование);
		
		// банковский счет
		Если УказатьБанковскийСчетКонтрагента Тогда
			
			Валютный = (ВалютаДенежныхСредств <> ВалютаРеглУчета);
			
			БанковскийСчет = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
			БанковскийСчет.Владелец = КонтрагентВыбор;
			БанковскийСчет.Наименование = АвтоНаименованиеБанковскогоСчета(НомерСчета, Банк, ВалютаДенежныхСредств);
			БанковскийСчет.ВалютаДенежныхСредств = ВалютаДенежныхСредств;
			БанковскийСчет.НомерСчета = НомерСчета;
			БанковскийСчет.Банк = Банк;
			БанковскийСчет.БанкДляРасчетов = БанкДляРасчетов;
			БанковскийСчет.СчетВБанкеДляРасчетов = СчетВБанкеДляРасчетов;
			БанковскийСчет.ИностранныйБанк = ИностранныйБанк;
			БанковскийСчет.РучноеИзменениеРеквизитовБанка = СпособУказанияБанка = "РучноеЗаполнениеРеквизитов";
			БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = СпособУказанияБанкаДляРасчетов = "РучноеЗаполнениеРеквизитов";
			БанковскийСчет.БИКБанка = БИКБанка;
			БанковскийСчет.КоррСчетБанка = КоррСчетБанка;
			БанковскийСчет.БИКБанкаДляРасчетов = БИКБанкаДляРасчетов;
			БанковскийСчет.НаименованиеБанка = НаименованиеБанка;
			БанковскийСчет.СтранаБанка = СтранаБанка;
			БанковскийСчет.ГородБанка = ГородБанка;
			БанковскийСчет.НаименованиеБанкаДляРасчетов = НаименованиеБанкаДляРасчетов;
			БанковскийСчет.АдресБанка = АдресБанка;
			БанковскийСчет.АдресБанкаДляРасчетов = АдресБанкаДляРасчетов;
			БанковскийСчет.СВИФТБанка = СВИФТБанка;
			БанковскийСчет.НаименованиеБанкаМеждународное = НаименованиеБанкаМеждународное;
			БанковскийСчет.ГородБанкаМеждународный = ГородБанкаМеждународный;
			БанковскийСчет.АдресБанкаМеждународный = АдресБанкаМеждународный;
			БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетов;
			БанковскийСчет.КоррСчетБанкаДляРасчетов = КоррСчетБанкаДляРасчетов;
			БанковскийСчет.ЭтоIBAN = ЭтоIBAN;
			БанковскийСчет.НаименованиеБанкаДляРасчетовМеждународное = НаименованиеБанкаДляРасчетовМеждународное;
			БанковскийСчет.СтранаБанкаДляРасчетов = СтранаБанкаДляРасчетов;
			БанковскийСчет.ГородБанкаДляРасчетов = ГородБанкаДляРасчетов;
			БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетов;
			БанковскийСчет.ГородБанкаДляРасчетовМеждународный = ГородБанкаДляРасчетовМеждународный;
			БанковскийСчет.АдресБанкаДляРасчетовМеждународный = АдресБанкаДляРасчетовМеждународный;
			
			БанковскийСчет.Записать();
			СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(БанковскийСчет.Ссылка), БанковскийСчет.Наименование);
			
		КонецЕсли;
		
		Если ЭтоКомпания = 1 И УказыватьЮридическиеРеквизиты И УказатьДокументУдостоверяющийЛичность Тогда
			
			МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Активность                               = Истина;
			МенеджерЗаписи.Период                                   = ТекущаяДатаСеанса();
			МенеджерЗаписи.Физлицо                                  = КонтрагентВыбор;
			МенеджерЗаписи.ВидДокумента                             = ВидДокумента;
			МенеджерЗаписи.Серия                                    = СерияДокумента;
			МенеджерЗаписи.Номер                                    = НомерДокумента;
			МенеджерЗаписи.ДатаВыдачи                               = ДатаВыдачи;
			МенеджерЗаписи.СрокДействия                             = СрокДействия;
			МенеджерЗаписи.КемВыдан                                 = КемВыданДокумент;
			МенеджерЗаписи.КодПодразделения                         = КодПодразделения;
			МенеджерЗаписи.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		ПартнерыИКонтрагентыЛокализация.ПривязатьОбособленныеПодразделения(ЭтотОбъект);
	КонецЕсли;
	
	Если НаОснованииКонтрагента И ЗначениеЗаполнено(КонтрагентОснование) Тогда
		
		ВыполнитьЗаписьКонтрагентаОснование(ПартнерВыбор, КонтрагентОснование);
		
	КонецЕсли;
	
	СозданиеВыполнено = Истина;
	
	СегментыСервер.ПроверитьВхождениеПартнераВСегментыПриСоздании(ПартнерВыбор);
	
	// +Альтерра +
	Если СписокСозданных.Количество() > 0 Тогда
		
		Если Сегмент = СегментБонусы() и ЭтоКомпания = 1 Тогда
			СегментыСервер.ДобавитьПартнераВСегмент(СегментАкцииЧЛ(), ПартнерВыбор);
		КонецЕсли;  
		//Добавить МАП
		Если ЗначениеЗаполнено(МАП) Тогда
			ТекПартнер = ПартнерВыбор.Ссылка.ПолучитьОбъект();
			ТекПартнер.МАП = МАП;	
			Попытка
				ТекПартнер.Записать();
			Исключение
				Сообщить("Ошибка создания элемента справочника "+ПартнерВыбор.Ссылка);
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ИсточникПервичногоИнтереса) Тогда
		БонусыАльтерра.УстановитьСтатусПоМаркетинговомуМероприятию(ПартнерВыбор, ИсточникПервичногоИнтереса);
	КонецЕсли;
	// -Альтерра +
	  
КонецПроцедуры

&НаСервере
&После("СоздатьПартнера")
Процедура Спр_СоздатьПартнера(СписокСозданных, ТребуетсяПереходНаСтраницуСовпадений)
	Для Каждого Элемент Из СписокСозданных Цикл
		НовыйОъектОписание = ПолучитьСсылкуИзНавигационной(Элемент.Значение);
		Если НовыйОъектОписание.ПредставлениеТипа = "Справочник.Партнеры" И ТребуетсяОтправкаПрезентацииПартнеру(НовыйОъектОписание.Ссылка) Тогда
			ОтправкаПрезентации(НовыйОъектОписание.Ссылка);
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#Область ОтправкаПрезентации
&НаСервере
Функция ПолучитьСсылкуИзНавигационной(НС)
    ПерваяТочка = Найти(НС, "e1cib/data/");
    ВтораяТочка = Найти(НС, "?ref=");
    ПредставлениеТипа   = Сред(НС, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НС, ВтораяТочка + 5));
    Ссылка = ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	ОбъектОписание = Новый Структура;
	ОбъектОписание.Вставить("ПредставлениеТипа", ПредставлениеТипа);
	ОбъектОписание.Вставить("Ссылка", Ссылка);
	Возврат ОбъектОписание;
КонецФункции  

&НаСервере
Функция ТребуетсяОтправкаПрезентацииПартнеру(ПартнерСсылка)
	Если ПартнерСсылка.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
		Для Каждого ДопСвойсто Из ПартнерСсылка.ДополнительныеРеквизиты Цикл
			Если ДопСвойсто.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Тип покупателя") Тогда
				ТипПокупателяПредставление = Строка(ДопСвойсто.Значение);
				Если ТипПокупателяПредставление = "конечный потребитель" ИЛИ ТипПокупателяПредставление = "строительная" Тогда
					Возврат Истина;
				КонецЕсли;	
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ОтправкаПрезентации(ТекущийОбъект)
	ТекстСообщения = "";
	Ошибка=Ложь;
	ТекстОшибки="";
	Попытка		
		ТекстСообщения="Не удалось получить e-mail для отправки презентации партнеру";
		EmailПартнера = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		ТекущийОбъект, Справочники.ВидыКонтактнойИнформации.EmailПартнера, ТекущаяДата(), Истина);
		
		ТекстСообщения="Не удалось получить данные учётной записи для отправки сообщения с презентацией";
		ТекПользовательСсылка = Пользователи.ТекущийПользователь();
		УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты
		.НайтиПоРеквизиту("ВладелецУчетнойЗаписи", ТекПользовательСсылка);
		Если УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка() Тогда
			УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		КонецЕсли;
		
		ТекстСообщения = "Не удалось создать письмо для отправки презентации";
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию("Презентация Альтерра");	
		
		Файлы = Новый Массив;
		РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ШаблонСсылка, Файлы);
		
		ПараметрыОтправки = Новый Структура;
		ПараметрыОтправки.Вставить("Кому", EmailПартнера);
		ПараметрыОтправки.Вставить("Тема", ШаблонСсылка.ТемаПисьма);
		ПараметрыОтправки.Вставить("Кодировка", КодировкаТекста.UTF8 );
		ПараметрыОтправки.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками);
		ПараметрыОтправки.Вставить("ОбрабатыватьТексты", Ложь);
		
		Вложения = Новый Массив();
		
		Для Каждого Файл Из Файлы Цикл
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Файл);
			ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(Файл);
			Если ДанныеФайла.ИмяФайла = "index.html" Тогда
				ПараметрыОтправки.Вставить("Тело", ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеФайла, КодировкаТекста.UTF8));
			Иначе
				ОписаниеВложения = Новый Структура;
				ОписаниеВложения.Вставить("Представление", ДанныеФайла.ИмяФайла);
				ОписаниеВложения.Вставить("АдресВоВременномХранилище", ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
				ОписаниеВложения.Вставить("Идентификатор", ДанныеФайла.ИмяФайла);
				ОписаниеВложения.Вставить("Имя", ДанныеФайла.ИмяФайла);
				Вложения.Добавить(ОписаниеВложения);			 
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОтправки.Вставить("Вложения", Вложения);
		
		ТекстСообщения = "Не удалось отправить презентацию партнеру на email " + Строка(EmailПартнера); 
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗаписьОтправителя, ПараметрыОтправки);
		ТекстСообщения = "Партнеру отправлена презентация на email " + EmailПартнера;
	Исключение
		Ошибка = Истина;
		ТекстСообщения = ТекстСообщения + ". Информация для тех.специалистов в журнале регистрации по событию ""СозданиеПартнера""";
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	Сообщить(ТекстСообщения);
	Если Ошибка Тогда
		ЗаписьЖурналаРегистрации("СозданиеПартнера", УровеньЖурналаРегистрации.Ошибка, ТекущийОбъект, ТекстСообщения, ТекстОшибки);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура ДозаполнитьСтрокуТелефона(СтрокаКИ, ЗначенияПолей)
	
	ДанныеТелефона = УправлениеКонтактнойИнформацией.СведенияОТелефоне(ЗначенияПолей);
	СтрокаКИ.НомерТелефонаБезКодов = ДанныеТелефона.НомерТелефона;
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(ДанныеТелефона.КодСтраны);
	МассивСтрок.Добавить(ДанныеТелефона.КодГорода);
	МассивСтрок.Добавить(ДанныеТелефона.НомерТелефона);
	СтрокаКИ.НомерТелефона = СтрСоединить(МассивСтрок);
	
КонецПроцедуры

#КонецОбласти

//Светлакова
&НаКлиенте
Процедура Спр_ЭтоКомпанияПриИзмененииПосле(Элемент)
	Если ЭтоКомпания = 1 Тогда
	   УказыватьЮридическиеРеквизиты = Истина;
	    ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДанныеКонтрагентаЧастноеЛицо",
	    		"Доступность", УказыватьЮридическиеРеквизиты, Истина);
	    	Если УказыватьЮридическиеРеквизиты Тогда
	    		УстановитьДоступностьДанныхДокументаФизлица(ЭтотОбъект);
	    	КонецЕсли;
        Элементы.ИННПартнерФизЛицо.Видимость = Ложь;
		Сегмент = СегментБонусы();
	КонецЕсли;    
	
	Если ДопМодульКлиентСервер.ЕстьПарсинг(ПолноеНаименование) Тогда 
		ПолноеНаименование = АльтерраОбщегоНазначения.СтрЗаменить_(ПолноеНаименование, "(ПАРСИНГ)");
	КонецЕсли;
	
	Если ДопМодульКлиентСервер.ЕстьПарсинг(Название) Тогда 
		Название = АльтерраОбщегоНазначения.СтрЗаменить_(Название, "(ПАРСИНГ)");
	КонецЕсли;      
	
	ОчиститьФлажки();
КонецПроцедуры

//&НаСервере
//Процедура ВключитьВСегменты ()
//	Если Сегмент.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда
//	    СегментыСервер.ДобавитьПартнераВСегмент(Сегмент, ПартнерВыбор);
//	КонецЕсли; 
//КонецПроцедуры;	
&НаСервере
Функция СегментБонусы()
	Возврат Справочники.СегментыПартнеров.НайтиПоКоду("0А-00000003");	
КонецФункции

&НаСервере
Функция СегментСотрудники()
	Возврат Справочники.СегментыПартнеров.НайтиПоКоду("0А-00000002");	
КонецФункции 

&НаСервере
Функция СегментБригадиры()
	Возврат Справочники.СегментыПартнеров.НайтиПоКоду("0А-00000065");	
КонецФункции 

&НаСервере
Функция СегментАкцииЧЛ()
	Возврат Справочники.СегментыПартнеров.НайтиПоКоду("0А-00000010");
КонецФункции  

&НаСервере
Функция ЧЛИлиСотр(_ГруппаПартнеров)
 Если СокрЛП(_ГруппаПартнеров.Наименование) = "Сотрудники" или СокрЛП(_ГруппаПартнеров.Наименование) = "Частные лица" Тогда
  Возврат 1;
 Иначе	
  Возврат 0;
 КонецЕсли; 
КонецФункции  

&НаКлиенте
Процедура Спр__ГруппаПартнеровПриИзмененииПосле(Элемент)

//	Если ЧЛИлиСотр(_ГруппаПартнеров) = 1 и ЭтоКомпания = 1 Тогда
//	   Элементы._ТипПокупателя.Видимость = Ложь;
//	Иначе	
//	   Элементы._ТипПокупателя.Видимость = Истина;
//	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Док_АдресЭПКЛПриИзмененииПосле(Элемент)
	если ЭтоКомпания <> 1 и не значениезаполнено(АдресЭППартнера) и значениезаполнено(АдресЭПКЛ) тогда
		АдресЭППартнера=АдресЭПКЛ;
	конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТелефонКЛПриИзмененииПосле(Элемент)
		если ЭтоКомпания <> 1 и не значениезаполнено(ТелефонПартнера) и значениезаполнено(ТелефонКЛ) тогда
		ТелефонПартнера=ТелефонКЛ;
	конецесли;	

КонецПроцедуры

&НаКлиенте
&После("ПерейтиНаФинальнуюСтраницу")
Процедура Док_ПерейтиНаФинальнуюСтраницу()
	//Проверка вхождения в сегмент запрет продаж
	ПараметрыПроверки= Новый Структура;
	ПараметрыПроверки.Вставить("Наименование", Название);
	ПараметрыПроверки.Вставить("НаименованиеПолное", ПолноеНаименование);
	ПараметрыПроверки.Вставить("Почта", ?(ПустаяСтрока(АдресЭППартнераФизЛицо), АдресЭППартнера, АдресЭППартнераФизЛицо));
	ПараметрыПроверки.Вставить("Телефон", ?(ПустаяСтрока(ТелефонПартнераФизЛицо), ТелефонПартнера, ТелефонПартнераФизЛицо));
	ПараметрыПроверки.Вставить("Адрес", ?(ПустаяСтрока(ФактическийАдрес), ЮридическийАдрес, ФактическийАдрес));

	мОтветов= ПроверитьПоСегментуЗапретОтгрузки(ПараметрыПроверки);
	Для Каждого Ответ Из мОтветов Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Найден похожий клиент ""%1"" в сегменте ""Запрет отгрузки"" %2", Ответ.Партнер, Ответ.Проверка), Ответ.Партнер);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПроверитьПоСегментуЗапретОтгрузки(Параметры)
	Возврат Справочники.Партнеры.ПроверитьПоСегментуЗапретОтгрузки("", Параметры);
КонецФункции

&НаСервере
&После("ПриСозданииНовогоРозничногоПокупателя")
Процедура Док_ПриСозданииНовогоРозничногоПокупателя()

	Элементы.ГруппаЧастноеЛицоКонтрагент.Видимость = Истина;
	УказыватьЮридическиеРеквизиты = Истина;

КонецПроцедуры

//+Альтерра
&НаСервере
Функция ЕстьПартнерЧастноеЛицоСТакимТелефономНаСервере(ЭтотПартнер, Отказ, ТелефонПартнера);
	Возврат Справочники.Партнеры.ЕстьПартнерЧастноеЛицоСТакимТелефоном(ЭтотПартнер, Отказ, ТелефонПартнера);	
КонецФункции
//-

&НаКлиенте
Процедура Док_ПарсингПриИзмененииПосле(Элемент)
	
	Если Парсинг Тогда
		Если Клиент Тогда
			Парсинг = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отметки 'Клиент' и 'Парсинг' не могут быть выбраны одновремено");
		ИначеЕсли ЭтоКомпания <> 0 Тогда  
			Парсинг = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для парсинга необходимо выбрать флажок 'Компания', а не 'Частное лицо'!");
		ИначеЕсли Не ДопМодульКлиентСервер.ЕстьПарсинг(Название) Тогда
			Парсинг = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рабочее наименование должно содержать слово '(Парсинг)'!");
		ИначеЕсли Не ДопМодульКлиентСервер.ЕстьПарсинг(ПолноеНаименование) Тогда
			Парсинг = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Публичное наименование должно содержать слово '(Парсинг)'!");
		КонецЕсли; 
	Иначе
		Если ДопМодульКлиентСервер.ЕстьПарсинг(ПолноеНаименование) Тогда
			Парсинг = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Публичное наименование содержит слово '(Парсинг)', флажок нельзя убрать!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_КлиентПриИзмененииПосле(Элемент)  
	
	Если Клиент И Парсинг Тогда
		Клиент = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отметки 'Клиент' и 'Парсинг' не могут быть выбраны одновремено");
	КонецЕсли;      
	
КонецПроцедуры

&НаКлиенте
&Вместо("ПервичнаяИнформацияЗаполненаНеправильно")
Функция Док_ПервичнаяИнформацияЗаполненаНеправильно()
	Отказ = Ложь;
	ОчиститьСообщения();           
	
	Если ЭтоКомпания = 0 Тогда
		Если ИспользуютсяТолькоПартнеры Тогда
			Если ПустаяСтрока(ПолноеЮридическоеНаименование) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано сокращенное юр. наименование партнера'"), ИспользуютсяТолькоПартнеры, "ПолноеЮридическоеНаименование");
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Если ПустаяСтрока(ПолноеНаименование) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано публичное наименование партнера'"), ИспользуютсяТолькоПартнеры, "ПолноеНаименование");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;		
	ИначеЕсли ЭтоКомпания = 1 Тогда
		Если ПустаяСтрока(ФамилияПартнера) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано фамилия партнера'"), ИспользуютсяТолькоПартнеры, "ФамилияПартнера");
			Отказ = Истина;
		КонецЕсли;
		Если ПустаяСтрока(ИмяПартнера) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано имя партнера'"), ИспользуютсяТолькоПартнеры, "ИмяПартнера");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	ОбязательностьКонтактнойИнформацииОтработана = Ложь;
	
	Если ЭтоКомпания = 0 Тогда
		
		Если АдресЭППартнераОбязателен
			И Не ЗначениеЗаполнено(АдресЭППартнера) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать адрес электронной почты партнера'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнера");
			Отказ = Истина;
			ОбязательностьКонтактнойИнформацииОтработана = Истина;
			
		КонецЕсли;
		
		Если ТелефонПартнераОбязателен
			И Не ЗначениеЗаполнено(ТелефонПартнера) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать телефон партнера'"),ИспользуютсяТолькоПартнеры, "ТелефонПартнера");
			Отказ = Истина;
			ОбязательностьКонтактнойИнформацииОтработана = Истина;
			
		КонецЕсли;
		
		Если УказатьДанныеКонтактногоЛица Тогда
			
			Если АдресЭПКонтактногоЛицаОбязателен
				И Не ЗначениеЗаполнено(АдресЭПКЛ) Тогда
				
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать адрес электронной почты контактного лица'"), ИспользуютсяТолькоПартнеры, "АдресЭПКЛ");
				Отказ = Истина;
				ОбязательностьКонтактнойИнформацииОтработана = Истина;
				
			КонецЕсли;
			
			Если ТелефонКонтактногоЛицаОбязателен 
				И Не ЗначениеЗаполнено(ТелефонКЛ) Тогда
				
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать телефон контактного лица'"), ИспользуютсяТолькоПартнеры, "ТелефонКЛ");
				Отказ = Истина;
				ОбязательностьКонтактнойИнформацииОтработана = Истина;
				
			КонецЕсли;
			
			Если МобильныйТелефонКонтактногоЛицаОбязателен 
				И Не ЗначениеЗаполнено(МобильныйТелефонКЛ) Тогда
				
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать мобильный телефон контактного лица'"), ИспользуютсяТолькоПартнеры, "МобильныйТелефонКЛ");
				Отказ = Истина;
				ОбязательностьКонтактнойИнформацииОтработана = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ОбязательностьКонтактнойИнформацииОтработана И Не Парсинг 
			И ПустаяСтрока(АдресЭППартнера)
			И ПустаяСтрока(ТелефонПартнера) Тогда
			
			Если (УказатьДанныеКонтактногоЛица) Тогда
				
				Если ПустаяСтрока(ТелефонКЛ) И ПустаяСтрока(МобильныйТелефонКЛ) И ПустаяСтрока(АдресЭПКЛ) Тогда
					
					ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать хотя бы одно значение контактной информации'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнера");
					Отказ = Истина;
					
				КонецЕсли;
				
			Иначе
				
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать хотя бы одно значение контактной информации'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнера");
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если АдресЭППартнераОбязателен
			И Не ЗначениеЗаполнено(АдресЭППартнераФизЛицо) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать адрес электронной почты партнера'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнераФизЛицо");
			Отказ = Истина;
			ОбязательностьКонтактнойИнформацииОтработана = Истина;
			
		КонецЕсли;
		
		Если ТелефонПартнераОбязателен
			И Не ЗначениеЗаполнено(ТелефонПартнераФизЛицо) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать телефон партнера'"),ИспользуютсяТолькоПартнеры, "ТелефонПартнераФизЛицо");
			Отказ = Истина;
			ОбязательностьКонтактнойИнформацииОтработана = Истина;
			
		КонецЕсли;
		
		Если Не ОбязательностьКонтактнойИнформацииОтработана
			И ПустаяСтрока(АдресЭППартнераФизЛицо) И ПустаяСтрока(ТелефонПартнераФизЛицо) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать хотя бы одно значение контактной информации'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнераФизЛицо");
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УказыватьЮридическиеРеквизиты Тогда
		
		Если Не ИспользуютсяТолькоПартнеры И ЭтоКомпания = 0 Тогда
			Если ПустаяСтрока(ПолноеЮридическоеНаименование) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано сокращенное юр. наименование'"),ИспользуютсяТолькоПартнеры, "НаименованиеКонтрагента");
				Отказ = Истина; 
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоКомпания = 1 И УказыватьЮридическиеРеквизиты И УказатьДокументУдостоверяющийЛичность Тогда
			Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано вид документа удостоверяющего личность'"),ИспользуютсяТолькоПартнеры, "ВидДокумента");
				Отказ = Истина
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если УказатьДанныеКонтактногоЛица И ЭтоКомпания = 0 Тогда
		
		Если ПустаяСтрока(ФамилияКЛ) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указана фамилия контактного лица'"),ИспользуютсяТолькоПартнеры, "ФамилияКЛ");
			Отказ = Истина;
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяКл) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано имя контактного лица'"),ИспользуютсяТолькоПартнеры, "ИмяКЛ");
			Отказ = Истина;
		КонецЕсли;
		
		Если ПустаяСтрока(ТелефонКЛ) И ПустаяСтрока(АдресЭПКЛ) И ПустаяСтрока(МобильныйТелефонКЛ) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать хотя бы одно значение контактной информации контактного лица'"),ИспользуютсяТолькоПартнеры, "АдресЭПКЛ");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// проверка корректности адресов электронной почты
		Если  НЕ ПустаяСтрока(АдресЭППартнера) И ЭтоКомпания = 0 Тогда
			Если ОбщегоНазначенияУТКлиентСервер.ПроверитьЗаполнениеПочтовогоАдреса(АдресЭППартнера) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Неверный формат адреса электронной почты партнера'"), ИспользуютсяТолькоПартнеры, "АдресЭППартнера");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если  НЕ ПустаяСтрока(АдресЭППартнераФизЛицо) И ЭтоКомпания = 1 Тогда
			Если ОбщегоНазначенияУТКлиентСервер.ПроверитьЗаполнениеПочтовогоАдреса(АдресЭППартнераФизЛицо) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Неверный формат адреса электронной почты партнера'"), ИспользуютсяТолькоПартнеры, "АдресЭППартнераФизЛицо");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если  УказатьДанныеКонтактногоЛица И НЕ ПустаяСтрока(АдресЭПКЛ) И ЭтоКомпания = 0 Тогда
			Если ОбщегоНазначенияУТКлиентСервер.ПроверитьЗаполнениеПочтовогоАдреса(АдресЭПКЛ) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Неверный формат адреса электронной почты контактного лица'"), ИспользуютсяТолькоПартнеры, "АдресЭПКЛ");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка данных физического лица
		Если  ЭтоКомпания = 1 И УказыватьЮридическиеРеквизиты И УказатьДокументУдостоверяющийЛичность Тогда
			
			Если Не ПустаяСтрока(СерияДокумента) Тогда
				ТекстОшибки = "";
				Отказ = Не ФизическиеЛицаКлиентСерверУТ.СерияДокументаУказанаПравильно(ВидДокумента, СерияДокумента, ТекстОшибки) Или Отказ;
				Если Не ПустаяСтрока(ТекстОшибки) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "СерияДокумента");
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПустаяСтрока(НомерДокумента) Тогда
				ТекстОшибки = "";
				Отказ = Не ФизическиеЛицаКлиентСерверУТ.НомерДокументаУказанПравильно(ВидДокумента, НомерДокумента, ТекстОшибки) Или Отказ;
				Если Не ПустаяСтрока(ТекстОшибки) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "НомерДокумента");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПартнерыИКонтрагентыЛокализацияКлиент.ПервичнаяИнформацияЗаполненаНеправильно(ЭтотОбъект, Отказ);
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура Док_РабочееНаименованиеКомпанияПриИзмененииПосле(Элемент)  
	Если ЗначениеЗаполнено(Название) Тогда
		Если ДопМодульКлиентСервер.ЕстьПарсинг(Название) Тогда
			Если Не ДопМодульКлиентСервер.ЕстьПарсинг(ПолноеНаименование) Тогда
				Название = АльтерраОбщегоНазначения.СтрЗаменить_(Название, "(ПАРСИНГ)");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Публичное наименование также должно содержать слово '(Парсинг)'!");
			КонецЕсли;         
		Иначе
			Если ДопМодульКлиентСервер.ЕстьПарсинг(ПолноеНаименование) Тогда
				Название = Название + " (Парсинг)";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура Док_РабочееНаименованиеЧастноеЛицоПриИзмененииПосле(Элемент)
	Если ЗначениеЗаполнено(Название) И ДопМодульКлиентСервер.ЕстьПарсинг(Название) Тогда 
		Название = АльтерраОбщегоНазначения.СтрЗаменить_(Название, "(ПАРСИНГ)");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для парсинга необходимо выбрать флажок 'Компания', а не 'Частное лицо'!");  
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте     
Процедура ОчиститьФлажки(КромеПарсинга = Ложь)
	Если НЕ РежимПомощникаЗаведенияЧастногоКлиента Тогда
		Если КромеПарсинга Тогда   
			Поставщик = Истина;
			Парсинг = Истина;
		Иначе
			Поставщик = Ложь;
			Парсинг = Ложь;      
		КонецЕсли;

		Клиент = Ложь;
		Конкурент = Ложь;
		ПрочиеОтношения = Ложь;
		ОбслуживаетсяТорговымиПредставителями = Ложь;
		Перевозчик = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура Док_УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.АдресЭПКЛ.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТелефонКЛ.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МобильныйТелефонКЛ.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьДанныеКонтактногоЛица");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТелефонКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МобильныйТелефонКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АдресЭПКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИмяКЛ.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьДанныеКонтактногоЛица");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИмяКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ФамилияКЛ.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьДанныеКонтактногоЛица");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФамилияКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.АдресЭППартнераФизЛицо.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТелефонПартнераФизЛицо.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоКомпания");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АдресЭППартнераФизЛицо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТелефонПартнераФизЛицо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.АдресЭППартнера.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТелефонПартнера.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоКомпания");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АдресЭППартнера");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТелефонПартнера");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьДанныеКонтактногоЛица");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьДанныеКонтактногоЛица");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТелефонКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МобильныйТелефонКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АдресЭПКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГруппаДоступа.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользуютсяГруппыДоступаПартнеров");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГруппаДоступа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ГруппыДоступаПартнеров.ПустаяСсылка();

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НомерСчета.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьБанковскийСчетКонтрагента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НомерСчета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВалютаДенежныхСредств.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВалютаДенежныхСредств");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьБанковскийСчетКонтрагента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НомерСчетаГоловнойКонтрагент.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьБанковскийСчетГоловногоКонтрагента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НомерСчетаГоловнойКонтрагент");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВалютаДенежныхСредствГоловнойКонтрагент.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВалютаДенежныхСредствГоловнойКонтрагент");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьБанковскийСчетГоловногоКонтрагента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.АдресЭППартнераТолькоПартнеры.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТелефонПартнераТолькоПартнеры.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоКомпания");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АдресЭППартнера");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТелефонПартнера");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьДанныеКонтактногоЛица");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МобильныйТелефонКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТелефонКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АдресЭПКЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьДанныеКонтактногоЛица");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидДокумента.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоКомпания");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказыватьЮридическиеРеквизиты");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УказатьДокументУдостоверяющийЛичность");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СокрЮрНаименованиеКонтрагента.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НаОснованииКонтрагента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСравненияПартнеровЗначениеНайденного.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСравненияПартнеров.Различие");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
    
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПолеСОшибкойФон);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСравненияПартнеровЗначениеНайденного.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСравненияПартнеров.Совпадение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
   	#Удаление
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПолностьюОбеспечен);
    #КонецУдаления
	#Вставка 
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПолеСОшибкойФон);
	#КонецВставки
	ПартнерыИКонтрагентыЛокализация.УстановитьУсловноеОформление_ПомощникНового(ЭтотОбъект);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПодзапросПоНаименованиюКонтрагента")
Функция Док_ПодзапросПоНаименованиюКонтрагента()

	ТекстУсловияПоНеизвестномуПартнеру = " И (НЕ Контрагенты.Партнер.Предопределенный)";

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Партнер КАК Партнер,
	|	Контрагенты.Ссылка  КАК НайденоПоСсылка,
	|	ВЫБОР
	|		КОГДА  Контрагенты.Наименование ПОДОБНО &Название
	|			ТОГДА &СтрокаНаименование
	|			ИНАЧЕ &СтрокаНаименованиеПолное
	|	КОНЕЦ КАК НайденоВРеквизите
	|ПОМЕСТИТЬ КонтрагентыПоНаименованию
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование ПОДОБНО &НаименованиеКонтрагента ИЛИ Контрагенты.НаименованиеПолное ПОДОБНО &НаименованиеКонтрагента И &УсловиеПоНеизвестномуПартнеру
	#Вставка
	|	И НЕ Контрагенты.Партнер = Значение(Справочник.партнеры.ПустаяСсылка)
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеПоНеизвестномуПартнеру", ?(НаОснованииКонтрагента, ТекстУсловияПоНеизвестномуПартнеру,""));

	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
&ИзменениеИКонтроль("СводныйЗапрос")
Функция Док_СводныйЗапрос(СтруктураПоиска)

	СводныйЗапрос ="
	|
	|ВЫБРАТЬ 
	|	НайденоПоНазванию.Партнер           КАК Партнер,
	|	НайденоПоНазванию.НайденоПоСсылка   КАК НайденоПоСсылка,
	|	НайденоПоНазванию.НайденоВРеквизите КАК НайденоВРеквизите,
	|	НЕОПРЕДЕЛЕНО                        КАК ВидКонтакта
	|ПОМЕСТИТЬ НайденныеСовпадения
	|ИЗ
	|	НайденоПоНазванию КАК НайденоПоНазванию
	|";

	Если СтруктураПоиска.РегистрационныйНомер Тогда

		СводныйЗапрос = СводныйЗапрос + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	КонтрагентыПоРегистрационномуНомеру.Партнер,
		|	КонтрагентыПоРегистрационномуНомеру.НайденоПоСсылка,
		|	КонтрагентыПоРегистрационномуНомеру.НайденоВРеквизите,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	КонтрагентыПоРегистрационномуНомеру КАК КонтрагентыПоРегистрационномуНомеру
		|"; 

	КонецЕсли;

	Если СтруктураПоиска.НалоговыйНомер Тогда

		СводныйЗапрос = СводныйЗапрос + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	КонтрагентыПоНалоговомуНомеру.Партнер,
		|	КонтрагентыПоНалоговомуНомеру.НайденоПоСсылка,
		|	КонтрагентыПоНалоговомуНомеру.НайденоВРеквизите,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	КонтрагентыПоНалоговомуНомеру КАК КонтрагентыПоНалоговомуНомеру
		|"; 

	КонецЕсли;

	Если СтруктураПоиска.АдресЭП Тогда

		СводныйЗапрос = СводныйЗапрос + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	НайденоПоАдресуЭП.Партнер,
		|	НайденоПоАдресуЭП.НайденоПоСсылка,
		|	НайденоПоАдресуЭП.НайденоВРеквизите,
		|	НайденоПоАдресуЭП.ВидКонтакта
		|ИЗ
		|	НайденоПоАдресуЭП КАК НайденоПоАдресуЭП
		|";		

	КонецЕсли;

	Если СтруктураПоиска.НомерТелефона Тогда

		СводныйЗапрос = СводныйЗапрос +  "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	НайденоПоТелефону.Партнер,
		|	НайденоПоТелефону.НайденоПоСсылка,
		|	НайденоПоТелефону.НайденоВРеквизите,
		|	НайденоПоТелефону.ВидКонтакта
		|ИЗ
		|	НайденоПоТелефону КАК НайденоПоТелефону
		|";

	КонецЕсли;

	Если СтруктураПоиска.ФИО Тогда

		СводныйЗапрос = СводныйЗапрос +  "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	НайденоПоФИОКонтактныхЛиц.Партнер,
		|	НайденоПоФИОКонтактныхЛиц.НайденоПоСсылка,
		|	НайденоПоФИОКонтактныхЛиц.НайденоВРеквизите,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	НайденоПоФИОКонтактныхЛиц КАК НайденоПоФИОКонтактныхЛиц
		|";

	КонецЕсли;

	Если СтруктураПоиска.НаименованиеКонтрагента Тогда

		СводныйЗапрос = СводныйЗапрос + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	КонтрагентыПоНаименованию.Партнер,
		|	КонтрагентыПоНаименованию.НайденоПоСсылка,
		|	КонтрагентыПоНаименованию.НайденоВРеквизите,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	КонтрагентыПоНаименованию КАК КонтрагентыПоНаименованию
		|"; 

	КонецЕсли;

	Если СтруктураПоиска.ДокументКонтрагента Тогда

		СводныйЗапрос = СводныйЗапрос + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	КонтрагентыПоДокументу.Партнер,
		|	КонтрагентыПоДокументу.НайденоПоСсылка,
		|	КонтрагентыПоДокументу.НайденоВРеквизите,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	КонтрагентыПоДокументу КАК КонтрагентыПоДокументу
		|";

	КонецЕсли;

	ПартнерыИКонтрагентыЛокализация.ДополнитьСводныйЗапросПоСтруктуреПоиска(СводныйЗапрос, СтруктураПоиска);

	СводныйЗапрос = СводныйЗапрос + "
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	НайденоПоСсылка,
	|	НайденоВРеквизите
	|;
	|////////////////////////////////////////////////////////////////////////////////";

	СводныйЗапрос = СводныйЗапрос + "
	|ВЫБРАТЬ
	|	НайденныеСовпадения.Партнер             КАК Партнер,
	|	КОЛИЧЕСТВО(НайденныеСовпадения.Партнер) КАК КоличествоНайденныхАналогов
	|ПОМЕСТИТЬ СовпаденияПартнеры
	|ИЗ
	|	НайденныеСовпадения КАК НайденныеСовпадения
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеСовпадения.Партнер
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СовпаденияПартнеры.Партнер                   КАК Партнер,
	|	РеквизитыПартнера.Реквизит                   КАК Реквизит,
	|	ЕСТЬNULL(КонтактыПартнера.Вид, НЕОПРЕДЕЛЕНО) КАК ВидКонтакта,
	|	РеквизитыПартнера.Значение                   КАК ЗначениеСоздаваемого,
	|	РеквизитыПартнера.Порядок                    КАК ПорядокРеквизита,
	|	РеквизитыПартнера.Существенный               КАК Существенный,
	|	ВЫБОР
	|		КОГДА РеквизитыПартнера.Реквизит = &СтрокаВидПартнера
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Партнеры.ЮрФизЛицо)
	|		КОГДА РеквизитыПартнера.Реквизит = &СтрокаНаименование
	|			ТОГДА Партнеры.Наименование
	|		КОГДА РеквизитыПартнера.Реквизит = &СтрокаНаименованиеПолное
	|			ТОГДА Партнеры.НаименованиеПолное
	|		КОГДА РеквизитыПартнера.Реквизит = &СтрокаEmail
	|			ТОГДА КонтактыПартнера.АдресЭП
	|		КОГДА РеквизитыПартнера.Реквизит = &СтрокаТелефон
	|			ТОГДА КонтактыПартнера.Представление
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ КАК Значение
	|ПОМЕСТИТЬ ДанныеПартнеров
	|ИЗ
	|	СовпаденияПартнеры КАК СовпаденияПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО СовпаденияПартнеры.Партнер = Партнеры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыПартнера КАК РеквизитыПартнера
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК КонтактыПартнера
	|		ПО СовпаденияПартнеры.Партнер = КонтактыПартнера.Ссылка
	|			И (ВЫБОР
	|				КОГДА РеквизитыПартнера.Реквизит = &СтрокаEmail
	|					ТОГДА КонтактыПартнера.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|				КОГДА РеквизитыПартнера.Реквизит = &СтрокаТелефон
	|					ТОГДА КонтактыПартнера.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|							ИЛИ КонтактыПартнера.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НайденныеСовпадения.Партнер         КАК Партнер,
	|	НайденныеСовпадения.НайденоПоСсылка КАК Контрагент
	|ПОМЕСТИТЬ СовпадениеКонтрагенты
	|ИЗ
	|	НайденныеСовпадения КАК НайденныеСовпадения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО НайденныеСовпадения.НайденоПоСсылка = Контрагенты.Ссылка
	|ГДЕ
	|	НЕ &ИспользуютсяТолькоПартнеры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СовпаденияПартнеры.Партнер,
	|	Контрагенты.Ссылка
	|ИЗ
	|	СовпаденияПартнеры КАК СовпаденияПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО СовпаденияПартнеры.Партнер = Контрагенты.Партнер
	|ГДЕ
	|	&ИспользуютсяТолькоПартнеры
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СовпадениеКонтрагенты.Партнер     КАК Партнер,
	|	СовпадениеКонтрагенты.Контрагент  КАК Контрагент,
	|	РеквизитыКонтрагента.Реквизит     КАК Реквизит,
	|	НЕОПРЕДЕЛЕНО                      КАК ВидКонтакта,
	|	РеквизитыКонтрагента.Значение     КАК ЗначениеСоздаваемого,
	|	РеквизитыКонтрагента.Порядок      КАК ПорядокРеквизита,
	|	РеквизитыКонтрагента.Существенный КАК Существенный,
	|	ВЫБОР
	|		КОГДА РеквизитыКонтрагента.Реквизит = &СтрокаВидКонтрагента
	|			ТОГДА
	|				ВЫБОР КОГДА Контрагенты.ОбособленноеПодразделение
	|					ТОГДА &СтрокаОбособленноеПодразделение
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Контрагенты.ЮрФизЛицо)
	|				КОНЕЦ
	|		КОГДА РеквизитыКонтрагента.Реквизит = &СтрокаНаименование
	|			ТОГДА Контрагенты.Наименование
	|		КОГДА РеквизитыКонтрагента.Реквизит = &СтрокаНаименованиеПолное
	|			ТОГДА Контрагенты.НаименованиеПолное
	|		КОГДА РеквизитыКонтрагента.Реквизит = &СтрокаРегистрационныйНомер
	|			ТОГДА Контрагенты.РегистрационныйНомер
	|		КОГДА РеквизитыКонтрагента.Реквизит = &СтрокаДанныеДокумента
	|			ТОГДА ДокументыФизЛиц.Представление
	|		ИНАЧЕ &ДопУсловия
	|	КОНЕЦ КАК Значение
	|ПОМЕСТИТЬ ДанныеКонтрагентов
	|ИЗ
	|	СовпадениеКонтрагенты КАК СовпадениеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО СовпадениеКонтрагенты.Контрагент = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыКонтрагента КАК РеквизитыКонтрагента
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&ТекущаяДата, Физлицо ССЫЛКА Справочник.Контрагенты) КАК ДокументыФизЛиц
	|		ПО СовпадениеКонтрагенты.Контрагент = ДокументыФизЛиц.ФизЛицо
	|			И РеквизитыКонтрагента.Реквизит = &СтрокаДанныеДокумента
	|			И ДокументыФизЛиц.ВидДокумента = &ВидДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НайденныеСовпадения.Партнер         КАК Партнер,
	|	НайденныеСовпадения.НайденоПоСсылка КАК КонтактноеЛицо
	|ПОМЕСТИТЬ СовпадениеКонтактныеЛица
	|ИЗ
	|	НайденныеСовпадения КАК НайденныеСовпадения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|		ПО НайденныеСовпадения.НайденоПоСсылка = КонтактныеЛицаПартнеров.Ссылка
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	КонтактноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СовпадениеКонтактныеЛица.Партнер                  КАК Партнер,
	|	СовпадениеКонтактныеЛица.КонтактноеЛицо           КАК КонтактноеЛицо,
	|	РеквизитыКонтактногоЛица.Реквизит                 КАК Реквизит,
	|	ЕСТЬNULL(КонтактыКонтактныхЛиц.Вид, НЕОПРЕДЕЛЕНО) КАК ВидКонтакта,
	|	РеквизитыКонтактногоЛица.Значение                 КАК ЗначениеСоздаваемого,
	|	РеквизитыКонтактногоЛица.Порядок                  КАК ПорядокРеквизита,
	|	РеквизитыКонтактногоЛица.Существенный             КАК Существенный,
	|	ВЫБОР
	|		КОГДА РеквизитыКонтактногоЛица.Реквизит = &СтрокаНаименование
	|			ТОГДА КонтактныеЛицаПартнеров.Наименование
	|		КОГДА РеквизитыКонтактногоЛица.Реквизит = &СтрокаEmail
	|			ТОГДА КонтактыКонтактныхЛиц.АдресЭП
	|		КОГДА РеквизитыКонтактногоЛица.Реквизит = &СтрокаТелефон
	|			ТОГДА КонтактыКонтактныхЛиц.Представление
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ КАК Значение
	|ПОМЕСТИТЬ ДанныеКонтактныхЛиц
	|ИЗ
	|	СовпадениеКонтактныеЛица КАК СовпадениеКонтактныеЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|		ПО СовпадениеКонтактныеЛица.КонтактноеЛицо = КонтактныеЛицаПартнеров.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыКонтактногоЛица КАК РеквизитыКонтактногоЛица
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактыКонтактныхЛиц
	|		ПО СовпадениеКонтактныеЛица.КонтактноеЛицо = КонтактыКонтактныхЛиц.Ссылка
	|			И (ВЫБОР
	|				КОГДА РеквизитыКонтактногоЛица.Реквизит = &СтрокаEmail
	|					ТОГДА КонтактыКонтактныхЛиц.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|				КОГДА РеквизитыКонтактногоЛица.Реквизит = &СтрокаТелефон
	|					ТОГДА КонтактыКонтактныхЛиц.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|							ИЛИ КонтактыКонтактныхЛиц.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СовпаденияПартнеры.Партнер                     КАК Партнер,
	|	СовпаденияПартнеры.КоличествоНайденныхАналогов КАК КоличествоНайденныхАналогов,
	|	Партнеры.ОсновнойМенеджер                      КАК ОсновнойМенеджер,
	|	Партнеры.Представление                         КАК Представление
	|ИЗ
	|	СовпаденияПартнеры КАК СовпаденияПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО СовпаденияПартнеры.Партнер = Партнеры.Ссылка 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПартнеров.Партнер              КАК Партнер,
	|	ДанныеПартнеров.Партнер              КАК НайденоПоСсылка,
	|	ДанныеПартнеров.Значение             КАК ЗначениеНайденного,
	|	ДанныеПартнеров.ЗначениеСоздаваемого КАК ЗначениеСоздаваемого,
	|	ДанныеПартнеров.Существенный         КАК Существенный,
	|	1                                    КАК ПорядокУзла,
	|	ДанныеПартнеров.ПорядокРеквизита     КАК ПорядокРеквизита,
	|	ВЫБОР
	|		КОГДА ДанныеПартнеров.ВидКонтакта = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеПартнеров.Реквизит
	|		ИНАЧЕ ДанныеПартнеров.ВидКонтакта
	|	КОНЕЦ КАК Реквизит,
	|	ВЫБОР
	|		КОГДА НайденныеСовпадения.НайденоВРеквизите ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Совпадение
	|	
	|ИЗ
	|	ДанныеПартнеров КАК ДанныеПартнеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ НайденныеСовпадения КАК НайденныеСовпадения
	|		ПО ДанныеПартнеров.Партнер = НайденныеСовпадения.Партнер
	|		 И ДанныеПартнеров.Партнер = НайденныеСовпадения.НайденоПоСсылка
	|		 И ДанныеПартнеров.Реквизит = НайденныеСовпадения.НайденоВРеквизите
	|		 И ДанныеПартнеров.ВидКонтакта = НайденныеСовпадения.ВидКонтакта
	#Вставка
	|ГДЕ
	|	НЕ ДанныеПартнеров.Партнер = Значение(Справочник.Партнеры.ПустаяСсылка)
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеКонтрагентов.Партнер,
	|	ДанныеКонтрагентов.Контрагент,
	|	ДанныеКонтрагентов.Значение,
	|	ДанныеКонтрагентов.ЗначениеСоздаваемого,
	|	ДанныеКонтрагентов.Существенный,
	|	2,
	|	ДанныеКонтрагентов.ПорядокРеквизита,
	|	ДанныеКонтрагентов.Реквизит,
	|	ВЫБОР
	|		КОГДА НайденныеСовпадения.НайденоВРеквизите ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Совпадение
	|ИЗ
	|	ДанныеКонтрагентов КАК ДанныеКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НайденныеСовпадения КАК НайденныеСовпадения
	|		ПО ДанныеКонтрагентов.Партнер = НайденныеСовпадения.Партнер
	|		 И ДанныеКонтрагентов.Контрагент = НайденныеСовпадения.НайденоПоСсылка
	|		 И ДанныеКонтрагентов.Реквизит = НайденныеСовпадения.НайденоВРеквизите
	#Вставка
	|ГДЕ
	|	НЕ ДанныеКонтрагентов.Партнер = Значение(Справочник.Партнеры.ПустаяСсылка)
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеКонтактныхЛиц.Партнер,
	|	ДанныеКонтактныхЛиц.КонтактноеЛицо,
	|	ДанныеКонтактныхЛиц.Значение,
	|	ДанныеКонтактныхЛиц.ЗначениеСоздаваемого,
	|	ДанныеКонтактныхЛиц.Существенный,
	|	3,
	|	ДанныеКонтактныхЛиц.ПорядокРеквизита,
	|	ВЫБОР
	|		КОГДА ДанныеКонтактныхЛиц.ВидКонтакта = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеКонтактныхЛиц.Реквизит
	|		ИНАЧЕ ДанныеКонтактныхЛиц.ВидКонтакта
	|	КОНЕЦ КАК Реквизит,
	|	ВЫБОР
	|		КОГДА НайденныеСовпадения.НайденоВРеквизите ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Совпадение
	|ИЗ
	|	ДанныеКонтактныхЛиц КАК ДанныеКонтактныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ НайденныеСовпадения КАК НайденныеСовпадения
	|		ПО ДанныеКонтактныхЛиц.Партнер = НайденныеСовпадения.Партнер
	|		 И ДанныеКонтактныхЛиц.КонтактноеЛицо = НайденныеСовпадения.НайденоПоСсылка
	|		 И ДанныеКонтактныхЛиц.Реквизит = НайденныеСовпадения.НайденоВРеквизите
	|		 И ДанныеКонтактныхЛиц.ВидКонтакта = НайденныеСовпадения.ВидКонтакта
	#Вставка
	|ГДЕ
	|	НЕ ДанныеКонтактныхЛиц.Партнер = Значение(Справочник.Партнеры.ПустаяСсылка)
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокУзла,
	|	ПорядокРеквизита
	|ИТОГИ ПО
	|	Партнер,
	|	НайденоПоСсылка";

	ПартнерыИКонтрагентыЛокализация.УстановитьДополнительныеУсловияСводногоЗапроса(СводныйЗапрос);

	СводныйЗапрос = СтрЗаменить(СводныйЗапрос, "&ДопУсловия", """""");

	Возврат СводныйЗапрос;

КонецФункции

&НаКлиенте
Процедура Док_ОсновнойМенеджерЧастноеЛицоПриИзмененииПосле(Элемент)
	НужнаПроверка = ИСТИНА;

	ОтборНужныхПользователей(НужнаПроверка);
	
	Если НужнаПроверка Тогда
		ОбработатьОтветНет= Новый ОписаниеОповещения("ОбработатьОтветНет", ЭтаФорма);
		ПоказатьВопрос(ОбработатьОтветНет, "Основной менеджер не является сотрудником оптовых отделов, выберите другого менеджера или очистите поле ""Основной менеджер""!", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Сохранить клиента с выбранным ОМ?", КодВозвратаДиалога.Нет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ОсновнойМенеджерПриИзмененииПосле(Элемент)
	НужнаПроверка = ИСТИНА;

	ОтборНужныхПользователей(НужнаПроверка);
	
	Если НужнаПроверка  Тогда
		ОбработатьОтветНет= Новый ОписаниеОповещения("ОбработатьОтветНет", ЭтаФорма);
		ПоказатьВопрос(ОбработатьОтветНет, "Основной менеджер не является сотрудником оптовых отделов, выберите другого менеджера или очистите поле ""Основной менеджер""!", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Сохранить клиента с выбранным ОМ?", КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	
КонецПроцедуры

 &НаКлиенте
Процедура ОбработатьОтветНет(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтотОбъект.ОсновнойМенеджер = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОтборНужныхПользователей(НужнаПроверка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|		Пользователи.Ссылка КАК Ссылка,
		|		ДополнительныеСведения.Значение.Наименование КАК ЗначениеНаименование
		|	ИЗ
		|		Справочник.Пользователи КАК Пользователи
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|			ПО (Пользователи.Ссылка = ДополнительныеСведения.Объект)
		|	ГДЕ
		|		ДополнительныеСведения.Свойство = &Свойство
		|        И ДополнительныеСведения.Значение.Наименование ПОДОБНО &Отдел1
		|        ИЛИ ДополнительныеСведения.Значение.Наименование ПОДОБНО &Отдел2"; 		
	
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Отделы")); 
	Запрос.УстановитьПараметр("Отдел1", "Отдел Дистрибуции");  
	Запрос.УстановитьПараметр("Отдел2", "Коммерческий отдел");

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЭтотОбъект.ОсновнойМенеджер = ВыборкаДетальныеЗаписи.Ссылка Тогда 
			НужнаПроверка = ЛОЖЬ;
		КонецЕсли;
	КонецЦикла;
		
	Возврат НужнаПроверка;
		
КонецФункции
