
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НастройкаРеалТаймОбменаДокументовЗаполнена() тогда
		
		ОбработкаПрерыванияПользователя();
		ВыполнениеLongPullingНаСервере();	
		
	Иначе
		Режим = РежимДиалогаВопрос.ОК;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Не указана настройка обмена, которая работает в режиме реального времени. Обмен документов в реальном времени запущен не будет.", Режим);	   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	//Если Результат = КодВозвратаДиалога.Нет Тогда
	//    Возврат;
	//КонецЕсли;
КонецПроцедуры

&НаСервере

Процедура ВыполнениеLongPullingНаСервере()
	
	ПараметрыСоединения = Б_ОбменССайтомКлиентСервер.ПолучитьПараметрыСоединения(); 
	
	Если ПараметрыСоединения.Тип = "Сервер" Тогда 
		ФоновыеЗадания.Выполнить("Б_ОбменССайтомСервер.ВыполнениеLongPullingФоновыхЗаданий");
	Иначе
		Б_ОбменССайтомСервер.ВыполнениеLongPullingФоновыхЗаданий();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НастройкаРеалТаймОбменаДокументовЗаполнена()
	
	Если ЗначениеЗаполнено(Константы.Б_НастройкаОбменаДокументовВРеальномВремени.Получить()) тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
	
