
&НаКлиенте
Процедура НомераТелефоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ПростыеЗвонкиКомпонента = Неопределено Тогда
		Предупреждение("Компонента ""Простые звонки"" не загружена!",,"Простые звонки");
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "НомераТелефоновПредставление" Тогда
		ПростыеЗвонки_ОбщийМодуль_Клиент.Позвонить(Элемент.ТекущиеДанные.Представление);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НомераТелефонов.Параметры.УстановитьЗначениеПараметра("Партнер",Неопределено);
	НомераТелефонов.Параметры.УстановитьЗначениеПараметра("Контрагент",Неопределено);
	НомераТелефонов.Параметры.УстановитьЗначениеПараметра("КонтактноеЛицо",Неопределено);

	Если ЗначениеЗаполнено(Параметры.Клиент) Тогда
		Если ТипЗнч(Параметры.Клиент) = Тип("СправочникСсылка.Партнеры") Тогда
			НомераТелефонов.Параметры.УстановитьЗначениеПараметра("Партнер",Параметры.Клиент);
		ИначеЕсли ТипЗнч(Параметры.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
			НомераТелефонов.Параметры.УстановитьЗначениеПараметра("Контрагент",Параметры.Клиент);
		ИначеЕсли ТипЗнч(Параметры.Клиент) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда	
			НомераТелефонов.Параметры.УстановитьЗначениеПараметра("КонтактноеЛицо",Параметры.Клиент);
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры
