&НаСервере
Функция ПолучитьПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
конецфункции	
&НаКлиенте
Процедура СброситьПоСекции(Команда)
	МассивВыдСтрок=Элементы.Расхождения.ВыделенныеСтроки;
	если МассивВыдСтрок.Количество()<>0 тогда
		Для Каждого ТекСтрока Из МассивВыдСтрок Цикл
			СтрокаКоллекции=Объект.Расхождения.НайтиПоИдентификатору(ТекСтрока);
			СтрокаКоллекции.Кладовщик="";
		конеццикла;
	конецесли;	
КонецПроцедуры
&НаКлиенте
Процедура ОтметкаКассы(Команда)
	
	Если Объект.ПричинаДляОрганизацииСпр.Пустая() Тогда
		Сообщить("Перед установкой отметки кассы необходимо заполнить причину возврата для организации (вкладка ""Дополнительно"")");
		Возврат;
	КонецЕсли;
	
	Пользователь = ПолучитьПользователя();
	ДопМодульКлиент.УстановитьОтметкуКассы(ЭтаФорма, Пользователь);
	УстановитьДоступностьПоОтметкеКассы();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоОтметкеКассы()
	
	ДопМодуль.УстановитьДоступностьПоОтметкеКассыОбщий(ЭтаФорма);
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ОтметкаКассы") ИЛИ РольДоступна("Кассир") Тогда
		ЭтаФорма.Элементы.ПричинаДляОрганизацииСпр.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	Элементы.ИсключитьИзКонтроля.Доступность = РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьОтметкиКассы()
    ПараметрЗаписи =  Новый Структура;
	ПараметрЗаписи.Вставить("РежимЗаписи",РежимЗаписиДокумента.Запись);
	ЭтаФорма.Записать(ПараметрЗаписи);
КонецПроцедуры

&НаСервере                       
Процедура СКПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	//Если НЕ Параметры.Ключ.Пустая() Тогда
    	УстановитьДоступностьПоОтметкеКассы();
    //КонецЕсли;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//+Альтерра
	Если Объект.Кассир.Пустая() Тогда // проверка отметки кассы
		Объект.ДатаПоследнегоОткрытия = ТекущаяДатаСеанса();
	КонецЕсли;	
	//-
    	
КонецПроцедуры

#Область Зеленение
&После("УстановитьУсловноеОформление")
Процедура Спр_УстановитьУсловноеОформление()
	АльтерраОбщегоНазначения.УстановитьОформлениеЗеленениеСтрокТабличныхЧастей(ЭтаФорма,"Расхождения");
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ДокументРеализации = ТекущийОбъект.ДокументОснование;   
	Если Не Отказ И 
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И
		ЗначениеЗаполнено(ДокументРеализации) И
		ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ТЗТовары = ТекущийОбъект.Товары.Выгрузить( , "Номенклатура, Количество");
		ТЗТовары.Свернуть("Номенклатура", "Количество");
		
		АльтерраОбщегоНазначения.НаличиеЗаказаНаДоставкуПриПолномВозврате(Отказ, ТЗТовары, ТекущийОбъект.Ссылка, ДокументРеализации);		
	КонецЕсли;
КонецПроцедуры

#Область ВводНаОсновании
&НаСервере
Процедура СоздатьНовыйДокумент(ИмяДокумента, НовыйОбъект)
	Документы[ИмяДокумента].ЗаполнитьДанныеПоОснованию(Объект.Ссылка, НовыйОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииПропуск(Команда)
	
	ИмяДокумента = "Пропуск";
	ФормаДок = ПолучитьФорму("Документ." +  ИмяДокумента + ".ФормаОбъекта");
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Реализация товаров и услуг");
		
		ПоказатьПредупреждение( , ТекстВопроса);
		Возврат;	
	КонецЕсли;
	
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	ФормаДок.Открыть();	
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	ДопМодуль.КорректировкаСкладаДляКорректировкиНазначенияТоваров(Объект.Ссылка, Объект.Проведен, Объект.ПометкаУдаления, Объект.Склад);
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("РасхожденияПриАктивизацииЯчейки")
Процедура Док_РасхожденияПриАктивизацииЯчейки(Элемент)

СтрокаТаблицы = Элементы.Расхождения.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент <> Неопределено
		И Элемент.ТекущийЭлемент = Элементы.РасхожденияВариантОтражения Тогда
		
		СписокВыбора = Элементы.РасхожденияВариантОтражения.СписокВыбора;
		СписокВыбора.Очистить();
		
		Если СтрокаТаблицы.КоличествоУпаковок > 0 Тогда
			
			Если Не СтрокаТаблицы.Сумма = 0
				И Истина Тогда
			#Удаление
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.ОтразитьНаПрочихДоходах"));
			#КонецУдаления
			#Вставка
			Если Не СтрокаТаблицы.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.ОтразитьНаПрочихДоходах"));
			КонецЕсли;	
			#КонецВставки
			КонецЕсли;
			
			Если СтрокаТаблицы.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
				Или СтрокаТаблицы.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализацию"));
			ИначеЕсли СтрокаТаблицы.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
				#Удаление
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУчестьПриИнвентаризации"));
				#КонецУдаления
				#Вставка
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки"));
				#КонецВставки
			Иначе
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки"));
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.КоличествоУпаковок < 0 Тогда
			
			Если 
				СтрокаТаблицы.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализацию"));
			ИначеЕсли СтрокаТаблицы.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализацию"));
				Если Не СтрокаТаблицы.Сумма = 0 Тогда
					СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.СписатьНаРасходы"));
				КонецЕсли;
			Иначе
				#Удаление
				Если Не СтрокаТаблицы.Сумма = 0 Тогда
					СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.СписатьНаРасходы"));
				КонецЕсли;
				Если СтрокаТаблицы.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
					СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУчестьПриИнвентаризации"));
				Иначе
					СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки"));
				КонецЕсли;
				#КонецУдаления
				#Вставка
				Если Не СтрокаТаблицы.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
					СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.СписатьНаРасходы"));
				КонецЕсли;
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки"));
				#КонецВставки
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.QRкод = "" Тогда   
		ТекущийОбъект.QRкод = ГенерацияШтрихкода.СформироватьQRКод(ТекущийОбъект.Ссылка);
		ТекущийОбъект.Записать(РежимЗаписиДокумента.Запись); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановитьВариантыОтражения")
Процедура Док_УстановитьВариантыОтражения1(ИмяТЧ)
	
	КорректировкаДавальца = Ложь;
	
	ЕстьУвеличениеКоличестваПоОрдерномуСкладу = Ложь;
	ЕстьУвеличениеКоличестваБезИнвентаризации = Ложь;
	ЕстьУменьшениеКоличестваПоОрдерномуСкладу = Ложь;
	ЕстьУменьшениеКоличестваБезИнвентаризации = Ложь;
	ЕстьУвеличениеВыручки                     = Ложь;
	ЕстьУвеличениеВыручкиБезОтражения         = Ложь;
	ЕстьУменьшениеВыручки                     = Ложь;
	ЕстьУменьшениеВыручкиБезСписания          = Ложь;

	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		
		Если (СтрокаТЧ.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")
			Или СтрокаТЧ.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара")
			Или СтрокаТЧ.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")) Тогда
			
			Если (СтрокаТЧ.Количество > 0 И Объект.ВидКорректировки <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара")) Тогда
				Если СтрокаТЧ.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
					Или КорректировкаДавальца Тогда
					Если Не СтрокаТЧ.Сумма = 0 Тогда
						ЕстьУвеличениеВыручки = Истина;
					Иначе
						ЕстьУвеличениеВыручкиБезОтражения = Истина;
					КонецЕсли;
				ИначеЕсли СтрокаТЧ.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
					ЕстьУвеличениеКоличестваПоОрдерномуСкладу = Истина;
				Иначе
					ЕстьУвеличениеКоличестваБезИнвентаризации = Истина;
				КонецЕсли; 
				
			ИначеЕсли (СтрокаТЧ.Количество < 0 Или Объект.ВидКорректировки = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара")) Тогда
				Если КорректировкаДавальца
					Или СтрокаТЧ.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
					Если Не СтрокаТЧ.Сумма = 0 Тогда
						ЕстьУменьшениеВыручки = Истина;
					Иначе
						ЕстьУменьшениеВыручкиБезСписания = Истина;
					КонецЕсли;
				ИначеЕсли СтрокаТЧ.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
					ЕстьУменьшениеКоличестваПоОрдерномуСкладу = Истина;
				Иначе
					ЕстьУменьшениеКоличестваБезИнвентаризации = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьУвеличениеКоличестваПоОрдерномуСкладу
		Или ЕстьУвеличениеКоличестваБезИнвентаризации
		Или ЕстьУменьшениеКоличестваПоОрдерномуСкладу
		Или ЕстьУменьшениеКоличестваБезИнвентаризации
		Или ЕстьУвеличениеВыручки
		Или ЕстьУвеличениеВыручкиБезОтражения
		Или ЕстьУменьшениеВыручки
		Или ЕстьУменьшениеВыручкиБезСписания Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяТЧ",                                                 ИмяТЧ);
		ДополнительныеПараметры.Вставить("СписокВариантовДляВыбора",                              Новый Массив);
		ДополнительныеПараметры.Вставить("ИмяСвойстваДляРезультатаВыбора",                        Неопределено);
		
		ДополнительныеПараметры.Вставить("ВариантОтраженияУвеличениеКоличестваПоОрдерномуСкладу", Неопределено);
		ДополнительныеПараметры.Вставить("ВариантОтраженияУвеличениеКоличестваБезИнвентаризации", Неопределено);
		ДополнительныеПараметры.Вставить("ВариантОтраженияУменьшениеКоличестваПоОрдерномуСкладу", Неопределено);
		ДополнительныеПараметры.Вставить("ВариантОтраженияУменьшениеКоличестваБезИнвентаризации", Неопределено);
		ДополнительныеПараметры.Вставить("ВариантОтраженияУвеличениеВыручки",                     Неопределено);
		ДополнительныеПараметры.Вставить("ВариантОтраженияУвеличениеВыручкиБезОтражения",         Неопределено);
		ДополнительныеПараметры.Вставить("ВариантОтраженияУменьшениеВыручки",                     Неопределено);
		ДополнительныеПараметры.Вставить("ВариантОтраженияУменьшениеВыручкиБезСписания",          Неопределено);
		
		Если ЕстьУвеличениеКоличестваПоОрдерномуСкладу Тогда
			
			СписокВариантовОтражения = Новый СписокЗначений;
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.ОтразитьНаПрочихДоходах"));
			#Удаление
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУчестьПриИнвентаризации"));
			#КонецУдаления	
			#Вставка
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки"));
            #КонецВставки
			ДополнительныеПараметры.СписокВариантовДляВыбора.Добавить(Новый Структура("ИмяСвойстваДляРезультатаВыбора, СписокВариантовОтражения", "ВариантОтраженияУвеличениеКоличестваПоОрдерномуСкладу", СписокВариантовОтражения));
				
		КонецЕсли;
		Если ЕстьУвеличениеКоличестваБезИнвентаризации Тогда
			СписокВариантовОтражения = Новый СписокЗначений;
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.ОтразитьНаПрочихДоходах"));
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки"));
			
			ДополнительныеПараметры.СписокВариантовДляВыбора.Добавить(Новый Структура("ИмяСвойстваДляРезультатаВыбора, СписокВариантовОтражения", "ВариантОтраженияУвеличениеКоличестваБезИнвентаризации", СписокВариантовОтражения));
			
		КонецЕсли;
		Если ЕстьУвеличениеВыручки Тогда
			СписокВариантовОтражения = Новый СписокЗначений;
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.ОтразитьНаПрочихДоходах"));
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализацию"));
			
			ДополнительныеПараметры.СписокВариантовДляВыбора.Добавить(Новый Структура("ИмяСвойстваДляРезультатаВыбора, СписокВариантовОтражения", "ВариантОтраженияУвеличениеВыручки", СписокВариантовОтражения));
			
		КонецЕсли;                                      
		Если ЕстьУвеличениеВыручкиБезОтражения Тогда
			СписокВариантовОтражения = Новый СписокЗначений;
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализацию"));
			
			ДополнительныеПараметры.СписокВариантовДляВыбора.Добавить(Новый Структура("ИмяСвойстваДляРезультатаВыбора, СписокВариантовОтражения", "ВариантОтраженияУвеличениеВыручкиБезОтражения", СписокВариантовОтражения));
			
		КонецЕсли;                                      
		Если ЕстьУменьшениеКоличестваПоОрдерномуСкладу Тогда
			СписокВариантовОтражения = Новый СписокЗначений;
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.СписатьНаРасходы"));                          
			#Удаление
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУчестьПриИнвентаризации"));
			#КонецУдаления
			#Вставка
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки"));
            #КонецВставки
			ДополнительныеПараметры.СписокВариантовДляВыбора.Добавить(Новый Структура("ИмяСвойстваДляРезультатаВыбора, СписокВариантовОтражения", "ВариантОтраженияУменьшениеКоличестваПоОрдерномуСкладу", СписокВариантовОтражения));
				
		КонецЕсли;
		Если ЕстьУменьшениеКоличестваБезИнвентаризации Тогда
			СписокВариантовОтражения = Новый СписокЗначений;
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.СписатьНаРасходы"));
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки"));
			
			ДополнительныеПараметры.СписокВариантовДляВыбора.Добавить(Новый Структура("ИмяСвойстваДляРезультатаВыбора, СписокВариантовОтражения", "ВариантОтраженияУменьшениеКоличестваБезИнвентаризации", СписокВариантовОтражения));
			
		КонецЕсли;
		Если ЕстьУменьшениеВыручки Тогда
			СписокВариантовОтражения = Новый СписокЗначений;
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.СписатьНаРасходы"));
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализацию"));
			
			ДополнительныеПараметры.СписокВариантовДляВыбора.Добавить(Новый Структура("ИмяСвойстваДляРезультатаВыбора, СписокВариантовОтражения", "ВариантОтраженияУменьшениеВыручки", СписокВариантовОтражения));
			
		КонецЕсли;
		Если ЕстьУменьшениеВыручкиБезСписания Тогда
			СписокВариантовОтражения = Новый СписокЗначений;
			СписокВариантовОтражения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализацию"));
			
			ДополнительныеПараметры.СписокВариантовДляВыбора.Добавить(Новый Структура("ИмяСвойстваДляРезультатаВыбора, СписокВариантовОтражения", "ВариантОтраженияУменьшениеВыручкиБезСписания", СписокВариантовОтражения));
			
		КонецЕсли;
		
		ВыбратьИнтерактивноВариантыОтраженияКорректировокРеализацийФрагмент( ДополнительныеПараметры);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Нет строк, в которых доступно изменение варианта отражения.'"));
		
	КонецЕсли;
	
	Возврат;
КонецПроцедуры

&НаСервере
Процедура Док_МенеджерПриИзмененииПослеНаСервере()
	Объект.ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Объект.Менеджер); 
	Объект.ОтделМенеджера = ПолучитьОтделМенеджера(Объект.Менеджер);
КонецПроцедуры

&НаКлиенте
Процедура Док_МенеджерПриИзмененииПосле(Элемент)
	Док_МенеджерПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделМенеджера(Менеджер) 

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение.Наименование КАК Отдел
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО (ДополнительныеСведения.Объект = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ДополнительныеСведения.Свойство.Наименование = ""Отделы (Пользователи)""";
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Отдел;
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подразделение;
КонецФункции

