
#Область ПрограммныйИнтерфейс

Функция Существует(Организация, Период, ВыводитьСообщениеОбОтсутствииУчетнойПолитики = Ложь, ДокументСсылка = Неопределено) Экспорт

	Возврат УчетнаяПолитикаПереопределяемый.Существует(Организация, Период, ВыводитьСообщениеОбОтсутствииУчетнойПолитики, ДокументСсылка);

КонецФункции


// Параметры учетной политики по НДС

Функция ПлательщикНДС(Организация, Период) Экспорт

	Возврат УчетнаяПолитикаПереопределяемый.ПлательщикНДС(Организация, Период);

КонецФункции

// Раздельный учет НДС.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, для которой нужно получить учетную политику
//  Период - Дата - дата, на начало месяца которой определяется применимость раздельного учета по НДС
// 
// Возвращаемое значение:
//  Булево
Функция РаздельныйУчетНДС(Организация, Период) Экспорт

	Возврат УчетнаяПолитикаПереопределяемый.РаздельныйУчетНДС(Организация, Период);

КонецФункции

Функция ПлательщикНДСПрименяющийУСН(Организация, Период) Экспорт

	Возврат УчетнаяПолитикаПереопределяемый.ПлательщикНДСПрименяющийУСН(Организация, Период);

КонецФункции

Функция ПрименяетсяОсвобождениеОтУплатыНДС(Организация, Период) Экспорт

	Результат = УчетнаяПолитикаПереопределяемый.ПрименяетсяОсвобождениеОтУплатыНДС(Организация, Период);

	Возврат Результат;	

КонецФункции

Функция ПравилоОтбораАвансовДляРегистрацииСчетовФактур(Организация, Период) Экспорт
	
	Возврат УчетнаяПолитикаПереопределяемый.ПравилоОтбораАвансовДляРегистрацииСчетовФактур(Организация, Период);
	
КонецФункции

Функция ПериодичностьФормированияВычетовИВосстановленийНДС(Организация, Период) Экспорт
	
	Возврат УчетнаяПолитикаПереопределяемый.ПериодичностьФормированияВычетовИВосстановленийНДС(Организация, Период);
	
КонецФункции

// Параметры учетной политики по ЕНВД

Функция ПлательщикЕНВД(Организация, Период) Экспорт

	Возврат УчетнаяПолитикаПереопределяемый.ПлательщикЕНВД(Организация, Период);

КонецФункции

Функция ПлательщикЕНВДЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Возврат УчетнаяПолитикаПереопределяемый.ПлательщикЕНВДЗаПериод(Организация, НачалоПериода, КонецПериода);
	
КонецФункции


Функция ПрименяетсяУСН(Организация, Период) Экспорт

	Возврат УчетнаяПолитикаПереопределяемый.ПрименяетсяУСН(Организация, Период);

КонецФункции 

//++ Локализация

// Возвращает признак использования патента для организации.
// Параметры:
//	Организация - СправочникСсылка.Организации - организация, из учетной политики которой берется требуемое значение;
//	Период - Дата - дата, на которую анализируется учетная политика организации.
//
// Возвращаемое значение:
//	Булево - признак использования патентов.
//
Функция ПрименяетсяПСН(Организация, Период) Экспорт

	Возврат УчетнаяПолитикаПереопределяемый.ПрименяетсяПСН(Организация, Период);

КонецФункции 

// Возвращает признак необходимости заполнения книги учета доходов и расходов для организации.
// Параметры:
//	Организация - СправочникСсылка.Организации - организация, из учетной политики которой берется требуемое значение;
//	Период - Дата - дата, на которую анализируется учетная политика организации.
//
// Возвращаемое значение:
//	Булево - необходимость заполнения КУДиР.
//
Функция ЗаполнятьКУДиР(Организация, Период) Экспорт

	Возврат УчетнаяПолитикаПереопределяемый.ЗаполнятьКУДиР(Организация, Период);

КонецФункции

//-- Локализация


#КонецОбласти
