
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ИДГруппыПользователей.Доступность= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрайсыКлиентов.Ссылка,
	|	ПрайсыКлиентов.НаименованиеЦены,
	|	ПрайсыКлиентов.Наименование
	|ИЗ
	|	Справочник.ПрайсыКлиентов КАК ПрайсыКлиентов
	|ГДЕ
	|	ПрайсыКлиентов.Ссылка <> &Ссылка
	|	И ПрайсыКлиентов.НаименованиеЦены = &НаименованиеЦены";
	
	Запрос.УстановитьПараметр("НаименованиеЦены", Объект.НаименованиеЦены);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Отказ= Истина;
		Сообщение= Новый СообщениеПользователю;
		Сообщение.Текст= "Прайс с таким названием цены уже существует! ("+ВыборкаДетальныеЗаписи.Наименование+")";
		Сообщение.КлючДанных= ВыборкаДетальныеЗаписи.Ссылка;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Клиенты.Клиент
	|ПОМЕСТИТЬ КлиентыЭтойГруппы
	|ИЗ
	|	&Клиенты КАК Клиенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрайсыКлиентовКлиенты.Клиент,
	|	ПрайсыКлиентовКлиенты.Ссылка
	|ПОМЕСТИТЬ КлиентыВДругихГруппах
	|ИЗ
	|	Справочник.ПрайсыКлиентов.Клиенты КАК ПрайсыКлиентовКлиенты
	|ГДЕ
	|	ПрайсыКлиентовКлиенты.Ссылка <> &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлиентыВДругихГруппах.Клиент,
	|	КлиентыВДругихГруппах.Ссылка,
	|	КлиентыВДругихГруппах.Ссылка.Наименование КАК Наименование
	|ИЗ
	|	КлиентыЭтойГруппы КАК КлиентыЭтойГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлиентыВДругихГруппах КАК КлиентыВДругихГруппах
	|		ПО КлиентыЭтойГруппы.Клиент = КлиентыВДругихГруппах.Клиент";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Клиенты", Объект.Клиенты.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Отказ= Истина;
		Сообщение= Новый СообщениеПользователю;
		Сообщение.Текст= "Клиент '"+ВыборкаДетальныеЗаписи.Клиент+"' присутствует в другом прайсе! ("+ВыборкаДетальныеЗаписи.Наименование+")";
		Сообщение.КлючДанных= ВыборкаДетальныеЗаписи.Ссылка;
		Сообщение.Сообщить();
	КонецЦикла;

КонецПроцедуры
