&НаКлиенте
Процедура Док_ОтобратьТабличныеЦенникиПосле(Команда)
	Для каждого Строка из Объект.Товары Цикл
		Если найти(ПолучитьНаименованиеШаблона(Строка.ШаблонЦенника), "Табличный_")<>0 Тогда // Шаблон ценника - табличный
			Строка.Выбран = НЕ Строка.Выбран;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеШаблона(Шаблон)
	Возврат Шаблон.Наименование;
КонецФункции

&НаКлиенте
Процедура Обр_ПодразделениеПриИзмененииВместо(Элемент)
	Обр_ПодразделениеПриИзмененииВместоНаСервере();
КонецПроцедуры

&НаСервере
Процедура Обр_ПодразделениеПриИзмененииВместоНаСервере()
	Если ЗначениеЗаполнено(Объект.Подразделение) тогда
		
		РегионПрисутствия = Объект.Подразделение.РегионПрисутствия;
		
		Если ЗначениеЗаполнено(ПериодПоследнегоИзмененияЦены.ДатаНачала) 
			И ЗначениеЗаполнено(ПериодПоследнегоИзмененияЦены.ДатаОкончания) Тогда
			
			Объект.ВидЦены = Объект.Подразделение.ЦенаБезКарты;
			Объект.ВидЦеныДополнительно = Объект.Подразделение.ЦенаПоКарте;
			
			ЗаполнитьТаблицуТоваровНаСервере(Ложь);
			ПроверитьСобытияПослеЗаполения(); 
		КонецЕсли;
		
	КонецЕсли;		
КонецПроцедуры

&НаСервере
&После("ОбновитьВидимостьЗависимыхОтШаблонаПолей")
Процедура Обр_ОбновитьВидимостьЗависимыхОтШаблонаПолей()
	
	ЕстьЦенники = (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников" ИЛИ Режим = "ПечатьТабличныхЦенников");
	
	ИспользоватьВидЦеныДополнительно = Истина;
	Элементы.ВидЦеныДополнительно.Видимость			= ЕстьЦенники;
	Элементы.ДатаВидЦеныДополнительно.Видимость		= ЕстьЦенники;
	Элементы.ТоварыЦенаДополнительно.Видимость		= ЕстьЦенники;
	Элементы.ВключитьНапечатанныеТовары.Видимость	= ЕстьЦенники;
	Элементы.ТоварыЦена.Видимость					= ЕстьЦенники; // 15.08.2022 если Режим - ПечатьЭтикеток, то цена не нужна
	Элементы.Принтер.Видимость						= Не ЕстьЦенники; // 18.08.2022 если Режим - ПечатьЭтикеток, то работаем с выбором принтера
	
	Если Элементы.Найти("ТоварыДатаЦены") <> Неопределено Тогда
		Элементы.ТоварыДатаЦены.Видимость			= ЕстьЦенники; // 15.08.2022 если Режим - ПечатьЭтикеток, то цена не нужна
	КонецЕсли;
	Если Элементы.Найти("ТоварыДатаЦеныДополнительно") <> Неопределено Тогда
		Элементы.ТоварыДатаЦеныДополнительно.Видимость = ЕстьЦенники;
	КонецЕсли;
	Если Элементы.Найти("ТоварыБылаПечать") <> Неопределено Тогда
		Элементы.ТоварыБылаПечать.Видимость			= ЕстьЦенники;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПолучитьПараметры")
Функция Док_ПолучитьПараметры()

	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Товары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДополнительно", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ШаблонЦенника", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЦенников", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ШаблонЭтикетки", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЭтикеток", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ОстатокНаСкладе", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("КоличествоВДокументе", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", Новый ОписаниеТипов("Дата"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", Новый ОписаниеТипов("Дата"));
	
	#Вставка      
		Обработки.ПечатьЭтикетокИЦенников.ДобавитьНовыеПараметры(Товары);
	#КонецВставки

	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Не СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 
		
		#Вставка        
			Обработки.ПечатьЭтикетокИЦенников.РасчетНовыхПараметров(НоваяСтрока);
		#КонецВставки
	
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЭтикетки) Тогда
			НоваяСтрока.КоличествоЭтикеток = 0;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЦенника) Тогда
			НоваяСтрока.КоличествоЦенников = 0;
		КонецЕсли;
	КонецЦикла;

	МаксимальныйКодВесовогоТовара = ПодключаемоеОборудованиеOfflineВызовСервера.МаксимальныйКодВесовогоТовара();
	УстановитьПривилегированныйРежим(Истина);
	ПравилоВыгрузкиВВесы = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоОбмена, "ТипПодключаемогоОборудования") = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
	УстановитьПривилегированныйРежим(Ложь);

	СтранаРегистрации = ?(ЗначениеЗаполнено(Объект.Организация), ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(Объект.Организация), Константы.ОсновнаяСтрана.Получить());

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Товары", ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор));
	ПараметрыПечати.Вставить("Организация",   Объект.Организация);
	ПараметрыПечати.Вставить("СтранаРегистрации", СтранаРегистрации);
	ПараметрыПечати.Вставить("ПравилоОбмена", Объект.ПравилоОбмена);
	ПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", МаксимальныйКодВесовогоТовара);
	ПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы",          ПравилоВыгрузкиВВесы);
	ПараметрыПечати.Вставить("ВидЦены",       Объект.ВидЦены);
	ПараметрыПечати.Вставить("Дата",          Объект.Дата);
	ПараметрыПечати.Вставить("Склад",         Объект.Склад);
	ПараметрыПечати.Вставить("ВидЦеныДополнительно", Объект.ВидЦеныДополнительно);
	ПараметрыПечати.Вставить("ДатаДополнительно",    Объект.ДатаДополнительно);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);     
	
	#Вставка
		ПараметрыПечати.Вставить("Подразделение", Объект.Подразделение);
		ПараметрыПечати.Вставить("ПринтерИмя",    Принтер);
	#КонецВставки
	
	#Вставка
	ПараметрыПечати.Вставить("Приоритет13ЗначногоШтрихкода", Приоритет13ЗначногоШтрихкода);
	#КонецВставки

	Возврат ПараметрыПечати;

КонецФункции  

&НаСервере
&Вместо("УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере")
Процедура Расш1_УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере(СтрокаТЧ)
	
	// Расчет количества Этикеток.
	Если ЗаполнитьКоличествоЭтикетокПоДокументу И НЕ ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЭтикеток = СтрокаТЧ.КоличествоВДокументе;
	ИначеЕсли ЗаполнитьКоличествоЭтикетокПоДокументу И ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЭтикеток = ?(СтрокаТЧ.КоличествоВДокументе > СтрокаТЧ.ОстатокНаСкладе,СтрокаТЧ.ОстатокНаСкладе,СтрокаТЧ.КоличествоВДокументе);
	ИначеЕсли НЕ ЗаполнитьКоличествоЭтикетокПоДокументу И ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЭтикеток = ?(СтрокаТЧ.ОстатокНаСкладе > 0, СтрокаТЧ.ОстатокНаСкладе, 0);
	КонецЕсли;
	
	// Расчет количества Ценников.
	Если ЗаполнитьКоличествоЦенниковПоДокументу И НЕ ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе Тогда
		//+Альтерра
		Если ЭтоПорча Тогда
			СтрокаТЧ.КоличествоЦенников = ?(СтрокаТЧ.КоличествоВДокументе > 0, СтрокаТЧ.КоличествоВДокументе, 0);
		Иначе 
		//-
			СтрокаТЧ.КоличествоЦенников = ?(СтрокаТЧ.КоличествоВДокументе > 0, 1, 0);  
		//+Альтерра
		КонецЕсли;                                                                   
		//-
	ИначеЕсли ЗаполнитьКоличествоЦенниковПоДокументу И ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЦенников = ?(СтрокаТЧ.ОстатокНаСкладе > 0 ИЛИ СтрокаТЧ.КоличествоВДокументе > 0, 1, 0);
	ИначеЕсли НЕ ЗаполнитьКоличествоЦенниковПоДокументу И ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЦенников = ?(СтрокаТЧ.ОстатокНаСкладе > 0, 1, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДляПечати()
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = "ОформлениеПовторнойПечати";
    ЭлементОформления.Использование = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Розовый);
	
 	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
 	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатура.Имя);	

	Для Каждого Колонка Из Элементы.Товары.ПодчиненныеЭлементы Цикл
 		ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
 		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		
		Если Тип(Колонка) = Тип("ГруппаФормы") Тогда
			Для Каждого Подэлемент Из Колонка.ПодчиненныеЭлементы Цикл
 				ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
 				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Подэлемент.Имя);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
    
    ЭлементаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.БылаПечать");
    ЭлементаОтбора.ПравоеЗначение = Истина;
    ЭлементаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементаОтбора.Использование = Истина;
КонецПроцедуры

&НаСервере
Процедура ИспользоватьУсловноеОформлениеДляПечати()
	Для Каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Элемент.Представление = "ОформлениеПовторнойПечати" Тогда 
				
			Если ЗначениеЗаполнено(Режим)
				И (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников" ИЛИ Режим = "ПечатьТабличныхЦенников") Тогда
				Элемент.Использование = Истина;
			Иначе
				Элемент.Использование = Ложь;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	Если Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников" Тогда
		Элементы.ТоварыОтобратьТабличныеЦенники.Видимость = Истина;
	Иначе
		Элементы.ТоварыОтобратьТабличныеЦенники.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	Для Каждого ЭлементОтбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбор.ПравоеЗначение) = Тип("СправочникСсылка.Склады") Тогда
			Объект.Склад = ЭлементОтбор.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПечатьКомплектаВместо(Команда)
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетокИЦенниковНаПринтер()
		
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
	ИменаМакетов = "";
	
	Если Режим = "ПечатьЭтикетокИЦенников" Тогда
		ИменаМакетов = "ЭтикеткаТовары,ЦенникТовары";
	ИначеЕсли Режим = "ПечатьЦенников" Тогда
		ИменаМакетов = "ЦенникТовары";
	ИначеЕсли Режим = "ПечатьЭтикеток" Тогда
		ИменаМакетов = "ЭтикеткаТовары";
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
		"Обработка.ПечатьЭтикетокИЦенников",
		ИменаМакетов,
		ПараметрКоманды,
		ПолучитьПараметры());
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПечатьСЗаписьюВРегистрПосле(Команда)
	
	ОчиститьСообщения();
	
	РезультатПроверки = ВыполнитьПроверку(ЭтаФорма);
	Если Не РезультатПроверки.ТоварыВыбраны Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не выбрано ни одного товара'"));
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверки.ПроверкаВыполнена Тогда
				
		Для Каждого Строка Из Объект.Товары Цикл
			НомерСтроки = Строка.НомерСтроки - 1;
			
			// 15.08.2022 добавлено условие - если Режим - ПечатьЭтикеток, то цена не нужна
			Если Строка.Выбран И Не ЗначениеЗаполнено(Строка.Цена) И Не (Режим = "ПечатьЭтикеток") Тогда
				ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не заполнена цена'"));	
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнена цена в строке: %1'"),
					НомерСтроки + 1);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,,
					"Объект.Товары["+НомерСтроки+"].Цена",,
					);
				Возврат;
			КонецЕсли;
			
			//Если Строка.Выбран И Не ЗначениеЗаполнено(Строка.ЦенаДополнительно) Тогда
			//	ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не заполнена дополнительная цена'"));	
			//	
			//	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//		НСтр("ru = 'Не заполнена дополнительная цена цена в строке: %1'"),
			//		НомерСтроки + 1);
			//	
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			//		ТекстСообщения,,
			//		"Объект.Товары["+НомерСтроки+"].ЦенаДополнительно",,
			//		);
			//	Возврат;
			//КонецЕсли;
		КонецЦикла;		
		
		Если ЗначениеЗаполнено(Режим) И (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников") Тогда
		
			УжеБылаПечатьЦенников = Ложь;
			Для Каждого Строка Из Объект.Товары Цикл
				Если Строка.Выбран И Строка.БылаПечать Тогда
					УжеБылаПечатьЦенников = Истина;
					Прервать;
				КонецЕсли
			КонецЦикла;
					
			Если УжеБылаПечатьЦенников Тогда
				
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПечатиЦенников", ЭтотОбъект);	
	 
			    ПоказатьВопрос(Оповещение,
			        "По некоторым выбранным позициям уже были распечатаны ценники в текущем периоде. Продолжить печать?",
			        РежимДиалогаВопрос.ДаНет,
			        0, 
			        КодВозвратаДиалога.Нет, 
			        "Подтверждение печати" 
			    ); 				
			Иначе
				ПечатьСЗаписьюВРегистрПослеНаСервере();
				ПечатьЭтикетокИЦенниковНаПринтер();
			КонецЕсли;		
			
		ИначеЕсли Режим = "ПечатьТабличныхЦенников" Тогда 
			ПечатьТабличныхЦенниковНаКлиенте();
		Иначе	
			ПечатьЭтикетокИЦенниковНаПринтер();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПечатиЦенников(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        ПечатьСЗаписьюВРегистрПослеНаСервере();	
		ПечатьЭтикетокИЦенниковНаПринтер();
    КонецЕсли;	
 
КонецПроцедуры

&НаСервере
Процедура ПечатьСЗаписьюВРегистрПослеНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Сообщить("Заполните подразделение!");
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();

	Для Каждого Строка Из Объект.Товары Цикл
		Если Строка.Выбран Тогда
			ДатаУстановкиЦены = ЦеныНоменклатурыСрезПоследних(ТекДата, Объект.ВидЦены, Строка.Номенклатура, Строка.Характеристика, Строка.ДатаПоследнегоИзмененияЦены);
			
			НаборЗаписей = РегистрыСведений.СобытияПечатиЦенников.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ТекДата);
			НаборЗаписей.Отбор.Подразделение.Установить(Объект.Подразделение);
			НаборЗаписей.Отбор.ВидЦены.Установить(Объект.ВидЦены); 
			НаборЗаписей.Отбор.ДатаУстановкиЦены.Установить(ДатаУстановкиЦены); 
			НаборЗаписей.Отбор.Номенклатура.Установить(Строка.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(Строка.Характеристика);
			НаборЗаписей.Отбор.ШаблонЦенника.Установить(Строка.ШаблонЦенника);
			
		 	НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Период = ТекДата; 
			НоваяЗапись.Подразделение = Объект.Подразделение; 
			НоваяЗапись.Номенклатура = Строка.Номенклатура;
			НоваяЗапись.Характеристика = Строка.Характеристика;
		 	НоваяЗапись.ВидЦены = Объект.ВидЦены; 
			НоваяЗапись.ДатаУстановкиЦены = ДатаУстановкиЦены; 
			НоваяЗапись.ШаблонЦенника = Строка.ШаблонЦенника;
			НоваяЗапись.Цена = Строка.Цена;
			НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			НаборЗаписей.Записать(); 	
		КонецЕсли;
	КонецЦикла; 
	
	ТаблицаЗначенийТовары = Объект.Товары.Выгрузить();
	ПроверитьСобытияПечати(ТаблицаЗначенийТовары, Объект.ВидЦены);
КонецПроцедуры

&НаСервере
Функция ЦеныНоменклатурыСрезПоследних(Дата, ВидЦены, Номенклатура, Характеристика, ЗначениеПоУмолчанию)   
	
	Если Не ЗначениеЗаполнено(ЗначениеПоУмолчанию) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаПоследнегоИзмененияЦены
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|			КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
			|			ВидЦены = &ВидЦены
			|				И Номенклатура = &Номенклатура
			|				И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ДатаПоследнегоИзмененияЦены;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

&НаСервере
Функция БылаПечатиПозиции(Номенклатура, Характеристика, ВидЦены, ДатаУстановкиЦены, ШаблонЦенника)
	
	БылаПечать = Ложь;
	
	Если ЗначениеЗаполнено(Режим)
		И (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			" ВЫБРАТЬ Номенклатура 
			|ИЗ
			|	РегистрСведений.СобытияПечатиЦенников КАК СобытияПечати
			|		ГДЕ СобытияПечати.Номенклатура = &Номенклатура
			|		И СобытияПечати.Характеристика = &Характеристика
			|		И СобытияПечати.ВидЦены = &ВидЦены	
			|		И НАЧАЛОПЕРИОДА(СобытияПечати.ДатаУстановкиЦены, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаУстановкиЦены, ДЕНЬ)		
			|		И СобытияПечати.ШаблонЦенника = &ШаблонЦенника
			|		И СобытияПечати.Подразделение = &Подразделение";	
			
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			Запрос.УстановитьПараметр("Характеристика", Характеристика);
			Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
			Запрос.УстановитьПараметр("ДатаУстановкиЦены", ДатаУстановкиЦены);
			Запрос.УстановитьПараметр("ШаблонЦенника", ШаблонЦенника); 
			Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
			
			БылаПечать = НЕ Запрос.Выполнить().Пустой();
			//Выборка = Запрос.Выполнить().Выбрать();
			//Если Выборка.Количество() > 0 Тогда 
			//	БылаПечать = Истина
			//КонецЕсли;	
		КонецЕсли;
		
		Возврат БылаПечать;
			
КонецФункции	

&НаСервере
Процедура ПроверитьСобытияПечати(ТоварыДляПечати, ВидЦены)
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Сообщить("Заполните подразделение!");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Режим)
		И (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ТаблицаТовары.ДатаПоследнегоИзмененияЦены КАК ДатаПоследнегоИзмененияЦены,
		|	ТаблицаТовары.ШаблонЦенника КАК ШаблонЦенника
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	&ВидЦены КАК ВидЦены,
		|	НАЧАЛОПЕРИОДА(Товары.ДатаПоследнегоИзмененияЦены, ДЕНЬ) КАК ДатаУстановкиЦены,
		|	Товары.ШаблонЦенника КАК ШаблонЦенника
		|ИЗ
		|	Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияПечатиЦенников КАК СобытияПечати
		|		ПО Товары.Номенклатура = СобытияПечати.Номенклатура
		|			И Товары.Характеристика = СобытияПечати.Характеристика
		|			И (&ВидЦены = СобытияПечати.ВидЦены)
		|			И (НАЧАЛОПЕРИОДА(Товары.ДатаПоследнегоИзмененияЦены, ДЕНЬ) = НАЧАЛОПЕРИОДА(СобытияПечати.ДатаУстановкиЦены, ДЕНЬ))
		|			И Товары.ШаблонЦенника = СобытияПечати.ШаблонЦенника
		|			И (&Подразделение = СобытияПечати.Подразделение)";			
		
		Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыДляПечати);
		Запрос.УстановитьПараметр("ВидЦены", ВидЦены); 
		Запрос.УстановитьПараметр("Подразделение",  Объект.Подразделение);
		
		ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Строка Из Объект.Товары Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", Строка.Номенклатура);
			ПараметрыОтбора.Вставить("Характеристика", Строка.Характеристика);
			ПараметрыОтбора.Вставить("ШаблонЦенника", Строка.ШаблонЦенника);
			ПараметрыОтбора.Вставить("ВидЦены", Объект.ВидЦены); 
			ПараметрыОтбора.Вставить("ДатаУстановкиЦены", НачалоДня(Строка.ДатаПоследнегоИзмененияЦены));
			НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Строка.БылаПечать = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПечатьПозиции()
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Сообщить("Заполните подразделение!");
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Режим)
		И (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников") Тогда
		
		Данные = Элементы.Товары.ТекущиеДанные;
		Данные.БылаПечать = БылаПечатиПозиции(Данные.Номенклатура, Данные.Характеристика, Объект.ВидЦены, Данные.ДатаПоследнегоИзмененияЦены, Данные.ШаблонЦенника)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеВТаблицуЗначений(НомерСтроки = Неопределено, Номенклатура = Неопределено)

	ТаблЗнач = Новый ТаблицаЗначений;
	ТаблЗнач.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблЗнач.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	ТекущаяСтрока = ТаблЗнач.Добавить();
	ТекущаяСтрока.НомерСтроки = НомерСтроки;
	ТекущаяСтрока.Номенклатура = Номенклатура;
	
	ОбновитьЦенуНКТовара(ТаблЗнач, Объект.ВидЦены);

КонецПроцедуры


&НаКлиенте
Процедура Док_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	ПроверитьПечатьПозиции();
	ЗаменитьШаблонЦенника();
		
	НомерСтроки = Элементы.Товары.ТекущиеДанные.НомерСтроки;
	Номенклатура = Элементы.Товары.ТекущиеДанные.Номенклатура;
	ПолучитьДанныеВТаблицуЗначений(НомерСтроки, Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыХарактеристикаПриИзмененииПосле(Элемент)
	ПроверитьПечатьПозиции()
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыШаблонЦенникаПриИзмененииПосле(Элемент)
	Данные = Элементы.Товары.ТекущиеДанные;
	Если не Данные.БылаПечать Тогда
		ПроверитьПечатьПозиции();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_УстановитьРежимПечатьЦенниковПосле(Команда)
	ИспользоватьУсловноеОформлениеДляПечати();
	Обр_ОбновитьВидимостьЗависимыхОтШаблонаПолей();
КонецПроцедуры

&НаКлиенте
Процедура Док_УстановитьРежимПечатьЭтикетокИЦенниковПосле(Команда)
	ИспользоватьУсловноеОформлениеДляПечати();
	Обр_ОбновитьВидимостьЗависимыхОтШаблонаПолей();
КонецПроцедуры

&НаКлиенте
Процедура Док_УстановитьРежимПечатьЭтикетокПосле(Команда)
	Обр_ОбновитьВидимостьЗависимыхОтШаблонаПолей();
	ИспользоватьУсловноеОформлениеДляПечати();
КонецПроцедуры

Процедура УстановитьОтборПоДатеИзмененияЦены(ВидСравнения, ДатаГраницы, Начало)
	Поле = Новый ПолеКомпоновкиДанных("ДатаПоследнегоИзмененияЦены");
	
	Отбор = КомпоновщикНастроек.Настройки.Отбор;
	Для Каждого ЭлементОтбора Из Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если ЭлементОтбора.ЛевоеЗначение = Поле И ЭлементОтбора.ВидСравнения = ВидСравнения Тогда
			НайденныйЭлемент = ЭлементОтбора;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДатаГраницы) Тогда
		Если НайденныйЭлемент = Неопределено Тогда
			НайденныйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		КонецЕсли;
		
		НайденныйЭлемент.Использование  = Истина;
		НайденныйЭлемент.ЛевоеЗначение  = Поле;
		НайденныйЭлемент.ВидСравнения = ВидСравнения;
		Если Начало Тогда
			НайденныйЭлемент.ПравоеЗначение = НачалоДня(ДатаГраницы);
		Иначе
			НайденныйЭлемент.ПравоеЗначение = КонецДня(ДатаГраницы);
		КонецЕсли;
	Иначе
		Если НайденныйЭлемент <> Неопределено Тогда
			Отбор.Элементы.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПериодПоследнегоИзмененияЦеныПриИзмененииПосле(Элемент)
	
	УстановитьОтборПоДатеИзмененияЦены(ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ПериодПоследнегоИзмененияЦены.ДатаНачала, Истина);
	УстановитьОтборПоДатеИзмененияЦены(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ПериодПоследнегоИзмененияЦены.ДатаОкончания, Ложь);
	
	Объект.Дата = КонецДня(ПериодПоследнегоИзмененияЦены.ДатаОкончания);
	Объект.ДатаДополнительно = КонецДня(ПериодПоследнегоИзмененияЦены.ДатаОкончания);
	
	Если ЗначениеЗаполнено(ПериодПоследнегоИзмененияЦены.ДатаНачала) И ЗначениеЗаполнено(ПериодПоследнегоИзмененияЦены.ДатаОкончания) Тогда
		
		ЗаполнитьТаблицуТоваровНаСервере(Ложь);
		ПроверитьСобытияПослеЗаполения();
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	
	УстановитьОтборПоДатеИзмененияЦены(ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ПериодПоследнегоИзмененияЦены.ДатаНачала, Истина);
	УстановитьОтборПоДатеИзмененияЦены(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ПериодПоследнегоИзмененияЦены.ДатаОкончания, Ложь);
		
	ЗаполнитьСписокПринтеровНаКлиенте();
	
	Если ЗначениеЗаполнено(Режим) Тогда // установка режима печати (типовой функционал сломан доработками)
		Обр_ОбновитьВидимостьЗависимыхОтШаблонаПолей();
		ИспользоватьУсловноеОформлениеДляПечати();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПринтеровНаКлиенте()
	
	Элементы.Принтер.СписокВыбора.Добавить("Принтер по умолчанию", "Принтер по умолчанию");
	Принтеры = Новый COMОбъект("WScript.Network"); 
	Prn = Принтеры.EnumPrinterConnections(); 
	КоличествоПринтеров = Prn.Count() - 1;
	Для Счетчик = 1 По КоличествоПринтеров Цикл
		Элементы.Принтер.СписокВыбора.Добавить(Prn.Item(Счетчик), Prn.Item(Счетчик));
		Счетчик = Счетчик + 1; // потому что имена идут парами: resource name + printer name
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСобытияПослеЗаполения()
	Если Объект.Товары.Количество() > 0 Тогда
		ТаблицаЗначенийТовары = Объект.Товары.Выгрузить();
		ПроверитьСобытияПечати(ТаблицаЗначенийТовары, Объект.ВидЦены);
		Элементы.Товары.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&Вместо("ЗаполнитьТаблицуТоваров")
Процедура Док_ЗаполнитьТаблицуТоваровВместо(Команда)    
	//+Альтерра
	СФП_МаркерыКлиент.МаркерНачало("Печать этикеток и ценников: заполнить таблицу товаров");    
	//-
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Товары.Количество() = 0 Тогда
		
		ЗаполнитьТаблицуТоваровНаСервере(Ложь);
		//+Альтерра
		ПроверитьСобытияПослеЗаполения();
		//-
	Иначе
		ТекстВопроса = НСтр("ru = 'Сохранить данные о количестве, шаблонах в табличной части при перезаполнении?'");
		Результат = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("Расш1_ЗаполнитьТаблицуТоваровЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да);

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
&Вместо("ЗаполнитьТаблицуТоваровЗавершение")
Процедура Расш1_ЗаполнитьТаблицуТоваровЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Результат = РезультатВопроса;
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьТаблицуТоваровНаСервере(Истина, Истина);
		//+Альтерра
		ПроверитьСобытияПослеЗаполения();
		ЗаменитьШаблонЦенника();
		//-
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗаполнитьТаблицуТоваровНаСервере(Ложь, Истина);
		//+Альтерра
		ПроверитьСобытияПослеЗаполения();
		//-
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&Вместо("ПерезаполнитьЦены")
Процедура Расш1_ПерезаполнитьЦены()
	
	Если Объект.Товары.Количество() > 0 Тогда
	
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Перезаполнить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Нет'"));
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("Расш1_ПерезаполнитьЦеныВопросЗавершение", ЭтотОбъект),
			НСтр("ru = 'Перезаполнить цены?'"),
			Кнопки,,
			КодВозвратаДиалога.Да);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Вместо("ПерезаполнитьЦеныВопросЗавершение")
Процедура Расш1_ПерезаполнитьЦеныВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуТоваровНаСервере(Истина, Истина);
		//+Альтерра
		ПроверитьСобытияПослеЗаполения();
		//-
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ВключитьНапечатанныеТоварыПриИзмененииПосле(Элемент)
	Если ВключитьНапечатанныеТовары Тогда
		Элементы.Товары.ОтборСтрок = Неопределено;
	Иначе
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("БылаПечать", Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ВыбратьВыделенныеСтрокиВместо(Команда)
	Для Каждого Строка Из Объект.Товары Цикл
		Строка.Выбран = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Док_ИсключитьВыделенныеСтрокиВместо(Команда)
	Для Каждого Строка Из Объект.Товары Цикл
		Строка.Выбран = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПечатьВместо(Команда)
	ОчиститьСообщения();
	
	РезультатПроверки = ВыполнитьПроверку(ЭтаФорма);
	Если Не РезультатПроверки.ТоварыВыбраны Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не выбрано ни одного товара'"));
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверки.ПроверкаВыполнена Тогда
		Если Режим = "ПечатьТабличныхЦенников" Тогда  
			ПечатьТабличныхЦенниковНаКлиенте();
		Иначе	
			ПараметрКоманды = Новый Массив;
			ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
			
			ИменаМакетов = "";
			
			Если Режим = "ПечатьЭтикетокИЦенников" Тогда
				ИменаМакетов = "ЭтикеткаТовары,ЦенникТовары";
			ИначеЕсли Режим = "ПечатьЦенников" Тогда
				ИменаМакетов = "ЦенникТовары";
			ИначеЕсли Режим = "ПечатьЭтикеток" Тогда
				ИменаМакетов = "ЭтикеткаТовары";
			КонецЕсли;
			
			ПараметрыПечати =  ПолучитьПараметры();
			ИмяМенеджераПечати = "Обработка.ПечатьЭтикетокИЦенников";
		
		
			ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
			ПараметрыОткрытия.ИмяМенеджераПечати = ИмяМенеджераПечати;
			ПараметрыОткрытия.ИменаМакетов		 = ИменаМакетов;
			ПараметрыОткрытия.ПараметрКоманды	 = ПараметрКоманды;
			ПараметрыОткрытия.ПараметрыПечати	 = ПараметрыПечати;
			
			ФормаПечати = ПолучитьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, Строка(Новый УникальныйИдентификатор));
			ФормаПечати.Заголовок = "Предпросмотр этикеток и ценников (НЕЛЬЗЯ ПЕЧАТАТЬ ЦЕННИКИ ИЗ ПРЕДПРОСМОТРА!)";
			ФормаПечати.Элементы.КнопкаПечатьКоманднаяПанель.Видимость = Ложь;
			ФормаПечати.Элементы.КнопкаПредварительныйПросмотр.Видимость = Ложь;
			ФормаПечати.Элементы.Копий.Видимость = Ложь;
			ФормаПечати.Элементы.КнопкаПечатьВсеДействия.Видимость = Ложь;
			ФормаПечати.Элементы.КнопкаПредварительныйПросмотрВсеДействия.Видимость = Ложь;
			ФормаПечати.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&Вместо("ПриИзмененииНоменклатуры")
Функция Док_ПриИзмененииНоменклатуры(ТекущиеДанные)

// Поля необходимые для вывода в таблицу товаров на форме.
	СтруктураНастроек = Обработки.ПечатьЭтикетокИЦенников.СтруктураНастроек();
	
	УстановитьОбязательныеПоляДанных(СтруктураНастроек, Истина);
	
	УстановитьПараметрыДанных(СтруктураНастроек);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Если ИспользоватьСерииНоменклатуры Тогда
		Таблица.Колонки.Добавить("Серия",          Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	КонецЕсли;
	Таблица.Колонки.Добавить("Упаковка",       Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Таблица.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число"));
	НоваяСтрока = Таблица.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаТовары";
	СтруктураНастроек.ИсходныеДанные                 = Таблица;
	
	СтруктураНастроек.ИспользуетсяЦенообразование25 = ИспользуетсяЦенообразование25;
	
	//+Альтерра
	СтруктураНастроек.Приоритет13ЗначногоШтрихкода = Приоритет13ЗначногоШтрихкода;
	//-
	
	СтруктураРезультата = Обработки.ПечатьЭтикетокИЦенников.ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");
	Данные = СтруктураРезультата.Таблица[0];
	
	//+Альтерра
	ВозвращаемоеЗначение = Новый Структура("Штрихкод, Весовой, ОстатокНаСкладе, Цена, ЦенаДополнительно, ДатаПоследнегоИзмененияЦены, ДатаПоследнегоИзмененияЦеныДополнительно, ШаблонЭтикетки, ШаблонЦенника, ХарактеристикиИспользуются");
	//-
	ВозвращаемоеЗначение.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.ПодготовитьШтрихкод(
		Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Штрихкод"]]);
	ВозвращаемоеЗначение.Цена            = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Цена"]];
	ВозвращаемоеЗначение.ДатаПоследнегоИзмененияЦены = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ДатаПоследнегоИзмененияЦены"]];
	
	//+Альтерра
	Если ИспользоватьВидЦеныДополнительно И ЗначениеЗаполнено(Объект.ВидЦеныДополнительно) Тогда
		ВозвращаемоеЗначение.ЦенаДополнительно            = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ЦенаДополнительно"]];	
		ВозвращаемоеЗначение.ДатаПоследнегоИзмененияЦеныДополнительно = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ДатаПоследнегоИзмененияЦеныДополнительно"]];	
	КонецЕсли;
	//-
	
	ВозвращаемоеЗначение.Весовой         = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Весовой"]];
	ВозвращаемоеЗначение.ОстатокНаСкладе = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ОстатокНаСкладе"]];
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		ВозвращаемоеЗначение.ХарактеристикиИспользуются = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ХарактеристикиИспользуются"]];
	Иначе
		ВозвращаемоеЗначение.ХарактеристикиИспользуются = Ложь;
	КонецЕсли;
	
	ШаблонЦенникаВидаНоменклатуры      = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ВидНоменклатуры.ШаблонЦенника")];
	ШаблонЦенникаНоменклатуры          = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ШаблонЦенника")];
	ВозвращаемоеЗначение.ШаблонЦенника = ?(ЗначениеЗаполнено(ШаблонЦенникаНоменклатуры), ШаблонЦенникаНоменклатуры, ШаблонЦенникаВидаНоменклатуры);
	
	ШаблонЦенникаВидаНоменклатуры       = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ВидНоменклатуры.ШаблонЭтикетки")];
	ШаблонЦенникаНоменклатуры           = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ШаблонЭтикетки")];
	ВозвращаемоеЗначение.ШаблонЭтикетки = ?(ЗначениеЗаполнено(ШаблонЦенникаНоменклатуры), ШаблонЦенникаНоменклатуры, ШаблонЦенникаВидаНоменклатуры);
	
	Если ТекущиеДанные.Свойство("СтараяУпаковка") Тогда
		КоэффициентСтаройУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ТекущиеДанные.СтараяУпаковка, ТекущиеДанные.Номенклатура);
	    КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ТекущиеДанные.Упаковка, ТекущиеДанные.Номенклатура);

		КоличествоВДокументе = ТекущиеДанные.СтароеКоличествоВДокументе
		/ ?(ЗначениеЗаполнено(КоэффициентУпаковки), КоэффициентУпаковки, 1)
		* ?(ЗначениеЗаполнено(КоэффициентСтаройУпаковки), КоэффициентСтаройУпаковки, 1);   
		
		КоличествоЭтикеток = ТекущиеДанные.КоличествоЭтикеток
		/ ?(ЗначениеЗаполнено(КоэффициентУпаковки), КоэффициентУпаковки, 1)
		* ?(ЗначениеЗаполнено(КоэффициентСтаройУпаковки), КоэффициентСтаройУпаковки, 1);
	
		ВозвращаемоеЗначение.Вставить("КоличествоЭтикеток", КоличествоЭтикеток);
		ВозвращаемоеЗначение.Вставить("Количество", КоличествоВДокументе);
		ВозвращаемоеЗначение.Вставить("КоличествоВДокументе", КоличествоВДокументе);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
КонецФункции

&НаКлиенте
Процедура Док_УстановитьРежимПечатьТабличныхЦенниковВместо(Команда) 
	УстановитьРежимПечатьТабличныхЦенниковНаСервере(); 
КонецПроцедуры      

&НаСервере
Процедура УстановитьРежимПечатьТабличныхЦенниковНаСервере() 
	АвтоЗаголовок = Ложь;
	Режим = "ПечатьТабличныхЦенников";
	
	Если ПечатьИзДокумента Тогда
		Заголовок = НСтр("ru = 'Печать табличных ценников из документа'");
	Иначе
		Заголовок = НСтр("ru = 'Печать табличных ценников'");
	КонецЕсли;
	
	Элементы.ТоварыШаблонЦенника.Видимость = Ложь; 
	Элементы.ТоварыШаблонЭтикетки.Видимость = Ложь; 
	Элементы.ТоварыКоличествоЦенников.Видимость = Ложь;
	Элементы.ТоварыКоличествоЭтикеток.Видимость = Ложь;
КонецПроцедуры	

&НаКлиенте
Процедура ПечатьТабличныхЦенниковНаКлиенте()
ТабличныйЦенник = ПечатьТабличныхЦенниковНаСервере();

Если ТабличныйЦенник.ТабличныйЦенник = Неопределено Тогда
	Сообщить("Нет товаров из коллекций!");
Иначе	
	ТабличныйЦенник.ТабличныйЦенник.ОтображатьСетку = Ложь;
	ТабличныйЦенник.ТабличныйЦенник.Защита = Ложь;
	ТабличныйЦенник.ТабличныйЦенник.ТолькоПросмотр = Ложь;
	ТабличныйЦенник.ТабличныйЦенник.ОтображатьЗаголовки = Ложь;
	ТабличныйЦенник.ТабличныйЦенник.Показать();	
КонецЕсли;	

Если ТабличныйЦенник.БылиОшибки<>"" Тогда  
	ПоказатьОповещениеПользователя(ТабличныйЦенник.БылиОшибки,,,БиблиотекаКартинок.Предупреждение32,СтатусОповещенияПользователя.Важное);
КонецЕсли;	   

КонецПроцедуры	

&НаСервере
Функция ПечатьТабличныхЦенниковНаСервере()   
	БылиОшибки = "";
	//+++Подготовка товаров    
	// Выборка коллекций для номеклатуры
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));  
	ТаблицаТоваров.Колонки.Добавить("ЦенаДополнительно",Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число"));
	Для Каждого Элемент Из Объект.Товары Цикл 
		Если Элемент.Выбран Тогда 
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;  
			НоваяСтрока.ЦенаДополнительно = Элемент.ЦенаДополнительно;
			НоваяСтрока.Цена = Элемент.Цена;  
		КонецЕсли;
	КонецЦикла;	  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗначений.Номенклатура КАК Номенклатура,
		|	ТаблицаЗначений.ЦенаДополнительно КАК ЦенаДополнительно,
		|	ТаблицаЗначений.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаЗначений КАК ТаблицаЗначений
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ.ЦенаДополнительно КАК ЧИСЛО(16)) КАК ЦенаДополнительно,
		|	ВЫРАЗИТЬ(ВТ.Цена КАК ЧИСЛО(16)) КАК Цена,   
		|	ВЫРАЗИТЬ(ВЫБОР
		|	КОГДА ВТ.Номенклатура.ПлощадьЧислитель <> 0
		|		ТОГДА ВТ.ЦенаДополнительно * (ВТ.Номенклатура.ПлощадьЗнаменатель / ВТ.Номенклатура.ПлощадьЧислитель) + 0.049 
		|	КОНЕЦ КАК ЧИСЛО(16)) КАК ЦенаЗаМ2Дополнительно,
		|	ВЫРАЗИТЬ(ВЫБОР
		|	КОГДА ДополнительныеРеквизиты.Ссылка.ПлощадьЧислитель <> 0
		|		ТОГДА ВТ.Цена * (ВТ.Номенклатура.ПлощадьЗнаменатель / ВТ.Номенклатура.ПлощадьЧислитель) + 0.049
		|	КОНЕЦ КАК ЧИСЛО(16)) КАК ЦенаЗаМ2,
		|	ДополнительныеРеквизиты.Значение КАК Коллекция
		|ИЗ
		|	ВТ КАК ВТ 
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|		ПО (ДополнительныеРеквизиты.Ссылка = ВТ.Номенклатура)
		|ГДЕ
		|	ДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""Коллекция%""	";
	
	Запрос.УстановитьПараметр("ТаблицаЗначений",ТаблицаТоваров);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	//-                 
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");  
	ТаблицаТоваров.Колонки.Добавить("Коллекция");     
	ТаблицаТоваров.Колонки.Добавить("ЦенаДополнительно",Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ЦенаЗаМ2Дополнительно",Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ЦенаЗаМ2",Новый ОписаниеТипов("Число"));   
	ТаблицаТоваров.Колонки.Добавить("Порядок",Новый ОписаниеТипов("Число"));   
	Если Выборка.Количество()=0 Тогда 
		Возврат Неопределено;
	КонецЕсли;	 
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
	Пока Выборка.Следующий() Цикл   
		// Проверка заполнения реквизитов
		Если НЕ ЗначениеЗаполнено(Выборка.Коллекция) Тогда 
			Сообщение.Текст = ("Не заполнена коллекция по номенклатуре - "+Выборка.Номенклатура);
			Сообщение.КлючДанных = Выборка.Номенклатура.Ссылка; 
			Сообщение.Сообщить();	
			БылиОшибки = "Не заполнены коллекции по номенклатуре.";
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаТоваров.Добавить();
		//Обработка наименования 
		//Назначение порядка сортировки от вида номенклатуры 
		СтрокаДляПечати = Выборка.Номенклатура.НаименованиеПолное;
		Если Найти(СтрокаДляПечати,"облицовочная")>0 Тогда 
			НоваяСтрока.Порядок = 1;
		ИначеЕсли Найти(СтрокаДляПечати,"екор")>0 Тогда	
			НоваяСтрока.Порядок = 2;
		ИначеЕсли Найти(СтрокаДляПечати,"анно")>0 Тогда	
			НоваяСтрока.Порядок = 3;
		ИначеЕсли Найти(СтрокаДляПечати,"ордюр")>0 Тогда	
			НоваяСтрока.Порядок = 4;
		ИначеЕсли Найти(СтрокаДляПечати,"Плитка для пола")>0 Тогда	
			НоваяСтрока.Порядок = 5;
		ИначеЕсли Найти(СтрокаДляПечати,"Вставка для пола")>0 Тогда	
			НоваяСтрока.Порядок = 6;
		Иначе
			НоваяСтрока.Порядок = 7;
		КонецЕсли;	 
		//-       
		//Удаляем значения в скобках
		ПервыйСимвол = Найти(СтрокаДляПечати,"(");
		ЧислоСимволов = Найти(СтрокаДляПечати,")") + 1 - ПервыйСимвол; 
		Если ПервыйСимвол>0 и ЧислоСимволов>0 Тогда  
			Подстрока = Сред(СтрокаДляПечати,ПервыйСимвол,ЧислоСимволов);
			СтрокаДляПечати = СтрЗаменить(СтрокаДляПечати, Подстрока, "");
		КонецЕсли;
		//-  
		//Удаляем наименование коллекции   
		ЧислоСимволов = СтрДлина(Выборка.Коллекция.Наименование);
		СтрокаКолекции = Лев(Выборка.Коллекция.Наименование,ЧислоСимволов-2);
		ПервыйСимвол = Найти(СтрокаДляПечати,СтрокаКолекции);
		Если ПервыйСимвол>0 и ЧислоСимволов>0 Тогда  
			Подстрока = Сред(СтрокаДляПечати,ПервыйСимвол-1,ЧислоСимволов+1);
			СтрокаДляПечати = СтрЗаменить(СтрокаДляПечати, Подстрока, "");
		КонецЕсли;
		//-
		СтрокаДляПечати = СтрЗаменить(СтрокаДляПечати,Выборка.Коллекция.Наименование,"");
		Если ЗначениеЗаполнено(Выборка.Номенклатура.Артикул) Тогда 
			СтрокаДляПечати = СтрокаДляПечати +" арт." + Выборка.Номенклатура.Артикул;
		КонецЕсли;    
		СтрокаДляПечати = СокрЛП(СтрЗаменить(СтрокаДляПечати,"Плитка",""));
		ПервыйСимвол = Лев(СтрокаДляПечати,1);
		ПервыйСимвол = ВРег(ПервыйСимвол);
		СтрокаДляПечати = ПервыйСимвол+Прав(СтрокаДляПечати,СтрДлина(СтрокаДляПечати)-1);
		//-      
		НоваяСтрока.Номенклатура = СтрокаДляПечати;
		НоваяСтрока.ЦенаДополнительно = Выборка.ЦенаДополнительно; 
		НоваяСтрока.Цена = Выборка.Цена;
		НоваяСтрока.ЦенаЗаМ2Дополнительно = Выборка.ЦенаЗаМ2; 
		НоваяСтрока.ЦенаЗаМ2 = Выборка.ЦенаЗаМ2Дополнительно; 
		НоваяСтрока.Коллекция = Выборка.Коллекция.Наименование;
	КонецЦикла;       
	ТаблицаТоваров.Сортировать("Коллекция,Порядок,Номенклатура");      
	
//+++Подготовка макета печати	        
	ТекДата = ТекущаяДата();
	ТабличныйЦенник = Новый ТабличныйДокумент;
	Макет = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Док_ТабличныйЦенник");
	НаименованиеКоллекции = "Начальная";
	// Товары
	Товары = Макет.ПолучитьОбласть("Товары");
	Для Каждого СтрокаТовары Из ТаблицаТоваров Цикл 
		Если НаименованиеКоллекции <> СтрокаТовары.Коллекция Тогда  
			Если НаименованиеКоллекции <> "Начальная" Тогда  
				// Подвал
				Подвал = Макет.ПолучитьОбласть("Подвал");
				Подвал.Параметры.Дата = Формат(ТекДата,"ДФ=dd.MM.yyyy");
				ТабличныйЦенник.Вывести(Подвал);
			КонецЕсли;	
			// Шапка
			Шапка = Макет.ПолучитьОбласть("Шапка");  
			НаименованиеКоллекции = СтрокаТовары.Коллекция;
			Шапка.Параметры.Коллекция = НаименованиеКоллекции;
			КодСимвола = 65;
			ТабличныйЦенник.Вывести(Шапка); 
		КонецЕсли;	
		
		Товары.Параметры.Заполнить(СтрокаТовары); 
		Товары.Параметры.Символ = Символ(КодСимвола);
		КодСимвола = КодСимвола + 1;
		ТабличныйЦенник.Вывести(Товары);
	КонецЦикла;
	// Подвал
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Дата = Формат(ТекДата,"ДФ=dd.MM.yyyy");
	ТабличныйЦенник.Вывести(Подвал);
//+++Подготовка макета печати 

Если БылиОшибки<>"" Тогда    
	БылиОшибки = БылиОшибки+" Посмотрите все сообщения в форме ""Печать ценников""";
КонецЕсли;	   

Результат = Новый Структура;
Результат.Вставить("ТабличныйЦенник",ТабличныйЦенник);
Результат.Вставить("БылиОшибки",БылиОшибки);

Возврат Результат;	
КонецФункции	

&НаКлиенте
Процедура ЗагрузитьИзФайла_Альтерра(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура();
	ПараметрыФормы.Вставить("НастройкиТаблицы",СтруктураТаблицы());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция СтруктураТаблицы()
	
	СтруктураТаблицы = Новый Структура();
	
	СтруктураТаблицы.Вставить("Код","строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура","СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");

	Возврат  СтруктураТаблицы; 
	
КонецФункции 

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)
	
	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
				
		Для каждого СтрокаТЧ Из ТаблицаДанных Цикл 
			ТекущиеДанные = Новый Структура("Номенклатура, Характеристика, Упаковка",СтрокаТЧ.Номенклатура,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура; 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПриИзмененииНоменклатуры(ТекущиеДанные));
			Если Объект.ВидЦены.ФорматПодразделения = Справочники.ФорматыПодразделений.НайтиПоНаименованию("МД") Тогда
				НоменклатураСсылка = НоваяСтрока.Номенклатура;
				НоваяСтрока.ШаблонЦенника = НоменклатураСсылка.ШаблонЦенникаМД;
			КонецЕсли; 

		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриАктивизацииЯчейки")
Процедура Док_ТоварыПриАктивизацииЯчейки(Элемент)

	Если Не Элемент.ТекущийЭлемент = Элементы.ТоварыШтрихкод Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ТоварыШтрихкод.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;

	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",   ТекущиеДанные.Номенклатура);
	Структура.Вставить("Характеристика", ТекущиеДанные.Характеристика);
#Удаление
	Структура.Вставить("Упаковка",       ТекущиеДанные.Упаковка);
#КонецУдаления
#Вставка
	Структура.Вставить("Упаковка",       ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
#КонецВставки

	Элементы.ТоварыШтрихкод.СписокВыбора.ЗагрузитьЗначения(РозничныеПродажиВызовСервера.ПолучитьШтрихкодыНоменклатуры(Структура));

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТаблицуТоваровНаСервере")
Процедура Док_ЗаполнитьТаблицуТоваровНаСервере(СохранятьШаблоныИКоличество, ОбновлениеДанныхПоВыбраннымТоварам)

	КонтролироватьАссортимент = Ложь;
	Если Объект.РежимПолученияЦен = 2 Тогда
		
		КонтролироватьАссортимент = АссортиментСерверПовтИсп.КонтролироватьАссортимент(Объект.Склад, Объект.Дата);
		
	КонецЕсли;
	
	// Сохранение выбранных позиций для их последующего восстановления.
	Если СохранятьШаблоныИКоличество Тогда
		Если ИспользуетсяЦенообразование25 Тогда
			ТаблицаВыбранныеПозиции = Объект.Товары.Выгрузить(,"Номенклатура, Характеристика, Серия, Упаковка, ШаблонЦенника, КоличествоЦенников, ШаблонЭтикетки, КоличествоЭтикеток");
		Иначе
			ТаблицаВыбранныеПозиции = Объект.Товары.Выгрузить(,"Номенклатура, Характеристика, Упаковка, ШаблонЦенника, КоличествоЦенников, ШаблонЭтикетки, КоличествоЭтикеток");
		КонецЕсли;
	КонецЕсли;
	
	// Поля необходимые для вывода в таблицу товаров на форме.
	СтруктураНастроек = Обработки.ПечатьЭтикетокИЦенников.СтруктураНастроек();
	
	УстановитьОбязательныеПоляДанных(СтруктураНастроек, Истина);
	
	УстановитьПараметрыДанных(СтруктураНастроек);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	
	Если Объект.ИсходныеДанныеТовары.Количество() > 0 ИЛИ ПечатьИзДокумента ИЛИ ОбновлениеДанныхПоВыбраннымТоварам Тогда
		Если КонтролироватьАссортимент Тогда
			СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаТоварыАссортимент";
		Иначе
			СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаТовары";
		КонецЕсли;
		Если ОбновлениеДанныхПоВыбраннымТоварам Тогда
			Если ИспользуетсяЦенообразование25 Тогда
				ИсходныеДанные = Объект.Товары.Выгрузить(,"Номенклатура, Характеристика, Серия, Упаковка");
			Иначе
				ИсходныеДанные = Объект.Товары.Выгрузить(,"Номенклатура, Характеристика, Упаковка");
			КонецЕсли;
			ИсходныеДанные.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			СтруктураНастроек.ИсходныеДанные = ИсходныеДанные;
		Иначе
			СтруктураНастроек.ИсходныеДанные = Объект.ИсходныеДанныеТовары.Выгрузить();
		КонецЕсли;
	Иначе
		Если КонтролироватьАссортимент Тогда
			СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаБДТоварыАссортимент";
		Иначе
			СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаБДТовары";
		КонецЕсли;
	КонецЕсли;
	
	Объект.Товары.Очистить();

	НомерСтроки = 0;
	
	СтруктураНастроек.ИспользуетсяЦенообразование25 = ИспользуетсяЦенообразование25;
	
	#Вставка
	СтруктураНастроек.Приоритет13ЗначногоШтрихкода = Приоритет13ЗначногоШтрихкода;
	#КонецВставки
		
	// Загрузка сформированного списка товаров.
	СтруктураРезультата = Обработки.ПечатьЭтикетокИЦенников.ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");
	
	ПроверятьЕдиничнуюУпаковку = Истина;
	Если СтруктураРезультата.Таблица.Колонки.Найти("ИспользоватьУпаковки") = Неопределено 
		Или СтруктураРезультата.Таблица.Колонки.Найти("НеОднаЕдиничнаяУпаковка") = Неопределено Тогда
		ПроверятьЕдиничнуюУпаковку = Ложь;
	КонецЕсли;
	
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	
	Для Каждого СтрокаТЧ Из СтруктураРезультата.Таблица Цикл

#Вставка
// Здесь можно описать новое поведение.
		  //Сообщить("    "+ЗначениеЗаполнено(СтрокаТЧ.Упаковка));
		Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
			Продолжить;
		КонецЕсли;

#КонецВставки		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура         = СтрокаТЧ.Номенклатура;
		
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			НоваяСтрока.Характеристика       = СтрокаТЧ.Характеристика;
		КонецЕсли;
		Если ИспользоватьСерииНоменклатуры Тогда
			НоваяСтрока.Серия          = СтрокаТЧ.Серия;
		КонецЕсли;
		Если ИспользоватьУпаковкиНоменклатуры Тогда
			НоваяСтрока.Упаковка             = СтрокаТЧ.Упаковка;
		КонецЕсли;
		
		НоваяСтрока.Цена                        = СтрокаТЧ.Цена;
		НоваяСтрока.ДатаПоследнегоИзмененияЦены = СтрокаТЧ.ДатаПоследнегоИзмененияЦены;
		Если ЗначениеЗаполнено(Объект.ВидЦеныДополнительно) Тогда
			НоваяСтрока.ЦенаДополнительно                        = СтрокаТЧ.ЦенаДополнительно;
			НоваяСтрока.ДатаПоследнегоИзмененияЦеныДополнительно = СтрокаТЧ.ДатаПоследнегоИзмененияЦеныДополнительно;
		КонецЕсли;
		
		Если СтрокаТЧ.Весовой Тогда
			НоваяСтрока.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.ПодготовитьШтрихкод(СтрокаТЧ.Штрихкод);
		Иначе
			НоваяСтрока.Штрихкод = СтрокаТЧ.Штрихкод;
		КонецЕсли;
		
		ШаблонЦенникаВидаНоменклатуры    = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ВидНоменклатуры.ШаблонЦенника")];
		ШаблонЦенникаНоменклатуры        = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ШаблонЦенника")];
		НоваяСтрока.ШаблонЦенника        = ?(ЗначениеЗаполнено(ШаблонЦенникаНоменклатуры), ШаблонЦенникаНоменклатуры, ШаблонЦенникаВидаНоменклатуры);
		
		#Вставка
		Если Объект.ВидЦены.ФорматПодразделения = Справочники.ФорматыПодразделений.НайтиПоНаименованию("МД") Тогда
			НоменклатураСсылка = НоваяСтрока.Номенклатура;
			НоваяСтрока.ШаблонЦенника = НоменклатураСсылка.ШаблонЦенникаМД;
		КонецЕсли; 
		#КонецВставки
		
		ШаблонЦенникаВидаНоменклатуры    = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ВидНоменклатуры.ШаблонЭтикетки")];
		ШаблонЦенникаНоменклатуры        = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ШаблонЭтикетки")];
		НоваяСтрока.ШаблонЭтикетки       = ?(ЗначениеЗаполнено(ШаблонЦенникаНоменклатуры), ШаблонЦенникаНоменклатуры, ШаблонЦенникаВидаНоменклатуры);
		
		НоваяСтрока.ОстатокНаСкладе      = СтрокаТЧ.ОстатокНаСкладе;
		НоваяСтрока.КоличествоВДокументе = СтрокаТЧ.Количество;
		НоваяСтрока.Весовой              = СтрокаТЧ.Весовой;
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			НоваяСтрока.ХарактеристикиИспользуются = СтрокаТЧ.ХарактеристикиИспользуются;
		КонецЕсли;
		
		УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере(НоваяСтрока);
		
		// Восстановление позиций, сохраненных перед заполнением ТЧ.
		Если СохранятьШаблоныИКоличество Тогда
			ПараметрыОтбора = Новый Структура();
			ПараметрыОтбора.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
			Если ИспользоватьХарактеристикиНоменклатуры Тогда
				ПараметрыОтбора.Вставить("Характеристика", НоваяСтрока.Характеристика);
			КонецЕсли;
			Если ИспользоватьСерииНоменклатуры Тогда
				ПараметрыОтбора.Вставить("Серия", НоваяСтрока.Серия);
			КонецЕсли;
			Если ИспользоватьУпаковкиНоменклатуры Тогда
				ПараметрыОтбора.Вставить("Упаковка", НоваяСтрока.Упаковка);
			КонецЕсли;
			НайденныеСтроки = ТаблицаВыбранныеПозиции.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока.Выбран = Истина;
		НомерСтроки = НомерСтроки + 1;
		
		Если ПроверятьЕдиничнуюУпаковку Тогда
			Если СтрокаТЧ.ИспользоватьУпаковки
				И СтрокаТЧ.НеОднаЕдиничнаяУпаковка Тогда
				
				ТекстСообщения = НСтр("ru = 'У номенклатуры ""%Номенклатура%"" используется несколько упаковок с единицей измерения ""%ЕдиницаИзмерения%"" и коэффициентом 1. Для корректной привязки штрихкодов рекомендуется использовать одну единичную упаковку.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", Строка(СтрокаТЧ.Номенклатура));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмерения%", Строка(СтрокаТЧ.ЕдиницаИзмерения));
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					СтрокаТЧ.Номенклатура,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", НомерСтроки, "Номенклатура"),
					"Объект",
					Ложь);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьВидимостьЗависимыхОтШаблонаПолей();
	
	#Вставка
	ОбновитьЦенуНКТовара(Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура"), Объект.ВидЦены);
	#КонецВставки
	
	Элементы.Товары.Обновить();

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	

	УстановитьУсловноеОформление();

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	СтруктураДанных = Новый Структура;

	Если ЭтоАдресВременногоХранилища(Параметры.АдресВХранилище) Тогда

		СтруктураДанных = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);

	ИначеЕсли Параметры.Свойство("ПараметрыЗаполнения") Тогда

		СтруктураДанных = Параметры.ПараметрыЗаполнения;

	КонецЕсли;

	Если СтруктураДанных.Количество() > 0 Тогда

		Если СтруктураДанных.Свойство("Дата") Тогда
			Объект.Дата = СтруктураДанных.Дата;
		Иначе
			Объект.Дата = ТекущаяДатаСеанса();
		КонецЕсли;

		УстановитьИспользованиеЦенообразования(Объект.Дата);
		ЗаполнитьИсходныеТоварыПодготовитьПараметрыЗаполнения(СтруктураДанных);

	Иначе

		Объект.Дата = ТекущаяДатаСеанса();
		УстановитьИспользованиеЦенообразования(Объект.Дата);

	КонецЕсли;

	Если Параметры.Свойство("ПечатьНаПринтер", ПечатьНаПринтер)
		И СтруктураДанных.Свойство("Товары") Тогда

		ПроверитьЗаполнениеШаблоновЭтикеток(СтруктураДанных.Товары, Отказ);

		Если Отказ Тогда
			Возврат;
		КонецЕсли;

	Иначе
		ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

		ИспользоватьОбменСПодключаемымОборудованиемOffline = ПолучитьФункциональнуюОпцию(
		"ИспользоватьОбменСПодключаемымОборудованиемOffline");
	КонецЕсли;
	
	ПоддерживаемыеТипыПодключаемогоОборудования = "СканерШтрихкода";
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

	ИспользоватьАссортимент                        = ПолучитьФункциональнуюОпцию("ИспользоватьАссортимент");
	ПравоРегистрацииШтрихкодовНоменклатурыДоступно = ШтрихкодированиеНоменклатурыСервер.ПравоРегистрацииШтрихкодовНоменклатурыДоступно();

	ЗагрузитьНастройкиОтбораПоУмолчанию();

	Объект.НазначениеШаблона = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров;

	Если СтруктураДанных.Свойство("Товары") Тогда

		Если ЗначениеЗаполнено(СтруктураДанных.СтруктураДействий) Тогда

			ПараметрДействия = Неопределено;

			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьОрганизацию", ПараметрДействия) Тогда
				Объект.Организация = ПараметрДействия;
			КонецЕсли;

			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьСклад", ПараметрДействия) Тогда
				Если ЗначениеЗаполнено(ПараметрДействия) И ТипЗнч(ПараметрДействия) = Тип("СправочникСсылка.Склады") Тогда
					ТипСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрДействия, "ТипСклада");
					ЭтоРозничныйСклад = (ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин);
					Если ЭтоРозничныйСклад Тогда
						УстановитьЭлементОтбораСКД("Склад", ПараметрДействия, Истина);
						Объект.Склад = ПараметрДействия;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьВидЦены", ПараметрДействия) Тогда
				Объект.ВидЦены = ПараметрДействия;
			КонецЕсли;

			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьПравилоОбмена", ПараметрДействия) Тогда
				Объект.ПравилоОбмена = ПараметрДействия;
			КонецЕсли;

			Если СтруктураДанных.СтруктураДействий.Свойство("ПоказыватьКолонкуКоличествоВДокументе", ПараметрДействия) Тогда
				Элементы.ТоварыКоличествоВДокументе.Видимость = ПараметрДействия;
			КонецЕсли;

			Если СтруктураДанных.СтруктураДействий.Свойство("УстановитьРежимПечатиИзДокумента", ПараметрДействия) Тогда
				ПечатьИзДокумента = Истина;
				Элементы.Настройки.Видимость = Ложь;
			КонецЕсли;
			#Вставка
			ЭтоПорча = СтруктураДанных.СтруктураДействий.Свойство("ЭтоПорча", ПараметрДействия);
			#КонецВставки

			ЗаполнитьКоличествоЭтикетокПоДокументу        = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЭтикетокПоДокументу", ПараметрДействия);
			ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе", ПараметрДействия);
			ЗаполнитьКоличествоЦенниковПоДокументу        = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЦенниковПоДокументу", ПараметрДействия);
			ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе", ПараметрДействия);

			Если СтруктураДанных.СтруктураДействий.Свойство("УстановитьРежим", ПараметрДействия) Тогда
				УстановитьРежим(ПараметрДействия);
			Иначе
				ВызватьИсключение НСтр("ru = 'Режим печати не установлен'");
			КонецЕсли;

			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьТаблицуТоваров", ПараметрДействия) Тогда
				
				#Удаление
				ЗаполнитьТаблицуТоваровНаСервере(Истина);
				#КонецУдаления

				Если СтруктураДанных.Товары.Колонки.Найти("Цена") <> Неопределено Тогда

					Для Каждого СтрокаТЧ Из СтруктураДанных.Товары Цикл

						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
						ПараметрыОтбора.Вставить("Характеристика", СтрокаТЧ.Характеристика);
						Если ИспользуетсяЦенообразование25 Тогда
							Если ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
								ПараметрыОтбора.Вставить("Упаковка", СтрокаТЧ.Упаковка);
							КонецЕсли;
							Если ИспользоватьСерииНоменклатуры Тогда
								ПараметрыОтбора.Вставить("Серия", СтрокаТЧ.Серия);
							КонецЕсли;
						КонецЕсли;
						НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
						Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
							НайденнаяСтрока.Цена = СтрокаТЧ.Цена;
						КонецЦикла;

					КонецЦикла;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	Иначе

		// Вызов обработки из интерфейса
		ЗаполнитьКоличествоЭтикетокПоДокументу        = Ложь;
		ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе = Истина;
		ЗаполнитьКоличествоЦенниковПоДокументу        = Ложь;
		ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе = Истина;

		УстановитьРежимПечатьЭтикетокИЦенниковНаСервере();

	КонецЕсли;

	ОбновитьШаблоныВлияющиеНаВидимостьЭлементов();

	ОбновитьВидимостьЗависимыхОтШаблонаПолей();

	Элементы.ТоварыУстановитьНовыйШтрихкод.Доступность = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);

	Если ИспользоватьАссортимент Тогда
		Объект.РежимПолученияЦен = 2;
	Иначе
		Объект.РежимПолученияЦен = 1;
		Элементы.Склад.Видимость = Ложь;
	КонецЕсли;
	ПереключательРежимаПолученияЦенПриИзмененииСервер();

	ЗаполнитьЗначенияПоУмолчанию();
	
	#Вставка
	Если Параметры.Свойство("АдресВХранилище") Тогда
		Если ЗначениеЗаполнено(Параметры.АдресВХранилище) Тогда
			СтруктураДанных = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
			
			ШаблонЭтикетки= Справочники.ШаблоныЭтикетокИЦенников.НайтиПоНаименованию("Для принтера этикеток Zebra");
			Для Каждого стрТовар Из Объект.Товары Цикл
				стрТовар.ШаблонЭтикетки= ШаблонЭтикетки;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Объект.Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение; 
	
	ТаблицаТовары = Элементы.Товары;
	НовыйЭлемент = Элементы.Добавить("ТоварыДатаЦены", Тип("ПолеФормы"), ТаблицаТовары);
	Элементы.Переместить(НовыйЭлемент, ТаблицаТовары, Элементы.ТоварыЦенаДополнительно);
	НовыйЭлемент.Заголовок = "Дата цены";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.ДатаПоследнегоИзмененияЦены";
	НовыйЭлемент.Доступность = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ТоварыДатаЦеныДополнительно", Тип("ПолеФормы"), ТаблицаТовары);
	Элементы.Переместить(НовыйЭлемент, ТаблицаТовары, Элементы.ТоварыОстатокНаСкладе);
	НовыйЭлемент.Заголовок = "Дата цены (дополнительно)";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.ДатаПоследнегоИзмененияЦеныДополнительно";
	НовыйЭлемент.Доступность = Ложь;

	УстановитьУсловноеОформлениеДляПечати();
	ИспользоватьУсловноеОформлениеДляПечати();
	
	Если ЗначениеЗаполнено(Режим)
		И (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников") Тогда

		Элементы.ТоварыБылаПечать.Видимость = Истина;
		Элементы.ТоварыБылаПечать.Доступность = Ложь;
		
		Объект.Дата = '00010101';
		Объект.ДатаДополнительно = '00010101';
		
		ВключитьНапечатанныеТовары = Истина;
		
		Если Объект.Товары.Количество() > 0 Тогда
			ТаблицаЗначенийТовары = Объект.Товары.Выгрузить();
			ПроверитьСобытияПечати(ТаблицаЗначенийТовары, Объект.ВидЦены);
		КонецЕсли;
	Иначе
		Элементы.ТоварыДатаЦеныДополнительно.Видимость = Ложь;
		Элементы.ТоварыБылаПечать.Видимость = Ложь;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда 
		РегионПрисутствия = Объект.Подразделение.РегионПрисутствия;
	КонецЕсли;
	#КонецВставки
КонецПроцедуры

&НаКлиенте
Процедура Док_ВидЦеныПриИзмененииПосле(Элемент)
	ЗаменитьШаблонЦенника();
КонецПроцедуры

&НаКлиенте
Процедура Док_ВидЦеныДополнительноПриИзмененииПосле(Элемент)
	ЗаменитьШаблонЦенника();
КонецПроцедуры


&НаСервере
Процедура ЗаменитьШаблонЦенника()

		//09 - группа видов цен "РозницаКарта", 17 - Группа видов цен "СтараяЦенаСайт"
	Если (Объект.ВидЦены.ГруппаВидовЦен = Справочники.ГруппировкиВидовЦен.НайтиПоКоду("000000009") И Объект.ВидЦеныДополнительно.ГруппаВидовЦен = Справочники.ГруппировкиВидовЦен.НайтиПоКоду("000000017"))
		ИЛИ (Объект.ВидЦены.ГруппаВидовЦен = Справочники.ГруппировкиВидовЦен.НайтиПоКоду("000000017") И Объект.ВидЦеныДополнительно.ГруппаВидовЦен = Справочники.ГруппировкиВидовЦен.НайтиПоКоду("000000009")) Тогда
		Если Объект.Товары.Количество()>0 Тогда
			Для каждого Строка Из Объект.Товары Цикл
				НоменклатураСсылка = Строка.Номенклатура;
				Строка.ШаблонЦенника = НоменклатураСсылка.ШаблонДляРаспродаж;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли Объект.ВидЦены.ФорматПодразделения = Справочники.ФорматыПодразделений.НайтиПоНаименованию("МД") Тогда
		Если Объект.Товары.Количество()>0 Тогда
			Для каждого Строка Из Объект.Товары Цикл
				НоменклатураСсылка = Строка.Номенклатура;
				Строка.ШаблонЦенника = НоменклатураСсылка.ШаблонЦенникаМД;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если Объект.Товары.Количество()>0 Тогда
			Для каждого Строка Из Объект.Товары Цикл
				НоменклатураСсылка = Строка.Номенклатура;
				Строка.ШаблонЦенника = НоменклатураСсылка.ШаблонЦенника;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ЗаменитьШаблонЦенника()

&НаСервере
&ИзменениеИКонтроль("ДобавитьТовары")
Процедура Док_ДобавитьТовары(Таблица)

	// Поля необходимые для вывода в таблицу товаров на форме.
	СтруктураНастроек = Обработки.ПечатьЭтикетокИЦенников.СтруктураНастроек();

	УстановитьОбязательныеПоляДанных(СтруктураНастроек, Истина);

	УстановитьПараметрыДанных(СтруктураНастроек);

	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаТовары";
	СтруктураНастроек.ИсходныеДанные = Таблица;
	
	#Вставка
	СтруктураНастроек.Приоритет13ЗначногоШтрихкода = Приоритет13ЗначногоШтрихкода;
	#КонецВставки

	СтруктураНастроек.ИспользуетсяЦенообразование25 = ИспользуетсяЦенообразование25;

	СтруктураРезультата = Обработки.ПечатьЭтикетокИЦенников.ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");
	Для Каждого СтрокаТЧ Из СтруктураРезультата.Таблица Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.ПодготовитьШтрихкод(
		СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Штрихкод"]]);
		НоваяСтрока.Цена            = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Цена"]];
		НоваяСтрока.Весовой         = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Весовой"]];
		НоваяСтрока.ОстатокНаСкладе = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ОстатокНаСкладе"]];

		ШаблонЦенникаВидаНоменклатуры      = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ВидНоменклатуры.ШаблонЦенника")];
		ШаблонЦенникаНоменклатуры          = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ШаблонЦенника")];
		НоваяСтрока.ШаблонЦенника = ?(ЗначениеЗаполнено(ШаблонЦенникаНоменклатуры), ШаблонЦенникаНоменклатуры, ШаблонЦенникаВидаНоменклатуры);

		ШаблонЦенникаВидаНоменклатуры       = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ВидНоменклатуры.ШаблонЭтикетки")];
		ШаблонЦенникаНоменклатуры           = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ШаблонЭтикетки")];
		НоваяСтрока.ШаблонЭтикетки = ?(ЗначениеЗаполнено(ШаблонЦенникаНоменклатуры), ШаблонЦенникаНоменклатуры, ШаблонЦенникаВидаНоменклатуры);
		#Вставка
		Если (Объект.ВидЦены.ГруппаВидовЦен = Справочники.ГруппировкиВидовЦен.НайтиПоКоду("000000009") И Объект.ВидЦеныДополнительно.ГруппаВидовЦен = Справочники.ГруппировкиВидовЦен.НайтиПоКоду("000000017"))
			ИЛИ (Объект.ВидЦены.ГруппаВидовЦен = Справочники.ГруппировкиВидовЦен.НайтиПоКоду("000000017") И Объект.ВидЦеныДополнительно.ГруппаВидовЦен = Справочники.ГруппировкиВидовЦен.НайтиПоКоду("000000009")) Тогда
				НоменклатураСсылка = НоваяСтрока.Номенклатура;
				НоваяСтрока.ШаблонЦенника = НоменклатураСсылка.ШаблонДляРаспродаж;
		ИначеЕсли Объект.ВидЦены.ФорматПодразделения = Справочники.ФорматыПодразделений.НайтиПоНаименованию("МД") Тогда
				НоменклатураСсылка = НоваяСтрока.Номенклатура;
				НоваяСтрока.ШаблонЦенника = НоменклатураСсылка.ШаблонЦенникаМД;
		КонецЕсли; 
		
		
		#КонецВставки
	КонецЦикла;

	#Вставка
	ОбновитьЦенуНКТовара(Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура"), Объект.ВидЦены);
    #КонецВставки

КонецПроцедуры


&НаСервере
Процедура ОбновитьЦенуНКТовара(ТабЧасть, ВидЦены)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВтТовары.Номенклатура КАК Номенклатура,
		|	ВтТовары.НомерСтроки КАК НомерСтроки,
		|	&ВидЦены КАК ВидЦены
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	&ВтТовары КАК ВтТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТовары.НомерСтроки КАК НомерСтроки,
		|	ТоварыДругогоКачества.Номенклатура КАК КачественнаяНоменклатура,
		|	ЦенаКачественногоТовара.Цена КАК ЦенаКачественнойНоменклатуры,
		|	ТоварыДругогоКачества.НоменклатураБрак КАК НоменклатураБрак,
		|	ЦенаНекачественногоТовара.Цена КАК ЦенаБрак
		|ИЗ
		|	ВтТовары КАК ВтТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦенаКачественногоТовара
		|			ПО ТоварыДругогоКачества.Номенклатура = ЦенаКачественногоТовара.Номенклатура
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦенаНекачественногоТовара
		|			ПО (ЦенаНекачественногоТовара.Номенклатура = ТоварыДругогоКачества.НоменклатураБрак)
		|		ПО ВтТовары.Номенклатура = ТоварыДругогоКачества.НоменклатураБрак
		|ГДЕ
		|	ЦенаКачественногоТовара.ВидЦены = ЦенаНекачественногоТовара.ВидЦены
		|	И ЦенаКачественногоТовара.ВидЦены = ВтТовары.ВидЦены";
	Запрос.УстановитьПараметр("ВтТовары", ТабЧасть);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЧ = Объект.Товары.НайтиСтроки(Новый Структура("номерСтроки", ВыборкаДетальныеЗаписи.НомерСтроки));
		СтрокаТЧ[0].Цена = ВыборкаДетальныеЗаписи.ЦенаБрак;
		СтрокаТЧ[0].ЦенаДополнительно = ВыборкаДетальныеЗаписи.ЦенаКачественнойНоменклатуры;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Док_ПечатьТабличногоЦенникаПосле(Команда)
	МассивТабличныхДокументов = Док_ПечатьТабличногоЦенникаПослеНаСервере();
	Для каждого Шаблон из МассивТабличныхДокументов Цикл
		Шаблон.Показать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция Док_ПечатьТабличногоЦенникаПослеНаСервере()
	МассивТабличныхЦенников = ПолучитьТабличныеЦенники();
	МассивТабличныхДокументов = Новый Массив();
	
	Для каждого Ценник из МассивТабличныхЦенников Цикл
		ТаблДокумент= Новый ТабличныйДокумент();
		ТаблДокумент.Вывести(ЗаполнитьЦенник(Ценник));
		для колонка=1 по ТаблДокумент.ШиринаТаблицы цикл
			для строка=1 по ТаблДокумент.ВысотаТаблицы цикл
				ТекстЯчейки = ТаблДокумент.Область("R"+Строка(Строка)+"C"+Строка(Колонка)).Текст;
				Если НЕ ПустаяСтрока(ТекстЯчейки) Тогда
					Если Найти(ТекстЯчейки, "&") <> 0 Тогда
						УстановитьЦену(ТаблДокумент, ТекстЯчейки, Строка, Колонка);
					КонецЕсли;
				КонецЕсли;
			конеццикла;
		конеццикла;
		МассивТабличныхДокументов.Добавить(ТаблДокумент);
	конеццикла;
	
	Возврат МассивТабличныхДокументов;
КонецФункции

&НаСервере
Функция ПолучитьТабличныеЦенники()
	Ценники = Новый Массив();
	Для каждого Строка из Объект.Товары Цикл
		Если Строка.Выбран Тогда
			ТекущийЦенник = Строка.ШаблонЦенника;
			Если Ценники.Найти(ТекущийЦенник) = Неопределено Тогда
				Ценники.Добавить(ТекущийЦенник);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Ценники;
КонецФункции	

&НаСервере
Функция ЗаполнитьЦенник(ШаблонЦенника)
	СтруктураШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонЦенника, "Шаблон").Получить();
	Если СтруктураШаблона.МакетЭтикетки.Параметры.Количество()<>0 Тогда 
		СтруктураШаблона.МакетЭтикетки.Параметры[0] = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	КонецЕсли;
	Возврат СтруктураШаблона.МакетЭтикетки;
КонецФункции

&НаСервере
Процедура УстановитьЦену(ТабличныйДокумент, знач ТекстЯчейки, знач Строка, знач Столбец)
	
	МассивПоиска = СтрРазделить(ТекстЯчейки, "&");
	КодНоменклатуры = МассивПоиска[0];
	ВидЦеныСтрока = МассивПоиска[1];
	
	Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);
	Если ВидЦеныСтрока = "БезКарты" Тогда
		ВидЦены = Объект.ВидЦены;
	Иначе
		ВидЦены = Объект.ВидЦеныДополнительно;
	КонецЕсли;
	
	ТабличныйДокумент.Область("R"+Строка(Строка)+"C"+Строка(Столбец)).Текст = ПолучитьЦенуНоменклатуры(Номенклатура, ВидЦены);
					
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ВидЦены)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
		|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Строка(ВыборкаДетальныеЗаписи.Цена);
	КонецЕсли;
	
	Возврат "0";
	
КонецФункции

&НаКлиенте
Процедура Док_Приоритет13ЗначногоШтрихкодаПриИзмененииВместо(Элемент)
	ЗаполнитьТаблицуТоваров("");	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриЗагрузкеДанныхИзНастроекНаСервере")
Процедура Док_ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	Если Параметры.Свойство("АдресВХранилище") И ЭтоАдресВременногоХранилища(Параметры.АдресВХранилище) Тогда

		ТаблицаСохраненныеНастройки = Новый ТаблицаЗначений;
		ТаблицаСохраненныеНастройки.Колонки.Добавить("Ключ");
		ТаблицаСохраненныеНастройки.Колонки.Добавить("Значение");

		Для Каждого КлючИЗначение Из Настройки Цикл
			НоваяСтрока = ТаблицаСохраненныеНастройки.Добавить();
			НоваяСтрока.Ключ = КлючИЗначение.Ключ;
			НоваяСтрока.Значение = КлючИЗначение.Значение;
		КонецЦикла;

		СохраненныеНастройки = ПоместитьВоВременноеХранилище(ТаблицаСохраненныеНастройки, УникальныйИдентификатор);

		Объект.СкладскаяГруппа = Настройки["Объект.СкладскаяГруппа"];
		Объект.Вариант = Настройки["Объект.Вариант"];
		
		#Вставка
		Если Настройки["Приоритет13ЗначногоШтрихкода"] <> Неопределено Тогда
			Приоритет13ЗначногоШтрихкода = Настройки["Приоритет13ЗначногоШтрихкода"];
		КонецЕсли;
		ЗаполнитьТаблицуТоваровНаСервере(Ложь);
		#КонецВставки

		Настройки.Очистить();

	Иначе

		ВидимостьОтбора = Настройки.Получить("ВидимостьОтбора");
		Элементы.ГруппаОтбор.Видимость = ВидимостьОтбора;
		Если ВидимостьОтбора Тогда
			Элементы.Отбор.Заголовок = НСтр("ru = 'Скрыть отбор'");
		Иначе
			Элементы.Отбор.Заголовок = НСтр("ru = 'Показать отбор'");
		КонецЕсли;

		ВидимостьРежимаЗаполнения = Настройки.Получить("ВидимостьРежимаЗаполнения");
		Элементы.ГруппаРежимЗаполнения.Видимость = ВидимостьРежимаЗаполнения;
		Если ВидимостьРежимаЗаполнения Тогда
			Элементы.РежимЗаполнения.Заголовок = НСтр("ru = 'Скрыть режим заполнения'");
		Иначе
			Элементы.РежимЗаполнения.Заголовок = НСтр("ru = 'Показать режим заполнения'");
		КонецЕсли;

		НастройкиОтбора = Настройки.Получить("НастройкиОтбора"); // ХранилищеЗначения
		Если НастройкиОтбора <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтбора.Получить());
		Иначе
			ЗагрузитьНастройкиОтбораПоУмолчанию();
		КонецЕсли;

		Режим = Настройки.Получить("Режим");
		Если ЗначениеЗаполнено(Режим)
			И (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников" ИЛИ Режим = "ПечатьЭтикеток") Тогда
			УстановитьРежим(Режим);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры







