
&НаКлиенте
Процедура Загрузить(Команда)
	// Вставить содержимое обработчика.
    Режим = РежимДиалогаВыбораФайла.Открытие; 
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
    ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
    Фильтр = "Таблица(*.xls)|*.xls"; 
    ДиалогОткрытияФайла.Фильтр = Фильтр; 
    ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
    ДиалогОткрытияФайла.Заголовок = "Выберите файл"; 
    
    Если ДиалогОткрытияФайла.Выбрать() Тогда 
        ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
    Иначе
        Возврат;
    КонецЕсли;
	//Номер листа в книге Excel для получения данных
    НомерЛиста         = 1;
    
    //Пытаемся подключиться к Excel
    Попытка
        Excel = новый COMОбъект("Excel.Application");
    Исключение
        Сообщить("Похоже, Excel на компьютере не установлен. Необходимо выполнить установку/переустановку Excel.");
        Возврат;
    КонецПопытки;     
    ИмяФайла=ПутьКФайлу;
	ТаблицаЗагрузки.Очистить();
    //Подключились удачно, открываем файл
    Excel.Workbooks.Open(ИмяФайла);
   
    //Открываем необходимый лист
    Excel.Sheets(НомерЛиста).select();   
   
    //Получим количество строк и колонок.
    //В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel
    Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
    Если Версия = "8" тогда
        ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
        ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
    Иначе
        ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
        ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
    Конецесли;
 
    //определим по файлу в каких колонках необходимые данные
    НомерКолонкиКодаТовара            	 = 2;
    НомерКолонкиНаименованияТовара  	 = 3;
    НомерКолонкиЦеныТовара        	     = 7;
	НомерКолонкиЕдиницыИзмеренияТовара   = 4;
	НомерКолонкиКоличестваТовара 		 = 5;
	НомерКолонкиСуммыТовара		 		 = 9;
   
    // Выбираем данные из файла
	Для а = 2 по ФайлСтрок Цикл
		Артикул=СокрЛП(Excel.Cells(а,НомерКолонкиКодаТовара).Value);
		Если Артикул="" тогда 
			продолжить;
		КонецЕсли;
        НоваяСтрока=ТаблицаЗагрузки.Добавить();
		//Полуим данные из соответсвующих ячеек
		НоваяСтрока.Артикул				= Артикул;
		НоваяСтрока.Наименование    	= СокрЛП(Excel.Cells(а,НомерКолонкиНаименованияТовара).Value);
		НоваяСтрока.Цена            	= Число(Excel.Cells(а,НомерКолонкиЦеныТовара).Value);
		НоваяСтрока.Количество      	= Число(Excel.Cells(а,НомерКолонкиКоличестваТовара).Value);
		НоваяСтрока.Сумма		    	= Число(Excel.Cells(а,НомерКолонкиСуммыТовара).Value);
		НоваяСтрока.ЕдиницаИзмерения 	= СокрЛП(Excel.Cells(а,НомерКолонкиЕдиницыИзмеренияТовара).Value);
//	   
////        Товар = Справочники.Номенклатура.ПустаяСсылка();       
//	   
//		//// Ищем товар в справочнике по коду       
//		//Товар = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
//	   
//////        // Если не нашли по коду, то ищем по наименованию
//		//Если Товар.Пустая() Тогда
//		//	Товар = Справочники.Номенклатура.НайтиПоНаименованию(тНаименование, Истина);
//		//Конецесли;
//	   
//		//Если не нашли создаем новый
//		Если Товар.Пустая() Тогда
//			Товар                      = Справочники.Номенклатура.СоздатьЭлемент();
//			Товар.Код                  = КодТовара;
//			Товар.Наименование         =  НаименованиеТовара;
//			Товар.НаименованиеПолное   =  НаименованиеТовара;
//			Товар.Записать();
//		Конецесли;   
//	   
//		//Запишем товар и цену в документ установки цен
//		НоваяСтрока                     = ДокументУстановкиЦенГривна.Товары.Добавить();
//		НоваяСтрока.Валюта              = ВалютаГривна;
//		НоваяСтрока.Цена                = Цена;
//		НоваяСтрока.Номенклатура        = Товар.Ссылка;                
//		НоваяСтрока.ТипЦен              = ТипЦеныРозничный;         
    Конеццикла;
   
    //Закрываем Excel
    Excel.ActiveWorkbook.Close(); 
	Excel="";
КонецПроцедуры
//Функции для поиска номенклатуры и единицы измерения
&НаСервере
Функция ПроверитьНоменклатуру(Артикул)
	Возврат Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);	
КонецФункции
&НаСервере
Функция ПроверитьЕдиницу(ЕдиницаИзмерения)
	Возврат Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ЕдиницаИзмерения);
КонецФункции
//---------------------------------------------------------------------------------------------
&НаКлиенте
Процедура НайтиВ1С(Команда)
	// Вставить содержимое обработчика.
	Для каждого СтрокаТаблицыЗагрузки из ТаблицаЗагрузки Цикл
		СтрокаТаблицыЗагрузки.Номенклатура1С = ПроверитьНоменклатуру(СтрокаТаблицыЗагрузки.Артикул);	
		СтрокаТаблицыЗагрузки.ЕдиницаИзмерения1С = ПроверитьЕдиницу(СтрокаТаблицыЗагрузки.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры
//Функции для создания номенклатуры и единицы измерения
&НаСервере
Функция СоздатьЕдиницу(ЕдиницаИзмерения)
	Единица=Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ЕдиницаИзмерения);
	Если Не Единица.Пустая() тогда
		Возврат Единица;
	КонецЕсли;
	Сообщить("Единица измерения:"+ЕдиницаИзмерения+" не найдена в стандартных!");
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
КонецФункции
&НаСервере
Функция СоздатьНоменклатуру(Наименование,Артикул,ЕдиницаИзмерения)
	ТекНоменклатура=Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	Если Не ТекНоменклатура.Пустая() тогда
		Возврат ТекНоменклатура;	
	КонецЕсли;
	
	Товар						= Справочники.Номенклатура.СоздатьЭлемент();
	Товар.Артикул				= Артикул;
	Товар.Наименование			= Наименование+" "+Артикул;
	Товар.НаименованиеПолное	= Наименование+" "+Артикул;
    Товар.ЕдиницаИзмерения		= СоздатьЕдиницу(ЕдиницаИзмерения);
	Товар.ТипНоменклатуры		= Перечисления.ТипыНоменклатуры.Товар;
	Товар.ВидНоменклатуры		= Справочники.ВидыНоменклатуры.НайтиПоНаименованию("(41.1) Товар (пр. ТМЦ)");
	Товар.СтавкаНДС				= Перечисления.СтавкиНДС.НДС18;
	Товар.Родитель				= Справочники.Номенклатура.НайтиПоКоду("А7379      ");
	Товар.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	Товар.Записать();
    ТекНоменклатура=Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	Сообщить("Создан новый элемент номенклатуры: "+Наименование);
	Возврат ТекНоменклатура;
	
КонецФункции
//---------------------------------------------------------------------------------------------
&НаКлиенте
Процедура СоздатьВ1С(Команда)
	// Вставить содержимое обработчика.
	Для каждого СтрокаТаблицыЗагрузки из ТаблицаЗагрузки Цикл
		СтрокаТаблицыЗагрузки.ЕдиницаИзмерения1С = СоздатьЕдиницу(СтрокаТаблицыЗагрузки.ЕдиницаИзмерения);
		СтрокаТаблицыЗагрузки.Номенклатура1С = СоздатьНоменклатуру(СтрокаТаблицыЗагрузки.Наименование,СтрокаТаблицыЗагрузки.Артикул,СтрокаТаблицыЗагрузки.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	// Вставить содержимое обработчика.
	ТаблицаТоваров=ЭтаФорма.ВладелецФормы.Объект.Товары;
	Для каждого текСтрока из ТаблицаЗагрузки цикл
		НоваяСтрока=ТаблицаТоваров.Добавить();
		НоваяСтрока.Номенклатура=текСтрока.Номенклатура1С;
		НоваяСтрока.Количество=текСтрока.Количество;
		НоваяСтрока.КоличествоУпаковок=текСтрока.Количество;
		НоваяСтрока.Цена=текСтрока.Цена;
		НоваяСтрока.Сумма=текСтрока.Сумма;
		НоваяСтрока.СтавкаНДС=Ставка18;
		НоваяСтрока.СуммаНДС=текСтрока.Сумма*18/118;
		НоваяСтрока.СуммаСНДС=текСтрока.Сумма;
		НоваяСтрока.Склад=ЭтаФорма.ВладелецФормы.Объект.Склад;
	КонецЦикла;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	//Сообщить(ДокументПоступления);
	СообщениеФормата="Формат файла загрузки - excel (*.xls)";
	СообщениеФормата=СообщениеФормата+Символы.ПС;
	СообщениеФормата=СообщениеФормата+"1 строка - заголовки столбцов, далее товар.";
	СообщениеФормата=СообщениеФормата+Символы.ПС;
	СообщениеФормата=СообщениеФормата+"1,6,8 столбецы - пустые.";
	СообщениеФормата=СообщениеФормата+Символы.ПС;
	СообщениеФормата=СообщениеФормата+"2 столбец - артикул, 3 столбец - наименование";
	СообщениеФормата=СообщениеФормата+Символы.ПС;
	СообщениеФормата=СообщениеФормата+"4 столбец - единица измерения, 5 столбец - количество";
	СообщениеФормата=СообщениеФормата+Символы.ПС;
	СообщениеФормата=СообщениеФормата+"7 столбец - цена, 9 столбец - сумма.";
	Сообщить(СообщениеФормата);
	СообщениеФормата="Товар загружается в группу:";
	СообщениеФормата=СообщениеФормата+Символы.ПС;
	СообщениеФормата=СообщениеФормата+"'Инструменты STAYER'";
	Сообщить(СообщениеФормата);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДокументПоступления=Параметры.ДокументПоступления;
	Ставка18=Перечисления.СтавкиНДС.НДС18;
КонецПроцедуры
