&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Пробитие = Ложь; 
	//Бригадиры
	Элементы.ОплатаБонусныеБаллы.Доступность = Истина;
	Если АльтерраОбщегоНазначения.ЭтоБригадир(Партнер) и ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		Если не БонусыАльтерра.МожноРассчитыватьсяБаллами(Документ.Соглашение) тогда
		 Элементы.ОплатаБонусныеБаллы.Доступность = Ложь;	
		конецесли; 
	Конецесли;
	//Бригадиры.
	если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") и значениезаполнено(Документ.ЧекККМ) тогда
		ЗапретНаличных=Документ.ЧекККМ.СуммаДокумента=Документ.ЧекККМ.ОплатаПлатежнымиКартами.Итог("Сумма");
	конецесли;	
	
	Если ВариантОтправкиЭлектронногоЧекаПартнера = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail Тогда 
		ВариантЧека = "Почта"; 
	ИначеЕсли ВариантОтправкиЭлектронногоЧекаПартнера = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS Тогда 
		ВариантЧека = "Смс";
	ИначеЕсли ВариантОтправкиЭлектронногоЧекаПартнера = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.Бумажный Тогда
    	ВариантЧека =  "Бумажный";
	Иначе
		ВариантЧека = "Бумажный"; 
	КонецЕсли; 
	
	ВидОплатыСмешанная = Истина; 
	Если Параметры.Свойство("ВидОплатыСмешанная") Тогда
		ВидОплатыСмешанная = Параметры.ВидОплатыСмешанная; 	
	КонецЕсли; 
	Если Параметры.Свойство("Идентификатор") Тогда
		Элементы.ОплатитьСБПГазпромбанк.Доступность = Истина;
		Идентификатор = Параметры.Идентификатор;
	КонецЕсли;
	
	Если ЭтоВозврат Тогда
		Элементы.ОплатитьСБПГазпромбанк.Заголовок = НСтр("ru = 'Возврат оплаты СБП Газпромбанк'");	
	КонецЕсли;
	
КонецПроцедуры

&После ("ДобавитьЦифру")
&НаКлиенте
Процедура Док_ДобавитьЦифру(ВведеннаяЦифраСтрокой)
	если  ЗапретНаличных тогда
		ПолученоНаличными="";
		РассчитатьИтоги(ЭтотОбъект);
	конецесли;	
КонецПроцедуры
	
&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ПодключитьОбработчикОжидания("ПроверкаДоступностиВводаНаФорме", 1);
	ОбновитьВариантОтправки(); 
	//Вызываем добавление карты, если выбрана оплата картой 
	Если не ВидОплатыСмешанная ТОгда 
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОповещениеВФормуОплаты", Новый ОписаниеОповещения("ОплатаЗавершение", ЭтотОбъект));
		ДополнительныеПараметры.Вставить("ПолученоНаличными", РозничныеПродажиКлиентСервер.ПривестиСтрокуКЧислу(ПолученоНаличными));
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЧекККМ")
			ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияПодарочныхСертификатов") Тогда
			ВыполнитьОбработкуОповещения(
				Новый ОписаниеОповещения("ДобавитьОплатуКартой", ВладелецФормы, ДополнительныеПараметры),
				Истина);
		Иначе
			ВыполнитьОбработкуОповещения(
				Новый ОписаниеОповещения("ОтменитьОплату", ВладелецФормы, ДополнительныеПараметры),
				Истина);
			КонецЕсли;      
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДоступностиВводаНаФорме();
	Если ЭтаФорма.ВводДоступен() Тогда
		ОтключитьОбработчикОжидания("ПроверкаДоступностиВводаНаФорме");
		если типзнч(ЭтаФорма.ВладелецФормы.Объект.ссылка)=тип("ДокументСсылка.ЧекККМ") тогда
			Если ЭтаФорма.ВладелецФормы.Объект.КОплатеБаллами <> 0 Тогда
				ОплатаБонусныеБаллы(ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;    
КонецПроцедуры

//Электронные чеки 
&НаКлиенте
Процедура Док_ЭлектронныйЧекВместо(Команда)
	
	Если Email <> "" Тогда
		ВариантЧека = "Почта";
	ИначеЕсли (СтрДлина(Телефон) = 14) Тогда
		ВариантЧека = "Смс";  
	Иначе
		Сообщить("Заполните контактную информацию");
	КонецЕсли;
	
	//Нужно разветвление на вариант чека. Если заполнена почта - вариант Почта иначеЕсли заполен телфон Телефон
	//Но если ничего не заполнено, не переключать, оставить как есть, вывести сообщение "Заполните контактную информацию" 

КонецПроцедуры  

&НаКлиенте
Процедура Док_НапечататьЧекВместо(Команда)
	ВариантЧека = "Бумажный"; 
	ОбновитьВариантОтправки();
КонецПроцедуры
	  


&НаКлиенте
Процедура Док_ЭлектронныйЧекНеТребуетсяПосле(Команда)    //Не используется
	
	ВариантЧека = "Фиктивный"; 
	ОбновитьВариантОтправки();
КонецПроцедуры   


&НаСервере 
Функция ПолучитьПочтуПоУмолчанию()  	
	Возврат АльтерраОбщегоНазначения.ПолучитьПочтуДляОтправкиЧеков(Документ.организация);
КонецФУнкции 

&НаСервере 
Процедура Док_ПривилегированныйРежим() 
	УстановитьПривилегированныйРежим(Истина); 
КонецПроцедуры 

&НаКлиенте
Процедура Док_КомандаПробитьЧекВместо(Команда) 

	СФП_МаркерыКлиент.МаркерНачало("Чек: Пробить чек", "Форма смешанной оплаты");
	
	Док_ПривилегированныйРежим();  
	СтрокаВопроса = ""; 
	
	ВариантEmail 	= ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail");
	ВариантSMS 		= ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS");
	ВариантNone		= ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять");
	
	Пробитие = Истина;
	СообщениеОДанных = "";
	Шаблон = "Чек будет ";
	
	Если ВариантЧека = "Почта" Тогда
		Если Email <> "" Тогда 
			Шаблон = Шаблон + "отправлен на почту: " + Email;
			ВариантОтправки = ВариантEmail;
		Иначе
			СообщениеОДанных = "Введите email";
		КонецЕсли;
	ИначеЕсли ВариантЧека = "Смс" Тогда
		Если (СтрДлина(Телефон) = 14) Тогда 
			Шаблон = Шаблон + "отправлен на телефон: " + Прав(Телефон, 4);
			ВариантОтправки = ВариантSMS; 
		Иначе
			СообщениеОДанных = "Введите телефон";
		КонецЕсли;
	ИначеЕсли ВариантЧека = "Бумажный" Тогда
		ВариантОтправки = ВариантNone;
		Шаблон = Шаблон + "напечатан";	
	ИначеЕсли ВариантЧека = "Фиктивный" Тогда
		ВариантОтправки = ВариантEmail;
		Email = ПолучитьПочтуПоУмолчанию(); 
		Шаблон = "Покупатель отказался от чека";
	КонецЕсли;
	
	Док_УстановитьВариант(ВариантЧека, ВариантОтправки);
	
	Если Не СообщениеОДанных = "" Тогда
		Сообщить(СообщениеОДанных);
		Пробитие = Ложь;
	КонецЕсли;
	
	СтрокаВопроса = СтрШаблон("%1. Все верно?", Шаблон);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Ок", "Ок");
	Кнопки.Добавить("Отмена", "Отмена");
	Кнопки.Добавить("НеОтправлять", "Бумажный чек"); //Бумажный чек.   ("НеОтправлять", "Бумажный чек" 
	
	Если не Пробитие  Тогда 
			Оповещение = Новый ОписаниеОповещения("ОтсутствуетКонтактнаяИнформация", ЭтотОбъект);
			Кнопки.Удалить(Кнопки.НайтиПоЗначению("Отмена"));
	 		ПоказатьВопрос(Оповещение, "Введите номер телефона или почту клиента!",	Кнопки,	0);  
	Иначе 
			Оповещение = Новый ОписаниеОповещения("ПредПробитие", ЭтотОбъект);
			Кнопки.Удалить(Кнопки.НайтиПоЗначению("НеОтправлять"));
	 		ПоказатьВопрос(Оповещение, СтрокаВопроса, Кнопки, 0);  
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Док_УстановитьВариант(ВариантЧека, ВариантОтправки)
	Если Не ВариантЧека = "Бумажный" Тогда
		РозничныеПродажиКлиентСервер.УстановитьАктивныйЭлемент(ЭтотОбъект, Элементы.Email);
	КонецЕсли;
	РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(ЭтотОбъект, ВариантОтправки);
КонецПроцедуры


&НаКлиенте
Процедура ПредПробитие(Результат, Параметры) Экспорт
	Если Результат = "Ок" Тогда
    	СуммаОплатыЧисло = РозничныеПродажиКлиентСервер.ПривестиСтрокуКЧислу(ПолученоНаличными);
		
		ДанныеЭлектронногоЧека = РозничныеПродажиКлиентСервер.ДанныеЭлектронногоЧека(ЭтотОбъект);
		НеобходимостьОбработкиДанных = РозничныеПродажиКлиентСервер.ПроверитьНеобходимостьОбработкиДанныхЭлектронногоЧека(ЭтотОбъект);
		Если НеобходимостьОбработкиДанных.ТребуетсяОбновитьКонтактнуюИнформацию
			Или НеобходимостьОбработкиДанных.ТребуетсяСоздатьПартнера
			Или НеобходимостьОбработкиДанных.ТребуетсяОбновитьВариантОтправкиЭлектронногоЧекаПартнера Тогда
			ДанныеЭлектронногоЧека = ОбработатьДанныеЭлектронногоЧека();
		КонецЕсли;
		
		Если ДанныеЭлектронногоЧека = Неопределено Тогда
			////Для отслеживания ошибки
			ИмяСобытияОшибки = "Попытка пробития чека " + Документ.Номер;
			КомментарийОшибки = "Ошибка в транзакции при обновлении данных партнера (ФормаСмешаннойОплаты - ПредПробитие)";
			ЗаписатьОшибку(ИмяСобытияОшибки, КомментарийОшибки);
			
			Если ОплаченоПлатежнымиКартами > 0 Тогда
				//пропускаем, т.к. на этом этапе оплата картой уже прошла.
				ДанныеЭлектронногоЧека = РозничныеПродажиКлиентСервер.ДанныеЭлектронногоЧека(ЭтотОбъект);
			Иначе
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатОплаты = РозничныеПродажиКлиентСервер.СтруктураРезультатаОплаты();
		РезультатОплаты.ПолученоНаличными      = СуммаОплатыЧисло;
		РезультатОплаты.ДанныеЭлектронногоЧека = ДанныеЭлектронногоЧека;
		
		ПринудительноЗакрытьФорму = Истина;
		Закрыть(РезультатОплаты); 
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОшибку(ИмяСобытияОшибки, КомментарийОшибки)
	ЗаписьЖурналаРегистрации(ИмяСобытияОшибки, УровеньЖурналаРегистрации.Ошибка,,,КомментарийОшибки);
КонецПроцедуры

&НаКлиенте
Процедура ОтсутствуетКонтактнаяИнформация(Результат, Параметры) Экспорт
	Если Результат = "НеОтправлять" Тогда   
		ВариантЧека = "Бумажный"; //Переопределеить на бумажный
		ОбновитьВариантОтправки();
	КонецЕсли;   
КонецПроцедуры

   

&НаКлиенте
Процедура ОбновитьВариантОтправки() 
    Если ВариантЧека = "Почта" Тогда  
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Истина;  
		ОтправкаНаСмс = Ложь; 
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Оранжевый;
		
	ИначеЕсли ВариантЧека = "Смс" Тогда 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Истина;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Телефон.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	ИначеЕсли ВариантЧека = "Бумажный" Тогда 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Ложь;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	ИначеЕсли ВариантЧека = "Фиктивный" Тогда 	 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Оранжевый; 
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Ложь;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	КонецЕсли; 
КонецПроцедуры 

&НаСервере
Функция ПолучитьВариантОтправки(Партнер) 
	Если Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail Тогда 
		Возврат "Почта"; 
	ИначеЕсли Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS Тогда 
		Возврат "Смс";
	ИначеЕсли Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.Бумажный Тогда
    	Возврат "Бумажный";
	Иначе
		Возврат "Бумажный"; 
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура Док_ОтправкаНаСмсПриИзмененииВместо(Элемент)
	ОтправкаНаПочту = не ОтправкаНаСМС; 
	Если ОтправкаНаПочту Тогда 
		ВариантЧека = "Почта"; 
	ИначеЕсли ОтправкаНаСмс Тогда 
		ВариантЧека = "Смс"; 
	КонецЕсли; 
	ОбновитьВариантОтправки();
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтправкаНаПочтуПриИзмененииВместо(Элемент)
	ОтправкаНаСМС = не ОтправкаНаПочту; 
	Если ОтправкаНаПочту Тогда 
		ВариантЧека = "Почта"; 
	ИначеЕсли ОтправкаНаСмс Тогда 
		ВариантЧека = "Смс"; 
	КонецЕсли; 
    ОбновитьВариантОтправки();
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОплатаЗавершение")
Процедура Док_ОплатаЗавершение(ИнформацияОбОплате, ДополнительныеПараметры)
	
	КОплате = ИнформацияОбОплате.СуммаКОплате;
	
	ОплаченоСертификатами = ИнформацияОбОплате.ПодарочныеСертификаты;
	ОплаченоБонуснымиБаллами = ИнформацияОбОплате.БонусныеБаллы;
	
	Если ЭтоВозврат Тогда
		ОплаченоПлатежнымиКартами = ИнформацияОбОплате.ПлатежныеКартыОтменено;
	Иначе
		ОплаченоПлатежнымиКартами = ИнформацияОбОплате.ПлатежныеКарты;
	КонецЕсли;
	ОплатаЗавершениеЛокализация(ИнформацияОбОплате);
	
	РассчитатьИтоги(ЭтотОбъект, ИнформацияОбОплате);
	НастроитьВидимостьЭлементов(ИнформацияОбОплате);
	ПодключитьОбработчикОжидания("ВывестиИнформациюНаДисплейПокупателя", 0.1, Истина);

	#Вставка   
	Если КОплате =  ОплаченоПлатежнымиКартами И ПолученоНаличными <> "" Тогда  
		ПолученоНаличными = "0";
	КонецЕсли;
	#КонецВставки
	
	Если ПринудительноЗакрытьФормуПриУспешнойОтменеОплаты Тогда
		
		Если ИнформацияОбОплате.ИтогоОплачено = 0 
			ИЛИ ОтложитьЧекЛокализация(ИнформацияОбОплате) Тогда
			ПринудительноЗакрытьФорму = Истина;
			Закрыть(ПараметрыЗакрытияФормы().Отмена);
		Иначе
			ПринудительноЗакрытьФормуПриУспешнойОтменеОплаты = Ложь;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_ОплатитьСБПГазпромбанкПосле(Команда)
	Если СуммаОплаты <> 0 Тогда
		Сообщить("Для СБП возможна только полные оплата/возврат");
		Возврат;
	КонецЕсли;
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("КОплате", КОплате);
	ПараметрыОткрытияФормы.Вставить("Идентификатор", Идентификатор);
	ПараметрыОткрытияФормы.Вставить("Документ", Документ);
	//Если НЕ ЭтоВозврат Тогда
	//	ПараметрыОткрытияФормы.Вставить("ПлатежныйДокумент", Документ);
	//КонецЕсли;	
    
	
	ОткрытьФорму("ОбщаяФорма.СБПГазпромбанк", ПараметрыОткрытияФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("Док_ЗавершениеОплатыСБП", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры   

&НаКлиенте
Процедура Док_ЗавершениеОплатыСБП(Результат, ДополнительныеПараметры)   Экспорт
	Если Результат = Неопределено
		ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЭтоВозврат Тогда
		ОплаченоСБП = Результат.СуммаОперации;
	//
	//Иначе
		//ОплаченоПлатежнымиКартами = Результат.СуммаОперации;
	//КонецЕсли;
	РассчитатьИтоги(ЭтотОбъект, Неопределено);	
		//СуммаОплаты = Результат.СуммаОперации;
		//СуммаДоплаты = 0;
		Если Результат.СтатусОперации = "ACCEPTED" или Результат.СтатусОперации = "PERFORMED" Тогда
			ВыполнитьОбработкуОповещения(Новый ОписаниеОповещения("Док_ОбработатьРезультатОплатыСБП", ВладелецФормы, ДополнительныеПараметры), Результат); 
			ВыполнитьОбработкуОповещения(Новый ОписаниеОповещения("Док_ОбновитьФормуСБП", ВладелецФормы), Результат);
			Элементы.КомандаПробитьЧек.Доступность = Истина;
			
		Иначе
			Сообщить("Оплаты не было или отменена");
		КонецЕсли;
	
	
	

	
КонецПроцедуры  

&НаКлиенте
Процедура Док_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПроблемыДеактивацииКСФормаСБП" Тогда
		Сообщить(Параметр);
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("НастроитьВидимостьЭлементовЛокализация")
Процедура Док_НастроитьВидимостьЭлементовЛокализация(ИнформацияОбОплате)

	//++ Локализация
	ДоступныеВидыОплаты = ИнформацияОбОплате.ДоступныеВидыОплаты;
	РежимПолнойОплаты = ЭтоПолнаяОплатаПлатежнойКартой ИЛИ ЭтоПолнаяОплатаПодарочнымиСертификатами;

	Если ЭтоВозврат Тогда

		ВозвратНаОснованииПродажи = Истина;
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ЧекККМ");
			ВозвратНаОснованииПродажи = ЗначениеЗаполнено(ДокументОснование);
		КонецЕсли;

		Элементы.ОплатаСБП.Заголовок = НСтр("ru = 'Возврат оплаты СБП'");

		Элементы.ПолеОплаченоСБП.Видимость = ВозвратНаОснованииПродажи И ИнформацияОбОплате.СБП > 0
												ИЛИ ДоступныеВидыОплаты.СБП И НЕ ВозвратНаОснованииПродажи;
		#Удаление
		Элементы.ОплатаСБП.Видимость       = ВозвратНаОснованииПродажи И ИнформацияОбОплате.СБП > 0
												ИЛИ ДоступныеВидыОплаты.СБП И НЕ ВозвратНаОснованииПродажи;
		
		Если СтатусОплатыСБПЧекаПродажи = Перечисления.ТипыСтатусовОплатыСБП.ОжидаетПодтверждение Тогда
			Элементы.ОплатаСБП.Доступность = Ложь;
		Иначе
			Элементы.ОплатаСБП.Доступность = НЕ ИнформацияОбОплате.СБПОтменено > 0;
		КонецЕсли;
        #КонецУдаления
		#Вставка
		Элементы.ОплатаСБП.Видимость = Ложь;
		Элементы.ОплатаСБП.Доступность = Ложь;
		#КонецВставки

	Иначе

		Элементы.ПолеОплаченоСБП.Видимость = НЕ РежимПолнойОплаты И ДоступныеВидыОплаты.СБП;
		#Удаление
		Элементы.ОплатаСБП.Видимость       = НЕ РежимПолнойОплаты И ДоступныеВидыОплаты.СБП;

		Элементы.ОплатаСБП.Доступность = НЕ ИнформацияОбОплате.СБП > 0;
        #КонецУдаления
		#Вставка
		Элементы.ОплатаСБП.Видимость = Ложь;
		Элементы.ОплатаСБП.Доступность = Ложь;
		#КонецВставки
	КонецЕсли;

	Если ЭтоПолнаяОплатаЧерезСБП Тогда

		Если ЭтоВозврат Тогда
			Заголовок = НСтр("ru = 'Возврат оплаты через СБП'");
		Иначе
			Заголовок = НСтр("ru = 'Оплата через СБП'");
		КонецЕсли;

		Если ОплаченоСБП = КОплате Тогда
			Элементы.КнопкаЗакрыть.Заголовок = НСтр("ru = 'Закрыть'");
		Иначе
			Элементы.КнопкаЗакрыть.Заголовок = НСтр("ru = 'Отменить оплату'");
		КонецЕсли;

		Элементы.ПолеПолученоНаличными.Видимость = Ложь;
		Элементы.ПолеОплаченоПлатежнымиКартами.Видимость = Ложь;
		Элементы.ПолеОплаченоСертификатами.Видимость = Ложь;
		Элементы.ПолеОплаченоБонуснымиБаллами.Видимость = Ложь;
		Элементы.ГруппаВидыОплаты.Видимость = Ложь;

	КонецЕсли
	//-- Локализация

КонецПроцедуры




		
	

