
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Пользователь=Пользователи.ТекущийПользователь();
	ТекущийОбъект.ДатаИзменения=ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	если Параметры.ЗначенияЗаполнения.Свойство("Номенклатура") тогда
		Запись.Номенклатура=Параметры.ЗначенияЗаполнения.Номенклатура;
	конецесли;	
	УстановитьОформлениеЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеЭлементов()
	Элементы.АлгоритмРасчета.Видимость=Запись.МетодОбеспеченияПотребностей=Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаПоАлгоритму;
	Элементы.Характеристика.Видимость=Запись.Номенклатура.ИспользованиеХарактеристик<>Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
	Элементы.Упаковка.Видимость=Запись.Номенклатура.ИспользоватьУпаковки;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	УстановитьОформлениеЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура МетодОбеспеченияПотребностейПриИзменении(Элемент)
	УстановитьОформлениеЭлементов();
КонецПроцедуры
