&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Объект.ВидОперации= ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсполненПриИзменении(Элемент)
	Если Объект.Исполнен Тогда
		Объект.ДатаИсполнения= ТекущаяДата();
		
		Объект.Исполнитель= ТекущийПользователь();
		Объект.ДатаРегистрацииИсполнения= ТекущаяДата();
	Иначе
		Объект.ДатаИсполнения= Неопределено;
		Объект.Исполнитель= Неопределено;
		Объект.ДатаРегистрацииИсполнения= Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	ОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОснованиеПриИзмененииНаСервере()
	Объект.ОсновнойМенеджер= Объект.Основание.Менеджер;
	Объект.Организация= Объект.Основание.Организация;
КонецПроцедуры

&НаСервере
функция ТекущийПользователь()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции





