&ИзменениеИКонтроль("ЭквайринговаяОперация")
Асинх Функция Док_ЭквайринговаяОперация(ОбъектДрайвера, ПараметрыПодключения, ДанныеОперации, Команда)
	
	РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса;
	
	РеквизитыКартыQR = ?(ДанныеОперации.РеквизитыКартыQR <> Неопределено, ДанныеОперации.РеквизитыКартыQR, "");
	НомерМерчанта  = ?(ДанныеОперации.НомерМерчанта <> Неопределено, ДанныеОперации.НомерМерчанта, 0);
	НомерКарты     = ?(ДанныеОперации.НомерКарты <> Неопределено, ДанныеОперации.НомерКарты, "");
	НомерЧека      = ?(ДанныеОперации.НомерЧека <> Неопределено, ДанныеОперации.НомерЧека, "");
	СсылочныйНомер = ?(ДанныеОперации.СсылочныйНомер <> Неопределено, ДанныеОперации.СсылочныйНомер, "");
	КодАвторизации = ?(ДанныеОперации.КодАвторизации <> Неопределено, ДанныеОперации.КодАвторизации, "");
	СуммаОперации  = ?(ДанныеОперации.СуммаОперации <> Неопределено, ДанныеОперации.СуммаОперации, 0);
	СуммаНаличных  = ?(ДанныеОперации.СуммаНаличных <> Неопределено, ДанныеОперации.СуммаНаличных, 0);
	СуммаОригинальнойОперации = ?(ДанныеОперации.СуммаОригинальнойОперации <> Неопределено, ДанныеОперации.СуммаОригинальнойОперации, 0);
	ТекстСлипЧека  = "";
	
	Попытка        
		Если РевизияИнтерфейса >= 4000 Тогда
			
			Если Команда = "AuthorizeSales" Тогда
				
				ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "PayByPaymentCard", 
					ВМассив(Неопределено,НомерМерчанта,РеквизитыКартыQR,СуммаОперации,НомерКарты,НомерЧека));
				РезультатВызова = Ждать ОбъектДрайвера.ОплатитьПлатежнойКартойАсинх(ПараметрыПодключения.ИДУстройства, НомерМерчанта, РеквизитыКартыQR, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
				ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
				
			ИначеЕсли Команда = "AuthorizeRefund" Тогда
				
				ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "ReturnPaymentByPaymentCard", 
					ВМассив(Неопределено,НомерМерчанта,РеквизитыКартыQR,СуммаОперации,НомерКарты,НомерЧека,СсылочныйНомер,КодАвторизации));
				РезультатВызова = Ждать ОбъектДрайвера.ВернутьПлатежПоПлатежнойКартеАсинх(ПараметрыПодключения.ИДУстройства, НомерМерчанта, РеквизитыКартыQR, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
				ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
					
			ИначеЕсли Команда = "AuthorizeVoid" Тогда
				
				Если СуммаОригинальнойОперации > 0 И НЕ ПараметрыПодключения.ЧастичнаяОтмена Тогда
					ОписаниеОшибки = НСтр("ru='Частичная отмена не поддерживается драйвером.'");
					ЗаписатьОшибкуВЛог(ПараметрыПодключения, "CancelPaymentByPaymentCard", ОписаниеОшибки);
					РезультатВыполнения = РезультатОперацииНаОборудовании(Ложь, ОписаниеОшибки); 
					Возврат РезультатВыполнения;
				Иначе
					ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "ReturnPaymentByPaymentCard", 
						ВМассив(Неопределено,НомерМерчанта,РеквизитыКартыQR,СуммаОперации,НомерКарты,НомерЧека,СсылочныйНомер,КодАвторизации));
					РезультатВызова = Ждать ОбъектДрайвера.ОтменитьПлатежПоПлатежнойКартеАсинх(ПараметрыПодключения.ИДУстройства, НомерМерчанта, РеквизитыКартыQR, СуммаОперации,
						СуммаОригинальнойОперации, НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура        
					ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
				КонецЕсли;
					
			ИначеЕсли Команда = "PayByPaymentCardWithCashWithdrawal" Тогда
				
				Если ПараметрыПодключения.ВыдачиНаличныхДенежныхСредств Тогда
					ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "PayByPaymentCardWithCashWithdrawal", 
						ВМассив(Неопределено,НомерМерчанта,РеквизитыКартыQR,СуммаОперации,СуммаНаличных));
					РезультатВызова = Ждать ОбъектДрайвера.ОплатитьПлатежнойКартойCВыдачейНаличныхАсинх(ПараметрыПодключения.ИДУстройства, НомерМерчанта, РеквизитыКартыQR, СуммаОперации, 
						СуммаНаличных, НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
					ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
				Иначе
					ОписаниеОшибки = НСтр("ru='Терминал не поддерживает данную операцию.'");
					ЗаписатьОшибкуВЛог(ПараметрыПодключения, "PayByPaymentCardWithCashWithdrawal", ОписаниеОшибки);
					РезультатВыполнения = РезультатОперацииНаОборудовании(Ложь, ОписаниеОшибки); 
					Возврат РезультатВыполнения;
				КонецЕсли;
				
			Иначе
				ОписаниеОшибки = НСтр("ru='Команда не поддерживается драйвером.'");
				ЗаписатьОшибкуВЛог(ПараметрыПодключения, Команда, ОписаниеОшибки);
				РезультатВыполнения = РезультатОперацииНаОборудовании(Ложь, ОписаниеОшибки); 
				Возврат РезультатВыполнения;
			КонецЕсли;
			
		ИначеЕсли РевизияИнтерфейса >= 3005 Тогда
			
			Если Команда = "AuthorizeSales" Тогда
				
				ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "PayByPaymentCard", ВМассив(Неопределено, НомерМерчанта, СуммаОперации, НомерКарты, НомерЧека));
				РезультатВызова = Ждать ОбъектДрайвера.ОплатитьПлатежнойКартойАсинх(ПараметрыПодключения.ИДУстройства, НомерМерчанта, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
				ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
					
			ИначеЕсли Команда = "AuthorizeRefund" Тогда
				
				ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "ReturnPaymentByPaymentCard", 
					ВМассив(Неопределено,НомерМерчанта,СуммаОперации,НомерКарты,НомерЧека,СсылочныйНомер,КодАвторизации));
				РезультатВызова = Ждать ОбъектДрайвера.ВернутьПлатежПоПлатежнойКартеАсинх(ПараметрыПодключения.ИДУстройства, НомерМерчанта, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
				ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
				
			ИначеЕсли Команда = "AuthorizeVoid" Тогда
				
				ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "CancelPaymentByPaymentCard", 
					ВМассив(Неопределено,НомерМерчанта,СуммаОперации,НомерКарты,НомерЧека,СсылочныйНомер,КодАвторизации));
				РезультатВызова = Ждать ОбъектДрайвера.ОтменитьПлатежПоПлатежнойКартеАсинх(ПараметрыПодключения.ИДУстройства, НомерМерчанта, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
				ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
				
			ИначеЕсли РевизияИнтерфейса >= 3006 И Команда = "PayByPaymentCardWithCashWithdrawal" Тогда
				
				Если ПараметрыПодключения.ВыдачиНаличныхДенежныхСредств Тогда
					ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "PayByPaymentCardWithCashWithdrawal", 
						ВМассив(Неопределено,НомерМерчанта,СуммаОперации,СуммаНаличных));
					РезультатВызова = Ждать ОбъектДрайвера.ОплатитьПлатежнойКартойCВыдачейНаличныхАсинх(ПараметрыПодключения.ИДУстройства, НомерМерчанта, СуммаОперации, 
						СуммаНаличных, НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
					ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова, ", , , НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека");
				Иначе
					ОписаниеОшибки = НСтр("ru='Терминал не поддерживает данную операцию.'");
					ЗаписатьОшибкуВЛог(ПараметрыПодключения, "PayByPaymentCardWithCashWithdrawal", ОписаниеОшибки);
					РезультатВыполнения = РезультатОперацииНаОборудовании(Ложь, ОписаниеОшибки); 
					Возврат РезультатВыполнения;
				КонецЕсли;
				
			Иначе
				ОписаниеОшибки = НСтр("ru='Команда не поддерживается драйвером.'");
				ЗаписатьОшибкуВЛог(ПараметрыПодключения, Команда, ОписаниеОшибки);
				РезультатВыполнения = РезультатОперацииНаОборудовании(Ложь, ОписаниеОшибки); 
				Возврат РезультатВыполнения;
			КонецЕсли;
			
		Иначе
			
			Если Команда = "AuthorizeSales" Тогда
				
				ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "PayByPaymentCard", ВМассив(Неопределено, НомерКарты, СуммаОперации, НомерЧека));
				РезультатВызова = Ждать ОбъектДрайвера.ОплатитьПлатежнойКартойАсинх(ПараметрыПодключения.ИДУстройства, НомерКарты, СуммаОперации, 
					НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
				ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
				
			ИначеЕсли Команда = "AuthorizeRefund" Тогда
				
				ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "ReturnPaymentByPaymentCard", 
					ВМассив(Неопределено, НомерКарты,СуммаОперации,НомерЧека,СсылочныйНомер,КодАвторизации));
				РезультатВызова = Ждать ОбъектДрайвера.ВернутьПлатежПоПлатежнойКартеАсинх(ПараметрыПодключения.ИДУстройства, НомерКарты, СуммаОперации, 
					НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
				ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
				
			ИначеЕсли Команда = "AuthorizeVoid" Тогда
				
				ЗаписьЛога = НачатьЗаписьЛогаОперации(ПараметрыПодключения, "CancelPaymentByPaymentCard", 
					ВМассив(Неопределено,НомерКарты,СуммаОперации,НомерЧека,СсылочныйНомер,КодАвторизации));
				РезультатВызова = Ждать ОбъектДрайвера.ОтменитьПлатежПоПлатежнойКартеАсинх(ПараметрыПодключения.ИДУстройства, НомерКарты, СуммаОперации, 
					НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека); // Структура
				ЗавершитьЗаписьЛогаОперации(ЗаписьЛога, РезультатВызова);
				
			Иначе
				ОписаниеОшибки = НСтр("ru='Команда не поддерживается драйвером.'");
				ЗаписатьОшибкуВЛог(ПараметрыПодключения, Команда, ОписаниеОшибки);
				РезультатВыполнения = РезультатОперацииНаОборудовании(Ложь, ОписаниеОшибки); 
				Возврат РезультатВыполнения;    
			КонецЕсли;
			
		КонецЕсли;
			
		Если РезультатВызова.Значение Тогда        
			Если РевизияИнтерфейса >= 4000 Тогда      
				НомерМерчанта = РезультатВызова.Параметры[1]; 
				РеквизитыКартыQR =  РезультатВызова.Параметры[2];
				СуммаОперации = РезультатВызова.Параметры[3];         
				Если Команда = "AuthorizeVoid" Тогда    
					НомерКарты = РезультатВызова.Параметры[5]; 
					НомерЧека = РезультатВызова.Параметры[6]; 
					СсылочныйНомер = РезультатВызова.Параметры[7]; 
					КодАвторизации = РезультатВызова.Параметры[8]; 
					ТекстСлипЧека = РезультатВызова.Параметры[9];  
				ИначеЕсли Команда = "PayByPaymentCardWithCashWithdrawal" Тогда    
					СуммаНаличных = РезультатВызова.Параметры[4];
					НомерКарты = РезультатВызова.Параметры[5]; 
					НомерЧека = РезультатВызова.Параметры[6]; 
					СсылочныйНомер = РезультатВызова.Параметры[7]; 
					КодАвторизации = РезультатВызова.Параметры[8]; 
					ТекстСлипЧека = РезультатВызова.Параметры[9];   
				Иначе
					НомерКарты = РезультатВызова.Параметры[4]; 
					НомерЧека = РезультатВызова.Параметры[5]; 
					СсылочныйНомер = РезультатВызова.Параметры[6]; 
					КодАвторизации = РезультатВызова.Параметры[7]; 
					ТекстСлипЧека = РезультатВызова.Параметры[8];   
				КонецЕсли;
			ИначеЕсли РевизияИнтерфейса >= 3005 Тогда       
				НомерМерчанта = РезультатВызова.Параметры[1]; 
				СуммаОперации = РезультатВызова.Параметры[2]; 
				Если Команда = "PayByPaymentCardWithCashWithdrawal" Тогда   
					СуммаНаличных = РезультатВызова.Параметры[3];
					НомерКарты = РезультатВызова.Параметры[4]; 
					НомерЧека = РезультатВызова.Параметры[5]; 
					СсылочныйНомер = РезультатВызова.Параметры[6]; 
					КодАвторизации = РезультатВызова.Параметры[7]; 
					ТекстСлипЧека = РезультатВызова.Параметры[8];
				Иначе
					НомерКарты = РезультатВызова.Параметры[3]; 
					НомерЧека = РезультатВызова.Параметры[4]; 
					СсылочныйНомер = РезультатВызова.Параметры[5]; 
					КодАвторизации = РезультатВызова.Параметры[6]; 
					ТекстСлипЧека = РезультатВызова.Параметры[7];
				КонецЕсли;
			Иначе   
				НомерКарты = РезультатВызова.Параметры[1];
				СуммаОперации = РезультатВызова.Параметры[2];
				НомерЧека = РезультатВызова.Параметры[3];
				СсылочныйНомер = РезультатВызова.Параметры[4];
				КодАвторизации = РезультатВызова.Параметры[5];
				ТекстСлипЧека = РезультатВызова.Параметры[6];
			КонецЕсли;  
			РезультатВыполнения = РезультатЭквайринговойОперации(Истина, Неопределено, ПараметрыПодключения);
			РезультатВыполнения.НомерМерчанта = НомерМерчанта;
			РезультатВыполнения.НомерКарты    = НомерКарты;
			РезультатВыполнения.НомерЧекаЭТ   = НомерЧека;
			РезультатВыполнения.СсылочныйНомер = СсылочныйНомер;
			РезультатВыполнения.КодАвторизации = КодАвторизации;
			РезультатВыполнения.СуммаОперации  = СуммаОперации; 
			РезультатВыполнения.РеквизитыКартыQR = РеквизитыКартыQR;      
		Иначе
			РезультатВыполнения = Ждать ПолучитьОшибкуДрайвера(ОбъектДрайвера, ЗаписьЛога);
		КонецЕсли;   
		#Удаление
		РезультатВыполнения.Вставить("ТекстСлипЧека" , ТекстСлипЧека);
		#КонецУдаления
		#Вставка
			РезультатВыполнения.Вставить("ТекстСлипЧека" , ДопМодульКлиент.ДобавитьВСлипЧекФИОКлиента(ТекстСлипЧека));
		#КонецВставки
		ПодключаемоеОборудование = МенеджерОборудованияКлиент.ПодключаемоеОборудование();
		ПодключаемоеОборудование.ПоследнийСлипЧек = ТекстСлипЧека; 
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗавершитьЗаписьЛогаИсключением(ЗаписьЛога, ТекстОшибки);
		РезультатВыполнения = ОшибкаВызоваДрайвера(Команда, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат РезультатВыполнения;
	
КонецФункции