#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает краткое представление торговой площадки.
//
// Параметры:
//   ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов - вид торговой площадки.
//
// Возвращаемое значение:
//   Строка - краткое представление вида торговой площадки.
//
Функция ПредставлениеВидаТорговойПлощадки(ВидМаркетплейса) Экспорт

	Представление = "";
	
	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		Представление = НСтр("ru = 'Ozon'");
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсWildberries Тогда
		Представление = НСтр("ru = 'Wildberries'");
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
		Представление = НСтр("ru = 'Яндекс Маркет'");
	КонецЕсли;
	
	Возврат Представление;

КонецФункции

#КонецОбласти

#КонецЕсли