
&ИзменениеИКонтроль("ПроверитьЗаполнениеТабличнойЧастиПодарочныеСертификаты")
Процедура Док_ПроверитьЗаполнениеТабличнойЧастиПодарочныеСертификаты(Объект, Отказ)

	Если Объект.ПодарочныеСертификаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	ИмяТабличнойЧасти = Объект.Ссылка.Метаданные().ТабличныеЧасти.ПодарочныеСертификаты.Имя;
	СинонимИмениТабличнойЧасти = Объект.Ссылка.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Синоним;
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];

	ТипОперацииПоПодарочнымСертификатам = ПодарочныеСертификатыКлиентСервер.ТипОперацииПоПодарочнымСертификатам(Объект);
	ДопустимыеСтатусыИзИсторииПодарочныхСертификатов = ПодарочныеСертификатыКлиентСервер.ДопустимыеСтатусыПодарочныхСертификатов(Объект);

	ТекущаяДата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	ДанныеПодарочныхСертификатов = ПодарочныеСертификатыВызовСервера.ПолучитьДанныеПодарочныхСертификатов(ТабличнаяЧасть.ВыгрузитьКолонку("ПодарочныйСертификат"), ТекущаяДата, Объект.Ссылка);

	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ВводОстатков") 
		Или ТипЗнч(Объект) = Тип("ДокументОбъект.ВводОстатковОПродажахЗаПрошлыеПериоды") Тогда
		РеквизитыВидПодарочногоСертификата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидПодарочногоСертификата, "Номинал, Валюта");
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл // СтрокаТабличнойЧасти
		ДанныеПодарочногоСертификата = ДанныеПодарочныхСертификатов[СтрокаТаблицы.ПодарочныйСертификат];

		Если ДанныеПодарочногоСертификата = Неопределено Тогда
			ТекстОшибки = НСтр("ru='В строке %НомерСтроки% табличной части ""%ТабличнаяЧасть%"" не указан подарочный сертификат.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%",  СинонимИмениТабличнойЧасти);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);

			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			Объект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
			,
			Отказ);
			Продолжить;
		КонецЕсли;

		Если (ТипЗнч(Объект) = Тип("ДокументОбъект.ВводОстатков") 
			Или ТипЗнч(Объект) = Тип("ДокументОбъект.ВводОстатковОПродажахЗаПрошлыеПериоды"))
			И РеквизитыВидПодарочногоСертификата.Номинал < СтрокаТаблицы.СуммаВВалютеСертификата Тогда

			ТекстОшибки = НСтр("ru='Подарочный сертификат %Сертификат% в строке %НомерСтроки% списка ""%ТабличнаяЧасть%"" имеет остаток, превышающий номинал %Номинал% %Валюта%.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",  СтрокаТаблицы.ПодарочныйСертификат);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Номинал%",     РеквизитыВидПодарочногоСертификата.Номинал);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Валюта%",      РеквизитыВидПодарочногоСертификата.Валюта);

			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			Объект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
			,
			Отказ);

		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов")
			И НЕ ЗначениеЗаполнено(ДанныеПодарочногоСертификата.СтатьяДоходов) Тогда

			ТекстОшибки = НСтр("ru='В строке %НомерСтроки% табличной части ""%ТабличнаяЧасть%"" не заполнены данные вида сертификата %ВидСертификата%. 
			|Заполните статью доходов в виде сертификата.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%",  СинонимИмениТабличнойЧасти);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВидСертификата%",  ДанныеПодарочногоСертификата.ВидПодарочногоСертификата);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",  СтрокаТаблицы.ПодарочныйСертификат);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);

			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			Объект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
			,
			Отказ);

		КонецЕсли;

		Если ДанныеПодарочногоСертификата.УчетПодарочныхСертификатов2_5 Тогда

			Если ТипОперацииПоПодарочнымСертификатам = 1 Тогда
				// Продажа
				Если ДанныеПодарочногоСертификата.СтатусАктивации Тогда
					ТекстОшибки = НСтр("ru='Подарочный сертификат %Сертификат% в строке %НомерСтроки% списка ""%ТабличнаяЧасть%"" уже активирован.'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",  СтрокаТаблицы.ПодарочныйСертификат);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);

					ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
					,
					Отказ);
				КонецЕсли;
			ИначеЕсли ТипОперацииПоПодарочнымСертификатам = 2 Тогда
				// Возврат
				Если Не ДанныеПодарочногоСертификата.СтатусАктивации
					Или ДанныеПодарочногоСертификата.ДатаОкончанияДействия < Объект.Дата
					Или ДанныеПодарочногоСертификата.ОформленВозврат
					#Удаление
					Или Не (ДанныеПодарочногоСертификата.Остаток = ДанныеПодарочногоСертификата.Номинал) Тогда
					#КонецУдаления
					#Вставка
					Или Не (ДанныеПодарочногоСертификата.Номинал = 1 ИЛИ ДанныеПодарочногоСертификата.Остаток = ДанныеПодарочногоСертификата.Номинал) Тогда
					#КонецВставки
					ТекстОшибки = НСтр("ru='Подарочный сертификат %Сертификат% в строке %НомерСтроки% списка ""%ТабличнаяЧасть%"" недоступен для возврата. Он, либо просрочен, либо возвращен, либо им уже была произведена оплата.'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",  СтрокаТаблицы.ПодарочныйСертификат);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);

					ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
					,
					Отказ);
				КонецЕсли;
			ИначеЕсли ТипОперацииПоПодарочнымСертификатам = 3 Тогда
				// Оплата
				Если Не ДанныеПодарочногоСертификата.СтатусАктивации 
					Или Не(ДанныеПодарочногоСертификата.ДатаНачалаДействия <= Объект.Дата И ДанныеПодарочногоСертификата.ДатаОкончанияДействия >= Объект.Дата)
					Или ДанныеПодарочногоСертификата.Остаток < ДанныеПодарочногоСертификата.Номинал И ДанныеПодарочногоСертификата.ЧастичнаяОплата = Ложь
					Или	ДанныеПодарочногоСертификата.Остаток <= 0 И ДанныеПодарочногоСертификата.ЧастичнаяОплата = Истина Тогда
					ТекстОшибки = НСтр("ru='Подарочный сертификат %Сертификат% в строке %НомерСтроки% списка ""%ТабличнаяЧасть%"", либо не активирован, либо просрочен, либо полностью погашен.'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",  СтрокаТаблицы.ПодарочныйСертификат);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);

					ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
					,
					Отказ);
				КонецЕсли;
			ИначеЕсли ТипОперацииПоПодарочнымСертификатам = 4 Тогда
				// Аннулирование
				Если Не ДанныеПодарочногоСертификата.СтатусАктивации
					Или Не ДанныеПодарочногоСертификата.Остаток > 0
					Или Не (ДанныеПодарочногоСертификата.ЧастичнаяОплата = Ложь И
					(ДанныеПодарочногоСертификата.Остаток <= ДанныеПодарочногоСертификата.Номинал)
					Или ДанныеПодарочногоСертификата.ЧастичнаяОплата = Истина) Тогда
					ТекстОшибки = НСтр("ru='Подарочный сертификат %Сертификат% в строке %НомерСтроки% списка ""%ТабличнаяЧасть%"", либо не был активирован, либо полностью погашен, либо уже аннулирован.'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",  СтрокаТаблицы.ПодарочныйСертификат);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);

					ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
					,
					Отказ);
				КонецЕсли;

			КонецЕсли;

		Иначе

			Если (ДопустимыеСтатусыИзИсторииПодарочныхСертификатов.Найти(ДанныеПодарочногоСертификата.СтатусИзИсторииПодарочныхСертификатов) = Неопределено
				И ТипЗнч(Объект) <> Тип("ДокументОбъект.ВводОстатков")
				И ТипЗнч(Объект) <> Тип("ДокументОбъект.ВводОстатковОПродажахЗаПрошлыеПериоды"))
				Или (ДопустимыеСтатусыИзИсторииПодарочныхСертификатов.Найти(ДанныеПодарочногоСертификата.СтатусИзИсторииПодарочныхСертификатов) = Неопределено 
				И (ТипЗнч(Объект) = Тип("ДокументОбъект.ВводОстатков")
				Или ТипЗнч(Объект) = Тип("ДокументОбъект.ВводОстатковОПродажахЗаПрошлыеПериоды"))
				И ДанныеПодарочногоСертификата.ДокументПродажи <> Объект.Ссылка) Тогда

				// Для многоразовых сертификатов старого образца допустим статус Частично погашен при остатке равном нулю.
				// Поэтому, для операции оплаты нужно проверить, что остаток больше нуля.
				Если Не (ТипОперацииПоПодарочнымСертификатам = 3 И ДанныеПодарочногоСертификата.Остаток > 0) 

					// Нельзя аннулировать многоразовый подарочный сертификат старого образца, если он частично погашен и у него остаток равен нулю.
					// Документ Чек ККМ при вычислении статуса не учитывает остаток по подарочному сертификату.
					Или (ТипОперацииПоПодарочнымСертификатам = 4 
					И ДанныеПодарочногоСертификата.ЧастичнаяОплата = Истина 
					И ДанныеПодарочногоСертификата.СтатусИзИсторииПодарочныхСертификатов = ПредопределенноеЗначение("Перечисление.СтатусыПодарочныхСертификатов.ЧастичноПогашен")
					И ДанныеПодарочногоСертификата.Остаток = 0) Тогда

					ТекстОшибки = НСтр("ru='Подарочный сертификат %Сертификат% в строке %НомерСтроки% списка ""%ТабличнаяЧасть%"" имеет недопустимый статус ""%Статус%"".'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",  СтрокаТаблицы.ПодарочныйСертификат);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",      ДанныеПодарочногоСертификата.СтатусИзИсторииПодарочныхСертификатов);

					ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
					,
					Отказ);
				КонецЕсли;
			КонецЕсли;

			Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЧекККМ")
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратПодарочныхСертификатов") Тогда
				Если ДанныеПодарочногоСертификата.ДатаОкончанияДействия < Объект.Дата Тогда

					ТекстОшибки = НСтр("ru='Подарочный сертификат %Сертификат% в строке %НомерСтроки% списка ""%ТабличнаяЧасть%"" просрочен. Дата окончания действия %ДатаОкончанияДействия%.'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",             СтрокаТаблицы.ПодарочныйСертификат);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%",            СтрокаТаблицы.НомерСтроки);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаОкончанияДействия%",  ДанныеПодарочногоСертификата.ДатаОкончанияДействия);

					ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
					,
					Отказ);

				КонецЕсли;
			КонецЕсли;

			Если ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратПодарочныхСертификатов") Тогда 
				#Удаление
				Если Не ДанныеПодарочногоСертификата.Номинал = ДанныеПодарочногоСертификата.Остаток Тогда
                #КонецУдаления
				#Вставка
				Если НЕ (ДанныеПодарочногоСертификата.Номинал = 1 ИЛИ ДанныеПодарочногоСертификата.Номинал = ДанныеПодарочногоСертификата.Остаток) Тогда 
				#КонецВставки
					ТекстОшибки = НСтр("ru='Подарочный сертификат %Сертификат% в строке %НомерСтроки% списка ""%ТабличнаяЧасть%"" имеет остаток %Остаток% %Валюта% при номинале в %Номинал% %Валюта% и недоступен для возврата.'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сертификат%",  СтрокаТаблицы.ПодарочныйСертификат);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Остаток%",     ДанныеПодарочногоСертификата.Остаток);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Валюта%",      ДанныеПодарочногоСертификата.Валюта);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Номинал%",     ДанныеПодарочногоСертификата.Номинал);

					ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки, "ПодарочныйСертификат"),
					,
					Отказ);

				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;

	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ВводОстатков") 
		Или ТипЗнч(Объект) = Тип("ДокументОбъект.ВводОстатковОПродажахЗаПрошлыеПериоды") Тогда

		ТипКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПодарочногоСертификата, "ТипКарты");

		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Таблица.ВидПодарочногоСертификата КАК ВидПодарочногоСертификата,
		|	Таблица.Штрихкод КАК Штрихкод,
		|	Таблица.МагнитныйКод КАК МагнитныйКод,
		|	Таблица.ДлинаШтрихкода КАК ДлинаШтрихкода,
		|	Таблица.ДлинаМагнитногоКода КАК ДлинаМагнитногоКода,
		|	Таблица.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ Таблица
		|ИЗ
		|	&ПодарочныеСертификаты КАК Таблица
		|;
		|
		|ВЫБРАТЬ
		|	Таблица.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ КорректныеКоды
		|ИЗ
		|	Таблица КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыПодарочныхСертификатов.ШаблоныКодовПодарочныхСертификатов КАК ШаблоныКодовПодарочныхСертификатов
		|		ПО ШаблоныКодовПодарочныхСертификатов.Ссылка = Таблица.ВидПодарочногоСертификата
		|	И &ПроверитьМагнитныйКод
		|	И &ПроверитьШтрихкод
		|;
		|ВЫБРАТЬ
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	Таблица.МагнитныйКод КАК МагнитныйКод,
		|	Таблица.Штрихкод КАК Штрихкод
		|ИЗ
		|	Таблица
		|ГДЕ
		|	Таблица.НомерСтроки НЕ В (ВЫБРАТЬ Т.НомерСтроки ИЗ КорректныеКоды КАК Т)
		|");

		ПодарочныеСертификаты = ТабличнаяЧасть.Выгрузить(); // ТаблицаЗначений
		ПодарочныеСертификаты.Колонки.Добавить("ВидПодарочногоСертификата", Новый ОписаниеТипов("СправочникСсылка.ВидыПодарочныхСертификатов"));
		ПодарочныеСертификаты.Колонки.Добавить("ДлинаШтрихкода",            ОбщегоНазначения.ОписаниеТипаЧисло(3,0));
		ПодарочныеСертификаты.Колонки.Добавить("ДлинаМагнитногоКода",       ОбщегоНазначения.ОписаниеТипаЧисло(3,0));
		Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
			СтрокаТЧ.ВидПодарочногоСертификата = Объект.ВидПодарочногоСертификата;
			СтрокаТЧ.ДлинаШтрихкода = СтрДлина(СтрокаТЧ.Штрихкод);
			СтрокаТЧ.ДлинаМагнитногоКода = СтрДлина(СтрокаТЧ.МагнитныйКод);
		КонецЦикла;

		ТипКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПодарочногоСертификата, "ТипКарты");
		Если ТипКарты = Перечисления.ТипыКарт.Магнитная ИЛИ ТипКарты = Перечисления.ТипыКарт.Смешанная Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ПроверитьМагнитныйКод", 
			"И ШаблоныКодовПодарочныхСертификатов.НачалоДиапазонаМагнитногоКода <= Таблица.МагнитныйКод
			|	И ШаблоныКодовПодарочныхСертификатов.КонецДиапазонаМагнитногоКода  >= Таблица.МагнитныйКод
			|	И ШаблоныКодовПодарочныхСертификатов.ДлинаМагнитногоКода           = Таблица.ДлинаМагнитногоКода");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ПроверитьМагнитныйКод", "");
		КонецЕсли;
		Если ТипКарты = Перечисления.ТипыКарт.Штриховая ИЛИ ТипКарты = Перечисления.ТипыКарт.Смешанная Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ПроверитьШтрихкод", 
			"И ШаблоныКодовПодарочныхСертификатов.НачалоДиапазонаШтрихкода <= Таблица.Штрихкод
			|	И ШаблоныКодовПодарочныхСертификатов.КонецДиапазонаШтрихкода  >= Таблица.Штрихкод
			|	И ШаблоныКодовПодарочныхСертификатов.ДлинаШтрихкода           = Таблица.ДлинаШтрихкода");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ПроверитьШтрихкод", "");
		КонецЕсли;

		Запрос.УстановитьПараметр("ПодарочныеСертификаты", ПодарочныеСертификаты);

		Если ТипКарты = Перечисления.ТипыКарт.Магнитная Тогда
			ТекстОшибки = НСтр("ru='Магнитный код %МагнитныйКод% в строке %НомерСтроки% табличной части ""%ТабличнаяЧасть%"" не соответствует требованиям вида подарочного сертификата """"%ВидПодарочногоСертификата%""""'");
		ИначеЕсли ТипКарты = Перечисления.ТипыКарт.Штриховая  Тогда
			ТекстОшибки = НСтр("ru='Штрихкод %Штрихкод% в строке %НомерСтроки% табличной части ""%ТабличнаяЧасть%"" не соответствует требованиям вида подарочного сертификата """"%ВидПодарочногоСертификата%""""'");
		Иначе
			ТекстОшибки = НСтр("ru='Магнитный код %МагнитныйКод% или штрихкод %Штрихкод% в строке %НомерСтроки% табличной части ""%ТабличнаяЧасть%"" не соответствует требованиям вида подарочного сертификата """"%ВидПодарочногоСертификата%""""'");
		КонецЕсли;

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл

			Текст = ТекстОшибки;
			Текст = СтрЗаменить(Текст, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
			Текст = СтрЗаменить(Текст, "%ВидПодарочногоСертификата%",             Объект.ВидПодарочногоСертификата);
			Текст = СтрЗаменить(Текст, "%Штрихкод%",     Выборка.Штрихкод);
			Текст = СтрЗаменить(Текст, "%МагнитныйКод%", Выборка.МагнитныйКод);
			Текст = СтрЗаменить(Текст, "%НомерСтроки%",  Выборка.НомерСтроки);

			ОбщегоНазначения.СообщитьПользователю(
			Текст,
			Объект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, Выборка.НомерСтроки, "ПодарочныйСертификат"),
			,
			Отказ);

		КонецЦикла;

		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Таблица.Штрихкод КАК Штрихкод,
		|	Таблица.МагнитныйКод КАК МагнитныйКод,
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	Таблица.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ Таблица
		|ИЗ
		|	&ПодарочныеСертификаты КАК Таблица
		|;
		|
		|ВЫБРАТЬ
		|	Таблица.Штрихкод КАК Штрихкод,
		|	Таблица.МагнитныйКод КАК МагнитныйКод,
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	Таблица.СерийныйНомер КАК СерийныйНомер,
		|	ЕСТЬNULL(СправочникПодарочныеСертификатыПоШтрихкоду.Ссылка, ЗНАЧЕНИЕ(Справочник.ПодарочныеСертификаты.ПустаяСсылка)) КАК ПодарочныйСертификатПоШтрихкоду,
		|	ЕСТЬNULL(СправочникПодарочныеСертификатыПоМагнитномуКоду.Ссылка, ЗНАЧЕНИЕ(Справочник.ПодарочныеСертификаты.ПустаяСсылка)) КАК ПодарочныйСертификатПоМагнитномуКоду,
		|	ЕСТЬNULL(СправочникПодарочныйСертификатПоСерийномуНомеру.Ссылка, ЗНАЧЕНИЕ(Справочник.ПодарочныеСертификаты.ПустаяСсылка)) КАК ПодарочныйСертификатПоСерийномуНомеру
		|ИЗ
		|	Таблица КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодарочныеСертификаты КАК СправочникПодарочныеСертификатыПоШтрихкоду
		|		ПО СправочникПодарочныеСертификатыПоШтрихкоду.Штрихкод = Таблица.Штрихкод
		|		И СправочникПодарочныеСертификатыПоШтрихкоду.Владелец = &ВидПодарочногоСертификата
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодарочныеСертификаты КАК СправочникПодарочныеСертификатыПоМагнитномуКоду
		|		ПО СправочникПодарочныеСертификатыПоМагнитномуКоду.МагнитныйКод = Таблица.МагнитныйКод
		|		И СправочникПодарочныеСертификатыПоМагнитномуКоду.Владелец = &ВидПодарочногоСертификата
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодарочныеСертификаты КАК СправочникПодарочныйСертификатПоСерийномуНомеру
		|		ПО СправочникПодарочныйСертификатПоСерийномуНомеру.Код = Таблица.СерийныйНомер
		|");

		Запрос.УстановитьПараметр("ВидПодарочногоСертификата", Объект.ВидПодарочногоСертификата);
		Запрос.УстановитьПараметр("ПодарочныеСертификаты", ТабличнаяЧасть.Выгрузить());

		Таблица = Запрос.Выполнить().Выгрузить();

		Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл  // СтрокаТабличнойЧасти

			Если Не ЗначениеЗаполнено(СтрокаТЧ.ПодарочныйСертификат) Тогда

				НайденнаяСтрока = Таблица.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаТЧ.НомерСтроки))[0];

				Если ТипКарты = Перечисления.ТипыКарт.Штриховая Тогда

					Если НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру <> НайденнаяСтрока.ПодарочныйСертификатПоШтрихкоду Тогда

						Текст = НСтр("ru='В строке %НомерСтроки% табличной части ""%ТабличнаяЧасть%"" данные заполнены некорректно.
						|Для штрихкода %Штрихкод% сертификат %1%.
						|Для серийного номера %СерийныйНомер% сертификат %2%.'");
						Текст = СтрЗаменить(Текст, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
						Текст = СтрЗаменить(Текст, "%Штрихкод%",      НайденнаяСтрока.Штрихкод);
						Текст = СтрЗаменить(Текст, "%СерийныйНомер%", НайденнаяСтрока.СерийныйНомер);
						Текст = СтрЗаменить(Текст, "%МагнитныйКод%",  НайденнаяСтрока.МагнитныйКод);
						Текст = СтрЗаменить(Текст, "%НомерСтроки%",   НайденнаяСтрока.НомерСтроки);
						Текст = СтрЗаменить(Текст, "%1%", ?(ЗначениеЗаполнено(НайденнаяСтрока.ПодарочныйСертификатПоШтрихкоду),НайденнаяСтрока.ПодарочныйСертификатПоШтрихкоду,НСтр("ru = 'не найден'")));
						Текст = СтрЗаменить(Текст, "%2%", ?(ЗначениеЗаполнено(НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру),НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру,НСтр("ru = 'не найден'")));

						ОбщегоНазначения.СообщитьПользователю(
						Текст,
						Объект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, НайденнаяСтрока.НомерСтроки, "ПодарочныйСертификат"),
						,
						Отказ);
					КонецЕсли;

				ИначеЕсли ТипКарты = Перечисления.ТипыКарт.Магнитная Тогда

					Если НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру <> НайденнаяСтрока.ПодарочныйСертификатПоМагнитномуКоду Тогда

						Текст = НСтр("ru='В строке %НомерСтроки% табличной части ""%ТабличнаяЧасть%"" данные заполнены некорректно.
						|Для магнитного кода %МагнитныйКод% сертификат %1%.
						|Для серийного номера %СерийныйНомер% сертификат %2%.'");
						Текст = СтрЗаменить(Текст, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
						Текст = СтрЗаменить(Текст, "%Штрихкод%",      НайденнаяСтрока.Штрихкод);
						Текст = СтрЗаменить(Текст, "%СерийныйНомер%", НайденнаяСтрока.СерийныйНомер);
						Текст = СтрЗаменить(Текст, "%МагнитныйКод%",  НайденнаяСтрока.МагнитныйКод);
						Текст = СтрЗаменить(Текст, "%НомерСтроки%",   НайденнаяСтрока.НомерСтроки);
						Текст = СтрЗаменить(Текст, "%1%", ?(ЗначениеЗаполнено(НайденнаяСтрока.ПодарочныйСертификатПоМагнитномуКоду),НайденнаяСтрока.ПодарочныйСертификатПоМагнитномуКоду,НСтр("ru = 'не найден'")));
						Текст = СтрЗаменить(Текст, "%2%", ?(ЗначениеЗаполнено(НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру),НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру,НСтр("ru = 'не найден'")));

						ОбщегоНазначения.СообщитьПользователю(
						Текст,
						Объект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, НайденнаяСтрока.НомерСтроки, "ПодарочныйСертификат"),
						,
						Отказ);

					КонецЕсли;

				Иначе

					Если НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру <> НайденнаяСтрока.ПодарочныйСертификатПоМагнитномуКоду
						ИЛИ НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру <> НайденнаяСтрока.ПодарочныйСертификатПоШтрихкоду Тогда

						Текст = НСтр("ru='В строке %НомерСтроки% табличной части ""%ТабличнаяЧасть%"" данные заполнены некорректно.
						|Для магнитного кода %МагнитныйКод% сертификат %1%.
						|Для штрихкода %Штрихкод% сертификат %2%.
						|Для серийного номера %СерийныйНомер% сертификат %3%.'");
						Текст = СтрЗаменить(Текст, "%ТабличнаяЧасть%", СинонимИмениТабличнойЧасти);
						Текст = СтрЗаменить(Текст, "%Штрихкод%",      НайденнаяСтрока.Штрихкод);
						Текст = СтрЗаменить(Текст, "%СерийныйНомер%", НайденнаяСтрока.СерийныйНомер);
						Текст = СтрЗаменить(Текст, "%МагнитныйКод%",  НайденнаяСтрока.МагнитныйКод);
						Текст = СтрЗаменить(Текст, "%НомерСтроки%",   НайденнаяСтрока.НомерСтроки);
						Текст = СтрЗаменить(Текст, "%1%", ?(ЗначениеЗаполнено(НайденнаяСтрока.ПодарочныйСертификатПоМагнитномуКоду),НайденнаяСтрока.ПодарочныйСертификатПоМагнитномуКоду,НСтр("ru = 'не найден'")));
						Текст = СтрЗаменить(Текст, "%2%", ?(ЗначениеЗаполнено(НайденнаяСтрока.ПодарочныйСертификатПоШтрихкоду),НайденнаяСтрока.ПодарочныйСертификатПоШтрихкоду,НСтр("ru = 'не найден'")));
						Текст = СтрЗаменить(Текст, "%3%", ?(ЗначениеЗаполнено(НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру),НайденнаяСтрока.ПодарочныйСертификатПоСерийномуНомеру,НСтр("ru = 'не найден'")));

						ОбщегоНазначения.СообщитьПользователю(
						Текст,
						Объект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, НайденнаяСтрока.НомерСтроки, "ПодарочныйСертификат"),
						,
						Отказ);

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	КлючевыеРеквизиты = Новый Массив;
	КлючевыеРеквизиты.Добавить("ПодарочныйСертификат");
	ОбщегоНазначенияУТ.ПроверитьНаличиеДублейСтрокТЧ(Объект, ИмяТабличнойЧасти, КлючевыеРеквизиты, Отказ, СинонимИмениТабличнойЧасти);

КонецПроцедуры
