
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ТипКлиента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
			ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьБланка.Видимость = Ложь;
			ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьТНЮЛ.Видимость = РейсИЛИЗаказЕсть(ТекущиеДанные.Основание);
		Иначе
			ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьБланка.Видимость = Ложь;
			ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьТНЮЛ.Видимость = Истина;
		КонецЕсли;
		Если ТекущиеДанные.Статус = Истина Тогда
			ЭтаФорма.Элементы.ФормаЗанесеноВЕГАИС.Доступность = Ложь;
		Иначе
			ЭтаФорма.Элементы.ФормаЗанесеноВЕГАИС.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗанесеноВЕГАИС(Команда)
    
    ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
    ИзменитьСтатус(ВыделенныеСтроки, "Выполнить");
    Элементы.Список.Обновить();
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатус(ВыделенныеСтроки, Команда)
   	
    Если НЕ ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
        Возврат;
    КонецЕсли;
    
    Если Команда = "Выполнить" Тогда
        Состояние = Истина;
    Иначе Если Команда = "Отменить" Тогда
        Состояние = Ложь;
	КонецЕсли; 
	КонецЕсли;
    
    Сумма = 0;
    Для Каждого Строка Из ВыделенныеСтроки Цикл
        Объект = Строка.ПолучитьОбъект();
        Объект.Статус = Состояние;
        Объект.Записать();      
    КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
    ИзменитьСтатус(ВыделенныеСтроки, "Отменить");
	Элементы.Список.Обновить();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РейсИЛИЗаказЕсть(Основание)
	Возврат Документы.ЗаявкаВЕГАИСЛес.СуществуютРейсыИлиЗаказыНаДоставку(Основание);
КонецФункции


