#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОбъектДоставкиЕстьУПартнера(Широта=Неопределено,Долгота=Неопределено,Партнер) Экспорт  
	
	Условия = "
	|	И ОбъектыДоставки.Долгота = &Долгота
	|	И ОбъектыДоставки.Широта = &Широта";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК Результат
	|ИЗ
	|	Справочник.ОбъектыДоставки КАК ОбъектыДоставки
	|ГДЕ
	|	ОбъектыДоставки.Владелец = &Партнер
	|	И НЕ ОбъектыДоставки.Широта = 0
	|	И НЕ ОбъектыДоставки.Долгота = 0" + ?((Широта=Неопределено И Долгота=Неопределено),"", Условия);		
	
	Запрос.УстановитьПараметр("Долгота", Долгота);
	Запрос.УстановитьПараметр("Широта", Широта);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Возврат Не Запрос.Выполнить().Пустой();	
		
КонецФункции

Функция СоздатьОбъектДоставки(Структура) Экспорт
	
	ОбъектДоставки = Справочники.ОбъектыДоставки.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектДоставки,Структура);  

	Попытка 
		ОбъектДоставки.Записать();
	Исключение
		ОбъектДоставки = Справочники.ОбъектыДоставки.ПустаяСсылка();	
	КонецПопытки;

	Возврат ОбъектДоставки.Ссылка;
	
КонецФункции 

Функция ПолучитьСтруктуруОбъектаДоставки() Экспорт
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Широта",);
	СтруктураОбъекта.Вставить("Долгота",);
	СтруктураОбъекта.Вставить("Адрес",);
	СтруктураОбъекта.Вставить("ТелефонНаВыгрузке",);
	СтруктураОбъекта.Вставить("ЗонаДоставкиДляВодителя",);
	СтруктураОбъекта.Вставить("Наименование",);
	СтруктураОбъекта.Вставить("НомерДома",);
	СтруктураОбъекта.Вставить("НомерКвартиры",);
	СтруктураОбъекта.Вставить("НомерКорпуса",);
	СтруктураОбъекта.Вставить("НомерОфиса",);
	СтруктураОбъекта.Вставить("ДополнениеКАдресу",);
	СтруктураОбъекта.Вставить("АдресДоставкиКарта",);
	СтруктураОбъекта.Вставить("Владелец",);
	СтруктураОбъекта.Вставить("Автор",);
	СтруктураОбъекта.Вставить("СозданАвтоматически",);
	
	Возврат СтруктураОбъекта;
	
КонецФункции

#КонецЕсли
