
&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ)
	Если Владелец = Справочники.Партнеры.РозничныйПокупатель и не РольДоступна("ПолныеПрава") Тогда
		Отказ = Истина;                                           
		Сообщить("Сохранение объекта для РОЗНИЦЫ запрещено!");
	КонецЕсли;
КонецПроцедуры


&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
	СозданАвтоматически = Ложь;
КонецПроцедуры

