///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет макеты печатных форм, в которых поддерживается перевод на другие языки.
// 
// Параметры:
//  Макеты - Массив из ОбъектМетаданныхМакет
//
Процедура ПриОпределенииДоступныхДляПереводаМакетов(Макеты) Экспорт
	
	Макеты.Добавить(Метаданные.Обработки.ПечатьСчетовНаОплату.Макеты.ПФ_MXL_Invoice);
	Макеты.Добавить(Метаданные.Обработки.ПечатьСчетовНаОплату.Макеты.ПФ_MXL_DebitCreditNote);
	Макеты.Добавить(Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента.Макеты.ПФ_MXL_ЗаявкаНаВозврат);
	Макеты.Добавить(Метаданные.Обработки.ПечатьЗаказовНаТоварыУслуги.Макеты.ПФ_MXL_ЗаказКлиента);
	Макеты.Добавить(Метаданные.Обработки.ПечатьЗаказовНаТоварыУслуги.Макеты.ПФ_MXL_ЗаказПоставщику);
	
	
	
КонецПроцедуры

#КонецОбласти
