
&Вместо("ВариантОбеспеченияИФлагОбособленноПоУмолчанию")
Функция Док_ВариантОбеспеченияИФлагОбособленноПоУмолчанию(ЗаполнятьОбособленно)
	КОбеспечению   = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению");
	НеОбеспечивать = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
	
	Результат = Новый Структура();  
	//Альтерра Светлакова задача №59485 (обеспечение номенклатуры по умолчанию "Не обеспечивать")
	Результат.Вставить("Товар",  Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	Результат.Вставить("Тара",   Новый Структура("ВариантОбеспечения,Обособленно", КОбеспечению,   Ложь));
	Результат.Вставить("Работа", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	Результат.Вставить("Услуга", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	
	Если ЗаполнятьОбособленно Тогда
		
		Результат.Товар.Обособленно         = Истина;
		Результат.Работа.Обособленно        = Истина;
		Результат.Работа.ВариантОбеспечения = КОбеспечению;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
