#Область СтатьяРасходовБУ

&НаКлиенте
Процедура Док_ТоварыСтатьяРасходовБУНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.ПрочиеРасходы.ТекущаяСтрока);
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовБУВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Элементы.ПрочиеРасходы.ТекущиеДанные.СтатьяРасходовБУ);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовБУВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Объект.ПрочиеРасходы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Строка.СтатьяРасходовБУ = Результат; 
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПрочиеРасходыСтатьяРасходовПриИзмененииПосле(Элемент)
	
	СтрокаТаблицы = Элементы.ПрочиеРасходы.ТекущиеДанные;
	Если Не значениезаполнено(СтрокаТаблицы.СтатьяРасходовБУ) Тогда
		СтрокаТаблицы.СтатьяРасходовБУ=СтрокаТаблицы.СтатьяРасходов;
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура Док__ЗаполнитьСтатьюРасходовБУПосле(Команда)
	
	ВыделенныеСтроки = Элементы.ПрочиеРасходы.ВыделенныеСтроки;
	
	Если Объект.ПрочиеРасходы.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В список ""Расходы"" не введено ни одной строки.'"));
		Возврат;
	ИначеЕсли ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В списке ""Расходы"" не выделено ни одной строки.'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовБУВыборДляЗаполненияЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Элементы.ПрочиеРасходы.ТекущиеДанные.СтатьяРасходовБУ);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элементы.ПрочиеРасходыСтатьяРасходовБУ.ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовБУВыборДляЗаполненияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.ПрочиеРасходы.ВыделенныеСтроки);
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ДанныеСтроки = Объект.ПрочиеРасходы.НайтиПоИдентификатору(Строка);
		ДанныеСтроки.СтатьяРасходовБУ = Результат;
		Элементы.ПрочиеРасходы.ТекущаяСтрока = Строка;
		ПрочиеРасходыСтатьяРасходовПриИзмененииСервер(КэшированныеЗначения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Док_УстановитьОбъектРасходовПосле(Команда)

	ВыделенныеСтроки = Элементы.ПрочиеРасходы.ВыделенныеСтроки;
	
	Если Объект.ПрочиеРасходы.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для выполнения команды требуется выделить строки табличной части.'"));
		Возврат;
	КонецЕсли;
	
	СтруктураПараметры = Новый Структура;
	ВыбранноеЗначение = Неопределено;
	
	ОткрытьФорму(
		"Общаяформа.ФормаВыбораОбъектовАналитики", 
		СтруктураПараметры,
		ЭтаФорма,,,, Новый ОписаниеОповещения("УстановитьОбъектРасходовЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьОбъектРасходовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
    ВыбранноеЗначение = Результат;
    
    Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда    
        Для Каждого Строка Из ВыделенныеСтроки Цикл 
            СтрокаТаблицы = Объект.ПрочиеРасходы.НайтиПоИдентификатору(Строка);
            Если СтрокаТаблицы <> Неопределено Тогда
                СтрокаТаблицы.ОбъектРасходов = ВыбранноеЗначение.ОбъектРасходов;
                СтрокаТаблицы.АналитикаОбъекта = ВыбранноеЗначение.АналитикаОбъекта;
            КонецЕсли; 
        КонецЦикла; 
    КонецЕсли;

КонецПроцедуры
