///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм расчета себестоимости
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОсновнойИнтерфейсМеханизма

// Запуск расчета себестоимости.
//
// Параметры:
//	ПараметрыЗапуска - Структура:
//		* Дата - Дата - период расчета себестоимости
//		* МассивОрганизаций - СправочникСсылка.Организации - рассчитывать только по указанной организации;
//			также будут пересчитана себестоимость по организациям, связанным по схеме Интеркампани с указанной
//					- Массив - массив организаций, по которым надо рассчитать себестоимость, другие организации не рассчитываются
//		* ПредварительныйРасчет - Булево - выполнять фактический или предварительный расчет;
//			предварительный расчет может выполняться
//				= регламентным заданием
//				= как подготовительный этап к распределению расходов на продукцию
//		* РегламентноеЗадание - Булево - если Истина, значит вызвана из регламентного задания расчета предварительной себестоимости
//		* МестоВызоваРасчета - Строка - необязательный, полное имя процедуры, вызвавшей расчет
//		* ТолькоРасчетСебестоимости - Булево -
//	ПараметрыРасчета - Структура - параметры расчета, сформированные в вызывающем механизме.
//	ПараметрыОтладки - Структура - предназначена для переопределения одноименных свойств структуры ПараметрыРасчета.
//		Подробнее см. пояснения в коде ИнициализироватьПараметрыРасчетаСебестоимости к параметру ПараметрыОтладки.
//
Процедура РассчитатьВсе(ПараметрыЗапуска, ПараметрыРасчета = Неопределено, ПараметрыОтладки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыОтладки = Неопределено Тогда
		ПараметрыОтладки = Новый Структура; // для упрощения дальнейших обращений к этому свойству
	КонецЕсли;
	
	Если НЕ ПараметрыЗапуска.Свойство("ТолькоРасчетСебестоимости") Тогда
		// Запущено не из механизма расчета партий
		ПараметрыЗапуска.Вставить("ТолькоРасчетСебестоимости", (ПараметрыРасчета = Неопределено));
	КонецЕсли;
	
	// Проверим, закончено ли обновление ИБ
	Если ПараметрыЗапуска.ТолькоРасчетСебестоимости Тогда // при запуске из партионного учета версии 2.2 проверка уже выполнена там
		РасчетСебестоимостиПрикладныеАлгоритмы.ПроверитьБлокировкуДанныхПриОбновленииИБ(Истина, , ПараметрыОтладки);
	КонецЕсли;
	
	// Инициализируем параметры расчета
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	НомерГруппы = 0;
	
	// Выполним расчет себестоимости по каждой из групп связанных организаций
	Пока НомерГруппы < ПараметрыРасчета.ГруппыОрганизацийПоИнтеркампани.Количество() Цикл
		
		ПараметрыЗапускаРасчетаПоГруппеОрганизаций = Новый Структура(
			"ГруппаОрганизаций, МетодОценки",
			ПараметрыРасчета.ГруппыОрганизацийПоИнтеркампани[НомерГруппы],
			ПараметрыРасчета.МетодыОценкиПоГруппамОрганизаций[НомерГруппы]);
		
		РассчитатьСебестоимостьПоГруппеОрганизаций(ПараметрыЗапускаРасчетаПоГруппеОрганизаций, ПараметрыРасчета, ПараметрыОтладки);
		
		НомерГруппы = НомерГруппы + 1;
		
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВТПромежуточнаяСебестоимостьТоваров");
	
	// Записываем движения (в случае, если расчет себестоимости запущен самостоятельно, а не как этап расчета партий)
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаписатьСформированныеДвижения(
		ПараметрыРасчета,
		ПараметрыОтладки.ПротоколыРасчета);
	
КонецПроцедуры

// Обертка для запуска расчета - выполняет расчет в Попытке - Исключении
// Параметры аналогичны процедуре РассчитатьВсе()
// 
// Параметры:
//	ПараметрыЗапуска - Структура - содержит ключи:
//		Дата - Дата - период расчета себестоимости
//		МассивОрганизаций - СправочникСсылка.Организации - рассчитывать только по указанной организации;
//			также будут пересчитана себестоимость по организациям, связанным по схеме Интеркампани с указанной
//					- Массив - массив организаций, по которым надо рассчитать себестоимость, другие организации не рассчитываются
//		ПредварительныйРасчет - Булево - выполнять фактический или предварительный расчет;
//			предварительный расчет может выполняться
//				= регламентным заданием
//				= как подготовительный этап к распределению расходов на продукцию
//		РегламентноеЗадание - Булево - если Истина, значит вызвана из регламентного задания расчета предварительной себестоимости
//		МестоВызоваРасчета - Строка - необязательный, полное имя процедуры, вызвавшей расчет
//	ПараметрыРасчета - Структура - параметры расчета, сформированные в вызывающем механизме.
//	ПараметрыОтладки - Структура - предназначена для переопределения одноименных свойств структуры ПараметрыРасчета.
//		Подробнее см. пояснения в коде ИнициализироватьПараметрыРасчетаСебестоимости
//
// Возвращаемое значение:
//	Булево - признак успешного выполнения расчета.
//
Функция РассчитатьВсеВПопыткеИсключении(ПараметрыЗапуска, ПараметрыРасчета = Неопределено, ПараметрыОтладки = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Попытка
		РассчитатьВсе(ПараметрыЗапуска,	ПараметрыРасчета, ПараметрыОтладки);
	Исключение
		
		Если ПараметрыРасчета = Неопределено Тогда
			ПараметрыРасчета = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьОсновныеПараметрыРасчета(
				ПараметрыЗапуска.Дата,
				ПараметрыЗапуска.Дата,
				ПараметрыЗапуска.МассивОрганизаций,
				Ложь,
				Ложь);
		КонецЕсли;
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ОбработатьИсключениеВызоваРассчитатьВсе(
			ПараметрыРасчета,
			ИнформацияОбОшибке,
			Отказ);
		
	КонецПопытки;
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПереходНаПартионныйУчет22

// При необходимости заполним служебный реквизит РасчетПартий:
// если расчет текущего периода ранее был выполнен в партионном учете версии 2.1, то этот реквизит не заполнялся.
//
Процедура ЗаполнитьРеквизитРасчетПартийВДвижениях(ПараметрыРасчета) Экспорт
	
	Если Не ПроверитьНеобходимостьЗаполненияРеквизитаРасчетПартий(ПараметрыРасчета) Тогда
		Возврат;
	КонецЕсли;
	
		
	// ПартииПрочихРасходов
	ОписаниеРегистра    = ПараметрыРасчета.Движения[Метаданные.РегистрыНакопления.ПартииПрочихРасходов.Имя];
	ТекстРасчетПартий   =
		"ВЫБОР КОГДА Т.РасчетПартий ТОГДА ИСТИНА
		|	КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	 И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовУпр, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|		ТОГДА ИСТИНА
		|	КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	 И ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|		ТОГДА ИСТИНА
		|	КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
		|	 И Т.АналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|	 И НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ
		|КОНЕЦ";
	ТекстСоединения     =
		"ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|	ПО Т.СтатьяРасходов = СтатьиРасходов.Ссылка";
	ТекстУпорядочивание = "Т.Подразделение, Т.СтатьяРасходов, Т.АналитикаРасходов";
	ЗаполнитьРеквизитРасчетПартий(ПараметрыРасчета, ОписаниеРегистра, ТекстРасчетПартий, ТекстСоединения, ТекстУпорядочивание);
	
	// СебестоимостьТоваров
	ОписаниеРегистра    = ПараметрыРасчета.Движения[Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя];
	ТекстРасчетПартий   =
		"ВЫБОР КОГДА Т.РасчетПартий ТОГДА ИСТИНА
		|	КОГДА НЕ Т.РасчетСебестоимости
		|		И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
		// Прочие расходы на себестоимость товаров
		|		И ((Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И Т.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|			И Т.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
		|			И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
		|			И (Т.Количество = 0 И Т.Стоимость = 0 И Т.СтоимостьБезНДС = 0)
		|			И (Т.ДопРасходы <> 0 ИЛИ Т.ДопРасходыБезНДС <> 0))
		|		 )
		|	ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ
		|КОНЕЦ";
	ТекстСоединения     = "";
	ТекстУпорядочивание = "Т.АналитикаУчетаНоменклатуры, Т.ВидЗапасов";
	ЗаполнитьРеквизитРасчетПартий(ПараметрыРасчета, ОписаниеРегистра, ТекстРасчетПартий, ТекстСоединения, ТекстУпорядочивание);
	
	// ДвиженияНоменклатураДоходыРасходы
	ОписаниеРегистра    = ПараметрыРасчета.Движения[Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя];
	ТекстРасчетПартий   =
		"ВЫБОР КОГДА Т.РасчетПартий ТОГДА ИСТИНА
		|	КОГДА НЕ Т.РасчетСебестоимости
		|		И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость)
		|		И Т.ДокументДвижения <> НЕОПРЕДЕЛЕНО
		|		И Т.Количество = 0
		|	ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ
		|КОНЕЦ";
	ТекстСоединения     = "";
	ТекстУпорядочивание = "Т.АналитикаУчетаНоменклатуры, Т.ВидЗапасов";
	ЗаполнитьРеквизитРасчетПартий(ПараметрыРасчета, ОписаниеРегистра, ТекстРасчетПартий, ТекстСоединения, ТекстУпорядочивание);
	
КонецПроцедуры

// Проверяет, был ли выполнен расчет текущего периода в партионном учете версии 2.2.
// Если был выполнен, то значит выполнялись процедуры
//	- ОчиститьНеиспользуемыеДанныеПартионногоУчетаВерсии21()
//	- ИсправитьПроблемыВДвиженияхИДокументах() (в части корректировки полей партионного учета версии 2.2)
// и в регистрах нет устаревших и некорректных движений.
//
Функция ПроверитьНеобходимостьЗаполненияРеквизитаРасчетПартий(ПараметрыРасчета)
	
	// Проверим наличие движений по партионным регистрам версии 2.1
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	""%1"" КАК РегистрСоСтарымиДвижениями
	|ИЗ
	|	%1 КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И НЕ Т.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров
	|";
	
	ТекстЗапроса = "";
	
	Для Каждого МетаданныеРегистра Из НеиспользуемыеДанныеМеханизмаВерсии21() Цикл
		ТекстЗапроса = ТекстЗапроса
			+ ?(ТекстЗапроса = "", "", ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении())
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаЗапроса, МетаданныеРегистра.Ключ.ПолноеИмя());
	КонецЦикла;
	
	// Проверим наличие первичных движений себестоимости с незаполненным типом записи
	ТекстЗапроса = ТекстЗапроса
	+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""%1"" КАК РегистрСоСтарымиДвижениями
	|ИЗ
	|	%1 КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И НЕ Т.РасчетСебестоимости
	|	И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|	И НЕ Т.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|";
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.ПолноеИмя());
	
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой(); // есть "старые" движения - расчет в версии 2.2 еще не выполнялся
	
КонецФункции

// Заполняет реквизит РасчетПартий, если период был рассчитан в партионном учете версии 2.1.
//
Процедура ЗаполнитьРеквизитРасчетПартий(ПараметрыРасчета, ОписаниеРегистра,
			ТекстРасчетПартий, ТекстСоединения, ТекстУпорядочивание) Экспорт
	
	// В регистре могут быть движения с некорректно незаполненным полем РасчетПартий.
	// Такие движения будут, если месяц был рассчитан ранее в партионном учете версии 2.1.
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗаполнитьРеквизитРасчетПартий" + ОписаниеРегистра.ИмяРегистра);
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	// Получим перечень регистраторов с некорректными движениями
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	%1 КАК Т
	|		%2
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И НЕ Т.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|	И %3 <> Т.РасчетПартий";
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст,
	    ОписаниеРегистра.ПолноеИмяРегистра,
		ТекстСоединения,
		ТекстРасчетПартий); 
		
	РасчетСебестоимостиПротоколРасчета.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВТРегистраторыСНекорректнымиДвижениями");
	Запрос.Выполнить();
	РасчетСебестоимостиПротоколРасчета.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета, Истина);
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВТРегистраторыСНекорректнымиДвижениями") > 0 Тогда
		
		// Выберем движения, правильно заполним служебный реквизит и перезапишем эти движения в ИБ.
		Запрос.Текст =
		"ВЫБРАТЬ
		|	%1
		|ИЗ
		|	%2 КАК Т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРегистраторыСНекорректнымиДвижениями КАК Регистраторы
		|		ПО Т.Регистратор = Регистраторы.Регистратор
		|		%3
		|
		|УПОРЯДОЧИТЬ ПО
		|	%4";
		
		// Подставим шаблоны в текст запроса
		ПоляОсновнойТаблицыРегистра = СтрЗаменить(ОписаниеРегистра.ПоляОсновнойТаблицыРегистра, "%1", "Т.");
		ПоляОсновнойТаблицыРегистра = СтрЗаменить(ПоляОсновнойТаблицыРегистра, "Т.РасчетПартий", ТекстРасчетПартий + " КАК РасчетПартий");
		
		ПоляУпорядочивания = "Т.Регистратор, Т.РасчетПартий, Т.Период"
			+ ?(ОписаниеРегистра.ЕстьОрганизация, 		  ", Т.Организация", "")
			+ ?(ОписаниеРегистра.ЕстьАналитикаПартнеров,  ", Т.АналитикаУчетаПоПартнерам", "")
			+ ?(ОписаниеРегистра.ЕстьСвойствоВидДвижения, ", Т.ВидДвижения", "")
			+ ?(ПустаяСтрока(ТекстУпорядочивание), "", ", ") + ТекстУпорядочивание;
		
		Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст,
			ПоляОсновнойТаблицыРегистра,
			ОписаниеРегистра.ПолноеИмяРегистра,
			ТекстСоединения,
			ПоляУпорядочивания); 
			
		// Перезапишем движения с правильно заполненным служебным реквизитом
		ЗаписатьДвиженияПоРегистру(
			ПараметрыРасчета,
			Запрос,
			ОписаниеРегистра.МенеджерРегистра);
		
		ОписаниеРегистра.НадоОбновитьРасчетныйКэш = Истина;
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВТРегистраторыСНекорректнымиДвижениями");
	
КонецПроцедуры


// При расчете в партионном учете версии 2.2 очищает начальные остатки и движения партионного учета версии 2.1.
//
Процедура ОчиститьНеиспользуемыеДанныеПартионногоУчетаВерсии21(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ОчиститьНеиспользуемыеДанныеПартионногоУчетаВерсии21");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);

#Область ОчисткаОстатков21

	// Очистим остатки партионных регистров версии 2.1, которые больше не используются в партионном учете версии 2.2.
	Для Каждого КлючИЗначение Из НеиспользуемыеДанныеМеханизмаВерсии21() Цикл
		МетаРегистр = КлючИЗначение.Ключ; // ОбъектМетаданныхРегистрНакопления - 
		Запрос.Текст = ТекстЗапросаОчисткаОстатковРегистраПУВерсии21(КлючИЗначение);
		ОчиститьОстаткиРегистраПУВерсии21(ПараметрыРасчета, Запрос, МетаРегистр.Имя);
	КонецЦикла;
	
	
#КонецОбласти

#Область ОчисткаДвижений21

	// Очистим движения партионных регистров версии 2.1, которые больше не используются в партионном учете версии 2.2.
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор
	|ИЗ
	|	РегистрНакопления.%1 КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И ((&НачалоПериода = &ДатаПереходаНаПартионныйУчетВерсии22
	|		И НЕ Т.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров)
	|	  ИЛИ (&НачалоПериода > &ДатаПереходаНаПартионныйУчетВерсии22))";
	
	Для Каждого КлючИЗначение Из НеиспользуемыеДанныеМеханизмаВерсии21() Цикл
		
		МетаРегистр = КлючИЗначение.Ключ; // ОбъектМетаданныхРегистрНакопления - 
		ИмяРегистра = МетаРегистр.Имя;
		
		Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаЗапроса, ИмяРегистра);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 0 Тогда
			
			// Очистим движения
			ЗаписатьДвиженияПоРегистру(
				ПараметрыРасчета,
				Выборка,
				РегистрыНакопления[ИмяРегистра]);
			
			РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(
				ПараметрыРасчета,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Очищено устаревших движений по регистру %1: %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					ИмяРегистра,
					РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(Выборка.Количество())));
			
		КонецЕсли;
		
	КонецЦикла;
	
#КонецОбласти

КонецПроцедуры

// Формирует текст запроса получения остатков регистра,
// которые необходимо закрыть при переходе на партионный учет версии 2.2
//
Функция ТекстЗапросаОчисткаОстатковРегистраПУВерсии21(ОписаниеРегистра, ТекстОтборОстатков = "ИСТИНА")
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	ДокументыВводаОстатков.Ссылка КАК Регистратор,
	|	%2,
	|	%5
	|ПОМЕСТИТЬ ВТОстаткиПартий
	|ИЗ
	|	РегистрНакопления.%1.Остатки(&ГраницаКонецПредыдущегоПериода, Организация В (&МассивОрганизаций) И %7) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыВводаОстатков
	|		ПО Т.Организация = ДокументыВводаОстатков.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор
	|ПОМЕСТИТЬ ВТИзменившиесяДокументы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Регистратор КАК Регистратор,
	|		%2,
	|		%3
	|	ИЗ
	|		ВТОстаткиПартий КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Регистратор,
	|		%2,
	|		%4
	|	ИЗ
	|		РегистрНакопления.%1 КАК Т
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыВводаОстатков
	|			ПО Т.Регистратор = ДокументыВводаОстатков.Ссылка
	|	ГДЕ
	|		ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИП(Документ.РасчетСебестоимостиТоваров)) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	%2
	|
	|ИМЕЮЩИЕ
	|	%6
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоПериода КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	%2,
	|	%3
	|ИЗ
	|	ВТОстаткиПартий КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИзменившиесяДокументы КАК ВТИзменившиесяДокументы
	|		ПО Т.Регистратор = ВТИзменившиесяДокументы.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Регистратор,
	|	%2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИзменившиесяДокументы.Регистратор КАК Регистратор
	|ИЗ
	|	ВТИзменившиесяДокументы КАК ВТИзменившиесяДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиПартий КАК ОстаткиПартий
	|		ПО ОстаткиПартий.Регистратор = ВТИзменившиесяДокументы.Регистратор
	|
	|ГДЕ
	|	ОстаткиПартий.Регистратор ЕСТЬ NULL
	|	И НЕ ВТИзменившиесяДокументы.Регистратор ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТИзменившиесяДокументы.Регистратор
	|";
	
	// Сформируем текст запроса для выборки остатков
	МетаданныеРегистра = ОписаниеРегистра.Ключ; // ОбъектМетаданныхРегистрНакопления - 
	ИмяРегистра = МетаданныеРегистра.Имя; // %1
	
	ТекстИзмеренияРегистра = "";
	ТекстРесурсыРегистра = "";
	ТекстРесурсыРегистраСМинусом = "";
	ТекстОстаткиРесурсовРегистра = "";
	ТекстОтборРесурсыРегистра = "";
	
	Для Каждого ПолеРегистра Из МетаданныеРегистра.Измерения Цикл
		ТекстИзмеренияРегистра = ТекстИзмеренияРегистра + ?(ТекстИзмеренияРегистра = "", "", ",
			|	") + "Т." + ПолеРегистра.Имя;
	КонецЦикла;
	
	Для Каждого ПолеРегистра Из МетаданныеРегистра.Ресурсы Цикл
		ТекстРесурсыРегистра = ТекстРесурсыРегистра + ?(ТекстРесурсыРегистра = "", "", ",
			|	") + "Т." + ПолеРегистра.Имя;
		ТекстРесурсыРегистраСМинусом = ТекстРесурсыРегистраСМинусом + ?(ТекстРесурсыРегистраСМинусом = "", "", ",
			|	") + "-Т." + ПолеРегистра.Имя;
		ТекстОстаткиРесурсовРегистра = ТекстОстаткиРесурсовРегистра + ?(ТекстОстаткиРесурсовРегистра = "", "", ",
			|	") + "Т." + ПолеРегистра.Имя + "Остаток КАК " + ПолеРегистра.Имя;
		ТекстОтборРесурсыРегистра = ТекстОтборРесурсыРегистра + ?(ТекстОтборРесурсыРегистра = "", "", "
			|	ИЛИ ") + "СУММА(Т." + ПолеРегистра.Имя + ") <> 0";
	КонецЦикла;
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонТекстаЗапроса,
		ИмяРегистра, // 1
		ТекстИзмеренияРегистра, // 2
		ТекстРесурсыРегистра, // 3
		ТекстРесурсыРегистраСМинусом, // 4
		ТекстОстаткиРесурсовРегистра, // 5
		ТекстОтборРесурсыРегистра, // 6
		ТекстОтборОстатков); // 7
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Получает данные движений по очистке остатков и выполняет их запись
//
Процедура ОчиститьОстаткиРегистраПУВерсии21(ПараметрыРасчета, Запрос, ИмяРегистра)
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВГраница = РезультатЗапроса.ВГраница();
	ДвиженияПоРегистру		= РезультатЗапроса[ВГраница - 1];
	РегистраторыКОчистке	= РезультатЗапроса[ВГраница];
	
	Если НЕ ДвиженияПоРегистру.Пустой() Тогда
		
		// Очистим остатки регистра
		Выборка = ДвиженияПоРегистру.Выбрать();
		
		ЗаписатьДвиженияПоРегистру(
			ПараметрыРасчета,
			Выборка,
			РегистрыНакопления[ИмяРегистра]);
		
		РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(
			ПараметрыРасчета,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сформировано движений сторнирования остатков по регистру %1: %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				ИмяРегистра,
				РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(Выборка.Количество())));
		
	ИначеЕсли Не РегистраторыКОчистке.Пустой() Тогда
		
		// Очистим остатки регистра
		Выборка = РегистраторыКОчистке.Выбрать();
		
		ЗаписатьДвиженияПоРегистру(
			ПараметрыРасчета,
			Выборка,
			РегистрыНакопления[ИмяРегистра]);
		
		РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(
			ПараметрыРасчета,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Очищено движений сторнирования остатков по регистру %1: %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				ИмяРегистра,
				РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(Выборка.Количество())));
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТОстаткиПартий, ВТИзменившиесяДокументы");
	
КонецПроцедуры

// Выполняет проверку возможности понижения версии партионного учета с 2.2 до 2.1.
//
// Параметры:
//	ЕстьДвиженияПУ22 - Булево - признак наличия в ИБ движений, сформированных партионным учетом версии 2.2
//
// Возвращаемое значение:
//	Строка - Текст предупреждения.
//
Функция ПартионныйУчетВерсии22НельзяПонизитьДоВерсии21(ЕстьДвиженияПУ22) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЕстьДвиженияПУ22", ЕстьДвиженияПУ22);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК КодПричины
	|ГДЕ
	|	&ЕстьДвиженияПУ22 = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3 КАК КодПричины
	|ИЗ
	|	(ВЫБРАТЬ
	|		0 КАК ЧислоЗаписей
	|
	|	 ОБЪЕДИНИТЬ ВСЕ
	|
	|	 ВЫБРАТЬ ПЕРВЫЕ 1
	|		1 КАК ЧислоЗаписей
	|	 ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Т
	|	) КАК Т
	|ИМЕЮЩИЕ
	|	СУММА(Т.ЧислоЗаписей) = 0
	|
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодПричины
	|";
	
	ТекстПредупреждения = "";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КодПричины = 1 Тогда
			ТекстПредупреждения = ТекстПредупреждения + "
				|    - " + НСтр("ru = 'есть движения по себестоимости товаров, сформированные партионным учетом версии 2.2'", ОбщегоНазначения.КодОсновногоЯзыка());
		ИначеЕсли Выборка.КодПричины = 3 Тогда
			ТекстПредупреждения = ТекстПредупреждения + "
				|    - " + НСтр("ru = 'в данной информационной базе партионный учет версии 2.1 не использовался'", ОбщегоНазначения.КодОсновногоЯзыка());
		Иначе
			ВызватьИсключение НСтр("ru = 'Неизвестный код ошибки.'", ОбщегоНазначения.КодОсновногоЯзыка());
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		ТекстПредупреждения = НСтр("ru = 'Невозможен возврат к партионному учету версии 2.1:'", ОбщегоНазначения.КодОсновногоЯзыка())
			+ ТекстПредупреждения;;
	КонецЕсли;
	
	Возврат ТекстПредупреждения;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа_ЗаполнениеПартийВРегистреСебестоимостьТоваров

Функция ТекстЗапросаДляПартийТоваров() Экспорт
	
	ТекстЗапроса = ""
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстРеализацииПрошлыхМесяцев_ПУ21() // использует ПрошлыеРеализации
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстНачальныеОстаткиДляКорректировкиПриобретения_ПУ21() 
		+ "";
	Возврат ТекстЗапроса;	
	
КонецФункции

Функция ТекстРеализацииПрошлыхМесяцев_ПУ21() // использует ПрошлыеРеализации 
	Возврат 
		"ВЫБРАТЬ
		|	""ТекстРеализацииПрошлыхМесяцев_ПУ21"" 	  		 КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Прошлое) КАК ТипЗаписи,
		|	ЛОЖЬ											 КАК ЭтоТочноРасчетноеДвижение,
		|	ЛОЖЬ											 КАК ЭтоСторно,
		|	0 										  		 КАК Приоритет,
		|	0								  				 КАК Знаменатель,
		|	ИСТИНА 											 КАК РасчетЗавершен,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура 		 КАК Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС 		 КАК НалогообложениеПартии,
		|
		|	ДД.Период,
		|	ДД.Период КАК ПериодПоступления,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	(ВЫБОР
		|		КОГДА ДД.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
		|			ТОГДА Прошлые.ВидЗапасов
		|		ИНАЧЕ ДД.ВидЗапасов КОНЕЦ) КАК ВидЗапасов,
		|	ДД.Организация,
		|	Партии.ДокументПоступления КАК Партия,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
		|	Партии.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
		|	(ВЫБОР
		|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС
		|		ИНАЧЕ Партии.НалогообложениеНДС КОНЕЦ) КАК ВидДеятельностиНДС,
		|
		|	СУММА(Партии.Количество) КАК Количество,
		|	0 КАК Стоимость,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьЗабалансовая,
		|	0 КАК СтоимостьУпр,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК ПостатейныеПеременныеСНДС,
		|	0 КАК ПостатейныеПеременныеБезНДС,
		|	0 КАК ТрудозатратыУпр,
		|	0 КАК ПостатейныеПостоянныеУпр,
		|	0 КАК ПостатейныеПеременныеУпр,
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК Трудозатраты,
		|	0 КАК ПостатейныеПостоянныеСНДС,
		|	0 КАК ПостатейныеПостоянныеБезНДС,
		|	0 КАК СтоимостьРегл,
		|	0 КАК СтоимостьЗабалансоваяРегл,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	0 КАК СтоимостьНДД,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ТрудозатратыРегл,
		|	0 КАК ПостатейныеПостоянныеРегл,
		|	0 КАК ПостатейныеПеременныеРегл,
		|	0 КАК РезервПодОбесценениеРегл,
		|	0 КАК РезервПодОбесценениеУпр,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) 				КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО															КАК ПриоритетнаяХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) 		КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) 	КАК КорРазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) 							КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) 							КАК КорОрганизация,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,2)) 											КАК КорСтоимость,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) 		КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО 															КАК ЗаказКлиента,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) 					КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО 															КАК АналитикаРасходов,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) 			КАК СтатьяРасходовСписания,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) 			КАК СтатьяДоходов,
		|	НЕОПРЕДЕЛЕНО 															КАК АналитикаДоходов,
		|	ДАТАВРЕМЯ(1, 1, 1) 														КАК ПериодПродажи,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) 	КАК СтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО 															КАК АналитикаАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО 															КАК ДокументДвижения,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) 											КАК ИдентификаторСтроки,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
		|	НЕОПРЕДЕЛЕНО 															КАК КорПартия,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) 			КАК КорАналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО 															КАК КорАналитикаФинансовогоУчета,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) 				КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) 				КАК ВидДеятельностиНДСДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) 				КАК ВидДеятельностиНДСОтгрузки,
		|	НЕОПРЕДЕЛЕНО 															КАК АналитикаФинансовогоУчетаДокумента,
		|	НЕОПРЕДЕЛЕНО 															КАК ОперацияУчетаСебестоимости,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,2)) 											КАК НДСУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,2)) 											КАК НДСРегл,
		|	НЕОПРЕДЕЛЕНО															КАК СтатьяКалькуляции,
		|	Прошлые.ДокументИсточник												КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО															КАК ПриоритетныйИсточник,
		|	НЕОПРЕДЕЛЕНО															КАК КорНаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО															КАК КодСтроки,
		|	НЕОПРЕДЕЛЕНО															КАК НомерГТД,
		|	ДД.НастройкаХозяйственнойОперации										КАК НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи												КАК ИдентификаторФинЗаписи,
		|	ДД.НастройкаСчетовУчета													КАК НастройкаСчетовУчета,
		|	ДД.Сторно																КАК Сторно,
		|	ДД.ВыполненРасчетПартий													КАК ВыполненРасчетПартий,
		|	НЕОПРЕДЕЛЕНО															КАК РежимЗакрытияМесяца,
		|	НЕОПРЕДЕЛЕНО															КАК СпособОпределенияСебестоимости,
		|	ДАТАВРЕМЯ(1,1,1)														КАК ДатаОпределенияСебестоимости
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеРеализации КАК Прошлые
		|		ПО ДД.Регистратор = Прошлые.ДокументРеализации
		|		И ДД.АналитикаУчетаНоменклатуры = Прошлые.АналитикаУчетаНоменклатуры
		|		И (ДД.ВидЗапасов = Прошлые.ВидЗапасов
		|			ИЛИ ДД.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
		|		ПО Партии.Регистратор = ДД.Регистратор
		|		И Партии.Период = ДД.Период
		|		И Партии.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И (Партии.ВидЗапасов = ДД.ВидЗапасов
		|			ИЛИ ДД.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
		|		ПО АналитикаПартий.Ссылка = Партии.АналитикаУчетаПартий
		|ГДЕ
		|	ДД.Организация В (&МассивОрганизаций)
		|	И ДД.Активность
		|	И НЕ ДД.РасчетСебестоимости
		|	И ДД.Организация В (&ОрганизацииСФИФОСкользящая)
		|	И НЕ ДД.Сторно
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	(ВЫБОР
		|		КОГДА ДД.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
		|			ТОГДА Прошлые.ВидЗапасов
		|		ИНАЧЕ ДД.ВидЗапасов КОНЕЦ),
		|	ДД.Организация,
		|	Партии.ДокументПоступления,
		|	Партии.АналитикаУчетаПартий,
		|	(ВЫБОР
		|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС
		|		ИНАЧЕ Партии.НалогообложениеНДС КОНЕЦ),
		|	Прошлые.ДокументИсточник,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаСчетовУчета,
		|	ДД.Сторно,
		|	ДД.ВыполненРасчетПартий
		|";
КонецФункции

Функция ТекстНачальныеОстаткиДляКорректировкиПриобретения_ПУ21()
	Возврат 
		"ВЫБРАТЬ
		|	""ТекстНачальныеОстаткиДляКорректировкиПриобретения"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Прошлое) 	  КАК ТипЗаписи,
		|	ЛОЖЬ												  КАК ЭтоТочноРасчетноеДвижение,
		|	ЛОЖЬ												  КАК ЭтоСторно,
		|	0 										  			  КАК Приоритет,
		|	0								  					  КАК Знаменатель,
		|	ИСТИНА 												  КАК РасчетЗавершен,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура 			  КАК Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС 			  КАК НалогообложениеПартии,
		|
		|	&КонецПредыдущегоПериода 	 						  КАК Период,
		|	&КонецПредыдущегоПериода 	 						  КАК ПериодПоступления,
		|	ДД.Регистратор			 	 						  КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО 			 	 						  КАК ВидДвижения,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	(ВЫБОР
		|		КОГДА РасчетСебестоимостиТоваров.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка)
		|			ТОГДА Партии.ДокументПоступления
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК Партия,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
		|	(ВЫБОР
		|		КОГДА РасчетСебестоимостиТоваров.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка)
		|			ТОГДА Партии.АналитикаУчетаПартий
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ВЫБОР
		|		КОГДА Партии.ВидЗапасов ЕСТЬ NULL 
		|			ТОГДА ДД.АналитикаФинансовогоУчета
		|		КОГДА Партии.ВидЗапасов.ГруппаПродукции ЕСТЬ NULL 
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА Партии.ВидЗапасов.ГруппаПродукции <> ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА Партии.ВидЗапасов.ГруппаПродукции
		|		КОГДА Партии.ВидЗапасов.УстарелоПредназначение = ЗНАЧЕНИЕ(Перечисление.ТипыПредназначенияВидовЗапасов.ПредназначенДляСделки)
		|			ТОГДА Партии.ВидЗапасов.УстарелоСделка
		|		КОГДА Партии.ВидЗапасов.УстарелоПредназначение = ЗНАЧЕНИЕ(Перечисление.ТипыПредназначенияВидовЗапасов.ПредназначенДляПодразделения)
		|			ТОГДА Партии.ВидЗапасов.УстарелоПодразделение
		|		КОГДА Партии.ВидЗапасов.УстарелоПредназначение = ЗНАЧЕНИЕ(Перечисление.ТипыПредназначенияВидовЗапасов.ПредназначенДляМенеджера)
		|			ТОГДА Партии.ВидЗапасов.УстарелоМенеджер
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АналитикаФинансовогоУчета,
		|	ВЫБОР
		|		КОГДА Партии.НалогообложениеНДС ЕСТЬ NULL
		|			ТОГДА ДД.ВидДеятельностиНДС
		|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС
		|		ИНАЧЕ Партии.НалогообложениеНДС
		|	КОНЕЦ КАК ВидДеятельностиНДС,
		|
		|	ДД.Количество КАК Количество,
		|	0 КАК Стоимость,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьЗабалансовая,
		|	0 КАК СтоимостьУпр,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК ПостатейныеПеременныеСНДС,
		|	0 КАК ПостатейныеПеременныеБезНДС,
		|	0 КАК ТрудозатратыУпр,
		|	0 КАК ПостатейныеПостоянныеУпр,
		|	0 КАК ПостатейныеПеременныеУпр,
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК Трудозатраты,
		|	0 КАК ПостатейныеПостоянныеСНДС,
		|	0 КАК ПостатейныеПостоянныеБезНДС,
		|	0 КАК СтоимостьРегл,
		|	0 КАК СтоимостьЗабалансоваяРегл,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	0 КАК СтоимостьНДД,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ТрудозатратыРегл,
		|	0 КАК ПостатейныеПостоянныеРегл,
		|	0 КАК ПостатейныеПеременныеРегл,
		|	0 КАК РезервПодОбесценениеРегл,
		|	0 КАК РезервПодОбесценениеУпр,
		|
		|	ДД.ХозяйственнаяОперация 												КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО															КАК ПриоритетнаяХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) 		КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) 	КАК КорРазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) 							КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) 							КАК КорОрганизация,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,2)) 											КАК КорСтоимость,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) 		КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО 															КАК ЗаказКлиента,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) 					КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО 															КАК АналитикаРасходов,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) 			КАК СтатьяРасходовСписания,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) 			КАК СтатьяДоходов,
		|	НЕОПРЕДЕЛЕНО 															КАК АналитикаДоходов,
		|	ДАТАВРЕМЯ(1, 1, 1) 														КАК ПериодПродажи,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) 	КАК СтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО 															КАК АналитикаАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО 															КАК ДокументДвижения,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) 											КАК ИдентификаторСтроки,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
		|	НЕОПРЕДЕЛЕНО 															КАК КорПартия,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) 			КАК КорАналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО 															КАК КорАналитикаФинансовогоУчета,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) 				КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) 				КАК ВидДеятельностиНДСДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) 				КАК ВидДеятельностиНДСОтгрузки,
		|	НЕОПРЕДЕЛЕНО 															КАК АналитикаФинансовогоУчетаДокумента,
		|	НЕОПРЕДЕЛЕНО 															КАК ОперацияУчетаСебестоимости,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,2)) 											КАК НДСУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,2)) 											КАК НДСРегл,
		|	НЕОПРЕДЕЛЕНО															КАК СтатьяКалькуляции,
		|	НЕОПРЕДЕЛЕНО 															КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО															КАК ПриоритетныйИсточник,
		|	НЕОПРЕДЕЛЕНО															КАК КорНаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО															КАК КодСтроки,
		|	НЕОПРЕДЕЛЕНО															КАК НомерГТД,
		|	ДД.НастройкаХозяйственнойОперации										КАК НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи												КАК ИдентификаторФинЗаписи,
		|	ДД.НастройкаСчетовУчета													КАК НастройкаСчетовУчета,
		|	ДД.Сторно																КАК Сторно,
		|	ДД.ВыполненРасчетПартий													КАК ВыполненРасчетПартий,
		|	НЕОПРЕДЕЛЕНО															КАК РежимЗакрытияМесяца,
		|	НЕОПРЕДЕЛЕНО															КАК СпособОпределенияСебестоимости,
		|	ДАТАВРЕМЯ(1,1,1)														КАК ДатаОпределенияСебестоимости
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоступления КАК Поступление
		|		ПО Поступление.Ссылка = ДД.Регистратор
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
		|		ПО Партии.Регистратор = ДД.Регистратор
		|		И Партии.Период = ДД.Период
		|		И Партии.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И (Партии.ВидЗапасов = ДД.ВидЗапасов
		|			ИЛИ ДД.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетСебестоимостиТоваров КАК РасчетСебестоимостиТоваров
		|		ПО НАЧАЛОПЕРИОДА(РасчетСебестоимостиТоваров.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДД.Период, МЕСЯЦ)
		|		И РасчетСебестоимостиТоваров.Организация = ДД.Организация
		|		И НЕ РасчетСебестоимостиТоваров.ПредварительныйРасчет
		|		И РасчетСебестоимостиТоваров.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
		|ГДЕ
		|	ДД.Количество <> 0
		|";
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа10_РаспределениеДопРасходовМеждуПартиямиИТоварами

Функция ТекстТаможенныеДекларацииИПоступления() Экспорт // вт Декларации, КоличествоДеклараций
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Партия КАК Ссылка,
		|	Партии.ДокументПоступления КАК Поступление
		|ПОМЕСТИТЬ
		|	Декларации
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Остатки(&НачалоПериода, Организация В (&МассивОрганизаций)) КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
		|		ПО Партии.Регистратор = ДД.Партия
		|ГДЕ
		|	ДД.Партия ССЫЛКА Документ.ТаможеннаяДекларацияИмпорт
		|	И Партии.Период < &ДатаПереходаНаПартионныйУчетВерсии22
		|	И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|ИНДЕКСИРОВАТЬ ПО
		|	Поступление
		|;
		|ВЫБРАТЬ
		|	ДД.Поступление,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДД.Ссылка) КАК Количество
		|ПОМЕСТИТЬ
		|	КоличествоДеклараций
		|ИЗ
		|	Декларации КАК ДД
		|СГРУППИРОВАТЬ ПО
		|	ДД.Поступление
		|ИНДЕКСИРОВАТЬ ПО
		|	Поступление
		|";
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#Область РасчетСебестоимости_ФИФОСкользящаяОценкаВерсии21

Процедура РасчетСебестоимости_ФИФОСкользящаяОценкаВерсии21(ПараметрыРасчета) Экспорт
	
	// Этап 2.1
	// Формирует движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	// - ПрочиеАктивыПассивы
	СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая(ПараметрыРасчета);
	
	// Этап 2.2
	// Формирует движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - Закупки
	СкорректироватьСтоимостьПродажПоФИФОСкользящая(ПараметрыРасчета);
	
	
	// Этап 2.5
	// Формирует движения по регистрам:
	// - СтоимостьТоваров
	ЗарегистрироватьСтоимостьФИФО(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ФО.ФормироватьФинансовыйРезультат Тогда
		// Этап 4.1
		// Формирует движения по регистрам:
		// - ФинансовыеРезультаты
		РасчетСебестоимостиКорректировкаСтоимости.РаспределитьВыручкуПоНаправлениямДеятельности(ПараметрыРасчета);
	КонецЕсли;
	
	// Этап 4.3
	// Формирует движения по регистрам:
	// - ПрочиеАктивыПассивы
	РасчетСебестоимостиКорректировкаСтоимости.ОтразитьПрибылиИУбытки(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ФО.ФормироватьУправленческийБаланс Тогда
		// Этап 4.4
		// Формирует движения управленческого баланса
		РасчетСебестоимостиКорректировкаСтоимости.ОтразитьВУправленческомБалансе(ПараметрыРасчета);
	КонецЕсли;
	
КонецПроцедуры

// Этап 2.1
Процедура СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая(ПараметрыРасчета)

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента)
	|		ТОГДА (ВЫБОР
	|			КОГДА УчетСебестоимости.Количество < 0 ИЛИ УчетСебестоимости.ХозяйственнаяОперация В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад))
	|			ТОГДА 2
	|			ИНАЧЕ 3 КОНЕЦ)
	|		ИНАЧЕ 2 КОНЕЦ КАК Порядок,
	|	УчетСебестоимости.Период						КАК Период,
	|	УчетСебестоимости.Регистратор					КАК Регистратор,
	|	УчетСебестоимости.Организация					КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов					КАК ВидЗапасов,
	|	ВЫБОР КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		 И Аналитика.Номенклатура.ПрослеживаемыйТовар
	|			ТОГДА ЕСТЬNULL(УчетСебестоимости.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Работа))
	|		КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ КАК ТипЗапасов,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу))
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой))
	|	 И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры

	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаУчетаПродукции,
	|	УчетСебестоимости.ПериодПродажи					КАК ПериодПродажи,
	|
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   						КАК ВидДвижения,
	|	УчетСебестоимости.РазделУчета					КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам		КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента					КАК ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация			КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры	КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета				КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов					КАК КорВидЗапасов,
	|	КорАналитикаНоменклатуры.МестоХранения			КАК КорСклад,
	|	УчетСебестоимости.КорОрганизация				КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение					КАК Подразделение,
	|	УчетСебестоимости.АналитикаРасходов				КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания		КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.АналитикаАктивовПассивов		КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.СтатьяАктивовПассивов			КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.СтатьяДоходов					КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов				КАК АналитикаДоходов,
	|	УчетСебестоимости.Регистратор					КАК ДокументДвижения,
	|	УчетСебестоимости.ИдентификаторСтроки			КАК ИдентификаторСтроки,
	|	УчетСебестоимости.ГруппаПродукции				КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.ВидЗапасов
	|	ИНАЧЕ
	|		Аналитика.Номенклатура
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.КорВидЗапасов
	|	ИНАЧЕ
	|		КорАналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ КАК КорИсточникГФУНоменклатуры,
	|	Аналитика.МестоХранения КАК Склад,
	|
	|	ВЫБОР КОГДА КорАналитикаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ КАК КорТипЗапасов,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийРеализации) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК Продажа,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|	ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПередачаМеждуОрганизациями,
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах И УчетСебестоимости.Количество < 0
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратОтКлиента,
	|
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Количество < 0 ТОГДА
	|		0 - УчетСебестоимости.Количество
	|	ИНАЧЕ
	|		УчетСебестоимости.Количество
	|	КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В
	|			(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад))
	|		ТОГДА
	|			- УчетСебестоимости.Количество
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			И УчетСебестоимости.Количество < 0
	|		ТОГДА
	|			- УчетСебестоимости.Количество
	|		ИНАЧЕ
	|			УчетСебестоимости.Количество
	|		КОНЕЦ) КАК ИсходноеКоличество,
	|	СУММА(УчетСебестоимости.КорСтоимость) КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.Стоимость) КАК ИсходнаяСтоимость,
	|	СУММА(УчетСебестоимости.СтоимостьРегл) КАК ИсходнаяСтоимостьРегл,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая) КАК ИсходнаяСтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл) КАК ИсходнаяСтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС) КАК ИсходнаяСтоимостьБезНДС
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|	ПО
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|	ПО
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = Аналитика.Назначение
	|	
	|ГДЕ
	|	(НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров))
	|		ИЛИ УчетСебестоимости.Количество <> 0 И УчетСебестоимости.ХозяйственнаяОперация В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|	)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента)
	|		ТОГДА (ВЫБОР
	|			КОГДА УчетСебестоимости.Количество < 0 ИЛИ УчетСебестоимости.ХозяйственнаяОперация В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад))
	|			ТОГДА 2
	|			ИНАЧЕ 3 КОНЕЦ)
	|		ИНАЧЕ 2 КОНЕЦ,
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу))
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой))
	|	 И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры

	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.ВидЗапасов,
	|	ВЫБОР КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		 И Аналитика.Номенклатура.ПрослеживаемыйТовар
	|			ТОГДА ЕСТЬNULL(УчетСебестоимости.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Работа))
	|		КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.Регистратор,
	|	ВЫБОР КОГДА КорАналитикаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийРеализации) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.ВидЗапасов
	|	ИНАЧЕ
	|		Аналитика.Номенклатура
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.КорВидЗапасов
	|	ИНАЧЕ
	|		КорАналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ,
	|	Аналитика.МестоХранения,
	|	КорАналитикаНоменклатуры.МестоХранения,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах И УчетСебестоимости.Количество < 0
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.ТипЗапасов КАК ТипЗапасов,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ПериодПродажи,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КорСклад,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписания,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовУпр,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовРегл,
	|	НЕОПРЕДЕЛЕНО КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяДоходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|
	|	НЕОПРЕДЕЛЕНО КАК КорТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Продажа,
	|	НЕОПРЕДЕЛЕНО КАК ЭтоПередачаМеждуОрганизациями,
	|	ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратОтКлиента,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.Стоимость КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА Партии.Стоимость
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансовая,
	|	СУММА(Партии.ДопРасходы) КАК ДопРасходы,
	|	СУММА(Партии.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.СтоимостьРегл КОНЕЦ) КАК СтоимостьРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА Партии.СтоимостьРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента ТОГДА
	|		0
	|	ИНАЧЕ
	|		Партии.НДСРегл
	|	КОНЕЦ) КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	СУММА(Партии.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Партии.ВременнаяРазница) КАК ВременнаяРазница,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость,
	|	0 КАК ИсходнаяСтоимость,
	|	0 КАК ИсходнаяСтоимостьРегл,
	|	0 КАК ИсходнаяСтоимостьЗабалансовая,
	|	0 КАК ИсходнаяСтоимостьЗабалансоваяРегл,
	|	0 КАК ИсходнаяСтоимостьБезНДС
	|ИЗ
	|	ВтПартии КАК Партии
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.ТипЗапасов,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ПериодПродажи,
	|	ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	ТипЗапасов,
	|	АналитикаУчетаПродукции,
	|	ПериодПродажи УБЫВ,
	|	Подразделение,
	|	СтатьяРасходовСписания,
	|	АналитикаРасходов,
	|	КорВидЗапасов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, ВидДвижения, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Склад,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, АналитикаУчетаПоПартнерам, ЭтоПередачаМеждуОрганизациями,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорТипЗапасов,КорОрганизация,
	|АналитикаУчетаНоменклатурыВО,АналитикаФинансовогоУчетаВО,АналитикаАктивовПассивов, КорСклад,
	|СтатьяАктивовПассивов, Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|ВариантРаспределенияРасходовУпр, ВариантРаспределенияРасходовРегл,
	|ДокументДвижения, ИдентификаторСтроки, КодСтроки, ПринятиеКНалоговомуУчету, ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры,
	|ПериодПродажи, ГруппаПродукции, СписаниеПриПередачеНУ, НаправлениеДеятельности, КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Количество, КорСтоимость, ПостояннаяРазница, ВременнаяРазница,
	|ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ИдентификаторФинЗаписи");
	
	СуммыРаспределения = Новый Структура("Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов, АналитикаУчетаПродукции, ПериодПродажи,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СуммыВозврата = Новый Структура("Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов, АналитикаУчетаПродукции, ПериодПродажи,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	// Сформируем ВТПартии
	ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета);
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			Если Выборка.ЭтоВозвратОтКлиента Тогда
				Если СуммыВозврата.Регистратор = Выборка.Регистратор
				 И СуммыВозврата.Организация = Выборка.Организация
				 И СуммыВозврата.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
				 И СуммыВозврата.ВидЗапасов = Выборка.ВидЗапасов
				 И СуммыВозврата.ТипЗапасов = Выборка.ТипЗапасов
				 И СуммыВозврата.ПериодПродажи = Выборка.ПериодПродажи
				 И СуммыВозврата.АналитикаУчетаПродукции = Выборка.АналитикаУчетаПродукции Тогда
					СуммыВозврата.Количество = СуммыВозврата.Количество + Выборка.Количество;
					РасчетСебестоимостиКорректировкаСтоимости.ДополнитьСуммыРаспределения(СуммыВозврата, Выборка);
				Иначе
					ЗаполнитьЗначенияСвойств(СуммыВозврата, Выборка);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И (СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад
				И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.КорАналитикаУчетаНоменклатуры)
			И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
			И СтрокаОстатка.ТипЗапасов = Выборка.ТипЗапасов
			И СтрокаОстатка.АналитикаУчетаПродукции = Выборка.АналитикаУчетаПродукции
			И (СтрокаОстатка.ПериодПродажи = Выборка.ПериодПродажи
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя) Тогда
			
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			Если Выборка.Порядок = 2 И СтрокаОстатка.Количество > 0 Тогда
				РасчетСебестоимостиКорректировкаСтоимости.РаспределитьСтоимость(СуммыРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);	
			ИначеЕсли Выборка.Порядок = 3 Тогда
				РасчетСебестоимостиКорректировкаСтоимости.РаспределитьСтоимость(СуммыРаспределения, СуммыВозврата, Выборка, Выборка.Количество);
			КонецЕсли;
			
			Если НЕ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции
			 И Выборка.ВидДвижения = ВидДвиженияНакопления.Приход) Тогда
				РасчетСебестоимостиКорректировкаСтоимости.ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения);
			КонецЕсли;
			
					
			// Корректировка списания товаров
			Если Выборка.ИсходнаяСтоимость <> 0 Тогда
				ЗаписьРаспределения.Стоимость = ЗаписьРаспределения.Стоимость - Выборка.ИсходнаяСтоимость;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьРегл <> 0 Тогда
				ЗаписьРаспределения.СтоимостьРегл = ЗаписьРаспределения.СтоимостьРегл - Выборка.ИсходнаяСтоимостьРегл;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьЗабалансовая <> 0 Тогда
				ЗаписьРаспределения.СтоимостьЗабалансовая = ЗаписьРаспределения.СтоимостьЗабалансовая - Выборка.ИсходнаяСтоимостьЗабалансовая;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьЗабалансоваяРегл <> 0 Тогда
				ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = ЗаписьРаспределения.СтоимостьЗабалансоваяРегл - Выборка.ИсходнаяСтоимостьЗабалансоваяРегл;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьБезНДС <> 0 Тогда
				ЗаписьРаспределения.СтоимостьБезНДС = ЗаписьРаспределения.СтоимостьБезНДС - Выборка.ИсходнаяСтоимостьБезНДС;
			КонецЕсли;
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад Тогда
				
				ЗаписьРаспределения.Стоимость = - ЗаписьРаспределения.Стоимость;
				ЗаписьРаспределения.СтоимостьБезНДС = - ЗаписьРаспределения.СтоимостьБезНДС;
				ЗаписьРаспределения.СтоимостьЗабалансовая = - ЗаписьРаспределения.СтоимостьЗабалансовая;
				ЗаписьРаспределения.ДопРасходы = - ЗаписьРаспределения.ДопРасходы;
				ЗаписьРаспределения.ДопРасходыБезНДС = - ЗаписьРаспределения.ДопРасходыБезНДС;
				ЗаписьРаспределения.СтоимостьРегл = - ЗаписьРаспределения.СтоимостьРегл;
				ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = - ЗаписьРаспределения.СтоимостьЗабалансоваяРегл;
				ЗаписьРаспределения.ПостояннаяРазница = - ЗаписьРаспределения.ПостояннаяРазница;
				ЗаписьРаспределения.ВременнаяРазница = - ЗаписьРаспределения.ВременнаяРазница;
				
				СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения,	ВидДвиженияНакопления.Приход);
				
			Иначе
				
				СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения, Выборка.ВидДвижения);
				
			КонецЕсли;

			// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
			Если ЗначениеЗаполнено(ЗаписьРаспределения.КорРазделУчета)
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.СборкаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.РазборкаТоваров
			 И НЕ (ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") 
			 	И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию)
			 И ТипЗнч(Выборка.Регистратор) <> Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПересортицаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПорчаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПеремещениеТоваров Тогда
				
				СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения);
						
			КонецЕсли;
				
			// Корректировка списания товаров на затраты в регистре учет прочих расходов.
			Если (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании)
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				 
					ЭтоВыпускПродукции = Ложь;
					
					Если ЗначениеЗаполнено(ЗаписьРаспределения.СтатьяАктивовПассивов) Тогда
						РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеАктивыПассивы(
							ПараметрыРасчета,
							ЗаписьРаспределения,
							ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0));
					Иначе
						СуммовыеПоказатели = Новый Структура;
						СуммовыеПоказатели.Вставить("СуммаСНДС", ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы
							+ ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0));
						СуммовыеПоказатели.Вставить("СуммаБезНДС", ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.ДопРасходыБезНДС
							+ ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьБезНДС, 0));
						СуммовыеПоказатели.Вставить("СуммаРегл", ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл
							+ ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьРегл, 0));
						СуммовыеПоказатели.Вставить("СуммаУпр", 0);
						СуммовыеПоказатели.Вставить("ПостояннаяРазница", ЗаписьРаспределения.ПостояннаяРазница);
						СуммовыеПоказатели.Вставить("ВременнаяРазница", ЗаписьРаспределения.ВременнаяРазница);
						СуммовыеПоказатели.Вставить("СуммаНДД", 0);
						
						РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходы(
							ПараметрыРасчета,
							ЗаписьРаспределения,
							СуммовыеПоказатели);
					КонецЕсли;

			КонецЕсли;
					
			// Формирование прочих доходов\расходов при пересортице
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
			 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
			 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				 
			 СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы - Выборка.КорСтоимость;
				Если СуммаПереоценки > 0 Тогда
					
					СуммовыеПоказатели = Новый Структура;
					СуммовыеПоказатели.Вставить("СуммаСНДС", СуммаПереоценки);
					СуммовыеПоказатели.Вставить("СуммаБезНДС", ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.ДопРасходыБезНДС);
					СуммовыеПоказатели.Вставить("СуммаРегл", ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл);
					СуммовыеПоказатели.Вставить("СуммаУпр", 0);
					СуммовыеПоказатели.Вставить("ПостояннаяРазница", ЗаписьРаспределения.ПостояннаяРазница);
					СуммовыеПоказатели.Вставить("ВременнаяРазница", ЗаписьРаспределения.ВременнаяРазница); 
					СуммовыеПоказатели.Вставить("СуммаНДД", 0);

					РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммовыеПоказатели);

				ИначеЕсли СуммаПереоценки < 0 Тогда

					РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеДоходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						- СуммаПереоценки,
						- (ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл),
						0);

				КонецЕсли;

			КонецЕсли;
		
			// Формирование прочих расходов при порче
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
			
				СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы - Выборка.КорСтоимость;
				Если СуммаПереоценки <> 0 Тогда
					
					СуммовыеПоказатели = Новый Структура;
					СуммовыеПоказатели.Вставить("СуммаСНДС", СуммаПереоценки);
					СуммовыеПоказатели.Вставить("СуммаБезНДС", ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.ДопРасходыБезНДС);
					СуммовыеПоказатели.Вставить("СуммаРегл", ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл);
					СуммовыеПоказатели.Вставить("СуммаУпр", 0);
					СуммовыеПоказатели.Вставить("ПостояннаяРазница", ЗаписьРаспределения.ПостояннаяРазница);
					СуммовыеПоказатели.Вставить("ВременнаяРазница", ЗаписьРаспределения.ВременнаяРазница);
					СуммовыеПоказатели.Вставить("СуммаНДД", 0);
					
					РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммовыеПоказатели);
					
				КонецЕсли;

			КонецЕсли;

			// Формирование прочих доходов/расходов при возврате товаров поставщику.
			Если ((Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
				И ЗаписьРаспределения.КорСтоимость <> 0)
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары
				ИЛИ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
					И Выборка.КорСтоимость <> 0)
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТары)
				И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
				И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				
				СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.ДопРасходы;
				Если СуммаПереоценки > 0 ИЛИ ЗаписьРаспределения.СтоимостьРегл > 0 Тогда
					
					СуммовыеПоказатели = Новый Структура;
					СуммовыеПоказатели.Вставить("СуммаСНДС", СуммаПереоценки);
					СуммовыеПоказатели.Вставить("СуммаБезНДС", ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.ДопРасходыБезНДС);
					СуммовыеПоказатели.Вставить("СуммаРегл", ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл);
					СуммовыеПоказатели.Вставить("СуммаУпр", 0);
					СуммовыеПоказатели.Вставить("ПостояннаяРазница", ЗаписьРаспределения.ПостояннаяРазница);
					СуммовыеПоказатели.Вставить("ВременнаяРазница", ЗаписьРаспределения.ВременнаяРазница);
					СуммовыеПоказатели.Вставить("СуммаНДД", 0);

					РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммовыеПоказатели);

				ИначеЕсли СуммаПереоценки < 0 Тогда

					РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеДоходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						- СуммаПереоценки,
						- (ЗаписьРаспределения.СтоимостьРегл),
						0);

				КонецЕсли;
				
			КонецЕсли;
		
			// Корректировка движений по оборотным регистрам управленческого учета.
			РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, ЗаписьРаспределения);
			
		КонецЕсли;

	КонецЦикла;
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);
	
	// Формируются движения по регистрам:
	// - ДвиженияНоменклатураДоходыРасходы
	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТПартии");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 2.2
Процедура СкорректироватьСтоимостьПродажПоФИФОСкользящая(ПараметрыРасчета)

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПродажПоФИФОСкользящая");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|
	|	Продажи.РазделУчета                КАК РазделУчета,
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер         КАК Партнер,
	|	АналитикаПартнеров.Контрагент      КАК Контрагент,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	СУММА(
	|		ВЫБОР КОГДА Продажи.Количество < 0 ТОГДА
	|			0 - Продажи.Количество
	|		ИНАЧЕ
	|			Продажи.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	СУММА(Продажи.Количество)          КАК ИсходноеКоличество,
	|	0                                  КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|
	|ГДЕ
	|	Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И (Продажи.ХозяйственнаяОперация В (&МассивОперацийРеализации)
	|		ИЛИ Продажи.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов))
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер,
	|	АналитикаПартнеров.Контрагент,
	|	Продажи.Подразделение,
	|	Продажи.РазделУчета,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Продажи.Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	&НачалоПериода КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Регистратор КАК ДокументДвижения,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.ТипЗапасов КАК ТипЗапасов,
	|
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|
	|	Партии.Количество КАК Количество,
	|	Партии.Стоимость КАК Стоимость,
	|	Партии.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	Партии.ДопРасходы КАК ДопРасходы,
	|	Партии.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	Партии.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	Партии.НДСРегл КАК НДСРегл,
	|	Партии.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Партии.ВременнаяРазница КАК ВременнаяРазница,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	ТипЗапасов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, РазделУчета,
	|Подразделение, АналитикаУчетаПоПартнерам, Партнер, Контрагент,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры, 
	|НалогообложениеНДС, ДокументДвижения,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Количество,
	|ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");

	// Сформируем ВТПартии
	ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета, Истина);
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - Закупки
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
		 И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
		 И СтрокаОстатка.ТипЗапасов = Выборка.ТипЗапасов
		 И СтрокаОстатка.Количество > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			РасчетСебестоимостиКорректировкаСтоимости.РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			
			СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда	
				
				СформироватьДвиженияЗакупки(ПараметрыРасчета, ЗаписьРаспределения);
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТПартии");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);

КонецПроцедуры

// Служебная, этап 2.1, 3.3, 3.14
Процедура СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ДанныеДвижения, ВидДвижения)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	
	// Кор. стоимость не включается в список полей.
	КопируемыеПоля = "
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
	|ХозяйственнаяОперация,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов,КорОрганизация,
	|АналитикаУчетаПоПартнерам, ЗаказКлиента,
	|Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|СтатьяАктивовПассивов, АналитикаАктивовПассивов,
	|ИдентификаторСтроки, КодСтроки, ДокументДвижения, ПериодПродажи, ГруппаПродукции,
	|КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, ДопРасходы, ДопРасходыБезНДС,
	|ПостояннаяРазница, ВременнаяРазница, СтоимостьРегл, СтоимостьЗабалансоваяРегл";
	
	// Добавим движение и заполним его основные свойства
	Запись = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвижения;
	Запись.Количество  = 0;

КонецПроцедуры

// Служебная, этап 2.1, 3.1, 3.14
Процедура СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ДанныеДвижения, ПромежуточнаяСебестоимость = Ложь)
	
	Если ПромежуточнаяСебестоимость Тогда
		ТаблицаПриемник = "ВТПромежуточнаяСебестоимостьТоваров";
	Иначе
		ТаблицаПриемник = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	КонецЕсли;
	
	КопируемыеПоля = "
	|Период, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки,
	|Подразделение, ГруппаПродукции,
	|Стоимость, СтоимостьЗабалансовая, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, СтоимостьЗабалансоваяРегл, ПостояннаяРазница, ВременнаяРазница";

	// Добавим движение и заполним его основные свойства
	Запись = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ТаблицаПриемник, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения                = ВидДвиженияНакопления.Приход;
	Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
	Запись.РазделУчета                = ДанныеДвижения.КорРазделУчета;
	Запись.ВидЗапасов                 = ДанныеДвижения.КорВидЗапасов;
	Запись.Организация                = ?(ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация), ДанныеДвижения.КорОрганизация, ДанныеДвижения.Организация);
	Запись.Количество 				  = 0;
	Если Запись.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение Тогда
		Запись.КорВидЗапасов             = ДанныеДвижения.КорВидЗапасов;
	КонецЕсли;

	Если ДанныеДвижения.ЭтоПередачаМеждуОрганизациями Тогда
		
		Запись.СтоимостьРегл = 0;
		Запись.СтоимостьЗабалансоваяРегл = 0;
		Запись.ПостояннаяРазница = 0;
		Запись.ВременнаяРазница = 0;
		
	ИначеЕсли ДанныеДвижения.НДСРегл <> 0 ИЛИ ДанныеДвижения.НДСУпр <> 0 Тогда // это не передача
		
		КопируемыеПоля = " Период, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки, Подразделение, Организация";
		
		// Добавим движение и заполним его основные свойства
		Запись = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ТаблицаПриемник, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения 				  	 = ВидДвиженияНакопления.Приход;
		Запись.АналитикаУчетаНоменклатуры 	 = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
		Запись.РазделУчета 				  	 = ДанныеДвижения.КорРазделУчета;
		Запись.ВидЗапасов 				  	 = ДанныеДвижения.КорВидЗапасов;
		Запись.Организация                	 = ?(ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация), ДанныеДвижения.КорОрганизация, ДанныеДвижения.Организация);
		Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
			Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
			Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
			Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции Тогда
				Если ТипЗнч(ДанныеДвижения.АналитикаФинансовогоУчета) = Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры") Тогда
					Запись.КорАналитикаФинансовогоУчета = ДанныеДвижения.АналитикаФинансовогоУчета;
				Иначе
					Запись.КорАналитикаФинансовогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка();
				КонецЕсли;
				Запись.ГруппаПродукции = ДанныеДвижения.АналитикаФинансовогоУчета;
			КонецЕсли;
		КонецЕсли;
		
		Запись.СтоимостьРегл 			  	 = ДанныеДвижения.НДСРегл;
		Запись.СтоимостьУпр 			  	 = ДанныеДвижения.НДСУпр;
		
	КонецЕсли;

КонецПроцедуры

// Служебная, этап 2.2, 3.17, 3.18
Процедура СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ДанныеДвижения)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, АналитикаУчетаНоменклатуры, Менеджер, РазделУчета,
	|АналитикаУчетаПоПартнерам, ТипЗапасов, ВидЗапасов, ЗаказКлиента, ХозяйственнаяОперация,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов, НаправлениеДеятельностиНоменклатуры,
	|НаправлениеДеятельностиКонтрагента, 
	|НалогообложениеНДС, ДокументДвижения";
	
	// Добавим движение и заполним его основные свойства
	Запись = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	ПоляРесурсов = "
		|Стоимость, СтоимостьБезНДС, ПостояннаяРазница, ВременнаяРазница,
		|СтоимостьРегл, ДопРасходы, ДопРасходыБезНДС";
	
	ЗаполнитьЗначенияСвойств(Запись, ДанныеДвижения, ПоляРесурсов);
	
	Если ДанныеДвижения.НДСРегл <> 0 Тогда
		
		// Добавим движение и заполним его основные свойства
		Запись = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.СтоимостьРегл = ДанныеДвижения.НДСРегл;
		
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.2, 3.17
Процедура СформироватьДвиженияЗакупки(ПараметрыРасчета, ДанныеДвижения)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.Закупки.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, Менеджер, АналитикаУчетаНоменклатуры,
	|Склад, ТипЗапасов, ВидЗапасов, Партнер, Соглашение, Договор,
	|ВалютаДокумента, ВалютаВзаиморасчетов, ИсточникГФУНоменклатуры, ИсточникГФУРасчетов, ДокументДвижения,
	|Стоимость, СтоимостьБезНДС";
	
	// Добавим движение и заполним его основные свойства
	Запись = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	Запись.Стоимость = Запись.Стоимость + ДанныеДвижения.ДопРасходы;
	Запись.СтоимостьБезНДС = Запись.СтоимостьБезНДС + ДанныеДвижения.ДопРасходыБезНДС;
	
	// Заполним дополнительные свойства движения
	Запись.Организация 			 = ДанныеДвижения.Контрагент;
	Запись.Контрагент 			 = ДанныеДвижения.Организация;
	Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУДругойОрганизации;
	
КонецПроцедуры


// Служебная, этап 2.1, 2.2
// Формирует ВтПартии
//
Процедура ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета, ДляСтоимостиПродаж = Ложь)
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ДляСтоимостиПродаж", ДляСтоимостиПродаж);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Организация КАК Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	ВЫБОР КОГДА (НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|		И Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Корректировка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорВидЗапасов
	|	ИНАЧЕ
	|		Партии.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	ВЫБОР КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаНоменклатуры
	|	КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика)
	|		ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаНоменклатуры
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК КорАналитикаУчетаНоменклатуры,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.Количество
	|			ИНАЧЕ Партии.Количество
	|		КОНЕЦ
	|	)										КАК Количество,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.Стоимость
	|			ИНАЧЕ Партии.Стоимость
	|		КОНЕЦ
	|	)										КАК Стоимость,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.СтоимостьБезНДС
	|			ИНАЧЕ Партии.СтоимостьБезНДС
	|		КОНЕЦ
	|	)										КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.ПостояннаяРазница
	|			ИНАЧЕ Партии.ПостояннаяРазница
	|		КОНЕЦ
	|	)										КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.ВременнаяРазница
	|			ИНАЧЕ Партии.ВременнаяРазница
	|		КОНЕЦ
	|	)										КАК ВременнаяРазница,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА Партии.Количество < 0 
	|					ТОГДА 0 - Партии.СтоимостьРегл - Партии.НДСРегл 
	|					ИНАЧЕ Партии.СтоимостьРегл + Партии.НДСРегл 
	|				КОНЕЦ
	|			ИНАЧЕ
	|				ВЫБОР
	|					КОГДА Партии.Количество < 0 
	|					ТОГДА 0 - Партии.СтоимостьРегл 
	|					ИНАЧЕ Партии.СтоимостьРегл
	|				КОНЕЦ
	|		КОНЕЦ
	|	)										КАК СтоимостьРегл,
	|
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Количество < 0 ТОГДА
	|				0 - Партии.НДСРегл
	|			ИНАЧЕ
	|				Партии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Количество < 0 ТОГДА
	|				Партии.НДСРегл
	|			ИНАЧЕ
	|				- Партии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Партии.Количество < 0 ТОГДА -Партии.НДСРегл ИНАЧЕ Партии.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|	
	|	Партии.Номенклатура						КАК Номенклатура,
	|	Партии.Характеристика					КАК Характеристика,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|
	|ПОМЕСТИТЬ ТаблицаПартий
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотребление КАК Потребление
	|		ПО Потребление.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Передача.Ссылка = Партии.ДокументИсточник
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|		И Партии.Количество < 0
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		(Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И НЕ Партии.Регистратор Ссылка Документ.ВозвратТоваровМеждуОрганизациями
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|			)
	|		) ИЛИ Партии.Регистратор Ссылка Документ.ВозвратТоваровМеждуОрганизациями
	|		)
	|	И НЕ (Партии.Регистратор Ссылка Документ.ВозвратТоваровОтКлиента И Партии.Первичное)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	ВЫБОР КОГДА (НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|		И Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Корректировка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорВидЗапасов
	|	ИНАЧЕ
	|		Партии.ВидЗапасов
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	ВЫБОР КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаНоменклатуры 
	|	КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика)
	|		ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаНоменклатуры
	|	КОНЕЦ,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	Партии.Номенклатура,
	|	Партии.Характеристика,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска,
	|	Партии.Регистратор
	|ПОМЕСТИТЬ ЗатратыНаВыпуск
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода	
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|ИНДЕКСИРОВАТЬ ПО
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|
	|ПОМЕСТИТЬ СборкиТоваровВидыЗапасов
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров)
	|			)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	РегистрНакопления.ПартииПроизводственныхЗатрат КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация 						КАК Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	Партии.Регистратор 						КАК Регистратор,
	|	ВЫБОР
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL
	|			И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ Партии.АналитикаУчетаПродукции
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА (НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|			ТОГДА Партии.КорВидЗапасов
	|		КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|		 ИЛИ Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорВидЗапасов,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК КорАналитикаУчетаПродукции,
	|	0 КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.Стоимость
	|		ИНАЧЕ
	|			Партии.Стоимость
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.СтоимостьБезНДС
	|		ИНАЧЕ
	|			Партии.СтоимостьБезНДС
	|		КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.СтоимостьРегл - Партии.НДСРегл 
	|			ИНАЧЕ
	|				Партии.СтоимостьРегл + Партии.НДСРегл 
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.СтоимостьРегл 
	|			ИНАЧЕ
	|				Партии.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ
	|	)										КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.НДСРегл
	|			ИНАЧЕ
	|				Партии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				Партии.НДСРегл
	|			ИНАЧЕ
	|				- Партии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА -Партии.НДСРегл ИНАЧЕ Партии.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.ПостояннаяРазница
	|		ИНАЧЕ
	|			Партии.ПостояннаяРазница
	|		КОНЕЦ) КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.ВременнаяРазница
	|		ИНАЧЕ
	|			Партии.ВременнаяРазница
	|		КОНЕЦ) КАК ВременнаяРазница,
	|	ВЫБОР КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаПродукции 
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаПродукции
	|	КОНЕЦ КАК АналитикаУчетаПродукции,
	|	Партии.АналитикаУчетаПродукции КАК ИсходнаяАналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|ПОМЕСТИТЬ СборкиТоваровПартии
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотребление КАК Потребление
	|		ПО Потребление.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Передача.Ссылка = Партии.ДокументИсточник
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|		И Партии.Знаменатель < 0
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И НЕ (Партии.Регистратор ССЫЛКА Документ.КорректировкаНазначенияТоваров И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И НЕ (Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И НЕ (Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И НЕ (Партии.Регистратор ССЫЛКА Документ.КорректировкаВидаДеятельностиНДС И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))

	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	Партии.Регистратор,
	|	ВЫБОР
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL
	|			И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ Партии.АналитикаУчетаПродукции
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|			ТОГДА Партии.КорВидЗапасов
	|		КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|		 ИЛИ Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаПродукции 
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаПродукции
	|	КОНЕЦ,
	|	Партии.АналитикаУчетаПродукции,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	Партии.ДокументВыпуска,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Партии.КорВидЗапасов <> НЕОПРЕДЕЛЕНО ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ТаблицаПартий.ВидЗапасов КОНЕЦ) КАК ВидЗапасов,
	|	Партии.Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ПериодПродажи,
	|	Партии.Количество,
	|	Партии.Стоимость,
	|	Партии.СтоимостьБезНДС,
	|	Партии.СтоимостьРегл,
	|	Партии.НДСРегл,
	|	Партии.СписаниеНДС,
	|	Партии.ПостояннаяРазница,
	|	Партии.ВременнаяРазница,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.КорАналитикаУчетаПродукции,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|ПОМЕСТИТЬ СборкиТоваров
	|ИЗ
	|	СборкиТоваровПартии КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ СборкиТоваровВидыЗапасов КАК ТаблицаПартий
	|		ПО ТаблицаПартий.Организация = Партии.Организация
	|		И ТаблицаПартий.АналитикаУчетаНоменклатуры = Партии.ИсходнаяАналитикаУчетаПродукции
	|		И ТаблицаПартий.ДокументПоступления = Партии.ДокументВыпуска
	|		И ТаблицаПартий.Регистратор = Партии.Регистратор
	|		И Партии.КорВидЗапасов = НЕОПРЕДЕЛЕНО
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Ссылка,
	|	Партии.Период КАК Дата,
	|	Партии.ДокументПоступления,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.КорВидЗапасов
	|ПОМЕСТИТЬ Возвраты
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|		ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПартииРасходов.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	ПартииРасходов.Регистратор,
	|	ВЫБОР
	|		КОГДА НЕ Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ПартииРасходов.АналитикаУчетаНоменклатуры
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	
	|	ВЫБОР
	|		КОГДА НЕ Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ПартииРасходов.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	
	|	(ВЫБОР
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры

	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.Стоимость
	|		ИНАЧЕ
	|			ПартииРасходов.Стоимость
	|		КОНЕЦ
	|	) КАК Стоимость,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.СтоимостьБезНДС
	|		ИНАЧЕ
	|			ПартииРасходов.СтоимостьБезНДС
	|		КОНЕЦ
	|	) КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.СтоимостьРегл - ПартииРасходов.НДСРегл 
	|			ИНАЧЕ
	|				ПартииРасходов.СтоимостьРегл + ПартииРасходов.НДСРегл 
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.СтоимостьРегл 
	|			ИНАЧЕ
	|				ПартииРасходов.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ
	|		) КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И ПартииРасходов.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.НДСРегл
	|			ИНАЧЕ
	|				ПартииРасходов.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И ПартииРасходов.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				ПартииРасходов.НДСРегл
	|			ИНАЧЕ
	|				- ПартииРасходов.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА -ПартииРасходов.НДСРегл ИНАЧЕ ПартииРасходов.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.ПостояннаяРазница
	|		ИНАЧЕ
	|			ПартииРасходов.ПостояннаяРазница
	|		КОНЕЦ
	|	) КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.ВременнаяРазница
	|		ИНАЧЕ
	|			ПартииРасходов.ВременнаяРазница
	|		КОНЕЦ
	|	) КАК ВременнаяРазница,
	|	ПартииРасходов.Период,
	|	ПартииРасходов.СтатьяСписанияНДС,
	|	ПартииРасходов.АналитикаСписанияНДС
	|ПОМЕСТИТЬ ПартииРасходов
	|ИЗ
	|	РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ПартииРасходов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Партии
	|		ПО Партии.Ссылка = ПартииРасходов.Регистратор
	|		И Партии.ДокументПоступления = ПартииРасходов.ДокументПоступления
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииРасходов.АналитикаУчетаНоменклатуры
	|		И Партии.КорАналитикаУчетаНоменклатуры = ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		И Партии.ВидЗапасов = ПартииРасходов.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = ПартииРасходов.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = ПартииРасходов.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = ПартииРасходов.ДокументИсточник
	|		И Реализация.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = ПартииРасходов.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотребление КАК Потребление
	|		ПО Потребление.Ссылка = ПартииРасходов.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Передача.Ссылка = ПартииРасходов.ДокументИсточник
	|		И ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|		И ПартииРасходов.Количество < 0
	|ГДЕ
	|	ПартииРасходов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииРасходов.Активность
	|	И ПартииРасходов.Организация В (&МассивОрганизаций)
	|	И НЕ (ПартииРасходов.Регистратор ССЫЛКА Документ.КорректировкаНазначенияТоваров И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И НЕ (ПартииРасходов.Регистратор ССЫЛКА Документ.КорректировкаПриобретения И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И НЕ (ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И НЕ (ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности)
	|		И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И НЕ (ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию)
	|		И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))

	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииРасходов.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Передача.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	ПартииРасходов.Регистратор,
	|	ВЫБОР
	|		КОГДА НЕ Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ПартииРасходов.АналитикаУчетаНоменклатуры
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ПартииРасходов.ВидЗапасов
	|	КОНЕЦ,
	|	(ВЫБОР
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры

	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	ПартииРасходов.Период,
	|	ПартииРасходов.СтатьяСписанияНДС,
	|	ПартииРасходов.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		 И Партии.АналитикаУчетаНоменклатуры.Номенклатура.ПрослеживаемыйТовар
	|			ТОГДА ЕСТЬNULL(Партии.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Работа))
	|		КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		ИНАЧЕ ЕСТЬNULL(Партии.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ КАК ТипЗапасов,
	|	Партии.Регистратор,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям ТОГДА Партии.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям ТОГДА Партии.АналитикаУчетаПродукции
	|		КОГДА АналитикаПродукцииБезНазначения.КлючАналитики ЕСТЬ NULL ТОГДА Партии.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	(ВЫБОР
	|		КОГДА &ДляСтоимостиПродаж ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		ИНАЧЕ Партии.ПериодПродажи КОНЕЦ) КАК ПериодПродажи,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	// Подразделение должно заполняться аналогично УчетНДСРФ.ПолучитьПартии
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеСписанияНДС,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 ТОГДА 0 - Партии.Количество
	|			ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|	СУММА(Партии.Стоимость) КАК Стоимость,
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.ДопРасходы) КАК ДопРасходы,
	|	СУММА(Партии.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(Партии.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Партии.НДСРегл) КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	СУММА(Партии.СписаниеНДС) КАК СписаниеНДС,
	|	0 КАК СписаниеНДСУпр,
	|	СУММА(Партии.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Партии.ВременнаяРазница) КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Организация КАК Организация,
	|		Таблица.ВидЗапасов КАК ВидЗапасов,
	|		Таблица.Регистратор КАК Регистратор,
	|		Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Таблица.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаПродукции,
	|		Таблица.ПериодПродажи КАК ПериодПродажи,
	|		Таблица.Количество КАК Количество,
	|		Таблица.Стоимость КАК Стоимость,
	|		Таблица.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		0 КАК ДопРасходы,
	|		0 КАК ДопРасходыБезНДС,
	|		Таблица.СтоимостьРегл КАК СтоимостьРегл,
	|		Таблица.НДСРегл КАК НДСРегл,
	|		Таблица.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Таблица.ВременнаяРазница КАК ВременнаяРазница,
	|		Таблица.СписаниеНДС КАК СписаниеНДС,
	|		Таблица.Период,
	|		Таблица.СтатьяСписанияНДС,
	|		Таблица.АналитикаСписанияНДС
	|	ИЗ
	|		ТаблицаПартий КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПартииРасходов.Организация КАК Организация,
	|		ПартииРасходов.ВидЗапасов КАК ВидЗапасов,
	|		ПартииРасходов.Регистратор КАК Регистратор,
	|		ПартииРасходов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ПартииРасходов.АналитикаУчетаПродукции,
	|		ПартииРасходов.ПериодПродажи КАК ПериодПродажи,
	|		0 КАК Количество,
	|		0 КАК Стоимость,
	|		0 КАК СтоимостьБезНДС,
	|		ПартииРасходов.Стоимость КАК ДопРасходы,
	|		ПартииРасходов.СтоимостьБезНДС КАК ДопРасходыБезНДС,
	|		ПартииРасходов.СтоимостьРегл КАК СтоимостьРегл,
	|		ПартииРасходов.НДСРегл КАК НДСРегл,
	|		ПартииРасходов.ПостояннаяРазница КАК ПостояннаяРазница,
	|		ПартииРасходов.ВременнаяРазница КАК ВременнаяРазница,
	|		ПартииРасходов.СписаниеНДС КАК СписаниеНДС,
	|		ПартииРасходов.Период,
	|		ПартииРасходов.СтатьяСписанияНДС,
	|		ПартииРасходов.АналитикаСписанияНДС
	|	ИЗ
	|		ПартииРасходов КАК ПартииРасходов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Организация КАК Организация,
	|		Таблица.ВидЗапасов КАК ВидЗапасов,
	|		Таблица.Регистратор КАК Регистратор,
	|		Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Таблица.КорАналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		Таблица.ПериодПродажи КАК ПериодПродажи,
	|		Таблица.Количество КАК Количество,
	|		Таблица.Стоимость КАК Стоимость,
	|		Таблица.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		0 КАК ДопРасходы,
	|		0 КАК ДопРасходыБезНДС,
	|		Таблица.СтоимостьРегл КАК СтоимостьРегл,
	|		Таблица.НДСРегл КАК НДСРегл,
	|		Таблица.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Таблица.ВременнаяРазница КАК ВременнаяРазница,
	|		Таблица.СписаниеНДС КАК СписаниеНДС,
	|		Таблица.Период,
	|		Таблица.СтатьяСписанияНДС,
	|		Таблица.АналитикаСписанияНДС
	|	ИЗ
	|		СборкиТоваров КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПартииНаКомиссии.Организация,
	|		ПартииНаКомиссии.ВидЗапасов,
	|		ПартииНаКомиссии.Регистратор,
	|		ПартииНаКомиссии.АналитикаУчетаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|		ДАТАВРЕМЯ(1,1,1) КАК ПериодПродажи,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.Количество
	|			ИНАЧЕ ПартииНаКомиссии.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.Стоимость
	|			ИНАЧЕ ПартииНаКомиссии.Стоимость
	|		КОНЕЦ КАК Стоимость,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.СтоимостьБезНДС
	|			ИНАЧЕ ПартииНаКомиссии.СтоимостьБезНДС
	|		КОНЕЦ КАК СтоимостьБезНДС,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА
	|					ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|						0 - (ПартииНаКомиссии.СтоимостьРегл + ПартииНаКомиссии.НДСРегл)
	|					ИНАЧЕ
	|						ПартииНаКомиссии.СтоимостьРегл + ПартииНаКомиссии.НДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ
	|				ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|					0 - ПартииНаКомиссии.СтоимостьРегл
	|				ИНАЧЕ
	|					ПартииНаКомиссии.СтоимостьРегл
	|				КОНЕЦ
	|		КОНЕЦ КАК СтоимостьРегл,
	|		ВЫБОР КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И ПартииНаКомиссии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|				0 - ПартииНаКомиссии.НДСРегл
	|			ИНАЧЕ
	|				ПартииНаКомиссии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И ПартииНаКомиссии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|				ПартииНаКомиссии.НДСРегл
	|			ИНАЧЕ
	|				- ПартииНаКомиссии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК НДСРегл,
	|
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.ПостояннаяРазница
	|			ИНАЧЕ ПартииНаКомиссии.ПостояннаяРазница
	|		КОНЕЦ КАК ПостояннаяРазница,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.ВременнаяРазница
	|			ИНАЧЕ ПартииНаКомиссии.ВременнаяРазница
	|		КОНЕЦ КАК ВременнаяРазница,
	|		0 КАК СписаниеНДС,
	|		ПартииНаКомиссии.Период,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК ПартииНаКомиссии
	|	ГДЕ
	|		ПартииНаКомиссии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ПартииНаКомиссии.Активность
	|		И ПартииНаКомиссии.Организация В(&МассивОрганизаций)
	|		И ПартииНаКомиссии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И НЕ ПартииНаКомиссии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Затраты.Организация,
	|		Затраты.ВидЗапасов,
	|		Затраты.Регистратор,
	|		Затраты.АналитикаУчетаНоменклатуры,
	|		ВЫБОР
	|			КОГДА Затраты.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ КАК АналитикаУчетаПродукции,
	|		ЕСТЬNULL(НАЧАЛОПЕРИОДА(Корректировка.ДокументОснование.Дата, ДЕНЬ), ДАТАВРЕМЯ(1,1,1)) КАК ПериодПродажи,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.Количество
	|		ИНАЧЕ
	|			Затраты.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.Стоимость
	|		ИНАЧЕ
	|			Затраты.Стоимость
	|		КОНЕЦ КАК Стоимость,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.СтоимостьБезНДС
	|		ИНАЧЕ
	|			Затраты.СтоимостьБезНДС
	|		КОНЕЦ КАК СтоимостьБезНДС,
	|		0 КАК ДопРасходы,
	|		0 КАК ДопРасходыБезНДС,
	|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|				0 - (Затраты.СтоимостьРегл + Затраты.НДСРегл )
	|			ИНАЧЕ
	|				Затраты.СтоимостьРегл + Затраты.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|				0 - Затраты.СтоимостьРегл
	|			ИНАЧЕ
	|				Затраты.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ КАК СтоимостьРегл,
	|		0 КАК НДСРегл,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.ПостояннаяРазница
	|		ИНАЧЕ
	|			Затраты.ПостояннаяРазница
	|		КОНЕЦ КАК ПостояннаяРазница,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.ВременнаяРазница
	|		ИНАЧЕ
	|			Затраты.ВременнаяРазница
	|		КОНЕЦ КАК ВременнаяРазница,
	|		ВЫБОР КОГДА Затраты.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА -Затраты.НДСРегл ИНАЧЕ Затраты.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СписаниеНДС,
	|		Затраты.Период,
	|		Затраты.СтатьяСписанияНДС,
	|		Затраты.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Затраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|			ПО Корректировка.Ссылка = Затраты.Регистратор
	|	ГДЕ
	|		Затраты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Затраты.Активность
	|		И Затраты.Организация В(&МассивОрганизаций)
	|		И (Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПрочееОприходованиеТоваров
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	| 			)
	|
	|	) КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Партии.АналитикаУчетаНоменклатуры
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	|		ПО АналитикаБезНазначения.Номенклатура = Аналитика.Номенклатура
	|		И АналитикаБезНазначения.Характеристика = Аналитика.Характеристика
	|		И АналитикаБезНазначения.Серия = Аналитика.Серия
	|		И АналитикаБезНазначения.МестоХранения = Аналитика.МестоХранения
	|		И АналитикаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО АналитикаПродукции.Ссылка = Партии.АналитикаУчетаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|		ПО АналитикаПродукцииБезНазначения.Номенклатура = АналитикаПродукции.Номенклатура
	|		И АналитикаПродукцииБезНазначения.Характеристика = АналитикаПродукции.Характеристика
	|		И АналитикаПродукцииБезНазначения.Серия = АналитикаПродукции.Серия
	|		И АналитикаПродукцииБезНазначения.МестоХранения = АналитикаПродукции.МестоХранения
	|		И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	Партии.ВидЗапасов,
	|	ВЫБОР
	|		КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		 И Партии.АналитикаУчетаНоменклатуры.Номенклатура.ПрослеживаемыйТовар
	|			ТОГДА ЕСТЬNULL(Партии.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Работа))
	|		КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		ИНАЧЕ ЕСТЬNULL(Партии.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям ТОГДА Партии.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики КОНЕЦ),
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям ТОГДА Партии.АналитикаУчетаПродукции
	|		КОГДА АналитикаПродукцииБезНазначения.КлючАналитики ЕСТЬ NULL ТОГДА Партии.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ),
	|	(ВЫБОР
	|		КОГДА &ДляСтоимостиПродаж ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		ИНАЧЕ Партии.ПериодПродажи КОНЕЦ),
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ТаблицаПартий, ЗатратыНаВыпуск, СборкиТоваровВидыЗапасов,
		|СборкиТоваровПартии, СборкиТоваров, Возвраты, ПартииРасходов");
	
КонецПроцедуры

// Этап 2.5
Процедура ЗарегистрироватьСтоимостьФИФО(ПараметрыРасчета)

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗарегистрироватьСтоимостьФИФО");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов						КАК ВидЗапасов,
	|	Себестоимость.Организация						КАК Организация,
	|	Себестоимость.РазделУчета						КАК РазделУчета,
	|	СУММА(Себестоимость.Количество)					КАК Количество,
	|	СУММА(Себестоимость.Стоимость)					КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)			КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.ДопРасходы)			КАК СтоимостьДопРасходы,
	|	СУММА(Себестоимость.ДопРасходыБезНДС) 	КАК СтоимостьДопРасходыБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл)				КАК СтоимостьРегл
	|ПОМЕСТИТЬ ВТСебестоимостьОборот
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	НЕ Себестоимость.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка		КАК ДокументДвижения,
	|	&НачалоПериода								КАК Период,
	|
	|	Себестоимость.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов					КАК ВидЗапасов,
	|	Себестоимость.Организация					КАК Организация,
	|	Себестоимость.РазделУчета					КАК РазделУчета,
	|
	|	ВЫРАЗИТЬ((Себестоимость.Стоимость / Себестоимость.Количество) КАК ЧИСЛО(31,10)) 				КАК Стоимость,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьБезНДС / Себестоимость.Количество) КАК ЧИСЛО(31,10)) 			КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьДопРасходы / Себестоимость.Количество) КАК ЧИСЛО(31,10)) 		КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьДопРасходыБезНДС / Себестоимость.Количество) КАК ЧИСЛО(31,10)) КАК СтоимостьДопРасходыБезНДС,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьРегл / Себестоимость.Количество) КАК ЧИСЛО(31,10)) 			КАК СтоимостьРегл
	|ИЗ
	|	ВТСебестоимостьОборот КАК Себестоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО Себестоимость.Организация = ДокументыРасчетаСебестоимости.Организация
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыСведений.СтоимостьТоваров.Имя,
		Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТСебестоимостьОборот");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетСебестоимости_СредняяЗаМесяцВерсии21

// Этап 0 - начало расчета
Процедура РассчитатьСебестоимостьПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки)
	
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	// Этап 1.1
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ПроверитьКорректностьИсходныхДанныхДоРасчета(ПараметрыРасчета);
	КонецЕсли;
	
	Если РасчетСебестоимостиЛокализация.РассчитатьСебестоимость(ПараметрыРасчета) Тогда
		Возврат; // Выполнен локализованный расчет себестоимости
	КонецЕсли;
	
	РасчетСебестоимостиКорректировкаСтоимости.СкорректироватьСтоимостьВозвратовПрошлыхПериодов(ПараметрыРасчета);
	
	СформироватьТаблицуПередачМеждуОрганизациями(ПараметрыРасчета);
	
	// Этап сохранения движений документа "Распределение расходов будущих периодов" в кэш.
	// Формирует движения по регистрам:
	// - ПрочиеРасходы
	РасчетСебестоимостиКорректировкаСтоимости.ПодготовкаДанныхДляПрочихРасходов(ПараметрыРасчета);
	
	// Этап 3.1
	// Формирует движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	РасчетСебестоимостиЛокализация.ВключитьИсключитьНДСВСтоимость(ПараметрыРасчета);
	
	
	// Этап 3.6
	// Подготовка узлов корректировки для расчета управленческих стоимостей:
	//	- Стоимость;
	//	- СтоимостьБезНДС.
	//
	// Формирует временные таблицы:
	// - ВтУзлыКорректировки
	СформироватьУзлыКорректировкиСписанияСтоимости(ПараметрыРасчета);
	
	Если ПараметрыРасчета.КоличествоУзлов <> 0 Тогда
		
		// Этап 3.7
		// Формирует временные таблицы:
		// - ВтТаблицаРешений
		// - ВтПеремещенияСписания
		РассчитатьСтоимость(ПараметрыРасчета, Ложь);
		
		// Этап 3.8
		// Дополняет временные таблицы:
		// - ВТСтоимостьПартийТоваров
		// Формирует движения по регистрам:
		// - СтоимостьТоваров
		ЗарегистрироватьСтоимость(ПараметрыРасчета, Ложь);
		
	КонецЕсли;

	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтУзлыКорректировки, ВтПередачиТоваров,
		
		|ВтТаблицаРешений, ВтПеремещенияСписания");
	
	// Этап 3.10
	// Формирует временные таблицы:
	// - ВтУзлыКорректировки
	СформироватьУзлыКорректировкиСписанияСтоимостиРегл(ПараметрыРасчета);
	
	Если ПараметрыРасчета.КоличествоУзловРегл <> 0 Тогда
		
		// Этап 3.11
		// Формирует временные таблицы:
		// - ВтТаблицаРешений
		// - ВтПеремещенияСписания
		РассчитатьСтоимость(ПараметрыРасчета, Истина);
		
		// Этап 3.12
		// Дополняет временные таблицы:
		// - ВТСтоимостьПартийТоваров
		// Формирует движения по регистрам:
		// - СтоимостьТоваров
		ЗарегистрироватьСтоимость(ПараметрыРасчета, Истина);

	КонецЕсли;
	
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтУзлыКорректировки, ЕстьВозвратныеОтходы,
		|ВтТаблицаРешений, ВтПеремещенияСписания");
		
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		
		// Этап 3.14
		// Формирует движения по регистрам:
		// - СебестоимостьТоваров
		// - ПрочиеРасходы
		// - ПрочиеДоходы
		// - ДвиженияНоменклатураДоходыРасходы
		// - ДвиженияНоменклатураНоменклатура
		// - ПрочиеАктивыПассивы
		РасчетСебестоимостиКорректировкаСтоимости.СкорректироватьСтоимостьСписанияЗапасов(ПараметрыРасчета);
		
		
		// Этап 3.17
		// Формирует движения по регистрам:
		// - ВыручкаИСебестоимостьПродаж
		// - Закупки
		РасчетСебестоимостиКорректировкаСтоимости.СкорректироватьСтоимостьПродаж(ПараметрыРасчета);
		
		// Этап 3.18
		// Формирует движения по регистрам:
		// - ВыручкаИСебестоимостьПродаж
		// - ПрочиеРасходы
		// - ДвиженияНоменклатураДоходыРасходы
		РасчетСебестоимостиЛокализация.ВключитьИсключитьНДСВСтоимостьПродаж(ПараметрыРасчета);
		
		// Этап РаспределениеПостатейныхРасходовНаПродажу
		// Списываем расходы на продажи
		// Формирует движения по регистрам:
		// - ВыручкаИСебестоимостьПродаж
		// - ПрочиеРасходы
		РасчетСебестоимостиПостатейныеЗатраты.РаспределениеПостатейныхРасходовНаПродажу(ПараметрыРасчета);
		РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияРасходыНаПродажу(ПараметрыРасчета); 
		
		Если ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьРегл > 0
		 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьУпр > 0
		 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыРегл > 0
		 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыУпр > 0 Тогда
			// Этап 3.19
			// Формирует движения по регистрам:
			// - СебестоимостьТоваров
			// - ПрочиеРасходы
			// - ПрочиеРасходыНезавершенногоПроизводства
			// - ДвиженияНоменклатураДоходыРасходы
			// - ДвиженияНоменклатураНоменклатура
			РасчетСебестоимостиКорректировкаСтоимости.СписатьОшибкиОкругленияРасчетаСебестоимости(ПараметрыРасчета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "СтоимостьВНЗП");
	
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		Возврат;
	КонецЕсли;
		
	Если ПараметрыРасчета.ФО.ФормироватьФинансовыйРезультат Тогда
		// Этап 4.1
		// Формирует движения по регистрам:
		// - ФинансовыеРезультаты
		РасчетСебестоимостиКорректировкаСтоимости.РаспределитьВыручкуПоНаправлениямДеятельности(ПараметрыРасчета);
	КонецЕсли;
	
	// Этап 4.3
	// Формирует движения по регистрам:
	// - ПрочиеАктивыПассивы
	РасчетСебестоимостиКорректировкаСтоимости.ОтразитьПрибылиИУбытки(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ФО.ФормироватьУправленческийБаланс Тогда
		// Этап 4.4
		// Формирует движения управленческого баланса
		РасчетСебестоимостиКорректировкаСтоимости.ОтразитьВУправленческомБалансе(ПараметрыРасчета);
	КонецЕсли;
	
	// Этап Распределение расходов будущих периодов
	// Формирует движения по регистрам;
	// - ПрочиеРасходы
	РасчетСебестоимостиПостатейныеЗатраты.РаспределитьРасходыБудущихПериодов(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтРаспределениеРасходовНаПродажи");
	
КонецПроцедуры

// Этап 3.5
// Формирует временную таблицу ВтПередачиТоваров
//
Процедура СформироватьТаблицуПередачМеждуОрганизациями(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьТаблицуПередачМеждуОрганизациями");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроданныеТовары.ОрганизацияВладелец            КАК ОрганизацияПродавец,
	|	ПроданныеТовары.ВидЗапасовПродавца.Организация КАК ОрганизацияПолучатель,
	|	ПроданныеТовары.АналитикаУчетаНоменклатуры     КАК АналитикаУчетаНоменклатуры,
	|	СУММА(ПроданныеТовары.КоличествоОстаток)       КАК Количество,
	|	ПроданныеТовары.ВидЗапасовПродавца.ВидЗапасовВладельца 	КАК ВидЗапасовПродавца,
	|	ПроданныеТовары.ВидЗапасовПродавца 						КАК ВидЗапасовПолучателя
	|
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(&ГраницаКонецПериода,
	|		&ПредварительныйРасчет
	|		И ОрганизацияВладелец В (&МассивОрганизаций)
	|		И ВидЗапасовПродавца.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	) КАК ПроданныеТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроданныеТовары.ОрганизацияВладелец,
	|	ПроданныеТовары.ВидЗапасовПродавца.Организация,
	|	ПроданныеТовары.АналитикаУчетаНоменклатуры,
	|	ПроданныеТовары.ВидЗапасовПродавца.ВидЗапасовВладельца,
	|	ПроданныеТовары.ВидЗапасовПродавца
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Резервы.Организация                            КАК ОрганизацияПродавец,
	|	Резервы.КорОрганизация                         КАК ОрганизацияПолучатель,
	|	Резервы.АналитикаУчетаНоменклатуры             КАК АналитикаУчетаНоменклатуры,
	|	СУММА(Резервы.Количество)                      КАК Количество,
	|	Резервы.ВидЗапасов                             КАК ВидЗапасовПродавца,
	|	Резервы.КорВидЗапасов                          КАК ВидЗапасовПолучателя
	|
	|ИЗ
	|	РегистрНакопления.РезервыТоваровОрганизаций КАК Резервы
	|ГДЕ
	|	Резервы.Период МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И &ПредварительныйРасчет
	|	И Резервы.Организация В (&МассивОрганизаций)
	|	И Резервы.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	Резервы.Организация,
	|	Резервы.КорОрганизация,
	|	Резервы.АналитикаУчетаНоменклатуры,
	|	Резервы.ВидЗапасов,
	|	Резервы.КорВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                                  КАК ВидДвижения,
	|	&КонецПериода                                                           КАК Период,
	|	Товары.АналитикаУчетаНоменклатуры                                       КАК АналитикаУчетаНоменклатуры,
	|	Товары.ОрганизацияПродавец                                              КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	|
	|	Товары.ВидЗапасовПродавца   КАК ВидЗапасов,
	|	Товары.ВидЗапасовПолучателя КАК КорВидЗапасов,
	|
	|	Товары.Количество КАК Количество,
	|	0                 КАК Стоимость,
	|	0                 КАК ПостояннаяРазница,
	|	0                 КАК ВременнаяРазница,
	|	0                 КАК СтоимостьБезНДС,
	|	0                 КАК СтоимостьРегл,
	|
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)          КАК КорРазделУчета,
	|	Товары.ОрганизацияПолучатель                                                     КАК КорОрганизация,
	|	Товары.АналитикаУчетаНоменклатуры                                                КАК КорАналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ ВтПередачиТоваров
	|ИЗ
	|	Товары КАК Товары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Товары.ОрганизацияПолучатель КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	|
	|	Товары.ВидЗапасовПолучателя КАК ВидЗапасов,
	|	Неопределено КАК КорВидЗапасов,
	|
	|	Товары.Количество КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьРегл,
	|
	|	Неопределено КАК КорРазделУчета,
	|	Неопределено КАК КорОрганизация,
	|	Неопределено КАК КорАналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) КАК ХозяйственнаяОперация
	|ИЗ
	|	Товары КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ Товары
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтПередачиТоваров");
	
КонецПроцедуры

// Этап 3.8, 3.12
Процедура ЗарегистрироватьСтоимость(ПараметрыРасчета, РегистрацияСтоимостиРегл)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗарегистрироватьСтоимость" + ?(РегистрацияСтоимостиРегл, "(Регл)", ""));
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("РегистрацияСтоимостиРегл", РегистрацияСтоимостиРегл);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ДокументДвижения КАК ДокументДвижения,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Стоимость КАК Стоимость,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	Т.СтоимостьДопРасходы КАК СтоимостьДопРасходы,
	|	Т.СтоимостьДопРасходыБезНДС КАК СтоимостьДопРасходыБезНДС,
	|	Т.СтоимостьРегл КАК СтоимостьРегл,
	|	Т.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ВременнаяРазница КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТСтоимостьПартийТоваровВременная
	|ИЗ
	|	ВТСтоимостьПартийТоваров КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСтоимостьПартийТоваров";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	ВЫБОР
	|		КОГДА Т.КоличествоРасход <> 0 ТОГДА Т.КоличествоРасход
	|		КОГДА &ПредварительныйРасчет ТОГДА Т.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ВТОборотыКоличествоСПартиями
	|ИЗ
	|(ВЫБРАТЬ
	|	ДанныеПоКоличеству.АналитикаУчетаНоменклатуры,
	|	ДанныеПоКоличеству.РазделУчета,
	|	ДанныеПоКоличеству.ВидЗапасов,
	|	ДанныеПоКоличеству.Организация,
	|	СУММА(ДанныеПоКоличеству.КоличествоРасход)  КАК КоличествоРасход,
	|	СУММА(ДанныеПоКоличеству.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		Обороты.АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА Обороты.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И Обороты.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ Обороты.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		Обороты.ВидЗапасов,
	|		Обороты.Организация,
	|		Обороты.Количество 	КАК КоличествоРасход,
	|		0 					КАК КоличествоОстаток
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = Обороты.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = Обороты.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = Обороты.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ГДЕ
	|		НЕ Обороты.СлужебноеВидДвиженияПриход
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Остатки.АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА Остатки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И Остатки.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ Остатки.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		Остатки.ВидЗапасов,
	|		Остатки.Организация,
	|		0 					КАК КоличествоРасход,
	|		Остатки.Количество 	КАК КоличествоОстаток
	|	ИЗ
	|		ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = Остатки.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = Остатки.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	) КАК ДанныеПоКоличеству
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоКоличеству.АналитикаУчетаНоменклатуры,
	|	ДанныеПоКоличеству.Организация,
	|	ДанныеПоКоличеству.ВидЗапасов,
	|	ДанныеПоКоличеству.РазделУчета
	|) КАК Т
	|
	|ГДЕ
	|	ВЫБОР
	|		КОГДА Т.КоличествоРасход <> 0 ТОГДА Т.КоличествоРасход
	|		КОГДА &ПредварительныйРасчет ТОГДА Т.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ <> 0
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаНоменклатуры,
	|	Обороты.РазделУчета,
	|	Обороты.ВидЗапасов,
	|	Обороты.Организация,
	|	СУММА(Обороты.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТОборотыКоличествоБезПартий
	|ИЗ
	|	ВТОборотыКоличествоСПартиями КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаНоменклатуры,
	|	Обороты.РазделУчета,
	|	Обороты.ВидЗапасов,
	|	Обороты.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Обороты.Количество) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.Организация                КАК Организация,
	|	УзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	УзлыКорректировки.РазделУчета                КАК РазделУчета,
	
	|	СУММА(ТаблицаРешений.СтоимостьГраф_1
	|		* ТаблицаРешений.СтоимостьЗнакГраф_1) 			КАК СтоимостьГраф_1,
	|	СУММА(ТаблицаРешений.ДопРасходыГраф_1)           	КАК ДопРасходыГраф_1,
	
	|	СУММА(ТаблицаРешений.ПостояннаяРазница
	|		* ТаблицаРешений.ПостояннаяРазницаЗнак)         КАК ПостояннаяРазница,
	|	СУММА(ТаблицаРешений.ВременнаяРазница
	|		* ТаблицаРешений.ВременнаяРазницаЗнак)          КАК ВременнаяРазница,
	|	СУММА(ТаблицаРешений.СтоимостьЗабалансовая)         КАК СтоимостьЗабалансовая,

	|	СУММА(ТаблицаРешений.СтоимостьГраф_2
	|		* ТаблицаРешений.СтоимостьЗнакГраф_2)			КАК СтоимостьГраф_2,
	|	СУММА(ТаблицаРешений.ДопРасходыГраф_2)		 		КАК ДопРасходыГраф_2
	|ПОМЕСТИТЬ ВТСтоимостьТоваровБезВидаУчета
	|ИЗ
	|	ВтТаблицаРешений КАК ТаблицаРешений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировки
	|			ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|ГДЕ
	|	(ТаблицаРешений.СтоимостьГраф_1 <> 0
	|		ИЛИ ТаблицаРешений.ДопРасходыГраф_1 <> 0
	|		ИЛИ ТаблицаРешений.ВременнаяРазница <> 0
	|		ИЛИ ТаблицаРешений.ПостояннаяРазница <> 0
	|		ИЛИ ТаблицаРешений.СтоимостьЗабалансовая <> 0
	|		ИЛИ ТаблицаРешений.СтоимостьГраф_2 <> 0
	|		ИЛИ ТаблицаРешений.ДопРасходыГраф_2 <> 0)
	|	И УзлыКорректировки.АналитикаУчетаНоменклатуры ССЫЛКА Справочник.КлючиАналитикиУчетаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.АналитикаУчетаНоменклатуры,
	|	УзлыКорректировки.Организация,
	|	УзлыКорректировки.ВидЗапасов,
	|	УзлыКорректировки.РазделУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка								КАК ДокументДвижения,
	|	&НачалоПериода 														КАК Период,
	|
	|	СтоимостьТоваров.Организация 										КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 						КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 										КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 										КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО							 	  						КАК Партия,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)			КАК АналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО								  						КАК АналитикаФинансовогоУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)			КАК ВидДеятельностиНДС,
	|
	// упр.
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьГраф_1
	|	КОНЕЦ 																КАК Стоимость,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьГраф_2
	|	КОНЕЦ 																КАК СтоимостьБезНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ДопРасходыГраф_1
	|	КОНЕЦ 																КАК СтоимостьДопРасходы,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ДопРасходыГраф_2
	|	КОНЕЦ 																КАК СтоимостьДопРасходыБезНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансовая
	|	КОНЕЦ 																КАК СтоимостьЗабалансовая,
	|
	// регл.
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.СтоимостьГраф_1
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК СтоимостьРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.СтоимостьЗабалансовая
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК СтоимостьЗабалансоваяРегл,
	|
	// разницы
	|	СтоимостьТоваров.ПостояннаяРазница									КАК ПостояннаяРазница,
	|	СтоимостьТоваров.ВременнаяРазница									КАК ВременнаяРазница,
	|
	// количество
	|	ЕСТЬNULL(Обороты.Количество, 0)										КАК Количество
	|
	|ПОМЕСТИТЬ ВТСтоимостьТоваров
	|ИЗ
	|	ВТСтоимостьТоваровБезВидаУчета КАК СтоимостьТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО СтоимостьТоваров.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыКоличествоСПартиями КАК Обороты
	|			ПО СтоимостьТоваров.АналитикаУчетаНоменклатуры  = Обороты.АналитикаУчетаНоменклатуры
	|			И СтоимостьТоваров.РазделУчета 					= Обороты.РазделУчета
	|			И СтоимостьТоваров.ВидЗапасов 					= Обороты.ВидЗапасов
	|			И СтоимостьТоваров.Организация 					= Обороты.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	0																	КАК НомерУзла,
	|	СтоимостьТоваров.ДокументДвижения									КАК ДокументДвижения,
	|	СтоимостьТоваров.Период 											КАК Период,
	|
	|	СтоимостьТоваров.Организация 										КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 						КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 										КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 										КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО							 	  						КАК Партия,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)			КАК АналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО								  						КАК АналитикаФинансовогоУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)			КАК ВидДеятельностиНДС,
	|
	|	СУММА(СтоимостьТоваров.Стоимость)		 	  						КАК Стоимость,
	|	СУММА(СтоимостьТоваров.СтоимостьБезНДС)		 	  					КАК СтоимостьБезНДС,
	|	СУММА(СтоимостьТоваров.СтоимостьЗабалансовая)		 	  			КАК СтоимостьЗабалансовая,
	|	СУММА(СтоимостьТоваров.СтоимостьДопРасходы)		 	  				КАК СтоимостьДопРасходы,
	|	СУММА(СтоимостьТоваров.СтоимостьДопРасходыБезНДС)		 	  		КАК СтоимостьДопРасходыБезНДС,
	|	0		 	  														КАК Трудозатраты,
	|	0														 	  		КАК ПостатейныеПостоянныеСНДС,
	|	0														 	  		КАК ПостатейныеПостоянныеБезНДС,
	|	0													                КАК ПостатейныеПеременныеСНДС,
	|	0													                КАК ПостатейныеПеременныеБезНДС,
	|
	|	СУММА(СтоимостьТоваров.СтоимостьРегл)		 	  					КАК СтоимостьРегл,
	|	СУММА(СтоимостьТоваров.СтоимостьЗабалансоваяРегл)		 	  		КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(СтоимостьТоваров.СтоимостьРегл)
	|		- СУММА(СтоимостьТоваров.ПостояннаяРазница)
	|		- СУММА(СтоимостьТоваров.ВременнаяРазница)						КАК СтоимостьНУ,
	|	СУММА(СтоимостьТоваров.ПостояннаяРазница)		 	  				КАК ПостояннаяРазница,
	|	СУММА(СтоимостьТоваров.ВременнаяРазница)		 	  				КАК ВременнаяРазница,
	|	0												 	  				КАК СтоимостьНДД,
	|	0											 	  					КАК ДопРасходыРегл,
	|	0												 	  				КАК ТрудозатратыРегл,
	|	0												 					КАК ПостатейныеПостоянныеРегл,
	|	0												 					КАК ПостатейныеПеременныеРегл,
	|
	|	0									                         		КАК СтоимостьУпр,
	|	0									                      			КАК ДопРасходыУпр,
	|	0										                         	КАК ТрудозатратыУпр,
	|	0												                    КАК ПостатейныеПостоянныеУпр,
	|	0												                    КАК ПостатейныеПеременныеУпр,
	|
	|	0																	КАК РезервПодОбесценениеРегл,
	|	0																	КАК РезервПодОбесценениеУпр
	|
	|ПОМЕСТИТЬ ВТСтоимостьПартийТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтоимостьТоваров.ДокументДвижения								КАК ДокументДвижения,
	|		СтоимостьТоваров.Период 										КАК Период,
	|
	|		СтоимостьТоваров.Организация 									КАК Организация,
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 					КАК АналитикаУчетаНоменклатуры,
	|		СтоимостьТоваров.ВидЗапасов 									КАК ВидЗапасов,
	|		СтоимостьТоваров.РазделУчета 									КАК РазделУчета,
	|
	|		СтоимостьТоваров.Стоимость		 	  							КАК Стоимость,
	|		СтоимостьТоваров.СтоимостьБезНДС		 	  					КАК СтоимостьБезНДС,
	|		СтоимостьТоваров.СтоимостьЗабалансовая		 	  				КАК СтоимостьЗабалансовая,
	|		СтоимостьТоваров.СтоимостьДопРасходы		 	  				КАК СтоимостьДопРасходы,
	|		СтоимостьТоваров.СтоимостьДопРасходыБезНДС		 	  			КАК СтоимостьДопРасходыБезНДС,
	|
	|		СтоимостьТоваров.СтоимостьРегл		 	  						КАК СтоимостьРегл,
	|		СтоимостьТоваров.СтоимостьЗабалансоваяРегл		 	  			КАК СтоимостьЗабалансоваяРегл,
	|		СтоимостьТоваров.ПостояннаяРазница		 	  					КАК ПостояннаяРазница,
	|		СтоимостьТоваров.ВременнаяРазница		 	  					КАК ВременнаяРазница
	|	ИЗ
	|		ВТСтоимостьПартийТоваровВременная КАК СтоимостьТоваров
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СтоимостьТоваров.ДокументДвижения								КАК ДокументДвижения,
	|		СтоимостьТоваров.Период 										КАК Период,
	|
	|		СтоимостьТоваров.Организация 									КАК Организация,
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 					КАК АналитикаУчетаНоменклатуры,
	|		СтоимостьТоваров.ВидЗапасов 									КАК ВидЗапасов,
	|		СтоимостьТоваров.РазделУчета 									КАК РазделУчета,
	|
	|		СтоимостьТоваров.Стоимость		 	  							КАК Стоимость,
	|		СтоимостьТоваров.СтоимостьБезНДС		 	  					КАК СтоимостьБезНДС,
	|		СтоимостьТоваров.СтоимостьЗабалансовая		 	  				КАК СтоимостьЗабалансовая,
	|		СтоимостьТоваров.СтоимостьДопРасходы		 	  				КАК СтоимостьДопРасходы,
	|		СтоимостьТоваров.СтоимостьДопРасходыБезНДС		 	  			КАК СтоимостьДопРасходыБезНДС,
	|
	|		СтоимостьТоваров.СтоимостьРегл		 	  						КАК СтоимостьРегл,
	|		СтоимостьТоваров.СтоимостьЗабалансоваяРегл		 	  			КАК СтоимостьЗабалансоваяРегл,
	|		СтоимостьТоваров.ПостояннаяРазница		 	  					КАК ПостояннаяРазница,
	|		СтоимостьТоваров.ВременнаяРазница		 	  					КАК ВременнаяРазница
	|	ИЗ
	|		ВТСтоимостьТоваров КАК СтоимостьТоваров
	|	) КАК СтоимостьТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьТоваров.ДокументДвижения,
	|	СтоимостьТоваров.Период,
	|	СтоимостьТоваров.Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СтоимостьТоваров.ДокументДвижения														КАК ДокументДвижения,
	|	СтоимостьТоваров.Период 																КАК Период,
	|
	|	СтоимостьТоваров.Организация 															КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 											КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 															КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 															КАК РазделУчета,
	|
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.Стоимость * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК Стоимость,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьЗабалансовая * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьЗабалансовая,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьДопРасходы * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьДопРасходы,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьДопРасходыБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьДопРасходыБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьЗабалансоваяРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостояннаяРазница * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ВременнаяРазница * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ВременнаяРазница
	|ИЗ
	|	ВТСтоимостьТоваров КАК СтоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОборотыКоличествоБезПартий КАК Обороты
	|			ПО СтоимостьТоваров.АналитикаУчетаНоменклатуры  = Обороты.АналитикаУчетаНоменклатуры
	|			И СтоимостьТоваров.РазделУчета 					= Обороты.РазделУчета
	|			И СтоимостьТоваров.ВидЗапасов 					= Обороты.ВидЗапасов
	|			И СтоимостьТоваров.Организация 					= Обороты.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьТоваров.ДокументДвижения,
	|	СтоимостьТоваров.Период,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.РазделУчета,
	|	СтоимостьТоваров.ВидЗапасов,
	|	СтоимостьТоваров.Организация,
	|	Обороты.Количество
	|";
	
	// Сформируем движения по регистру сведений СтоимостьТоваров (без партий)
	РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыСведений.СтоимостьТоваров.Имя,
		Запрос);
	
	// Добавим в протокол информацию об узлах с переполнением поля
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета, "ВТУзлыСПереполнениемПоля")
	 И РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВТУзлыСПереполнениемПоля") > 0 Тогда
		
		СтрокаПротокола = "";
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.Организация КАК Организация,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
		|ИЗ
		|	ВТУзлыСПереполнениемПоля КАК Т
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	АналитикаУчетаНоменклатуры,
		|	Партия,
		|	ВидДеятельностиНДС";
		
		Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаПротокола = СтрокаПротокола + ?(СтрокаПротокола = "", "", Символы.ПС)
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Организация: ""%1"", Аналитика номенклатуры: ""%2""'"),
					Выборка.Организация,
					Выборка.АналитикаУчетаНоменклатуры);
					
		КонецЦикла;
		
		СтрокаПротокола =
			НСтр("ru='Стоимость некоторых аналитик номенклатуры не может быть рассчитана при решении СЛУ.
				|Возможные причины: превышение расходов над приходами и начальными остатками или зацикливание движений.'")
			+ Символы.ПС + СтрокаПротокола;
		
		РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
		
	КонецЕсли;
	
	// Завершим расчет
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТОборотыКоличествоСПартиями, ВТОстаткиСтоимости, ВТСтоимостьТоваровБезВидаУчета,
		|ВТОборотыКоличествоБезПартий, ВТСтоимостьТоваров, ВТСтоимостьПартийТоваровВременная");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры


#КонецОбласти

#Область ПодготовкаИРешениеСЛУ

// Этап 3.6
Процедура СформироватьУзлыКорректировкиСписанияСтоимости(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьУзлыКорректировкиСписанияСтоимости");
	
	ТекстЗапроса = РасчетСебестоимостиРешениеСЛУ.ТекстВтЕстьВозвратныеОтходы() + ";";
	ТекстЗапроса = ТекстЗапроса +
	"
	// Данные об аналитике для расчета.
	|//ПредварительныйРасчет ВЫБРАТЬ РАЗЛИЧНЫЕ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ПОМЕСТИТЬ ВтАналитикаНоменклатуры
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ОБЪЕДИНИТЬ
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ВЫБРАТЬ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|//ПредварительныйРасчет		Организация В (&МассивОрганизаций)
	|//ПредварительныйРасчет		И РазделУчета = Значение(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|//ПредварительныйРасчет	) КАК УчетСебестоимости
	|//ПредварительныйРасчет ;
	|////////////////////////////////////////////////////////////////////////////////
	// Данные о движении товаров за период.
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация                КАК Организация,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.РазделУчета                КАК РазделУчета,
	|	ВложенныйЗапрос.ВидЗапасов                 КАК ВидЗапасов,
	|	ВложенныйЗапрос.КодСтрокиПродукция		   КАК КодСтрокиПродукция,
	|	ВложенныйЗапрос.Подразделение		 	   КАК Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяРасходов				КАК СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов			КАК АналитикаРасходов,

	// Показатели узла 1го графа. Данные для расчета ресурса Стоимость.
	|	СУММА(ВложенныйЗапрос.ВесГраф_1)          	КАК ВесГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ДопРасходыГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьЗабалансовая) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК СтоимостьЗабалансовая,
	|	1                             			   КАК СтоимостьЗнакГраф_1,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))  			   КАК ПостояннаяРазница,
	|	1 										   КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))  			   КАК ВременнаяРазница,
	|	1 										   КАК ВременнаяРазницаЗнак,
	
	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьБезНДС.
	|	СУММА(ВложенныйЗапрос.ВесГраф_2)    		КАК ВесГраф_2,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК СтоимостьГраф_2,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_2) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ДопРасходыГраф_2) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_2)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  			   КАК ДопРасходыГраф_2,
	|
	|	1                             			   КАК СтоимостьЗнакГраф_2
	|
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|
	|	(ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		0       									 КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,

	// Показатели узла 1го графа. Данные для расчета ресурса Стоимость.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|		 	КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|			 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|			 И УчетСебестоимости.ВидДеятельностиНДС <> УчетСебестоимости.ВидДеятельностиНДСОтгрузки
	|				ТОГДА -УчетСебестоимости.Количество 
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ КАК ВесГраф_1,
	
		// Данные о суммах внешних поступлений.
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 	И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 	И УчетСебестоимости.Количество = 0
	|		 	И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|				УчетСебестоимости.Стоимость
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Стоимость
	|		КОГДА УчетСебестоимости.Сторно И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Стоимость
	|		КОГДА УчетСебестоимости.Сторно
	|		 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|			ТОГДА -УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходы
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.ДопРасходы
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходы
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_1,
	
		// Делится по контурам. Расчет производится по одному из весов.
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансовая
	|			КОГДА УчетСебестоимости.Сторно И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансовая
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.СтоимостьЗабалансовая
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьЗабалансовая,
	
	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьБезНДС.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|		 	КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|			 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|			 И УчетСебестоимости.ВидДеятельностиНДС <> УчетСебестоимости.ВидДеятельностиНДСОтгрузки
	|				ТОГДА -УчетСебестоимости.Количество
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ 							 КАК ВесГраф_2,
	
		// Данные о суммах внешних поступлений.
	|
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьБезНДС
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			КОГДА УчетСебестоимости.Сторно И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_2,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходыБезНДС
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыБезНДС
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.ДопРасходыБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_2
	
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		0       									 КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,

	// Показатели узла 1го графа. Данные для расчета ресурса Стоимость.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ КАК ВесГраф_1,
	
		// Данные о суммах внешних поступлений.
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 	И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 	И УчетСебестоимости.Количество = 0
	|		 	И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|				УчетСебестоимости.Стоимость
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_1,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходы
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходы
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_1,
	
		// Делится по контурам. Расчет производится по одному из весов.
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансовая
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьЗабалансовая,
	
	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьБезНДС.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ 							 КАК ВесГраф_2,
	
		// Данные о суммах внешних поступлений.
	|
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьБезНДС
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьГраф_2,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ДопРасходыБезНДС
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ДопРасходыГраф_2
	
	|	ИЗ
	|		ВТПромежуточнаяСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ГДЕ
	|		 УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|
	// Уменьшение количества в узле при встречных перемещениях в один и тот же узел.
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УчетСебестоимости.Организация                   КАК Организация,
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.КорРазделУчета                КАК РазделУчета,
	|		УчетСебестоимости.КорВидЗапасов                 КАК ВидЗапасов,
	|		0       									    КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,
	|		-УчетСебестоимости.Количество КАК ВесГраф_1,
	|		0 КАК СтоимостьГраф_1,
	|		0 КАК ДопРасходыГраф_1,
	|		0 КАК СтоимостьЗабалансовая,
	|		-УчетСебестоимости.Количество КАК ВесГраф_2,
	|		0 КАК СтоимостьГраф_2,
	|		0 КАК ДопРасходыГраф_2
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ГДЕ
	|		 УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|		 И УчетСебестоимости.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		 И УчетСебестоимости.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		 И УчетСебестоимости.КорРазделУчета = УчетСебестоимости.РазделУчета
	|		 И УчетСебестоимости.КорВидЗапасов = УчетСебестоимости.ВидЗапасов
	|
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные о передачах между организациям.
	|		УчетСебестоимости.Организация                				КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры 				КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                				КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                		 		КАК ВидЗапасов,
	|		0       									 				КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,

		// Показатели графа 1. Стоимость.
	|		ВЫБОР КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК ВесГраф_1,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК СтоимостьГраф_1,
	|		0                                            				КАК ДопРасходыГраф_1,
	|		0                                            				КАК СтоимостьЗабалансовая,
		// Показатели графа 2. СтоимостьБезНДС.	
	|		ВЫБОР КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК ВесГраф_2,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК СтоимостьГраф_2,
	|		0                                            				КАК ДопРасходыГраф_2
	|	ИЗ
	|		ВтПередачиТоваров КАК УчетСебестоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по остаткам на начало расчетного периода.
	|	ВЫБРАТЬ
	|		УчетСебестоимости.Организация                   КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                   КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                    КАК ВидЗапасов,
	|		0       									 	КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,

		// Показатели графа 1. Стоимость.
	|		УчетСебестоимости.КоличествоОстаток             КАК ВесГраф_1,
	|		УчетСебестоимости.СтоимостьОстаток              КАК СтоимостьГраф_1,
	|		УчетСебестоимости.ДопРасходыОстаток       		КАК ДопРасходыГраф_1,
	|		УчетСебестоимости.СтоимостьЗабалансоваяОстаток  КАК СтоимостьЗабалансовая,
		// Показатели графа 2. СтоимостьБезНДС.
	|		УчетСебестоимости.КоличествоОстаток             КАК ВесГраф_2,
	|		УчетСебестоимости.СтоимостьБезНДСОстаток        КАК СтоимостьГраф_2,
	|		УчетСебестоимости.ДопРасходыБезНДСОстаток 		КАК ДопРасходыГраф_2
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|			//ПредварительныйРасчет И (АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов)
	|			//ПредварительныйРасчет В
	|			//ПредварительныйРасчет (ВЫБРАТЬ
	|			//ПредварительныйРасчет 	АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов
	|			//ПредварительныйРасчет	ИЗ ВтАналитикаНоменклатуры)
	|		) КАК УчетСебестоимости
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.ВидЗапасов,
	|	ВложенныйЗапрос.РазделУчета,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.КодСтрокиПродукция,
	|	ВложенныйЗапрос.Подразделение
	|";
	
	ТекстЗапроса = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПредварительныйРасчет", "");
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтУзлыКорректировки");
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет
	 И ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОВзвешеннаяОценка Тогда
		ПодготовитьДанныеДляРасчетаСтоимостиПоФИФО(ПараметрыРасчета, Запрос); // корректировка ВтУзлыКорректировки
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтАналитикаНоменклатуры");
	КонецЕсли;
	
	ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатуры", // разделитель
		, // без группировки
		"АналитикаУчетаНоменклатуры,
			|ВидЗапасов, Организация", // порядок
		"НомерУзла", // поле номера
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, НомерУзла"); // индекс
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ВтУзлыКорректировки");
	
	ПараметрыРасчета.КоличествоУзлов =
		РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировки");

КонецПроцедуры

// Этап 3.10
// Формирует временную таблицу узлов корректировки - ВтУзлыКорректировки.
//
Процедура СформироватьУзлыКорректировкиСписанияСтоимостиРегл(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьУзлыКорректировкиСписанияСтоимостиРегл");
	
	ТекстЗапроса =
	"
	// Данные об аналитике для расчета.
	|//ПредварительныйРасчет ВЫБРАТЬ РАЗЛИЧНЫЕ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ПОМЕСТИТЬ ВтАналитикаНоменклатуры
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ОБЪЕДИНИТЬ
	|//ПредварительныйРасчет 
	|//ПредварительныйРасчет ВЫБРАТЬ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|//ПредварительныйРасчет		РазделУчета = Значение(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|//ПредварительныйРасчет		И Организация В (&МассивОрганизаций)
	|//ПредварительныйРасчет	) КАК УчетСебестоимости
	|//ПредварительныйРасчет ;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// Данные о движении товаров за период.
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация                КАК Организация,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.РазделУчета                КАК РазделУчета,
	|	ВложенныйЗапрос.ВидЗапасов                 КАК ВидЗапасов,
	|	ВложенныйЗапрос.КодСтрокиПродукция         КАК КодСтрокиПродукция,
	|	ВложенныйЗапрос.Подразделение			   КАК Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяРасходов             КАК СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов          КАК АналитикаРасходов,
	|	СУММА(ВложенныйЗапрос.ВесГраф_1)		   КАК ВесГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.СтоимостьГраф_1) < 0 И СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			- ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ДопРасходыГраф_1) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК ДопРасходыГраф_1,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.СтоимостьГраф_1) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК СтоимостьЗнакГраф_1,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьЗабалансовая) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(28,10))   КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ПостояннаяРазница) < 0 И СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				-ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостояннаяРазница) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостояннаяРазница) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  КАК ПостояннаяРазница,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.ПостояннаяРазница) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК ПостояннаяРазницаЗнак,
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВременнаяРазница) < 0 И СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				-ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВременнаяРазница) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			КОГДА СУММА(ВложенныйЗапрос.ВесГраф_1) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВременнаяРазница) КАК ЧИСЛО(28,10)) / СУММА(ВложенныйЗапрос.ВесГраф_1)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(28,10))  КАК ВременнаяРазница,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.ВременнаяРазница) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК ВременнаяРазницаЗнак,
	
	|	СУММА(ВложенныйЗапрос.ВесГраф_2) КАК ВесГраф_2,
	|	0 КАК СтоимостьГраф_2,
	|	0 КАК ДопРасходыГраф_2,
	|	1 КАК СтоимостьЗнакГраф_2
	|
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|
	|	(ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|				ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		0										     КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,

	// Показатели узла 1го графа. Данные для расчета ресурса СтоимостьРегл.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|		 	КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|			 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|			 И УчетСебестоимости.ВидДеятельностиНДС <> УчетСебестоимости.ВидДеятельностиНДСОтгрузки
	|				ТОГДА -УчетСебестоимости.Количество
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесГраф_1,
	|		
	|		ВЫБОР
	|		КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И НЕ УчетСебестоимости.Сторно
	|			И (УчетСебестоимости.РасчетСебестоимости
	|				ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.Количество <> 0 ИЛИ &СредняяЗаМесяц ИЛИ &ПартионныйУчетВерсии22)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|		КОГДА УчетСебестоимости.Сторно И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|		КОГДА УчетСебестоимости.Сторно
	|		 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|			ТОГДА -УчетСебестоимости.СтоимостьРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СтоимостьГраф_1,
	|
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|				И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|				И УчетСебестоимости.Количество = 0
	|				И НЕ &СредняяЗаМесяц
	|				И НЕ УчетСебестоимости.РасчетСебестоимости
	|			ТОГДА
	|				УчетСебестоимости.СтоимостьРегл
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ДопРасходыГраф_1,
	|		
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансоваяРегл
	|			КОГДА УчетСебестоимости.Сторно И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансоваяРегл
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СтоимостьЗабалансовая,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостояннаяРазница
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостояннаяРазница,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ВременнаяРазница
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВременнаяРазница,

	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьУпр.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|		 	КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|			 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|			 И УчетСебестоимости.ВидДеятельностиНДС <> УчетСебестоимости.ВидДеятельностиНДСОтгрузки
	|				ТОГДА -УчетСебестоимости.Количество
	|			КОГДА УчетСебестоимости.Сторно
	|			 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
	|				ТОГДА -УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесГраф_2
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ГДЕ
	|		 НЕ (&ПредварительныйРасчет
	|			И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|			И НЕ УчетСебестоимости.Сторно)
	|		//ПредварительныйРасчет    	И
	|		//ПредварительныйРасчет    		(УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет			УчетСебестоимости.РазделУчета,
	|		//ПредварительныйРасчет			УчетСебестоимости.ВидЗапасов)
	|		//ПредварительныйРасчет				В
	|		//ПредварительныйРасчет				(ВЫБРАТЬ
	|		//ПредварительныйРасчет					АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет					РазделУчета,
	|		//ПредварительныйРасчет					ВидЗапасов
	|		//ПредварительныйРасчет			 	ИЗ ВтАналитикаНоменклатуры)
	|	
	////////////////////// Эта часть для предварительного расчета стоимости.
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|				ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		0										     КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,

	// Показатели узла 1го графа. Данные для расчета ресурса СтоимостьРегл.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесГраф_1,
	|		
	|		ВЫБОР
	|		КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И (НЕ &ПредварительныйРасчет
	|				ИЛИ УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)) ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.РасчетСебестоимости
	|				ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.Количество <> 0 ИЛИ &СредняяЗаМесяц ИЛИ &ПартионныйУчетВерсии22)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СтоимостьГраф_1,
	|
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|				И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|				И УчетСебестоимости.Количество = 0
	|				И НЕ &СредняяЗаМесяц
	|				И НЕ УчетСебестоимости.РасчетСебестоимости
	|			ТОГДА
	|				УчетСебестоимости.СтоимостьРегл
	|			КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА
	|				-УчетСебестоимости.ДопРасходыРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ДопРасходыГраф_1,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СтоимостьЗабалансовая,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостояннаяРазница,
	
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВременнаяРазница,

	// Показатели узла 2го графа. Данные для расчета ресурса СтоимостьУпр.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			 И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВесГраф_2
	|	ИЗ
	|		ВТПромежуточнаяСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ГДЕ
	|		УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		И НЕ УчетСебестоимости.Сторно
	|		//ПредварительныйРасчет    		И (УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет			УчетСебестоимости.РазделУчета,
	|		//ПредварительныйРасчет			УчетСебестоимости.ВидЗапасов)
	|		//ПредварительныйРасчет				В
	|		//ПредварительныйРасчет				(ВЫБРАТЬ
	|		//ПредварительныйРасчет					АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет					РазделУчета,
	|		//ПредварительныйРасчет					ВидЗапасов
	|		//ПредварительныйРасчет			 	ИЗ ВтАналитикаНоменклатуры)
	|
	// Уменьшение количества в узле при встречных перемещениях в один и тот же узел.
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УчетСебестоимости.Организация                   КАК Организация,
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.КорРазделУчета                КАК РазделУчета,
	|		УчетСебестоимости.КорВидЗапасов                 КАК ВидЗапасов,
	|		0       									    КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,

	// Показатели граф 1.
	|		-УчетСебестоимости.Количество КАК ВесГраф_1,
	|		0 КАК СтоимостьГраф_1,
	|		0 КАК ДопРасходыГраф_1,
	|		0 КАК СтоимостьЗабалансовая,
	|		0 КАК ПостояннаяРазница,
	|		0 КАК ВременнаяРазница,
	// Показатели граф 2.
	|		-УчетСебестоимости.Количество КАК ВесГраф_2
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ГДЕ
	|		 УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|		 И УчетСебестоимости.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		 И УчетСебестоимости.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		 И УчетСебестоимости.КорРазделУчета = УчетСебестоимости.РазделУчета
	|		 И УчетСебестоимости.КорВидЗапасов = УчетСебестоимости.ВидЗапасов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по остаткам на начало расчетного периода.
	|	ВЫБРАТЬ
	|		УчетСебестоимости.Организация                           	КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры            	КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                           	КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                            	КАК ВидЗапасов,
	|		0										    				КАК КодСтрокиПродукция,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)КАК СтатьяРасходов,
	|		НЕОПРЕДЕЛЕНО                       							КАК АналитикаРасходов,

	        // Показатели граф 1.
	|		УчетСебестоимости.КоличествоОстаток 				КАК ВесГраф_1,
	|		УчетСебестоимости.СтоимостьРеглОстаток 				КАК СтоимостьГраф_1,
	|		0										 			КАК ДопРасходыГраф_1,
	|		УчетСебестоимости.СтоимостьЗабалансоваяРеглОстаток 	КАК СтоимостьЗабалансовая,
	|		УчетСебестоимости.ПостояннаяРазницаОстаток 			КАК ПостояннаяРазница,
	|		УчетСебестоимости.ВременнаяРазницаОстаток 			КАК ВременнаяРазница,
	        // Показатели граф 2.
	|		УчетСебестоимости.КоличествоОстаток					КАК ВесГраф_2
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|			//ПредварительныйРасчет И (АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов)
	|			//ПредварительныйРасчет В
	|			//ПредварительныйРасчет (ВЫБРАТЬ
	|			//ПредварительныйРасчет 	АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов
	|			//ПредварительныйРасчет	ИЗ ВтАналитикаНоменклатуры)
	|		) КАК УчетСебестоимости
	|	ГДЕ
	|		УчетСебестоимости.КоличествоОстаток <> 0
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.ВидЗапасов,
	|	ВложенныйЗапрос.РазделУчета,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.КодСтрокиПродукция,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов
	|";
	
	ТекстЗапроса = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПредварительныйРасчет", "");
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтУзлыКорректировки");
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет
	 И ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОВзвешеннаяОценка Тогда
		ПодготовитьДанныеДляРасчетаСтоимостиРеглПоФИФО(ПараметрыРасчета, Запрос); // корректировка ВтУзлыКорректировки
	КонецЕсли;

	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтАналитикаНоменклатуры");
	КонецЕсли;
	
	ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатуры", // разделитель
		, // без группировки
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация", // порядок
		"НомерУзла", // поле номера
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, НомерУзла"); // индекс
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ВтУзлыКорректировки");
	
	ПараметрыРасчета.КоличествоУзловРегл =
		РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировки");

КонецПроцедуры

// Служебная, этап 3.6
// Функция выполняет корректировку стоимости и количества внешних приходов в узлах при расчете стоимости по ФИФО (Скользящая оценка).
//
// Параметры:
// Запрос - запрос - запрос по формированию узлов корректировки.
//
// Возвращаемое значение
// Таблица значений - узлы корректировки стоимости.
//
Процедура ПодготовитьДанныеДляРасчетаСтоимостиПоФИФО(ПараметрыРасчета, Запрос)

	// Формирование таблицы узлов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|
	|	Себестоимость.КоличествоОстаток
	|ПОМЕСТИТЬ ВТНачальныеОстатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|				И (АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов) В
	|					(ВЫБРАТЬ
	|						Таблица.АналитикаУчетаНоменклатуры,
	|						Таблица.РазделУчета,
	|						Таблица.ВидЗапасов
	|					ИЗ
	|						ВтАналитикаНоменклатуры КАК Таблица)) КАК Себестоимость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|
	|	Себестоимость.Количество 			 		КАК КоличествоОстаток,
	|	Себестоимость.ДопРасходы 		 	 		КАК ДопРасходыОстаток,
	|	Себестоимость.ДопРасходыБезНДС 		 		КАК ДопРасходыБезНДСОстаток
	|ПОМЕСТИТЬ ВТКонечныеОстатки
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|		И Себестоимость.РазделУчета = Таблица.РазделУчета
	|		И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|
	|	СУММА(Себестоимость.Количество) КАК КоличествоПриход
	|ПОМЕСТИТЬ ВТПриходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|			И Себестоимость.РазделУчета = Таблица.РазделУчета
	|			И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|	И (Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1) КАК Период,
	|	КонечныеОстатки.Организация,
	|	КонечныеОстатки.АналитикаУчетаНоменклатуры,
	|	КонечныеОстатки.РазделУчета,
	|	КонечныеОстатки.ВидЗапасов,
	|
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) 																		КАК КоличествоОстаток,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) 																		КАК КоличествоОстатокНаКонецПериода,
	|	ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) КАК КоличествоПриход,
	|
	|	0 КАК СтоимостьОстаток,
	|	0 КАК СтоимостьБезНДСОстаток,
	|	0 КАК СтоимостьЗабалансоваяОстаток,
	|	0 КАК ПостояннаяРазницаОстаток,
	|	0 КАК ВременнаяРазницаОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыБезНДСОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ВТКонечныеОстатки КАК КонечныеОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстатки КАК НачальныеОстатки
	|		ПО КонечныеОстатки.Организация = НачальныеОстатки.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = НачальныеОстатки.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета = НачальныеОстатки.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов = НачальныеОстатки.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПриходы КАК Приходы
	|		ПО КонечныеОстатки.Организация = Приходы.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = Приходы.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета = Приходы.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов = Приходы.ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТНачальныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТКонечныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТПриходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	1 
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

	Запрос.Текст =
	"
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваров.Организация                           КАК Организация,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.РазделУчета                           КАК РазделУчета,
	|	СебестоимостьТоваров.ВидЗапасов                            КАК ВидЗапасов,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, День)) КАК Период
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|			ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры   = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|				И СебестоимостьТоваров.РазделУчета 				 = ТаблицаОстатков.РазделУчета
	|				И СебестоимостьТоваров.ВидЗапасов  				 = ТаблицаОстатков.ВидЗапасов
	|				И СебестоимостьТоваров.Организация 				 = ТаблицаОстатков.Организация
	|				И ТаблицаОстатков.КоличествоОстаток <> 0
	|ГДЕ
	|	СебестоимостьТоваров.СлужебноеВидДвиженияПриход
	|	И СебестоимостьТоваров.Стоимость <> 0
	|	И СебестоимостьТоваров.Период < ТаблицаОстатков.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.ВидЗапасов,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Период                                КАК Период,
	|	Себестоимость.Организация                           КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                           КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                            КАК ВидЗапасов,
	|	СУММА(Себестоимость.Количество)        				КАК Количество,
	|	СУММА(Себестоимость.Стоимость)         				КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)   				КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)   		КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.ПостояннаяРазница) 				КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)  				КАК ВременнаяРазница
	|ПОМЕСТИТЬ ТаблицаВнешнихПоступлений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПериодыПартий.Период                                КАК Период,
	|		ПериодыПартий.Организация                           КАК Организация,
	|		ПериодыПартий.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|		ПериодыПартий.РазделУчета                           КАК РазделУчета,
	|		ПериодыПартий.ВидЗапасов                            КАК ВидЗапасов,
	|		ЕСТЬNULL(Себестоимость.Количество, 0)        		КАК Количество,
	|		ЕСТЬNULL(Себестоимость.Стоимость, 0)         		КАК Стоимость,
	|		ЕСТЬNULL(Себестоимость.СтоимостьБезНДС, 0)   		КАК СтоимостьБезНДС,
	|		ЕСТЬNULL(Себестоимость.СтоимостьЗабалансовая, 0)   	КАК СтоимостьЗабалансовая,
	|		ЕСТЬNULL(Себестоимость.ПостояннаяРазница, 0) 		КАК ПостояннаяРазница,
	|		ЕСТЬNULL(Себестоимость.ВременнаяРазница, 0)  		КАК ВременнаяРазница
	|	ИЗ
	|		ТаблицаПериодыПартий КАК ПериодыПартий
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|			ПО ПериодыПартий.АналитикаУчетаНоменклатуры   = Себестоимость.АналитикаУчетаНоменклатуры
	|				И ПериодыПартий.РазделУчета               = Себестоимость.РазделУчета
	|				И ПериодыПартий.ВидЗапасов                = Себестоимость.ВидЗапасов
	|				И ПериодыПартий.Организация               = Себестоимость.Организация
	|				И Себестоимость.СлужебноеВидДвиженияПриход
	|				И (Себестоимость.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	|				И (Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступлениеВнешнее))
	|				И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	) КАК Себестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВнешнихПоступлений.Период КАК Период,
	|	ТаблицаОстатков.Организация,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.РазделУчета,
	|	ТаблицаОстатков.ВидЗапасов,
	|	(ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток > ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ТаблицаОстатков.КоличествоОстаток - ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|		ИНАЧЕ 0 КОНЕЦ) КАК НовыйКоличествоОстаток,
	|	ТаблицаОстатков.КоличествоОстатокНаКонецПериода,
	|	ТаблицаОстатков.КоличествоПриход,
	|
	|	ТаблицаОстатков.СтоимостьОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.Стоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.Стоимость, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьОстаток,
	|
	|	ТаблицаОстатков.СтоимостьБезНДСОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьБезНДС, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьБезНДС, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьБезНДСОстаток,
	|
	|	ТаблицаОстатков.СтоимостьЗабалансоваяОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансовая, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансовая, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьЗабалансоваяОстаток,
	|
	|	ТаблицаОстатков.ПостояннаяРазницаОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.ПостояннаяРазница, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.ПостояннаяРазница, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяПостояннаяРазницаОстаток,
	|
	|	ТаблицаОстатков.ВременнаяРазницаОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.ВременнаяРазница, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.ВременнаяРазница, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяВременнаяРазницаОстаток,
	|
	|	ТаблицаОстатков.СтоимостьДопРасходыОстаток 		 	КАК НоваяСтоимостьДопРасходыОстаток,
	|	ТаблицаОстатков.СтоимостьДопРасходыБезНДСОстаток 	КАК НоваяСтоимостьДопРасходыБезНДСОстаток
	|
	|ПОМЕСТИТЬ ТаблицаНовыхОстатков
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихПоступлений КАК ТаблицаВнешнихПоступлений
	|		ПО ТаблицаОстатков.АналитикаУчетаНоменклатуры 	= ТаблицаВнешнихПоступлений.АналитикаУчетаНоменклатуры
	|			И ТаблицаОстатков.Организация 				= ТаблицаВнешнихПоступлений.Организация
	|			И ТаблицаОстатков.РазделУчета 				= ТаблицаВнешнихПоступлений.РазделУчета
	|			И ТаблицаОстатков.ВидЗапасов  				= ТаблицаВнешнихПоступлений.ВидЗапасов
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаВнешнихПоступлений
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхОстатков.Период,
	|	ТаблицаНовыхОстатков.Организация,
	|	ТаблицаНовыхОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаНовыхОстатков.РазделУчета,
	|	ТаблицаНовыхОстатков.ВидЗапасов,
	|
	|	ТаблицаНовыхОстатков.НовыйКоличествоОстаток КАК КоличествоОстаток,
	|	ТаблицаНовыхОстатков.КоличествоОстатокНаКонецПериода КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаНовыхОстатков.КоличествоПриход,
	|
	|	ТаблицаНовыхОстатков.НоваяСтоимостьОстаток КАК СтоимостьОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьБезНДСОстаток КАК СтоимостьБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьЗабалансоваяОстаток КАК СтоимостьЗабалансоваяОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостояннаяРазницаОстаток КАК ПостояннаяРазницаОстаток,
	|	ТаблицаНовыхОстатков.НоваяВременнаяРазницаОстаток КАК ВременнаяРазницаОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыОстаток КАК СтоимостьДопРасходыОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыБезНДСОстаток КАК СтоимостьДопРасходыБезНДСОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ТаблицаНовыхОстатков КАК ТаблицаНовыхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаНовыхОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ТаблицаПериодыПартий КАК ТаблицаПериодыПартий
	|";
	
	Пока Истина Цикл 
		
		// Максимальное количество выполнений запроса = максимальному количеству поступлений товара на склад.
		РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		РасчетСебестоимостиПротоколРасчета.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
			ПараметрыРасчета,
			РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ТаблицаОстатков"));
		
	КонецЦикла;

	// Выполняется корректировка количества и стоимости внешних приходов в узел.
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаУзлыКорректировки.Организация                КАК Организация,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаУзлыКорректировки.РазделУчета                КАК РазделУчета,
	|	ТаблицаУзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаУзлыКорректировки.КодСтрокиПродукция 		КАК КодСтрокиПродукция,
	|	ТаблицаУзлыКорректировки.Подразделение 				КАК Подразделение,
	|	ТаблицаУзлыКорректировки.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ТаблицаУзлыКорректировки.СтатьяРасходов				КАК СтатьяРасходов,
	|	ТаблицаУзлыКорректировки.АналитикаРасходов			КАК АналитикаРасходов,
	|	ТаблицаУзлыКорректировки.СтоимостьЗнакГраф_1      	КАК СтоимостьЗнакГраф_1,
	|	ТаблицаУзлыКорректировки.СтоимостьЗнакГраф_2    	КАК СтоимостьЗнакГраф_2,
	|	ТаблицаУзлыКорректировки.ВесГраф_1
	|		 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК ВесГраф_1,
	|	ТаблицаУзлыКорректировки.ВесГраф_2
	|		 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК ВесГраф_2,
	
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьГраф_1,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьГраф_2,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьЗабалансовая * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьЗабалансоваяОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьЗабалансовая,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостояннаяРазница * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостояннаяРазницаОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК ПостояннаяРазница,
	|	ТаблицаУзлыКорректировки.ПостояннаяРазницаЗнак,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ВременнаяРазница * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.ВременнаяРазницаОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК ВременнаяРазница,
	|	ТаблицаУзлыКорректировки.ВременнаяРазницаЗнак,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ДопРасходыГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ДопРасходыГраф_1,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаУзлыКорректировки.СтоимостьГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(15,3))
	|				- ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0) КАК ЧИСЛО(15,3))) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ДопРасходыГраф_2 * ТаблицаУзлыКорректировки.ВесГраф_2
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыБезНДСОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_2
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ДопРасходыГраф_2
	|ПОМЕСТИТЬ ВтУзлыКорректировкиВременная
	|ИЗ
	|	ВтУзлыКорректировки КАК ТаблицаУзлыКорректировки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры   = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И ТаблицаУзлыКорректировки.РазделУчета               = ТаблицаОстатков.РазделУчета
	|			И ТаблицаУзлыКорректировки.ВидЗапасов                = ТаблицаОстатков.ВидЗапасов
	|			И ТаблицаУзлыКорректировки.Организация               = ТаблицаОстатков.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.КодСтрокиПродукция 		КАК КодСтрокиПродукция,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтоимостьЗнакГраф_1 КАК СтоимостьЗнакГраф_1,
	|	Т.СтоимостьЗнакГраф_2 КАК СтоимостьЗнакГраф_2,
	|	Т.ВесГраф_1 КАК ВесГраф_1,
	|	Т.ВесГраф_2 КАК ВесГраф_2,
	|	Т.СтоимостьГраф_1 КАК СтоимостьГраф_1,
	|	Т.СтоимостьГраф_2 КАК СтоимостьГраф_2,
	|	Т.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ПостояннаяРазницаЗнак КАК ПостояннаяРазницаЗнак,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	|	Т.ВременнаяРазницаЗнак КАК ВременнаяРазницаЗнак,
	|	Т.ДопРасходыГраф_1 КАК ДопРасходыГраф_1,
	|	Т.ДопРасходыГраф_2 КАК ДопРасходыГраф_2
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|	ВтУзлыКорректировкиВременная КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировкиВременная
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Служебная, этап 3.10
Процедура ПодготовитьДанныеДляРасчетаСтоимостиРеглПоФИФО(ПараметрыРасчета, Запрос)

	// Формирование таблицы узлов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Себестоимость.КоличествоОстаток
	|ПОМЕСТИТЬ ВТНачальныеОстатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|		Организация В (&МассивОрганизаций)
	|		И (АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов) В (
	|			ВЫБРАТЬ
	|				Таблица.АналитикаУчетаНоменклатуры,
	|				Таблица.РазделУчета,
	|				Таблица.ВидЗапасов
	|			ИЗ ВтАналитикаНоменклатуры КАК Таблица)
	|	) КАК Себестоимость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Себестоимость.Количество КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТКонечныеОстатки
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|		И Себестоимость.РазделУчета = Таблица.РазделУчета
	|		И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	СУММА(Себестоимость.Количество) КАК КоличествоПриход,
	|	СУММА(ВЫБОР
	|		КОГДА Себестоимость.Количество = 0
	|		 И НЕ Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|		 И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
	|			Себестоимость.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьДопРасходы
	|ПОМЕСТИТЬ ВТПриходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|			И Себестоимость.РазделУчета = Таблица.РазделУчета
	|			И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1) КАК Период,
	|	КонечныеОстатки.Организация,
	|	КонечныеОстатки.АналитикаУчетаНоменклатуры,
	|	КонечныеОстатки.РазделУчета,
	|	КонечныеОстатки.ВидЗапасов,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОстаток,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОстатокНаКонецПериода,
	|	ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) КАК КоличествоПриход,
	|
	|	0 КАК СтоимостьРеглОстаток,
	|	0 КАК СтоимостьЗабалансоваяРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * ЕСТЬNULL(Приходы.СтоимостьДопРасходы, 0) /
	|					(ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ВТКонечныеОстатки КАК КонечныеОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстатки КАК НачальныеОстатки
	|		ПО КонечныеОстатки.Организация 				 = НачальныеОстатки.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = НачальныеОстатки.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета 				 = НачальныеОстатки.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов 				 = НачальныеОстатки.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПриходы КАК Приходы
	|		ПО КонечныеОстатки.Организация 				 = Приходы.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = Приходы.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета 				 = Приходы.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов 				 = Приходы.ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТНачальныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТКонечныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТПриходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	1 
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

	Запрос.Текст =
	"
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваров.Организация                           КАК Организация,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.РазделУчета                           КАК РазделУчета,
	|	СебестоимостьТоваров.ВидЗапасов                            КАК ВидЗапасов,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, День)) КАК Период
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры 		= ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И СебестоимостьТоваров.РазделУчета 					= ТаблицаОстатков.РазделУчета
	|			И СебестоимостьТоваров.ВидЗапасов  					= ТаблицаОстатков.ВидЗапасов
	|			И СебестоимостьТоваров.Организация 					= ТаблицаОстатков.Организация
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|ГДЕ
	|	СебестоимостьТоваров.СлужебноеВидДвиженияПриход
	|	И НЕ СебестоимостьТоваров.РасчетСебестоимости
	|	И СебестоимостьТоваров.СтоимостьРегл <> 0
	|	И СебестоимостьТоваров.Период < ТаблицаОстатков.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.ВидЗапасов,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПериодыПартий.Организация                         			 КАК Организация,
	|	ПериодыПартий.АналитикаУчетаНоменклатуры          			 КАК АналитикаУчетаНоменклатуры,
	|	ПериодыПартий.РазделУчета                         			 КАК РазделУчета,
	|	ПериодыПартий.ВидЗапасов                          			 КАК ВидЗапасов,
	|	ПериодыПартий.Период                              			 КАК Период,
	|
	|	СУММА(ЕСТЬNULL(Себестоимость.Количество, 0))             	 КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА ЕСТЬNULL(Себестоимость.Количество, 0) <> 0 ТОГДА ЕСТЬNULL(Себестоимость.СтоимостьРегл, 0)
	|		ИНАЧЕ 0 КОНЕЦ
	|	) КАК СтоимостьРегл,
	|	СУММА(ЕСТЬNULL(Себестоимость.СтоимостьЗабалансоваяРегл, 0))  КАК СтоимостьЗабалансоваяРегл
	|
	|ПОМЕСТИТЬ ТаблицаВнешнихПоступлений
	|
	|ИЗ
	|	ТаблицаПериодыПартий КАК ПериодыПартий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|		ПО ПериодыПартий.АналитикаУчетаНоменклатуры 	= Себестоимость.АналитикаУчетаНоменклатуры
	|			И ПериодыПартий.РазделУчета             	= Себестоимость.РазделУчета
	|			И ПериодыПартий.ВидЗапасов              	= Себестоимость.ВидЗапасов
	|			И ПериодыПартий.Организация             	= Себестоимость.Организация
	|			И Себестоимость.СлужебноеВидДвиженияПриход
	|			И (Себестоимость.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	|			И (Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступлениеВнешнее))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыПартий.АналитикаУчетаНоменклатуры,
	|	ПериодыПартий.РазделУчета,
	|	ПериодыПартий.ВидЗапасов,
	|	ПериодыПартий.Организация,
	|	ПериодыПартий.Период
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВнешнихПоступлений.Период КАК Период,
	|	ТаблицаОстатков.Организация,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.РазделУчета,
	|	ТаблицаОстатков.ВидЗапасов,
	|	(ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток > ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ТаблицаОстатков.КоличествоОстаток - ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|		ИНАЧЕ 0 КОНЕЦ) КАК НовыйКоличествоОстаток,
	|	ТаблицаОстатков.КоличествоОстатокНаКонецПериода,
	|	ТаблицаОстатков.КоличествоПриход,
	|
	|	ТаблицаОстатков.СтоимостьРеглОстаток +
	|	ВЫБОР КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0) ТОГДА
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьРегл, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьРегл, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ КАК НоваяСтоимостьРеглОстаток,
	|	ТаблицаОстатков.СтоимостьЗабалансоваяРеглОстаток +
	|	ВЫБОР КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0) ТОГДА
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансоваяРегл, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансоваяРегл, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ КАК НоваяСтоимостьЗабалансоваяРеглОстаток,
	|
	|	ТаблицаОстатков.СтоимостьДопРасходыОстаток КАК НоваяСтоимостьДопРасходыОстаток
	|
	|ПОМЕСТИТЬ ТаблицаНовыхОстатков
	|
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихПоступлений КАК ТаблицаВнешнихПоступлений
	|		ПО ТаблицаОстатков.АналитикаУчетаНоменклатуры 	= ТаблицаВнешнихПоступлений.АналитикаУчетаНоменклатуры
	|			И ТаблицаОстатков.Организация 				= ТаблицаВнешнихПоступлений.Организация
	|			И ТаблицаОстатков.РазделУчета 				= ТаблицаВнешнихПоступлений.РазделУчета
	|			И ТаблицаОстатков.ВидЗапасов  				= ТаблицаВнешнихПоступлений.ВидЗапасов
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаВнешнихПоступлений
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхОстатков.Период,
	|	ТаблицаНовыхОстатков.Организация,
	|	ТаблицаНовыхОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаНовыхОстатков.РазделУчета,
	|	ТаблицаНовыхОстатков.ВидЗапасов,
	|	ТаблицаНовыхОстатков.НовыйКоличествоОстаток          		КАК КоличествоОстаток,
	|	ТаблицаНовыхОстатков.КоличествоОстатокНаКонецПериода 		КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаНовыхОстатков.КоличествоПриход				 		КАК КоличествоПриход,
	|
	|	ТаблицаНовыхОстатков.НоваяСтоимостьРеглОстаток       		КАК СтоимостьРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьЗабалансоваяРеглОстаток 	КАК СтоимостьЗабалансоваяРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыОстаток 		КАК СтоимостьДопРасходыОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|
	|ИЗ
	|	ТаблицаНовыхОстатков КАК ТаблицаНовыхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаНовыхОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ТаблицаПериодыПартий КАК ТаблицаПериодыПартий
	|";
	
	Пока Истина Цикл 
		
		// Максимальное количество выполнений запроса = максимальному количеству поступлений товара на склад.
		РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		РасчетСебестоимостиПротоколРасчета.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
			ПараметрыРасчета,
			РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ТаблицаОстатков"));
		
	КонецЦикла;

	// Выполняется корректировка количества и стоимости внешних приходов в узел.
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаУзлыКорректировки.Организация                КАК Организация,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаУзлыКорректировки.РазделУчета                КАК РазделУчета,
	|	ТаблицаУзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаУзлыКорректировки.КодСтрокиПродукция 		КАК КодСтрокиПродукция,
	|	ТаблицаУзлыКорректировки.Подразделение 				КАК Подразделение,
	|	ТаблицаУзлыКорректировки.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ТаблицаУзлыКорректировки.СтатьяРасходов				КАК СтатьяРасходов,
	|	ТаблицаУзлыКорректировки.АналитикаРасходов			КАК АналитикаРасходов,
	|	ТаблицаУзлыКорректировки.СтоимостьЗнакГраф_1       	КАК СтоимостьЗнакГраф_1,
	|	ТаблицаУзлыКорректировки.СтоимостьЗнакГраф_2    	КАК СтоимостьЗнакГраф_2,
	|	ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК ВесГраф_1,
	|	ТаблицаУзлыКорректировки.ВесГраф_2
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК ВесГраф_2,
	|
	|	(ВЫБОР КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|	ТОГДА
	|		0
	|	КОГДА (ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)) = 0
	|		И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|		ТОГДА 0	
	|	ИНАЧЕ
	|		(ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0))
	|		/(ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ)
	|	+ (
	|	ВЫБОР КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|	ТОГДА
	|		0
	|	КОГДА (ТаблицаУзлыКорректировки.СтоимостьГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)) = 0
	|		И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|		ТОГДА 0	
	|	ИНАЧЕ
	|		(ТаблицаУзлыКорректировки.ДопРасходыГраф_1 * ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0))
	|		/(ТаблицаУзлыКорректировки.ВесГраф_1
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ) КАК СтоимостьГраф_1,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьЗабалансовая * ТаблицаУзлыКорректировки.ВесГраф_1
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьЗабалансоваяРеглОстаток, 0)) 
	|			 	 /(ТаблицаУзлыКорректировки.ВесГраф_1
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьЗабалансовая,
	|	
	|	ТаблицаУзлыКорректировки.ПостояннаяРазница         КАК ПостояннаяРазница,
	|	ТаблицаУзлыКорректировки.ПостояннаяРазницаЗнак,
	|	ТаблицаУзлыКорректировки.ВременнаяРазница          КАК ВременнаяРазница,
	|	ТаблицаУзлыКорректировки.ВременнаяРазницаЗнак
	|ПОМЕСТИТЬ ВтУзлыКорректировкиВременная
	|ИЗ
	|	ВтУзлыКорректировки КАК ТаблицаУзлыКорректировки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры 	 = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И ТаблицаУзлыКорректировки.РазделУчета             	 = ТаблицаОстатков.РазделУчета
	|			И ТаблицаУзлыКорректировки.ВидЗапасов              	 = ТаблицаОстатков.ВидЗапасов
	|			И ТаблицаУзлыКорректировки.Организация           	 = ТаблицаОстатков.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтоимостьЗнакГраф_1 КАК СтоимостьЗнакГраф_1,
	|	Т.СтоимостьЗнакГраф_2 КАК СтоимостьЗнакГраф_2,
	|	Т.ВесГраф_1 КАК ВесГраф_1,
	|	Т.ВесГраф_2 КАК ВесГраф_2,
	|	Т.СтоимостьГраф_1 КАК СтоимостьГраф_1,
	|	0 КАК СтоимостьГраф_2,
	|	Т.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	0 КАК ДопРасходыГраф_1,
	|	0 КАК ДопРасходыГраф_2,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ПостояннаяРазницаЗнак КАК ПостояннаяРазницаЗнак,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	|	Т.ВременнаяРазницаЗнак КАК ВременнаяРазницаЗнак
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|	ВтУзлыКорректировкиВременная КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировкиВременная
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Этап 3.7, 3.11
Процедура РассчитатьСтоимость(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РассчитатьСтоимость" + ?(РасчетСтоимостиРегл, "(Регл)", ""));
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = ?(РасчетСтоимостиРегл,
		ТекстЗапросаДвиженияСтоимостиРегл(ПараметрыРасчета),
		ТекстЗапросаДвиженияСтоимости(ПараметрыРасчета));
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	
	РешитьСЛУПлатформой(ПараметрыРасчета, РасчетСтоимостиРегл);
	
КонецПроцедуры

// Служебная, этап 3.7
Функция ТекстЗапросаДвиженияСтоимости(ПараметрыРасчета)

	ТекстЗапроса = 
	"
	// В качестве вектора решений на первой итерации берутся свободные коэффициенты.
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                             	КАК НомерУзла,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_1 КАК ЧИСЛО(28,10))                КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_1 КАК ЧИСЛО(28,10))        		КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьЗабалансовая КАК ЧИСЛО(28,10))      	КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостояннаяРазница КАК ЧИСЛО(28,10))          	КАК ПостояннаяРазница,
	|	УзлыКорректировки.ПостояннаяРазницаЗнак                                 	КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВременнаяРазница КАК ЧИСЛО(28,10))           	КАК ВременнаяРазница,
	|	УзлыКорректировки.ВременнаяРазницаЗнак                                  	КАК ВременнаяРазницаЗнак,
	|	УзлыКорректировки.СтоимостьЗнакГраф_1                                       КАК СтоимостьЗнакГраф_1,
	
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_2 КАК ЧИСЛО(28,10))   				КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_2 КАК ЧИСЛО(28,10))   			КАК ДопРасходыГраф_2,
	|	УзлыКорректировки.СтоимостьЗнакГраф_2                                      	КАК СтоимостьЗнакГраф_2
	|ПОМЕСТИТЬ ВтТаблицаРешений
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// Подготовим таблицу списаний за период (коэффициенты уравнения)
	|ВЫБРАТЬ
	|	УчетСебестоимости.НомерУзлаИсточник 				КАК НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник 				КАК НомерУзлаПриемник,
	|	ЛОЖЬ 												КАК ПередачаВЭксплуатацию,
	|	ИСТИНА												КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 												КАК КосвенныеЗатратыНУ,
	|	СУММА(УчетСебестоимости.ВесДугиГраф_1)				КАК ВесДугиГраф_1,
	|	СУММА(УчетСебестоимости.ВесДугиГраф_2)				КАК ВесДугиГраф_2
	|
	|ПОМЕСТИТЬ ВтПеремещенияСписания
	|ИЗ (
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет))
	|			ТОГДА УзлыКорректировкиПриемникРеглУчет.НомерУзла
	|		КОГДА УчетСебестоимости.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|			УзлыКорректировкиПриемникПередачи.НомерУзла
	|		ИНАЧЕ
	|			УзлыКорректировкиПриемник.НомерУзла
	|		КОНЕЦ КАК НомерУзлаПриемник,
	|		УчетСебестоимости.Количество КАК ВесДугиГраф_1,
	|		УчетСебестоимости.Количество КАК ВесДугиГраф_2
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета               = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация               = УзлыКорректировкиИсточник.Организация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 				 = УзлыКорректировкиПриемник.Организация
	|			И УчетСебестоимости.КорОрганизация 				 = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемникПередачи
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемникПередачи.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемникПередачи.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемникПередачи.ВидЗапасов
	|			И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемникПередачи.Организация
	|			И УчетСебестоимости.КорОрганизация 				 <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И УчетСебестоимости.РазделУчета 				 <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемникРеглУчет
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 				 = УзлыКорректировкиПриемникРеглУчет.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемникРеглУчет.ВидЗапасов
	|			И УчетСебестоимости.КорОрганизация				 = УзлыКорректировкиПриемникРеглУчет.Организация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	|	ГДЕ
	|		НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И НЕ (УчетСебестоимости.Сторно И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода))
	|		И НЕ (УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			И УчетСебестоимости.Количество < 0
	|			И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL)
	|		И (УзлыКорректировкиПриемник.НомерУзла ЕСТЬ НЕ NULL
	|			ИЛИ УзлыКорректировкиПриемникПередачи.НомерУзла ЕСТЬ НЕ NULL
	|			ИЛИ УзлыКорректировкиПриемникРеглУчет.НомерУзла ЕСТЬ НЕ NULL)
	// Исключим перемещения в тот же самый узел, кроме выпуска продукции
	|		И ((УзлыКорректировкиИсточник.НомерУзла <> 
	|			ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет))
	|				ТОГДА УзлыКорректировкиПриемникРеглУчет.НомерУзла
	|			КОГДА УчетСебестоимости.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|				УзлыКорректировкиПриемникПередачи.НомерУзла
	|			ИНАЧЕ
	|				УзлыКорректировкиПриемник.НомерУзла
	|			КОНЕЦ)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
	|		-УчетСебестоимости.Количество КАК ВесДугиГраф_1,
	|		-УчетСебестоимости.Количество КАК ВесДугиГраф_2
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета                  = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация                  = УзлыКорректировкиИсточник.Организация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 			  = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов 				  = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 			  = УзлыКорректировкиПриемник.Организация
	|	ГДЕ
	|		НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|		И УзлыКорректировкиИсточник.НомерУзла <> УзлыКорректировкиПриемник.НомерУзла
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
	|		УчетСебестоимости.Количество		КАК ВесДугиГраф_1,
	|		УчетСебестоимости.Количество 		КАК ВесДугиГраф_2
	|	ИЗ
	|		ВтПередачиТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 			  = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов 				  = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация 			  = УзлыКорректировкиИсточник.Организация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемник.Организация
	|	ГДЕ
	|		УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	) КАК УчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник
	|";

	
	ТекстЗапроса = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	
	Возврат ТекстЗапроса;

КонецФункции

// Служебная, этап 3.11
Функция ТекстЗапросаДвиженияСтоимостиРегл(ПараметрыРасчета)

	ТекстЗапроса = 
	"
	// В качестве вектора решений на первой итерации берутся свободные коэффициенты.
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                            		КАК НомерУзла,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_1 КАК ЧИСЛО(28,10))                КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_1 КАК ЧИСЛО(28,10))       		КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостояннаяРазница КАК ЧИСЛО(28,10))         		КАК ПостояннаяРазница,
	|	УзлыКорректировки.ПостояннаяРазницаЗнак                                		КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВременнаяРазница КАК ЧИСЛО(28,10))          		КАК ВременнаяРазница,
	|	УзлыКорректировки.ВременнаяРазницаЗнак                                 		КАК ВременнаяРазницаЗнак,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьЗабалансовая КАК ЧИСЛО(28,10))     		КАК СтоимостьЗабалансовая,
	|	УзлыКорректировки.СтоимостьЗнакГраф_1                                       КАК СтоимостьЗнакГраф_1,
	
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_2 КАК ЧИСЛО(28,10))           		КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_2 КАК ЧИСЛО(28,10)) 				КАК ДопРасходыГраф_2,
	|	УзлыКорректировки.СтоимостьЗнакГраф_2                                     	КАК СтоимостьЗнакГраф_2
	|ПОМЕСТИТЬ ВтТаблицаРешений
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// Подготовим таблицу списаний за период (коэффициенты уравнения)
	|ВЫБРАТЬ
	|	УчетСебестоимости.НомерУзлаИсточник 			  		КАК НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник 			  		КАК НомерУзлаПриемник,
	|	УчетСебестоимости.ПередачаВЭксплуатацию           		КАК ПередачаВЭксплуатацию,
	|	МАКСИМУМ(УчетСебестоимости.ПринимаемыеВНУ)        		КАК ПринимаемыеВНУ,
	|	МАКСИМУМ(УчетСебестоимости.КосвенныеЗатратыНУ) 	  		КАК КосвенныеЗатратыНУ,
	|	СУММА(УчетСебестоимости.ВесДугиГраф_1) 			  		КАК ВесДугиГраф_1,
	|	СУММА(УчетСебестоимости.ВесДугиГраф_2) 			  		КАК ВесДугиГраф_2
	|ПОМЕСТИТЬ ВтПеремещенияСписания
	|ИЗ (
	|ВЫБРАТЬ
	|	УзлыКорректировкиИсточник.НомерУзла   КАК НомерУзлаИсточник,
	|	УзлыКорректировкиПриемник.НомерУзла   КАК НомерУзлаПриемник,
	|	УчетСебестоимости.Количество          КАК ВесДугиГраф_1,
	|	УчетСебестоимости.Количество          КАК ВесДугиГраф_2,
	|	ЛОЖЬ 								  КАК ПередачаВЭксплуатацию,
	|	ИСТИНА 								  КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								  КАК КосвенныеЗатратыНУ
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры   = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета  			  = УзлыКорректировкиИсточник.РазделУчета
	|		И УчетСебестоимости.ВидЗапасов  			  = УзлыКорректировкиИсточник.ВидЗапасов
	|		И УчетСебестоимости.Организация  			  = УзлыКорректировкиИсточник.Организация
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|	ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры   = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.КорРазделУчета 			  	 = УзлыКорректировкиПриемник.РазделУчета
	|		И УчетСебестоимости.КорВидЗапасов 			  	 = УзлыКорректировкиПриемник.ВидЗапасов
	|		И УчетСебестоимости.Организация 			  	 = УзлыКорректировкиПриемник.Организация
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И НЕ (УчетСебестоимости.Сторно И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода))
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И УчетСебестоимости.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И НЕ (УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И УчетСебестоимости.Количество < 0
	|		И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL)

	// Исключим перемещения в тот же самый узел, кроме выпуска продукции
	|	И (УзлыКорректировкиИсточник.НомерУзла <> УзлыКорректировкиПриемник.НомерУзла
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
	|		-УчетСебестоимости.Количество КАК ВесДугиГраф_1,
	|		-УчетСебестоимости.Количество КАК ВесДугиГраф_2,
	|		ЛОЖЬ КАК ПередачаВЭксплуатацию,
	|		ИСТИНА КАК ПринимаемыеВНУ,
	|		ЛОЖЬ КАК КосвенныеЗатратыНУ
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета                  = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация                  = УзлыКорректировкиИсточник.Организация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 			  = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов 				  = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 			  = УзлыКорректировкиПриемник.Организация
	|	ГДЕ
	|		НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|		И УзлыКорректировкиИсточник.НомерУзла <> УзлыКорректировкиПриемник.НомерУзла
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировкиИсточник.НомерУзла   КАК НомерУзлаИсточник,
	|	УзлыКорректировкиПриемник.НомерУзла   КАК НомерУзлаПриемник,
	|	УчетСебестоимости.Количество          КАК ВесДугиГраф_1,
	|	УчетСебестоимости.Количество          КАК ВесДугиГраф_2,
	|	ЛОЖЬ 								  КАК ПередачаВЭксплуатацию,
	|	ИСТИНА 								  КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								  КАК КосвенныеЗатратыНУ
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры   = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета  			  = УзлыКорректировкиИсточник.РазделУчета
	|		И УчетСебестоимости.ВидЗапасов  			  = УзлыКорректировкиИсточник.ВидЗапасов
	|		И УчетСебестоимости.Организация  			  = УзлыКорректировкиИсточник.Организация
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|	ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры   = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|		И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|		И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемник.Организация
	|
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|	И УчетСебестоимости.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И НЕ (УчетСебестоимости.Сторно И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода))
	|	) КАК УчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник,
	|	УчетСебестоимости.ПередачаВЭксплуатацию
	|";
	
	ТекстЗапроса = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область РешениеСЛУПлатформой

// Служебная, этап 3.7, 3.11
// Процедура выполняет расчет себестоимости аналитики номенклатуры в узлах корректировки стоимости списания.
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешений", содержащая себестоимость
// в каждом узле корректировки.
//
Процедура РешитьСЛУПлатформой(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	// Система линейных уравнений в простейшем виде выглядит так:
	//	a11*X1 + a12*X2 = b1*Y1
	//	a21*X1 + a22*X2 = b2*Y2
	//
	// Где:
	//	X1, X2		- переменные
	//	a11, a22	- веса переменных главной диагонали
	//  a12, a21	- веса обычных переменных
	//	Y1, Y2		- свободные коэффициенты
	//	b1, b2		- веса свободных коэффициентов
	//
	// В таблице ВтУзлыКорректировки расположены "Свободные коэффициенты" и их веса, 
	// которые равны "весам переменных главной диагонали" (a11=b1, a22=b2)
	//
	// В таблице ВтПеремещенияСписания находятся "веса обычных переменных"
	//
	// В результате решения СЛУ получается таблица ВтТаблицаРешений, содержащая значения X1, X2
	//
	// Подробное описание механизма см. https://its.1c.ru/db/v8314doc#bookmark:dev:TI000002121
	//
	
	// Решаются независимые системы уравнений графа 1
	РешитьСЛУПлатформойБазовыеЗначенияГраф_1(ПараметрыРасчета);
	
	// Решаются независимые системы уравнений графа 2
	РешитьСЛУПлатформойБазовыеЗначенияГраф_2(ПараметрыРасчета);
	
	// Решаются системы уравнений для временных и постоянных разниц.
	// Зависят от результатов РешитьСЛУПлатформойБазовыеЗначенияГраф_1 и РешитьСЛУПлатформойПостатейные
	РешитьСЛУПлатформойРазницы(ПараметрыРасчета, РасчетСтоимостиРегл);
	
	// Объединение решений всех систем в ВтТаблицаРешений
	РешитьСЛУПлатформойОбъединитьРешения(ПараметрыРасчета, РасчетСтоимостиРегл);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//		СтоимостьГраф_1, ДопРасходыГраф_1, ТрудозатратыГраф_1, СтоимостьЗабалансовая
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаБазовыхРешенийГраф_1"
//
Процедура РешитьСЛУПлатформойБазовыеЗначенияГраф_1(ПараметрыРасчета)
	
	ПояснениеДляЗамера = НСтр("ru = 'Решение для базовых значений (граф 1)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ЗапросУзлы = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла																			КАК НомерУзла,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_1 * УзлыКорректировки.ВесГраф_1 
	|				* УзлыКорректировки.СтоимостьЗнакГраф_1 КАК ЧИСЛО(28,10))								КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_1 * УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))			КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьЗабалансовая * УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10))	КАК СтоимостьЗабалансовая
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	                                          
	ЗапросСвязи = Новый Запрос();
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьГраф_1,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиДопРасходыГраф_1,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьЗабалансовая
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК ВтУзлыКорректировки
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтУзлыКорректировки.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.НомерУзлаИсточник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьЗабалансовая
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	// корректируем стоимости узлов с нулевым весом
	СтруктураПолейСЛУ = Новый Структура;
	СтруктураПолейСЛУ.Вставить("ВесДугиСтоимостьГраф_1", "СтоимостьГраф_1");
	СтруктураПолейСЛУ.Вставить("ВесДугиДопРасходыГраф_1", "ДопРасходыГраф_1");
	СтруктураПолейСЛУ.Вставить("ВесДугиСтоимостьЗабалансовая", "СтоимостьЗабалансовая");

	РасчетСебестоимостиПрикладныеАлгоритмы.СкорректироватьСтоимостьУзловСЛУИзЗапросов(
		ПараметрыРасчета,
		ЗапросУзлы,
		"НомерУзла",
		ЗапросСвязи,
		"НомерУзлаИсточник, НомерУзлаПриемник",
		СтруктураПолейСЛУ,
		ПояснениеДляЗамера);
	
	// источники данных
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = РасчетСебестоимостиРешениеСЛУ.ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьГраф_1";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьГраф_1";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ДопРасходыГраф_1";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиДопРасходыГраф_1";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьЗабалансовая";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьЗабалансовая";
	
	// решение
	ТаблицаРешений = РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьСистемыЛинейныхУравнений(ПараметрыРасчета, РасчетСистемЛинейныхУравнений);
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"СтоимостьГраф_1, ДопРасходыГраф_1, СтоимостьЗабалансовая");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
	Запрос = Новый Запрос();
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ДопРасходыГраф_1, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_1,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансовая,
	|	1 КАК СтоимостьЗнакГраф_1
	|
	|ПОМЕСТИТЬ ВтТаблицаБазовыхРешенийГраф_1
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|	ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаРешений 
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//		СтоимостьГраф_2, ДопРасходыГраф_2, ТрудозатратыГраф_2
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаБазовыхРешенийГраф_2"
//
Процедура РешитьСЛУПлатформойБазовыеЗначенияГраф_2(ПараметрыРасчета)
	
	ПояснениеДляЗамера = НСтр("ru = 'Решение для базовых значений (граф 2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ЗапросУзлы = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла																			КАК НомерУзла,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьГраф_2 * УзлыКорректировки.ВесГраф_2 
	|			* УзлыКорректировки.СтоимостьЗнакГраф_2 КАК ЧИСЛО(28,10))									КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ДопРасходыГраф_2 * УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10))			КАК ДопРасходыГраф_2
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	                                          
	ЗапросСвязи = Новый Запрос();
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_2, 0) КАК ЧИСЛО(28,10))) КАК ВесДугиСтоимостьГраф_2,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_2, 0) КАК ЧИСЛО(28,10))) КАК ВесДугиДопРасходыГраф_2
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК ВтУзлыКорректировки
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтУзлыКорректировки.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.НомерУзлаИсточник ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещенияСписания.НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьГраф_2,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_2 КАК ЧИСЛО(28,10)) КАК ВесДугиДопРасходыГраф_2
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	// корректируем стоимости узлов с нулевым весом
	СтруктураПолейСЛУ = Новый Структура;
	СтруктураПолейСЛУ.Вставить("ВесДугиСтоимостьГраф_2", "СтоимостьГраф_2");
	СтруктураПолейСЛУ.Вставить("ВесДугиДопРасходыГраф_2", "ДопРасходыГраф_2");

	РасчетСебестоимостиПрикладныеАлгоритмы.СкорректироватьСтоимостьУзловСЛУИзЗапросов(
		ПараметрыРасчета,
		ЗапросУзлы,
		"НомерУзла",
		ЗапросСвязи,
		"НомерУзлаИсточник, НомерУзлаПриемник",
		СтруктураПолейСЛУ,
		ПояснениеДляЗамера);
	
	// источники данных
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = РасчетСебестоимостиРешениеСЛУ.ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьГраф_2";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьГраф_2";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ДопРасходыГраф_2";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиДопРасходыГраф_2";
	
	// решение для базовых значений
	ТаблицаРешений = РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьСистемыЛинейныхУравнений(ПараметрыРасчета, РасчетСистемЛинейныхУравнений);
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"СтоимостьГраф_2, ДопРасходыГраф_2",
		Новый Структура("СтоимостьЗнакГраф_2", "1"),
		"ВтТаблицаБазовыхРешенийГраф_2");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
КонецПроцедуры

// Выполняет шаг расчета систем уравнений для показателей:
//		ВременнаяРазница, ПостояннаяРазница
// Результатом работы данной процедуры будут временные таблицы "ВтТаблицаРешенийВР" И "ВтТаблицаРешенийПР"
//
Процедура РешитьСЛУПлатформойРазницыШаг(ПараметрыРасчета, РасчетСтоимостиРегл, НомерШага)
	
	ШаблонПояснениеДляЗамера = НСтр("ru = 'Решение для %1 (шаг %2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	// Необходимо посчитать отклонения свободных коэффициентов. Описание см. в РешитьСЛУПлатформойБазовыеЗначенияГраф_1
	
	// Сначала считается постоянная разница, а затем временная
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                      КАК НомерУзла,
	
	|	ВЫРАЗИТЬ(СУММА
	|		(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(НЕ ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ) ТОГДА
	|					%1 - ЕСТЬNULL(ВтТаблицаРешенийВР.ВременнаяРазница, 0)
	|			ИНАЧЕ 
	|				0
	|		КОНЕЦ * ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0)
	|		) 
	|	КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница_Отклонение
	
	|
	|ПОМЕСТИТЬ ОтклоненияСвободныхКоэффициентовПР
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК ПеремещенияСписания
	|		ПО УзлыКорректировки.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_1 КАК ВтТаблицаБазовыхРешенийГраф_1
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаБазовыхРешенийГраф_1.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийВР КАК ВтТаблицаРешенийВР
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаРешенийВР.НомерУзла
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|";
	
	ТекстБУ = "
	|					ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.СтоимостьГраф_1, 0) 
	|					+ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ДопРасходыГраф_1, 0)
	|";
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, ТекстБУ);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	ЗапросУзлы = Новый Запрос();
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|
	|	УзлыКорректировки.ПостояннаяРазница * УзлыКорректировки.ВесГраф_1 * УзлыКорректировки.ПостояннаяРазницаЗнак
	|		+ ЕСТЬNULL(ОтклоненияСвободныхКоэффициентовПР.ПостояннаяРазница_Отклонение, 0) КАК ПостояннаяРазница
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОтклоненияСвободныхКоэффициентовПР КАК ОтклоненияСвободныхКоэффициентовПР
	|		ПО УзлыКорректировки.НомерУзла = ОтклоненияСвободныхКоэффициентовПР.НомерУзла
	|";
	
	ЗапросСвязи = Новый Запрос();
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ) ТОГДА 0
	|		КОГДА ЕСТЬNULL(НЕ ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиПостояннаяРазница
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК ВтУзлыКорректировки
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтУзлыКорректировки.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.НомерУзлаИсточник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиПостояннаяРазница
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	ПояснениеДляЗамера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПояснениеДляЗамера, НСтр("ru = 'ПР'", ОбщегоНазначения.КодОсновногоЯзыка()), НомерШага);
	
	// корректируем стоимости узлов с нулевым весом
	СтруктураПолейСЛУ = Новый Структура;
	СтруктураПолейСЛУ.Вставить("ВесДугиПостояннаяРазница", "ПостояннаяРазница");

	РасчетСебестоимостиПрикладныеАлгоритмы.СкорректироватьСтоимостьУзловСЛУИзЗапросов(
		ПараметрыРасчета,
		ЗапросУзлы,
		"НомерУзла",
		ЗапросСвязи,
		"НомерУзлаИсточник, НомерУзлаПриемник",
		СтруктураПолейСЛУ,
		ПояснениеДляЗамера);
	
	// источники данных
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = РасчетСебестоимостиРешениеСЛУ.ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ПостояннаяРазница";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиПостояннаяРазница";
	
	// решение
	ТаблицаРешений = РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьСистемыЛинейныхУравнений(ПараметрыРасчета, РасчетСистемЛинейныхУравнений);
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"ПостояннаяРазница");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ПостояннаяРазница, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница
	|
	|ПОМЕСТИТЬ ВтТаблицаРешенийПР
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|	ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаРешений 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтклоненияСвободныхКоэффициентовПР
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	// Временная разница
	
	Запрос.Текст = " 
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                      КАК НомерУзла,
	|
	|	ВЫРАЗИТЬ(СУММА
	|       (
	|		(
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) И НЕ ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) ТОГДА	
	|				 -1 * (%1) + ЕСТЬNULL(ВтТаблицаРешенийПР.ПостояннаяРазница, 0)
	|			ИНАЧЕ
	|				0 
	|		КОНЕЦ +
	|       ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ИСТИНА) ТОГДА 
	|				%1 - ЕСТЬNULL(ВтТаблицаРешенийПР.ПостояннаяРазница, 0)
	|			ИНАЧЕ 
	|				0
	|		КОНЕЦ) * ЕСТЬNULL(ПеремещенияСписания.ВесДугиГраф_1, 0)
	|		)
	|	КАК ЧИСЛО(28,10)) КАК ВременнаяРазница_Отклонение
	|
	|
	|ПОМЕСТИТЬ ОтклоненияСвободныхКоэффициентовВР
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК ПеремещенияСписания
	|		ПО УзлыКорректировки.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_1 КАК ВтТаблицаБазовыхРешенийГраф_1
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаБазовыхРешенийГраф_1.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПР КАК ВтТаблицаРешенийПР
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаРешенийПР.НомерУзла
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|
	|";	
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, ТекстБУ);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|
	|	УзлыКорректировки.ВременнаяРазница * УзлыКорректировки.ВесГраф_1 * УзлыКорректировки.ВременнаяРазницаЗнак
	|		+ ЕСТЬNULL(ОтклоненияСвободныхКоэффициентовВР.ВременнаяРазница_Отклонение, 0) КАК ВременнаяРазница
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОтклоненияСвободныхКоэффициентовВР КАК ОтклоненияСвободныхКоэффициентовВР
	|		ПО УзлыКорректировки.НомерУзла = ОтклоненияСвободныхКоэффициентовВР.НомерУзла
	|";
	
	ЗапросСвязи = Новый Запрос();
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(
	|       ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) И НЕ ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) ТОГДА	
	|					ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|			ИНАЧЕ 0 
	|		КОНЕЦ
	|       + ВЫБОР
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
	|			КОГДА ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ИСТИНА) ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДугиГраф_1, 0)
	|		КОНЕЦ
	|			
	|	КАК ЧИСЛО(28,10)) КАК ВесДугиВременнаяРазница
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК ВтУзлыКорректировки
	|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтУзлыКорректировки.НомерУзла
	|
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.НомерУзлаИсточник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесГраф_1 КАК ЧИСЛО(28,10)) КАК ВесДугиВременнаяРазница
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	
	ПояснениеДляЗамера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПояснениеДляЗамера, НСтр("ru = 'ВР'", ОбщегоНазначения.КодОсновногоЯзыка()), НомерШага);
	
	// корректируем стоимости узлов с нулевым весом
	СтруктураПолейСЛУ = Новый Структура;
	СтруктураПолейСЛУ.Вставить("ВесДугиВременнаяРазница", "ВременнаяРазница");

	РасчетСебестоимостиПрикладныеАлгоритмы.СкорректироватьСтоимостьУзловСЛУИзЗапросов(
		ПараметрыРасчета,
		ЗапросУзлы,
		"НомерУзла",
		ЗапросСвязи,
		"НомерУзлаИсточник, НомерУзлаПриемник",
		СтруктураПолейСЛУ,
		ПояснениеДляЗамера);
	
	// источники данных
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = РасчетСебестоимостиРешениеСЛУ.ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ВременнаяРазница";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиВременнаяРазница";
	
	// решение
	ТаблицаРешений = РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьСистемыЛинейныхУравнений(ПараметрыРасчета, РасчетСистемЛинейныхУравнений);
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"ВременнаяРазница",
		Новый Структура("ВременнаяРазницаЗнак", "1"),
		"ВтТаблицаРешенийВР");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ОтклоненияСвободныхКоэффициентовВР");
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//		ВременнаяРазница, ПостояннаяРазница
// Результатом работы данной процедуры будут временные таблицы "ВтТаблицаРешенийВР" И "ВтТаблицаРешенийПР"
//
Процедура РешитьСЛУПлатформойРазницы(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК НомерУзла,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(1 КАК ЧИСЛО(1)) КАК ПостояннаяРазницаЗнак
	|	
	|ПОМЕСТИТЬ
	|	ВтТаблицаРешенийПР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК НомерУзла,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10)) КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(1 КАК ЧИСЛО(1)) КАК ВременнаяРазницаЗнак
	|	
	|ПОМЕСТИТЬ
	|	ВтТаблицаРешенийВР
	|";
	
	Запрос.Выполнить();
		
	// Показатели имеют смысл только для регламентированного учета в окончательном расчете
	Если НЕ РасчетСтоимостиРегл ИЛИ ПараметрыРасчета.ПредварительныйРасчет Тогда
		Возврат;
	КонецЕсли;
	
	// Выполняется два шага расчета разниц, т.к. для одних случаев надо сначала посчитать ПР, а от нее ВР
	// для других - наоборот
	РешитьСЛУПлатформойРазницыШаг(ПараметрыРасчета, РасчетСтоимостиРегл, 1);
	РешитьСЛУПлатформойРазницыШаг(ПараметрыРасчета, РасчетСтоимостиРегл, 2)
	
КонецПроцедуры

// Объединяет все этапы решений в таблицу ВтТаблицаРешений
//
Процедура РешитьСЛУПлатформойОбъединитьРешения(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|
	|УНИЧТОЖИТЬ ВтТаблицаРешений
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.СтоимостьГраф_1, 0) КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_1,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.ДопРасходыГраф_1, 0) КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_1,
	|	ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК СтоимостьЗнакГраф_1,
	|
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_1.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансовая,
	
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.СтоимостьГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьГраф_2,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаБазовыхРешенийГраф_2.ДопРасходыГраф_2, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ДопРасходыГраф_2,
	|	ВЫБОР КОГДА УзлыКорректировки.ВесГраф_2 = 0 ТОГДА 0 ИНАЧЕ 1 КОНЕЦ  КАК СтоимостьЗнакГраф_2,
	
	|	ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК ВременнаяРазницаЗнак,
	|	ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК ПостояннаяРазницаЗнак,
	|
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешенийПР.ПостояннаяРазница, 0) КАК ЧИСЛО(28,10)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыКорректировки.ВесГраф_1 = 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ВтТаблицаРешенийВР.ВременнаяРазница, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВременнаяРазница
	|	
	|ПОМЕСТИТЬ ВтТаблицаРешенийПредварительная
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_1 КАК ВтТаблицаБазовыхРешенийГраф_1
	|		ПО ВтТаблицаБазовыхРешенийГраф_1.НомерУзла = УзлыКорректировки.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаБазовыхРешенийГраф_2 КАК ВтТаблицаБазовыхРешенийГраф_2
	|		ПО ВтТаблицаБазовыхРешенийГраф_2.НомерУзла = УзлыКорректировки.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПР КАК ВтТаблицаРешенийПР
	|		ПО ВтТаблицаРешенийПР.НомерУзла = УзлыКорректировки.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешенийВР КАК ВтТаблицаРешенийВР
	|		ПО ВтТаблицаРешенийВР.НомерУзла = УзлыКорректировки.НомерУзла
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаБазовыхРешенийГраф_1
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаБазовыхРешенийГраф_2
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаРешенийПР
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТаблицаРешенийВР
	|";
	
	Если ПараметрыРасчета.РешениеСЛУ.ЗащитаОтПереполненияПоля = 0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"ВтТаблицаРешенийПредварительная",
			"ВтТаблицаРешений");
		
	Иначе
		
		Запрос.Текст = Запрос.Текст
		+ "
		|;
		|
		|/////////////////////////////////////////////////////////////////////////////////
		|";
		
		Запрос.Текст = Запрос.Текст
		+ "ВЫБРАТЬ
		|	Т.НомерУзла,
		|	Т.Организация КАК Организация,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.РазделУчета КАК РазделУчета,
		|	Т.ВидЗапасов КАК ВидЗапасов
		|ПОМЕСТИТЬ ВТУзлыСПереполнениемПоля
		|ИЗ
		|	ВтУзлыКорректировки КАК Т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаРешенийПредварительная КАК Отбор
		|		ПО Т.НомерУзла = Отбор.НомерУзла
		|ГДЕ
		| НЕ (Отбор.СтоимостьГраф_1 МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|	  И Отбор.ДопРасходыГраф_1 МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|	  И Отбор.СтоимостьЗабалансовая МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|	  И Отбор.СтоимостьГраф_2 МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|	  И Отбор.ДопРасходыГраф_2 МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|	  И Отбор.ПостояннаяРазница МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|	  И Отбор.ВременнаяРазница МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля)
		|ИНДЕКСИРОВАТЬ ПО
		|	Т.НомерУзла";
		
		Запрос.Текст = Запрос.Текст
		+ "
		|;
		|
		|/////////////////////////////////////////////////////////////////////////////////
		|";
		
		Запрос.Текст = Запрос.Текст
		+ "ВЫБРАТЬ
		|	Т.НомерУзла 				КАК НомерУзла,
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА Т.СтоимостьГраф_1 МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|		ТОГДА Т.СтоимостьГраф_1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(28,10)) 	КАК СтоимостьГраф_1,
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА Т.ДопРасходыГраф_1 МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|		ТОГДА Т.ДопРасходыГраф_1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(28,10)) 	КАК ДопРасходыГраф_1,
		|	Т.СтоимостьЗнакГраф_1 		КАК СтоимостьЗнакГраф_1,
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА Т.СтоимостьЗабалансовая МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|		ТОГДА Т.СтоимостьЗабалансовая
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(28,10)) 	КАК СтоимостьЗабалансовая,
		|
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА Т.СтоимостьГраф_2 МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|		ТОГДА Т.СтоимостьГраф_2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(28,10)) 	КАК СтоимостьГраф_2,
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА Т.ДопРасходыГраф_2 МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|		ТОГДА Т.ДопРасходыГраф_2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(28,10)) 	КАК ДопРасходыГраф_2,
		|	Т.СтоимостьЗнакГраф_2 		КАК СтоимостьЗнакГраф_2,
		|
		|	Т.ВременнаяРазницаЗнак 		КАК ВременнаяРазницаЗнак,
		|	Т.ПостояннаяРазницаЗнак 	КАК ПостояннаяРазницаЗнак,
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА Т.ПостояннаяРазница МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|		ТОГДА Т.ПостояннаяРазница
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(28,10)) 	КАК ПостояннаяРазница,
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА Т.ВременнаяРазница МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля 
		|		ТОГДА Т.ВременнаяРазница
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(28,10)) 	КАК ВременнаяРазница
		|ПОМЕСТИТЬ ВтТаблицаРешений
		|ИЗ
		|	ВтТаблицаРешенийПредварительная КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	Т.НомерУзла
		|;
		|
		|/////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВтТаблицаРешенийПредварительная
		|";
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВТУзлыСПереполнениемПоля");
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

#КонецОбласти

#Область УниверсальныеПроцедурыРаботыСДвижениями

// Обертка для универсальной процедуры записи движений.
//
Процедура ЗаписатьДвиженияПоРегистру(ПараметрыРасчета, ИсходныеДанные, МенеджерРегистра)
	
	ПараметрыЗаписи = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗаписи(
		ПараметрыРасчета.РасчетныйПериод.НачалоПериода,
		ПараметрыРасчета.НомерЗаданияДоРасчета);
	
	Попытка
		РасчетСебестоимостиПрикладныеАлгоритмы.ЗаписатьДвиженияПоРегистру(
			ИсходныеДанные,
			МенеджерРегистра,
			ПараметрыЗаписи);
	Исключение
		
		// Информацию об ошибке добавим в протокол расчета, в механизме закрытия месяца ошибки уже должны быть зарегистрированы.
		ТекстДляПротокола = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаЗаписиДвиженийПоРегистрам,
			ТекстДляПротокола);
			
		ВызватьИсключение ТекстДляПротокола;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область УниверсальныеПроцедурыОписанияДанныхМеханизма

// Возвращает перечень объектов метаданных, на основании данных которых выполняется расчет партий.
// В перечень не включаются объекты, которые являются одновременно и исходящими данными механизмов расчета партий и себестоимости.
//
// Параметры:
//	ВходящиеДанные - Соответствие - уже инициализированное хранилище для описания входящих данных
//	ТолькоТребующиеПерерасчета - Булево - если установлен, то будет возвращен перечень только тех данных,
//		изменение которых влечет за собой необходимость перерасчета партий и себестоимости
//		При изменении этих данных должна создаваться запись в регистре сведений ЗаданияКРасчетуСебестоимости.
//
// Возвращаемое значение:
//	Соответствие - Ключ - ОбъектМетаданных.
//
Процедура ВходящиеДанныеМеханизма(ВходящиеДанные, ТолькоТребующиеПерерасчета) Экспорт
	
	Если ТолькоТребующиеПерерасчета Тогда
		Значение = Истина; // чтобы можно было проверить вхождение объекта метаданных в это соответствие
	Иначе
		Значение = Неопределено;
	КонецЕсли;
	
	
КонецПроцедуры

// Возвращает перечень регистров партионного учета версии 2.1, неиспользуемых в версии 2.2.
//
// Параметры:
//   НеиспользуемыеДанные - Соответствие
//   Значение - Булево
//
// Возвращаемое значение:
//   Соответствие:
//     * Ключ     - ОбъектМетаданныхРегистрНакопления.
//     * Значение - Булево.
//
Функция НеиспользуемыеДанныеМеханизмаВерсии21(НеиспользуемыеДанные = Неопределено, Значение = Истина) Экспорт
	
	Если НеиспользуемыеДанные = Неопределено Тогда
		НеиспользуемыеДанные = Новый Соответствие;
	КонецЕсли;
	
	НеиспользуемыеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, 					Значение);
	НеиспользуемыеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, 			Значение);
	НеиспользуемыеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, 	Значение);
	НеиспользуемыеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, 				Значение);
	НеиспользуемыеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, 		Значение);
	
	Возврат НеиспользуемыеДанные;
	
КонецФункции

#КонецОбласти

#Область ЗаданияКРасчетуСебестоимости

// Добавляет описания регистров для их подключения к механизму дат запрета изменения.
//
Процедура ОписаниеРегистровДляКонтроляДатЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Дополняет текст запроса отчета "Ведомость по партиям товаров" данными для партионного учета 2.1.
//
// Параметры:
//	ТекстЗапроса - Строка - Исходный текст запроса
//
Процедура ВедомостьПоПартиямТоваров_ДополнитьТекстЗапроса(ТекстЗапроса) Экспорт
	ТекстЗапросаПУ21 = "
		|ВЫБРАТЬ
		|	&ПартииТоваров            КАК ВидРегистра,
		|	Партии.ПериодДень         КАК ПериодДень,
		|	Партии.ПериодНеделя       КАК ПериодНеделя,
		|	Партии.ПериодДекада       КАК ПериодДекада,
		|	Партии.ПериодМесяц        КАК ПериодМесяц,
		|	Партии.ПериодКвартал      КАК ПериодКвартал,
		|	Партии.ПериодПолугодие    КАК ПериодПолугодие,
		|	Партии.ПериодГод          КАК ПериодГод,
		|	Партии.ПериодСекунда      КАК ПериодСекунда,
		|	
		|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения                КАК ЕдиницаХранения,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов               КАК ЕдиницаДляОтчетов,
		|	АналитикаНоменклатуры.Номенклатура.Артикул                         КАК НоменклатураАртикул,
		|	
		|	АналитикаНоменклатуры.Характеристика      КАК Характеристика,
		|	АналитикаНоменклатуры.Серия               КАК Серия,
		|	АналитикаНоменклатуры.МестоХранения               КАК Склад,
		|	
		|	Партии.АналитикаУчетаНоменклатуры         КАК АналитикаУчетаНоменклатуры,
		|	Партии.ДокументПоступления                КАК ДокументПоступления,
		|	НЕОПРЕДЕЛЕНО                              КАК СтатьяРасходов,
		|	Партии.ДокументПоступления                КАК ДокументПоступленияРасходов,
		|	Партии.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		|	
		|	Партии.ВидЗапасов                         КАК ВидЗапасов,
		|	Партии.АналитикаУчетаПартий.Поставщик     КАК Поставщик,
		|	Партии.АналитикаУчетаПартий.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
		|	
		|	Партии.Организация КАК Организация,
		|	ВЫБОР КОГДА Партии.Регистратор = НЕОПРЕДЕЛЕНО ТОГДА
		|		NULL
		|		ИНАЧЕ Партии.Регистратор
		|	КОНЕЦ                                     КАК Регистратор,
		|	
		|	ВЫБОР &ДанныеОтчета
		|		КОГДА 4
		|			ТОГДА Партии.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Партии.КоличествоНачальныйОстаток
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Партии.КоличествоНачальныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоНачальныйОстаток,
		|	
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Партии.КоличествоКонечныйОстаток
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Партии.КоличествоКонечныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоКонечныйОстаток,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Партии.КоличествоПриход
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Партии.КоличествоПриход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоПриход,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Партии.КоличествоРасход
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Партии.КоличествоРасход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоРасход,
		|
		|	Партии.КоличествоНачальныйОстаток * &ТекстЗапросаВес       КАК НачальныйОстатокВес,
		|	ВЫБОР
		|		КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|		ИНАЧЕ Партии.КоличествоКонечныйОстаток * &ТекстЗапросаВес
		|	КОНЕЦ                                                      КАК КонечныйОстатокВес,
		|	Партии.КоличествоПриход * &ТекстЗапросаВес                 КАК ПриходВес,
		|	Партии.КоличествоРасход * &ТекстЗапросаВес                 КАК РасходВес,
		|	Партии.КоличествоНачальныйОстаток * &ТекстЗапросаОбъем     КАК НачальныйОстатокОбъем,
		|	ВЫБОР
		|		КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|		ИНАЧЕ Партии.КоличествоКонечныйОстаток * &ТекстЗапросаОбъем
		|	КОНЕЦ                                                      КАК КонечныйОстатокОбъем,
		|	Партии.КоличествоПриход * &ТекстЗапросаОбъем               КАК ПриходОбъем,
		|	Партии.КоличествоРасход * &ТекстЗапросаОбъем               КАК РасходОбъем,
		|	
		|	//СтоимостьПоступленияНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 2 Или &ДанныеОтчета = 3 ТОГДА
		|		Партии.СтоимостьБезНДСНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглНачальныйОстаток +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглНачальныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СтоимостьПоступленияНачальныйОстаток,
		|	
		|	//СтоимостьПоступленияКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьКонечныйОстаток
		|	КОГДА &ДанныеОтчета = 2 Или &ДанныеОтчета = 3 ТОГДА
		|		Партии.СтоимостьБезНДСКонечныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглКонечныйОстаток +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглКонечныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСКонечныйОстаток
		|	КОНЕЦ КАК СтоимостьПоступленияКонечныйОстаток,
		|	
		|	//СтоимостьПоступленияПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 2 Или &ДанныеОтчета = 3 ТОГДА
		|		Партии.СтоимостьБезНДСПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглПриход +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглПриход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СтоимостьПоступленияПриход,
		|	
		|	//СтоимостьПоступленияРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 2 Или &ДанныеОтчета = 3 ТОГДА
		|		Партии.СтоимостьБезНДСРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглРасход +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглРасход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СтоимостьПоступленияРасход,
		|	
		|	// НДСРеглНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.НДСРеглНачальныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглНачальныйОстаток,
		|	
		|	// НДСРеглКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.НДСРеглКонечныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглКонечныйОстаток,
		|	
		|	// НДСРеглПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.НДСРеглПриход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглПриход,
		|	
		|	// НДСРеглРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.НДСРеглРасход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглРасход,
		|	
		|	//ДопРасходыНачальныйОстаток
		|	0 КАК ДопРасходыНачальныйОстаток,
		|
		|	//ДопРасходыКонечныйОстаток
		|	0 КАК ДопРасходыКонечныйОстаток,
		|
		|	//ДопРасходыПриход
		|	0 КАК ДопРасходыПриход,
		|
		|	//ДопРасходыРасход
		|	0 КАК ДопРасходыРасход,
		|	
		|	//СебестоимостьНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 2 Или &ДанныеОтчета = 3 ТОГДА
		|		Партии.СтоимостьБезНДСНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглНачальныйОстаток +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглНачальныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СебестоимостьНачальныйОстаток,
		|	
		|	//СебестоимостьКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьКонечныйОстаток
		|	КОГДА &ДанныеОтчета = 2 Или &ДанныеОтчета = 3 ТОГДА
		|		Партии.СтоимостьБезНДСКонечныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглКонечныйОстаток +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглКонечныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСКонечныйОстаток
		|	КОНЕЦ КАК СебестоимостьКонечныйОстаток,
		|	
		|	//СебестоимостьПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 2 Или &ДанныеОтчета = 3 ТОГДА
		|		Партии.СтоимостьБезНДСПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглПриход +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглПриход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СебестоимостьПриход,
		|	
		|	//СебестоимостьРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 2 Или &ДанныеОтчета = 3 ТОГДА
		|		Партии.СтоимостьБезНДСРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглРасход +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглРасход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СебестоимостьРасход,
		|
		|	0 КАК СебестоимостьПредварительнаяПриход,
		|	0 КАК СебестоимостьПредварительнаяРасход,
		|	0 КАК СебестоимостьОтклонениеПриход,
		|	0 КАК СебестоимостьОтклонениеРасход
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОрганизаций.ОстаткиИОбороты(, {(&КонецПериода21)}, Авто, , &ДанныеПУ21) КАК Партии
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|	
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|	ПО
		|		Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
		|{ГДЕ
		|	(АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В (
		|		ВЫБРАТЬ
		|			ОтборПоСегментуНоменклатуры.Номенклатура,
		|			ОтборПоСегментуНоменклатуры.Характеристика
		|		ИЗ
		|			ОтборПоСегментуНоменклатуры
		|		ГДЕ
		|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПартииТоваров                          КАК ВидРегистра,
		|	НАЧАЛОПЕРИОДА(Партии.Период, ДЕНЬ)      КАК ПериодДень,
		|	НАЧАЛОПЕРИОДА(Партии.Период, НЕДЕЛЯ)    КАК ПериодНеделя,
		|	НАЧАЛОПЕРИОДА(Партии.Период, ДЕКАДА)    КАК ПериодДекада,
		|	НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ)     КАК ПериодМесяц,
		|	НАЧАЛОПЕРИОДА(Партии.Период, КВАРТАЛ)   КАК ПериодКвартал,
		|	НАЧАЛОПЕРИОДА(Партии.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
		|	НАЧАЛОПЕРИОДА(Партии.Период, ГОД)       КАК ПериодГод,
		|	Партии.Период                           КАК ПериодСекунда,
		|	
		|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения                КАК ЕдиницаХранения,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов               КАК ЕдиницаДляОтчетов,
		|	АналитикаНоменклатуры.Номенклатура.Артикул                         КАК НоменклатураАртикул,
		|	
		|	АналитикаНоменклатуры.Характеристика      КАК Характеристика,
		|	АналитикаНоменклатуры.Серия               КАК Серия,
		|	АналитикаНоменклатуры.МестоХранения               КАК Склад,
		|	
		|	Партии.АналитикаУчетаНоменклатуры         КАК АналитикаУчетаНоменклатуры,
		|	Партии.ДокументПоступления                КАК ДокументПоступления,
		|	НЕОПРЕДЕЛЕНО                              КАК СтатьяРасходов,
		|	Партии.ДокументПоступления                КАК ДокументПоступленияРасходов,
		|	Партии.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		|	
		|	Партии.ВидЗапасов                         КАК ВидЗапасов,
		|	Партии.АналитикаУчетаПартий.Поставщик     КАК Поставщик,
		|	Партии.АналитикаУчетаПартий.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
		|	
		|	Партии.Организация КАК Организация,
		|	Партии.Регистратор КАК Регистратор,
		|	
		|	ВЫБОР &ДанныеОтчета
		|		КОГДА 4
		|			ТОГДА Партии.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	
		|	0 КАК КоличествоНачальныйОстаток,
		|	0 КАК КоличествоКонечныйОстаток,
		|	
		|	ВЫБОР КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|		- ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|			Партии.Количество
		|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|			ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|				Партии.Количество / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|			ИНАЧЕ 0
		|			КОНЕЦ
		|		КОНЕЦ
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПриход,
		|
		|	ВЫБОР КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|		- ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|			Партии.Количество
		|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|			ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|				Партии.Количество / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|			ИНАЧЕ 0
		|			КОНЕЦ
		|		КОНЕЦ
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРасход,
		|	
		|	0       КАК НачальныйОстатокВес,
		|	0       КАК КонечныйОстатокВес,
		|	ВЫБОР КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|		- Партии.Количество * &ТекстЗапросаВес
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК ПриходВес,
		|	ВЫБОР КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|		- Партии.Количество * &ТекстЗапросаВес
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК РасходВес,
		|	0       КАК НачальныйОстатокОбъем,
		|	0       КАК КонечныйОстатокОбъем,
		|	ВЫБОР КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|		- Партии.Количество * &ТекстЗапросаОбъем
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК ПриходОбъем,
		|	ВЫБОР КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|		- Партии.Количество * &ТекстЗапросаОбъем
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК РасходОбъем,
		|	
		|	//СтоимостьПоступленияНачальныйОстаток
		|	0 КАК СтоимостьПоступленияНачальныйОстаток,
		|	
		|	//СтоимостьПоступленияКонечныйОстаток
		|	0 КАК СтоимостьПоступленияКонечныйОстаток,
		|	
		|	//СтоимостьПоступленияПриход
		|	ВЫБОР
		|		КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР
		|				КОГДА &ДанныеОтчета = 1 ТОГДА
		|					- Партии.Стоимость
		|				КОГДА &ДанныеОтчета = 4 ТОГДА
		|					- Партии.СтоимостьРегл -
		|					ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|					ТОГДА
		|						Партии.НДСРегл
		|					ИНАЧЕ
		|						0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					- Партии.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияПриход,
		|	
		|	//СтоимостьПоступленияРасход
		|	ВЫБОР
		|		КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР
		|				КОГДА &ДанныеОтчета = 1 ТОГДА
		|					- Партии.Стоимость
		|				КОГДА &ДанныеОтчета = 4 ТОГДА
		|					- Партии.СтоимостьРегл -
		|					ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|					ТОГДА
		|						Партии.НДСРегл
		|					ИНАЧЕ
		|						0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					- Партии.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияРасход,
		|	
		|	// НДСРеглНачальныйОстаток
		|	0 КАК НДСРеглНачальныйОстаток,
		|	
		|	// НДСРеглКонечныйОстаток
		|	0 КАК НДСРеглКонечныйОстаток,
		|	
		|	// НДСРеглПриход
		|	ВЫБОР
		|		КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|			- Партии.НДСРегл
		|			ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСРеглПриход,
		|	
		|	// НДСРеглРасход
		|	ВЫБОР
		|		КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|			- Партии.НДСРегл
		|			ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСРеглРасход,
		|	
		|	//ДопРасходыНачальныйОстаток
		|	0 КАК ДопРасходыНачальныйОстаток,
		|
		|	//ДопРасходыКонечныйОстаток
		|	0 КАК ДопРасходыКонечныйОстаток,
		|
		|	//ДопРасходыПриход
		|	0 КАК ДопРасходыПриход,
		|
		|	//ДопРасходыРасход
		|	0 КАК ДопРасходыРасход,
		|	
		|	//СебестоимостьНачальныйОстаток
		|	0 КАК СебестоимостьНачальныйОстаток,
		|
		|	//СебестоимостьКонечныйОстаток
		|	0 КАК СебестоимостьКонечныйОстаток,
		|
		|	//СебестоимостьПриход
		|	ВЫБОР
		|		КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР
		|				КОГДА &ДанныеОтчета = 1 ТОГДА
		|					- Партии.Стоимость
		|				КОГДА &ДанныеОтчета = 4 ТОГДА
		|					- Партии.СтоимостьРегл -
		|					ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|					ТОГДА
		|						Партии.НДСРегл
		|					ИНАЧЕ
		|						0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					- Партии.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СебестоимостьПриход,
		|	
		|	//СебестоимостьРасход
		|	ВЫБОР
		|		КОГДА Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР
		|				КОГДА &ДанныеОтчета = 1 ТОГДА
		|					- Партии.Стоимость
		|				КОГДА &ДанныеОтчета = 4 ТОГДА
		|					- Партии.СтоимостьРегл -
		|					ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|					ТОГДА
		|						Партии.НДСРегл
		|					ИНАЧЕ
		|						0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					- Партии.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СебестоимостьРасход,
		|
		|	0 КАК СебестоимостьПредварительнаяПриход,
		|	0 КАК СебестоимостьПредварительнаяРасход,
		|	0 КАК СебестоимостьОтклонениеПриход,
		|	0 КАК СебестоимостьОтклонениеРасход
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|	
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|	ПО
		|		Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
		|	
		|ГДЕ
		|	&ДанныеПУ21
		|	И (Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода21
		|		ИЛИ &КонецПериода21 = ДАТАВРЕМЯ(1,1,1) И Партии.Период >= &НачалоПериода)
		|	И (Партии.ХозяйственнаяОперация В (&ИсключаемыеХозОперации)
		|		И &ИсключатьХозОперации = ИСТИНА
		|		ИЛИ ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.РасчетСебестоимостиТоваров))
		|{ГДЕ
		|	(АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В (
		|		ВЫБРАТЬ
		|			ОтборПоСегментуНоменклатуры.Номенклатура,
		|			ОтборПоСегментуНоменклатуры.Характеристика
		|		ИЗ
		|			ОтборПоСегментуНоменклатуры
		|		ГДЕ
		|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
		|{ГДЕ Партии.Организация, ДокументПоступления, Партии.АналитикаУчетаПартий.Поставщик, АналитикаУчетаНоменклатуры.МестоХранения, АналитикаУчетаНоменклатуры.Номенклатура}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПартииРасходовНаСебестоимостьТоваров КАК ВидРегистра,
		|	ДопРасходы.ПериодДень         КАК ПериодДень,
		|	ДопРасходы.ПериодНеделя       КАК ПериодНеделя,
		|	ДопРасходы.ПериодДекада       КАК ПериодДекада,
		|	ДопРасходы.ПериодМесяц        КАК ПериодМесяц,
		|	ДопРасходы.ПериодКвартал      КАК ПериодКвартал,
		|	ДопРасходы.ПериодПолугодие    КАК ПериодПолугодие,
		|	ДопРасходы.ПериодГод          КАК ПериодГод,
		|	ДопРасходы.ПериодСекунда      КАК ПериодСекунда,
		|	
		|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения                КАК ЕдиницаХранения,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов               КАК ЕдиницаДляОтчетов,
		|	АналитикаНоменклатуры.Номенклатура.Артикул                         КАК НоменклатураАртикул,
		|	
		|	АналитикаНоменклатуры.Характеристика          КАК Характеристика,
		|	АналитикаНоменклатуры.Серия                   КАК Серия,
		|	АналитикаНоменклатуры.МестоХранения                   КАК Склад,
		|	
		|	ДопРасходы.АналитикаУчетаНоменклатуры         КАК АналитикаУчетаНоменклатуры,
		|	ДопРасходы.ДокументПоступления                КАК ДокументПоступления,
		|	ДопРасходы.СтатьяРасходов                     КАК СтатьяРасходов,
		|	ДопРасходы.ДокументПоступленияРасходов        КАК ДокументПоступленияРасходов,
		|	ДопРасходы.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		|	
		|	ДопРасходы.ВидЗапасов                         КАК ВидЗапасов,
		|	ДопРасходы.АналитикаУчетаПартий.Поставщик               КАК Поставщик,
		|	ДопРасходы.АналитикаУчетаПартий.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
		|	
		|	ДопРасходы.Организация КАК Организация,
		|	ВЫБОР КОГДА ДопРасходы.Регистратор = НЕОПРЕДЕЛЕНО ТОГДА
		|		NULL
		|		ИНАЧЕ ДопРасходы.Регистратор
		|	КОНЕЦ                                     КАК Регистратор,
		|	
		|	ВЫБОР &ДанныеОтчета
		|		КОГДА 4
		|			ТОГДА ДопРасходы.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	
		|	0 КАК КоличествоНачальныйОстаток,
		|	0 КАК КоличествоКонечныйОстаток,
		|	
		|	0 КАК КоличествоПриход,
		|	0 КАК КоличествоРасход,
		|	
		|	0 КАК НачальныйОстатокВес,
		|	0 КАК КонечныйОстатокВес,
		|	0 КАК ПриходВес,
		|	0 КАК РасходВес,
		|	0 КАК НачальныйОстатокОбъем,
		|	0 КАК КонечныйОстатокОбъем,
		|	0 КАК ПриходОбъем,
		|	0 КАК РасходОбъем,
		|	
		|	//СтоимостьПоступленияНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.СтоимостьРеглНачальныйОстаток +
		|		ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			ДопРасходы.НДСРеглНачальныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияНачальныйОстаток,
		|	
		|	//СтоимостьПоступленияКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.СтоимостьРеглКонечныйОстаток +
		|		ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			ДопРасходы.НДСРеглКонечныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияКонечныйОстаток,
		|	
		|	//СтоимостьПоступленияПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.СтоимостьРеглПриход +
		|		ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			ДопРасходы.НДСРеглПриход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияПриход,
		|	
		|	//СтоимостьПоступленияРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.СтоимостьРеглРасход +
		|		ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			ДопРасходы.НДСРеглРасход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияРасход,
		|	
		|	// НДСРеглНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.НДСРеглНачальныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглНачальныйОстаток,
		|	
		|	// НДСРеглКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.НДСРеглКонечныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглКонечныйОстаток,
		|	
		|	// НДСРеглПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.НДСРеглПриход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглПриход,
		|	
		|	// НДСРеглРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.НДСРеглРасход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглРасход,
		|	
		|	//ДопРасходыНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		ДопРасходы.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		0
		|	ИНАЧЕ
		|		ДопРасходы.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК ДопРасходыНачальныйОстаток,
		|
		|	//ДопРасходыКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		ДопРасходы.СтоимостьКонечныйОстаток 
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		0
		|	ИНАЧЕ
		|		ДопРасходы.СтоимостьБезНДСКонечныйОстаток 
		|	КОНЕЦ КАК ДопРасходыКонечныйОстаток,
		|
		|	//ДопРасходыПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		ДопРасходы.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		0
		|	ИНАЧЕ
		|		ДопРасходы.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК ДопРасходыПриход,
		|
		|	//ДопРасходыРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		ДопРасходы.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		0
		|	ИНАЧЕ
		|		ДопРасходы.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК ДопРасходыРасход,
		|	
		|	//СебестоимостьНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		ДопРасходы.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.СтоимостьРеглНачальныйОстаток +
		|		ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			ДопРасходы.НДСРеглНачальныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ДопРасходы.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СебестоимостьНачальныйОстаток,
		|
		|	//СебестоимостьКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		ДопРасходы.СтоимостьКонечныйОстаток 
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.СтоимостьРеглКонечныйОстаток +
		|		ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			ДопРасходы.НДСРеглКонечныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ДопРасходы.СтоимостьБезНДСКонечныйОстаток 
		|	КОНЕЦ КАК СебестоимостьКонечныйОстаток,
		|
		|	//СебестоимостьПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		ДопРасходы.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.СтоимостьРеглПриход +
		|		ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			ДопРасходы.НДСРеглПриход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ДопРасходы.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СебестоимостьПриход,
		|
		|	//СебестоимостьРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		ДопРасходы.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		ДопРасходы.СтоимостьРеглРасход +
		|		ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			ДопРасходы.НДСРеглРасход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ДопРасходы.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СебестоимостьРасход,
		|
		|	0 КАК СебестоимостьПредварительнаяПриход,
		|	0 КАК СебестоимостьПредварительнаяРасход,
		|	0 КАК СебестоимостьОтклонениеПриход,
		|	0 КАК СебестоимостьОтклонениеРасход
		|ИЗ
		|	РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.ОстаткиИОбороты(, {(&КонецПериода21)}, Авто, , &ДанныеПУ21) КАК ДопРасходы
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|	
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|	ПО
		|		ДопРасходы.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
		|{ГДЕ
		|	(АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В (
		|		ВЫБРАТЬ
		|			ОтборПоСегментуНоменклатуры.Номенклатура,
		|			ОтборПоСегментуНоменклатуры.Характеристика
		|		ИЗ
		|			ОтборПоСегментуНоменклатуры
		|		ГДЕ
		|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
		|			
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПартииРасходовНаСебестоимостьТоваров       КАК ВидРегистра,
		|	НАЧАЛОПЕРИОДА(ДопРасходы.Период, ДЕНЬ)      КАК ПериодДень,
		|	НАЧАЛОПЕРИОДА(ДопРасходы.Период, НЕДЕЛЯ)    КАК ПериодНеделя,
		|	НАЧАЛОПЕРИОДА(ДопРасходы.Период, ДЕКАДА)    КАК ПериодДекада,
		|	НАЧАЛОПЕРИОДА(ДопРасходы.Период, МЕСЯЦ)     КАК ПериодМесяц,
		|	НАЧАЛОПЕРИОДА(ДопРасходы.Период, КВАРТАЛ)   КАК ПериодКвартал,
		|	НАЧАЛОПЕРИОДА(ДопРасходы.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
		|	НАЧАЛОПЕРИОДА(ДопРасходы.Период, ГОД)       КАК ПериодГод,
		|	ДопРасходы.Период                           КАК ПериодСекунда,
		|	
		|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения                КАК ЕдиницаХранения,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов               КАК ЕдиницаДляОтчетов,
		|	АналитикаНоменклатуры.Номенклатура.Артикул                         КАК НоменклатураАртикул,
		|	
		|	АналитикаНоменклатуры.Характеристика      КАК Характеристика,
		|	АналитикаНоменклатуры.Серия               КАК Серия,
		|	АналитикаНоменклатуры.МестоХранения               КАК Склад,
		|	
		|	ДопРасходы.АналитикаУчетаНоменклатуры         КАК АналитикаУчетаНоменклатуры,
		|	ДопРасходы.ДокументПоступления                КАК ДокументПоступления,
		|	ДопРасходы.СтатьяРасходов                     КАК СтатьяРасходов,
		|	ДопРасходы.ДокументПоступленияРасходов        КАК ДокументПоступленияРасходов,
		|	ДопРасходы.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		|	
		|	ДопРасходы.ВидЗапасов                         КАК ВидЗапасов,
		|	ДопРасходы.АналитикаУчетаПартий.Поставщик               КАК Поставщик,
		|	ДопРасходы.АналитикаУчетаПартий.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
		|
		|	ДопРасходы.Организация КАК Организация,
		|	ДопРасходы.Регистратор КАК Регистратор,
		|	
		|	ВЫБОР &ДанныеОтчета
		|		КОГДА 4
		|			ТОГДА ДопРасходы.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	
		|	0 КАК КоличествоНачальныйОстаток,
		|	0 КАК КоличествоКонечныйОстаток,
		|	
		|	0 КАК КоличествоПриход,
		|	0 КАК КоличествоРасход,
		|	
		|	0 КАК НачальныйОстатокВес,
		|	0 КАК КонечныйОстатокВес,
		|	0 КАК ПриходВес,
		|	0 КАК РасходВес,
		|	0 КАК НачальныйОстатокОбъем,
		|	0 КАК КонечныйОстатокОбъем,
		|	0 КАК ПриходОбъем,
		|	0 КАК РасходОбъем,
		|	
		|	//СтоимостьПоступленияНачальныйОстаток
		|	0 КАК СтоимостьПоступленияНачальныйОстаток,
		|	
		|	//СтоимостьПоступленияКонечныйОстаток
		|	0 КАК СтоимостьПоступленияКонечныйОстаток,
		|	
		|	//СтоимостьПоступленияПриход
		|	ВЫБОР
		|		КОГДА ДопРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|				- ДопРасходы.СтоимостьРегл -
		|			 	ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|				ТОГДА
		|					ДопРасходы.НДСРегл
		|				ИНАЧЕ
		|					0
		|				КОНЕЦ
		|			ИНАЧЕ
		|				0
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияПриход,
		|	
		|	//СтоимостьПоступленияРасход
		|	ВЫБОР
		|		КОГДА ДопРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|				- ДопРасходы.СтоимостьРегл -
		|			 	ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|				ТОГДА
		|					ДопРасходы.НДСРегл
		|				ИНАЧЕ
		|					0
		|				КОНЕЦ
		|			ИНАЧЕ
		|				0
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияРасход,
		|
		|	// НДСРеглНачальныйОстаток
		|	0 КАК НДСРеглНачальныйОстаток,
		|	
		|	// НДСРеглКонечныйОстаток
		|	0 КАК НДСРеглКонечныйОстаток,
		|	
		|	// НДСРеглПриход
		|	ВЫБОР
		|		КОГДА ДопРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|			- ДопРасходы.НДСРегл
		|			ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСРеглПриход,
		|	
		|	// НДСРеглРасход
		|	ВЫБОР
		|		КОГДА ДопРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|			- ДопРасходы.НДСРегл
		|			ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСРеглРасход,
		|	
		|	//ДопРасходыНачальныйОстаток
		|	0 КАК ДопРасходыНачальныйОстаток,
		|
		|	//ДопРасходыКонечныйОстаток
		|	0 КАК ДопРасходыКонечныйОстаток,
		|
		|	//ДопРасходыПриход
		|	ВЫБОР
		|		КОГДА ДопРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|				- ДопРасходы.Стоимость
		|			КОГДА &ДанныеОтчета = 4 ТОГДА
		|				0
		|			ИНАЧЕ
		|				- ДопРасходы.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДопРасходыПриход,
		|
		|	//ДопРасходыРасход
		|	ВЫБОР
		|		КОГДА ДопРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|				- ДопРасходы.Стоимость
		|			КОГДА &ДанныеОтчета = 4 ТОГДА
		|				0
		|			ИНАЧЕ
		|				- ДопРасходы.СтоимостьБезНДС
		|			КОНЕЦ 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДопРасходыРасход,
		|	
		|	//СебестоимостьНачальныйОстаток
		|	0 КАК СебестоимостьНачальныйОстаток,
		|
		|	//СебестоимостьКонечныйОстаток
		|	0 КАК СебестоимостьКонечныйОстаток,
		|
		|	//СебестоимостьПриход
		|	ВЫБОР
		|		КОГДА ДопРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|				- ДопРасходы.Стоимость
		|			КОГДА &ДанныеОтчета = 4 ТОГДА
		|				- ДопРасходы.СтоимостьРегл -
		|			 	ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|				ТОГДА
		|					ДопРасходы.НДСРегл
		|				ИНАЧЕ
		|					0
		|				КОНЕЦ
		|			ИНАЧЕ
		|				- ДопРасходы.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СебестоимостьПриход,
		|
		|	//СебестоимостьРасход
		|	ВЫБОР
		|		КОГДА ДопРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|				- ДопРасходы.Стоимость
		|			КОГДА &ДанныеОтчета = 4 ТОГДА
		|				- ДопРасходы.СтоимостьРегл -
		|			 	ВЫБОР КОГДА ДопРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|				ТОГДА
		|					ДопРасходы.НДСРегл
		|				ИНАЧЕ
		|					0
		|				КОНЕЦ
		|			ИНАЧЕ
		|				- ДопРасходы.СтоимостьБезНДС
		|			КОНЕЦ 
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СебестоимостьРасход,
		|
		|	0 КАК СебестоимостьПредварительнаяПриход,
		|	0 КАК СебестоимостьПредварительнаяРасход,
		|	0 КАК СебестоимостьОтклонениеПриход,
		|	0 КАК СебестоимостьОтклонениеРасход
		|ИЗ
		|	РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ДопРасходы
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|	
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|	ПО
		|		ДопРасходы.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
		|	
		|ГДЕ
		|	&ДанныеПУ21
		|	И (ДопРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода21
		|		ИЛИ &КонецПериода21 = ДАТАВРЕМЯ(1,1,1) И ДопРасходы.Период >= &НачалоПериода)
		|	И (ДопРасходы.ХозяйственнаяОперация В (&ИсключаемыеХозОперации)
		|		И &ИсключатьХозОперации = ИСТИНА
		|		ИЛИ ТИПЗНАЧЕНИЯ(ДопРасходы.Регистратор) = ТИП(Документ.РасчетСебестоимостиТоваров))
		|{ГДЕ
		|	(АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В (
		|		ВЫБРАТЬ
		|			ОтборПоСегментуНоменклатуры.Номенклатура,
		|			ОтборПоСегментуНоменклатуры.Характеристика
		|		ИЗ
		|			ОтборПоСегментуНоменклатуры
		|		ГДЕ
		|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|{ГДЕ ДопРасходы.Организация, ДокументПоступления, ДопРасходы.АналитикаУчетаПартий.Поставщик, АналитикаУчетаНоменклатуры.МестоХранения, АналитикаУчетаНоменклатуры.Номенклатура}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПартииЗатратНаВыпуск      КАК ВидРегистра,
		|	Затраты.ПериодДень         КАК ПериодДень,
		|	Затраты.ПериодНеделя       КАК ПериодНеделя,
		|	Затраты.ПериодДекада       КАК ПериодДекада,
		|	Затраты.ПериодМесяц        КАК ПериодМесяц,
		|	Затраты.ПериодКвартал      КАК ПериодКвартал,
		|	Затраты.ПериодПолугодие    КАК ПериодПолугодие,
		|	Затраты.ПериодГод          КАК ПериодГод,
		|	Затраты.ПериодСекунда      КАК ПериодСекунда,
		|	
		|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения                КАК ЕдиницаХранения,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов               КАК ЕдиницаДляОтчетов,
		|	АналитикаНоменклатуры.Номенклатура.Артикул                         КАК НоменклатураАртикул,
		|	
		|	АналитикаНоменклатуры.Характеристика       КАК Характеристика,
		|	АналитикаНоменклатуры.Серия                КАК Серия,
		|	АналитикаНоменклатуры.МестоХранения                КАК Склад,
		|	
		|	Затраты.АналитикаУчетаПродукции            КАК АналитикаУчетаНоменклатуры,
		|	Затраты.ДокументВыпуска                    КАК ДокументПоступления,
		|	АналитикаМатериалов.Номенклатура           КАК СтатьяРасходов,
		|	Затраты.ДокументПоступления                КАК ДокументПоступленияРасходов,
		|	Затраты.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		|	
		|	Затраты.ВидЗапасов                         КАК ВидЗапасов,
		|	Затраты.АналитикаУчетаПартий.Поставщик               КАК Поставщик,
		|	Затраты.АналитикаУчетаПартий.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
		|	
		|	Затраты.Организация КАК Организация,
		|	ВЫБОР КОГДА Затраты.Регистратор = НЕОПРЕДЕЛЕНО ТОГДА
		|		NULL
		|		ИНАЧЕ Затраты.Регистратор
		|	КОНЕЦ                                     КАК Регистратор,
		|	
		|	ВЫБОР &ДанныеОтчета
		|		КОГДА 4
		|			ТОГДА Затраты.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	
		|	0 КАК КоличествоНачальныйОстаток,
		|	0 КАК КоличествоКонечныйОстаток,
		|	
		|	0 КАК КоличествоПриход,
		|	0 КАК КоличествоРасход,
		|	
		|	0 КАК НачальныйОстатокВес,
		|	0 КАК КонечныйОстатокВес,
		|	0 КАК ПриходВес,
		|	0 КАК РасходВес,
		|	0 КАК НачальныйОстатокОбъем,
		|	0 КАК КонечныйОстатокОбъем,
		|	0 КАК ПриходОбъем,
		|	0 КАК РасходОбъем,
		|	
		|	//СтоимостьПоступленияНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглНачальныйОстаток
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СтоимостьПоступленияНачальныйОстаток,
		|	
		|	//СтоимостьПоступленияКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьКонечныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглКонечныйОстаток
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСКонечныйОстаток
		|	КОНЕЦ КАК СтоимостьПоступленияКонечныйОстаток,
		|	
		|	//СтоимостьПоступленияПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглПриход
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СтоимостьПоступленияПриход,
		|
		|	//СтоимостьПоступленияРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглРасход
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СтоимостьПоступленияРасход,
		|	
		|	// НДСРеглНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.НДСРеглНачальныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглНачальныйОстаток,
		|	
		|	// НДСРеглКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.НДСРеглКонечныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглКонечныйОстаток,
		|	
		|	// НДСРеглПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.НДСРеглПриход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглПриход,
		|	
		|	// НДСРеглРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.НДСРеглРасход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглРасход,
		|	
		|	//ДопРасходыНачальныйОстаток
		|	0 КАК ДопРасходыНачальныйОстаток,
		|
		|	//ДопРасходыКонечныйОстаток
		|	0 КАК ДопРасходыКонечныйОстаток,
		|
		|	//ДопРасходыПриход
		|	0 КАК ДопРасходыПриход,
		|
		|	//ДопРасходыРасход
		|	0 КАК ДопРасходыРасход,
		|	
		|	//СебестоимостьНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглНачальныйОстаток +
		|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Затраты.НДСРеглНачальныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СебестоимостьНачальныйОстаток,
		|	
		|	//СебестоимостьКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьКонечныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглКонечныйОстаток +
		|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Затраты.НДСРеглКонечныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСКонечныйОстаток
		|	КОНЕЦ КАК СебестоимостьКонечныйОстаток,
		|	
		|	//СебестоимостьПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглПриход +
		|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Затраты.НДСРеглПриход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СебестоимостьПриход,
		|
		|	//СебестоимостьРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглРасход +
		|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Затраты.НДСРеглРасход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СебестоимостьРасход,
		|
		|	0 КАК СебестоимостьПредварительнаяПриход,
		|	0 КАК СебестоимостьПредварительнаяРасход,
		|	0 КАК СебестоимостьОтклонениеПриход,
		|	0 КАК СебестоимостьОтклонениеРасход
		|ИЗ
		|	РегистрНакопления.ПартииЗатратНаВыпуск.ОстаткиИОбороты(, {(&КонецПериода21)}, Авто, , &ДанныеПУ21) КАК Затраты
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|	
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|	ПО
		|		Затраты.АналитикаУчетаПродукции = АналитикаНоменклатуры.Ссылка}
		|
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаМатериалов
		|	ПО
		|		Затраты.АналитикаУчетаНоменклатуры = АналитикаМатериалов.Ссылка}
		|{ГДЕ
		|	(АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В (
		|		ВЫБРАТЬ
		|			ОтборПоСегментуНоменклатуры.Номенклатура,
		|			ОтборПоСегментуНоменклатуры.Характеристика
		|		ИЗ
		|			ОтборПоСегментуНоменклатуры
		|		ГДЕ
		|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
		|			
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПартииЗатратНаВыпуск                    КАК ВидРегистра,
		|	НАЧАЛОПЕРИОДА(Затраты.Период, ДЕНЬ)      КАК ПериодДень,
		|	НАЧАЛОПЕРИОДА(Затраты.Период, НЕДЕЛЯ)    КАК ПериодНеделя,
		|	НАЧАЛОПЕРИОДА(Затраты.Период, ДЕКАДА)    КАК ПериодДекада,
		|	НАЧАЛОПЕРИОДА(Затраты.Период, МЕСЯЦ)     КАК ПериодМесяц,
		|	НАЧАЛОПЕРИОДА(Затраты.Период, КВАРТАЛ)   КАК ПериодКвартал,
		|	НАЧАЛОПЕРИОДА(Затраты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
		|	НАЧАЛОПЕРИОДА(Затраты.Период, ГОД)       КАК ПериодГод,
		|	Затраты.Период                           КАК ПериодСекунда,
		|	
		|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения                КАК ЕдиницаХранения,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов               КАК ЕдиницаДляОтчетов,
		|	АналитикаНоменклатуры.Номенклатура.Артикул                         КАК НоменклатураАртикул,
		|	
		|	АналитикаНоменклатуры.Характеристика      КАК Характеристика,
		|	АналитикаНоменклатуры.Серия               КАК Серия,
		|	АналитикаНоменклатуры.МестоХранения               КАК Склад,
		|	
		|	Затраты.АналитикаУчетаПродукции            КАК АналитикаУчетаНоменклатуры,
		|	Затраты.ДокументПоступления                КАК ДокументПоступления,
		|	АналитикаМатериалов.Номенклатура           КАК СтатьяРасходов,
		|	Затраты.ДокументПоступления                КАК ДокументПоступленияРасходов,
		|	Затраты.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		|	
		|	Затраты.ВидЗапасов                         КАК ВидЗапасов,
		|	Затраты.АналитикаУчетаПартий.Поставщик               КАК Поставщик,
		|	Затраты.АналитикаУчетаПартий.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
		|
		|	Затраты.Организация КАК Организация,
		|	Затраты.Регистратор КАК Регистратор,
		|	
		|	ВЫБОР &ДанныеОтчета
		|		КОГДА 4
		|			ТОГДА Затраты.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	
		|	0 КАК КоличествоНачальныйОстаток,
		|	0 КАК КоличествоКонечныйОстаток,
		|	
		|	0 КАК КоличествоПриход,
		|	0 КАК КоличествоРасход,
		|	
		|	0 КАК НачальныйОстатокВес,
		|	0 КАК КонечныйОстатокВес,
		|	0 КАК ПриходВес,
		|	0 КАК РасходВес,
		|	0 КАК НачальныйОстатокОбъем,
		|	0 КАК КонечныйОстатокОбъем,
		|	0 КАК ПриходОбъем,
		|	0 КАК РасходОбъем,
		|	
		|	//СтоимостьПоступленияНачальныйОстаток
		|	0 КАК СтоимостьПоступленияНачальныйОстаток,
		|	
		|	//СтоимостьПоступленияКонечныйОстаток
		|	0 КАК СтоимостьПоступленияКонечныйОстаток,
		|	
		|	//СтоимостьПоступленияПриход
		|	ВЫБОР
		|		КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР
		|				КОГДА &ДанныеОтчета = 1 ТОГДА
		|					- Затраты.Стоимость
		|				КОГДА &ДанныеОтчета = 4 ТОГДА
		|					- Затраты.СтоимостьРегл -
		|					ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|					ТОГДА
		|						Затраты.НДСРегл
		|					ИНАЧЕ
		|						0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					- Затраты.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияПриход,
		|	
		|	//СтоимостьПоступленияРасход
		|	ВЫБОР
		|		КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР
		|				КОГДА &ДанныеОтчета = 1 ТОГДА
		|					- Затраты.Стоимость
		|				КОГДА &ДанныеОтчета = 4 ТОГДА
		|					- Затраты.СтоимостьРегл -
		|					ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|					ТОГДА
		|						Затраты.НДСРегл
		|					ИНАЧЕ
		|						0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					- Затраты.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьПоступленияРасход,
		|	
		|	// НДСРеглНачальныйОстаток
		|	0 КАК НДСРеглНачальныйОстаток,
		|	
		|	// НДСРеглКонечныйОстаток
		|	0 КАК НДСРеглКонечныйОстаток,
		|	
		|	// НДСРеглПриход
		|	ВЫБОР
		|		КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|			- Затраты.НДСРегл
		|			ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСРеглПриход,
		|	
		|	// НДСРеглРасход
		|	ВЫБОР
		|		КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|			- Затраты.НДСРегл
		|			ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСРеглРасход,
		|	
		|	//ДопРасходыНачальныйОстаток
		|	0 КАК ДопРасходыНачальныйОстаток,
		|
		|	//ДопРасходыКонечныйОстаток
		|	0 КАК ДопРасходыКонечныйОстаток,
		|
		|	//ДопРасходыПриход
		|	0 КАК ДопРасходыПриход,
		|
		|	//ДопРасходыРасход
		|	0 КАК ДопРасходыРасход,
		|
		|	//СебестоимостьНачальныйОстаток
		|	0 КАК СебестоимостьНачальныйОстаток,
		|
		|	//СебестоимостьКонечныйОстаток
		|	0 КАК СебестоимостьКонечныйОстаток,
		|	
		|	//СебестоимостьПриход
		|	ВЫБОР
		|		КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ВЫБОР
		|				КОГДА &ДанныеОтчета = 1 ТОГДА
		|					- Затраты.Стоимость
		|				КОГДА &ДанныеОтчета = 4 ТОГДА
		|					- Затраты.СтоимостьРегл -
		|					ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|					ТОГДА
		|						Затраты.НДСРегл
		|					ИНАЧЕ
		|						0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					- Затраты.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СебестоимостьПриход,
		|	
		|	//СебестоимостьРасход
		|	ВЫБОР
		|		КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		|			ВЫБОР
		|				КОГДА &ДанныеОтчета = 1 ТОГДА
		|					- Затраты.Стоимость
		|				КОГДА &ДанныеОтчета = 4 ТОГДА
		|					- Затраты.СтоимостьРегл -
		|					ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|						ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|					ТОГДА
		|						Затраты.НДСРегл
		|					ИНАЧЕ
		|						0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					- Затраты.СтоимостьБезНДС
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СебестоимостьРасход,
		|
		|	0 КАК СебестоимостьПредварительнаяПриход,
		|	0 КАК СебестоимостьПредварительнаяРасход,
		|	0 КАК СебестоимостьОтклонениеПриход,
		|	0 КАК СебестоимостьОтклонениеРасход
		|ИЗ
		|	РегистрНакопления.ПартииЗатратНаВыпуск КАК Затраты
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|	
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|	ПО
		|		Затраты.АналитикаУчетаПродукции = АналитикаНоменклатуры.Ссылка}
		|
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаМатериалов
		|	ПО
		|		Затраты.АналитикаУчетаНоменклатуры = АналитикаМатериалов.Ссылка}
		|	
		|ГДЕ
		|	&ДанныеПУ21
		|	И (Затраты.Период МЕЖДУ &НачалоПериода И &КонецПериода21
		|		ИЛИ &КонецПериода21 = ДАТАВРЕМЯ(1,1,1) И Затраты.Период >= &НачалоПериода)
		|	И (Затраты.ХозяйственнаяОперация В (&ИсключаемыеХозОперации)
		|		И &ИсключатьХозОперации = ИСТИНА
		|		ИЛИ ТИПЗНАЧЕНИЯ(Затраты.Регистратор) = ТИП(Документ.РасчетСебестоимостиТоваров))
		|{ГДЕ
		|	(АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В (
		|		ВЫБРАТЬ
		|			ОтборПоСегментуНоменклатуры.Номенклатура,
		|			ОтборПоСегментуНоменклатуры.Характеристика
		|		ИЗ
		|			ОтборПоСегментуНоменклатуры
		|		ГДЕ
		|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
		|
		|{ГДЕ Затраты.Организация, ДокументПоступления, Затраты.АналитикаУчетаПартий.Поставщик, АналитикаУчетаНоменклатуры.МестоХранения, АналитикаУчетаНоменклатуры.Номенклатура}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПартииПроизводственныхЗатрат КАК ВидРегистра,
		|	Затраты.ПериодДень         КАК ПериодДень,
		|	Затраты.ПериодНеделя       КАК ПериодНеделя,
		|	Затраты.ПериодДекада       КАК ПериодДекада,
		|	Затраты.ПериодМесяц        КАК ПериодМесяц,
		|	Затраты.ПериодКвартал      КАК ПериодКвартал,
		|	Затраты.ПериодПолугодие    КАК ПериодПолугодие,
		|	Затраты.ПериодГод          КАК ПериодГод,
		|	Затраты.ПериодСекунда      КАК ПериодСекунда,
		|	
		|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения                КАК ЕдиницаХранения,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов               КАК ЕдиницаДляОтчетов,
		|	АналитикаНоменклатуры.Номенклатура.Артикул                         КАК НоменклатураАртикул,
		|	
		|	АналитикаНоменклатуры.Характеристика       КАК Характеристика,
		|	АналитикаНоменклатуры.Серия                КАК Серия,
		|	АналитикаНоменклатуры.МестоХранения                КАК Склад,
		|	
		|	Затраты.АналитикаУчетаНоменклатуры         КАК АналитикаУчетаНоменклатуры,
		|	Затраты.ДокументПоступления                КАК ДокументПоступления,
		|	НЕОПРЕДЕЛЕНО                               КАК СтатьяРасходов,
		|	NULL                                       КАК ДокументПоступленияРасходов,
		|	Затраты.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		|	
		|	Затраты.ВидЗапасов                         КАК ВидЗапасов,
		|	Затраты.АналитикаУчетаПартий.Поставщик               КАК Поставщик,
		|	Затраты.АналитикаУчетаПартий.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
		|	
		|	Затраты.Организация КАК Организация,
		|	ВЫБОР КОГДА Затраты.Регистратор = НЕОПРЕДЕЛЕНО ТОГДА
		|		NULL
		|		ИНАЧЕ Затраты.Регистратор
		|	КОНЕЦ                                     КАК Регистратор,
		|	
		|	ВЫБОР &ДанныеОтчета
		|		КОГДА 4
		|			ТОГДА Затраты.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Затраты.КоличествоНачальныйОстаток
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Затраты.КоличествоНачальныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоНачальныйОстаток,
		|	
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Затраты.КоличествоКонечныйОстаток
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Затраты.КоличествоКонечныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоКонечныйОстаток,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Затраты.КоличествоПриход
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Затраты.КоличествоПриход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоПриход,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Затраты.КоличествоРасход
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Затраты.КоличествоРасход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоРасход,
		|
		|	Затраты.КоличествоНачальныйОстаток * &ТекстЗапросаВес       КАК НачальныйОстатокВес,
		|	ВЫБОР
		|		КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|		ИНАЧЕ Затраты.КоличествоКонечныйОстаток * &ТекстЗапросаВес
		|	КОНЕЦ                                                       КАК КонечныйОстатокВес,
		|	Затраты.КоличествоПриход * &ТекстЗапросаВес                 КАК ПриходВес,
		|	Затраты.КоличествоРасход * &ТекстЗапросаВес                 КАК РасходВес,
		|	Затраты.КоличествоНачальныйОстаток * &ТекстЗапросаОбъем     КАК НачальныйОстатокОбъем,
		|	ВЫБОР
		|		КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|		ИНАЧЕ Затраты.КоличествоКонечныйОстаток * &ТекстЗапросаОбъем
		|	КОНЕЦ                                                       КАК КонечныйОстатокОбъем,
		|	Затраты.КоличествоПриход * &ТекстЗапросаОбъем               КАК ПриходОбъем,
		|	Затраты.КоличествоРасход * &ТекстЗапросаОбъем               КАК РасходОбъем,
		|	
		|	//СтоимостьПоступленияНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглНачальныйОстаток
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СтоимостьПоступленияНачальныйОстаток,
		|	
		|	//СтоимостьПоступленияКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьКонечныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглКонечныйОстаток
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСКонечныйОстаток
		|	КОНЕЦ КАК СтоимостьПоступленияКонечныйОстаток,
		|	
		|	//СтоимостьПоступленияПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглПриход
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СтоимостьПоступленияПриход,
		|
		|	//СтоимостьПоступленияРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглРасход
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СтоимостьПоступленияРасход,
		|	
		|	// НДСРеглНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.НДСРеглНачальныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглНачальныйОстаток,
		|	
		|	// НДСРеглКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.НДСРеглКонечныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглКонечныйОстаток,
		|	
		|	// НДСРеглПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.НДСРеглПриход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглПриход,
		|	
		|	// НДСРеглРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.НДСРеглРасход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглРасход,
		|	
		|	//ДопРасходыНачальныйОстаток
		|	0 КАК ДопРасходыНачальныйОстаток,
		|
		|	//ДопРасходыКонечныйОстаток
		|	0 КАК ДопРасходыКонечныйОстаток,
		|
		|	//ДопРасходыПриход
		|	0 КАК ДопРасходыПриход,
		|
		|	//ДопРасходыРасход
		|	0 КАК ДопРасходыРасход,
		|	
		|	//СебестоимостьНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглНачальныйОстаток +
		|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Затраты.НДСРеглНачальныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СебестоимостьНачальныйОстаток,
		|	
		|	//СебестоимостьКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьКонечныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглКонечныйОстаток +
		|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Затраты.НДСРеглКонечныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСКонечныйОстаток
		|	КОНЕЦ КАК СебестоимостьКонечныйОстаток,
		|	
		|	//СебестоимостьПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглПриход +
		|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Затраты.НДСРеглПриход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СебестоимостьПриход,
		|
		|	//СебестоимостьРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Затраты.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Затраты.СтоимостьРеглРасход +
		|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Затраты.НДСРеглРасход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Затраты.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СебестоимостьРасход,
		|
		|	0 КАК СебестоимостьПредварительнаяПриход,
		|	0 КАК СебестоимостьПредварительнаяРасход,
		|	0 КАК СебестоимостьОтклонениеПриход,
		|	0 КАК СебестоимостьОтклонениеРасход
		|ИЗ
		|	РегистрНакопления.ПартииПроизводственныхЗатрат.ОстаткиИОбороты(, {(&КонецПериода21)}, Авто, , &ДанныеПУ21) КАК Затраты
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|	
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|	ПО
		|		Затраты.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
		|{ГДЕ
		|	(АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В (
		|		ВЫБРАТЬ
		|			ОтборПоСегментуНоменклатуры.Номенклатура,
		|			ОтборПоСегментуНоменклатуры.Характеристика
		|		ИЗ
		|			ОтборПоСегментуНоменклатуры
		|		ГДЕ
		|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
		|			
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПартииПереданныеНаКомиссию КАК ВидРегистра,
		|	Партии.ПериодДень         КАК ПериодДень,
		|	Партии.ПериодНеделя       КАК ПериодНеделя,
		|	Партии.ПериодДекада       КАК ПериодДекада,
		|	Партии.ПериодМесяц        КАК ПериодМесяц,
		|	Партии.ПериодКвартал      КАК ПериодКвартал,
		|	Партии.ПериодПолугодие    КАК ПериодПолугодие,
		|	Партии.ПериодГод          КАК ПериодГод,
		|	Партии.ПериодСекунда      КАК ПериодСекунда,
		|	
		|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения                КАК ЕдиницаХранения,
		|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов               КАК ЕдиницаДляОтчетов,
		|	АналитикаНоменклатуры.Номенклатура.Артикул                         КАК НоменклатураАртикул,
		|	
		|	АналитикаНоменклатуры.Характеристика      КАК Характеристика,
		|	АналитикаНоменклатуры.Серия               КАК Серия,
		|	АналитикаНоменклатуры.МестоХранения               КАК Склад,
		|	
		|	Партии.АналитикаУчетаНоменклатуры         КАК АналитикаУчетаНоменклатуры,
		|	Партии.ДокументПоступления                КАК ДокументПоступления,
		|	НЕОПРЕДЕЛЕНО                              КАК СтатьяРасходов,
		|	Партии.ДокументПоступления                КАК ДокументПоступленияРасходов,
		|	Партии.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		|	
		|	Партии.ВидЗапасов                         КАК ВидЗапасов,
		|	Партии.АналитикаУчетаПартий.Поставщик               КАК Поставщик,
		|	Партии.АналитикаУчетаПартий.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
		|
		|	Партии.Организация КАК Организация,
		|	ВЫБОР КОГДА Партии.Регистратор = НЕОПРЕДЕЛЕНО ТОГДА
		|		NULL
		|		ИНАЧЕ Партии.Регистратор
		|	КОНЕЦ                                     КАК Регистратор,
		|	
		|	ВЫБОР &ДанныеОтчета
		|		КОГДА 4
		|			ТОГДА Партии.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Партии.КоличествоНачальныйОстаток
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Партии.КоличествоНачальныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоНачальныйОстаток,
		|	
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Партии.КоличествоКонечныйОстаток
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Партии.КоличествоКонечныйОстаток / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоКонечныйОстаток,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Партии.КоличествоПриход
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Партии.КоличествоПриход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоПриход,
		|	
		|	ВЫБОР КОГДА &ЕдиницыКоличества = 0 ТОГДА
		|		Партии.КоличествоРасход
		|	КОГДА &ЕдиницыКоличества = 1 ТОГДА
		|		ВЫБОР КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0 ТОГДА
		|			Партии.КоличествоРасход / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|		ИНАЧЕ 0
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоРасход,
		|
		|	Партии.КоличествоНачальныйОстаток * &ТекстЗапросаВес       КАК НачальныйОстатокВес,
		|	ВЫБОР
		|		КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|		ИНАЧЕ Партии.КоличествоКонечныйОстаток * &ТекстЗапросаВес
		|	КОНЕЦ                                                      КАК КонечныйОстатокВес,
		|	Партии.КоличествоПриход * &ТекстЗапросаВес                 КАК ПриходВес,
		|	Партии.КоличествоРасход * &ТекстЗапросаВес                 КАК РасходВес,
		|	Партии.КоличествоНачальныйОстаток * &ТекстЗапросаОбъем     КАК НачальныйОстатокОбъем,
		|	ВЫБОР
		|		КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|		ИНАЧЕ Партии.КоличествоКонечныйОстаток * &ТекстЗапросаОбъем
		|	КОНЕЦ                                                      КАК КонечныйОстатокОбъем,
		|	Партии.КоличествоПриход * &ТекстЗапросаОбъем               КАК ПриходОбъем,
		|	Партии.КоличествоРасход * &ТекстЗапросаОбъем               КАК РасходОбъем,
		|	
		|	//СтоимостьПоступленияНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглНачальныйОстаток +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглНачальныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СтоимостьПоступленияНачальныйОстаток,
		|	
		|	//СтоимостьПоступленияКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьКонечныйОстаток 
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглКонечныйОстаток +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглКонечныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСКонечныйОстаток
		|	КОНЕЦ КАК СтоимостьПоступленияКонечныйОстаток,
		|	
		|	//СтоимостьПоступленияПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглПриход +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглПриход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СтоимостьПоступленияПриход,
		|	
		|	//СтоимостьПоступленияРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглРасход +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглРасход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СтоимостьПоступленияРасход,
		|	
		|	// НДСРеглНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.НДСРеглНачальныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглНачальныйОстаток,
		|	
		|	// НДСРеглКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.НДСРеглКонечныйОстаток
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглКонечныйОстаток,
		|	
		|	// НДСРеглПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.НДСРеглПриход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглПриход,
		|	
		|	// НДСРеглРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.НДСРеглРасход
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК НДСРеглРасход,
		|	
		|	//ДопРасходыНачальныйОстаток
		|	0 КАК ДопРасходыНачальныйОстаток,
		|
		|	//ДопРасходыКонечныйОстаток
		|	0 КАК ДопРасходыКонечныйОстаток,
		|
		|	//ДопРасходыПриход
		|	0 КАК ДопРасходыПриход,
		|
		|	//ДопРасходыРасход
		|	0 КАК ДопРасходыРасход,
		|	
		|	//СебестоимостьНачальныйОстаток
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьНачальныйОстаток
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглНачальныйОстаток +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглНачальныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСНачальныйОстаток
		|	КОНЕЦ КАК СебестоимостьНачальныйОстаток,
		|	
		|	//СебестоимостьКонечныйОстаток
		|	ВЫБОР КОГДА Константы.ПартионныйУчетВерсии22
		|				И (&КонецПериода >= Константы.ДатаПереходаНаПартионныйУчетВерсии22
		|					ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
		|			ТОГДА 0
		|	КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьКонечныйОстаток 
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглКонечныйОстаток +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглКонечныйОстаток
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСКонечныйОстаток
		|	КОНЕЦ КАК СебестоимостьКонечныйОстаток,
		|	
		|	//СебестоимостьПриход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьПриход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглПриход +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглПриход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСПриход
		|	КОНЕЦ КАК СебестоимостьПриход,
		|	
		|	//СебестоимостьРасход
		|	ВЫБОР КОГДА &ДанныеОтчета = 1 ТОГДА
		|		Партии.СтоимостьРасход
		|	КОГДА &ДанныеОтчета = 4 ТОГДА
		|		Партии.СтоимостьРеглРасход +
		|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
		|		ТОГДА
		|			Партии.НДСРеглРасход
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		Партии.СтоимостьБезНДСРасход
		|	КОНЕЦ КАК СебестоимостьРасход,
		|
		|	0 КАК СебестоимостьПредварительнаяПриход,
		|	0 КАК СебестоимостьПредварительнаяРасход,
		|	0 КАК СебестоимостьОтклонениеПриход,
		|	0 КАК СебестоимостьОтклонениеРасход
		|ИЗ
		|	РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.ОстаткиИОбороты(, {(&КонецПериода21)}, Авто, , &ДанныеПУ21) КАК Партии
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|	
		|{ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|	ПО
		|		Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
		|{ГДЕ
		|	(АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В (
		|		ВЫБРАТЬ
		|			ОтборПоСегментуНоменклатуры.Номенклатура,
		|			ОтборПоСегментуНоменклатуры.Характеристика
		|		ИЗ
		|			ОтборПоСегментуНоменклатуры
		|		ГДЕ
		|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
		|";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстЗапросаПУ21;			

КонецПроцедуры


#КонецОбласти

#КонецОбласти
