
&НаКлиенте
Процедура ПечатьВыделеного(Команда)
	Если НЕ АльтерраОбщегоНазначения._РольДоступна("ДобавлениеИзменениеПриемкаСдачаВыполненыхРаботУслуг") И НЕ АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава") И НЕ АльтерраОбщегоНазначения._РольДоступна("СлужбаПерсонала") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Недостаточно прав для формирования акта");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Исполнитель");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Организация");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидРабот) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Вид работ");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаНачало) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен Период");
		Возврат;
	КонецЕсли;
	
	МассивДокументов = ПолучитьМассивДокументовСервер(Исполнитель, Организация, ВидРабот, ДатаНачало, ДатаОкончания);
	Если МассивДокументов = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдено ни одного документа");
		Возврат;
	КонецЕсли;
	НомерАкта = 0;
	ПолучитьНомерАкта = ПолучитьНомерАктаСервер();
	Если ПолучитьНомерАкта <> Неопределено Тогда
		НомерАкта = ПолучитьНомерАкта + 1;
	Иначе
		НомерАкта = НомерАкта + 1;
	КонецЕсли;
	Коллекция = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПриемкаСдачаРаботМакет");
	ТабДокумент = Новый ТабличныйДокумент;
	n=1;
	ИтогиСумма = 0;
	ТабДокумент = ПечатьНаСервере(ТабДокумент, МассивДокументов, НомерАкта);
	Для Каждого Документ ИЗ МассивДокументов Цикл
		Структура = ПечатьНаСервереТабличнаяЧасть(ТабДокумент,Документ,n, ИтогиСумма);
		ТабДокумент = Структура.ТабДокумент;
		ИтогиСумма = Структура.ИтогиСумма;
		n = n + 1;
	КонецЦикла;
	ТабДокумент = ПечатьИтоговСервер(ТабДокумент, ИтогиСумма);
	СтруктураКоллекции = Коллекция.Получить(0);
	СтруктураКоллекции.ТабличныйДокумент = ТабДокумент;
	ЗаписатьНомераАктаДокумен(МассивДокументов, НомерАкта);
	УправлениеПечатьюКлиент.ПечатьДокументов(Коллекция);	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНомераАктаДокумен(МассивДокументов, НомерАкта)
	НачатьТранзакцию();
	Попытка
		Для Каждого Документ ИЗ МассивДокументов Цикл
			Документ = Документ.ПолучитьОбъект();
			Документ.НомерАкта = НомерАкта;
			Документ.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию()	
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерАктаСервер()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПриемкаСдачаВыполненныхРаботУслуг.НомерАкта КАК НомерАкта,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Дата КАК Дата,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.ПриемкаСдачаВыполненныхРаботУслуг КАК ПриемкаСдачаВыполненныхРаботУслуг
	|ГДЕ
	|	ПриемкаСдачаВыполненныхРаботУслуг.ПометкаУдаления = ЛОЖЬ
	|	И ПриемкаСдачаВыполненныхРаботУслуг.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВременнаяТаблица.НомерАкта) КАК НомерАкта
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерАкта;
	КонецЦикла;
КонецФункции

&НаСервере 
Функция ПолучитьМассивДокументовСервер(Исполнитель, Организация, ВидРабот, ДатаНачало, ДатаОкончания)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриемкаСдачаВыполненныхРаботУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриемкаСдачаВыполненныхРаботУслуг КАК ПриемкаСдачаВыполненныхРаботУслуг
	               |ГДЕ
	               |	ПриемкаСдачаВыполненныхРаботУслуг.Подрядчик = &Исполнитель
	               |	И ПриемкаСдачаВыполненныхРаботУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаОкончания
	               |	И ПриемкаСдачаВыполненныхРаботУслуг.ПометкаУдаления = ЛОЖЬ
	               |	И ПриемкаСдачаВыполненныхРаботУслуг.Проведен = ИСТИНА
				   //|	И ПриемкаСдачаВыполненныхРаботУслуг.НомерАкта = 0
	               |	И ПриемкаСдачаВыполненныхРаботУслуг.Организация = &Организация
				   |	И ПриемкаСдачаВыполненныхРаботУслуг.Работы.ВидРабот = &ВидРабот";
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(ДатаНачало));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ВидРабот", ВидРабот);
	ВыборкаДокументов = Запрос.Выполнить();
	Если НЕ ВыборкаДокументов.Пустой() Тогда
		МассивДокументов = Новый Массив;
		Выборка = ВыборкаДокументов.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДокументов.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Возврат МассивДокументов;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПечатьИтоговСервер(ТабДокумент, ИтогиСумма)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриемкаСдачаВыполненныхРаботУслуг.ПриемкаСдачаРаботМакет");
	Область = Макет.ПолучитьОбласть("Итоги");
	Область.Параметры.ИтогиСумма = ИтогиСумма;
	ТабДокумент.Вывести(Область);
	Возврат ТабДокумент;
КонецФункции

&НаСервере
Функция ПечатьНаСервере(ТабДокумент, МассивДокументов, НомерАкта)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриемкаСдачаВыполненныхРаботУслуг.ПриемкаСдачаРаботМакет");
	ДатаПоследнегоДокумента = Дата(1,1,1);
	ДатаПервогоДокумента = ТекущаяДата();
	Для Каждого Документ Из МассивДокументов Цикл
		Если Документ.Дата > ДатаПоследнегоДокумента Тогда
			ДатаПоследнегоДокумента = Документ.Дата;
		КонецЕсли;	
		Если Документ.Дата < ДатаПервогоДокумента Тогда
			ДатаПервогоДокумента = Документ.Дата;
		КонецЕсли;
		Исполнитель = Документ.Подрядчик;
		ИсполнительНаименование = Документ.Подрядчик.НаименованиеПолное;
		Заказчик = Документ.Организация;
		ЗаказчикНаименование = Документ.Организация.НаименованиеПолное;
		Подразделение = Документ.Подразделение;
	КонецЦикла;
		
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Датаформирования = ТекущаяДата();
	Область.Параметры.ДатаНачало = ДатаПервогоДокумента;
	Область.Параметры.ДатаОкончания = ДатаПоследнегоДокумента;
	Область.Параметры.Исполнитель = ИсполнительНаименование;
	Область.Параметры.Заказчик = ЗаказчикНаименование;
	Область.Параметры.НомерАкта = НомерАкта;
	//Область.Параметры.Подразделение = Подразделение;
	ПолучитьДанныеИсполнителя(Исполнитель,Область);
	ПолучитьДанныеЗаказчика(Заказчик,Область);

	ТабДокумент.Вывести(Область);
	Область = Макет.ПолучитьОбласть("ШапкаТабЧасть");
	ТабДокумент.Вывести(Область);
	Возврат ТабДокумент
КонецФункции

&НаСервере
Процедура ПолучитьДанныеЗаказчика(Организация,Область)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Наименование КАК Наименование,
	               |	Организации.ИНН КАК ИНН,
	               |	ОрганизацииКонтактнаяИнформация.Вид.Наименование КАК ВидНаименование,
	               |	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	               |	Организации.ОсновнойБанковскийСчет.Наименование КАК ОсновнойБанковскийСчетНаименование,
	               |	Организации.ОсновнойБанковскийСчет.БИКБанка КАК ОсновнойБанковскийСчетБИКБанка,
	               |	Организации.ОсновнойБанковскийСчет.КоррСчетБанка КАК ОсновнойБанковскийСчетКоррСчетБанка,
	               |	Организации.НаименованиеПолное КАК НаименованиеПолное
	               |ИЗ
	               |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |		ПО ОрганизацииКонтактнаяИнформация.Ссылка = Организации.Ссылка
	               |ГДЕ
				   //|	Организации.Наименование ПОДОБНО ""Альтерра ООО"""
				   |	Организации.Ссылка = &Организация";	
	Запрос.УстановитьПараметр("Организация",Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Область.Параметры.Заказчик = Выборка.НаименованиеПолное; 
		Область.Параметры.ИННЗаказчика = Выборка.ИНН; 
		Если Выборка.ВидНаименование = "Юридический адрес" Тогда
			Область.Параметры.АдресЗаказчика = "Юридический адрес: " + Выборка.Представление;
		ИначеЕсли Выборка.ВидНаименование = "Телефон" Тогда
			Область.Параметры.ТелефонЗаказчика  = "тел.: " + Выборка.Представление;
		КонецЕсли;
		Область.Параметры.Банк = "Банк: " +  Выборка.ОсновнойБанковскийСчетНаименование;
		Область.Параметры.БИК = "БИК: " +  Выборка.ОсновнойБанковскийСчетБИКБанка;
		Область.Параметры.КоррСчет = "к/с: " + Выборка.ОсновнойБанковскийСчетКоррСчетБанка; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеИсполнителя(Контрагент, Область)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрагентыКонтактнаяИнформация.Вид.Наименование КАК ВидНаименование,
	               |	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
	               |	КонтрагентыКонтактнаяИнформация.Ссылка.ИНН КАК ИНН,
	               |	КонтрагентыКонтактнаяИнформация.Ссылка.КПП КАК КПП
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ первые 1
	               |	БанковскиеСчетаКонтрагентов.Наименование КАК НаименованиеБанка,
	               |	БанковскиеСчетаКонтрагентов.Банк.КоррСчет КАК БанкКоррСчет,
	               |	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
	               |	БанковскиеСчетаКонтрагентов.Банк.Код КАК БанкКод
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	               |		ПО ДоговорыКонтрагентов.БанковскийСчетКонтрагента = БанковскиеСчетаКонтрагентов.Ссылка
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Контрагент = &Контрагент";
				   //|	И ДоговорыКонтрагентов.Наименование = ""Аутсорс""";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаКонтакты = МассивРезультатов[0].Выбрать();
	Пока ВыборкаКонтакты.Следующий() Цикл
		Если ВыборкаКонтакты.ВидНаименование = "Фактический адрес" Тогда
			Область.Параметры.Адрес = "Юридический адрес: " + Строка(ВыборкаКонтакты.Представление);
		ИначеЕсли ВыборкаКонтакты.ВидНаименование = "Адрес" Тогда
			Область.Параметры.Адрес2 = "Адрес для почтовой корреспонденции: " + Строка(ВыборкаКонтакты.Представление);
		ИначеЕсли ВыборкаКонтакты.ВидНаименование = "Электронная почта" Тогда
			Область.Параметры.АдресЭП = "Адрес электронной почты: " + Строка(ВыборкаКонтакты.Представление);
		КонецЕсли;
		Область.Параметры.ИННИсполнителя = "ИНН: " + ВыборкаКонтакты.ИНН;
		Область.Параметры.КППИсполнителя = "КПП: " + ВыборкаКонтакты.КПП;
	КонецЦикла;
	ВыборкаРеквизитыБанка = МассивРезультатов[1].Выбрать();
	Пока ВыборкаРеквизитыБанка.Следующий() Цикл
		Область.Параметры.БанкИсполнителя = "Банк: " + ВыборкаРеквизитыБанка.НаименованиеБанка;
		Область.Параметры.РасчетСчетИсполнителя = "р/c: " + ВыборкаРеквизитыБанка.НомерСчета;
		Область.Параметры.КсчетИсполнителя = "к/с: " + ВыборкаРеквизитыБанка.БанкКоррСчет;
		Область.Параметры.БИКИсполнителя = "БИК: " + ВыборкаРеквизитыБанка.БанкКод;
	КонецЦикла
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервереТабличнаяЧасть(ТабДокумент,Строка,НомерСтроки,ИтогиСумма)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриемкаСдачаВыполненныхРаботУслуг.ПриемкаСдачаРаботМакет");
	Область = Макет.ПолучитьОбласть("ТабЧасть");
	Область.Параметры.НомерСтроки =  НомерСтроки;
	Область.Параметры.ЕдиницыИзмирения = "ч";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ДатаРабот КАК Дата,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подразделение КАК Подразделение,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подразделение.Адрес КАК ПодразделениеАдрес,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ВремяФакт КАК ВремяФакт,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.Сумма КАК Сумма,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ВидРабот.Номенклатура КАК ВидНоменклатуры,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подрядчик КАК Подрядчик,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ВидРабот КАК ВидРабот
	|ИЗ
	|	Документ.ПриемкаСдачаВыполненныхРаботУслуг.Работы КАК ПриемкаСдачаВыполненныхРаботУслугРаботы
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ПриемкаСдачаВыполненныхРаботУслуг КАК ПриемкаСдачаВыполненныхРаботУслуг
	|		ПО (ПриемкаСдачаВыполненныхРаботУслугРаботы.Ссылка = ПриемкаСдачаВыполненныхРаботУслуг.Ссылка)
	|ГДЕ
	|	ПриемкаСдачаВыполненныхРаботУслуг.Ссылка = &Ссылка
	|ИТОГИ
	|	МИНИМУМ(Дата),
	|	МАКСИМУМ(ПодразделениеАдрес),
	|	СУММА(ВремяФакт),
	|	СУММА(Сумма),
	|	МИНИМУМ(Подрядчик),
	|	МИНИМУМ(ВидРабот),
	|	МАКСИМУМ(Подразделение) КАК Подразделение
	|ПО
	|	ВидНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка", Строка);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидНоменклатуры");
	Пока Выборка.Следующий() Цикл
		Область.Параметры.ВидРабот = Выборка.ВидНоменклатуры;
		Область.Параметры.ДатаДокумента = Выборка.Дата;
		Область.Параметры.Адрес = Выборка.ПодразделениеАдрес;
		Область.Параметры.ВремяФакт = Выборка.ВремяФакт;
		Область.Параметры.Сумма = Выборка.Сумма;
		ПроцентПодрядчика = ПолучитьПроцентПодрядчика(Выборка.Подрядчик);
		Тариф = Документы.ПриемкаСдачаВыполненныхРаботУслуг.ОпределениеЦеныРабот(Выборка.Подрядчик, Выборка.ВидРабот, Выборка.Подразделение);
		Область.Параметры.ТарифПоМесяцу = (Тариф *(ПроцентПодрядчика/100)) + Тариф; 
		ИтогиСумма = ИтогиСумма+Выборка.Сумма;
		СотрудникЗаказчик = АльтерраОбщегоНазначения.ПолучитьСотрудника(Строка.Заказчик);
		Область.Параметры.СекцияЗаказчик = СотрудникЗаказчик.Отдел;
		мФИОРаботников = ПолучитьФИОРаботников(Строка);
		стрФИОРаботников = СтрСоединить(мФИОРаботников, Символы.ПС);
		Область.Параметры.ФИОРаботников = стрФИОРаботников;
	КонецЦикла;
	ТабДокумент.Вывести(Область);
	
	Структура = Новый Структура("ТабДокумент", "ИтогиСумма", Неопределено, Неопределено);
	Структура.Вставить("ТабДокумент", ТабДокумент);
	Структура.Вставить("ИтогиСумма", ИтогиСумма);
	Возврат Структура;
КонецФункции

&НаСервере
Функция ПолучитьПроцентПодрядчика(Партнер)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ДополнительныеСведения.Объект = Контрагенты.Партнер)
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И Контрагенты.Ссылка = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ПроцентАутсорс");
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;			
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьФИОРаботников(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ФИОРаботника КАК ФИОРаботника
		|ИЗ
		|	Документ.ПриемкаСдачаВыполненныхРаботУслуг.Работы КАК ПриемкаСдачаВыполненныхРаботУслугРаботы
		|ГДЕ
		|	ПриемкаСдачаВыполненныхРаботУслугРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	МассивРаботников = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивРаботников.Добавить(Выборка.ФИОРаботника);
	КонецЦикла;
	Возврат МассивРаботников;
КонецФункции


&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СвойМассивЗначений = ОтборПартнера();
	ПараметрыОтбора = Новый Структура("Ссылка", СвойМассивЗначений);
	ПараметрыОткрытия = Новый Структура("Отбор", ПараметрыОтбора); 
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыОткрытия,Элемент, ЭтаФорма);
КонецПроцедуры 

&НаСервере
Функция ОтборПартнера()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Партнер
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ДополнительныеСведения.Объект = Контрагенты.Партнер)
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование ПОДОБНО  ""%ПроцентАутсорс%""
	|	И ДополнительныеСведения.Значение > 0";
	Выборка = Запрос.Выполнить().Выбрать();
	МассивПартнеров = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивПартнеров.Добавить(Выборка.Партнер);
	КонецЦикла;
	Возврат МассивПартнеров;
КонецФункции


&НаКлиенте
Процедура ВидРаботНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.Очистить();
	СвойМассивЗначений = ОтборНоменклатурыПартнера(Исполнитель);
	Элемент.СписокВыбора.ЗагрузитьЗначения(СвойМассивЗначений);
	Партнер = ПартнерНаСервере();
	ПараметрыОтбора = Новый Структура("ВладелецНоменклатуры", Партнер);
	ПараметрыОткрытия = Новый Структура("Отбор", ПараметрыОтбора); 
	ОткрытьФорму("Справочник.НоменклатураКонтрАгентов.ФормаВыбора", ПараметрыОткрытия, Элемент, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПартнерНаСервере()
	Возврат Исполнитель.Партнер;
КонецФункции

&НаСервере
Функция ОтборНоменклатурыПартнера(Подрядчик)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (НоменклатураКонтрагентов.ВладелецНоменклатуры = Контрагенты.Партнер)
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Подрядчик);
	Выборка = запрос.Выполнить().Выбрать();
	Массив = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	СвойМассивЗначений = ОтборНоменклатурыПартнера(Исполнитель);
	Элементы.ВидРабот.СписокВыбора.ЗагрузитьЗначения(СвойМассивЗначений);
КонецПроцедуры




