#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	Номер = 0;
	Дата = 0;
	СтатусДоговора = Справочники.СтатусыДоговоров.РазрабатываетсяИсполнителем;
	Сумма = 0;
	ДопустимаяСуммаЗадолженности = 0;
	ЗапрещаетсяПросроченнаяЗадолженность = ложь;
	КоличествоДнейПросрочки = 0; 
	Комментарий = "";
	РазрешитьОтгрузкуПриПревышении = Ложь;
	ОграничиватьСуммуЗадолженности = Ложь;
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	если не значениезаполнено(СтавкаНДС) тогда
	СтавкаНДС=УчетНДСУП.СтавкаНДСПоУмолчанию(Организация,ТекущаяДатаСеанса());
	конецесли;
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("СтавкаНДС");
КонецПроцедуры	
#КонецОбласти

#КонецЕсли