#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&НаСервере
Процедура ОбновитьЗаписьВРегистре(Ссылка) Экспорт 
	УстановитьПривилегированныйРежим(Истина); 	
	Запрос = Новый Запрос;
 	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзучениеАссортимента.Ссылка КАК Ссылка,
	|	ИзучениеАссортимента.Дата КАК Период,
	|	ИзучениеАссортимента.Склад КАК Склад,
	|	ИзучениеАссортимента.Секция КАК Секция,
	|	ИзучениеАссортимента.ТочкаПересчетаОбучение КАК ТочкаПересчетаОбучение,
	|	ИзучениеАссортимента.Сотрудник КАК Сотрудник,
	|	ИзучениеАссортимента.Статус КАК Статус,
	|	ИзучениеАссортимента.ПоследняяОткрытаяСтрока КАК ПоследняяОткрытаяСтрока,
	|	ИзучениеАссортимента.ВремяВСекундах КАК ВремяВСекундах,
	|	СУММА(ВЫБОР
	|			КОГДА ИзучениеАссортиментаАссортимент.Проверено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПроверено,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ИзучениеАссортиментаАссортимент.Проверено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОшибок
	|ИЗ
	|	Документ.ИзучениеАссортимента КАК ИзучениеАссортимента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзучениеАссортимента.Ассортимент КАК ИзучениеАссортиментаАссортимент
	|		ПО (ИзучениеАссортимента.Ссылка = ИзучениеАссортиментаАссортимент.Ссылка)
	|ГДЕ
	|	ИзучениеАссортимента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзучениеАссортимента.Ссылка,
	|	ИзучениеАссортимента.Дата,
	|	ИзучениеАссортимента.Склад,
	|	ИзучениеАссортимента.Секция,
	|	ИзучениеАссортимента.ТочкаПересчетаОбучение,
	|	ИзучениеАссортимента.Сотрудник,
	|	ИзучениеАссортимента.Статус,
	|	ИзучениеАссортимента.ВремяВСекундах,
	|	ИзучениеАссортимента.ПоследняяОткрытаяСтрока";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить(); 
	
	Выборка = Результат.Выбрать(); 
	
	Если Выборка.Следующий() Тогда  
		
		НаборЗапись = РегистрыСведений.ИзучениеАссортимента.СоздатьНаборЗаписей();
		НаборЗапись.Отбор.Регистратор.Установить(Ссылка);
		НаборЗапись.Прочитать();
			Если НаборЗапись.Количество() = 0 Тогда
			    ЗаписьВРегистр = НаборЗапись.Добавить();
			Иначе
				ЗаписьВРегистр = НаборЗапись[0];
			КонецЕсли;
		ЗаписьВРегистр.Период = Выборка.Период;	
		ЗаписьВРегистр.Регистратор = Выборка.Ссылка;	
		ЗаписьВРегистр.Склад = Выборка.Склад;
		ЗаписьВРегистр.Секция = Выборка.Секция;
		ЗаписьВРегистр.ТочкаПересчетаОбучение = Выборка.ТочкаПересчетаОбучение; 
		ЗаписьВРегистр.Сотрудник = Выборка.Сотрудник;
		ЗаписьВРегистр.Статус = Выборка.Статус;
		ЗаписьВРегистр.ПоследняяОткрытаяСтрока = Выборка.ПоследняяОткрытаяСтрока;	
		ЗаписьВРегистр.ВремяВСекундах = Выборка.ВремяВСекундах;
		ЗаписьВРегистр.КоличествоПроверено = Выборка.КоличествоПроверено;
		ЗаписьВРегистр.КоличествоОшибок = Выборка.КоличествоОшибок;
		НаборЗапись.Записать(Истина);        
				
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь); 


КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьВРегистре(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	
	НаборЗапись = РегистрыСведений.ИзучениеАссортимента.СоздатьНаборЗаписей();
	НаборЗапись.Отбор.Регистратор.Установить(Ссылка);
	НаборЗапись.Записать();
   
	УстановитьПривилегированныйРежим(Ложь);  
КонецПроцедуры

#КонецЕсли