
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СОтборами") Тогда
		мЗаказов = Документы.ЗаданиеНаПеревозкуРейс.ПолучитьмЗаказовПоКоторымНетРейсов();	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Ссылка", мЗаказов, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	КонецЕсли;
		
	Если Параметры.Свойство("МассивТиповТС") И ЗначениеЗаполнено(Параметры.МассивТиповТС) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ТипТС", Параметры.МассивТиповТС, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	КонецЕсли;
КонецПроцедуры
