&После ("ДополнитьТекстыЗапросовПроведения")
Процедура Док_ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект) Экспорт
	
    Документы.ПриобретениеТоваровУслуг.ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект); 
		
КонецПроцедуры

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("РасходыПоОбъектам");    
	МеханизмыДокумента.Добавить("ДвижениеМаркированногоТовара"); 
КонецПроцедуры
