#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата = ТекущаяДата();
	ДатаНачала = ТекДата;
	ДатаОкончания = ТекДата; 	
	ОбновитьСписок();  
	УстановитьПраваНаИзменения();
	
КонецПроцедуры

Процедура УстановитьПраваНаИзменения()
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	ПравоНаИзменение = ПолныеПрава Или РольДоступна("ОтделЛогистики");

КонецПроцедуры	 

#КонецОбласти

#Область ДинамическийСписок

&НаСервере
Процедура ОбновитьСписок()
	
	Закрепление.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДатаНачала));
	Закрепление.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДатаОкончания));	
	
КонецПроцедуры	

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияСРегистром

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ИзменитьЗаписьРегистра();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗакрепление(Команда)

	ИзменитьЗаписьРегистра();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗаписьРегистра()
	
	ВозможностьДействия = ВозможностьДействийСРегистром();
	Если Не ВозможностьДействия.Результат Тогда
		Сообщить(ВозможностьДействия.Сообщение);
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущиеДанные <> Неопределено Тогда

		СтруктураЗаписи = Новый Структура("Период, Клиент, ВидМенеджераКлиента", 
			ТекущиеДанные.НачалоЗакрепления, ТекущиеДанные.Клиент, ТекущиеДанные.ВидМенеджераКлиента);

		МассивСтруктураЗаписи = Новый Массив;
		МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
		КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ЗакреплениеКлиентов", МассивСтруктураЗаписи);
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗаписи", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущаяСтрока));
                              
		Параметрыформы = Новый Структура("Ключ", КлючЗаписи);                            
		ОткрытьФорму("РегистрСведений.ЗакреплениеКлиентов.ФормаЗаписи", Параметрыформы, ЭтотОбъект, , , , Оповещение);
    КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияФормыЗаписи(ВыбранноеЗначение, ПараметрыОповещения) Экспорт
	
	Элементы.Список.Обновить();
	Элементы.Список.ВыделенныеСтроки.Очистить();
	Элементы.Список.ВыделенныеСтроки.Добавить(ПараметрыОповещения.ТекущаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗакрепление(Команда)
	
	ВозможностьДействия = ВозможностьДействийСРегистром();
	Если Не ВозможностьДействия.Результат Тогда
		Сообщить(ВозможностьДействия.Сообщение);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено Тогда
		
		СтруктураЗаписи = Новый Структура("Период, Клиент, ВидМенеджераКлиента", 
			ТекущиеДанные.НачалоЗакрепления, ТекущиеДанные.Клиент, ТекущиеДанные.ВидМенеджераКлиента);
		
  		Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияУдаленияЗаписи", ЭтотОбъект, СтруктураЗаписи);	
 
	    ПоказатьВопрос(Оповещение, СтрШаблон("Удалить закрепление на клиента %1 на %2?",
				ТекущиеДанные.Клиент, Формат(ТекущиеДанные.НачалоЗакрепления, "ДФ=дд.ММ.гггг")),
	    	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, "Удалить закрепление");   		

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияУдаленияЗаписи(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда      
		УдалитьЗаписьРегистра(Параметры);
		ПослеЗакрытияФормыЗаписи(Неопределено, Новый Структура("ТекущаяСтрока", Элементы.Список.ТекущаяСтрока))
    КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьРегистра(ЗаписьРегистра)
	
	НаборЗаписей = РегистрыСведений.ЗакреплениеКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ЗаписьРегистра.Период);
	НаборЗаписей.Отбор.Клиент.Установить(ЗаписьРегистра.Клиент);
	НаборЗаписей.Отбор.ВидМенеджераКлиента.Установить(ЗаписьРегистра.ВидМенеджераКлиента);
	НаборЗаписей.Записать();
	
КонецПроцедуры		

&НаКлиенте
Функция ВозможностьДействийСРегистром()
	
	РезультатВыполнения = Новый Структура("Результат, Сообщение", Истина, "");
	
	Если Не	ПравоНаИзменение Тогда
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.Сообщение = "Отсутствуют права на изменение закрепления";
	КонецЕсли;
	
	Если Не ПолныеПрава Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные.НачалоЗакрепления < ТекущаяДата() Тогда
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.Сообщение = "Действия с закреплением невозможно для прошедших дат";
		КонецЕсли; 
		
	КонецЕсли;		
	
	Возврат РезультатВыполнения;
	
КонецФункции	

#КонецОбласти 

