#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ, Замещение)
	
	Попытка
		СпрОбъект = ЭтотОбъект.Отбор.НоменклатураБрак.Значение.ПолучитьОбъект();
		Спробъект.МенеджерПоставок = ЭтотОбъект.Отбор.Номенклатура.Значение.МенеджерПоставок; 
		СпрОбъект.КатегорийныйМенеджер = ЭтотОбъект.Отбор.Номенклатура.Значение.КатегорийныйМенеджер;
		СпрОбъект.Записать();
	Исключение  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать менеджера поставок и категорийного менеджера в товар другого качества";
		Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры
	   
#КонецЕсли
