
&НаСервере
Функция ПолучитьВерсиюБСП()
	Возврат СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
КонецФункции

&НаКлиенте
Функция РазложитьСтрокуНаМассивПодстрок(Знач Строка, Разделитель = ";", ПропускатьПустыеСтроки = Истина)
	
	Результат = Новый Массив;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПустаяСтрока(Подстрока) или не ПропускатьПустыеСтроки Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Результат.Добавить(Строка);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Печать(ИдентификаторКоманды,ПараметрКоманды) Экспорт
	
	Состояние(НСтр("ru = 'Выполняется формирование печатных форм'"));
	
	ПроверитьГлобальныеНастройки();
	
	Попытка
		
		ИменаМакетов=Новый Массив;
		ИменаМакетов.Добавить("ПокупательБюджетныйDOC");
		
		МакетыИОбласти=ПолучитьМакетыИОбласти(ИменаМакетов);
		ДвоичныеДанныеМакетов=МакетыИОбласти.ДвоичныеДанныеМакетов;
		ОписанияОбластей=МакетыИОбласти.ОписанияОбластей;
		
		Для каждого ОбъектСсылка Из ПараметрКоманды Цикл
			Если (ИдентификаторКоманды="ПечатьДоговораИзФормы") Тогда
				// ничего не делаем - данные формы уже загружены
			Иначе
				Если (Договор=ОбъектСсылка) Тогда
					// ничего не делаем - данные формы уже загружены
				Иначе
					Договор=ОбъектСсылка;
					ЗагрузитьДанныеФормы();
				КонецЕсли;
			КонецЕсли;
			
			Если ТипДоговора=ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
				ИмяМакета="Покупатель";
			ИначеЕсли ТипДоговора=ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком") Тогда
				ИмяМакета="Поставщик";
			Иначе
				Предупреждение(""+Организация+"\"+Контрагент+"\"+Договор+": "+"Печать договоров с типом '"+ТипДоговора+"' не поддерживается!",10);
				Продолжить;
			КонецЕсли;
			
			ТипМакета=ГлобальныйТипМакета;
			ИмяМакета=ИмяМакета+Строка(НазваниеШаблона)+ТипМакета;
			
			ДвоичныеДанныеМакета=ДвоичныеДанныеМакетов[ИмяМакета];
			Если (ДвоичныеДанныеМакета=Неопределено) Тогда
				Предупреждение(""+Организация+"\"+Контрагент+"\"+Договор+": "+"Шаблон '"+ИмяМакета+"' не найден!",10);
				Продолжить;
			КонецЕсли;
			
			ДанныеОбъекта=ПолучитьДанныеОбъекта(Договор, ИмяМакета);
			ВерсияБСП=ПолучитьВерсиюБСП();
			МасСтр=РазложитьСтрокуНаМассивПодстрок(ВерсияБСП,".");
			ВерсияБСП_старш=0;
			ВерсияБСП_младш=0;
			Если МасСтр.Количество()>=2 Тогда
				Попытка
					ВерсияБСП_старш=Число(МасСтр[0]);
					ВерсияБСП_младш=Число(МасСтр[1]);
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Макет=УправлениеПечатьюКлиент.ИнициализироватьМакет(ДвоичныеДанныеМакета,ТипМакета);
			НастройкиСтраницыМакета=Макет.НастройкиСтраницыМакета;
			Если (ВерсияБСП_старш>=2) Тогда
				ПечатнаяФорма=УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета,НастройкиСтраницыМакета,Макет);
			Иначе
				ПечатнаяФорма=УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета,НастройкиСтраницыМакета);
			КонецЕсли;
			
			Если (ПечатнаяФорма<>Неопределено) И (Макет<>Неопределено) Тогда
				Область=УправлениеПечатьюКлиент.ПолучитьОбласть(Макет,ОписанияОбластей[ИмяМакета]["ВерхнийКолонтитул"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,ДанныеОбъекта);
				
				Область=УправлениеПечатьюКлиент.ПолучитьОбласть(Макет,ОписанияОбластей[ИмяМакета].Договор);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,ДанныеОбъекта);
				Если (ВерсияБСП_старш<2) Тогда
					УправлениеПечатьюКлиент.ЗаполнитьПараметры(ПечатнаяФорма,ДанныеОбъекта);
				КонецЕсли;
				
				Область=УправлениеПечатьюКлиент.ПолучитьОбласть(Макет,ОписанияОбластей[ИмяМакета]["НижнийКолонтитул"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,ДанныеОбъекта);
				
				УправлениеПечатьюКлиент.ПоказатьДокумент(ПечатнаяФорма);
			КонецЕсли;
			
			УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма, Ложь);
			УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
		КонецЦикла;
		
		Состояние(НСтр("ru = 'Формирование печатных форм завершено'"));
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма);
		УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
		
		Возврат;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДвоичныеДанныеМакетов(ИменаМакетов)
	
	ДвоичныеДанныеМакетов=Новый Соответствие;
	
	Если (ГлобальноеМестоХраненияШаблонов="МакетыОбработки") Тогда
		ОбработкаОбъект=РеквизитФормыВЗначение("Объект");
		
		Для каждого ИмяМакета Из ИменаМакетов Цикл
			Попытка
				Макет=ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
				ДвоичныеДанныеМакетов.Вставить(ИмяМакета,Макет);
			Исключение
				// нет такого макета
			КонецПопытки;
		КонецЦикла; 
	ИначеЕсли (ГлобальноеМестоХраненияШаблонов="СправочникФизЛица") Тогда
		
		Если ЗначениеЗаполнено(ГлобальныйДержательШаблонов) Тогда
			// поиск шаблонов в справочнике ФизическиеЛицаПрисоединенныеФайлы
			
			Запрос=Новый Запрос;
			Запрос.Текст="
			|select allowed
			| ФайлыШаблонов.Ссылка as Ссылка
			|,ФайлыШаблонов.Наименование as ИмяШаблона
			|,ФайлыШаблонов.Расширение as РасширениеШаблона
			|from
			| Справочник.ФизическиеЛицаПрисоединенныеФайлы as ФайлыШаблонов
			|where (ФайлыШаблонов.ВладелецФайла=&ТекДержатель) and НЕ(ФайлыШаблонов.ПометкаУдаления) and (ФайлыШаблонов.Наименование in (&ИменаШаблонов)) and (ФайлыШаблонов.Расширение in (&РасширенияШаблонов))
			
			|";
			
			РасширенияШаблонов=Новый Массив;
			РасширенияШаблонов.Добавить("DOC");
			РасширенияШаблонов.Добавить("ODT");
			
			Запрос.УстановитьПараметр("ТекДержатель",ГлобальныйДержательШаблонов);
			Запрос.УстановитьПараметр("ИменаШаблонов",ИменаМакетов);
			Запрос.УстановитьПараметр("РасширенияШаблонов",РасширенияШаблонов);
			РезЗапроса=Запрос.Выполнить();
			
			Если НЕ РезЗапроса.Пустой() Тогда
				// найден
				Выборка=РезЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					Для каждого ИмяМакета Из ИменаМакетов Цикл
						Если (ВРЕГ(Выборка.ИмяШаблона)=ВРЕГ(ИмяМакета)) И (ВРЕГ(Выборка.РасширениеШаблона)=ВРЕГ(Прав(ИмяМакета,3))) Тогда
							
							Макет=Неопределено;
							ШаблонСсылка=Выборка.Ссылка;
							
							ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
							ПараметрыДанныхФайла.ИдентификаторФормы = УникальныйИдентификатор;
							ДанныеФайла = РаботаСФайлами.ДанныеФайла(ШаблонСсылка, ПараметрыДанныхФайла);
							
							СсылкаНаДвоичныеДанныеФайла=ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
							Если ЭтоАдресВременногоХранилища(СсылкаНаДвоичныеДанныеФайла) Тогда
								Макет=ПолучитьИзВременногоХранилища(СсылкаНаДвоичныеДанныеФайла);
								УдалитьИзВременногоХранилища(СсылкаНаДвоичныеДанныеФайла);
							КонецЕсли;
							
							ДвоичныеДанныеМакетов.Вставить(ИмяМакета,Макет);
							
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДвоичныеДанныеМакетов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписанияОбластейМакетов(ИменаМакетов)
	
	ОписанияОбластей=Новый Структура;
	
	Для каждого ИмяМакета Из ИменаМакетов Цикл
		
		НаборОбластей=Новый Структура;
		Если (ИмяМакета="ПокупательБюджетныйDOC") ИЛИ (ИмяМакета="ПокупательODT") ИЛИ (ИмяМакета="ПоставщикDOC") ИЛИ (ИмяМакета="ПоставщикODT") Тогда
			УправлениеПечатью.ДобавитьОписаниеОбласти(НаборОбластей, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
			УправлениеПечатью.ДобавитьОписаниеОбласти(НаборОбластей, "Договор",				"Общая");
			УправлениеПечатью.ДобавитьОписаниеОбласти(НаборОбластей, "НижнийКолонтитул",	"НижнийКолонтитул");
		КонецЕсли;
		ОписанияОбластей.Вставить(ИмяМакета,НаборОбластей);
	КонецЦикла;
	
	Возврат ОписанияОбластей;
	
КонецФункции

&НаСервере
Функция ПолучитьМакетыИОбласти(ИменаМакетов)
	
	МакетыИОбласти=Новый Структура;
	ДвоичныеДанныеМакетов=ПолучитьДвоичныеДанныеМакетов(ИменаМакетов);
	МакетыИОбласти.Вставить("ДвоичныеДанныеМакетов",ДвоичныеДанныеМакетов);
	ОписанияОбластей=ПолучитьОписанияОбластейМакетов(ИменаМакетов);
	МакетыИОбласти.Вставить("ОписанияОбластей",ОписанияОбластей);
	
	Возврат МакетыИОбласти;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ВставитьДанныеОбъекта(ДанныеОбъекта,ИмяПоля,ТекЗначение,ПустоеЗначение=" ")
	Если ЗначениеЗаполнено(ТекЗначение) Тогда
		НовоеЗначение=ТекЗначение;
	Иначе
		НовоеЗначение=ПустоеЗначение;
	КонецЕсли;
	
	ДанныеОбъекта.Вставить(ИмяПоля,НовоеЗначение);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект, ИмяМакета)
	
	ПустаяДатаПрописью="""___"" ___________ 20__ г.";
	ПустаяСтрока="                                                                                                                            ";
	
	ДанныеОбъекта=Новый Структура;
	
	ТекстЗапроса1 = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Договоры.Организация КАК Организация,
	|	Договоры.БанковскийСчет КАК БанковскийСчет,
	|	Договоры.Контрагент КАК Контрагент,
	|	Договоры.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента
	|ПОМЕСТИТЬ Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка = &ТекДоговор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(СчетаОрг.НомерСчета) КАК ОрганизацияНомерСчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СчетаОрг.РучноеИзменениеРеквизитовБанка
	|				ТОГДА СчетаОрг.БИКБанка
	|			ИНАЧЕ БанкиОрг.Код
	|		КОНЕЦ) КАК ОрганизацияБИК,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СчетаОрг.РучноеИзменениеРеквизитовБанка
	|				ТОГДА СчетаОрг.НаименованиеБанка + "" "" + СчетаОрг.ГородБанка
	|			ИНАЧЕ БанкиОрг.Наименование + "" "" + БанкиОрг.Город
	|		КОНЕЦ) КАК ОрганизацияБанк,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СчетаОрг.РучноеИзменениеРеквизитовБанка
	|				ТОГДА СчетаОрг.КоррСчетБанка
	|			ИНАЧЕ БанкиОрг.КоррСчет
	|		КОНЕЦ) КАК ОрганизацияКоррСчет,
	|	Организации.НаименованиеСокращенное КАК ОрганизацияНаименование,
	|	МАКСИМУМ(Организации.ОГРН) КАК ОрганизацияОГРН,
	|	МАКСИМУМ(Организации.ИНН) КАК ОрганизацияИНН,
	|	МАКСИМУМ(Организации.КПП) КАК ОрганизацияКПП,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АдресаОрг.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
	|				ТОГДА АдресаОрг.Представление
	|		КОНЕЦ) КАК ОрганизацияЮрАдрес,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АдресаОрг.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации)
	|				ТОГДА АдресаОрг.Представление
	|		КОНЕЦ) КАК ОрганизацияПочтАдрес,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АдресаОрг.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
	|				ТОГДА АдресаОрг.Представление
	|		КОНЕЦ) КАК ОрганизацияЭП,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АдресаОрг.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации)
	|				ТОГДА АдресаОрг.Представление
	|		КОНЕЦ) КАК ОрганизацияФакс,
	|	МАКСИМУМ(СчетаКонтр.НомерСчета) КАК КонтрагентНомерСчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СчетаКонтр.РучноеИзменениеРеквизитовБанка
	|				ТОГДА СчетаКонтр.БИКБанка
	|			ИНАЧЕ БанкиКонтр.Код
	|		КОНЕЦ) КАК КонтрагентБИК,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СчетаКонтр.РучноеИзменениеРеквизитовБанка
	|				ТОГДА СчетаКонтр.НаименованиеБанка + "" "" + СчетаКонтр.ГородБанка
	|			ИНАЧЕ БанкиКонтр.Наименование + "" "" + БанкиКонтр.Город
	|		КОНЕЦ) КАК КонтрагентБанк,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СчетаКонтр.РучноеИзменениеРеквизитовБанка
	|				ТОГДА СчетаКонтр.КоррСчетБанка
	|			ИНАЧЕ БанкиКонтр.КоррСчет
	|		КОНЕЦ) КАК КонтрагентКоррСчет,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименование,
	|	МАКСИМУМ(Контрагенты.ИНН) КАК КонтрагентИНН,
	|	МАКСИМУМ(Контрагенты.КПП) КАК КонтрагентКПП,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АдресаКонтр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	|				ТОГДА АдресаКонтр.Представление
	|		КОНЕЦ) КАК КонтрагентЮрАдрес,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АдресаКонтр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента)
	|				ТОГДА АдресаКонтр.Представление
	|		КОНЕЦ) КАК КонтрагентПочтАдрес,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АдресаКонтр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
	|				ТОГДА АдресаКонтр.Представление
	|		КОНЕЦ) КАК КонтрагентЭП,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АдресаКонтр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагенты)
	|				ТОГДА АдресаКонтр.Представление
	|		КОНЕЦ) КАК КонтрагентФакс
	|ИЗ
	|	Договоры КАК Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК СчетаОрг
	|		ПО Договоры.БанковскийСчет = СчетаОрг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанковРФ КАК БанкиОрг
	|		ПО (СчетаОрг.Банк = БанкиОрг.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Договоры.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК АдресаОрг
	|		ПО Договоры.Организация = АдресаОрг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК СчетаКонтр
	|		ПО Договоры.БанковскийСчетКонтрагента = СчетаКонтр.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанковРФ КАК БанкиКонтр
	|		ПО (СчетаКонтр.Банк = БанкиКонтр.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО Договоры.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК АдресаКонтр
	|		ПО Договоры.Контрагент = АдресаКонтр.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Организации.НаименованиеСокращенное,
	|	Контрагенты.НаименованиеПолное"; 
	
	Запрос=Новый Запрос;
	
	//Формирование текста запроса в зависимости от наименования макета.
	Если ИмяМакета = "ПокупательБюджетныйDOC" Тогда
		
		Запрос.Текст = ТекстЗапроса1;
		
	ИначеЕсли ИмяМакета = "ИмяМакета" Тогда
		
		Запрос.Текст = ТекстЗапроса1+"ТекстЗапроса";
				
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекДоговор",Договор);
	РезЗапроса=Запрос.Выполнить();
	
	Если НЕ РезЗапроса.Пустой() Тогда
		// найден
		Выборка=РезЗапроса.Выбрать();
		Выборка.Следующий();
		
		//Заполнение полей шаблона в зависимости от имени шаблона
		Если ИмяМакета = "ПокупательБюджетныйDOC" Тогда
		
		ВставитьДанныеОбъекта(ДанныеОбъекта,"НомерДоговора",НомерДоговора,Лев(ПустаяСтрока,5));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ДатаДоговора",Формат(ДатаДоговора,"ДЛФ=DD"),ПустаяДатаПрописью);
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ДатаДействияДоговора",Формат(ДатаДействияДоговора,"ДЛФ=DD"),ПустаяДатаПрописью);
		ВставитьДанныеОбъекта(ДанныеОбъекта,"СрокДействияДоговора",Формат(СрокДействияДоговора,"ДЛФ=DD"),ПустаяДатаПрописью);
		
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияНаименование",Выборка.ОрганизацияНаименование,Лев(ПустаяСтрока,20));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияВЛице",ОрганизацияВЛице,Лев(ПустаяСтрока,30));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияДействуетНаОсновании",ОрганизацияДействуетНаОсновании,Лев(ПустаяСтрока,10));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияЮрАдрес",Выборка.ОрганизацияЮрАдрес,Лев(ПустаяСтрока,30) );
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияПочтАдрес",Выборка.ОрганизацияПочтАдрес,Лев(ПустаяСтрока,30));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияЭП",Выборка.ОрганизацияЭП);
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияФакс",Выборка.ОрганизацияФакс,Лев(ПустаяСтрока,30));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияИНН",Выборка.ОрганизацияИНН,Лев(ПустаяСтрока,15));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияКПП",Выборка.ОрганизацияКПП,Лев(ПустаяСтрока,10));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияБИК",Выборка.ОрганизацияБИК,Лев(ПустаяСтрока,15));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияНомерСчета",Выборка.ОрганизацияНомерСчета,Лев(ПустаяСтрока,25));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияБанк",Выборка.ОрганизацияБанк,Лев(ПустаяСтрока,60));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияКоррСчет",Выборка.ОрганизацияКоррСчет,Лев(ПустаяСтрока,20));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияДолжностьПодписанта",ОрганизацияДолжностьПодписанта);
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияПодписант",ОрганизацияПодписант,Лев(ПустаяСтрока,15));
		
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентНаименование",Выборка.КонтрагентНаименование,Лев(ПустаяСтрока,20));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентВЛице",КонтрагентВЛице,Лев(ПустаяСтрока,30));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентДействуетНаОсновании",КонтрагентДействуетНаОсновании,Лев(ПустаяСтрока,10));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентАдрес",Выборка.КонтрагентЮрАдрес, Лев(ПустаяСтрока,30));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентПочтАдрес",Выборка.КонтрагентПочтАдрес, Лев(ПустаяСтрока,30));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентЭП",Выборка.КонтрагентЭП, Лев(ПустаяСтрока,5));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентФакс",Выборка.КонтрагентФакс, Лев(ПустаяСтрока,30));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентИНН",Выборка.КонтрагентИНН,Лев(ПустаяСтрока,15));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентКПП",Выборка.КонтрагентКПП,Лев(ПустаяСтрока,10));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентБИК",Выборка.КонтрагентБИК,Лев(ПустаяСтрока,15));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентНомерСчета",Выборка.КонтрагентНомерСчета,Лев(ПустаяСтрока,25));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентБанк",Выборка.КонтрагентБанк,Лев(ПустаяСтрока,60));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентКоррСчет",Выборка.КонтрагентКоррСчет,Лев(ПустаяСтрока,20));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентДолжностьПодписанта",КонтрагентДолжностьПодписанта);
		ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентПодписант",КонтрагентПодписант,Лев(ПустаяСтрока,15));
		ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияОГРН",Выборка.ОрганизацияОГРН,Лев(ПустаяСтрока,15));
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
КонецФункции

&НаСервере
Процедура ЗаписатьЗначениеВХМЛ(ХМЛ,ИмяЭлемента,Значение)
	ХМЛ.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	ЗаписатьXML(ХМЛ,Значение);
	ХМЛ.ЗаписатьКонецЭлемента();
КонецПроцедуры

&НаСервере
Функция СчитатьЗначениеИзХМЛ(ХМЛ)
	ВозврЗнач=Неопределено;
	Попытка
		Если ХМЛ.Прочитать() Тогда
			ТипУзла=ХМЛ.ТипУзла;
			Если (ТипУзла=ТипУзлаXML.НачалоЭлемента) Тогда
				ВозврЗнач=ПрочитатьXML(ХМЛ);
			КонецЕсли;
		КонецЕсли;
	Исключение
		
	КонецПопытки;
	
	Возврат ВозврЗнач;
КонецФункции

&НаСервере
Процедура СохранитьНастройкиПечатиНаСервере()
	
	ГлобальныеНастройки=Новый Структура;
	ГлобальныеНастройки.Вставить("ГлобальныйТипМакета",ГлобальныйТипМакета);
	ГлобальныеНастройки.Вставить("ГлобальноеМестоХраненияШаблонов",ГлобальноеМестоХраненияШаблонов);
	ГлобальныеНастройки.Вставить("ГлобальныйДержательШаблонов",ГлобальныйДержательШаблонов);
	ХранилищеОбщихНастроек.Сохранить("ПечатьДоговораВOffice_ГлобальныеНастройки",,ГлобальныеНастройки);
	
	Попытка
		
		ЗаписьНастроек=Новый ЗаписьXML;
		ЗаписьНастроек.УстановитьСтроку();
		ЗаписьНастроек.ЗаписатьОбъявлениеXML();
		ЗаписьНастроек.ЗаписатьНачалоЭлемента(НаименованиеНастройки);
		
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"НомерДоговора",НомерДоговора);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"ДатаДоговора",ДатаДоговора);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"ДатаДействияДоговора",ДатаДействияДоговора);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"СрокДействияДоговора",СрокДействияДоговора);
		
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"ОрганизацияВЛице",ОрганизацияВЛице);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"ОрганизацияДействуетНаОсновании",ОрганизацияДействуетНаОсновании);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"ОрганизацияДолжностьПодписанта",ОрганизацияДолжностьПодписанта);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"ОрганизацияПодписант",ОрганизацияПодписант);
		
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"КонтрагентВЛице",КонтрагентВЛице);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"КонтрагентДействуетНаОсновании",КонтрагентДействуетНаОсновании);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"КонтрагентДолжностьПодписанта",КонтрагентДолжностьПодписанта);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"КонтрагентПодписант",КонтрагентПодписант);
		ЗаписатьЗначениеВХМЛ(ЗаписьНастроек,"НазваниеШаблона",НазваниеШаблона);
		
		
		ЗаписьНастроек.ЗаписатьКонецЭлемента();
		
		СтрокаНастроек=ЗаписьНастроек.Закрыть();
		
		Если НЕ ЗначениеЗаполнено(ФайлНастроек) Тогда
			// ссылка не заполнена - создаём новый элемент
			Настройки=Справочники.ДоговорыКонтрагентовПрисоединенныеФайлы.СоздатьЭлемент();
			Настройки.Автор=Пользователи.ТекущийПользователь();
			Настройки.ВладелецФайла=Договор;
			Настройки.ДатаСоздания=ТекущаяДата();
			Настройки.Наименование=НаименованиеНастройки;
			Настройки.Расширение=РасширениеНастройки;
			Настройки.ТипХраненияФайла=Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе;
			Настройки.Том=Справочники.ТомаХраненияФайлов.ПустаяСсылка();
			Настройки.ПутьКФайлу="";
			
		Иначе
			// получаем существующий элемент файла настроек
			Настройки=ФайлНастроек.ПолучитьОбъект();
		КонецЕсли;
		
		Настройки.Описание="служебные данные (не изменять!)";
		
		Настройки.ТекстХранилище=Новый ХранилищеЗначения(СтрокаНастроек,Новый СжатиеДанных(6));
		Настройки.Размер=СтрДлина(СтрокаНастроек);
		Настройки.ДатаМодификацииУниверсальная=ТекущаяДата();
		Настройки.Изменил=Пользователи.ТекущийПользователь();
		
		Настройки.Записать();
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОрганизацийНаСервере()
	
	ГлобальныеНастройкиОрганизаций=Новый Соответствие;
	
	// заменяем настройку по текущей организации
	НовоеЗначение=Новый Структура;
	НовоеЗначение.Вставить("ОрганизацияВЛице",ОрганизацияВЛице);
	НовоеЗначение.Вставить("ОрганизацияДействуетНаОсновании",ОрганизацияДействуетНаОсновании);
	НовоеЗначение.Вставить("ОрганизацияДолжностьПодписанта",ОрганизацияДолжностьПодписанта);
	НовоеЗначение.Вставить("ОрганизацияПодписант",ОрганизацияПодписант);
	НовоеЗначение.Вставить("НазваниеШаблона",НазваниеШаблона);
	
	Если ТипЗнч(НастройкиОрганизаций)=Тип("ФиксированноеСоответствие") Тогда
		Для каждого НастройкаОрг Из НастройкиОрганизаций Цикл
			Если (НастройкаОрг.Ключ=Организация) Тогда
				// заменяем настройку по текущей организации
				ГлобальныеНастройкиОрганизаций.Вставить(НастройкаОрг.Ключ,НовоеЗначение);
			Иначе
				// просто переносим сохранённую настройку
				ГлобальныеНастройкиОрганизаций.Вставить(Организация,НовоеЗначение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		// сохранённых настроек нет, создаём новую
		ГлобальныеНастройкиОрганизаций.Вставить(Организация,НовоеЗначение);
	КонецЕсли;
	
	ХранилищеОбщихНастроек.Сохранить("ПечатьДоговораВOffice_ГлобальныеНастройкиОрганизаций",,ГлобальныеНастройкиОрганизаций);
КонецПроцедуры

&НаСервере
Процедура СчитатьНастройкиПечатиНаСервере()
	Если НЕ ЗначениеЗаполнено(ФайлНастроек) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Настройки=ФайлНастроек.ПолучитьОбъект();
		СтрокаНастроек=Настройки.ТекстХранилище.Получить();
		
		Если ТипЗнч(СтрокаНастроек)=Тип("Строка") Тогда
			ЧтениеНастроек=Новый ЧтениеXML;
			ЧтениеНастроек.УстановитьСтроку(СтрокаНастроек);
			
			ВошлиВНастройки=Ложь;
			Пока ЧтениеНастроек.Прочитать() Цикл
				ТипУзла=ЧтениеНастроек.ТипУзла;
				Если (ТипУзла=ТипУзлаXML.НачалоЭлемента) Тогда
					Если ВошлиВНастройки Тогда
						ИмяПоля=ЧтениеНастроек.Имя;
						ЭтаФорма[ИмяПоля]=СчитатьЗначениеИзХМЛ(ЧтениеНастроек);
					Иначе
						Если (ЧтениеНастроек.Имя=НаименованиеНастройки) Тогда
							ВошлиВНастройки=Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ЧтениеНастроек.Закрыть();
		КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНастройкиПечатиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьИзФормы(Команда)
	ПараметрКоманды=Новый Массив;
	ПараметрКоманды.Добавить(Договор);
	Печать("ПечатьДоговораИзФормы",ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПолеИзВыборки(ИмяПоля,Выборка)
	Если НЕ ЗначениеЗаполнено(ЭтаФорма[ИмяПоля]) И ЗначениеЗаполнено(Выборка[ИмяПоля]) Тогда
		ЭтаФорма[ИмяПоля]=Выборка[ИмяПоля];
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПолеИзЗначения(ИмяПоля,НовоеЗначение)
	Если НЕ ЗначениеЗаполнено(ЭтаФорма[ИмяПоля]) И ЗначениеЗаполнено(НовоеЗначение) Тогда
		ЭтаФорма[ИмяПоля]=НовоеЗначение;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверитьГлобальныеНастройки()	
	Если (НЕ ЗначениеЗаполнено(ГлобальныйТипМакета)) ИЛИ ((ГлобальныйТипМакета<>"DOC") И (ГлобальныйТипМакета<>"ODT")) Тогда
		ГлобальныйТипМакета="DOC";
	КонецЕсли;
	Если (НЕ ЗначениеЗаполнено(ГлобальноеМестоХраненияШаблонов)) ИЛИ ((ГлобальноеМестоХраненияШаблонов<>"МакетыОбработки") И (ГлобальноеМестоХраненияШаблонов<>"СправочникФизЛица")) Тогда
		ГлобальноеМестоХраненияШаблонов="МакетыОбработки";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеФормы()
	
	ГлобальныеНастройки=ХранилищеОбщихНастроек.Загрузить("ПечатьДоговораВOffice_ГлобальныеНастройки");
	Если ТипЗнч(ГлобальныеНастройки)=Тип("Структура") Тогда
		ГлобальныйТипМакета=ГлобальныеНастройки.ГлобальныйТипМакета;
		ГлобальноеМестоХраненияШаблонов=ГлобальныеНастройки.ГлобальноеМестоХраненияШаблонов;
		ГлобальныйДержательШаблонов=ГлобальныеНастройки.ГлобальныйДержательШаблонов;
	КонецЕсли;
	
	ГлобальныеНастройкиОрганизаций=ХранилищеОбщихНастроек.Загрузить("ПечатьДоговораВOffice_ГлобальныеНастройкиОрганизаций");
	Если ТипЗнч(ГлобальныеНастройкиОрганизаций)=Тип("Соответствие") Тогда
		НастройкиОрганизаций=Новый ФиксированноеСоответствие(ГлобальныеНастройкиОрганизаций);
	КонецЕсли;
	
	ПроверитьГлобальныеНастройки();
	ЭтаФорма.Элементы.ГлобальныйДержательШаблонов.Доступность=(ГлобальноеМестоХраненияШаблонов="СправочникФизЛица");
	
	// поиск существующих настроек печати договора
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|select allowed top 1
	| ФайлыНастроек.Ссылка
	|from
	| Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы as ФайлыНастроек
	|where (ФайлыНастроек.ВладелецФайла=&ТекДоговор) and НЕ(ФайлыНастроек.ПометкаУдаления) and (ФайлыНастроек.Наименование=&НаименованиеНастройки) and (ФайлыНастроек.Расширение=&РасширениеНастройки)
	
	|";
	
	Запрос.УстановитьПараметр("ТекДоговор",Договор);
	Запрос.УстановитьПараметр("НаименованиеНастройки",НаименованиеНастройки);
	Запрос.УстановитьПараметр("РасширениеНастройки",РасширениеНастройки);
	РезЗапроса=Запрос.Выполнить();
	
	Если НЕ РезЗапроса.Пустой() Тогда
		// найден
		Выборка=РезЗапроса.Выбрать();
		Выборка.Следующий();
		ФайлНастроек=Выборка.Ссылка;
		СчитатьНастройкиПечатиНаСервере();
	КонецЕсли;
	
	// заполнение пустых полей данными из договора
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|select allowed top 1
	| Договоры.Номер as НомерДоговора
	|,Договоры.Дата as ДатаДоговора
	|,Договоры.ДатаНачалаДействия as ДатаДействияДоговора
	|,Договоры.ДатаОкончанияДействия as СрокДействияДоговора
	|,Договоры.ТипДоговора as ТипДоговора
	|,Договоры.Организация as Организация
	|//,Договоры.Организация.ТекущаяДолжностьРуководителя as ОрганизацияДолжностьРуководителя
	|//,Договоры.Организация.ТекущийРуководитель.Наименование as ОрганизацияРуководитель
	|,Договоры.Контрагент as Контрагент
	|from
	| Справочник.ДоговорыКонтрагентов as Договоры
	|where (Договоры.Ссылка=&ТекДоговор)
	
	|";
	
	Запрос.УстановитьПараметр("ТекДоговор",Договор);
	РезЗапроса=Запрос.Выполнить();
	
	Если НЕ РезЗапроса.Пустой() Тогда
		// найден
		Выборка=РезЗапроса.Выбрать();
		Выборка.Следующий();
		
		ТипДоговора=Выборка.ТипДоговора;
		Организация=Выборка.Организация;
		Контрагент=Выборка.Контрагент;
		
		Если ТипЗнч(НастройкиОрганизаций)=Тип("ФиксированноеСоответствие") Тогда
			НастрТекОрг=НастройкиОрганизаций.Получить(Организация);
			Если ТипЗнч(НастрТекОрг)=Тип("Структура") Тогда
				ОрганизацияВЛице=НастрТекОрг.ОрганизацияВЛице;
				ОрганизацияДействуетНаОсновании=НастрТекОрг.ОрганизацияДействуетНаОсновании;
				ОрганизацияДолжностьПодписанта=НастрТекОрг.ОрганизацияДолжностьПодписанта;
				ОрганизацияПодписант=НастрТекОрг.ОрганизацияПодписант;
				НазваниеШаблона = НастрТекОрг.НазваниеШаблона;
			КонецЕсли;
		КонецЕсли;
		
		ОбновитьПолеИзВыборки("НомерДоговора",Выборка);
		ОбновитьПолеИзВыборки("ДатаДоговора",Выборка);
		ОбновитьПолеИзВыборки("ДатаДействияДоговора",Выборка);
		ОбновитьПолеИзВыборки("СрокДействияДоговора",Выборка);
		ОбновитьПолеИзЗначения("ОрганизацияДействуетНаОсновании","Устава");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаименованиеНастройки="НастройкиПечатиДоговораВOffice";
	РасширениеНастройки="xml";
	Договор=Параметры["ОбъектыНазначения"];
	
	ЗагрузитьДанныеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ГлобальноеМестоХраненияШаблоновПриИзменении(Элемент)
	ЭтаФорма.Элементы.ГлобальныйДержательШаблонов.Доступность=(ГлобальноеМестоХраненияШаблонов="СправочникФизЛица");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьГлобальныеНастройкиОрганизации(Команда)
	СохранитьНастройкиОрганизацийНаСервере();
КонецПроцедуры

