
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ИзменитьЦвет(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеИзменитьЦветФона", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета",, ЭтотОбъект,,,, ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗавершениеИзменитьЦветФона(Цвет, Параметры) Экспорт
	
	УстановитьЦвет(Цвет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет( Цвет)
	Если ТипЗнч(Цвет) = Тип("Цвет")Тогда
		Объект.Цвет = Цвет; 
		Элементы.Цвет.ЦветФона=Цвет;
		Модифицированность = Истина;
	ИначеЕсли Цвет = "ДругиеЦвета" Тогда
		ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета();
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЦвета", ЭтотОбъект,Цвет);
		ДиалогВыбораЦвета.Показать(ОписаниеОповещения);
	КонецЕсли;
КонецПроцедуры          

&НаКлиенте
Процедура ПослеВыбораЦвета(Цвет) Экспорт
	УстановитьЦвет(Цвет);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	если значениезаполнено(Объект.Цвет)  тогда
		Массив=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Объект.Цвет);
		Элементы.Цвет.ЦветФона=Новый Цвет(Число(массив[0]),Число(массив[1]),Число(массив[2]));  
	конецесли;
КонецПроцедуры

#КонецОбласти