&НаКлиенте
Процедура Док_УстановитьОбъектРасходовПосле(Команда)
ВыделенныеСтроки = Элементы.ДанныеОтражения.ВыделенныеСтроки;
	
	Если Объект.ДанныеОтражения.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для выполнения команды требуется выделить строки табличной части.'"));
		Возврат;
	КонецЕсли;
	
	СтруктураПараметры = Новый Структура;

	
	ВыбранноеЗначение = Неопределено;

	
	ОткрытьФорму(
		"Общаяформа.ФормаВыбораОбъектовАналитики", 
		СтруктураПараметры,
		ЭтаФорма,,,, Новый ОписаниеОповещения("УстановитьОбъектРасходовЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
&НаКлиенте
Процедура УстановитьОбъектРасходовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
    
    
    ВыбранноеЗначение = Результат;
    
    Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
        
        Для Каждого Строка Из ВыделенныеСтроки Цикл
            
            СтрокаТаблицы = Объект.ДанныеОтражения.НайтиПоИдентификатору(Строка);
            Если СтрокаТаблицы <> Неопределено Тогда
                СтрокаТаблицы.ОбъектРасходов = ВыбранноеЗначение.ОбъектРасходов;
                СтрокаТаблицы.АналитикаОбъекта = ВыбранноеЗначение.АналитикаОбъекта;
            КонецЕсли;
            
        КонецЦикла;
        
    КонецЕсли;

КонецПроцедуры
