
Функция ПолучитьСкладыСекцииGetStores(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("response");
	ЗаписьJSON.ЗаписатьНачалоМассива();    
	
	ПараметрЗапроса = 0;
	Для Каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
		Если Лев(Параметр.Ключ, 10) = "only_shops" Тогда
			ПараметрЗапроса = 1;    
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаПоСкладам = СкладыСекцииОтгрузки(ПараметрЗапроса).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСкладам.Следующий() Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("name");
		ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоСкладам.СкладНаименование);	
		
		ЗаписьJSON.ЗаписатьИмяСвойства("code");
		КодСклада = Строка(ВыборкаПоСкладам.СкладСсылка.УникальныйИдентификатор());
		ЗаписьJSON.ЗаписатьЗначение(КодСклада);	
		
		ЗаписьJSON.ЗаписатьИмяСвойства("section");
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		ВыборкаПоСекциям = ВыборкаПоСкладам.Выбрать();
		Пока ВыборкаПоСекциям.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаПоСекциям.СекцияНаименование) Тогда
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
				ЗаписьJSON.ЗаписатьИмяСвойства("name");
				ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоСекциям.СекцияНаименование);
				
				ЗаписьJSON.ЗаписатьИмяСвойства("code");
				КодСекции = Строка(ВыборкаПоСекциям.СекцияСсылка.УникальныйИдентификатор());
				ЗаписьJSON.ЗаписатьЗначение(КодСекции);	
				
				ЗаписьJSON.ЗаписатьКонецОбъекта();
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();	
		
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;
КонецФункции

Функция ПолучитьЗаказыGetOrders(Запрос)
	
	ТекстОшибки = "";
	Если Запрос.ПараметрыЗапроса.Количество() < 2 Тогда
		
		Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
			ТекстОшибки = "Отсутствуют параметры Склад (store) и Секции (section)"
		Иначе
			ТекстОшибки = "Недостаточно параметров Склад (store) и Секции (section)"
		КонецЕсли;
		
	КонецЕсли;
	
	Склад = Неопределено;
	Секции = Новый Массив;
	
	Если ТекстОшибки = "" Тогда
		Для Каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
			
			Если Параметр.Ключ = "store" Тогда
				Попытка
					Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметр.Значение));			
				Исключение
					ТекстОшибки = "Некорректное значение параметра Склад (store): " + Параметр.Значение;
				КонецПопытки;
			КонецЕсли;
			
			Если Лев(Параметр.Ключ, 7) = "section" Тогда
				Попытка
					Секция = Справочники.РабочиеУчастки.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметр.Значение));			
				Исключение
					ТекстОшибки = "Некорректное значение параметров Секции (section): " + Параметр.Значение;	
				КонецПопытки;
				
				Секции.Добавить(Секция);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если (ТекстОшибки = "") И (Склад = Неопределено) Тогда
		ТекстОшибки = "Отсутствует параметр Склад (store)";
	КонецЕсли;
	
	Если (ТекстОшибки = "") И (Секции.Количество() = 0) Тогда
		ТекстОшибки = "Отсутствует параметры Секции (section)";
	КонецЕсли;
	
	Если ТекстОшибки <> "" Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("error");
		ЗаписьJSON.ЗаписатьЗначение(Истина);		
		ЗаписьJSON.ЗаписатьИмяСвойства("desctiption");
		ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		СтрокаJSON = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
		
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("response");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("store");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("name");
	ЗаписьJSON.ЗаписатьЗначение(Склад.Наименование);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("code");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Склад.УникальныйИдентификатор()));
	
	ЗаписьJSON.ЗаписатьИмяСвойства("section");
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Секция Из Секции Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("name");
		ЗаписьJSON.ЗаписатьЗначение(Секция.Наименование);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("code");
		ЗаписьJSON.ЗаписатьЗначение(Строка(Секция.УникальныйИдентификатор()));
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	
	
	ВсеЗаказы = Заказы(Склад, Секции[0]);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("items");	
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	
	Для Счетчик = 0 По 2 Цикл
		
		Выборка = ВсеЗаказы[Счетчик].Выбрать();
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		Если Счетчик = 0 Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства("queue");
		ИначеЕсли Счетчик = 1 Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства("in_pogress");
		ИначеЕсли Счетчик = 2 Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства("ready");
		КонецЕсли;
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		Пока Выборка.Следующий() Цикл
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			ЗаписьJSON.ЗаписатьИмяСвойства("title");
			ЗаписьJSON.ЗаписатьЗначение(Выборка.НомерДокумента);
			
			Статус = 0;
			
			Если Выборка.ССайта = Истина Тогда
				Статус = 2;
			КонецЕсли;
			
			Если Выборка.Срочный = Истина Тогда
				Статус = 1;
			КонецЕсли;
			
			Если Выборка.ЧастичноОтгружен = Истина Тогда
				Статус = 3;
			КонецЕсли;
			
			Если Выборка.ТребуетсяОповещениеКладовщику = Истина Тогда
				Статус = 4;
			КонецЕсли;
			
			ЗаписьJSON.ЗаписатьИмяСвойства("status");
			ЗаписьJSON.ЗаписатьЗначение(Статус);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("keeper");
			
			Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
				Сотрудник = Выборка.Сотрудник;
			Иначе
				Сотрудник = "";
			КонецЕсли; 
			ЗаписьJSON.ЗаписатьЗначение(Сотрудник);
			
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;

КонецФункции

Функция ПолучитьТекущийЗаказGetCurrentOrder(Запрос) 
	
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	BarCode = Запрос.ПараметрыЗапроса.Получить("barcode");
	Store = Запрос.ПараметрыЗапроса.Получить("store");
	Section = Запрос.ПараметрыЗапроса.Получить("ection");
	
	СсылкаДокумента = Неопределено;
	Склад = Неопределено;
	Секция = Неопределено;
	
	Попытка
		
		Менеджеры = Новый Массив();
		Менеджеры.Добавить(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
		Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЧекККМ.ПустаяСсылка"));
		
		МассивСсылок = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(BarCode, Менеджеры);
		Если МассивСсылок.Количество() > 0 Тогда
			СсылкаДокумента = МассивСсылок[0];	
		Иначе
			ПоискШтрихкодаСтруктура = ПоискШтрихкодаСекции(BarCode);						
			СсылкаДокумента = ПоискШтрихкодаСтруктура.Документ;
		КонецЕсли;
		
		Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Store));
		Секция = Справочники.РабочиеУчастки.ПолучитьСсылку(Новый УникальныйИдентификатор(Section));
		
	Исключение
		
	КонецПопытки;
	
	ТекстОшибки = "";
	Если ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.ЧекККМ") Тогда
		//Пропускаем
	Иначе
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "","",Символы.ПС) + "Не найден документ или некорректное значение параметра Штрихкода (BarCode): " + BarCode;
	КонецЕсли;
	
	Если ТипЗнч(Склад) <> Тип("СправочникСсылка.Склады") Тогда
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "","",Символы.ПС) + "Не найден склад или некорректное значение параметра склада (Store): " + Store;
	КонецЕсли;
	
	Если ТипЗнч(Секция) <> Тип("СправочникСсылка.РабочиеУчастки") Тогда
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "","",Символы.ПС) + "Не найдена секция или некорректное значение параметра секции (Section): " + Section;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	
	Если ТекстОшибки = "" Тогда
		ЗаписьJSON.ЗаписатьЗначение(Ложь);
		//ТелоОтвета = Новый Структура;
		//ТелоОтвета.Вставить("document_id", СсылкаДокумента.Номер);
		//ТелоОтвета.Вставить("message", "Здравствуйте, мы делаем все возможное, чтобы вынести ваш заказ быстрее");
		ЗаписьJSON.ЗаписатьИмяСвойства("data");
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("document_id");
		ЗаписьJSON.ЗаписатьЗначение(СсылкаДокумента.Номер); 
		ЗаписьJSON.ЗаписатьИмяСвойства("message");
		ЗаписьJSON.ЗаписатьЗначение("Здравствуйте, мы делаем все возможное, чтобы вынести ваш заказ быстрее"); 
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		СоздатьОповещениеКладовщикам(СсылкаДокумента, Склад, Секция);
	Иначе
		ЗаписьJSON.ЗаписатьЗначение(Истина);
		ЗаписьJSON.ЗаписатьИмяСвойства("desctiption");
		ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки);
	КонецЕсли; 
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;
КонецФункции

Процедура СоздатьОповещениеКладовщикам(Документ, Склад, Секция)
	
	Очередь			 = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
	НаборЗаписей = Очередь.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Отбор.Секция.Установить(Секция);
	НаборЗаписей.Отбор.Склад.Установить(Склад);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НоваяЗапись = НаборЗаписей[0];
		НоваяЗапись.ТребуетсяОповещениеКладовщику = Истина; 
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция СкладыСекцииОтгрузки(ПараметрЗапроса = 0)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыКОтгрузке.Склад.Ссылка КАК СкладСсылка, 
	|	ТоварыКОтгрузке.Склад.Наименование КАК СкладНаименование, 
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток.Ссылка КАК СекцияСсылка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток.Наименование КАК СекцияНаименование
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(,
	|		(ДокументОтгрузки ССЫЛКА Документ.ЧекККМ
	|		ИЛИ ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента)) КАК ТоварыКОтгрузке
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|	ПО ТоварыКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|		И ТоварыКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|		И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|   &УсловиеЗапроса
	|УПОРЯДОЧИТЬ ПО 
	|	ТоварыКОтгрузке.Склад.Наименование,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток.Наименование
	|ИТОГИ ПО ТоварыКОтгрузке.Склад.Ссылка";   
	
	Если ПараметрЗапроса = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеЗапроса","ГДЕ ТоварыКОтгрузке.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке"); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеЗапроса","ГДЕ ТоварыКОтгрузке.Склад.ТорговыйЗал"); 
	КонецЕсли;
	
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция Заказы(Склад, Секция) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =" 
	|ВЫБРАТЬ
	|		ЭлектроннаяОчередьКлиентов.НомерДокумента КАК НомерДокумента,
	|		ЭлектроннаяОчередьКлиентов.ССайта КАК ССайта,
	|		ЭлектроннаяОчередьКлиентов.Заехал КАК Срочный,
	|		ЭлектроннаяОчередьКлиентов.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|		ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК ПолучательУведомления,
	|		ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику КАК ТребуетсяОповещениеКладовщику, 
	|		ВЫБОР 
	|			КОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления ССЫЛКА Справочник.Сотрудники 
	|				Тогда ЭлектроннаяОчередьКлиентов.ПолучательУведомления.Наименование 
	|		Конец Как Сотрудник
	|	ИЗ
	|		РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	|	ГДЕ
	|		ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор) 
	|		И ЭлектроннаяОчередьКлиентов.Склад = &Склад
	|		И ЭлектроннаяОчередьКлиентов.Секция = &Секция  
	|		И ЭлектроннаяОчередьКлиентов.ОтметкаКассы = Истина
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ЭлектроннаяОчередьКлиентов.НомерДокумента КАК НомерДокумента,
	|		ЭлектроннаяОчередьКлиентов.ССайта КАК ССайта,
	|		ЭлектроннаяОчередьКлиентов.Заехал КАК Срочный,
	|		ЭлектроннаяОчередьКлиентов.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|		ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК ПолучательУведомления,
	|		ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику КАК ТребуетсяОповещениеКладовщику, 
	|		ВЫБОР 
	|			КОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления ССЫЛКА Справочник.Сотрудники 
	|				Тогда ЭлектроннаяОчередьКлиентов.ПолучательУведомления.Наименование 
	|		Конец Как Сотрудник
	|	ИЗ
	|		РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	|	ГДЕ
	|		ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается) 
	|		И ЭлектроннаяОчередьКлиентов.Склад = &Склад
	|		И ЭлектроннаяОчередьКлиентов.Секция = &Секция 
	|		И ЭлектроннаяОчередьКлиентов.ОтметкаКассы = Истина
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ЭлектроннаяОчередьКлиентов.НомерДокумента КАК НомерДокумента,
	|		ЭлектроннаяОчередьКлиентов.ССайта КАК ССайта,
	|		ЭлектроннаяОчередьКлиентов.Заехал КАК Срочный,
	|		ЭлектроннаяОчередьКлиентов.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|		ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК ПолучательУведомления,
	|		ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику КАК ТребуетсяОповещениеКладовщику, 
	|		ВЫБОР 
	|			КОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления ССЫЛКА Справочник.Сотрудники 
	|				Тогда ЭлектроннаяОчередьКлиентов.ПолучательУведомления.Наименование 
	|		Конец Как Сотрудник
	|	ИЗ
	|		РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	|	ГДЕ
	|		ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран)
	|		И ЭлектроннаяОчередьКлиентов.Склад = &Склад
	|		И ЭлектроннаяОчередьКлиентов.Секция = &Секция  
	|		И ЭлектроннаяОчередьКлиентов.ОтметкаКассы = Истина;";
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Секция", Секция);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	Возврат  ПакетЗапросов;  
	
КонецФункции

Функция ПоискШтрихкодаСекции(BarCode)
	
	СтруктураВозврата = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПоСекциямДокумента.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод = &Штрихкод";
	
	
	Запрос.УстановитьПараметр("Штрихкод", BarCode);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Вставить("Документ", Выборка.Документ);
	Иначе
		СтруктураВозврата.Вставить("Документ", Неопределено);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьЗаказыПоСкладуGetOrdersGlobal(Запрос)
	
	Перем Склад, ТекстОшибки;
	Секции = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПараметрыЗапроса = ОплатаСервиса.ДанныеJSON(Запрос.ПолучитьТелоКакСтроку());
		Если ТипЗнч(ПараметрыЗапроса) = Тип("Структура") Тогда
			Если ПараметрыЗапроса.Свойство("store") Тогда 
				Если ЗначениеЗаполнено(ПараметрыЗапроса.store) Тогда
					Попытка
						Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыЗапроса.store));
					Исключение
						ТекстОшибки = "Некорректное значение параметра Склад (store): " + ПараметрыЗапроса.store;
					КонецПопытки;
				Иначе
					ТекстОшибки = "Для параметра Склад (store) передано пустое значение..";	
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекстОшибки) И 
				ПараметрыЗапроса.Свойство("section") И 
				ТипЗнч(ПараметрыЗапроса.section) = Тип("Массив") И 
				ЗначениеЗаполнено(ПараметрыЗапроса.section) Тогда
				
				Для Каждого Элемент Из ПараметрыЗапроса.section Цикл
					Попытка
						Секция = Справочники.РабочиеУчастки.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент));
						Если ЗначениеЗаполнено(Секция) Тогда
							Секции.Добавить(Секция);            
						КонецЕсли;
					Исключение
						ТекстОшибки = "Некорректное значение параметра Секции (section): " + Элемент;
						Прервать;
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекстОшибки = "Не удалось получить тело Get запроса..";
	КонецПопытки;
		
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("error");
		ЗаписьJSON.ЗаписатьЗначение(Истина);		
		ЗаписьJSON.ЗаписатьИмяСвойства("desctiption");
		ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		СтрокаJSON = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
		
		Возврат Ответ;
	КонецЕсли;

	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); // --
	
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("response");
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); // response 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("store");
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); // store
	
	ЗаписьJSON.ЗаписатьИмяСвойства("id");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Склад.УникальныйИдентификатор()));
	
	ЗаписьJSON.ЗаписатьИмяСвойства("name");
	ЗаписьJSON.ЗаписатьЗначение(Склад.Наименование);
	ЗаписьJSON.ЗаписатьКонецОбъекта(); //store 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеУчастки.Владелец КАК Склад,
		|	РабочиеУчастки.Ссылка КАК Секция,
		|	РабочиеУчастки.Ссылка.Наименование КАК СекцияНаименование
		|ПОМЕСТИТЬ ВТИтог
		|ИЗ
		|	Справочник.РабочиеУчастки КАК РабочиеУчастки
		|ГДЕ
		|	НЕ РабочиеУчастки.ПометкаУдаления
		|	И РабочиеУчастки.Владелец = &Склад
		|	И &УсловиеПоСекциям
		|	И РабочиеУчастки.ЭлектроннаяОчередь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Секция КАК Секция,
		|	Итог.СекцияНаименование КАК СекцияНаименование
		|ИЗ
		|	ВТИтог КАК Итог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Секция КАК Секция,
		|	Итог.СекцияНаименование КАК СекцияНаименование,
		|	ЭлектроннаяОчередьКлиентов.НомерДокумента КАК НомерДокумента,
		|	ВЫБОР
		|		КОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления.Наименование
		|	КОНЕЦ КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор)
		|			ТОГДА ""queue""
		|		КОГДА ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается)
		|			ТОГДА ""in_pogress""
		|		КОГДА ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран)
		|			ТОГДА ""ready""
		|	КОНЕЦ КАК Состояние,
		|	ВЫБОР
		|		КОГДА ЭлектроннаяОчередьКлиентов.Заехал
		|			ТОГДА 1
		|		КОГДА ЭлектроннаяОчередьКлиентов.ССайта
		|			ТОГДА 2
		|		КОГДА ЭлектроннаяОчередьКлиентов.ЧастичноОтгружен
		|			ТОГДА 3
		|		КОГДА ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику
		|			ТОГДА 4
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Статус
		|ИЗ
		|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИтог КАК Итог
		|		ПО ЭлектроннаяОчередьКлиентов.Склад = Итог.Склад
		|			И ЭлектроннаяОчередьКлиентов.Секция = Итог.Секция
		|ГДЕ
		|	(ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор)
		|			ИЛИ ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается)
		|			ИЛИ ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран))
		|	И ЭлектроннаяОчередьКлиентов.ОтметкаКассы = ИСТИНА
		|ИТОГИ ПО
		|	НомерДокумента";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Если ЗначениеЗаполнено(Секции) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСекциям", "РабочиеУчастки.Ссылка В(&Секции)");	
		Запрос.УстановитьПараметр("Секции", Секции);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСекциям", "ИСТИНА");
	КонецЕсли;
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("sections");	
	ЗаписьJSON.ЗаписатьНачалоМассива(); // sections
	
	Выборка = МассивРезультатов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("code");
		ЗаписьJSON.ЗаписатьЗначение(Строка(Выборка.Секция.УникальныйИдентификатор()));
		
		ЗаписьJSON.ЗаписатьИмяСвойства("name");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.СекцияНаименование);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;   
	
	ЗаписьJSON.ЗаписатьКонецМассива(); // sections
	
	ЗаписьJSON.ЗаписатьИмяСвойства("orders");	
	ЗаписьJSON.ЗаписатьНачалоМассива(); // orders   
		
	Выборка = МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("title");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.НомерДокумента); 
		
		ЗаписьJSON.ЗаписатьИмяСвойства("sections");	
		ЗаписьJSON.ЗаписатьНачалоМассива(); // sections
		
		ВыборкаДетальная = Выборка.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			ЗаписьJSON.ЗаписатьИмяСвойства("code");
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальная.Секция.УникальныйИдентификатор()));
			
			ЗаписьJSON.ЗаписатьИмяСвойства("name");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальная.СекцияНаименование);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("order");
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			ЗаписьJSON.ЗаписатьИмяСвойства("title");
			ЗаписьJSON.ЗаписатьЗначение(Выборка.НомерДокумента);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("status");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальная.Статус);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("keeper"); 
			ЗаписьJSON.ЗаписатьЗначение(?(ЗначениеЗаполнено(ВыборкаДетальная.Сотрудник), ВыборкаДетальная.Сотрудник, ""));
			
			ЗаписьJSON.ЗаписатьИмяСвойства("progress");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальная.Состояние);
				
			ЗаписьJSON.ЗаписатьКонецОбъекта();
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива(); // sections
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); // orders
	
	ЗаписьJSON.ЗаписатьКонецОбъекта(); // response
	ЗаписьJSON.ЗаписатьКонецОбъекта(); //--  
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции


