

#Область ОбщиеПроцедурыИФункции

Функция ЭтоНужноеРабочееМесто() Экспорт
	
	Результат = Ложь;
	
	лОбщиеНастройки = ПолучитьОбщиеНастройки();
	Если лОбщиеНастройки = Неопределено тогда
		Возврат Результат;
	КонецЕсли;
	
	Если лОбщиеНастройки.Свойство("РабочееМесто") тогда
		РабочееМесто = лОбщиеНастройки.РабочееМесто;
	КонецЕсли;
	
	Результат = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента() = РабочееМесто;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИдентификаторУстройства() Экспорт
	
	лОбщиеНастройки = ПолучитьОбщиеНастройки();
	Если  лОбщиеНастройки = Неопределено тогда
		Возврат Справочники.ПодключаемоеОборудование.ПустаяСсылка();
	КонецЕсли;
	
	Если лОбщиеНастройки.Свойство("ПодключаемоеОборудование") тогда
		ПодключаемоеОборудование = лОбщиеНастройки.ПодключаемоеОборудование;
	Иначе
		ПодключаемоеОборудование = Справочники.ПодключаемоеОборудование.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ПодключаемоеОборудование;
	
КонецФункции

Функция ПолучитьОбщиеНастройки()  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.Б_ОбщиеНастройки.Получить().Получить();  
	
КонецФункции

#КонецОбласти
