#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ИнициализацияОбщейКартыСТарифами
Процедура ИнициализироватьКарту(КартаЯндекс, Парам) Экспорт
	МакетGlobalVars= Обработки.КартографическийИнтерфейсДоставка.ПолучитьМакет("МакетGlobalVars");
	МакетЯндексКарты= Обработки.КартографическийИнтерфейсДоставка.ПолучитьМакет("МакетЯндексКарты");  
	
	Если Парам.БезСтоимостиФилиалов Тогда 
		ТекстСтоимостиПоФилиалам = "";
	Иначе	
		ТекстСтоимостиПоФилиалам =
		"else {
		|		innerHTML = innerHTML + '<br> <b>Стоимости по филиалам: </b> <br>';
        |		
        |       if (mapData.mCurZones.length) {
        |            mTariffs = mapData.mCurZones[0].tariffs
        |            if (mTariffs) {
        |                for (curTarif of mTariffs) {
        |                    innerHTML = innerHTML + curTarif.branch + ': ' + curTarif.cost + '<br>'
        |                }
        |            }
        |        }
        |    }";   
	КонецЕсли;	
	
	//КартаЯндекс = МакетGlobalVars.ПолучитьТекст()+Символы.ПС+МакетЯндексКарты.ПолучитьТекст();
    КартаЯндекс = МакетЯндексКарты.ПолучитьТекст();
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "{{GlobalVars}}", МакетGlobalVars.ПолучитьТекст());  
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "{{CostByBranches}}", ТекстСтоимостиПоФилиалам);
    
	стрJSON= ПолучитьJSON(Парам);
	СформироватьТекстМакета(КартаЯндекс, Парам, стрJSON);
КонецПроцедуры

Процедура СформироватьТекстМакета(КартаЯндекс, Парам, стрJSON)
	
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#Зоны#", стрJSON);
	
	УстановитьКлючЯндекс(КартаЯндекс);
	УстановитьНачальныеКоординаты(Парам.Филиал, КартаЯндекс);
	СтоимостьЗаКм= ПолучитьСтоимостьЗаКмПоТарифу(Парам.Филиал, Парам.Тариф);
	Если ПустаяСтрока(СтоимостьЗаКм) Тогда
		СтоимостьЗаКм= "0";
	КонецЕсли;
	НДС = ?(Парам.НДС = "СНДС", 20, 0);
	
	
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#СтоимостьЗаКм#", СтоимостьЗаКм);
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#НаценкаЗаКм#", 3); // 3% - фиксированная ставка от км (применяется всегда)
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#НДС#", НДС);
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#Адрес#", Парам.Адрес);
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#МассивАдресов#", АльтерраОбщегоНазначения.СформироватьСтрокуJSONИзМассиваСтрок(Парам.МассивАдресов));
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#Широта#", ?(ЗначениеЗаполнено(Парам.Широта),СтрЗаменить(""+Парам.Широта, ",", "."),0));
	КартаЯндекс= СтрЗаменить(КартаЯндекс, "#Долгота#",?(ЗначениеЗаполнено(Парам.Долгота),СтрЗаменить(""+Парам.Долгота, ",", "."),0));

КонецПроцедуры

Функция ПолучитьJSON(Парам) Экспорт
	РезультатЗапроса= ЗапросКСтоимостямПоЗонам(Парам);
	
	Зоны= "";
	
	
	//ВыбранныйФилиал = Парам.Филиал.Наименование; // при вызове из отдатьИнформациюПоЗонамДоставкиgetZonesCommon Филиал = Неопределено
      ВыбранныйФилиал = ?(Парам.Филиал=Неопределено,"",Парам.Филиал.Наименование);
	
	ВыборкаЗон= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗонаДоставки");
	Пока ВыборкаЗон.Следующий() Цикл
		
		мТарифс= Новый Массив;
		ПерваяСтрока= Истина;
		Выборка= ВыборкаЗон.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока Выборка.Следующий() Цикл
			Если ПерваяСтрока Тогда
				//Заполняем информацию по зоне доставки
				мСтрок= Новый Массив;
				
				Стоимость= ПолучитьСтоимость(Выборка, Парам);
				
				стрЦены= "Стоимость: "+Стоимость;	
				
				Цвет= Выборка.Цвет;
				Если Не ПустаяСтрока(Цвет) Тогда
					Цвет= СтрЗаменить(Цвет, " ","");
					Цвет= Прав(Цвет, 6);
				КонецЕсли;
				мСтрок.Добавить(СтрШаблон("zone_id: '%1',", Строка(Выборка.УИДЗоны)));
				мСтрок.Добавить(СтрШаблон("sZone: '%1',", Выборка.Координаты));
				мСтрок.Добавить(СтрШаблон("zone: '%1',", Выборка.ЗонаДоставки));
				мСтрок.Добавить(СтрШаблон("branch: '%1',", Выборка.Филиал));  
				мСтрок.Добавить(СтрШаблон("price: %1,", Формат(Стоимость, "ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0")));

				Если Выбранныйфилиал = Выборка.Филиал Или Выбранныйфилиал = "" Тогда
					мСтрок.Добавить(СтрШаблон("hintContent: '%1',", Выборка.ЗонаДоставки+" - "+стрЦены+" ("+Выборка.Филиал+")")); 
				Иначе
					мСтрок.Добавить(СтрШаблон("hintContent: '%1'", Выборка.ЗонаДоставки+" - "+"Ближайший филиал к адресу доставки:"  +" ("+Выборка.Филиал+")") + " + " + Символы.ПС +
						"' Чтобы осуществить доставку с выбранного филиала, уточните стоимость у дежурного логиста.',");
				КонецЕсли;

				мСтрок.Добавить(СтрШаблон("opacity: %1,", "0.5"));
				мСтрок.Добавить(СтрШаблон("fillColor: '%1',", Цвет));
				
				ПерваяСтрока= Ложь;
			КонецЕсли;
			
			////Заполняем информацию по тариффам
			Стоимость= ПолучитьСтоимость(Выборка, Парам);
			
			мТарифов= Новый Массив;
			мТарифов.Добавить(СтрШаблон("name: '%1',", Выборка.Тариф));
			мТарифов.Добавить(СтрШаблон("TariffID: '%1',", XMLСтрока(Выборка.СсылкаНаТариф)));  
			мТарифов.Добавить(СтрШаблон("DeliveryType: '%1',", Выборка.КодТипаДоставки)); 
			мТарифов.Добавить(СтрШаблон("CarTypeID: '%1',", XMLСтрока(Выборка.ВидАвтомобиля)));
			мТарифов.Добавить(СтрШаблон("branch: '%1',", Выборка.Филиал));
			мТарифов.Добавить(СтрШаблон("cost: %1,", Формат(Стоимость, "ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0")));
			мТарифов.Добавить(СтрШаблон("cost_per_km: %1", Формат(Выборка.СтоимостьЗаКм, "ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0")));
			мТарифс.Добавить(мТарифов);
		КонецЦикла;//Выборка
		
		Тарифы= "["+Символы.ПС;
		Для Каждого мТарифов Из мТарифс Цикл
			Тарифы= Тарифы+"{";
			Для Каждого стр Из мТарифов Цикл
				Тарифы= Тарифы+Символы.ПС+стр;	
			КонецЦикла;
			Тарифы= Тарифы+"},"+Символы.ПС;
		КонецЦикла;
		Тарифы= Лев(Тарифы, СтрДлина(Тарифы)-1);
		Тарифы= Тарифы+Символы.ПС+"]"+Символы.ПС;
		мСтрок.Добавить(СтрШаблон("tariffs: %1", Тарифы));
		
		//Формируем объект
		Зоны= Зоны+"{";
		Для Каждого стр Из мСтрок Цикл
			Зоны= Зоны+Символы.ПС+стр;
		КонецЦикла;
		
		Зоны= Зоны+"},"+Символы.ПС;
		
		//стрДЖОС= АльтерраОбщегоНазначения.СформироватьСтрокуJSON(мСтрок);
		
	КонецЦикла;//ВыборкаЗон
	
	стрJSON= Лев(Зоны, СтрДлина(Зоны)-1);
	стрJSON= "["+Символы.ПС+стрJSON+"]";

	Возврат стрJSON;
КонецФункции

Функция ЗапросКСтоимостямПоЗонам(Парам)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗоныДоставкиДоКлиента.Ссылка КАК ЗонаДоставки,
	|	СтоимостьДоставкиПоЗонамСрезПоследних.Филиал КАК Филиал,
	|	СтоимостьДоставкиПоЗонамСрезПоследних.Тариф КАК Тариф,
	|	СтоимостьДоставкиПоЗонамСрезПоследних.Тариф.Наименование КАК НаименованиеТарифа,
	|	СтоимостьДоставкиПоЗонамСрезПоследних.Тариф.ТипДоставки.Код КАК КодТипаДоставки,
	|	СтоимостьДоставкиПоЗонамСрезПоследних.Тариф.ВидАвтомобиля КАК ВидАвтомобиля,
	|	ЗоныДоставкиДоКлиента.Цвет КАК Цвет,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляВодителя, 0) КАК СтоимостьДляВодителя,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляКлиента, 0) КАК СтоимостьДляКлиента,
	|	ЕСТЬNULL(СтоимостьДоставкиПоЗонамСрезПоследних.МинимальнаяСтоимость, 0) КАК МинимальнаяСтоимость,
	|	ЗоныДоставкиДоКлиента.Координаты КАК Координаты
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.ЗоныДоставкиДоКлиента КАК ЗоныДоставкиДоКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьДоставкиПоЗонам.СрезПоследних(&Период, ) КАК СтоимостьДоставкиПоЗонамСрезПоследних
	|		ПО ЗоныДоставкиДоКлиента.Ссылка = СтоимостьДоставкиПоЗонамСрезПоследних.ЗонаДоставки
	|			И (СтоимостьДоставкиПоЗонамСрезПоследних.Тариф = &Тариф)
	|			И (СтоимостьДоставкиПоЗонамСрезПоследних.Филиал <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|ГДЕ
	|	ЗоныДоставкиДоКлиента.ПометкаУдаления = ЛОЖЬ
	|	И ЗоныДоставкиДоКлиента.ВидДоставки = &ВидДоставки
	|	И ЗоныДоставкиДоКлиента.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   УникальныйИдентификатор(ВТ.ЗонаДоставки) КАК УИДЗоны,
	|	ВТ.ЗонаДоставки.Наименование КАК ЗонаДоставки,
	|	ВТ.Тариф КАК СсылкаНаТариф,
	|	ВТ.НаименованиеТарифа КАК Тариф,
	|	ВТ.КодТипаДоставки КАК КодТипаДоставки,
	|	ВТ.ВидАвтомобиля КАК ВидАвтомобиля,
	|	ВТ.Филиал.Наименование КАК Филиал,
	|	ВТ.Цвет КАК Цвет,
	|	ВТ.СтоимостьДляВодителя КАК СтоимостьДляВодителя,
	|	ВТ.СтоимостьДляКлиента КАК СтоимостьДляКлиента,
	|	ВТ.МинимальнаяСтоимость КАК МинимальнаяСтоимость,
	|	ЕСТЬNULL(СтоимостьДоставкиПоРасстоянию.Стоимость, 0) КАК СтоимостьЗаКм,
	|	ВТ.Координаты КАК Координаты,
	|	ВЫБОР
	|		КОГДА ВТ.Филиал = &Филиал
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сортировка
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьДоставкиПоРасстоянию КАК СтоимостьДоставкиПоРасстоянию
	|		ПО ВТ.Тариф = СтоимостьДоставкиПоРасстоянию.Тариф
	|			И ВТ.Филиал = СтоимостьДоставкиПоРасстоянию.Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка УБЫВ,
	|	СтоимостьДляКлиента
	|ИТОГИ ПО
	|	ВТ.ЗонаДоставки";
	
	Запрос.УстановитьПараметр("ВидДоставки", Парам.ВидДоставки);
	Если Парам.Свойство("Филиал") Тогда 
		Запрос.УстановитьПараметр("Филиал", Парам.Филиал);
	Иначе 
		Запрос.УстановитьПараметр("Филиал", ложь);  
	КонецЕсли; 
	Если Парам.Свойство("Тариф") и ЗначениеЗаполнено(Парам.Тариф) Тогда
		Запрос.УстановитьПараметр("Тариф", Парам.Тариф);
	Иначе
		Запрос.Текст= СтрЗаменить(Запрос.Текст, "И (СтоимостьДоставкиПоЗонамСрезПоследних.Тариф = &Тариф)", "");
	КонецЕсли;            
	Если Парам.Свойство("Период") Тогда
		Запрос.УстановитьПараметр("Период", Парам.Период); 
	Иначе     
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#Область ИнициализацияКартыТолькоЗоны

Процедура ИнициализироватьКартуТолькоЗоны(КартаЯндекс, Парам) Экспорт
	МакетGlobalVars= Обработки.КартографическийИнтерфейсДоставка.ПолучитьМакет("МакетGlobalVars");
	МакетЯндексКарты= Обработки.КартографическийИнтерфейсДоставка.ПолучитьМакет("МакетЯндексТолькоЗоны");
	
	КартаЯндекс = МакетGlobalVars.ПолучитьТекст()+Символы.ПС+МакетЯндексКарты.ПолучитьТекст();
	
	стрJSON= ПолучитьJSONТолькоЗоны(Парам);
	
	СформироватьТекстМакета(КартаЯндекс, Парам, стрJSON);
КонецПроцедуры

Функция ПолучитьJSONТолькоЗоны(Парам) Экспорт
	РезультатЗапроса= ЗапросКЗонам(Парам);
	
	Зоны= "";	
	Выборка= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
	Пока Выборка.Следующий() Цикл
		мСтрок= Новый Массив;

		Цвет= Выборка.Цвет;
		Если Не ПустаяСтрока(Цвет) Тогда
			Цвет= СтрЗаменить(Цвет, " ","");
			Цвет= Прав(Цвет, 6);
		КонецЕсли;
		
		мСтрок.Добавить(СтрШаблон("sZone: '%1',", Выборка.Координаты));
		мСтрок.Добавить(СтрШаблон("zone: '%1',", Выборка.ЗонаДоставки));
		мСтрок.Добавить(СтрШаблон("price: %1,", "0"));
		мСтрок.Добавить(СтрШаблон("hintContent: '%1',", Выборка.ЗонаДоставки));
		мСтрок.Добавить(СтрШаблон("opacity: %1,", "0.5"));
		мСтрок.Добавить(СтрШаблон("fillColor: '%1',", Цвет));
		
		//Формируем объект
		Зоны= Зоны+"{";
		Для Каждого стр Из мСтрок Цикл
			Зоны= Зоны+Символы.ПС+стр;
		КонецЦикла;
		
		Зоны= Зоны+"},"+Символы.ПС;
		
	КонецЦикла;//ВыборкаЗон
	
	стрJSON= Лев(Зоны, СтрДлина(Зоны)-1);
	стрJSON= "["+Символы.ПС+стрJSON+"]";
	
	Возврат стрJSON;
КонецФункции
Функция ЗапросКЗонам(Парам)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗоныДоставкиДоКлиента.Ссылка КАК ЗонаДоставки,
	|	ЗоныДоставкиДоКлиента.Цвет КАК Цвет,
	|	ЗоныДоставкиДоКлиента.Координаты КАК Координаты
	|ИЗ
	|	Справочник.ЗоныДоставкиДоКлиента КАК ЗоныДоставкиДоКлиента
	|ГДЕ
	|	ЗоныДоставкиДоКлиента.ПометкаУдаления = ЛОЖЬ
	|	И ЗоныДоставкиДоКлиента.ВидДоставки = &ВидДоставки
	|	И ЗоныДоставкиДоКлиента.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ВидДоставки", Парам.ВидДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса;
КонецФункции


#КонецОбласти

#Область Вспомогательные
Функция ПолучитьСтоимость(Выборка, Парам)
	Стоимость= Выборка[Парам.ВидСтоимости];
	Если Не ЗначениеЗаполнено(Стоимость) Тогда
		Стоимость= 0;
	КонецЕсли;
	
	Если Парам.НДС = "СНДС" Тогда
		СтавкаНДС= УчетНДСУП.СтавкаНДСПоУмолчанию(Неопределено,ТекущаяДата());
		СтавкаНДСЧислом= ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС)/100+1;
		Стоимость= Стоимость*СтавкаНДСЧислом;
	КонецЕсли;
	
	Возврат Стоимость;
КонецФункции

Функция ПолучитьСтруктуруПараметров() Экспорт
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ОткрытИзДокумента", Ложь);
	ПараметрыФормы.Вставить("Партнер", Неопределено);
	ПараметрыФормы.Вставить("Филиал", Неопределено);
	ПараметрыФормы.Вставить("ВидДоставки", Неопределено);
	ПараметрыФормы.Вставить("ВидСтоимости", "СтоимостьДляКлиента");
	ПараметрыФормы.Вставить("Тариф", Неопределено);
	ПараметрыФормы.Вставить("Адрес", Неопределено);
	ПараметрыФормы.Вставить("Широта", Неопределено);
	ПараметрыФормы.Вставить("Долгота", Неопределено);
	ПараметрыФормы.Вставить("НДС", "БезНДС");
	ПараметрыФормы.Вставить("МассивАдресов", Новый Массив);
	
	Возврат ПараметрыФормы;
КонецФункции

Функция ПолучитьМассивКоординат(Знач Широта, Знач Долгота)  Экспорт
	Широта= Формат(Широта, "ЧРД=.");
	Долгота= Формат(Долгота, "ЧРД=.");
	стрКоординаты= "[" + Широта + "," + Долгота + "]";
	
	Возврат стрКоординаты;
КонецФункции

Процедура УстановитьНачальныеКоординаты(Филиал, стрКартаЯндекс)  Экспорт
	Координаты= АльтерраОбщегоНазначения.ПолучитьКоординатыФилиала(Филиал);
	Если ЗначениеЗаполнено(Координаты) Тогда
		стрКоординаты= ПолучитьМассивКоординат(Координаты.Широта, Координаты.Долгота);
		стрКартаЯндекс= СтрЗаменить(стрКартаЯндекс, "#КоординатыФилиала#", стрКоординаты);
		стрКартаЯндекс= СтрЗаменить(стрКартаЯндекс, "#Филиал#", Филиал);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьКлючЯндекс(стрКартаЯндекс)  Экспорт
	КлючЯндекс= АльтерраОбщегоНазначения.ПолучитьКлючЯндекс();
	
	УстановитьПривилегированныйРежим(Истина);
	КлючГеосаджест = Константы.КлючГеосаджест.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	 
	стрКартаЯндекс= СтрЗаменить(стрКартаЯндекс, "#КлючЯндекс#", КлючЯндекс);
	стрКартаЯндекс= СтрЗаменить(стрКартаЯндекс, "#КлючГеосаджест#", КлючГеосаджест);
КонецПроцедуры 

Функция ПолучитьСтоимостьЗаКмПоТарифу(Подразделение, Тариф)  Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьДоставкиПоРасстоянию.Подразделение КАК Подразделение,
	|	СтоимостьДоставкиПоРасстоянию.Тариф КАК Тариф,
	|	СтоимостьДоставкиПоРасстоянию.Стоимость КАК Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьДоставкиПоРасстоянию КАК СтоимостьДоставкиПоРасстоянию
	|ГДЕ
	|	СтоимостьДоставкиПоРасстоянию.Подразделение = &Подразделение
	|	И СтоимостьДоставкиПоРасстоянию.Тариф = &Тариф";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Формат(Выборка.Стоимость, "ЧРД=.; ЧРГ=; ЧГ=0");
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПроверитьИПредложитьДругойФилиал(Знач Объект) Экспорт
	ИнформацияПоДоставке= "";
	
	УстановитьПривилегированныйРежим(Истина);
	ТекстОстатки="
	|ВЫБРАТЬ
	|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Остаток,
	|	ЗапасыИПотребностиОстатки.Склад КАК Склад,
	|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_РаспределениеЗапасов
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки(, ) КАК ЗапасыИПотребностиОстатки
	|ГДЕ
	|	ЗапасыИПотребностиОстатки.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И (ЗапасыИПотребностиОстатки.Номенклатура, ЗапасыИПотребностиОстатки.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ_Товар.Номенклатура,
	|				ВТ_Товар.Характеристика
	|			ИЗ
	|				ВТ_Товар)
	|	И ЗапасыИПотребностиОстатки.Склад В
	|			(ВЫБРАТЬ
	|				ВТ_Склады.Склад
	|			ИЗ
	|				ВТ_Склады)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыИПотребностиОстатки.Склад,
	|	ЗапасыИПотребностиОстатки.Номенклатура,
	|	ЗапасыИПотребностиОстатки.Характеристика
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьДоставкиПоЗонамСрезПоследних.Филиал КАК Подразделение,
	|	Склады.Ссылка КАК Склад,
	|	ЗоныДоставкиДоКлиента.Ссылка КАК Зана,
	|	ЗоныДоставкиДоКлиента.Наименование КАК ЗонаНаименование,
	|	СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляКлиента КАК СтоимостьДляКлиента
	|ПОМЕСТИТЬ ВТ_Склады
	|ИЗ
	|	РегистрСведений.СтоимостьДоставкиПоЗонам.СрезПоследних(&Период, ) КАК СтоимостьДоставкиПоЗонамСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗоныДоставкиДоКлиента КАК ЗоныДоставкиДоКлиента
	|		ПО СтоимостьДоставкиПоЗонамСрезПоследних.ЗонаДоставки = ЗоныДоставкиДоКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО СтоимостьДоставкиПоЗонамСрезПоследних.Филиал = Склады.Подразделение
	|ГДЕ
	|	Склады.СкладПродажи
	|	И СтоимостьДоставкиПоЗонамСрезПоследних.Тариф = &Тариф
	|	И ЗоныДоставкиДоКлиента.Ссылка = &Зона
	|	И СтоимостьДоставкиПоЗонамСрезПоследних.Филиал <> &ТекущееПодразделение
	|	И СтоимостьДоставкиПоЗонамСрезПоследних.СтоимостьДляКлиента < &СтоимостьДляКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товар.Номенклатура КАК Номенклатура,
	|	ВТ_Товар.Характеристика КАК Характеристика,
	|	ВТ_Товар.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Товар
	|ИЗ
	|	&Товар КАК ВТ_Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////"+
    ТекстОстатки+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.Остаток, 0)) КАК Остаток,
	|	ВТ_Товар.Номенклатура КАК Номенклатура,
	|	ВТ_Товар.Характеристика КАК Характеристика,
	|	ВТ_Склады.Подразделение КАК Подразделение,
	|	ВТ_Склады.Зана КАК Зана,
	|	ВТ_Склады.ЗонаНаименование КАК ЗонаНаименование,
	|	МАКСИМУМ(ВТ_Товар.Количество) КАК Количество,
	|	ВТ_Склады.СтоимостьДляКлиента КАК СтоимостьДляКлиента
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Товар КАК ВТ_Товар
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеЗапасов КАК СвободныеОстаткиОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
	|			ПО СвободныеОстаткиОстатки.Склад = ВТ_Склады.Склад
	|		ПО ВТ_Товар.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	|			И ВТ_Товар.Характеристика = СвободныеОстаткиОстатки.Характеристика
	|ГДЕ
	|	СвободныеОстаткиОстатки.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товар.Характеристика,
	|	ВТ_Склады.Зана,
	|	ВТ_Склады.ЗонаНаименование,
	|	ВТ_Товар.Номенклатура,
	|	ВТ_Склады.Подразделение,
	|	ВТ_Склады.СтоимостьДляКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Остаток - ВТ_Результат.Количество КАК Доступно,
	|	ВТ_Результат.Номенклатура КАК Номенклатура,
	|	ВТ_Результат.Характеристика КАК Характеристика,
	|	ВТ_Результат.Подразделение КАК Подразделение,
	|	ВТ_Результат.Зана КАК Зана,
	|	ВТ_Результат.ЗонаНаименование КАК ЗонаНаименование,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.Остаток КАК Остаток,
	|	ВТ_Результат.СтоимостьДляКлиента КАК СтоимостьДляКлиента
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтоимостьДляКлиента
	|ИТОГИ ПО
	|	Подразделение";
	
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);
	Запрос.УстановитьПараметр("ТекущееПодразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("Тариф", Объект.Тариф);   
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("СтоимостьДляКлиента", Объект.СтоимостьДоставки+Объект.СтоимостьДоставкиСНДС);
	Запрос.УстановитьПараметр("Зона", Объект.ЗонаДоставкиДляВодителя);
	Запрос.УстановитьПараметр("Товар", Объект.Товары.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВыборкаПодразделение= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	Пока ВыборкаПодразделение.Следующий() Цикл
		НеХватает= Ложь;
		
		ВыборкаОстатков= ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока ВыборкаОстатков.Следующий() Цикл
			Если ВыборкаОстатков.Доступно < 0 Тогда 
				НеХватает= Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НеХватает = Ложь Тогда
			ИнформацияПоДоставке= "Данные товары лучше заказать на филиале "+ВыборкаПодразделение.Подразделение;
			Возврат ИнформацияПоДоставке;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
КонецФункции

Функция ПолучитьМассивАдресов(ТаблицаТочек, АдресОтправления, ВозвратНаБазу=Ложь) Экспорт
	Результат = "";
	
	Результат = Результат + "[""" +АдресОтправления;
	
	Для Ин = 0 По ТаблицаТочек.Количество() - 1 Цикл
		Результат = Результат + """,""" + ТаблицаТочек[ин].АдресДоставки;
	КонецЦикла;
	
	Если ВозвратНаБазу Тогда
		Результат= Результат + """,""" + АдресОтправления + """]";
	Иначе
		Результат= Результат + """]";
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьЗонуДоставкиПоНаименованию(Зона) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗоныДоставкиДоКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЗоныДоставкиДоКлиента КАК ЗоныДоставкиДоКлиента
	|ГДЕ
	|	ЗоныДоставкиДоКлиента.Наименование = &Наименование
	|	И НЕ ЗоныДоставкиДоКлиента.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", Зона);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти


#КонецЕсли
