
&После("ОбработкаКомандыОтчетаОформлениеДокументов")
Процедура Док_ОбработкаКомандыОтчетаОформлениеДокументов(Форма, ОписаниеКоманды, АктОРасхождениях, ОснованиеАкта, ОформляемыйДокумент)
	
	Если ОписаниеКоманды = "Оформить" Тогда
		
		Если ТипЗнч(ОформляемыйДокумент) = Тип("Структура")
			И ОформляемыйДокумент.Свойство("ОформляемыйДокумент")
			И ТипЗнч(ОформляемыйДокумент.ОформляемыйДокумент) = Тип("ДокументСсылка.ПорчаТоваров") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("АктОРасхождениях", АктОРасхождениях);
			ПараметрыФормы.Вставить("ДокументОснование", ОснованиеАкта);
			ПараметрыФормы.Вставить("Склад", ОформляемыйДокумент.Склад);
			
			ОткрытьФорму("Документ.ПорчаТоваров.Форма.ФормаДокумента", Новый Структура("Основание", ПараметрыФормы), Форма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
