#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИнформационнаяСсылка = АдресСервера();
	Если ПустаяСтрока(ИнформационнаяСсылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес сервера 1С:Аналитики не указан. Необходимо завершить настройку интеграции с 1С:Аналитикой. Обратитесь к администратору'"));
		Возврат;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнформационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АдресСервера()
	Возврат СистемаАналитики.ПолучитьАдресСервераСистемыАналитики();
КонецФункции

#КонецОбласти