#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Карточка номенклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МакетШтрихкода";
	КомандаПечати.Представление = НСтр("ru = 'Штрихкод'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Штрихкод'");
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетШтрихкода") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МакетШтрихкода", 
		"МакетШтрихкода", 
		СформироватьПечатнуюФормуМакетШтрихкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуМакетШтрихкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	//Ссылка= МассивОбъектов[0].Ссылка;
	
	ТабДок= Новый ТабличныйДокумент;
	Макет= ПолучитьМакет("МакетШтрихкода");
	Шапка= Макет.ПолучитьОбласть("Шапка");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Шапка.Параметры.Наименование= Ссылка.Наименование;	
		Шапка.Параметры.Описание= Ссылка.Описание;	
		
		//Штрихкод
		Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		Рисунок= Шапка.Рисунки[0];
		
		
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        Строка(Ссылка.Код));
		ПараметрыШтрихкода.Вставить("ТипКода",         99);
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    12);
		
		Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		//-	
		
		ТабДок.Вывести(Шапка);
	КонецЦикла;
	Возврат ТабДок;
КонецФункции

#КонецЕсли
