 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДежурныеПоПодразделениям.Очистить();
	Для каждого Строка из ДанныеОВремени Цикл
		Для Инд = 1 по 31 Цикл
			
			Если СтрНайти(Строка["Примечание"+Инд],"А") Тогда
				НоваяСтрока = ДежурныеПоПодразделениям.Добавить();
				НоваяСтрока.Сотрудник = Строка.Сотрудник;
				НоваяСтрока.Дата = Дата(Год(Месяц),Месяц(Месяц),Инд); 
				НоваяСтрока.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000001");
			КонецЕсли;
			
			Если СтрНайти(Строка["Примечание"+Инд],"В") Тогда
				НоваяСтрока = ДежурныеПоПодразделениям.Добавить();
				НоваяСтрока.Сотрудник = Строка.Сотрудник;
				НоваяСтрока.Дата = Дата(Год(Месяц),Месяц(Месяц),Инд); 
				НоваяСтрока.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000003");
			КонецЕсли;
			
			Если СтрНайти(Строка["Примечание"+Инд],"С") Тогда
				НоваяСтрока = ДежурныеПоПодразделениям.Добавить();
				НоваяСтрока.Сотрудник = Строка.Сотрудник;
				НоваяСтрока.Дата = Дата(Год(Месяц),Месяц(Месяц),Инд); 
				НоваяСтрока.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000002");
				
			КонецЕсли;
			
			Если Не СтрНайти(Строка["Примечание"+Инд],"Д/О") И СтрНайти(Строка["Примечание"+Инд],"Д") Тогда
				НоваяСтрока = ДежурныеПоПодразделениям.Добавить();
				НоваяСтрока.Сотрудник = Строка.Сотрудник;
				НоваяСтрока.Дата = Дата(Год(Месяц),Месяц(Месяц),Инд); 
				НоваяСтрока.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("0А-000004");	
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
