&НаКлиенте
Перем УстановочныйФайл;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
    Элементы.ДляТестовойБазы.Видимость = НЕ АльтерраОбщегоНазначения.ЭтоРабочаяБаза();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено,ЭтаФорма, "СканерШтрихкода");
	ИнициализироватьСканер();	
	ПодключитьОбработчикОжидания("ОбновитьДанныеПоКоличествуЗаданий", 60, Ложь);
	ПодключитьОбработчикОжидания("ПроверкаВерсииПриложения", 1, Истина); 
	
	Если ЗначениеЗАполнено(Сотрудник) ТОгда 
		//Подключение оповещений из очереди

					Секции = СекцииСотрудника();
					СообщениеОбработано = Истина;
					Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
						Если Не ПолучитьСостояниеОповещений() Тогда
							ОповещенияИзОчереди = Истина;
						Иначе
							ОповещенияИзОчереди = ОповещенияПоСотруднику(); 
						КонецЕсли;
					Иначе 
						ОповещенияИзОчереди = Ложь; 	
					КонецЕсли; 
					Инт = 60;
					Для каждого Стр Из Секции Цикл
						ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
						Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
							Инт = ЗнчИнтервала;
						КонецЕсли; 
					КонецЦикла; 
					ИнтервалОповещений = Инт; 
					
					Если ОповещенияИзОчереди Тогда 
						Элементы.ГруппаСписокОчереди.Видимость = Истина; 
						ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь); 
						ПроверкаЭлектроннойОчереди(); 
					Иначе 
						Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
					КонецЕсли;
				КонецЕсли;
				
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если  ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode" Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 =  Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			Данные= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Штрихкод1);
			Штрихкод= Данные.Штрихкод;
			
			Если ПустаяСтрока(Штрихкод) Тогда
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				Элементы.СчитатьШтрихкод.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
			КонецЕсли;
			
			Если Лев(Штрихкод, 4) = "8888" Тогда//Это сотрудник
				Сотрудник = НайтиСотрудникаПоКоду(Штрихкод);
				Если Сотрудник.Пустая() Тогда
					Элементы.Декорация1.Заголовок = "Нет сотрудника с данным штрихкодом или у cотрудника в карточке не заполнена табличная часть 'Рабочие участки (ТСД)'!";
					Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
					Элементы.Декорация1.Видимость = Истина;
					Элементы.СчитатьШтрихкод.Видимость = Истина;
					ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Иначе
					СотрудникНайден(); 
					Возврат;
				КонецЕсли;
			Иначе
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				Элементы.СчитатьШтрихкод.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура _Вход(Команда)
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		СотрудникНайден();
		Элементы.ДляТестовойБазы.Видимость = Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введите сотрудника!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНайден()
	ЭтаФорма.Заголовок = Строка(Сотрудник);
	ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Истина;
	Элементы.Декорация1.Видимость = Ложь;
	ОбновитьДанныеПоКоличествуЗаданийНаСервере();

	УстановитьТекущегоСотрудника(Сотрудник);
	Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(ПредопределенноеЗначение("Перечисление.СобытияРаботыТСД.Вход"));
			
	СсылкаНаПоследнийДокумент = ПолучитьПоследнийДокументНеВыполненный(Сотрудник);

	//Подключение оповещений из очереди

	Секции = СекцииСотрудника();
	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = ОповещенияПоСотруднику(); 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;
	Для каждого Стр Из Секции Цикл
		ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
		Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
			Инт = ЗнчИнтервала;
		КонецЕсли; 
	КонецЦикла; 
	ИнтервалОповещений = Инт; 
	 
	Если ОповещенияИзОчереди Тогда 
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь); 
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли;


	Если Не СсылкаНаПоследнийДокумент = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораВарианта",ЭтотОбъект,Новый Структура("Документ",СсылкаНаПоследнийДокумент));
		ПоказатьВопрос(Оповещение,"Открыть последний документ?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
    Отказ = Истина;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
		ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение,
		"Спасибо за работу! Завершить?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Завершение работы"
		);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Дополнительно(Команда)
   	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Дополнительно",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Отгрузка(Команда)
	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Отгрузка",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Пересчет(Команда)
  	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Пересчет",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Приемка(Команда)
 	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Приемка",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЦенников(Команда)
  	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"ПроверкаЦенников",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры


&НаКлиенте
Процедура ПроверкаАдресногоХранения(Команда)
	ОткрытьФорму("Обработка.ПроверкаАдресногоХранения.Форма.ФормаТСД", Новый Структура("Сотрудник", Сотрудник), ЭтотОбъект);
КонецПроцедуры
 #КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

#Область ПроверкаВерсииПриложения  

&НаКлиенте
Процедура ПроверкаВерсииПриложения()        
	
	Если АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда     
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		АктуальнаяВерсия = ПолучитьАктуальнуюВерсию();   
		
		Если ЗначениеЗаполнено(АктуальнаяВерсия) И АктуальнаяВерсия <> СистемнаяИнформация.ВерсияПриложения  Тогда    

			ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьВерсиюЗавершение", ЭтаФорма), 
			"Версия вашего приложения: "  + СистемнаяИнформация.ВерсияПриложения + Символы.ПС +
			"не совпадает с актуальной: "  + АктуальнаяВерсия + "." + Символы.ПС + 
			"Обновить?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;     
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьАктуальнуюВерсию()   
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ВерсияМобильногоКлиента.Получить();
КонецФункции	 
	 
&НаКлиенте
Процедура ОбновитьВерсиюЗавершение(РезультатВопроса, Параметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда   
		
		СкачиваемыйФайл = СохранитьФайлНаСервере();     
		
		Если СкачиваемыйФайл.ПолноеИмяФайла <> "" Тогда                   
			
			ВключитьОжидание(Истина);
			
			ПутьНаУстройстве = "/storage/emulated/0/Download/"; 
			ЛокальноеИмяФайла = ПутьНаУстройстве + СкачиваемыйФайл.ИмяФайла;           
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПутьКФайлу", ПутьНаУстройстве);
			ДополнительныеПараметры.Вставить("ИмяФайла", СкачиваемыйФайл.ИмяФайла);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияФайлаССервера", ЭтотОбъект, ДополнительныеПараметры);
			НачатьПолучениеФайлаССервера(ОписаниеОповещения, СкачиваемыйФайл.Адрес, ЛокальноеИмяФайла);     
			
			ПодключитьОбработчикОжидания("ЗапустьСкачанныйФайлУстановки", 1, Ложь);
		Иначе
			ПоказатьПредупреждение(, "Отсутствует файл обновления " + Символы.ПС + СкачиваемыйФайл.ПолноеИмяФайла, 0, "Обновление не найдено");	
		КонецЕсли;
	КонецЕсли;                                                      
КонецПроцедуры   

 &НаСервере
 Функция СохранитьФайлНаСервере()   
	УстановитьПривилегированныйРежим(Истина);    
	
	НахождениеОбновленияМобильногоКлиента = Константы.НахождениеОбновленияМобильногоКлиента.Получить();
	СкачиваемыйФайл = Новый Структура("ПолноеИмяФайла, ИмяФайла, Адрес", "", "", "");
	
	ФайлНаДиске = Новый Файл(НахождениеОбновленияМобильногоКлиента);
	Если ФайлНаДиске.Существует() Тогда                                        
		
		СкачиваемыйФайл.ПолноеИмяФайла = НахождениеОбновленияМобильногоКлиента;
		СкачиваемыйФайл.ИмяФайла = ПолучитьИмяФайла(НахождениеОбновленияМобильногоКлиента);

		Двоичное = Новый ДвоичныеДанные(НахождениеОбновленияМобильногоКлиента); 
		СкачиваемыйФайл.Адрес = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор); 
	КонецЕсли;
	
	Возврат СкачиваемыйФайл; 
 КонецФункции

&НаКлиенте
Процедура ПослеПолученияФайлаССервера(ПолученныйФайл, ДополнительныеПараметры) Экспорт
	УстановочныйФайл = ДополнительныеПараметры;
КонецПроцедуры  
	
&НаКлиенте
Процедура ЗапустьСкачанныйФайлУстановки()

	Если ЗначениеЗаполнено(УстановочныйФайл) Тогда 
	  
		ОтключитьОбработчикОжидания("ЗапустьСкачанныйФайлУстановки"); 
		ВключитьОжидание(Ложь);       
		
		ФайлНаДиске = Новый Файл(УстановочныйФайл.ПутьКФайлу + УстановочныйФайл.ИмяФайла);
		Если ФайлНаДиске.Существует() Тогда    
			
			Если ТекущаяДата() - ФайлНаДиске.ПолучитьВремяИзменения() < 60*30 Тогда // файл получасовой свежести
				Заголовок = "Обновление скачано";
				ТекстСообщения = "Перейдите в папку загрузок " + УстановочныйФайл.ПутьКФайлу + Символы.ПС + "и запустите файл " + УстановочныйФайл.ИмяФайла;
			Иначе     
				Заголовок = "Обновление не скачано";
				ТекстСообщения = "В папке загрузок " + УстановочныйФайл.ПутьКФайлу + Символы.ПС + "старый файл " + УстановочныйФайл.ИмяФайла;
			КонецЕсли;
		Иначе
			Заголовок = "Обновление не скачано";
			ТекстСообщения = "В папке загрузок " + УстановочныйФайл.ПутьКФайлу + Символы.ПС + "нет файла " + УстановочныйФайл.ИмяФайла;
		КонецЕсли;                                                                                                            
		
		ПоказатьПредупреждение(, ТекстСообщения, 0, Заголовок);
	КонецЕсли;  
КонецПроцедуры  	

Функция ПолучитьИмяФайла(СтрокаПути)   
	
	ИмяФайла = СтрокаПути;
	
	Пока Не Найти(ИмяФайла, "\") = 0 Цикл
		ИмяФайла = Сред(ИмяФайла, Найти(ИмяФайла, "\") + 1);
	КонецЦикла;  
	
	Возврат ИмяФайла;
КонецФункции

&НаКлиенте
Процедура ВключитьОжидание(НадоПодождать)
	Элементы.ГруппаОжидание.Видимость = НадоПодождать;
	Элементы.Декорация1.Видимость = Не НадоПодождать;
	Элементы.СчитатьШтрихкод.Видимость = Не НадоПодождать;
КонецПроцедуры
 
#КонецОбласти


&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

Функция НайтиСотрудникаПоКоду(Штрихкод)
	
	СотрудникПустаяССылка = Справочники.сотрудники.ПустаяСсылка();
	
	НайденныйСотрудник= Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
	
	Если ЗначениеЗаполнено(НайденныйСотрудник) Тогда
		Если НайденныйСотрудник.РабочиеУчастки.Количество()>0 Тогда
			РольМобильногоКлиента = НайденныйСотрудник.РольМобильногоКлиента;
			Возврат НайденныйСотрудник;
		Иначе
			Возврат СотрудникПустаяССылка;
		КонецЕсли;
	Иначе
		Возврат СотрудникПустаяССылка;
	КонецЕсли;

КонецФункции

Процедура УстановитьТекущегоСотрудника(Сотрудник)
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ТекущийСотрудник = Сотрудник;
	
	УстановитьПривилегированныйРежим(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(ПредопределенноеЗначение("Перечисление.СобытияРаботыТСД.Выход"));
		ОтключитьСканер();
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВарианта(Результат, ДополнительныеПараметры) Экспорт
	Документ = "";
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДокСсылка = ДополнительныеПараметры.Документ;
		Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			Документ = "Документ.РасходныйОрдерНаТовары.Форма.Док_ФормаДокументаДляТСД";
		ИначеЕсли 
			ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
			Документ = "Документ.ПриходныйОрдерНаТовары.Форма.Док_ФормаДокументаТСД";
		Иначе
		  	Документ = "Документ.ПересчетТоваров.Форма.Док_ФормаДокументаТСД"; 
		КонецЕсли;
		Если Не Документ = "" Тогда 
			ОткрытьФорму(Документ,Новый Структура("Ключ,Секции,ТекущийСотрудникТСД",ДокСсылка,СекцииСотрудника(),Сотрудник));
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоКоличествуЗаданий() Экспорт
	ДанныеПоКоличеству = ОбновитьДанныеПоКоличествуЗаданийНаСервере();
	КоличествоДокПриемка = ДанныеПоКоличеству.КоличествоДокПриемка;
	Если КоличествоДокОтгрузка < ДанныеПоКоличеству.КоличествоДокОтгрузка Тогда
	КоличествоДокОтгрузка = ДанныеПоКоличеству.КоличествоДокОтгрузка;
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
	Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
						СредстваМультимедиа.ВоспроизвестиТекст("Новое задание!","ru-RU");
					Иначе
						СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();
					КонецЕсли;
					#КонецЕсли
	КонецЕсли;
	КоличествоДокПересчет = ДанныеПоКоличеству.КоличествоДокПересчет;
КонецПроцедуры

Функция ОбновитьДанныеПоКоличествуЗаданийНаСервере()
	ДанныеПоКоличеству = ОбновитьДанныеНаСервере(Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток"),Сотрудник.Склад);
	Возврат ДанныеПоКоличеству;
КонецФункции

Функция ОбновитьДанныеНаСервере(Секция,Склад)
		
	СтруктураДанныхВозврата = Новый Структура;
	СтруктураДанныхВозврата.Вставить("КоличествоДокПриемка",);
	СтруктураДанныхВозврата.Вставить("КоличествоДокОтгрузка",);
	СтруктураДанныхВозврата.Вставить("КоличествоДокПересчет",);
		
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыКПоступлениюОстатки.ДокументПоступления) КАК КоличествоДокПриемка,
	               |	0 КАК КоличествоДокОтгрузка,
	               |	0 КАК КоличествоДокПересчет
	               |ПОМЕСТИТЬ ВТ_Временная
	               |ИЗ
	               |	РегистрНакопления.ТоварыКПоступлению.Остатки(&КонецДня, Склад = &Склад) КАК ТоварыКПоступлениюОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	               |		ПО ТоварыКПоступлениюОстатки.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	               |			И ТоварыКПоступлениюОстатки.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	               |			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	               |ГДЕ
	               |	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0
	               |	И ВЫБОР
	               |			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	               |				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&Секция)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	               |			КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЗаказНаПеремещение
	               |				ТОГДА ПеремещениеТоваров.Ссылка
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	               |						ТОГДА РеализацияТоваровУслуг.Ссылка
	               |					ИНАЧЕ ТоварыКОтгрузке.ДокументОтгрузки
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	0
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(&КонецДня, Склад = &Склад) КАК ТоварыКОтгрузке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО ТоварыКОтгрузке.ДокументОтгрузки = ПеремещениеТоваров.ЗаказНаПеремещение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ТоварыКОтгрузке.ДокументОтгрузки = РеализацияТоваровУслуг.ЗаказКлиента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	               |		ПО ТоварыКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	               |			И ТоварыКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	               |			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	               |				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&Секция)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ТоварыКОтгрузке.КОтгрузкеОстаток > 0
	               |	И ТоварыКОтгрузке.ДокументОтгрузки.Дата >= &ДатаНачалаОрдерной
	               |	И ВЫБОР
	               |			КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	               |				ТОГДА НЕ РеализацияТоваровУслуг.Ссылка.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
	               |						ТОГДА НЕ ТоварыКОтгрузке.ДокументОтгрузки.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЧекККМ
	               |								ТОГДА ТоварыКОтгрузке.ДокументОтгрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПересчетТоваров.Ссылка)
	               |ИЗ
	               |	Документ.ПересчетТоваров КАК ПересчетТоваров
	               |ГДЕ
	               |	ПересчетТоваров.Склад = &Склад
	               |	//И ПересчетТоваров.Проведен = ИСТИНА
	               |	И ПересчетТоваров.Дата МЕЖДУ &НачалоДня И &КонецДня
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ_Временная.КоличествоДокПриемка) КАК КоличествоДокПриемка,
	               |	СУММА(ВТ_Временная.КоличествоДокПересчет) КАК КоличествоДокПересчет,
	               |	СУММА(ВТ_Временная.КоличествоДокОтгрузка) КАК КоличествоДокОтгрузка
	               |ИЗ
	               |	ВТ_Временная КАК ВТ_Временная";
	
	Запрос.УстановитьПараметр("Секция", Секция);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ДатаНачалаОрдерной", Склад.ДатаНачалаОрдернойСхемыПриОтгрузке);
	
	Запрос.УстановитьПараметр("НачалоДня", Началодня(ТекущаяДата()));	
    Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДата()));	

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ЗаполнитьЗначенияСвойств(СтруктураДанныхВозврата,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
		
	Возврат СтруктураДанныхВозврата;
КонецФункции

&НаКлиенте
Процедура СчитатьШтрихкод(Команда)
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
	
		#Если МобильныйКлиент Тогда
		    СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		    Если ПустаяСтрока(Штрихкод) Тогда
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
			КонецЕсли;
			
			Если Лев(Штрихкод, 4) = "8888" Тогда//Это сотрудник
				Сотрудник = НайтиСотрудникаПоКоду(Штрихкод);
				Если Сотрудник.Пустая() Тогда
					Элементы.Декорация1.Заголовок = "Нет сотрудника с данным штрихкодом или у cотрудника в карточке не заполнена табличная часть 'Рабочие участки (ТСД)'!";
					Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
					Элементы.Декорация1.Видимость = Истина;
					ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Иначе
					
					УстановитьВидимостьКоманд();					
					
					ЭтаФорма.Заголовок = Строка(Сотрудник);
					ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Истина;
					Элементы.Декорация1.Видимость = Ложь;
					Элементы.СчитатьШтрихкод.Видимость = Ложь;
                   
					ОбновитьДанныеПоКоличествуЗаданийНаСервере();
					
					УстановитьТекущегоСотрудника(Сотрудник);
					Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(ПредопределенноеЗначение("Перечисление.СобытияРаботыТСД.Вход"));
							
					СсылкаНаПоследнийДокумент = ПолучитьПоследнийДокументНеВыполненный(Сотрудник);
					
					//Подключение оповещений из очереди

					Секции = СекцииСотрудника();
					СообщениеОбработано = Истина;
					Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
						Если Не ПолучитьСостояниеОповещений() Тогда
							ОповещенияИзОчереди = Истина;
						Иначе
							ОповещенияИзОчереди = ОповещенияПоСотруднику(); 
						КонецЕсли;
					Иначе 
						ОповещенияИзОчереди = Ложь; 	
					КонецЕсли; 
					Инт = 60;
					Для каждого Стр Из Секции Цикл
						ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
						Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
							Инт = ЗнчИнтервала;
						КонецЕсли; 
					КонецЦикла; 
					ИнтервалОповещений = Инт; 
					
					Если ОповещенияИзОчереди Тогда 
						Элементы.ГруппаСписокОчереди.Видимость = Истина; 
						ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь); 
						ПроверкаЭлектроннойОчереди(); 
					Иначе 
						Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
					КонецЕсли;

					
					Если Не СсылкаНаПоследнийДокумент = Неопределено Тогда
						Оповещение = Новый ОписаниеОповещения("ПослеВыбораВарианта",ЭтотОбъект,Новый Структура("Документ",СсылкаНаПоследнийДокумент));
						ПоказатьВопрос(Оповещение,"Открыть последний документ?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да);
					КонецЕсли;

					Возврат;

				КонецЕсли;
			Иначе
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
			КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКоманд();
	Если РольМобильногоКлиента = ПредопределенноеЗначение("Перечисление.РолиМобильногоКлиента.Бухгалтер") Тогда
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Пересчет",РольМобильногоКлиента),ЭтотОбъект);	
	ИначеЕсли РольМобильногоКлиента = ПредопределенноеЗначение("Перечисление.РолиМобильногоКлиента.Кладовщик") Тогда
		Элементы.ГруппаКомандаПроверкаЦенников.Видимость = Ложь;	
	ИначеЕсли РольМобильногоКлиента = ПредопределенноеЗначение("Перечисление.РолиМобильногоКлиента.Менеджер") Тогда
		Элементы.ГруппаКомандаПриемки.Видимость = Ложь;
		Элементы.ГруппаКомандаОтгрузки.Видимость = Ложь;
		Элементы.Дополнительно.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПоследнийДокументНеВыполненный(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналРаботыТСДСрезПоследних.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ЖурналРаботыТСД.СрезПоследних(
	|			,
	|			Событие = ЗНАЧЕНИЕ(Перечисление.СобытияРаботыТСД.Документ)
	|				И ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.РасходныйОрдерНаТовары) ТОГДА Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
	|				КОГДА ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.ПриходныйОрдерНаТовары) ТОГДА Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.ВРаботе)
	|			    КОГДА ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.ПересчетТоваров) ТОГДА Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.ВРаботе)
	|			КОНЕЦ	
	|				И Документ.Проведен
	|				И Сотрудник = &Сотрудник) КАК ЖурналРаботыТСДСрезПоследних
	|";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Документ;
	
КонецФункции

Функция СекцииСотрудника()
	Возврат Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
КонецФункции





#КонецОбласти     

#Область Оповещения 
&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
				
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда   
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента,ОткрытьОчередь",Сотрудник,"Отгрузка",РольМобильногоКлиента,Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника()); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника());
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
   	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Функция ОповещенияПоСотруднику() 
	Возврат Сотрудник.ОповещенияИзОчереди; 
КонецФункции

&НаКлиенте
Процедура ПодключаемоеОборудование(Команда)
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка",Новый Структура("ИмяКоманды","Дополнительно"),ЭтотОбъект);
КонецПроцедуры

#КонецОбласти