&НаСервере
Функция ОтправитьНаСервере(ЗаказКлиентаНаДоставку)
	
	СтруктураОтвета = Новый Структура("ИД,Статус","","");
	
	НомерТелефона = ЗаказКлиентаНаДоставку.ТелефонКлиентаНаВыгрузке;
	ВремяС = Формат(ЗаказКлиентаНаДоставку.ВремяДоставкиС,"ДФ=H-mm");
	ВремяПо = Формат(ЗаказКлиентаНаДоставку.ВремяДоставкиПо,"ДФ=H-mm");
	
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона);
	НомераТелефонов = Новый Массив;
	НомераТелефонов.Добавить("+7"+НомерТелефона);
	
	
	// Символ(9951) - картинка грузовик
	// Символ(9742) - картинка телефон
	//ТекстСообщения = "Спасибо за Ваш заказ, ожидайте " + Символ(9951) + " с " + Строка(ВремяС) + " до " + Строка(ВремяПО) + ", " + Символ(9742) + " " + ТелефонДиспетчераПоДоставке;
	
	Если НЕ ЗначениеЗаполнено(ТелефонВодителя) Или ЗаказКлиентаНаДоставку.Интервал.СМС = 0 Тогда 
		ТелефонСМС = ТелефонДиспетчераПоДоставке;
	ИначеЕсли  ЗаказКлиентаНаДоставку.Интервал.СМС = 1 Тогда
		ТелефонСМС = ТелефонВодителя;	
	Иначе
		ТелефонСМС = ТелефонДиспетчераПоДоставке+" , "+ТелефонВодителя;
	КонецЕсли;
	
	ТекстСообщения = "Спасибо за Ваш заказ, ожидайте доставку с " + Строка(ВремяС) + " до " + Строка(ВремяПО) + ", " + ТелефонСМС;
		
	РезультатОтправки = ОтправкаSMS.ОтправитьSMS(НомераТелефонов,ТекстСообщения,,);
	
	Если Не ПустаяСтрока(РезультатОтправки.ОписаниеОшибки) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОтправки.ОписаниеОшибки,,);
		СтруктураОтвета.Статус = "Ошибка: " + РезультатОтправки.ОписаниеОшибки;
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	Если РезультатОтправки.ОтправленныеСообщения.Количество() > 0 Тогда
		ИндентификаторСообщения = РезультатОтправки.ОтправленныеСообщения[0].ИдентификаторСообщения;
		СтатусДоставкиСообщения = ОтправкаSMS.СтатусДоставки(ИндентификаторСообщения);
		
		СтруктураОтвета.ИД = ИндентификаторСообщения;
		СтруктураОтвета.Статус  = СтатусДоставкиСообщения;
		
		Возврат СтруктураОтвета;
	Иначе
		СтруктураОтвета.Статус = "Ошибка: " + РезультатОтправки.ОписаниеОшибки;
		Возврат СтруктураОтвета; 
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Рейс) Тогда
		
		Рейс = Параметры.Рейс;
				
		ТелефонДиспетчераПоДоставке = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс.Подразделение, "ТелефонДиспетчераПоДоставке");
		Если СтрДлина(СокрЛП(ТелефонДиспетчераПоДоставке))=10 Тогда
			ТелефонДиспетчераПоДоставке ="+7"+ТелефонДиспетчераПоДоставке;				
		КонецЕсли;	
		
		ТелефонВодителя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Рейс.Водитель, Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
		Если НЕ ЗначениеЗаполнено(ТелефонВодителя) Тогда
			Сообщить("У водителя "+Строка(Рейс.Водитель)+" не заполнен мобильный телефон. Сообщения будут отправляться диспетчеру по доставке!");
		КонецЕсли;
		Если СтрДлина(СокрЛП(ТелефонВодителя))=10 Тогда
			ТелефонВодителя ="+7"+ТелефонВодителя;				
		КонецЕсли;	
		
		
	    ЗаполнитьПолучателейПоРейсу(Рейс);
		
		ОбновитьСтатусНаСервере();
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПолучателейПоРейсу(Рейс)
	
	СписокДляОтправки.Загрузить(Рейс.Основания.Выгрузить());
			
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если СписокДляОтправки.Количество()>0 Тогда
		Для каждого Строка из СписокДляОтправки Цикл
			Если Строка.Выбрать Тогда
				Если Не ЕстьОтправленноеСМС(Строка.Документ) Тогда
					ОтветНаЗапрос = ОтправитьНаСервере(Строка.Документ);
					Строка.Статус = ОтветНаЗапрос.Статус;
					
					Если Не ПустаяСтрока (ОтветНаЗапрос.Ид) Тогда
						ЗаписатьИДСМСВЗаказНаДоставку(Строка.Документ,ОтветНаЗапрос.Ид);
					КонецЕсли;
				Иначе
					Сообщить("По документу " + Строка(Строка.Документ) + " СМС уже была отправлена!");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Сообщить("Нет заказов на доставку!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСтатусНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусНаСервере() 
	Если СписокДляОтправки.Количество()>0 Тогда
		Для каждого Строка из СписокДляОтправки Цикл
			ИдентификаторСообщения = Строка.Документ.СМСИД;
			Если Не ПустаяСтрока(ИдентификаторСообщения) Тогда
			Строка.Статус = ОтправкаSMS.СтатусДоставки(ИдентификаторСообщения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыбратьВсеНаСервере()
	ТЗ = СписокДляОтправки.Выгрузить();
	ТЗ.ЗаполнитьЗначения(Истина,"Выбрать");
	СписокДляОтправки.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	ВыбратьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьНаСервере()
	ТЗ = СписокДляОтправки.Выгрузить();
	ТЗ.ЗаполнитьЗначения(Ложь,"Выбрать");
	СписокДляОтправки.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура  ЗаписатьИДСМСВЗаказНаДоставку(ЗаказНаДоставку,ИдентификаторСообщения)
	ЗаказНаДоставкуОбъект =  ЗаказНаДоставку.ПолучитьОбъект();
	ЗаказНаДоставкуОбъект.СМСИД = ИдентификаторСообщения;
	ЗаказНаДоставкуОбъект.Записать();
КонецПроцедуры

&НаСервере
Функция ЕстьОтправленноеСМС(ЗаказНаДоставку)
	Возврат ?(ЗначениеЗаполнено(ЗаказНаДоставку.СМСИД),Истина,Ложь);
КонецФункции

