#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ИсправлениеДокументов.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "Начисления");

	ПараметрыВыбораСтатейИАналитик = Документы.НачисленияКредитовИДепозитов.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	#Вставка
		Док_ЗаполнитьВалютуВТЧ();
	#КонецВставки	

	НачисленияКредитовИДепозитовЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

#КонецОбласти
Процедура Док_ЗаполнитьВалютуВТЧ()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачисленияКредитовИДепозитовНачисления.Ссылка КАК Ссылка,
		|	НачисленияКредитовИДепозитовНачисления.НомерСтроки КАК НомерСтроки,
		|	НачисленияКредитовИДепозитовНачисления.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	НачисленияКредитовИДепозитовНачисления.Договор
		|ИЗ
		|	Документ.НачисленияКредитовИДепозитов.Начисления КАК НачисленияКредитовИДепозитовНачисления
		|ГДЕ
		|	НачисленияКредитовИДепозитовНачисления.Ссылка = &Ссылка
		|	И НачисленияКредитовИДепозитовНачисления.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ТабличнаяЧасть = Начисления;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТЧ = ТабличнаяЧасть.Найти(ВыборкаДетальныеЗаписи.НомерСтроки, "НомерСтроки");
			//СтрокаТЧ = ТабличнаяЧасть.Получить(ИДСтроки); 
			ПолученнаяВалюта = ВыборкаДетальныеЗаписи.Договор.ВалютаВзаиморасчетов;
			Если Не ЗначениеЗаполнено(ПолученнаяВалюта) Тогда
			  ПолученнаяВалюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);		
			КонецЕсли;
			СтрокаТЧ.ВалютаВзаиморасчетов = ПолученнаяВалюта;
		КонецЦикла;
	КонецЕсли

КонецПроцедуры

#КонецЕсли
