#Область СобытияФормы

&НаКлиенте
Процедура ИсключитьГрузы(Команда)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия 	 = Новый Структура;
	ПараметрыОткрытия.Вставить("НаименованиеГрузов", НаименованияДляИсключения);
	ОбработкаВыбораИсключенийГруза = Новый ОписаниеОповещения("ОбработкаВыбораИсключенийГруза", ЭтаФорма);
	ОткрытьФорму("Обработка.РабочееМестоПоДоставкеОтПоставщика.Форма.ФормаИсключенияГрузов", ПараметрыОткрытия, ЭтаФорма,,,, ОбработкаВыбораИсключенийГруза, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИсключенийГруза(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораИсключенийГрузаСервер(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораИсключенийГрузаСервер(Результат)
	    СвернутаяТаблицаИсключений = СвернутьТаблицуИсключений(Результат.Выгрузить());
		НаименованияДляИсключения.Загрузить(СвернутаяТаблицаИсключений);
		ОбновитьСписокДоставкиНаСервере();	 
КонецПроцедуры

Функция СвернутьТаблицуИсключений(ИсходнаяТаблица)
	ИсходнаяТаблица.Свернуть("Наименование");
	Отбор = Новый Структура("Наименование","");
	МассивПустыхСтрок = ИсходнаяТаблица.НайтиСтроки(Отбор);
	Для Каждого СтрокаМассива из МассивПустыхСтрок Цикл
    	ИсходнаяТаблица.Удалить(СтрокаМассива);
	КонецЦикла;
	Возврат ИсходнаяТаблица; 
КонецФункции
	
&НаСервере
Функция СформироватьТекстОтбораИсключенийГруза()
	ТаблицаИсключений = НаименованияДляИсключения.Выгрузить();
	Если ТаблицаИсключений.Количество() > 0 Тогда
   	 ТекстОтбора = "";
		Для Каждого Строка Из ТаблицаИсключений Цикл
			ТекстОтбора = ТекстОтбора + " Не Пулл.ЗаказНаДоставку.НаименованиеГруза ПОДОБНО ""%" + Строка.Наименование + "%"" И";
		КонецЦикла;
		ТекстОтбора = Лев(ТекстОтбора, СтрДлина(ТекстОтбора)-1);
		Возврат ТекстОтбора;
	Иначе	
		Возврат "ИСТИНА";
	КонецЕсли
КонецФункции	

&НаСервере
Процедура Инициализировать()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Основания, "МассивДокументов", Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала= НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания= КонецМесяца(ТекущаяДата());
	
	Карта= Истина;
	УстановитьВидимостьДоступность();
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ПулЗаказовПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Основания, "МассивДокументов", ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку), Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку), Истина);
	Иначе
		Инициализировать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПулЗаказовОтметкаПриИзменении(Элемент)
	ДобавитьУдалитьЗаказВРейс();
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьУдалитьЗаказВРейс()
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	
	Если ТекущаяСтрока.Отметка Тогда
		НоваяСтрока= ЗаказыВРейс.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.НомерСтроки= ЗаказыВРейс.Количество();
		
	Иначе
		Строки= ЗаказыВРейс.НайтиСтроки(Новый Структура ("ЗаказНаДоставку", ТекущаяСтрока.ЗаказНаДоставку));
		Для Каждого Строка Из Строки Цикл
			ЗаказыВРейс.Удалить(ЗаказыВРейс.Индекс(Строка));
		КонецЦикла;
		
	КонецЕсли;
	РасчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура КартаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти


#Область КомандыИСобытия

&НаКлиенте
Процедура ОбновитьСписокДоставки(Команда)
	ОбновитьСписокДоставкиНаСервере();
	ЗаказыВРейс.Очистить();
КонецПроцедуры
&НаСервере
Процедура ОбновитьСписокДоставкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	СУММА(ЗаказыКДоставкеОтПоставщикаОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ Пулл
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика.Остатки(, ) КАК ЗаказыКДоставкеОтПоставщикаОстатки
	|ГДЕ
	|	ЗаказыКДоставкеОтПоставщикаОстатки.КоличествоОстаток > 0
	|	И ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку.Подразделение = &Подразделение
	|	И ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку.ПрибытиеНаПогрузку МЕЖДУ &Дата1 И &Дата2
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пулл.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	Пулл.ЗаказНаДоставку.ПрибытиеНаВыгрузку КАК ПрибытиеНаВыгрузку,
	|	Пулл.ЗаказНаДоставку.ПрибытиеНаПогрузку КАК ПрибытиеНаПогрузку,
	|	Пулл.ЗаказНаДоставку.АдресНаВыгрузке КАК АдресНаВыгрузке,
	|	Пулл.ЗаказНаДоставку.АдресНаПогрузке КАК АдресНаПогрузке,
	|	Пулл.ЗаказНаДоставку.Вес КАК Вес,
	|	Пулл.ЗаказНаДоставку.Объем КАК Объем,
	|	Пулл.ЗаказНаДоставку.НаправлениеДоставки КАК НаправлениеДоставки,
	|	Пулл.ЗаказНаДоставку.МаксимальнаяДлина КАК МаксимальнаяДлина,
	|	Пулл.ЗаказНаДоставку.Широта КАК Широта,
	|	Пулл.ЗаказНаДоставку.Долгота КАК Долгота,
	|	Пулл.ЗаказНаДоставку.Транзит КАК Транзит,
	|	Пулл.ЗаказНаДоставку.КоличествоМест КАК КоличествоМест,
	|	Пулл.ЗаказНаДоставку.ТипУпаковки КАК ТипУпаковки,
	|	Пулл.ЗаказНаДоставку.НаименованиеГруза КАК НаименованиеГруза
	|ИЗ
	|	Пулл КАК Пулл";
	
	Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
		
	Если ЗначениеЗаполнено(Филиал) Тогда
		Запрос.УстановитьПараметр("Подразделение", Филиал);
	Иначе
		Запрос.Текст= СтрЗаменить(Запрос.Текст, "И ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку.Подразделение = &Подразделение", "");
	КонецЕсли;
		Запрос.Текст= СтрЗаменить(Запрос.Текст, "КАК Пулл", "КАК Пулл ГДЕ " + СформироватьТекстОтбораИсключенийГруза());
	РезультатЗапроса = Запрос.Выполнить();
	ПулЗаказов.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	  ОчиститьКарту(Неопределено);
КонецПроцедуры
#КонецОбласти

#Область ФункцииОбработки

&НаКлиенте
Процедура ПулЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	Док= Элементы.ПулЗаказов.ТекущиеДанные.ЗаказНаДоставку;
	Если Не Док.Пустая() Тогда 	
		ОткрытьФорму("Документ.ЗаказНаДоставкуОтПоставщика.ФормаОбъекта", Новый Структура("Ключ", Док));
	КонецЕсли;
КонецПроцедуры

Процедура УбратьРасстояние()
	Элементы.Расстояние.Заголовок= "";
	Элементы.Расстояние.Видимость= Ложь;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОснования(Ссылка)
	мОснований= Новый Массив;
	Для Каждого стрОснования Из Ссылка.Основания Цикл
		мОснований.Добавить(стрОснования.Документ);
	КонецЦикла;
	Возврат мОснований;
КонецФункции

&НаКлиенте
Процедура РасчитатьИтоги()
	Ном= 1;
	ВесИтог= 0;
	ОбъемИтог= 0;
	МаксимальнаяДлинна= 0;
	Расстояние= 0;
	ВремяВПути= 0;
	ВремяРазгрузки= 0;
	СтоимостьДоставки= 0;
	Для Каждого стрДоставки Из ЗаказыВРейс Цикл
		стрДоставки.НомерСтроки= Ном;
		Ном= Ном+1;
		ВесИтог= ВесИтог+стрДоставки.Вес;
		ОбъемИтог= ОбъемИтог+стрДоставки.Объем;
		МаксимальнаяДлинна= Макс(МаксимальнаяДлинна, стрДоставки.МаксимальнаяДлина);
		Расстояние= Расстояние+стрДоставки.Расстояние;
		ВремяВПути= ВремяВПути+стрДоставки.ВремяВПути;
		ВремяРазгрузки= ВремяРазгрузки+стрДоставки.ВремяРазгрузки;
		СтоимостьДоставки= СтоимостьДоставки+стрДоставки.СтоимостьДоставки;
	КонецЦикла;
	Элементы.ЗаказыВРейсыВес.ТекстПодвала= ВесИтог;
	Элементы.ЗаказыВРейсыОбъем.ТекстПодвала= ОбъемИтог;
	Элементы.ЗаказыВРейсыМаксимальнаяДлина.ТекстПодвала= МаксимальнаяДлинна;
	Элементы.ЗаказыВРейсыРасстояние.ТекстПодвала= Расстояние;
	Элементы.ЗаказыВРейсыВремяВПути.ТекстПодвала= ВремяВПути;
	Элементы.ЗаказыВРейсыВремяРазгрузки.ТекстПодвала= ВремяРазгрузки;
	Элементы.ЗаказыВРейсСтоимостьДоставки.ТекстПодвала= СтоимостьДоставки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если Карта Тогда 
		Элементы.ГруппаПраво.Видимость= Истина;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Истина;
	Иначе
		Элементы.ГруппаПраво.Видимость= Ложь;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОформитьДокументы

&НаКлиенте
Процедура СоздатьРейс(Команда)
	СоздатьРейсНаКлиенте(ЗаказыВРейс);
КонецПроцедуры
&НаКлиенте
Процедура СоздатьРейсНаКлиенте(ТаблицаДоставки)
	мОснований= Новый Массив;
	Для Каждого Доставка Из ТаблицаДоставки Цикл
		мОснований.Добавить(Доставка.ЗаказНаДоставку);
	КонецЦикла;	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", мОснований);
	
	ОткрытьФорму("Документ.РейсОтПоставщика.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыВРейсыПриИзменении(Элемент)
	РасчитатьИтоги();
КонецПроцедуры
#КонецОбласти

#Область КАРТА
#Область СобытияКарты
&НаКлиенте
Процедура КартаЯндексПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)//Не исползуем
	Координаты= ГеокодированиеКлиент.ПолучитьКоординатыТочки(Элементы.КартаЯндекс);
	Координаты= ГеокодированиеКлиент.ПолучитьАдресПоКоординатам(Координаты.Широта, Координаты.Долгота);
КонецПроцедуры

&НаКлиенте
Процедура Домой(Команда)
	ГеокодированиеКлиент.Домой(Элементы.КартаЯндекс, Филиал);
	УбратьРасстояние();
КонецПроцедуры

&НаКлиенте
Процедура НайтиАдресНаКарте(Команда)
	Если не ПустаяСтрока(СтрокаПоиска) Тогда
		ГеокодированиеКлиент.ПоискАдресаНаКарте(Элементы.КартаЯндекс, СтрокаПоиска);
		Координаты= ГеокодированиеКлиент.ПолучитьКоординатыПоАдресу(СтрокаПоиска);
		УбратьРасстояние();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКарту(Команда)
	ИнициализироватьКарту();
	УбратьРасстояние();
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьМаршрутRoute(Команда)
	ПараметрыМаршрута = ПолучитьМассивАдресов(ЗаказыВРейс);
	
	Элементы.КартаЯндекс.document.getElementById("WebClientOperation").value = "calcRouterPostavki(" + ПараметрыМаршрута + ")";
	Элементы.КартаЯндекс.document.getElementById("WebClient").click();
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьРасстояние(Команда)
	стрДистанция= Элементы.КартаЯндекс.document.getElementById("routeInfo").value;
	Если Не ПустаяСтрока(стрДистанция) Тогда
		мДистанций= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(стрДистанция, ";", Истина, Истина);
		
		Для Инд = 0 По ЗаказыВРейс.Количество() - 1 Цикл
			ТекСтрока= ЗаказыВРейс[Инд];
			Попытка
				ТекСтрока.Расстояние= Число(мДистанций[Инд])/1000;
			Исключение
				ТекСтрока.Расстояние= 0;
			КонецПопытки;
		КонецЦикла;
		РасчитатьИтоги();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ИнициализацияКарты

&НаКлиенте
Процедура ИнициализироватьКарту()
	КартаЯндекс= "";
	КартаЯндекс= ПолучитьТекстМакета();
	
	ГеокодированиеКлиент.УстановитьНачальныеКоординаты(Филиал, КартаЯндекс);
КонецПроцедуры
&НаСервере
Функция ПолучитьТекстМакета()
	Макет= ПолучитьОбщийМакет("МакетЯндексКарты");
	стрМакет = Макет.ПолучитьТекст();
	
	Документы.ЗаказНаДоставкуОтПоставщика.УбратьПодстановкиИзКода(стрМакет);	

	Возврат стрМакет;
КонецФункции

#КонецОбласти


#Область Геокодирование
&НаКлиенте
Функция ПолучитьМассивАдресов(ТаблицаТочек)
	
	Результат = "[""";
	
	Для Ин = 0 По ТаблицаТочек.Количество() - 1 Цикл
		Результат = Результат + ТаблицаТочек[ин].АдресНаПогрузке + """,""";
	КонецЦикла;
	
	Результат= Результат +  ТаблицаТочек[ТаблицаТочек.Количество()-1].АдресНаВыгрузке + """]";
	
	Возврат Результат;
КонецФункции

#КонецОбласти
#КонецОбласти
