&ИзменениеИКонтроль("ТаблицаОстатковРеализованныхТоваров")
Процедура Док_ТаблицаОстатковРеализованныхТоваров(ДокументОбъект, МенеджерВременныхТаблиц, ПараметрыЗаполненияВидовЗапасов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
	|	&ТекстПоляТаблицаТоваровНоменклатураПартнера_ КАК НоменклатураПартнера	
	|ПОМЕСТИТЬ СгруппированнаяТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК Ссылка,
	|	КлючиАналитикиУчетаНоменклатуры.КлючАналитики КАК АналитикаУчетаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = КлючиАналитикиУчетаНоменклатуры.Номенклатура
	|			И ТаблицаТоваров.Характеристика = КлючиАналитикиУчетаНоменклатуры.Характеристика
	|			И (&ЭтоВозврат
	|				ИЛИ (НЕ &ЭтоВозврат
	|					И ТаблицаТоваров.Серия = КлючиАналитикиУчетаНоменклатуры.Серия))
	|ГДЕ
	|	ТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.Ссылка КАК ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТЧВидыЗапасов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ПОМЕСТИТЬ РеализованныеТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	(ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	0 КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И (ТЧВидыЗапасов.ДокументРеализации, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ -ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ТЧВидыЗапасов
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК ТЧВидыЗапасов
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ -ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.ДокументРеализации, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.Ссылка КАК ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТЧВидыЗапасов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатурыОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ДокументРеализации					КАК ДокументРеализации,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки	КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	КлючиАналитики.Номенклатура							КАК Номенклатура,
	|	КлючиАналитики.Характеристика						КАК Характеристика,
	|	КлючиАналитики.Назначение							КАК Назначение,
	|	КлючиАналитики.Серия								КАК Серия,
	|	КлючиАналитики.МестоХранения						КАК МестоХранения,
	|	ТаблицаТоваров.ВидЗапасов							КАК ВидЗапасов,
	|	ТаблицаТоваров.КорВидЗапасов						КАК КорВидЗапасов,
	|	ТаблицаТоваров.НомерГТД								КАК НомерГТД,
	|	СУММА(ТаблицаТоваров.Количество)					КАК Количество,
	|	СУММА(ТаблицаТоваров.КоличествоПоРНПТ)				КАК КоличествоПоРНПТ,
	|	СУММА(ТаблицаТоваров.СуммаНДС)						КАК СуммаНДС
	|ПОМЕСТИТЬ РеализованныеТоварыСгруппированная
	|ИЗ
	|	РеализованныеТовары КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки = КлючиАналитики.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.ДокументРеализации,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки,
	|	КлючиАналитики.Номенклатура,
	|	КлючиАналитики.Характеристика,
	|	КлючиАналитики.Назначение,
	|	КлючиАналитики.Серия,
	|	КлючиАналитики.МестоХранения,
	|	ТаблицаТоваров.ВидЗапасов,
	|	ТаблицаТоваров.КорВидЗапасов,
	|	ТаблицаТоваров.НомерГТД
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаТоваров.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	РеализованныеТовары.Серия						КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ПОМЕСТИТЬ ТаблицаТоваровДляСоединения
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И (КлючиАналитики.Серия = РеализованныеТовары.Серия
	|				ИЛИ КлючиАналитики.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ГДЕ
	|	&ЭтоВозврат
	|	И НЕ РеализованныеТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	РеализованныеТовары.Серия						КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И (КлючиАналитики.Серия = РеализованныеТовары.Серия
	|				ИЛИ НЕ КлючиАналитики.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ГДЕ
	|	&ЭтоВозврат
	|	И РеализованныеТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	КлючиАналитики.Серия							КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И КлючиАналитики.Серия = РеализованныеТовары.Серия
	|ГДЕ
	|	НЕ &ЭтоВозврат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация КАК Организация,
	|	ТаблицаДанныхДокумента.Склад КАК Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.Номенклатура КАК Номенклатура,
	|	РеализованныеТовары.Характеристика КАК Характеристика,
	|	РеализованныеТовары.Серия КАК Серия,
	|	РеализованныеТовары.МестоХранения КАК СкладОтгрузки,
	|	РеализованныеТовары.Назначение КАК Назначение,
	|	РеализованныеТовары.ДокументРеализации КАК ДокументРеализации,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасовВладельца,
	|	РеализованныеТовары.ВидЗапасов КАК ВидЗапасовОтгрузки,
	|	РеализованныеТовары.КорВидЗапасов КАК КорВидЗапасов,
	|	РеализованныеТовары.НомерГТД КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка) КАК Сделка,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасовПолучателя,
	|	НЕОПРЕДЕЛЕНО КАК ДатаПоступления,
	|	СУММА(РеализованныеТовары.Количество) КАК КоличествоОстаток,
	|	СУММА(ВЫРАЗИТЬ(РеализованныеТовары.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))) КАК КоличествоПоРНПТОстаток,
	|	0 КАК СуммаОстаток,
	|	СУММА(РеализованныеТовары.СуммаНДС) КАК СуммаНДСОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровДляСоединения КАК СгруппированнаяТаблицаТоваров
	|		ПО РеализованныеТовары.Номенклатура = СгруппированнаяТаблицаТоваров.Номенклатура
	|			И РеализованныеТовары.Характеристика = СгруппированнаяТаблицаТоваров.Характеристика
	|			И РеализованныеТовары.Серия = СгруппированнаяТаблицаТоваров.СерияДляСоединения
	|			И ВЫБОР
	|				КОГДА &ЭтоКорректировкаРеализации
	|					ТОГДА РеализованныеТовары.МестоХранения = СгруппированнаяТаблицаТоваров.МестоХранения
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|			И РеализованныеТовары.ДокументРеализации = СгруппированнаяТаблицаТоваров.ДокументРеализации
	|			И (
	|				(&ЭтоКорректировкаРеализации
	|					И РеализованныеТовары.Назначение = СгруппированнаяТаблицаТоваров.Назначение)
	|				ИЛИ
	|				(НЕ &ЭтоКорректировкаРеализации
	|					И (РеализованныеТовары.Назначение = СгруппированнаяТаблицаТоваров.Назначение
	|						ИЛИ СгруппированнаяТаблицаТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						ИЛИ РеализованныеТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)))
	|				)
	|			И (СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхДокумента.Склад,
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.Серия,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.Назначение,
	|	РеализованныеТовары.МестоХранения,
	|	РеализованныеТовары.НомерГТД,
	|	ТаблицаДанныхДокумента.Организация,
	|	РеализованныеТовары.ДокументРеализации,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера,
	|	РеализованныеТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	РеализованныеТовары.ВидЗапасов,
	|	РеализованныеТовары.КорВидЗапасов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РеализованныеТовары.Количество) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация,
	|	ТаблицаДанныхДокумента.Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Характеристика,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Серия,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Назначение,
	|	ТаблицаВидыЗапасов.ДокументРеализации,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.КорВидЗапасов,
	|	ТаблицаВидыЗапасов.НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаВидыЗапасов.Количество,
	|	ВЫРАЗИТЬ(ТаблицаВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)),
	|	0,
	|	ТаблицаВидыЗапасов.СуммаНДС
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК СгруппированнаяТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|		ПО СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры = ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры
	|			И СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|			И ТаблицаВидыЗапасов.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализованныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СгруппированнаяТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализованныеТоварыСгруппированная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоваровДляСоединения";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЭтоВозврат",
								ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента"));
	Запрос.УстановитьПараметр("ЭтоКорректировкаРеализации",
								ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаРеализации"));
	
	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаТоваровНоменклатураПартнера_",
																"ТаблицаТоваров",
																"НоменклатураПартнера",
																"ТаблицаТоваров.НоменклатураПартнера",
																"ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)");
	
	#Вставка															
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
		Если ТипЗнч(ДокументОбъект.ЧекККМ)=Тип("ДокументСсылка.ЧекККМ") Тогда
			СкладОтгрузкиРозницы=ДокументОбъект.ЧекККМ.Склад;
			Запрос.УстановитьПараметр("СкладОтгрузкиРозницы", СкладОтгрузкиРозницы);
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)",
			"	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя) 
			| и ТЧВидыЗапасов.АналитикаУчетаНоменклатуры.МестоХранения=&СкладОтгрузкиРозницы ");
		КонецЕсли;	
	Конецесли;
	#КонецВставки															
	Запрос.Выполнить();
КонецПроцедуры

