#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СторноПоАннулированнымЛистам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"СторноПоАннулированнымЛистам", НСтр("ru = 'Сторно по аннулированным листам'"), СформироватьПечатнуюФорму(МассивОбъектов));
	КонецЕсли;
КонецПроцедуры

Функция ЗапросФормированиеПечатнойФормы(СсылкаНаДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Номер КАК Номер,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Дата КАК Дата,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Автор КАК Автор,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Комментарий КАК Комментарий,
	|	СторноПоАннулированнымЛистамНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(СторноПоАннулированнымЛистамНачисления.Сторно) КАК СуммаСторно,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка КАК Ссылка,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.СторноПоАннулированнымЛистам.Начисления КАК СторноПоАннулированнымЛистамНачисления
	|ГДЕ
	|	СторноПоАннулированнымЛистамНачисления.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Дата,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Автор,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Комментарий,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка.Номер,
	|	СторноПоАннулированнымЛистамНачисления.Сотрудник,
	|	СторноПоАннулированнымЛистамНачисления.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СторноПоАннулированнымЛистамНачисления.Сотрудник.Наименование
	|ИТОГИ
	|	СУММА(СуммаСторно)
	|ПО
	|	Ссылка" ;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	
	Возврат Выборка;
КонецФункции

Функция СформироватьПечатнуюФорму  (СсылкаНаДокумент) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетОбработки = ПолучитьМакет("СторноПоАннулированнымЛистам");
	
	ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("Заголовок");
	ОбластьНачисленияШапка = МакетОбработки.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = МакетОбработки.ПолучитьОбласть("Начисления");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	
Для каждого Ссылка из СсылкаНаДокумент Цикл			
		Выборка = ЗапросФормированиеПечатнойФормы(Ссылка.Ссылка);
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьНачисленияШапка.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьНачисления.Параметры,Выборка);
	 		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,Выборка);	
			ТабличныйДокумент.Очистить();

				
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок,Выборка.Уровень());


		ТабличныйДокумент.Вывести(ОбластьНачисленияШапка);
		Ном=1;
		ВыборкаНачисления = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ОбластьНачисления.Параметры.НомерСтроки= Ном;  
			ТабличныйДокумент.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
			Ном=Ном+1;
		КонецЦикла;
	

		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьПодвал);

			КонецЦикла;
		КонецЦикла;
	Возврат ТабличныйДокумент;

КонецФункции

#КонецЕсли

